{
  "bill_id": 106,
  "slug": "national-insurance-board-76-million",
  "title": "National Insurance Board $76 Million",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/6af08b9ebd97042d1be40a9f5c641221.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-08-12",
  "first_reading": "2015-08-26",
  "second_reading": "2015-08-11",
  "gazette_date": "2015-08-26",
  "passed_date": "2015-08-26",
  "markdown": "2015-08-05\nRESOLUTION NO.\nPARLIAMENT\nWHEREAS by section 2 of the Special Loans Act, Cap. 105 the Government is authorised from time to time to borrow from any bank, corporation, company or other institution sums of money not exceeding in the aggregate BDS$2,500,000,000 on such terms as may be agreed upon between the Government and the lender of any such sums of money;\nAND WHEREAS by section 3 of the said Act it is provided that any money borrowed under the authority of the Act shall be appropriated and applied to such purposes as Parliament may approve by resolution and that such money and any interest payable thereon is charged upon the general revenues and assets of Barbados;\nAND WHEREAS the Government considers it necessary to borrow the sum of BDS$76 million from the National Insurance Board, a body corporate established by and in accordance with the provisions of the National Insurance and Social Security Act, Cap. 47 to finance the construction of a new Police Station at Hastings in the parish of Christ Church, a Public Centre Complex at Cane Garden in the parish of Saint Thomas, a Police Headquarters at the Pine in the parish of Saint Michael, a Police Station and Magistrate’s Court at Boarded Hall in the parish of Saint George, the refurbishment of the former Barbados Water Authority Headquarters at the Pine in the parish of Saint Michael and the Elaine Scantlebury Home at Belleplaine in the parish of Saint Andrew and the repairs to the Old Male Barracks at the Central Police Station and the former Black Rock Police Station in the parish of Saint Michael;\nAND WHEREAS the said sum of BDS$76 million is within the authorised borrowing limit given to the Government under section 2 of the said Act;\nBE IT RESOLVED therefore that Parliament approve the borrowing of the said sum of BDS$76 million from the National Insurance Board to finance the construction, refurbishment and repair projects on the terms and conditions contained in the Agreement, the main provisions of which are set out in the Schedule.\nAPPROVED by the House of Assembly this day of F Two thousand and fifteen,\nSpeaker\nAPPROVED by the Senate this\nday of\nTwo thousand and fifteen,\nPresident\nF\nSCHEDULE\nTERMS AND CONDITIONS\nFacility:\nTerm loan.\nBorrower: Government of Barbados.\nLender: National Insurance Board.\nAmount: BDS$76,000,000.00.\nPurpose: To finance the construction of new citizen security facilities and the refurbishment and repair of other facilities.\nTerm: Twenty-seven (27) years.\nRepayment: @ Principal plus interest shall be repaid over the term of twenty-seven (27) years. There shall be a moratorium of two (2) years on the principal sum drawn down in respect of the new constructions at Hastings, Cane Garden, the Pine and Boarded Hall while repayment shall commence immediately on completion of the refurbishment or repairs in respect of the other projects. The principal sum plus interest shall be repaid over the term of the facility in accordance with the Schedules of Amortization which shall vary to accommodate the date of the drawdown in respect of each of the projects and which shall be presented by the Lender to the Borrower on the date of each drawdown.\n(ii) The Borrower may make early repayment of the principal sum and interest accrued at the date of early repayment provided it gives written notice to the Lender on the instalment date prior to the instalment date for which early repayment is intended.\nInterest Rate:\n@ The rate of interest to be applied to the principal sum outstanding shall be 6% per annum over the term of the facility.\nInterest Rate (Concl'd):\n(ii) Interest shall be calculated on the basis of the actual number of days elapsed and a 365 day year.\n(iii) If the Borrower fails to pay interest payable under the loan facility, the Lender reserves the right to add such interest to the loan at any time without notice to the Borrower.\nDisbursements: The principal sum shall be disbursed to the Borrower in the amount of seventy- six million dollars Barbados Currency (BDS$76,000,000.00) as set out in the Schedules of Amortization.\nThe Borrower shall ensure that the proceeds of the loan described in the recital of the Agreement are used exclusively for those purposes.\nEvents of Default: The Lender shall consider the Borrower to be in default and the loan (inclusive of any interest accrued and unpaid on the principal sum occurring after the execution of the Agreement and added to the principal sum) shall become immediately repayable and all unpaid interest which has accrued shall become immediately repayable:\n(i) _ if the Borrower fails on the due dates to repay any part of the principal sum or the interest payable pursuant to the Agreement and the Lender by notice in writing to the Borrower demands immediate repayment of the loan or the balance of the loan then outstanding; or\n(ii) if the Borrower commits a breach of Clause 6 of the Agreement; or\n(iii) if the Borrower cross defaults in respect of other indebtedness or obligations guaranteed by the Borrower; or\n(iv) if the Agreement is or becomes (or is alleged to be) unlawful or unenforceable in a material respect.\nIn the event of a default in respect of the non-payment of the principal sum or any part thereof or a breach of clause 6 of the Agreement the Lender shall consider the loan due and immediately payable.\nCovenants:\nRepresentations. and Warranties:\nUsual and customary for a transaction of this nature for so long as any part of the loan or any interest due in respect of the loan is outstanding including but not limited to the following:\n(a) to at all times carry on and conduct the Borrower’s business in a proper and efficient manner;\n(b) not to create, assume or suffer to exist any security interest on any part of the Borrower’s assets, ranking or purporting to rank in priority to or pari passu with the loan, provided that this covenant shal{ not apply to nor operate to prevent the giving of any security in the ordinary course of the business of the Borrower;\n(c) furnish the Lender with details of any litigation, arbitration or administration proceedings against or involving the Borrower which are likely to have a material adverse effect on the Borrower as soon as the same are instituted (or, to the knowledge of the Borrower, threatened)\n(d) furnish the Lender with details of any occurrence or circumstance of which the Borrower becomes aware which would adversely\naffect the ability of the Borrower to perform its obligation under the Agreement.\nThe Borrower is deemed to give standard representations and warranties as are customary for transactions of this nature including but not limited to the following:\n(a) the Borrower has the power and authority to execute, deliver and perform its obligations under the Agreement and all necessary action has been taken (and not revoked) to authorise the execution, delivery and performance of the Agreement;\n(b) the Agreement constitutes valid and binding obligations of the Borrower, enforceable in accordance with its terms;\nRepresentations and Warranties (Conc}'d):\nConditions Precedent;\n(c) the Borrower is not in default under any other agreement to which it is party or by which it is bound, which default would have a material adverse effect upon the operation or condition (financial or otherwise) of the Borrower or a material impairment of the ability of the Borrower to perform its obligation under this Agreement;\n(d) the execution, delivery and performance by the Borrower of the Agreement are not in conflict with any law, rule, regulation, order or directive applicable to the Borrower of which the Borrower is aware or any agreement or undertaking to which the Borrower is a party or by which the Borrower may be bound;\n(e) all factual information supplied to the Lender in contemplation or for the purpose of the Agreement was true and accurate in all material respects as at the date of the Agreement and the Borrower did not omit anything material, nor has any change occurred since the date on which such information was supplied which renders the same untrue or misleading in any material respect, and all projections and statements of belief and opinion given by the Borrower to the Lender were made honestly and in good faith after careful enquiry and remain valid.\nUsual and customary for this type of transaction, including but not limited to the following:\n(a) the liability of the Lender to disburse the loan shall be subject to the condition that the Borrower has complied with the terms and conditions stipulated in the Agreement;\n() disbursement of the loan will be made conditional upon the Borrower and the Lender receiving all necessary statutory and regulatory approvals to enter into the loan which include, but are not limited to, approval required by the Special Loans Act, Cap. 105 of the Laws of Barbados together with the production of the Certificate of Loan provided for by section 4 of the said Act;\nConditions Precedent (Concl'd):\n(c) disbursement of the loan proceeds with respect to the projects at Belleplaine, Cane Garden, Hastings and the Pine will be made conditional upon the lease of the following properties to the Lender:\n(i) approximately 7,208 square metres at Belleplaine, Saint Andrew;\n(ii) approximately 12,140 square metres at Cane Garden, Saint Thomas;\n(iii) approximately 4,350.1 square metres at Hastings, Christ Church; and\n(iv) approximately 16,187 square metres at the Pine, Saint Michael;\n(d) the liability of the Lender to disburse the loan shall be subject to the condition that the Borrower has complied with the procedure set out in the Agreement;\n(e) receipt by the Lender of all necessary internal approvals;\n(f) receipt by the Borrower of al! necessary governmental and regulatory approvals;\n(g) complete and proper execution of all documentation, including the Agreement between the parties, to the satisfaction of the Lender; and\n(h) _ the Borrower shall provide documentary evidence to the satisfaction of the Lender that the Borrower has received due authority to enter into the Agreement.\nTaxes: All payments of principal, interest, fees and other payments to be made by the Borrower are to be made free and clear of and without deduction of any taxes, withholdings, income taxes, levies, charges or other taxes imposed by or within Barbados.\nLaw: The Agreement shall be governed in all respects by the Laws of Barbados.\nADDENDUM\nThis Resolution seeks the approval of Parliament for the borrowing of BDS$76 million, a sum which is within the limit of the Special Loans Act, Cap. 105, from the National Insurance Board on the terms and conditions contained in the Agreement, the main provisions of which are set out in the Schedule to this Resolution.\nThe proceeds of the loan will be used to finance the construction of new citizen security facilities and the refurbishment and repair of other facilities.\n"
}