{
  "bill_id": 107,
  "slug": "the-shops-bills-2015",
  "title": "The Shops Bills 2015",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b662d3ce3e9b2385213a86ec96ee56e9.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2015-10-22",
  "first_reading": "2015-10-21",
  "second_reading": null,
  "gazette_date": "2015-10-21",
  "passed_date": "2015-10-21",
  "markdown": "2015-07-02\n\nOBJECTS AND REASONS\n\nThis Bill would repeal and replace the Shops Act, Cap. 356A in order to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nmake new provision for the opening and closing hours of shops;\n\nmake better provision for the terms and conditions of service under\nwhich shop assistants are employed;\n\nmake better provision for health and safety standards in shops; and\n\nextend certain provisions of this Act to cinemas and laundries and to\nbusinesses  providing  floral  services,  barber  services,  beauty  and\ncosmetic services as well as businesses providing betting and gaming\nservices.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nINTERPRETATION AND APPLICATION\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\nShort title\n\nInterpretation\n\nApplication\n\nPART II\n\nOPENING AND CLOSING OF SHOPS\n\nOpening of shops\n\nFamily shops\n\nPART III\n\nWORKING HOURS AND WAGES OF SHOP ASSISTANTS\n\n6.\n\nWorking hours and wages of shop assistants\n\nPART IV\n\nHEALTH AND SAFETY REQUIREMENTS\n\n7.\n\n8.\n\nSeats for shop assistants\n\nFacilities for eating\n\n\f3\n\n9.\n\nFirst aid supplies\n\n10.\n\nSupply of drinking water\n\n11.\n\nSupply of lavatories and sanitary facilities\n\n12.\n\nMeans of access\n\n13.\n\nVentilation\n\n14.\n\nEmployment of shop assistants at night\n\n15.\n\nAdequacy of facilities\n\n16.\n\nDisplay of information for employees\n\nPART V\n\nFIRE SAFETY REQUIREMENTS\n\n17.\n\nFire safety certificate\n\n18.\n\nFire safety and prevention\n\n19.\n\nFire safety plan\n\n20.\n\nBuilding requirements for fire safety\n\n21.\n\nEnforcement of fire safety requirements\n\nPART VI\n\nENFORCEMENT OF ACT\n\n22.\n\nEntry and inspection\n\n\f4\n\n23.\n\nProtection of Chief Labour Officer and staff\n\n24.\n\nExamination of persons\n\n25.\n\nEvidence of employment\n\n26.\n\nLiability for wages\n\n27.\n\nOffence re shop assistants\n\n28.\n\nGeneral offence\n\n29.\n\nDiscrimination offence\n\n30.\n\nGeneral penalty\n\n31.\n\nProsecutions\n\nPART VII\n\nOFFENCES\n\n32.\n\nPowers of the Court on conviction of the occupier\n\nPART VIII\n\nGENERAL\n\n33.\n\nRegulations\n\n34.\n\nRepeal of Cap. 356A etc.\n\n\f5\n\nFIRST SCHEDULE\n\nShops which are not subject to any opening hours\n\nSECOND SCHEDULE\n\nNotice under the Shops Act, 2015-\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to repeal and replace the Shops Act to make better provision with\nrespect to the opening and closing hours of shops, the terms and conditions\nunder which persons are employed in shops and certain other businesses, and\nwith respect to health and safety standards in shops and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f8\n\nPART I\n\nINTERPRETATION AND APPLICATION\n\nShort title\n\n1.\n\nThis Act may be cited as the Shops Act, 2015.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Chief Fire Officer” includes any member of the Barbados Fire Service;\n\n“Chief Labour Officer” includes the Deputy Chief Labour Officer and any other\n\nLabour Officer;\n\n“closed  day”  means  Good  Friday,  Easter  Sunday,  Independence  Day  and\n\nChristmas Day.\n\n“Independence Day” in relation to closed day means November 30th, but where\nNovember  30th  is  a  Sunday,  the  closed  day  shall  be  the  following  day,\nDecember 1st.\n\n“members  of  the  occupier’s  family”  means  the  spouse,  father,  mother,\ngrandfather, grandmother, stepfather, stepmother, son, daughter, grandson,\ngranddaughter, stepson, stepdaughter, brother or sister of the occupier;\n\n“night” means the period commencing from 23:00 hours on any day to 07:00\n\nhours on the following day;\n\n“occupier” means the owner of the business carried on in any shop and includes\nany person for the time being having immediate control over a shop;\n\n“public holiday” means any day that is a public holiday by virtue of section 3 of\n\nthe Public Holidays Act, Cap. 352;\n\n\f“shop”\n\n9\n\n(a)\n\nmeans, subject to 3(2), any premises or place in which a person\n\n(i)\n\n(ii)\n\nconducts, manages or carries on any retail or wholesale trade or\nbusiness; or\n\nconducts business by providing services in respect of the sale or\nhire of commodities,\n\nwhether  or  not  the  business  is  conducted,  managed  or  carried  on  to  the\nexclusion of, or in addition to, any other business; and\n\n(b)\n\nincludes any place used for the storage of goods, the receipt of orders\nfor  goods,  or  the  despatch  or  delivery  of  goods  dealt  with  in  the\nbusiness;\n\n“shop assistant” means any person, except a member of the occupier’s family\n\ndirectly or indirectly,\n\n(a)\n\n(b)\n\nemployed in operations carried on for the purpose of the sale or hire of\narticles; or\n\nemployed in connection with the trade or business of a shop, including\nclerical or other office work;\n\n“spouse” includes\n\n(a)\n\n(b)\n\na woman who is living with a man as his wife;\n\na man who is living with a woman as her husband;\n\n“week” means a period of 7 consecutive days.\n\nApplication\n\n3.(1)\nThe  terms  and  conditions  of  service  prescribed  in  Part  III  of  this\nAct  apply,  with  the  necessary  changes,  to  employees  of  the  following\nbusinesses:\n\n(a)\n\ncinemas;\n\n\f10\n\n(b)\n\nlaundries; and\n\n(c)\n\nbusinesses providing betting and gaming services.\n\nFor the purposes of subsection (1), “employee” means a person directly\n\n(2)\nemployed to provide services for customers of the business.\n\nThe health and safety standards prescribed in Part IV of this Act apply,\n\n(3)\nwith the necessary changes, to employees of the following businesses:\n\n(a)\n\n(b)\n\n(c)\n\ncinemas;\n\nlaundries;\n\nbusinesses providing betting and gaming services;\n\n(d)\n\nbusinesses providing floral services;\n\n(e)\n\n(f)\n\nbusinesses providing barber services; and\n\nbusinesses providing beauty and cosmetic services.\n\nThe Minister may by order amend subsection (1) or (3) for the purpose of\n\n(4)\nextending the application of this Act to any business.\n\nThe Minister may by order exempt any shop from the application of this\n\n(5)\nAct or any enactment made under this Act.\n\n(6)\n\nAn order made under this section is subject to negative resolution.\n\nPART II\n\nOPENING AND CLOSING OF SHOPS\n\nOpening of shops\n\n4.(1)\nSubject to subsections (4) and (5), a shop may be opened for business\nfrom 7:00 hours on Mondays continuously through to 22:00 hours on Sundays\nexcept on a closed day.\n\n(2)\n\nThe Minister may by order amend the hours specified in subsection (1).\n\n\f11\n\n(3)\n\nAn order made under subsection (2) is subject to negative resolution.\n\n(4)\nThe Chief Labour Officer may, on the application of the occupier, grant\nthat occupier a licence on such conditions as may be specified by the Chief Labour\nOfficer, authorising the occupier to open his shop for business on a closed day.\n\nNotwithstanding subsections (1) and (4), where the occupier engages in\n(5)\nany of the businesses specified in the First Schedule, the shop is not subject to\nthe opening hours specified in subsection (1) and may be opened for business on\na closed day.\n\n(6)\n\nThe Minister may by order amend the First Schedule.\n\nNotwithstanding anything contained in this section, the occupier of a shop\n(7)\nmay open that shop for the purpose of cleaning the shop and to allow preparatory\nwork to be carried out before the opening hour and after the closing hour specified\nin this section; but no customers shall be allowed in the shop, and the doors of\nthe shop shall be kept closed.\n\nFamily shops\n\n5.\nof the occupier’s family are employed.\n\nSections 4, 6, 7 and 16 do not apply to a shop in which only members\n\nWORKING HOURS AND WAGES OF SHOP ASSISTANTS\n\nPART III\n\nWorking hours and wages of shop assistants\n\n6.(1)\nThe number of hours in any one week, excluding intervals for meals,\nduring which a shop assistant may be required to work in a shop shall not exceed\n40.\n\n(2)\n\nSubject to subsection (6), no shop assistant shall be required to work\n\n(a)\n\non any day for more than 4½ consecutive hours without an interval of\none hour for mealtime and for more than 8 hours in the aggregate to\n\n\f12\n\nrun  continuously  from  the  time  he  commences  work,  but  excluding\nintervals for meals;\n\n(b)\n\nunless that shop assistant is given an interval of not less than 12 hours\noff between each shift;\n\n(c)\n\nfor more than five days in a week.\n\nIn  reckoning  the  number  of  hours  during  which  a  shop  assistant  has\n(3)\nworked in any shop in a week or on any day for the purposes of this section,\naccount must not be taken of any extended hours during which that shop assistant\nundertakes voluntarily to be employed and for which the shop assistant is paid\nat a rate of pay specified in subsection (4) (a) or (b), as the case may be.\n\n(4)\n\nWhere a shop assistant works\n\n(a)\n\n(b)\n\non any public holiday or day-off, that shop assistant is entitled to be\npaid twice as much as his ordinary rate;\n\novertime, that shop assistant is entitled to be paid time and one half that\nshop assistant’s ordinary rate.\n\nThe occupier shall keep a record for each week, which shall be signed by\n\n(5)\nhim, showing in respect of every shop assistant\n\n(a)\n\n(b)\n\n(c)\n\nthe period of employment during each day;\n\nthe number of hours that the shop assistant worked during that week;\n\nthe times at which intervals for meals were allowed and the duration\nof each interval;\n\n(d)\n\nthe wages paid for normal work during that week; and\n\n(e)\n\nthe wages paid for overtime work during that week.\n\n(6)\n\nNo shop assistant shall be required without his consent,\n\n(a)\n\n(b)\n\nto work overtime; or\n\nto work on the day he observes as the day of religious worship.\n\n\f13\n\nAn  occupier  who  dismisses  or  otherwise  penalises  a  shop  assistant  for\n\n(7)\nrefusing\n\n(a)\n\n(b)\n\nto work overtime; or\n\nto work on the day the shop assistant observes as the day of religious\nworship,\n\nis  guilty  of  an  offence  and  liable  on  summary  conviction  to  a  fine  of\n$50 000 or to imprisonment for three years or to both.\n\nIn a prosecution under subsection (7) it is for the occupier to prove that the\n(8)\nshop assistant was not dismissed or otherwise penalised as the case may be for\nrefusing\n\n(a)\n\n(b)\n\nto work overtime; or\n\nto work on the day the shop assistant observes as the day of religious\nworship.\n\nPART IV\n\nHEALTH AND SAFETY REQUIREMENTS\n\nSeats for shop assistants\n\n7.(1)\nThe occupier of a shop shall, in every room where shop assistants are\nemployed, provide not less than one seat for every 3 shop assistants employed\ntherein, and where there are less than 3 shop assistants employed in a room, the\noccupier shall provide at least one seat.\n\nThe occupier carrying on business in a shop referred to in subsection (1)\n\n(2)\nshall\n\n(a)\n\n(b)\n\npermit the shop assistants to make use of the seats whenever the use of\nthe seats does not interfere with their work; and\n\ngive  notice  in  the  form  set  out  in  the  Second  Schedule  to  the  shop\nassistants that they are entitled to use the seats.\n\n\f14\n\n(3)\nWhere, in addition to any other shop assistants, cashiers are employed in\na shop, the occupier shall, in addition to the seats provided pursuant to subsection\n(1), provide one seat for each cashier employed in the shop.\n\nFacilities for eating\n\nSubject to subsections (2) and (3), every occupier carrying on business\n8.(1)\nin  a  shop  in  which  5  shop  assistants  or  more  are  employed  shall  provide  an\nadequate room for the eating of meals by those shop assistants.\n\nWhere there are less than 5 shop assistants employed in a shop in which\n(2)\nno room is provided for the eating of meals, the occupier shall separate an area\nof the shop by a screen for the eating of meals by those shop assistants.\n\nIn the case of shopping malls, the owner of the mall shall provide adequate\n\n(3)\nfacilities for the eating of meals by shop assistants employed at the mall.\n\n(4)\n\nThe Chief Labour Officer\n\n(a)\n\n(b)\n\nshall determine whether the facilities provided pursuant to this section\nfor the eating of meals are adequate; and\n\nshall,  where  he  determines  that  the  facilities  are  inadequate,  give\ndirections to the occupier or in the case of a mall, the owner, for the\npurpose of making the facilities adequate.\n\nWhere a direction is given by the Chief Labour Officer under subsection\n(5)\n(4), the occupier or owner of the mall as the case may be shall comply with the\ndirections.\n\nFirst aid supplies\n\n9.\nWhere any shop assistant is employed in a shop, the occupier shall\nprovide a first aid kit containing such first aid supplies as the Chief Labour Officer\non the advice of the Chief Medical Officer may direct.\n\n\f15\n\nSupply of drinking water\n\nThe occupier shall provide an adequate supply of drinking water free\n10.\nof cost for the use of shop assistants in the room or area set aside for the taking\nof meals by shop assistants.\n\nSupply of lavatories and sanitary facilities\n\n11.(1)\nassistants and other sanitary facilities for the washing and drying of hands.\n\nThe occupier shall provide an adequate number of lavatories for shop\n\nIn  the  case  of  shopping  malls,  the  owner  of  the  mall  shall  provide  an\n(2)\nadequate number of lavatories for the use of shop assistants employed at the mall\nas well as sanitary facilities for the washing and drying of hands.\n\nThe  occupier  shall  allow  shop  assistants  to  use  the  lavatory  and  other\n\n(3)\nsanitary facilities referred to in subsection (1) when necessary.\n\nMeans of access\n\n12.\nThe occupier shall provide a safe means of access to every place where\nshop assistants work and shall to the satisfaction of the Chief Labour Officer,\nmaintain those means of access.\n\nVentilation\n\n13.\nmaintained in the shop.\n\nThe occupier shall ensure that adequate ventilation is provided and\n\nEmployment of shop assistants at night\n\n14.(1)\nNo shop assistant shall be employed in a shop during the night unless\nthe occupier obtains a certificate from the Chief Labour Officer permitting him\nto do so.\n\n\f16\n\nThe  Chief  Labour  Officer  shall,  before  issuing  a  certificate  under\n\n(2)\nsubsection (1) satisfy himself that the occupier of the shop\n\n(a)\n\nhas made adequate arrangements for transporting each employee to and\nfrom the place of work at night where adequate public transportation\nis not available;\n\n(b)\n\nhas put in place adequate security measures for the safety of employees\nworking at night.\n\nAdequacy of facilities\n\n15.(1)\n\nThe Chief Labour Officer\n\n(a)\n\n(b)\n\nshall  determine,  after  consultation  with  the  Chief  Medical  Officer\nwhere appropriate, whether the facilities provided pursuant to sections\n7 to 13 are adequate; and\n\nshall,  where  he  determines  that  the  facilities  are  inadequate,  give\ndirections  to  the  occupier  for  the  purpose  of  making  the  facilities\nadequate.\n\nWhere  it  appears  to  the  Chief  Labour  Officer  that  there  is  any  sanitary\n(2)\ndefect or nuisance in any shop or in the vicinity of any shop, he shall give notice\nthereof to the Chief Medical Officer; and the Chief Medical Officer shall give\nsuch directions as he considers appropriate to the occupier to rectify the situation.\n\nDisplay of information for employees\n\n16.(1)\nconspicuous place in the shop for the information of employees:\n\nThe  occupier  shall  keep  the  following  documents  exhibited  in  a\n\n(a)\n\n(b)\n\n(c)\n\na copy of sections 6 and 7 of this Act;\n\na copy of the notice referred to in section 7 (2)(b);\n\na  list,  signed  by  the  occupier,  of  the  names  of  every  shop  assistant\ntogether with the hours of employment of each such shop assistant; and\n\n(d)\n\na copy of every order made under this Act while it is in force.\n\n\f17\n\n(2)\nIn addition to the requirements of subsection (1), the Chief Labour Officer\nmay require an occupier to keep exhibited in a conspicuous place in a shop, any\nextracts from this Act or a notice specifying any of the requirements of this Act.\n\n(3)\nAn  occupier  who  fails  to  comply  with  subsection  (1)  or  with  any\nrequirements  of  the  Chief  Labour  Officer  made  pursuant  to  subsection  (2)  is\nguilty of an offence.\n\nPART V\n\nFIRE SAFETY REQUIREMENTS\n\nFire safety certificate\n\n17.(1)\ncertificate issued by the Chief Fire Officer in respect of that shop.\n\nNo  shop  may  be  opened  for  business  unless  there  is  a  fire  safety\n\n(2)\n\nNo certificate may be issued pursuant to subsection (1) unless\n\n(a)\n\n(b)\n\nthe requirements under this Part have been complied with; and\n\nany directions issued by the Chief Fire Officer under section 18(4) have\nbeen complied with.\n\nA fire safety certificate issued by the Chief Fire Officer under subsection\n\n(3)\n(1) is valid for one year.\n\nThe Chief Fire Officer shall revoke a certificate granted under subsection\n(4)\n(1) where at any time an examination of the premises of a shop indicates that the\noccupier has failed to comply with the requirements set out in this Part or where\nfor any other reason, a fire hazard is posed.\n\nWhere a shop is opened for business in respect of which there is not a valid\n(5)\nfire safety certificate, the occupier of that shop is guilty of an offence and is liable\non summary conviction to a fine of $50 000 or imprisonment for one year or both.\n\n\f18\n\n(6)\nFor a period of one year after the commencement of this Act, a shop may\nbe opened for business although a fire safety certificate has not been issued under\nthis section.\n\nFire safety and prevention\n\n18.(1)\nFire Officer\n\nThe occupier shall provide and maintain to the satisfaction of the Chief\n\n(a)\n\n(b)\n\nsuch means of escape in case of fire for the persons in the shop as may\nreasonably be required in the circumstances; and\n\nequipment  for  firefighting  which  shall  be  so  placed  as  to  be  easily\navailable for use.\n\n(2)\n\nAn occupier shall ensure that\n\n(a)\n\n(b)\n\nall employees are trained in the basic use of the firefighting equipment\nreferred to in subsection (1); and\n\na suitable number of employees are specially trained in the use of the\nfirefighting equipment referred to in subsection (1).\n\nAt  least  one  person  who  has  been  specially  trained  in  the  use  of  the\n(3)\nfirefighting equipment provided under subsection (1) shall be available on the\npremises at all times.\n\nNotwithstanding that a fire safety certificate has been granted in respect of\n(4)\na shop, the Chief Fire Officer may at any time issue directions to an occupier\nwhere, in the opinion of the Chief Fire Officer, the fire safety or fire prevention\nmeasures in any shop are deficient.\n\nFire safety plan\n\n19.\nEvery occupier shall ensure that a fire safety plan which is approved\nby the Chief Fire Officer is put in place and that all employees are informed of\nthe plan and suitably trained in its application.\n\n\f19\n\nBuilding requirements for fire safety\n\n20.(1)\nThe occupier shall ensure that any door opening on any staircase or\ncorridor from any room in which any person is employed or any customer is\nallowed and any door affording a means of exit from the shop for persons in the\nshop is, except where the doors are sliding doors, constructed to open outwards.\n\n(2)\n\nThe occupier shall ensure that while any person is within a shop,\n\n(a)\n\n(b)\n\nthe doors of the shop and of any room therein; and\n\nany door that affords a means of exit for persons in the shop from any\nbuilding or from any enclosure in which the shop is situated,\n\nis not locked or fastened in such manner that it cannot be easily and immediately\nopened from within.\n\nThe occupier shall ensure that any staircase or flight of steps leading from\n(3)\none floor to another or to the ground is provided with suitable handrails and shall,\nif the Chief Fire Officer so directs in writing, be provided with slats or some other\nappropriate means to prevent slipping.\n\nThe occupier shall ensure that effective provision is made in the shop for\n(4)\ngiving a visible and audible warning in case of fire, and such warning must be\nclearly audible and visible throughout the shop.\n\nThe occupier shall ensure that the contents of any room in which persons\n(5)\nare employed or customers are allowed, are so arranged or placed that there is a\nfree passage for all persons in the room to a means of escape in case of fire.\n\nEnforcement of fire safety requirements\n\n21.(1)\nThe Chief Fire Officer may at any time enter any shop and inspect the\npremises for the purpose of ensuring that the provisions of this Part have been\ncomplied with.\n\n(2)\n\nEvery occupier is guilty of an offence who, whether by\n\n(a)\n\nhimself;\n\n\f20\n\n(b)\n\nany person employed by him; or\n\n(c)\n\nany person acting under his direction or with his consent,\n\nrefuses or fails to admit or obstructs the Chief Fire Officer when the Chief Fire\nOfficer is carrying out his duties pursuant to subsection (1).\n\nPART VI\n\nENFORCEMENT OF ACT\n\nEntry and inspection\n\nThe Chief Labour Officer or a member of the Police Force may at any\n22.(1)\ntime enter and inspect any shop for the purpose of ascertaining whether this Act\nis being complied with.\n\n(2)\n\nEvery occupier is guilty of an offence who, whether by\n\n(a)\n\n(b)\n\n(c)\n\nhimself;\n\nany person employed by him; or\n\nany person acting under his direction or with his consent,\n\nrefuses or fails to admit or obstructs the Chief Labour Officer or any member of\nthe Police Force when the Chief Labour Officer or the member of the Police Force\nis carrying out his duties pursuant to subsection (1).\n\nProtection of Chief Labour Officer and staff\n\n23.\nNo action or other proceedings for damages shall be instituted against\nthe Chief Labour Officer or any person acting on his behalf in the discharge or\npurported discharge of his functions under this Act, unless it is shown that the\nact or omission was in bad faith.\n\n\f21\n\nExamination of persons\n\n24.(1)\nThe  Chief  Labour  Officer  may  in  relation  to  any  shop,  examine  a\ncustomer,  an  employee  or  a  former  employee  if  that  person  consents,  for  the\npurpose of obtaining evidence necessary for the enforcement of the provisions\nof this Act.\n\nAn  employee  of  a  shop  who  is  required  under  this  Part  to  make  any\n(2)\ndisclosure  to  the  Chief  Labour  Officer  shall  not  by  reason  of  making  that\ndisclosure be regarded as being in breach of his duty to his employer; and no\naction, suit or proceeding lies against an employee in respect of any information\ngiven under subsection (1).\n\nEvidence of employment\n\nIn any proceedings against an occupier for employing a shop assistant\n25.(1)\nin his shop or allowing any shop assistant to be employed or to work in the shop\ncontrary to this Act, the fact that the shop assistant was found in the shop is prima\nfacie evidence that he was then being employed therein.\n\nThe presumption under subsection (1) shall not apply where the occupier\n(2)\nsatisfies the court that the shop assistant was not being employed in the shop or\nwas  there  either  against  the  orders  or  without  the  knowledge,  consent  or\nconnivance of the occupier.\n\nThe  fact  that  a  person  other  than  the  occupier  is  engaged  in  a  shop  in\n(3)\nconnection  with  the  serving  of  customers,  the  receipt  of  money  or  orders  for\ngoods or the delivery or despatch of goods is prima facie evidence that the person\nis being employed as a shop assistant in the shop.\n\nLiability for wages\n\nThe fact that an occupier has been convicted of an offence under this\n26.\nAct  does  not  relieve  him  of  any  civil  liability  in  respect  of  wages  or  other\npayments that are recoverable from him.\n\n\f22\n\nOffence re shop assistants\n\n27.\nguilty of an offence.\n\nEvery occupier who employs a shop assistant in breach of this Act is\n\nPART VII\n\nOFFENCES\n\nGeneral offence\n\n28.\n\nA person is guilty of an offence if he fails to comply with\n\n(a)\n\n(b)\n\n(c)\n\nthis Act;\n\nany order or regulations made under this Act; or\n\nany directions given by the Chief Labour Officer, the Chief Fire Officer\nor the Chief Medical Officer pursuant to this Act.\n\nDiscrimination offence\n\n29.(1)\n\nNo person shall on account of his race, colour or creed be refused\n\n(a)\n\n(b)\n\naccess to any shop; or\n\nthe  opportunity  to  avail  himself  of  any  facility,  service  or  amenity\noffered to the public by any shop by way of trade or business incidental\nthereto.\n\n(2)\n\nAn occupier who contravenes subsection (1) is guilty of an offence.\n\nWhere  an  occupier  who  is  charged  with  an  offence  under  this  section\n\n(3)\nalleges that the offender is\n\n(a)\n\n(b)\n\n(c)\n\nhis employee;\n\nhis agent; or\n\nsome other person,\n\n\f23\n\non giving to the prosecution not less than 3 days’ notice in writing, the occupier\nis entitled to have the person whom he alleges to be the actual offender brought\nbefore the court at the time appointed for hearing the charge.\n\nWhere, after the commission of the offence referred to in subsection (3)\n\n(4)\nhas been proved, the occupier proves to the satisfaction of the court that\n\n(a)\n\n(b)\n\nhe used all due diligence to enforce the execution of this section; and\n\nthe  other  person  had  committed  the  offence  in  question  without  his\nconsent, connivance or wilful default,\n\nthat other person may be convicted of the offence and punished in accordance\nwith the provisions of this Act and the occupier acquitted.\n\nWhere the occupier avails himself of the defence specified in subsections\n(5)\n(3) and (4), the prosecution and the person against whom the occupier brings a\ncharge may,\n\n(a)\n\nif the occupier gives evidence, cross-examine him and any witnesses\ncalled by him; and\n\n(b)\n\ncall evidence in rebuttal.\n\nGeneral penalty\n\n30.(1)\nEvery person who commits an offence against this Act for which no\nother penalty is provided, is liable on summary conviction to a fine of $10 000\nor imprisonment for one year or to both.\n\nWhere a person is convicted of an offence under this Act, and the failure\n(2)\nto comply is continuous, that person is liable to a further fine of $500 for each\nday during which the failure to comply continues.\n\nProsecutions\n\nThe  Chief  Labour  Officer  may,  although  not  an  attorney-at-law,\n31.\nprosecute or conduct before a court of summary jurisdiction, any proceedings\nrelating to an offence committed under this Act.\n\n\f24\n\nPowers of the Court on conviction of the occupier\n\n32.(1)\nWhere  an  occupier  is  convicted  of  an  offence  under  this  Act,  the\nmagistrate,  in  addition  to  or  in  lieu  of  imposing  any  punishment  otherwise\nauthorised by this Act, may by order require the accused to do any specified work\nor to adopt any specified means for the purpose of securing compliance with this\nAct, and may specify in the order a time within which the work must be done or\nthe means adopted, as the case may be.\n\nThe time specified in any order under subsection (1) may be extended on\n\n(2)\nthe application of the accused.\n\nThe magistrate referred to in subsection (1) shall adjourn the proceedings\n(3)\nuntil the expiration of the time specified in the order, if an order under subsection\n(1) is made in lieu of imposing a fine, and if the order is duly obeyed he may, if\nhe thinks fit, impose no fine in respect of the offence.\n\nWhere an accused fails to comply with an order made under subsection\n(4)\n(1), the accused is liable to a fine of $100 for every day during which default\ncontinues if default is made in obeying an order made under subsection (1) within\nthe time or extended time so specified; and the fine shall be in addition to any\nother fine imposed.\n\nPART VIII\n\nGENERAL\n\nRegulations\n\n33.(1)\n\nThe Minister may make regulations\n\n(a)\n\nrespecting any shop or the conditions of employment of shop assistants\nand other persons working in shops; and\n\n(b)\n\ngenerally for the purpose of giving effect to this Act.\n\n(2)\n\nRegulations made under subsection (1) are subject to negative resolution.\n\n\f25\n\nRepeal of Cap. 356A etc.\n\n34.(1)\n\nThe Shops Act, Cap. 356A is repealed.\n\n(2)\n\nThe Shops Order, 1985 (S.I. 1985 No. 194)  is repealed.\n\n\f26\n\nFIRST SCHEDULE\n\nShops which are not subject to any opening hours\n\n(Section 4(5))\n\nShops  engaged  in  the  sale  or  purchase  of  any  drugs  or  surgical\n1.\nappliances or any article required in the case of illness of any person or animal,\nwhere\n\n(a)\n\n(b)\n\nthe shop is opened only for the sale of such items; and\n\nthe  shop  is  kept  closed  except  for  the  admission  and  exit  of  the\ncustomer.\n\n2.\nentertainment which are primarily engaged in the sale of refreshments.\n\nShops located in theatres, cinemas, concert halls and other places of\n\n3.\npurchase of such food in the shop and alcoholic or non-alcoholic beverages.\n\nShops engaged in the sale of cooked food in respect of the sale or\n\n4.\nmeat, if the shop is open for such purpose only.\n\nShops  engaged  in  the  sale  of  bread,  milk,  milk  products  or  fresh\n\n5.\n\n6.\n\nShops operated by clubs.\n\nShops engaged in the sale of newspapers.\n\n7.\nor description that are required for the use of any ship or aircraft.\n\nAny shop engaged in the sale or purchase of goods of any kind, sort\n\n8.\n\nShops at petrol filling stations engaged\n\n(a)\n\n(b)\n\nin the repair and service of motor vehicles;\n\nin the sale of spare parts for motor vehicles; and\n\n\f27\n\n(c)\n\nin the sale of petroleum products, lubricants and accessories.\n\n9.\nAny shop engaged in the sale of handicraft originating in the Common\nMarket  within  the  meaning  of  section  6  of  the  Caribbean  Community  Act,\nCap. 15 or items produced from cottage industries, if the shop is open only for\nthe sale of such items.\n\n10.\nShops located on the premises of the Grantley Adams International\nAirport  or  the  harbour  as  defined  in  the  Barbados  Port  Inc.  (Transfer  of\nManagement and Vesting of Assets) Act, Cap. 285B.\n\n11.\n\nShops located on the premises of a hotel or a guesthouse.\n\n12.\nopen in respect of such business only.\n\nShops engaged in the business of funeral undertaking, if the shop is\n\n13.\nShops licensed to sell spirits, malt liquors and wines in accordance\nwith the Liquor Licences Act, Cap. 182, in respect only of the sale or purchase\nof  spirits,  malt  liquors,  wines,  non-alcoholic  beverages,  cigarettes,  cigars,\ntobacco and matches.\n\n14.\nwhere no other business is carried on.\n\nThe making of articles of clothing, boots and shoes to order in shops\n\n\f28\n\nSECOND SCHEDULE\n\nNotice under the Shops Act, 2015-\n\n(Section 7(2))\n\nNOTICE IS HEREBY GIVEN that seats are provided in this shop for shop assistants\nand that the shop assistants are entitled to make use of the seats whenever the use of\nthe seats does not interfere with their work.\n\n(Signed) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n\n(Occupier)\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2015.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2015.\n\nPresident\n\n"
}