{
  "bill_id": 109,
  "slug": "income-tax-amendment-no-1-bill-2015",
  "title": "Income Tax (Amendment) (No. 1) Bill, 2015",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/cad1190747a5f844e12f3d51ceb7f78b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-09-07",
  "first_reading": "2015-09-07",
  "second_reading": "2015-08-28",
  "gazette_date": "2015-08-28",
  "passed_date": "2015-09-07",
  "markdown": "12/08/2015\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Income Tax Act, Cap. 73 to\n\n(a)\n\nmake it an offence for a public officer or any other person employed\nto administer and enforce the Act to breach the duty of confidentiality\nimposed by section 51;\n\n(b)\n\nincrease the penalty for offences under section 79 of the Act;\n\n(c)\n\n(d)\n\nprovide for higher fines for Regulations made under section 83 of the\nAct;\n\nprovide for the use of administrative pecuniary penalties for certain\nbreaches of Regulations made under section 83 of the Act; and\n\n(e)\n\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of section 51 of Cap. 73\n\nAmendment of section 79 of Cap. 73\n\nAmendment of section 83 of Cap. 73\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Income Tax Act.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2015.\n\nThis Act may be cited as the Income Tax (Amendment) (No. ) Act,\n\n\f4\n\nAmendment of section 51 of Cap. 73\n\n2.\nprincipal Act, is deleted and the following is substituted:\n\nSection  51  of  the  Income  Tax  Act,  in  this  Act  referred  to  as  the\n\n“Breach of Confidentiality\n\n51.(1)\nThe Commissioner, the members of the Income Tax Appeal\nBoard, officers and other persons employed to administer and enforce\nthis Act and other laws relating to income tax shall\n\n(a)\n\nmaintain  and  aid  in  maintaining  the  secrecy  of  all  matters\nrelating  to  this  Act  and  other  laws  relating  to  income  tax\nwhich come to their knowledge, and shall not communicate\nany  such  matters  to  any  person  except  for  the  purpose  of\nadministering  or  enforcing  this  Act  or  any  other  law  of\nBarbados; and\n\n(b)\n\nbefore  they  begin  to  perform  any  duty  in  relation  to  their\noffice or employment, take and subscribe the prescribed oath\nof fidelity and secrecy.\n\nThe  Commissioner  or  any  person  authorised  by  him  may\n\n(2)\ncommunicate confidential information to\n\n(a)\n\n(b)\n\nthe  relevant  authorities  solely  for  the  purpose  of  the\nadministration or enforcement of this Act or any other laws\nrelating to income tax, or for the purpose of legal proceedings\nunder those enactments;\n\nthe  Director  of  Finance  and  Economic  Affairs  or  the\nPermanent Secretary in the Ministry of Finance solely for the\npurpose  of  the  formation,  evaluation  or  implementation  of\nfiscal policy;\n\n\f5\n\n(c)\n\nany  person  who  is  otherwise  legally  entitled  to  that\ninformation under this Act or any other enactment unless that\ninformation  was  collected  in  compliance  with  obligations\nimposed  under  a  Treaty  which  imposes  confidentiality\nrequirements and limits the manner in which that information\ncan be shared or used; or\n\n(d)\n\nany  person  with  the  consent  of  the  person  to  whom  the\nconfidential information relates\n\nA  person  who  uses  or  communicates  confidential  information\n(3)\ncontrary  to  the  manner  permitted  by  subsection  (2)  is  guilty  of  an\noffence and is liable on summary conviction to a fine of $10 000 or to\nimprisonment for a term of 2 years or to both such imprisonment and\nsuch fine.\n\nThe  Commissioner,  the  members  of  the  Income  Tax  Appeal\n(4)\nBoard, and the officers and other persons employed to administer and\nenforce this Act shall not be compelled to give or produce evidence\nrelating to any confidential information in connection with any legal\nproceedings other than legal proceedings arising under this Act or any\nother enactment that provides for the imposition or collection of a tax\nor duty.”.\n\nAmendment of section 79 of Cap. 73\n\n3.\nand substituting the following:\n\nSection 79 of the principal Act is amended by deleting subsection (3)\n\nEvery person, other than a person to whom section 51 applies,\n\n“(3)\nwho has\n\n(a)\n\ncommunicated or allowed to be communicated to a person\nnot legally entitled thereto any information obtained under\nthis Act or under any Regulations made under this Act; or\n\n\f6\n\n(b)\n\nallowed any person not legally entitled to do so to inspect or\nhave access to any written statement furnished under this Act\nor under any Regulations made under this Act\n\nis  guilty  of  an  offence  and  is  liable  on  summary  conviction  to\nimprisonment for a term not exceeding 2 years, or to a fine of not less\nthan $2 500 and not greater than $10 000 or to both such imprisonment\nand such fine. ”.\n\nAmendment of section 83 of Cap. 73\n\n4.\n\nSection 83 of the principal Act is amended by\n\n(a)\n\ndeleting subsection (4) and substituting the following:\n\nIn the event of any inconsistency between an agreement and any\n\n“(4)\nregulation made under subsection (2), and\n\n(a)\n\n(b)\n\nthe provisions of this Act, the terms of the agreement and the\nregulations  made  under  subsection  (2)  shall  prevail  to  the\nextent of the inconsistency; or\n\nthe  provisions  of  any  other  enactment,  the  terms  of  the\nagreement  and  the  regulations  made  under  subsection  (2)\nshall prevail to the extent of the inconsistency.”; and\n\n(b)\n\ninserting the following new subsections immediately after subsection\n(6):\n\n“(7)\nWhere regulations are made under subsection (2) and offences\nare  created  thereunder  a  person  guilty  of  an  offence  under  those\nRegulations may be liable\n\n(a)\n\non  summary  conviction  to  a  fine  of  $10  000  or  to\nimprisonment for a term of 2 years or to both such fine and\nimprisonment; or\n\n\f7\n\n(b)\n\non  conviction  on  indictment  to  a  fine  of  $50  000  or  to\nimprisonment for a term of 10 years or to both such fine and\nsuch imprisonment.\n\n(8)\nWhere  the  circumstances  so  require,  regulations  made  under\nsubsection (2) may require the Commissioner to impose a penalty of\nup  to  $10  000  for  a  breach  of  the  regulations  and  where  the  breach\ncontinues,  the  Commissioner  maybe  required  to  impose  a  further\npenalty of up to $5 000 for each day for which the breach continues or\nthe imposition remains unpaid.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2015.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2015.\n\nPresident\n\n"
}