{
  "bill_id": 113,
  "slug": "latin-american-development-bank-bill-2015",
  "title": "Latin American Development Bank Bill, 2015",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/be1b9a48c9ea3a583aca15ed9b15db81.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-09-01",
  "first_reading": "2015-09-07",
  "second_reading": "2015-08-28",
  "gazette_date": "2015-08-28",
  "passed_date": "2015-09-07",
  "markdown": "2015-08-27\nOBJECTS AND REASONS\nThis Bill would provide for membership of Barbados in the Latin American Development Bank and recognition of the Agreement on Immunities, Exemptions and Privileges.\nArrangement of Sections\nShort title\nInterpretation\nFinancial provisions for giving effect to the Agreement\nMinister empowered to raise loans for purposes of Agreement\nCertain provisions of the Immunities Agreement given force of law\nPower of Minister to make orders\nBARBADOS\nA Bill entitled\nAn Act to provide for the membership of Barbados in the Latin American Development Bank and recognition of the Agreement on Immunities, Exemptions and Privileges.\nENACTED by the Parliament of Barbados as follows:\nShort title\n1. This Act may be cited as the Latin American Development Bank Act, 2015.\nInterpretation\n2. For the purposes of this Act,\n“Agreement” means the Agreement for the Subscription of Common Capital Stock signed between the Government and the Latin American Development Bank on the 3% of September, 2014, the text of which is set out in Part I of the Schedule;\n“Bank” means the Latin American Development Bank (Corporacion Andina de Fomento) established by an Agreement establishing the Bank signed in February 1968 by the Governments of Bolivia, Chile, Columbia, Ecuador, Peru and Venezuela;\n“Government” means the Government of Barbados;\n“Immunities Agreement” means the Agreement on Immunities, Exemptions and Privileges signed between the Government and the Bank on the 17th November, 2014, the text of which is set out in Part II of the Schedule.\nFinancial provisions for giving effect to the Agreement\n3.(1) All sums required to be paid by the Government for the purpose of meeting the obligations of Barbados under the Agreement are hereby charged on and shall be paid out of the Consolidated Fund.\n(2) The Minister may issue or cause to be issued to the Bank non-negotiable, non-interest bearing notes or similar securities and other obligations in accordance with the Agreement and Chapter II of the Agreement Establishing the Latin American Development Bank in lieu of any portion of the subscription to the Bank’s authorised capital and any sums payable in respect of such notes\n5\nor securities so issued and shall be charged on and paid out of the Consolidated Fund.\n(3) Any sums received by the Government from the Bank pursuant to the Agreement shall be paid into the Consolidated Fund.\nMinister empowered to raise loans for purposes of Agreement\n4.(1) The Minister may borrow from any person any sum or sums required for payments under section 3 or for replacing any sum or sums paid out of the Consolidated Fund pursuant to that section, and for the purpose of such borrowing, may create and issue any securities bearing such rate of interest and subject to such conditions as to repayment, redemption or otherwise, as he thinks fit.\n(2) The principal and interest of any securities issued under subsection (1) and any expenses incurred in connection with their issue shall be charged on and paid out of the Consolidated Fund.\n(3) Any moneys raised by securities issued under subsection (1) shall be paid into the Consolidated Fund.\nCertain provisions of the Lmmunities Agreement given force of law\n5. The provisions of paragraphs 3, 4, 5, 7, 9,11,12,13,14, 15 and 18 relating to the Immunities Agreement shall have the force of law in Barbados.\nPower of Minister to make orders\n6. The Minister may by order make such provisions as may be necessary for carrying into effect any of the provisions of the Agreement or the Immunities Agreement.\nSCHEDULE\n(Section 2)\nPART I\nAGREEMENT FOR THE SUBSCRIPTION OF COMMON CAPITAL STOCK\nTHIS AGREEMENT for the subscription of Common Capital Stock is made between Corporacién Andina de Fomento, represented by its Executive President, Dr. L. Enrique Garcia (hereinafter referred to as “CAF”) of the First Part, and the Government of Barbados (hereinafter referred to as “Barbados”), represented by Hon. Christopher P. Sinckler, M.P. Minister of Finance and Economic Affairs of Barbados, of the Second Part:\nWHEREBY IT IS AGREED AS FOLLOWS:\nSECTION 1\nBarbados will subscribe to Three Thousand Five Hundred and Twenty Two (3, 522) Series “C” shares of Common Capital Stock of CAF, each share having a net worth value of Fourteen Thousand Two Hundred dollars of the United States of America (US$14, 200), and the total price of the shares being Fifty Million Twelve Thousand Four Hundred dollars of the United States of America (US$50,012,400.00).\nThe characteristics of Series “C” shares are indicated in Annex 1 to this Agreement, which shall be deemed as an integral part of this Agreement.\nSECTION 2\nThe price of the said shares shall be paid by Barbados as follows:\n(a) The sum of Twenty Five Million Six Thousand Two Hundred dollars of the United States of America (US$25,006,200.00), to be paid within thirty (30) days following the effective date of this Agreement; and\n(b) The sum of Twenty Five Million Six Thousand Two Hundred dollars of the United States of America (US$25,006,200.00), to be paid within one year following the effective date of this Agreement.\nSECTION 3\nThe amount mentioned in Section 2 shall be paid by Barbados in dollars of the United States of America.\nSECTION 4\nAll notices or other documents in connection with this Agreement shall be delivered or sent to the following respective address:\nBarbados\nMinistry of Finance and Economic Affairs Bay Street St. Michael, BB11156 Barbados\nCorporacién Andina de Fomento Avenida Luis Roche, Torre CAF, Piso 9 Altamira Caracas, Republica Bolivariana de Venezuela Facsimile: (+58 212) 209 2231 Telephone: (+58 212) 209 2111\nSECTION 5\nThis Agreement shall take effect on the date Barbados notifies CAF that it has fulfilled the constitutional, legal and statutory requirements necessary towards such purpose.\nSECTION 6\nAny unforeseen event or controversy that may arise between the Parties hereto, not contemplated in this Agreement, shall be resolved in an amicable manner and by mutual agreement.\nThis Agreement for the Subscription of Common Capital Stock is subscribed in the City Nowra O%-, in four (4) original counterparts, two (2) in English and two (2) in Spanish, with the Same legal effect and force, on this 03 day in the month of séptember of the two thousand and fourteen.\nCorporacién Andjna dg Foment ae Epri \"F Gayeia Executive President\n; [\nBarbados v O_) Christopher Py injekler\nMinister of Finance and Economic Affairs of Barbados\nANNEX 1\nCHARACTERISTICS OF CORPORACION ANDINA DE FOMENTO’S SERIES “C” SHARES\n1. TYPE OF SHARE: Shall be nominative and indivisible.\n2.CURRENCY: Theshares shall be denominated in Dollars ofthe United StatesofAmerica.\n. EORM OF PAYMENT: Share subscription shall be comprised of the paid-in capital and the callable capital, in the proportion, terms and conditions as agreed upon by the subscriber and the administration.\n. SHARE VALUE:\nNominative: Five Thousand Dollars denominated inthe currency ofthe United States of America (US$5, 000.00).\nCash: Net worth shall be determined by the administration of CAF.\n. SUBSCRIPTION AND TRANSFER ABILITY: Shares may be subscribed to by international organizations or by legal or natural persons from outside the Member Countries of CAF. Notwithstanding the above, any such subscription must be previously approved by CAF’s Board of Directors.\nShares may be transferred to similar persons of the same country, and those subscribed to by international organizations may be transferred to other entities of the same nature.\n. SHARE CERTIFICATES AND TRANSFERABILITY PROCEDURES: The provisions set forth in Articles 5, 6, 7,8 and 11 of CAF’s General By-Laws shall be applicable to Series “C” Shares. Shares belonging to International Organizations shall be so identified and shall be recorded as such in the Stock Registry Book, in lieu of the stipulations regarding country name and shareholder’s nationality as referred to in Articles 5 and 6 of said General By- Laws, respectively.\n. OTHER RIGHTS AND OBLIGATIONS: The rights and obligations of the Shareholders set forth in the Constitutive Agreement and in the General By- Laws, Shareholders Meeting’s Decisions and Board of Directors’ Resolutions of CAF, that do not exclusively refer to Series “A” and “B” Shareholders, shail apply to Series “C” Shareholders.\n10\nPART II\nAGREEMENT OF IMMUNITIES, EXEMPTIONS AND PRIVILEGES\nBETWEEN THE GOVERNMENT OF BARBADOS AND THE CORPORACION ANDINA DE FOMENTO\nBARBADOS (hereinafter referred to as Barbados), represented by Senator the Honourable Maxine P. O. McClean Minister of Foreign Affairs and Foreign Trade of Barbados duly authorized by of the Government of Barbados; and CORPORACION ANDINA DE FOMENTO (hereinafter referred to as “CAF”), represented by Mr. Enrique Garcia, its Executive President, duly authorized by Article 31 of CAF’s Constitutive Agreement, signed in Bogota, Republic of Colombia, and dated February 7, 1968.\nWHEREAS;\n+ CAF is a multilateral financial institution, established and organized as a legal entity under public international law, which primary objective is to promote the economic integration and sustainable development of its shareholder countries through the granting of services as a Multiple Bank and financial agent.\n« Barbados has become a shareholder of CAF with the subscription of Three Thousand Five Hundred and Twenty Two (3,522) Series “C” shares, as described in the Subscription Agreement of Ordinary Capital Shares between Barbados and CAF, dated September 03, 2014.\n« Barbados wishes to facilitate the carrying out by CAF of its functions in its territory with The Government, the public and private sector, and multilateral, bilateral and other financial institutions.\n« CAF may establish in Barbados a representative office or appoint an agent, manager or representative, as it deems necessary for the carrying out of its functions.\nil\nNOW, IT IS HEREBY AGREED AS FOLLOWS:\n1. CAF may carry out in the territory of Barbados all ofits functions pursuant to its objectives, with the Government, its different institutions and any corporate or other entities or persons therein.\n2. Barbados recognizes CAF as a multilateral financial organization of International Public Law, with full power and authority to:\na. Acquire and dispose ofreal, personal and intangible property in Barbados (including, without limitation, capacity to constitute or be the beneficiary of mortgages, liens or other charges or interests in such property);\nb. Enter into any and all types of contracts and agreements; and\nc. Sue and be sued before a court of competent jurisdiction in Barbados. A judicial claim or action against CAF may only be filed in Barbados if CAF:\n(i) has established a representative office;\n(ii) has appointed an agent or a representative empowered to accept service or notification of such service; or\n(ii) has issued or guaranteed securities in Barbados.\n3. Barbados, the persons who represent it or those who derive their rights from it, may not initiate or proceed with any judicial claim or action against CAF. Nevertheless, Barbados may assert such rights pursuant to special procedures which may be described herein, in CAF’s regulations or in contracts entered into by both parties hereto, in order to settle controversies that may arise between Barbados and CAF.\n4. CAF shall not be subject to legal requirements applicable to banking or financial institutions, and will not be obliged to register as a foreign company or enterprise.\n12\n5. CAF’s property, income and other assets, wheresoever located, shall enjoy immunity from expropriation, search, requisition, confiscation seizure, sequestration, attachment, garnishment, retention or any other form of forceful seizure by reason of executive or administrative actions of Barbados. Moreover, said property, income and other assets shall have the same and identical immunity from judicial actions until a final non-appealable judgment is rendered against CAF.\n6. | CAF’s property, income and other assets are exempted from any type of restrictions, regulations, controls and moratorium measures, to the extent necessary for the accomplishment of CAF’s objectives and functions.\n7. Barbados recognizes and guarantees the inviolability of CAF’s archives and documents.\n8. Barbados accords to CAF’s official communications the same treatment accorded to the official communications of CAF’s shareholder countries.\n9. CAF’s officials shall enjoy immunity with respect to judicial, executive and administrative process and actions in relation to acts performed by them in their official capacity, except when CAF expressly waives such immunity.\n10. CAF may, at its own discretion and expense, establish and maintain a representative office in Barbados to carry its activities and operations therein. Prior to the existence of such an office, CAF may carry its activities and operations in Barbados by visits of its staff and employees.\nll. Inrespect of CAF’s activities and operations in the territory of Barbados, Barbados hereby:\na. Exempts CAF from any and all direct or indirect taxes, duties, levies, encumbrances, deductions or other charges of any kind now or hereafter imposed in Barbados;\n13\nb. Exempts CAF from any and all retention or deduction due to taxes, duties, levies or other charges, inregards to payments of interests, dividends, fees or other monies which it may receive from Barbados, its institutions, its governmental agencies, public or private institutions or companies or persons;\nc. Agrees that no taxes whatsoever shall be levied on the bonds or securities issued by CAF, including dividends or interest thereon, irrespective of who the holder thereof may be:\n(i) Ifsuch taxes discriminate against said bonds or securities solely because they are issued by CAF.\n(ii) If the only basis for jurisdiction for said taxes is the place or the currency of issuance of said bonds or securities, or the place or currency in which said bonds or securities are paid or payable, or the place of any office or place of business of CAF.\nd. Agrees that no taxes whatsoever shall be levied on the bonds or securities guaranteed by CAF, including dividends or interest thereon, disregarding who the holder thereof may be:\n(i) Ifsuch taxes discriminate against said bonds or securities solely because they are guaranteed by CAF.\n(ii) Ifthe only basis for jurisdiction for said taxes is the location of any office or place of business maintained by CAF.\n12. CAF is exempted from the payment of customs or import duties, encumbrances, taxes and other fiscal charges on vehicles, goods and technical equipment necessary for the operation of any representative office it may decide to establish and maintain in the territory of Barbados. Such vehicles, goods and technical equipment may be subsequently re-exported free of export duties, taxes, encumbrances and other fiscal charges.\n13. CAF’s employees and staff in Barbados (except for citizens or permanent residents of Barbados) are hereby accorded exemptions, concessions privileges\n14\nin respect of taxation, import duties and otherwise, no less favourable that those accorded to employees of international bodies or international institutions to the extent that they will:\na. not be subject to income tax or similar taxes on respect of salaries, compensation and emoluments received from CAF;\nb. be entitled, within six (6) months of arriving in Barbados, to import free of customs or import duties and other fiscal charges, personal effects, vehicles and household goods and to export the same free of export duties and other fiscal charges at the termination of their stay in Barbados.\n14. Barbados will facilitate the issuance of visas, permits and other authorizations required to enable CAF’s staffand employees to work in Barbados and to enter, remain and reside in and leave Barbados at any time and from time to time as required in order to carry out CAF’s purpose, in accordance with the laws of Barbados. Barbados will facilitate the issuance of visas, permits and other authorizations required to enable the families of CAF’s staff and employees to enter, remain and reside in and leave Barbados at any time and from time to time, in accordance with the laws of Barbados.\n15. Inregards to matters of foreign investment and currency exchange controls, Barbados shall:\na. approve requests for foreign investment and currency exchanges for CAF’s activities and operations in Barbados; and\nb. grant all authorizations which may be required:\n(i) for the remittance out of Barbados of all dividends and other distributions, interests, profits, gains, proceeds or realizations, income, fees and monies of any kind whatsoever arising from or in connection with any activities or operations by CAF in Barbados;\n(ii) for the remittance out of Barbados of any monies belonging to CAF’s staffand employees and their spouses and children (unless they are citizens or permanent residents of Barbados); and\n15\n(iit) for the purchase of currency at the most favourable exchange rate available that may be required in connection with any such remittances.\n16. Without prejudice to the immunities, exemptions and privileges which may be accorded exclusively to the staff and employees of CAF’s representative office, the treatment which Barbados accords CAF and its staff and employees shall apply whether or not CAF establishes and maintains an office, agent, manager, representative or any other employees or staff in Barbados. Such immunities, exemptions and privileges shall be extended to any wholly owned subsidiary of CAF approved in writing by Barbados.\n17. If further matters arise concerning CAF’s activities and operations in the territory of Barbados, Barbados and CAF shall discuss the same and establish appropriate additional arrangements.\n18. Any legislative, executive and administrative action necessary in Barbados to make valid and enforceable any and all immunities, exemptions and privileges granted to CAF by virtue of this Agreement, and to confer full legal authority to the matters hereby agreed, shall be taken by Barbados.\n19. AnydisputesorcontroversiesarisingundertheA greementshall bediscussed between Barbados and CAF and shall be solved in a direct manner, by mutual agreement and in an amicable fashion, by the parties herein.\n20. The Agreement shall only be modified by mutual accord in writing, signed by the parties.\n21. The Agreement shall become effective upon CAF’s receipt of a formal notification by Barbados that all internal formalities have been satisfied in order hat this Agreement is valid and enforceable in accordance with the laws of Barbados.\n16\n22. The Agreement shall remain effective until one of the parties receives notification from the other, upon which termination of the same shall take effect six (6) months thereafter.\n23. This Agreement shall be executed in four (4) counterparts, two (2) in the English language and two (2) in the Spanish language of equal sense and intent, each of which shall be an original.\nIN. WITNESS WHEREOF, the parties ge to, each acting through its duly authorized. represeiitative, have signed the present Agreement ink? / Wf LON dated, date}\nFOR AND ON BEHALF OF ‘CORPORACION ANDINA DE FOMENTO\nFOR AND ON BEHALF OF BARBADOS\n\nMaxine P.O. McClean ; Minister of Foreign Affairs and Foreign Trade of Barbados\n17\nRead three times and passed the House of Assembly this day of , 2015.\nSpeaker\nRead three times and passed the Senate this , 2015.\nPresident\nday of\n"
}