{
  "bill_id": 116,
  "slug": "land-acquisition-vaucluse-st-thomas-sanitation-service-authority",
  "title": "Land Acquisition - Vaucluse, St. Thomas - Sanitation Service Authority",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/bde75147d26ddc7d48a392a03771b59c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-10-28",
  "first_reading": "2015-11-04",
  "second_reading": "2015-10-27",
  "gazette_date": "2015-11-04",
  "passed_date": "2015-11-04",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament approve, in accordance with section 5 of the Land Acquisition Act, Cap. 228, the compulsory acquisition by the Crown of the parcel of land situate at Vaucluse, in the parish of Saint Thomas, in this Island and more particularly described in the Schedule hereto for a public purpose, that public purpose being, for the Sanitation Service Authority to implement and execute its Green Energy Programme which is designed to facilitate the effective and efficient management of solid waste and other activities related to the preservation of the environment.\nAPPROVED by the House of Assembly this\nday of\n, [wo Thousand and fifteen.\nSpeaker\nAPPROVED by the Senate this\nday of\n, Two\nThousand and Fifteen.\nPresident\nSCHEDULE\nALL THAT land situate at Vaucluse in the parish of Saint Thomas in this [sland containing by admeasur reserve) Abutting and B ement 10.93 hectares or thereabouts (inclusive of 0.166 hectares in road ounding on the public road called Highway D on lands now or formerly of Vaucluse Estates Limited on lands now or formerly of Vaucluse Estates Limited (the Sanitation Service Authority - Cell 4) on lands now or formerly of the Barbados Government (Sustainable Barbados Recycling Centre) on other lands now or formerly of Vaucluse Estates Limited on lands now or formerly of B.C. Holdings Inc. on other lands now or formerly of Vaucluse Estates Limited on the public road called Highway D and on other lands now or formerly of the Barbados Government ( bound as shown and de he Sanitation Service Authority) or however else the same may abut and lineated on a Plan certified on the 8\" day of July, 2015 by Michelle E. St. Clair, Camille R. Belgrave and Samuel N. Taylor, Land Surveyors and recorded in the Lands and Surveys Department on the 16\" day of July, 2015 as Plan No. 630/2015.\nADDENDUM\nOn the 27\" day of February, 2014, the Cabinet agreed to the compulsory acquisition by the Crown of the land mentioned in this Resolution situate at Vaucluse, in the parish of Saint Thomas for the Sanitation Service Authority to implement and execute its Green Energy Programme which is designed to facilitate the effective and efficient management of solid waste and other activities related to the preservation of the environment.\nIn accordance with the provisions of section 5 of the Land Acquisition Act, Cap. 228, the approval of Parliament is now sought for the compulsory acquisition of the parcel of land described in the Schedule hereto in order that the public purpose set out in this Resolution may be effected and that the Crown may acquire an indefeasible title to the said parcel of land.\nwie me ree meme ee wt ewememes emeee emees ee\nBUS 4ug LETS OL PAMateat\nSaray Order te: FE KN Suspenders M2 3501 Te. 4 The darts wc. ernment tg fatty ale dart alas Kose ley Center| | ° ro aime well ney ' re or leyrt «Sates oe ae on de 12h b~) . ‘3 V@achee Lior eri Tie @atase berere Cink) le 4y . Wee stems har Jy ‘* * a ~<— 1 td eneets emer, Ape a SS e-em: opmny a ST el: ae te mmm OT et me Feet tae 0 Neate Seapets > - . Ren te Frey -* (Wine ch'ag OT RMS as ee te meh tel ne STI Sent he Tet gk cet as ables: tem: NS cee eee et tS ae nena we 5 = G4 lO pee ee STL OE et eek rele Seat” LE oe mrmmmm set ag 6 6 Ts fs 008, TE lee! bee OR ON, SG et OS IRS ee. tecree he ee ae OE me he eee} Fo eetle ane: eee | STD © ARTS Qa ester 7 ew Aiea he lh atte heen eT OL tT o we Sere ese Were ee OE Net SF yet ene poesia’ Potrero al . pie, 1 aceon. TOES ne eos RAREST meme! Oo Shot Nene: ered bat Ss melas <2 22: vam ont a Vang lat. QQ we SF a gery We Te Ee Gta ee! tae. AS OP RE J: MS Le are on seoesie toast eres [op ST SF ER. a er trl eee be er ee PRE Te 1 Water Steel weet wis ! toe ers er hee eee —— Tee ae We 7 ee me [pen bemmrg gy a DS ees « $ Ss a Bb * wsewse Oe (@ Watgan Bae oe ely 4 Ly fa mss AN, 4 ™ S ‘ a \\ Al e wo ah omer z $ B id e. wee oe ~~. 3 a Tes Souee Commune - = ~* > = wera ah 3 de $ “3 als 3 . a) a m- <\nNn AG Ne OF ay\nLEROY TRE EY EERE Ae NN ATT CE COT RE\nen Nae ere et eet ne REN FREE FE\noS\n:\nle\n4a\nvars\nal\nerye ECCT Oboe mene eebeere ser web se\nwn heh\n"
}