{
  "bill_id": 117,
  "slug": "lease-barbados-conference-services-limited-two-mile-hill-st-michael",
  "title": "Lease - Barbados Conference Services Limited - Two Mile Hill, St. Michael",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/6af7f069ba539ebe4a2438547a3218ef.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-03-09",
  "first_reading": "2016-03-08",
  "second_reading": "2016-03-08",
  "gazette_date": null,
  "passed_date": "2016-05-04",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament in accordance with Section 5 (1)(c) of the Crown Lands (Vesting and Disposal) Act, Cap. 225, approve the lease to the Barbados Conference Services Limited of the parcel of land together with the buildings thereon, situate at Two Mile Hill in the parisly of Saint Michael, in this Island more particularly described in the First Schedule to this Resolution on the terms and conditions set out in the Second Schedule to this Resolution.\nAPPROVED by the House of Assembly this\nday of\nTwo thousand and fifteen.\nSPEAKER\nAPPROVED by the Senate this\nday of\n, Two\nthousand and fifteen.\nPRESIDENT\nFIRST SCHEDULE\nALL THAT\nland, the property of the Crown shown and delineated as Section B on the Plan hereinafter referred to, situate at Two Mile Hill in the parish of Saint Michael in this Island containing by admeasurement 9012.4 square metres or thereabouts (inclusive of 722.7 square metres in road) Abutting and Bounding on a public road called Highway 5 which leads to Bridgetown in one direction and to Mapp Hill in the other direction and on another public road and on lands now or formerly of Donald Trotman and on lands now or formerly of the Barbados Diocesan Trustees and on lands now or formerly of National Housing Corporation and on other lands of the Crown or however else the same may abut and bound as shown and delineated on a Plan certified on the 15th day of November, 2011 by Michelle E. ST. Clair, Land Surveyor and recorded in the Lands and Surveys Department on the Ist day of December, 2011 as Plan No. 1233/2011 together with the buildings thereon.\nSECOND SCHEDULE\nTERMS AND CONDITIONS:\nl.\nThe term of the lease shall be for a period of twenty-five (25) years with an option to renew for a further twenty-five (25) years;\n2. The rent shall be at the rate of $100.00 per annum with respect to Parcel B and shall be subject to review every five (5) years;\nSe The lessee shall be responsible for:\n(i), the building and other property maintenance; and\n(ii) all outgoirigs including rates and taxes with the exception of property insurance;\n4. The ‘lessee shall provide and maintain in effect occupiers liability insurance and any other insurance coverage as reasonably required by the Lessor with the exception of Property Insurance;\nSs The lessor shall provide and maintain in effect property insurance with limits not less than 100% of the full replacement cost of the property; and\n6. No development is to be carried out without the expressed permission of the landlord.\nADDENDUM\nOn the 28% day of May, 2015 the Cabinet agreed inter alia that 9012.4 Square metres of land situate at Two Mile Hill, in the parish of Saint Michael in this Island together with the buildings thereon should be leased to the Barbados Conference Services Limited.\nIn accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is sought for the lease to Barbados Conference Services Limited of the parcel of land described in the First Schedule to this Resolution, subject to the terms and conditions set out in the Second Schedule to this Resolution.\nLANDS AND SURYE*S DEPARTMENT\nSurvay Order No: Carrasgcndence Nea: 19/208 9305/35 ver. ;\nParish of: St Michnei Loeatity Twa Mile Hill\n_Ja_Gridgetown Ne Other Lands ol the Sarbedas Governmact (Haro Saurt) ast on mpmee met ee = me rpwererit orate IA Ie fe 4 i | Saction A Land 27315. sq. mn. Road 463.5 sq. m. ~—, a te es Tolal 27783.3 sq. m. Made Naw of Fremarty ow Pt 4 cae at Section 9 wopp 1 as Land 289.7 sq.m | Reed 722.) 3q_ mz t = 3 fotat 9012.4 aq. mn. ‘j ‘ . 7 ' thos ia yall & | 4.7 4 Athes Suit i t ‘ eriaid ‘ Teatman 3 Te ; Sarhadas 1S Pa oi Diocesan ne ‘3928 == trustees weuhe fa LS an soll\nMettanat Hounng Carzaeatan\n(Sh. Aarnanes Haignts)\n\nBarbshos PLAN: GF LAND (barderag graen snd crown!\nat\nsoaigining\nCartified\nTWO MILE SILL, ST. MITHAEL\n. Land S8Q04.7 sq. om Read. WW91.2 sa. wr. - Total 6795.9 2q, m, (3.583 No)\n=\nMIMISTRY G7 HOMSING AND LANDS\n15SIn Novamber, 2014\nSCALE = 1600\nDitiancas ote ja maint Searings ore ctterrad io Gad Neri arivad tram Out. central 157! & (1877\ndanctet lron pum denotes # roc found dancies * put *ewor densina fram fasna uniaas atherwisa staid\ndenol4a tompuied pant\ntdad fet ¢: itt.02.09.301\n—: Fae Lands and Surveys Oapt only\n1253.1 ~ ae > Dee re /\n"
}