{
  "bill_id": 118,
  "slug": "land-acquisition-vaucluse-st-thomas-bolt-solutions-inc",
  "title": "Land Acquisition - Vaucluse, St. Thomas - Bolt Solutions Inc.",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/ed4c3993e16c322df09d58b396309b66.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-10-28",
  "first_reading": "2015-11-04",
  "second_reading": "2015-10-27",
  "gazette_date": "2015-11-04",
  "passed_date": "2015-11-04",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament approve the change of the public purpose for which the parcel of land situate at Vaucluse in the parish of Saint Thomas in this Island, more particularly described in the First Schedule hereto, was compulsorily acquired by the Crown in accordance with section 5 of the Land Acquisition Act, Cap. 228 from the construction of an abattoir to the construction of an administrative office building.\nAND FURTHER RESOLVED that Parliament, in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, approve the lease to Bolt Solutions Inc. of the said land, more particularly described in the First Schedule hereto, on the terms and conditions set out in the Second Schedule hereto, for the construction of an administrative office building.\nAPPROVED by the House of Assembly this day of Two thousand and fifteen.\nTwo thousand and fifteen.\nSpeaker\nAPPROVED by the Senate this\nday of\nTwo thousand and fifteen.\nPresident\nFIRST SCHEDULE\nthe\nof the Crown situate Vaucluse\nALL THAT\nLAND, property at in the parish of Saint Thomas, in this Istand-and found -by-survey-made—and————__ certified on the 14\" day-of March; 1991-to contain by admeasurement-3.355.-hectares or thereabouts and found by recent survey to contain by admeasurement 3.354 hectares or thereabouts Abutting and Bounding on lands now or formerly of Vaucluse Estates Limited, on a public road known as Highway D leading to Porey Spring in one direction and to Shop Hill in the other direction, on a track and on lands now or formerly of Vaucluse Estates Limited or however else the same may abut and bound as shown and delineated on a Plan certified on the 21% day of April, 2015 by Michelle E. St. Clair, Land Surveyor and recorded in the Lands and Surveys Department on the 22™ day of April, 2015 as Plan No. 314/2015.\n\nSECOND SCHEDULE\nTERMS AND CONDITIONS:\n(a) The lease shall be for a term of twenty-two (22) years from November 1, 2014 to October 31, 2036.\n(b) The premises shall be leased for the purpose of constructing an Administrative Office Building.\n() The Lessee shall not use, permit or suffer the demised premises or any part thereof to be used for any purpose other than for the construction of the Administrative Office Building.\n() The land together with all improvements shall be leased back to the Government of Barbados/Sanitation Service Authority.\nThe rent for the entire term shall be $20.00, inclusive of value added tax, payablein advance.\n@ The Lessee shall be responsible for the cost of development of the site.\n(g) The Lessee shall comply with the Zown and Country Planning Act, Cap. 240 and all other statutory requirements for building, safety and health throughout the term.\n(h) The Lessee shall keep the Lessor indemnified against all actions or loss arising from its use of the premises.\nThe Lessee shall not assign, demise, sublet or otherwise part with possession of any part of the demised premises, without the Lessor’s consent.\n0) The lease shall terminate on the transfer of the ownership of the Administrative Office Building to the Government of Barbados.\n(x)\nDuring the term of this lease, the Lessee may encumber its interest in the building and/or the property by way of one or more loans, mortgages or other financing.\n0) The Lessee shall have the right, without limitation, to assign the rent payments due from the Crown pursuant to the terms of this lease.\n(m) At the end of the lease or its sooner determination, the premises, with improvements, shall pass to the Crown for nil consideration.\n4\nADDENDUM\nOn the 18\" day of January, 1990, the Cabinet agreed that approximately 18-5 acres (7-5 hectares) of tand-situate-at the -Vauctuse Plantation in-the-parish-of Saint Thomas, ‘should be acquired: for-the~public purpose. of-constructinganabattoir.._It was subsequently decided that such a large area of land was not required to execute the public purpose. Consequently, the Crown sought to acquire 3.355 hectares or thereabouts instead.\nThe said parcel of land was: acquired under the provisions of the Land Acquisition Act, Cap. 228 and became vested in the Crown by virtue of a Notice of the acquisition which was published in the Official Gazette on the 2™ day of September, 1991 as Statutory Instrument No. 118 of 1991.\nAn Abattoir was subsequently constructed in the parish of Christ Church, which obviated the need to construct one at Vaucluse, in the parish of Saint Thomas.\nOn the 9\" day of April, 2015, the Cabinet agreed that the parcel of land situate at Vaucluse in the parish of Saint Thomas, containing 3.354 hectares or thereabouts and described in the First Schedule hereto, should be leased to Bolt Solutions Inc. and that the Lease shall be subject to the terms and conditions set out in the Second Schedule.\nThe approval of Parliament is now sought\n(a) for the changing of the public purpose for which the parcel of land, more particularly described in the First Schedule to this Resolution, was acquired from “the construction of an abattoir” to “the construction of an administrative office building”; and\n(b) inaccordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, for the lease to Bolt Solutions Inc. of the said parcel of land, more particularly described in the First Schedule to this Resolution, on the terms and conditions set out in the Second Schedule hereto, for the construction of an administrative office building.\nNo: No: 9/2015 (bordered green) VAUCLUSE, ST. THOMAS 3.354 ho. MINISTRY OF HOUSING, LANDS & RURAL DEVELOPMENT 21st April, 2015 Micholle E. St. Cloir Land Surveyor LANDS AND SURVEYS DEPARTMENT © rect Now or Formerly Now or Formarty Vouclias Estates Limited Voucluse Esloles Limited Now or Formerly Vouehise Estotes Limited Now or Formarly SCALE 1:1000 \"oe ste _. Distances ore in metras Voucluse Estoles Limited ~ , —~ 2 Yavetuss Foctery Beorings are referred to Grid North 3 , = derived from o previous plon by A. P. Waskes =’ cortified 1991-03-14 ond recorded os 8 DLS40758/91 Ey we © denotes iron found © denotes iron put @ denotes «x found on korb unless otherwise stated Lond Tox J: 49.03.01.011 For Lands ond Surveys Dept only 2 se BY : 20 Ls\nSurvey Order No: Correspondence No: 9/2015\nGRID\nNORTH\nBarbados\nPLAN OF LAND\nal\ncontaining\nsurveyed for\nCertified\nFarish of: Sf. Thimos\nLocality: Yaueluse\n"
}