{
  "bill_id": 122,
  "slug": "pharmacy-amendment-bill",
  "title": "Pharmacy (Amendment) Bill",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/856ab622e5584930f80b88fc8919e7a0.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-10-21",
  "first_reading": "2015-10-28",
  "second_reading": null,
  "gazette_date": null,
  "passed_date": "2015-10-28",
  "markdown": "2015-08-20\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Pharmacy Act, Cap. 372D to provide for\n\n(a)\n\n(b)\n\nan increase in the number of persons who may serve on the Pharmacy\nCouncil;\n\nthe  appointment  of  the  Chairman  and  Deputy  Chairman  of  the\nPharmacy Council by the Minister responsible for Health; and\n\n(c)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nAmendment of section 10 of Cap. 372D\n\nAmendment of the First Schedule to Cap. 372D\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Pharmacy Act, Cap. 372D to provide for an increase\nin the number of persons who may serve on the Pharmacy Council and the\nappointment  of  the  Chairman  and  Deputy  Chairman  of  the  Council  by  the\nMinister responsible for Health.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n\nThis Act may be cited as the Pharmacy (Amendment) Act, 2015.\n\nAmendment of section 10 of Cap. 372D\n\n2.\namended by deleting section 10 and substituting the following:\n\nThe  Pharmacy  Act,  in  this  Act  referred  to  as  the  principal  Act  is\n\n“Establishment of Pharmacy Council\n\n10.\nThere is established, for the purposes of this Act, a Council\nto be known as the Pharmacy Council and the First Schedule has effect\nin relation to the constitution of the Council and otherwise in relation\nthereto. ”.\n\nAmendment of the First Schedule to Cap. 372D\n\n3.\nsubstituting the First Schedule contained in the Schedule to this Act.\n\nThe  principal  Act  is  amended  by  deleting  the  First  Schedule  and\n\n\f5\n\nSCHEDULE\n\n“FIRST SCHEDULE\n\n(Section 3)\n\n(Section 10)\n\n1.\n\nThe Council shall comprise\n\n(a)\n\n(b)\n\nthe Director of the Barbados Drug Service ex officio; and\n\n8 persons appointed by the Minister by instrument in writing\nas follows:\n\n(i)\n\n(ii)\n\n(iii)\n\none  medical  practitioner  appointed  by  the  Minister,\nafter  consultation  with  the  Barbados  Association  of\nMedical Practitioners;\n\n3  pharmacists  appointed  by  the  Minister,  after\nthe  Barbados  Pharmaceutical\nconsultation  with\nSociety;\n\none pharmacist engaged in the teaching of pharmacy,\nappointed  by  the  Minister  after  consultation  with  the\nprincipal or other person in charge of an institution in\nwhich  pharmacy  is  taught,  where  that  institution  is\nrecognized  by  the  Ministry  of  Education  as  an\ninstitution for the teaching of pharmacy; and\n\n(iv)\n\n3 persons, at the Minister’s discretion.\n\n2.\nThe Minister shall appoint from among the members of the\nCouncil, a Chairman who shall be a registered pharmacist, and a Deputy\nChairman.\n\n\f6\n\nA member of the Council, other than an ex officio member,\n3.\nmay resign his office by a letter in writing, addressed to the Minister.\n\n4.\nIn the event that a person ceases to hold office before the\nexpiry  of  his  term,  the  Minister  may,  subject  to  the  necessary\nrecommendation, if required, appoint a suitable person to hold office\nfor the unexpired portion of that term.\n\n5.\nin his absence, the Deputy Chairman shall preside.\n\nThe Chairman shall preside at meetings of the Council and,\n\nIn the absence at a meeting of both the Chairman and the\n6.\nDeputy Chairman, the members present and constituting a quorum shall\nelect one of their number to act as Chairman for that meeting.\n\n7.\nconstitute a quorum.\n\nSix  members  of  the  Council  present  at  a  meeting  shall\n\n8.\nas is necessary for the proper conduct of its business.\n\nThe Council shall meet at such places and times and as often\n\n9.\nEach member of the Council, except an ex officio member,\nshall hold office for a term of 2 years and is eligible for re-appointment.\n\n10.\nvotes but where voting is equal the Chairman has a casting vote.\n\nA decision of the Council shall be made by a majority of\n\n11.\nmember of Council, to perform the functions of the Secretary.\n\nThe Permanent Secretary shall assign a person, not being a\n\n12.\nshall be signed by the Chairman for that meeting.\n\nDecisions of the Council shall be recorded in writing and\n\n\f7\n\n13.\nprocedure.\n\nSubject to the Schedule, the Council may regulate its own\n\n14.\nmember of the Council.”.\n\nThe Minister may, in writing, revoke the appointment of any\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2015.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2015.\n\nPresident\n\n"
}