{
  "bill_id": 123,
  "slug": "loans-latin-american-development-bank-bill-2015",
  "title": "Loans (Latin American Development Bank) Bill 2015",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/33a4c316880a326bbde821b3d14f4ba7.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-10-21",
  "first_reading": "2015-10-21",
  "second_reading": "2015-10-20",
  "gazette_date": "2015-10-21",
  "passed_date": "2015-10-21",
  "markdown": "2015-10-16\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the raising or guaranteeing of loans from the Latin\nAmerican Development Bank by the Government of Barbados for the purpose\nof financing development projects in Barbados and for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\nShort title\n\nInterpretation\n\nBorrowing from the Latin American Development Bank\n\nLoans to be charged on the Consolidated Fund\n\nPower to issue and sign instruments\n\nImplementation of obligations\n\nArbitration\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the raising or guaranteeing of loans from the Latin\nAmerican Development Bank by the Government of Barbados for the purpose\nof financing development projects in Barbados and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nBank) Act, 2015.\n\nThis  Act  may  be  cited  as  the  Loans  (Latin  American  Development\n\nInterpretation\n\n2.\n\nFor the purposes of this Act,\n\n“Bank” means the Latin American Development Bank (Corporación Andina de\n\nFomento);\n\n“guarantee agreement” means a guarantee agreement concluded under section\n\n3(1);\n\n“loan agreement” means a loan agreement concluded under section 3(1).\n\nBorrowing from the Latin American Development Bank\n\nSubject to this Act, the Government may, in such manner, on such\n3.(1)\nterms and subject to such conditions as may be agreed with the Bank, borrow or\nguarantee the borrowing of such sums from the Bank or from funds administered\nby the Bank as are required for the purpose of financing or promoting economic\nand social development in Barbados.\n\nFor the purposes of subsection (1), the Government may fully guarantee\n(2)\nthe borrowing of sums from the Bank by agencies of the Government where the\nGovernment is satisfied that such borrowing will promote economic and social\ndevelopment in Barbados.\n\nAny sums borrowed or guaranteed under the authority of this Act shall be\n(3)\napplied and are hereby appropriated to the purposes for which they are borrowed\nor  guaranteed  as  specified  in  the  loan  agreement  or  guarantee  agreement  in\nrespect of those sums.\n\nThe power to borrow or guarantee conferred by subsection (1) is in addition\n\n(4)\nto any power to borrow or guarantee conferred by any other enactment.\n\n\f5\n\n(5)\nA copy of every loan agreement or guarantee agreement shall be laid before\nParliament within 120 days of the conclusion of that agreement or, if Parliament\ndoes not sit within that time, within 30 days after the commencement of its next\nsitting.\n\nLoans to be charged on the Consolidated Fund\n\nAll amounts required for the payment of sums borrowed or guaranteed\n4.\nby the Government under the authority of this Act and for the payment of all\ninterest and other charges on those sums are hereby charged upon and shall be\npayable out of the Consolidated Fund.\n\nPower to issue and sign instruments\n\nThe Minister may issue such instruments, including bonds, on such\n5.(1)\nterms and conditions as are necessary for the purposes of any loan agreement or\nguarantee agreement.\n\nAny bonds or other instruments issued under subsection (1) may be signed\n(2)\nby  the  Minister  or  such  person  as  the  Minister  designates  in  writing  for  the\npurpose.\n\nImplementation of obligations\n\n6.\nNotwithstanding any law in force in Barbados, a loan agreement or\nguarantee agreement and any instrument issued under section 5 shall be valid and\nenforceable and shall have full force and effect in accordance with its terms.\n\nArbitration\n\n7.\nAny dispute between the Government and the Bank and any claim by\nthe one against the other arising under any loan agreement or guarantee agreement\nor any instrument issued under section 5 which is not determined by agreement\nbetween the parties shall be submitted to arbitration in a manner to be agreed\nbetween them.\n\n\f6\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2015.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2015.\n\nPresident\n\n"
}