{
  "bill_id": 126,
  "slug": "barbados-tourism-inv-inc-and-china-natl-complete-plant-import-and-export-corp-ltd-us-1700m",
  "title": "Barbados Tourism Inv. Inc. and China Natl. Complete Plant Import and Export Corp Ltd. US $170.0M",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/9e4dae512f22e148cc34646de43bc1ef.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-11-18",
  "first_reading": "2015-11-17",
  "second_reading": "2015-11-17",
  "gazette_date": "2015-11-17",
  "passed_date": "2015-11-17",
  "markdown": "   L.R.O. 1998\n\nRESOLUTION NO.\n\nPARLIAMENT\n\nWHEREAS  by  section  2  of  the  Special  Loans  Act,  Cap.  105  the  Government  is\n\nauthorised  from  time  to  time  to  borrow  from  any  bank,  corporation,  company  or  other\n\ninstitution sums of money not exceeding in the aggregate BDS$2,500,000,000.00 on such terms\n\nas may be agreed upon between the Government and the lender of any such sum of money;\n\nAND WHEREAS by section 3 of the said Act it is provided that any money borrowed\n\nunder the authority of the Act shall be appropriated and applied to such purposes as Parliament\n\nmay approve by resolution and that such money and any interest payable thereon is charged\n\nupon the general revenues and assets of Barbados;\n\nAND  WHEREAS  the  Barbados  Tourism  Investment  Inc.  and  the  China  National\n\nComplete  Plant  Import  and  Export  Corporation  Limited  on  November  13,  2014  entered\n\ninto the Sam Lord's Castle Hotel Project Contract, hereinafter referred to as the Commercial\n\nContract,  for  the  purpose  of  implementing  the  Sam  Lord's  Castle  Hotel  Project;\n\nAND WHEREAS the Government considers it necessary to borrow the sum of up\n\nto US$170.0 million from the Export-Import Bank of China, the proceeds of which will be\n\non-lent to the Barbados Tourism Investment Inc. to ﬁ nance eighty ﬁ ve per cent of the total cost\n\nof the Sam Lord's Castle Hotel Project, on the terms and conditions contained in the Preferential\n\nBuyer Credit Loan Agreement, the main provisions of which are set out in the Schedule;\n\nTHE LAWS OF BARBADOS\nPrinted by the Government Printer, Bay Street, St. Michael\nby the authority of the Government of Barbados\n\n\f2\n\nAND  WHEREAS  the  said  sum  of  up  to  US$170.0  million  is  within  the\n\nauthorised  borrowing  limit  given  to  the  Government  under  section  2  of  the  said Act;\n\nBE IT RESOLVED therefore that Parliament approve the borrowing of the said sum\n\nof up to US$170.0 million from the Export-Import Bank of China to ﬁ nance eighty ﬁ ve per\n\ncent of the cost of the Sam Lord's Castle Hotel Project to be executed by the Barbados Tourism\n\nInvestment  Inc.  in  accordance  with  the  Commercial  Contract  and  on  the  terms  and\n\nconditions  contained  in  the  Agreement,  the  main  provisions  of  which  are  set  out  in\n\nthe Schedule.\n\nAPPROVED by the House of Assembly this            day of                                           ,\n\nTwo thousand and ﬁ fteen.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                                      ,\n\n# Two thousand and fi ft een.\n\nPresident\n\n\f3\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nAgreement:\n\nPreferential Buyer Credit Loan Agreement.\n\nBorrower:\n\nGovernment of Barbados.\n\nLender:\n\nAmount:\n\nFacility:\n\nPurpose:\n\nExport-Import Bank of China.\n\nUp to US$170 000 000.\n\nPreferential Buyers Credit.\n\nTo ﬁ nance 85 per cent of the cost of executing the Commercial Contract\nentered into by the Barbados Tourism Investment Inc. (hereinafter referred\nto as the End-User) and the China National Complete Plant Import and\nExport  Corporation  Limited  (hereinafter  referred  to  as  the  Chinese\nContractor)  on  November  13,  2014  for  the  execution  of  the\nSam Lord's Castle Hotel Project.\n\nAvailability Period:\n\nPeriod  commencing  on  the  date  on  which  the Agreement  becomes\neffective  and  ending  on  the  date  42  months  thereafter,  during  which\ntime all disbursements shall be made in accordance with the Agreement.\n\nTenor:\n\n20 years.\n\nRepayment:\n\nMoratorium period of 60 months, thereafter principal will be repaid in\n31 payments over 180 months.\n\nInterest Rate:\n\nFixed at 2.5 % per annum.\n\nInterest:\n\nInterest will be payable semi-annually in arrears and calculated on the\nbasis of an actual number of days elapsed and a 360 day year.\n\nCommitment Fee:\n\n0.25 % per annum payable semi-annually.\n\nManagement Fee:\n\n0.25 % (US$425 000) due 30 days after the contract becomes effective.\n\n\f   L.R.O. 1998\n\n4\n\nSCHEDULE - Cont'd\n\nTERMS AND CONDITIONS - Cont'd\n\nConditions Precedent:\n\n(A)  The ﬁ rst disbursement of funds on the Facility is conditional upon\nthe preparation, execution and delivery of legal documentation in\nthe form and substance satisfactory to the Lender and its Attorneys\nincorporating the following:\n\n(i)  Copies  of  the  Agreement,  the  Repayment  Mechanism\nAgreement and the Escrow Account Agreement which have\nbeen duly signed by all parties thereto respectively and have\nbecome effective;\n\n(ii)  Certiﬁ ed true copies of the Commercial Contract and other\nrelevant  documents  in  connection  therewith  acceptable\nto  the  Lender  which  have  been  duly  signed  by  all  parties\nthereto and have become effective;\n\n(iii)  The  Escrow  Account  has  been  established  according\nto  the Agreements  or  legal  documents  mentioned  above;\n\n(iv)  Drawdown schedule submitted by the Borrower which has\n\nbeen recognized and accepted by the Lender;\n\n(v)  Documents  evidencing  that  the  End-User  has  paid  to  the\nChinese  Contractor  the  proportional  counterpart  fund  in\naccordance with the Agreement;\n\n(vi)  The authorization of the Borrower, by which the Borrower\nauthorizes one or more representatives to sign the Agreement,\nIrrevocable Notice of Drawdown and any other documents\nin  relation  to  the Agreement,  and  the  signature  specimen\nof such authorized representatives;\n\n(vii)  Certiﬁ ed true copies of any and all documents which could\nevidence  that  the  Management  Fee  and  Commitment  Fee\npayable  hereunder  have  been  paid  by  the  Borrower  to  the\nLender in accordance with the Agreement;\nTHE LAWS OF BARBADOS\nPrinted by the Government Printer, Bay Street, St. Michael\nby the authority of the Government of Barbados\n\n\f   L.R.O. 1998\n\n5\n\nSCHEDULE - Cont'd\n\nTERMS AND CONDITIONS - Cont'd\n\nConditions Precedent:\n- (Cont'd)\n\n(viii) An original Irrevocable Notice of Drawdown in the form set\nout in the Agreement duly signed by the authorized signatory\nof the Borrower, and sent by courier or authenticated SWIFT\nnot later than the ﬁ fteenth (15th) Banking Day prior to the\ndate on which the drawdown is scheduled to be made; such\nIrrevocable Notice of Drawdown authorizes the Lender to\npay the relevant amount to the account designated by the\nBorrower, and such drawdown shall be in compliance with\nthe stipulations of the Commercial Contract;\n\n(ix)  The  Lender  has  received  the  certiﬁ ed  true  copies  of  sub-\ncontracts duly signed by and between the Chinese Contractor\nand the sub-contractors;\n\n(x)  Certiﬁ ed true copies of the Commercial Contract Amendment\nstipulating  the  validity  of  the  Performance  Bond  and\nWarranty Bond duly signed by the relevant parties;\n\n(xi)  Certified  true  copies  of  Hotel  Management Agreement\n\nduly signed by the relevant parties;\n\n(xii)  Legal  opinion  in  the  form  and  substance  set  forth  in  the\nAgreement or in the form and substance otherwise approved by\nthe Lender in writing issued by the Ministry of Justice or other\ngovernmental  institutions  with  the  similar  authority  of\nthe Borrower's Country in connection with the transactions\ncontemplated hereunder;\n\n(xiii) The irrevocable power of attorney to the process agent by\nthe Borrower in the form set forth in the Agreement or in the\nform  and  substance  otherwise  approved  by  the  Lender  in\nwriting  and  the  written  confirmation  of  acceptance  of\nappointment  by  such  process  agent  in  the  form  set  forth\nin  the Agreement  or  in  the  form  and  substance  otherwise\napproved by the Lender in writing;\nTHE LAWS OF BARBADOS\nPrinted by the Government Printer, Bay Street, St. Michael\nby the authority of the Government of Barbados\n\n(xiv) Such  other  document(s)  or  condition(s)  relating\nto  the  transactions  under  the Agreement  as  the  Lender\nmay reasonably request.\n\n\f   L.R.O. 1998\n\n6\n\nSCHEDULE - Cont'd\n\nTERMS AND CONDITIONS - Cont'd\n\nConditions Precedent:\n- (Concl'd)\n\nIn the event that the Borrower fails to fulﬁ ll the above conditions\nwithin one year after the effectiveness of the Agreement, the Lender\nshall have the right to re-evaluate the implementation conditions of\nthe Project and utilization conditions of the Facility to determine\nwhether  to  continue  the  performance  of  the Agreement  or  not.\n\n(B)  Each subsequent disbursement shall be subject to the Borrower\nfulﬁ lling all the conditions set out in paragraph (A) and the Lender\nreceiving the following documents:\n\n(i)  An  original  Irrevocable  Notice  of  Drawdown  in  the\nform  set  out  in  the Agreement  hereto  duly  signed  by  the\nauthorized  signatory  of  the  Borrower,  and  sent  by  courier\nnot later than the ﬁ fteenth (15th) Banking Day prior to the\ndate on which the drawdown is scheduled to be made; such\nIrrevocable  Notice  of  Drawdown  authorizes  the  Lender\nto  pay  the  relevant  amount  to  the  account  designated  by\nthe  Borrower,  and  such  drawdown  shall  be  in  compliance\nwith  the  stipulations  of  the  Commercial  Contract;\n\n(ii)  Documents  evidencing  that  the  End-User  has  paid  to  the\nChinese  Contractor  the  proportional  counterpart  fund  in\naccordance with the Agreement;\n\n(iii)  No Event of Default has occurred (or will likely to occur as\na result of the drawdown being made) under the Agreement;\n\n(iv)  All  representations,  warranties,  and  undertakings  made\nby  the  Borrower  hereunder  shall  be  true  and  correct  as\nat  the  date  such  drawdown  is  scheduled  to  be  made  with\nreference  to  the  facts  and  circumstances  then  subsisting;\n\n(v)  The Borrower has paid the commitment fee and the interest due\n\nand payable under the Agreement;\n\n(vi)  The Facility has not been terminated;\n\nTHE LAWS OF BARBADOS\nPrinted by the Government Printer, Bay Street, St. Michael\nby the authority of the Government of Barbados\n\n(vii)  Such  other  documents  and  conditions  as  the  Lender  may\n\nreasonably request.\n\n\f   L.R.O. 1998\n\n7\n\nSCHEDULE - Concl'd\n\nTERMS AND CONDITIONS - Concl'd\n\nEvents of Default:\n\nEach  of  the  following  events  and  circumstances  shall  be  an\nEvent of Default:\n\n(i)\n\nthe Borrower, for any reason, fails to pay any due and payable\nprincipal, interest, commitment fee, management fee or other\nsums in accordance with the provisions hereof;\n\n(ii)  any representation and warranty made by the Borrower in any of\nthe Articles of the Agreement, or any certiﬁ cate, document and\nmaterial submitted and delivered by the Borrower pursuant to the\nAgreement proves to have been untrue  or incorrect in any material\nrespect;\n\n(iii)  the  Borrower  fails  to  punctually  perform  any  of  its  other\nobligations under the Agreement or is in breach of any of its\ncovenants and undertakings made under the Agreement and\ndoes not remedy such breach to the satisfaction of the Lender\nwithin 30 days after receipt of written notice from the Lender\nrequiring it to do so;\n\n(iv)  any other event which constitutes a default of the Borrower occurs\nin respect of any other agreement involving the borrowing of\nmoney or any guarantee between the Borrower and any other\nbanks or ﬁ nancial institutions;\n\n(v)\n\nsigniﬁ cant changes have occurred with respect to the Project\nor  the  Borrower,  either  of  which,  in  the  opinion  of  the\nLender, may have material adverse effect on the ability of\nthe Borrower to perform its obligations under the Agreement;\n\n(vi)\n\nthe  Borrower  stops  or  suspends  repayment  to  its  creditors\ngenerally.\n\nGoverning Law:\n\nLaw of China.\n\nTHE LAWS OF BARBADOS\nPrinted by the Government Printer, Bay Street, St. Michael\nby the authority of the Government of Barbados\n\n\f8\n\nADDENDUM\n\nThis Resolution seeks the approval of Parliament for the borrowing of up to US$170.0\n\nmillion, a sum which is within the limit of the Special Loans Act, Cap. 105, from the Export-\n\nImport Bank of China.\n\nThe purpose of the loan is to ﬁ nance 85 per cent of the Sam Lord's Castle Hotel Project\n\nbeing  undertaken  by  the  Barbados  Tourism  Investment  Inc.  The  loan  proceeds  will  be\n\non-lent  to  the  Barbados  Tourism  Investment  Inc.  to  facilitate  the  Sam  Lord's  Castle\n\nHotel  Project  which  will  be  undertaken  in  accordance  with  the  Commercial  Contract\n\nentered  into  between  Barbados Tourism  Investment  Inc.  and  the  China  National  Complete\n\nPlant Import and Export Corporation Limited.\n\n"
}