{
  "bill_id": 127,
  "slug": "value-added-tax-amendment-no2-bill-2015",
  "title": "Value Added Tax (Amendment) (No.2) Bill, 2015",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/30ebb5aaadeee93f8d995676ba96b5e8.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-12-16",
  "first_reading": "2015-12-16",
  "second_reading": "2015-12-15",
  "gazette_date": "2015-12-07",
  "passed_date": "2015-12-16",
  "markdown": "2015-12-16\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Value  Added  Tax  Act,  Cap.  87  to  increase  the\nefficiency of tax administration, provide for the imposition of value added tax on\ncertain mobile services and enhance the enforcement provisions in the Act and\nfor related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 2 of Cap. 87\n\nAmendment of section 7 of Cap. 87\n\nAmendment of section 13 of Cap. 87\n\nAmendment of section 15 of Cap. 87\n\nInsertion of section 22A into Cap. 87\n\nInsertion of section 28A into Cap. 87\n\nAmendment of section 34 of Cap. 87\n\nAmendment of section 46 of Cap. 87\n\n10.\n\nAmendment of section 47 of Cap. 87\n\n11.\n\nAmendment of section 51 of Cap. 87\n\n12.\n\nAmendment of section 60 of Cap. 87\n\n13.\n\nAmendment of section 69 of Cap. 87\n\n14.\n\nAmendment of section 73 of Cap. 87\n\n15.\n\nAmendment of section 75 of Cap. 87\n\n\f3\n\n16.\n\nAmendment of section 82 of Cap. 87\n\n17.\n\nAmendment of section 90 of Cap. 87\n\n18.\n\nAmendment of section 91 of Cap. 87\n\n19.\n\nInsertion of section 91A into Cap. 87\n\n20.\n\nAmendment of section 98 of Cap. 87\n\n21.\n\nAmendment of section 99 of Cap. 87\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Value Added Tax Act, Cap. 87  to increase the efficiency\nof tax administration, provide for the imposition of value added tax on certain\nmobile services and enhance the enforcement provisions in the Act and for\nrelated matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\nAct, 2015.\n\nThis Act may be cited as the Value Added Tax (Amendment) (No. 2)\n\nAmendment of section 2 of Cap. 87\n\nSection 2 of the Value Added Tax Act, Cap. 87, in this Act referred\n2.\nto as the principal Act, is amended by inserting in the appropriate alphabetical\norder the following definition:\n\n“ “electronic service” means an essentially automated service which is\nsupplied via the internet or a similar electronic network and cannot\nbe obtained without the use of information technology;”.\n\nAmendment of section 7 of Cap. 87\n\n3.\n\nSection 7 of the principal Act is amended by\n\n(a)\n\ndeleting subsection (7) and substituting the following:\n\n“(7)\nA registrant who makes a taxable supply in Barbados to another\nregistrant shall, within 30 days of the supply, issue a tax invoice to the\nother\nas  may  be\nregistrant\nprescribed.”; and\n\nsuch  particulars\n\ncontaining\n\n(b)\n\ninserting immediately after subsection (12) the following:\n\n“(13)\nNotwithstanding anything in this section, with effect from the\n1st day of January, 2016, the tax imposed on the supply of the mobile\nservices of voice, data and text messaging is 22 percent and is payable\nby the registrant at the time the supply is made.”.\n\n\f7\n\nAmendment of section 13 of Cap. 87\n\n4.\nafter subsection (3) the following as subsection (3A):\n\nSection 13 of the principal Act is amended by inserting immediately\n\n“(3A)\nFor  the  purposes  of  this  Act,  where  a  supplier  provides  an\nelectronic  service,  the  provision  of  the  electronic  service  shall  be\ndeemed to be a supply of services. ”.\n\nAmendment of section 15 of Cap. 87\n\n5.\n(6) and (7) and substituting the following:\n\nSection 15 of the principal Act is amended by deleting subsections\n\n“(6)\nNotwithstanding subsection (5), where a person pays in Barbados\nfor  international  travel  or  for  an  international  package  tour,  but  the\njourney begins outside of Barbados and\n\n(a)\n\nthe ticket for the journey or tour is issued outside of Barbados\nin the name of another person who is outside Barbados at the\ntime payment is made; or\n\n(b)\n\nthe entire journey takes place outside of Barbados,\n\nthe supply of the international travel or the international package tour\nshall be deemed to have taken place outside of Barbados.\n\nFor  the  purposes  of  this  section  “ticket”  means  any  written\n(7)\ninstrument issued within or outside of Barbados whereby a person on\na  journey  is  entitled  to  be  provided  with  transportation  either  from\nBarbados or from a place outside of Barbados, or any re-written or re-\nissued document thereof, to the like effect and includes an electronic\ncoupon, itinerary, receipt or boarding document issued by a carrier.”.\n\n\f8\n\nInsertion of section 22A into Cap. 87\n\n6.\n22, the following as section 22A:\n\nThe principal Act is amended by inserting immediately after section\n\n“Re-payment of input tax\n\n22A.\nWhere in accordance with section 53, a registrant has written\noff as a bad debt, all or part of the consideration for a taxable supply\nmade to another registrant and the registrant to whom the supply was\nmade  claimed  allowable  input  tax  in  respect  of  that  supply,  that\nregistrant shall repay to the Comptroller any input tax claimed in respect\nof the supply.”.\n\nInsertion of section 28A into Cap. 87\n\n7.\n28, the following as section 28A:\n\nThe principal Act is amended by inserting immediately after section\n\n“Tax to be paid directly to the Comptroller\n\n28A.\nWhere  an  accounting  officer  or  any  officer  authorised  by\nhim for the purpose enters into a contract on behalf of the Government\nwith  a  registrant  for  the  provision  of  goods  or  services  to  the\nGovernment, the amount payable to the registrant as tax in respect of\nthe supply of goods or services, shall be paid directly to the Comptroller\nby  the  accounting  officer  or  the  officer  authorised  by  him  for  that\npurpose.”.\n\n\f9\n\nAmendment of section 34 of Cap. 87\n\n8.\n\nSection 34 of the principal Act is amended by\n\n(a)\n\ndeleting subsection (4) and substituting the following:\n\nA person who fails to comply with subsection (1), (2) or (3) of\n\n“(4)\nthis section shall\n\n(a)\n\n(b)\n\n(c)\n\nbe compulsorily registered from such date as is applicable\nunder  this  Act  or  such  other  date  as  the  Comptroller\ndetermines is applicable;\n\npay to the Comptroller a penalty not exceeding $1 000 as the\nComptroller determines; and\n\nnot be entitled to a refund of input tax under section 47 for\nthe  period  during  which  that  person  should  have  been\nregistered for the purposes of this Act.”; and\n\n(b)\n\ndeleting subsection (4C) and substituting the following:\n\n“(4C)\nWhere a person who is registered under subsection (4A) fails to\ncommence  the  taxable  activity,  the  Comptroller  may,  subject  to\nsubsections (4D), (4E) and (4F), cancel the registration of that person\nand that person shall be required to pay to the Comptroller within 21\ndays of the cancellation of the registration or such further period as the\nComptroller may allow, an amount equivalent to the total tax that the\nregistrant is deemed by section 46(2) to have paid on account of the\noutput tax payable by him and which had been refunded to him during\nthe period of his registration.”.\n\n\f10\n\nAmendment of section 46 of Cap. 87\n\n9.\n\nSection 46 of the principal Act is amended by\n\n(a)\n\ninserting immediately after subsection (1) the following as subsection\n(1A):\n\nThe Comptroller may at any time, in writing, extend the time for\n“(1A)\npayment of any output tax beyond the date on which it is required to be\npaid under subsection (1).”; and\n\n(b)\n\ninserting immediately after subsection (6) the following as subsection\n(7):\n\nWhere, under subsection (1A), the Comptroller extends the time\n“(7)\nfor  payment  of  an  amount  of  output  tax,  interest  is  payable  under\nsubsection (4) as if the time for payment of that amount had not been\nextended.”.\n\nAmendment of section 47 of Cap. 87\n\n10.\nand substituting the following:\n\nSection 47 of the principal Act is amended by deleting subsection (6)\n\nInterest of less than $5 shall not be payable under subsection (4)\n\n“(6)\nor (5).”.\n\nAmendment of section 51 of Cap. 87\n\n11.\n\nSection 51 of the principal Act is amended\n\n(a)\n\nin  subsection  (1)  by  deleting  paragraph  (b)  and  substituting  the\nfollowing:\n\n\f11\n\n“(b)\n\nan amount of output tax equal to the total of all allowable\ninput tax that the person was deemed by subsection 46(2) to\nhave paid on account of output tax payable by the person for\ntaxable periods that ended while he was registered shall be\ndeemed to be payable by the person in the last taxable period\nduring which he was registered.”; and\n\n(b)\n\nby deleting subsection (3).\n\nAmendment of section 60 of Cap. 87\n\n12.\nthe following:\n\nThe principal Act is amended by deleting section 60 and substituting\n\n“Remissions\n\n60.(1)\nThe Minister may, by order published in the Gazette, waive,\nremit or refund, in whole or in part, any tax, penalty, interest or other\namount payable under this Act where he is satisfied that it is just and\nequitable  to  do  so,  or  in  order  to  give  effect  to  the  terms  of  any\nagreement or arrangement to which Barbados is a party.\n\nAn order made under subsection (1) may contain such terms and\n\n(2)\nconditions as the Minister considers appropriate.”.\n\nAmendment of section 69 of Cap. 87\n\n13.\ndeleting paragraph (f) and substituting the following:\n\nSection  69  of  the  principal  Act  is  amended  in  subsection  (2)  by\n\n“(f)\nthe  Comptroller  shall,  where  a  refund  for  a  taxable  period  is\npayable to the person, apply the refund payable against any outstanding\ntax,  penalty,  interest  or  other  amount  payable  under  this  Act  by  the\n\n\f12\n\nperson  and  pay  the  balance,  if  any,  to  the  receiver  on  behalf  of  the\nperson; and”.\n\nAmendment of section 73 of Cap. 87\n\n14.\nafter subsection (4) the following as subsection (5):\n\nSection 73 of the principal Act is amended by inserting immediately\n\nThe  Electronic  Transactions  Act,  Cap.  308B,  applies,  mutatis\n\n“(5)\nmutandis, to this Act. ”.\n\nAmendment of section 75 of Cap. 87\n\n15.\nafter subsection (1) the following as subsection (1A):\n\nSection 75 of the principal Act is amended by inserting immediately\n\nWhere the records and books of account referred to in subsection\n“(1A)\n(1) are kept in an electronic form, they shall be kept in a retrievable\nformat that is easily accessible by the Comptroller.”.\n\nAmendment of section 82 of Cap. 87\n\n16.\nand substituting the following:\n\nSection 82 of the principal Act is amended by deleting subsection (6)\n\nInterest  of  less  than  $5  shall  not  be  paid  or  applied  under\n\n“(6)\nsubsection (5).”.\n\nAmendment of section 90 of Cap. 87\n\n17.\nafter subsection (2) the following as subsections (3), (4), (5), (6) and (7):\n\nSection 90 of the principal Act is amended by inserting immediately\n\n\f13\n\n“(3)\nWhere a tax debtor fails to pay the amount specified in an unpaid\ntax  certificate  within  21  days  after  the  filing  of  the  certificate  in\naccordance with subsection (2), the Comptroller may publish a notice\nof  the  unpaid  tax  certificate  in  at  least  2  newspapers,  each  having  a\ncirculation of not less than 5 days in any one week in Barbados.\n\nAn unpaid tax certificate filed in the High Court in accordance\n(4)\nwith subsection (2) shall affect lands, tenements or hereditaments as to\npurchasers, mortgagees or judgment creditors as if the certificate were\na judgment registered under section 2 of the Registration of Judgments\nAct, Cap. 210.\n\nA copy of an unpaid tax certificate filed in the High Court and\n(5)\ncertified as such by the Registrar of the Supreme Court, shall be lodged\nwith the Registrar of Titles who shall issue a receipt in such form as he\nmay determine in respect of the unpaid tax certificate.\n\nWhere the amount referred to in subsection (2) has been paid or\n(6)\nremitted to the Crown in satisfaction of an unpaid tax certificate, the\nComptroller shall certify in a memorandum of satisfaction that the tax\ndebtor has paid such amount.\n\nA memorandum of satisfaction referred to in subsection (6) shall\n(7)\nbe filed in the court in which the unpaid tax certificate is registered and,\nin the case of an unpaid tax certificate filed in the High Court, a copy\nof the memorandum of satisfaction, certified as such by the Registrar\nof the Supreme Court, shall be lodged with the Registrar of Titles who\nshall issue a receipt in such form as he may determine in respect of the\nmemorandum of satisfaction.”.\n\nAmendment of section 91 of Cap. 87\n\n18.\nafter subsection (6) the following as subsection (6A):\n\nSection 91 of the principal Act is amended by inserting immediately\n\n\f14\n\n“(6A)\nFor  the  purposes  of  this  section  “third  party”  includes\ncommercial banks, credit unions and other financial institutions where\nthe tax debtor has an account.”.\n\nInsertion of section 91A into Cap. 87\n\n19.\n91 the following as section 91A:\n\nThe principal Act is amended by inserting immediately after section\n\n“Distress\n\n91A.(1)\nSubject  to  section  90,  where  the  Comptroller  delivers  a\ndemand for an amount payable or remittable under this Act, including\nthe rate of interest thereon requiring the tax debtor to make the payment\nforthwith  and  the  tax  debtor  fails  to  comply  with  that  demand,  the\nComptroller or other person authorised by him may, by warrant, levy\ndistress against the goods and chattels of the tax debtor.\n\nThe Comptroller shall only issue a warrant to levy distress under\n(2)\nsubsection  (1)  where  he  has  served  the  tax  debtor  personally  with  a\nwritten notice of his intention to levy distress and a schedule of the items\nto be seized.\n\nA warrant to levy distress shall be issued 5 days after the date of\n(3)\nservice  of  a  notice  under  subsection  (2)  or  as  soon  as  is  practicable\nthereafter.\n\nIt shall be lawful for the Comptroller or other person authorised\n(4)\nby him, in the presence of a member of the Police Force, to enter into\nthe premises of a tax debtor upon a warrant to take and seize as a distress\nfor any amount payable under this Act, any goods and chattels of the\ntax debtor except those goods and chattels that\n\n(a)\n\nare  held  by  the  tax  debtor  subject  to  the  terms  of  a  hire\npurchase agreement or a lease;\n\n\f15\n\n(b)\n\nconstitute  fixtures,  the  removal  of  which  will  cause\nirreparable damage to the tax debtor’s premises; or\n\n(c)\n\nconstitute tools of trade,\n\nto appraise, sell or otherwise dispose of the same towards satisfaction\nof the amount payable under this Act for which distress is taken and the\ncharges of the distress, appraisement and sale.\n\nEntry  upon  any  such  warrant  shall  not  be  made  on  a  Sunday,\n(5)\nGood Friday or Christmas Day or at any time except between the hours\nof 8 in the morning and 5 in the afternoon.\n\nA person who destroys, sells or otherwise disposes of any of the\n(6)\ngoods  contained  in  a  schedule  of  items  to  be  distrained  upon  under\nsubsection  (2)  is  guilty  of  an  offence  and  is  liable  on  summary\nconviction to a fine of $10 000 or to imprisonment for a term of one\nyear or both.”.\n\nAmendment of section 98 of Cap. 87\n\n20.\nimmediately after paragraph (b) the following as paragraph (bb):\n\nSection  98  of  Cap.  87  is  amended  in  subsection  (1)  by  inserting\n\n“(bb)\n\nhaving received a notice referred to in section 93, fails to pay\nthe amount specified in that notice or to provide security in\nan  amount  and  a  form  satisfactory  to  the  Comptroller  for\npayment  thereof  and  wilfully  leaves  or  attempts  to  leave\nBarbados;”.\n\nAmendment of section 99 of Cap. 87\n\n21.\nand substituting the following:\n\nSection 99 of the principal Act is amended by deleting subsection (1)\n\n\f16\n\n“(1)\nAny  person  who  contravenes  any  provision  of  this  Act  or  the\nregulations for which no other fine or term of imprisonment is provided\nunder this Act is guilty of an offence and, in addition to any penalty he\nis otherwise liable to pay, is liable on summary conviction to a fine of\n$25 000.”.\n\n"
}