{
  "bill_id": 128,
  "slug": "supplementary-estimates-no-5-20152016",
  "title": "Supplementary Estimates No. 5 2015-2016",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/2a85b62407b17f4fca3a88e443a80fba.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2015-12-04",
  "first_reading": null,
  "second_reading": "2015-12-15",
  "gazette_date": "2015-12-15",
  "passed_date": "2015-12-15",
  "markdown": "HOUSE OF ASSEMBLY\nResolved that the sum of ONE MILLION THREE HUNDRED AND SIXTEEN THOUSAND SIX HUNDRED AND FIFTY-EIGHT DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2015-2016 as shown in the Supplementary Estimates No.5 2015-2016 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2015 — 2016 No.5\nHEAD Code Provision in Number Approved Estimates 2015 - 2016 Other 4 Expenditure | HEAD: 13 PRIME MINISTER'S OFFICE Program: 495 50‘ Anniversary of Independence Celebrations Subprogram: 8500 Secretariat for the 50\" 134958500 Anniversary of Independence Celebrations Account Code: 102 Other Personal Emoluments 0 Account Code: 103 Employers Contributions 0 Account Code: 206 Travel 0 Account Code: 207 Utilities 0 Account Code: 208 Rental of Property 0 Account Code: 209 Library Books and | 0 Publications | Account Code: 210 Supplies and Materials 0 | Account Code: 211 Maintenance of Property 0\nProvision in Supplementary Supplementary Provision Estimates Required No. 1-4\nOther Other Expenditure Expenditure\n17,348\n1,778\n8,000\n54,150\n109,280\n3,000\n47,397\n6,000\nAccount Code: 212 Operating Expenses ; } Account Code: 752 Machinery and Equipment Account Code: 753 Furniture and Fixtures 1,029,805 25,000 14,900\n|\nADDENDUM\nHEAD 13 PRIME MINISTER’S OFFICE\nThe Prime Minister’s Office is seeking the sum of $1,316,658 to supplement Head 13 Prime Minister’s Office in the Estimates of Expenditure for the financial year 2015-2016 as follows:-\nProgram Number 495: 50th Anniversary of Independence Celebrations Subprogram Number 8500: Secretariat for the 50” Anniversary of Independence Celebrations\nThe sum of $1,316,658 is required to cover the costs associated with the - establishment of the 50\" Anniversary of Independence Celebrations Secretariat and the execution of and preparation for activities and projects for Barbados’ 50\" Anniversary of Independence Celebrations.\n"
}