{
  "bill_id": 130,
  "slug": "labour-department-amendment-bill-2017",
  "title": "Labour Department (Amendment) Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/7269cf7a6217c7d09bce7c4fecdb0ae3.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-01-18",
  "first_reading": "2017-01-25",
  "second_reading": "2017-01-17",
  "gazette_date": "2017-01-25",
  "passed_date": "2017-01-25",
  "markdown": "Explanatory Memorandum After pages 5\n\n2017-01-23\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Labour Department Act, Cap. 23 to increase the\n\npenalties under the Act and to provide for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nAmendment of Section 12 of Cap. 23\n\nSavings\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Labour Department Act.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2017.\n\nThis Act may be cited as the Labour Department (Amendment) Act,\n\n\f4\n\nAmendment of Section 12 of Cap. 23\n\n2.\nfollowing is substituted:\n\nSection 12 of the Labour Department Act, Cap. 23 is deleted and the\n\n“Offences\n\n12.(1)\nEvery person who, being required in accordance with this\nAct to furnish information or particulars to the Chief Labour Officer,\nDeputy Chief Labour Officer or a Labour Officer, and who\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nwilfully refuses or without lawful cause neglects to furnish\nthe  information  or  particulars  required  within  the  time\nspecified  or  in  the  form  specified  or  prescribed  or  to\nauthenticate the same in the prescribed manner or to deliver\nthe same at the place or in the manner specified or described\nfor the delivery thereof;\n\nwilfully  furnishes  or  causes  to  be  furnished  any  false\ninformation or particulars lawfully requested;\n\nrefuses  to  answer  or  wilfully  gives  a  false  answer  to  any\nquestion necessary for the provision of any information or\nparticulars required; or\n\nhinders,  obstructs  or  molests  the  Chief  Labour  Officer,\nDeputy  Chief  Labour  Officer  or  a  Labour  Officer  in  the\nexercise of any of the powers conferred upon him by law,\n\nis guilty of an offence and is liable on summary conviction to a fine of\n$10 000, to imprisonment for a term of one year, or to both.\n\nWhere a person is convicted of an offence under this Act and a\n(2)\nfine is imposed, and that person fails to comply with the order of the\ncourt in respect of that fine, that person is liable to a further fine of $500\nfor each day during which the failure to comply continues.”.\n\n\f5\n\nSavings\n\n3.\n12 of the Labour Department Act, Cap. 23,\n\nNotwithstanding section 2, where an offence committed under section\n\n(a)\n\n(b)\n\nis being tried under the Magistrate’s Courts Act, Cap. 116A; or\n\nwas to be tried under the Magistrate’s Courts Act, Cap. 116A\n\nbefore the commencement of this Act, the trial in respect of that offence shall be\ncontinued  to  its  final  determination  in  accordance  with  the  provisions  of  the\nLabour Department Act, Cap. 23, as if this Act had not been enacted.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2017.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2017.\n\nPresident\n\n\fLABOUR DEPARTMENT (AMENDMENT) ACT, 2017\n\nEXPLANATORY MEMORANDUM\n\nThe An Act to amend the Labour Department Act, Cap. 23 which was passed\nin  1943  to  provide  for  the  administration  of  the  Labour  Department  in  the\nMinistry of Labour.\n\nClause 1:\n\nprovides a short title for the citation of the Act.\n\nClause 2:\n\nClause 3:\n\namends section 12 to increase the penalty for offences under\nthe Act.\n\nmakes provision for offences that may be in the process of\nbeing tried at the time this Act takes effect.\n\ni\n\n"
}