{
  "bill_id": 131,
  "slug": "compulsory-acquisition-of-land-at-brighton-st-george",
  "title": "Compulsory Acquisition of land at Brighton, St. George",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/56fdc5daef7251a0d8442dfcc36b38ef.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-03-09",
  "first_reading": null,
  "second_reading": "2016-03-08",
  "gazette_date": null,
  "passed_date": "2016-05-04",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament, in accordance with section 5 of the Land Acquisition Act, Cap. 228, approve the compulsory acquisition by the Crown of the parcel of land the property of Brighton Plantation Limited situate at Brighton in the parish of Saint George in this [sland, more particularly described in the Schedule hereto for the public purpose of the provision of car parking facilities for the Barbados Vocational Training Board, St. Luke's Training Centre and for after-hours recreational use.\nAPPROVED by the Flouse of Assembly this\nday of\n» [wo Thousand and fifteen.\nSpeaker\nAPPROVED by the Senate this\nday of\n, Two\nThousand and Fifteen.\nPresident\nnN\nSCHEDULE\nALL THAT land the property of the Brighton Plantation Limited situate at Brighton in the parisn of St. George in this Island containing by admeasurement 1107.7 square metres or thereabouts Abutting and Bounding on lands now or formerly of the Barbados Government on a public road and on another public road, which leads to St. Luke's Chapel in one direction and ona private road which is 7.92 metres wide or however else the same may abut and bound as shown and delineated on a Plan certified on the 28\" day of July, 2015 by Anderson R. Alleyne, Land Surveyor and recorded in the Lands and Surveys Department on the 30\" day of July, 2015 as Plan No. 707/2015.\na\nADDENDUM\nOn the 21\" day of August, 2014, the Cabinet agreed to the acquisition of approximately 1,108 square metres of land situate at Brighton in the parish of St. George the property of Brighton Plantation Limited which address is Brighton Plantation House in the parish of St. George for the provision of car parking facilities for the Barbados Vocational Training Board, St. Luke's Training Centre and for after-hours recreational use.\nIn accordance with section 5 of the Land Acquisition Act, Cap. 228, the approval of Parliament is now sought for the compulsory acquisition of the parcel of land, described in the Schedule hereto, so that the Crown may acquire an indefeasible title to the said parcel of land in order that the public purpose set out in this Resolution may be effected.\n"
}