{
  "bill_id": 132,
  "slug": "vesting-in-central-bank-of-barbados-land-at-church-village-in-the-city-of-bridgetown",
  "title": "Vesting in Central Bank of Barbados - Land at Church Village in the City of Bridgetown",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3b3df75dcb59b590d3a28ae37efbd35b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-02-29",
  "first_reading": "2016-03-09",
  "second_reading": "2016-02-26",
  "gazette_date": null,
  "passed_date": "2016-03-09",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament, in accordance with section 5 of the Crow Lands (Vesting and Disposal) Act, Cap. 225, approve the vesting in the Central Bank of Barbados of the parcel of land, the property of the Crown, situate at Church Village in the City of Bridgetown in this [sland and more particularly described in the Schedule hereto, for the redevelopment of that City district by the Central Bank of Barbados.\nAPPROVED by the House of Assembly this day of ; Two thousand and fifteen.\nSpeaker\n\nAPPROVED by the Senate this\nday of\nTwo thousand and fifteen.\nPresident\n.\nSCHEDULE\nALL THAT LAND the property of the Crown situate at Church Village in the city of Bridgetown in this [sland containing by admeasurement 9,994.6 square metres or thereabouts (inclusive of 840.1 square metres in public road) Abutting and Bounding on a public road leading to Pollgreen Alley, on a public road known as Garnet Street, on a minor road, on the said public road known as Garnet Street, on a public road known as St. Michael's Row leading to the Queen Elizabeth Hospital in one direction and to Trafalgar Square in the other direction, on a public road known as Church Street and on another public road or however clse the same may abut and bound as shown and delineated on a Plan certified on the 6\" day of March, 2015 by Camille Belgrave, Land Surveyor and recorded in the Lands and Surveys Department on the 19\" day of March, 2015 as Plan No. 217/2015.\nADDENDUM\nTwenty-two (22) parcels of land situate at Church V lage in the City of Bridgetown were acquired under the provisions of the Land Acquisition Act, Cap. 228. The parcels became vested in the Crown by virtue of the Notices of the acquisition which were published in the Official Gazette on the 16\" day of April, 1981 and the 7 day of December, 1981 and recorded in the Annual Volumes of Statutory Instruments as Statutory Instrument No. 60 of 1981 and Statutory Instrument No. 205 of 1981 respectively,\nOn 20\" September, 2001, the Cabinet agreed, inter alia, that the residents at Church Village in the City of Bridgetown should be relocated to facilitate the redevelopment of that City district by the Central Bank of Barbados and that the said residents should be relocated to Lower Burney in the parish of Saint Michael.\nIt was also agreed that, following the relocation exercise, the land at Church Village in the City of Bridgetown should be vested in the Central Bank of Barbados, for the redevelopment of that district.\nIn accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Partiament is now sought for the vesting in the Central Bank of Barbados of the parcel of land, more particularly described in the Schedule to this Resolution, for the public purpose of redeveloping the district of Church Village.\n"
}