{
  "bill_id": 133,
  "slug": "supplementary-estimates-no6-20152016",
  "title": "Supplementary Estimates No.6 2015-2016",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/81ca1c314b4623acc93ec472fbcf3d84.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2015-12-11",
  "first_reading": "2015-12-15",
  "second_reading": "2015-12-15",
  "gazette_date": null,
  "passed_date": "2015-12-15",
  "markdown": "HOUSE OF ASSEMBLY\nResolved that the sum of TEN MILLION FOUR HUNDRED AND THIRTY-ONE THOUSAND AND THIRTY DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2015-2016 as shown in the Supplementary Estimates No.6 2015-2016 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2015 — 2016 No.6\nHEAD Code Provision in Provision in Supplementary Number Approved Supplementary Provision Estimates Estimates Required 2015 - 2016 No. 1-5 Other Other Other Expenditure Expenditure Expenditure HEAD: 16 MINISTRY OF CIVIL SERVICE Program: 484 Human Resource Strategy Subprogram: 0335 Government Wide Area 164840335 Network Project Account Code: 226 Professional Services 595,997 776,800 HEAD: 21 MINISTRY OF FINANCE AND ECONOMIC AFFAIRS Program: 112 Financial Control and Treasury Management Subprogram: 0131 Treasury 211120131 Account Code: 212 Operating Expenses 2,131,597 1,800,000\nProgram: 113 Revenue Collection Subprogram: 0133 Customs Account Code: 102 Other Personal Emoluments Account Code: 103 Employers Contributions HEAD: 79 MINISTRY OF INDUSTRY, INTERNATIONAL BUSINESS, COMMERCE AND SMALL BUSINESS DEVELOPMENT Program: 040 Direction and Policy Formulation Services Subprogram: 0490 International Business and Financial Services Account Code: 212 Operating Expenses 211130133 211130133 680,456 390,499 189,116\n5,175,809\n2,457,676\n220,745\nADDENDUM\nSupplementary Provision in the amount of $776,800.00 is required for\nHead 16:\nMinistry of the Civil Service\nProgramme 484:\nHuman Resource Strategy\nSub-programme 0335 Government Wide Area Network Project\nAccount Code 226 Professional Services\nThe sum of $776,800.00 is required to meet the costs associated with the payment to Digicel (Barbados) Limited for the implementation of a Government Wide Area Network (WAN) during financial year 2015-2016. This arose because funding for this project was approved under Non-Statutory Capital Expenditure and not Professional Services as is required. ©\nADDENDUM\nHead 21 — Ministry of Finance and Economic Affairs Programme -113: Revenue Collection\nSubprogramme — 0133: Customs\nAccount Code 102- Other Personal Emoluments $5,175,809\nAccount Code 102- Employers Contributions $ 2,457,676\nThe Supplementary funds are required for the payment of salaries and National Insurance\nHead 21 —Ministry of Finance and Economic Affairs Programme -112: Financial Control and Treasury Management\nSubprogramme — 0131: Treasury\nAccount Code 212-Operating Expenses $1,800,000\nThe Supplementary funds are required for the payment of Commission on Credit Cards.\nADDENDUM\nThe sum of $220,745 is required to supplement Head 79: Ministry of Industry, International Business, Commerce and Small Business Development.\nHead _79: Ministry of Industry, International Business, Commerce and Small Business Development\nProgramme 040: Direction and Policy Formulation Services\nSubprogramme 490: International Business and Financial Services\nAccountant Code 212: Operating Expenses\nThe amount of $220,745 is required to meet the costs associated with the hosting of the 8\" Meeting of the Global Forum on Transparency and Exchange of Information for Tax Purposes during the period October 28\" to 30\" 2015 and transportation costs for the Automatic Exchange of Information Group Meeting on October 26\" and 27\", 2015.\n"
}