{
  "bill_id": 136,
  "slug": "supplementary-estimates-no7-20152016",
  "title": "Supplementary Estimates No.7 2015-2016",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/dbdcd608791934d13191092cb1fe8b46.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2016-01-07",
  "first_reading": "2016-01-26",
  "second_reading": "2016-01-26",
  "gazette_date": null,
  "passed_date": "2016-01-26",
  "markdown": "HOUSE OF ASSEMBLY\nResolved that the sum of SEVEN MILLION AND FIVE THOUSAND EIGHT HUNDRED AND TWENTY-SEVEN DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2015-2016 as shown in the Supplementary Estimates No.7 2015-2016 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2015 —~ 2016 No.7\nHEAD Code Provision in Provision in Supplementary Number Approved Supplementary Provision Estimates Estimates Required 2015 - 2016 No. 1-6 Other Other Other Expenditure Expenditure Expenditure HEAD: 73 MINISTRY OF ENVIRONMENT AND DRAINAGE Program: 400 Environmental Health Services Subprogram: 0372 Sanitation Service Authority 734000372 Account Code: 316 Grants to Public Institutions 26,601,976 6,088,284 Program: 650 Preservation and Conservation of the Terrestrial and Marine Environment Subprogram: 0386 National Conservation 736500386 Commission Account Code: 316 Grants to Public Institutions 23,000,000 300,000 Account Code: 416 Grants to Public Institutions 250,000 617,543\nADDENDUM\nHead 73: Ministry of Environment and Drainage\nThe sum of $7,005,827 is being sought to supplement Head 73\nMinistry of the Environment and Drainage as follows:\nProgram 400:\nEnvironmental Health Services\nSubprogram 0372:\nSanitation Service Authority\nStandard Account Code 316: Grants to Public Institutions — $6,088.284\nThe sum of $6,088,284 is required to provide additional support to the Sanitation Service Authority to pay salaries and wages.\nProgram 650: Preservation and Conservation of the Terrestrial and Marine Environment\nSubprogram 0386: -\nNational Conservation Commission\nStandard Account Code 316: Grants to Public Institutions - : $300,000\nStandard Account Code 416: Grants to Public Institutions - $617,543\nThe sum of $917,543 is required to meet by the National Conservation Commission to implement measures ~ pay for services for cleaning the beaches and purchase two beach cleaners — to combat the influx of sargassum seaweed on the beaches of Barbados.\n"
}