{
  "bill_id": 138,
  "slug": "domestic-violence-protection-orders-amendment-bill-2016",
  "title": "Domestic Violence (Protection Orders) (Amendment) Bill 2016",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/907d022cc76d0c58b3353e80836ba3e6.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-02-03",
  "first_reading": "2016-02-02",
  "second_reading": "2016-02-02",
  "gazette_date": null,
  "passed_date": "2016-02-10",
  "markdown": "EXPLANATORY MEMORANDUM after page 33\n\n2016-01-19\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Domestic  Violence  (Protection  Orders)  Act,\n\nCap. 130A to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nmake provision for a comprehensive definition of the term “domestic\nviolence”;\n\nextend  the  classes  of  persons  who  are  considered  to  be  victims  of\ndomestic violence;\n\nensure  that  victims  of  domestic  violence  receive  the  appropriate\ncounselling or therapy;\n\nfacilitate  the  enrolment  of  perpetrators  of  domestic  violence  in  the\nappropriate rehabilitative programmes;\n\nextend the classes of persons who may intervene in applications before\nthe Court on behalf of victims of domestic violence;\n\nestablish  the  duties  and  powers  of  members  of  the  Police  Force  in\nrelation  to  allegations  of  domestic  violence,  including  the  power  to\nissue emergency protection orders;\n\n(g)\n\nmaximise  the  safety  and  protection  of  victims  and  ensure  that\nperpetrators of domestic violence are held accountable,\n\nand for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 2 of Cap. 130A\n\nAmendment of section 3 of Cap. 130A\n\nAmendment of section 4 of Cap. 130A\n\nAmendment of section 5 of Cap. 130A\n\nAmendment of section 6 of Cap. 130A\n\nAmendment of section 7 of Cap. 130A\n\nInsertion of sections 11A to 11E into Cap. 130A\n\nAmendment of section 12 of Cap. 130A\n\n10.\n\nAmendment of section 14 of Cap. 130A\n\n11.\n\nAmendment of section 16 of Cap. 130A\n\n12.\n\nInsertion of section 19A into Cap. 130A\n\n13.\n\nAmendment of the Schedule to Cap. 130A\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  amend  the  Domestic  Violence  (Protection  Orders)  Act,\nCap. 130A to define domestic violence and to make greater provision for the\nsafety of victims of domestic violence and the accountability of perpetrators\nof domestic violence.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment) Act, 2016.\n\nThis Act may be cited as the Domestic Violence (Protection Orders)\n\nAmendment of section 2 of Cap. 130A\n\n2.\nAct referred to as the principal Act is amended by\n\nSection 2 of the Domestic Violence (Protection Orders) Act, in this\n\n(a)\n\n(b)\n\ndeleting the definitions of “child”, “harassment” and “spouse”, and\n\ninserting  in  the  appropriate  alphabetical  order  the  following\ndefinitions:\n\n“ “child” means a person under 18 years of age who is not married and\nis  considered  to  be  in  a  domestic  relationship  by  virtue  of\ncontinued residence or a relationship of consanguinity or affinity\nwith a perpetrator or victim of domestic violence and includes an\nadopted child, a stepchild and a ward;\n\n“child abuse” means any act of domestic violence perpetrated against\na child and includes causing or permitting a child to witness, hear\nor be exposed to acts of domestic violence;\n\n“cohabitational relationship” means a relationship where persons who\nare not legally married are living together in the same household\nas husband and wife;\n\n“dependant” means a person who, by some physical, mental or other\ndisability is wholly or partly maintained by a perpetrator or victim\nof domestic violence;\n\n“domestic relationship” means the relationship between a perpetrator\nof domestic violence and victim who is a spouse, former spouse,\nchild, dependant or other person who is considered to be a relative\n\n\f5\n\nof  the  perpetrator  by  virtue  of  consanguinity  or  affinity  and\nincludes cohabitational and visiting relationships;\n\n“domestic violence” means the wilful infliction or threat of infliction\nof harm by one person in a domestic relationship upon another\nperson  in  that  relationship  and  includes  child  abuse,  emotional\nabuse, financial abuse, physical abuse and sexual abuse;\n\n“emotional  abuse”  means  any  act  by  a  perpetrator  which  causes\npsychological pain or injury to a victim and includes harassment,\nthe use of threatening words or behaviour and withholding from a\nvictim, access to the victim’s child, parent or guardian;\n\n“financial abuse” means the exercise of control by a perpetrator over a\nvictim’s access to financial resources through coercion, deception\nor  intimidation,  the  effect  of  which  is  to  hinder  the  victim’s\nfinancial independence or ability to maintain a child or dependant\nor to ensure financial dependence on the perpetrator and includes\nexploitation of the victim’s financial resources and withholding\nthe  financial  support  necessary  to  maintain  a  victim,  child  or\ndependant;\n\n“harassment” includes\n\n(a)\n\nintimidation of a victim by a perpetrator through\n\n(i)\n\npersistent verbal abuse;\n\n(ii)\n\nthreats of physical violence;\n\n(iii)\n\nmalicious damage to the victim’s property;\n\n(iv)\n\npersistently  contacting  the  victim  by  any  means,\nincluding via e-mail, facsimile, post, telephone or text\nmessage; or\n\n(v)\n\nany other means;\n\n(b)\n\npersistently following a victim about from place to place;\n\n\f6\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nhiding clothes or other property owned or used by a victim\nor depriving the victim of the use thereof;\n\napproaching, besetting or watching the house or other place\nwhere a victim resides, works, carries on business, studies or\nhappens to be;\n\npublishing  on  the  internet  or  by  any  other  mass  medium,\nstatements or other material relating to a victim without the\nvictim’s consent;\n\nkeeping  a  victim  or  the  victim’s  communications  under\nsurveillance without the victim’s knowledge or consent;\n\nany other act, the purpose of which is to intimidate, scare or\ncause a victim to apprehend harm;\n\n“perpetrator” means a person who commits an act of domestic violence;\n\n“person  at  risk”  means  a  person  named  in  an  emergency  protection\n\norder for whose safety the order is issued;\n\n“physical  abuse”  means  any  act  or  omission  by  a  perpetrator  which\n\ncauses pain or injury to the body of a victim;\n\n“respondent”  means  a  person  against  whom  an  application  for  a\n\nprotection order is made;\n\n“sexual abuse” means the performance by a perpetrator of a sexual act\non a victim by the use of force, threats, fear, manipulation or guile\nand  includes  the  actual  or  attempted  commission  of  any  of  the\noffences stated in Part I of the Sexual Offences Act, Cap. 154;\n\n“spouse” means a party to a marriage or cohabitational relationship;\n\n“subordinate police officer” has the meaning assigned to it by section\n\n2 of the Police Act, Cap. 167;\n\n“victim” means a person against whom an act of domestic violence is\n\ncommitted and includes a child;\n\n\f7\n\n“visiting relationship” means a relationship where the parties do not\nlive  together  in  the  same  household,  but  in  which  there  are\nromantic, intimate or sexual relations.”.\n\nAmendment of section 3 of Cap. 130A\n\n3.\nthe following:\n\nThe principal Act is amended by deleting section 3 and substituting\n\n“Protection order\n\n3.(1)\nWhere on an application made in accordance with section 4,\nthe  Court  is  satisfied  on  a  balance  of  probabilities  that  a  person  has\nengaged in or has threatened to engage in behaviour that constitutes\ndomestic violence, the Court may make an order, in this Act referred\nto as a protection order, restraining the person from engaging in that\nconduct or similar conduct.\n\nSubject to subsection (3), on an application for a protection order\n(2)\nunder  subsection  (1),  the  Court  may,  where  it  considers  that  it  is\nnecessary to do so in order to ensure the safety of the victim pending\nthe  hearing  and  determination  of  the  application,  make  an  interim\nprotection order before considering the application.\n\nThe  Court  shall  not  make  an  interim  protection  order  under\n(3)\nsubsection (2), unless the application for a protection order is supported\nby  oral  evidence  on  oath  or  by  evidence  on  affidavit  given  by  the\ncomplainant.\n\nSubject to sections 16 (1) and 18(3), a protection order made by\n(4)\nthe Court under subsection (1) may be for such period of time as the\nCourt  considers  necessary,  but  may,  on  the  application  of  the\ncomplainant or the respondent, be varied or revoked.\n\n\f8\n\n(5)\nThe  Court  may  make  an  interim  protection  order  at  any  time\nbefore  or  during  the  hearing  of  an  application  for  an  order  under\nsubsection  (1),  whether  or  not  the  respondent  is  present  at  the\nproceedings or has been given notice thereof.\n\nWhere an interim protection order is made by the Court, the Court\n(6)\nshall fix a date for further consideration of the application, which shall\nbe no later than the date on which the order will expire.\n\nAn interim protection order shall be served on the respondent as\n(7)\nsoon as possible after it is made and the respondent shall be summoned\nto appear before the Court for a further hearing of the matter, at which\ntime the Court may\n\n(a)\n\nfix a new date for the hearing of the substantive application\nand extend the interim protection order until the date fixed\nfor the hearing of the substantive application or until such\ntime as the Court considers necessary, which shall not exceed\na  period  of  28  days  from  the  date  of  filing  of  the\napplication;\n\n(b)\n\nrevoke the interim protection order; or\n\n(c)\n\nhear the substantive application and make a protection order\nunder subsection (1).”.\n\nAmendment of section 4 of Cap. 130A\n\n4.\nthe following:\n\nThe principal Act is amended by deleting section 4 and substituting\n\n\f9\n\n“Application for protection order\n\n4.(1)\naccordance with Form 1 as set out in the Schedule to this Act by\n\nAn  application  for  a  protection  order  shall  be  made  in\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe spouse of the person against whom the order is sought\nwhere an act of domestic violence was committed against that\nspouse or a child;\n\nany other person in a domestic relationship with the person\nagainst whom the order is sought, where an act of domestic\nviolence was committed against that person or a child;\n\nthe Commissioner of Police on behalf of a victim of domestic\nviolence;\n\na person other than the persons mentioned in paragraphs (a)\nto (c), as an agent for a victim of domestic violence, including\na Social Worker, Probation Officer or representative of a non-\ngovernmental organisation which renders support services to\nvictims of domestic violence, where that person has obtained,\n\n(i)\n\nleave of the Court; and\n\n(ii)\n\nin  the  case  of  a  victim  who  is  mentally  capable  of\nproviding  consent  and  over  the  age  of  18  years,  the\nconsent of the victim; or\n\n(e)\n\na Child Care Officer or Welfare Officer on behalf of a child\nor a person who is mentally handicapped, against whom an\nact of domestic violence was committed.\n\nThe  person  against  whom  the  order  is  sought  shall  be  the\n\n(2)\nrespondent to the application.\n\nWhere an application for a protection order has been made to the\n(3)\nCourt  under  subsection  (1),  the  Court  shall  issue  a  copy  of  the\napplication together with a summons, in accordance with Form 2 set\n\n\f10\n\nout in the Schedule, to the respondent forthwith to be served personally\non the respondent.\n\nWhere it appears to the Court that it is not reasonably practicable\n(4)\nto serve the respondent personally with a copy of an application for a\nprotection order, the Court may\n\n(a)\n\nmake an order for substituted service, including service by\n\n(i)\n\n(ii)\n\n(iii)\n\nregistered  post  to  the  last  known  address  of  the\nrespondent;\n\nleaving the document at the last known address of the\nrespondent; or\n\nadvertisement  in  2  daily  newspapers  printed  and\npublished in Barbados, which service is deemed to have\nbeen effected on the date of the later advertisement, the\ncost of which shall be borne by the complainant; or\n\n(b)\n\norder that the copy of the application be served by such other\nmeans as the Court thinks just.\n\nNotwithstanding anything in this Act, any document required to\n(5)\nbe served under this Act may be served by an attorney-at-law or his\nagent.\n\nWhere a complainant is a person referred to in paragraph (c) or\n(6)\n(d) of subsection (1), a protection order shall not be made in respect of\nthe application unless notice of the application in accordance with Form\n2 of the Schedule was given to the victim.\n\nWhere it is proved by evidence on oath to the satisfaction of the\n(7)\nCourt that a summons and the copy of the application were served on\nthe respondent in accordance with subsection (3) or (5) within what\n\n\f11\n\nappears to the Court to be a reasonable time, and the respondent fails\nto appear at the time and place appointed for the hearing, the Court may\n\n(a)\n\n(b)\n\nproceed to hear and determine the matter in the absence of\nthe respondent; or\n\nwhere the Court is satisfied, having regard to the information\nbefore it, that it is appropriate to do so, adjourn the matter and\nissue  a  warrant  for  the  respondent  to  be  apprehended  and\nbrought before the Court.\n\nWhere the respondent is present but the complainant or person\n(8)\non whose behalf a complaint is made or their attorney-at-law fails to\nappear at the time and place appointed for hearing, the Court may\n\n(a)\n\nwhere it is satisfied that there is a reasonable excuse for the\nabsence of the complainant or person on whose behalf the\ncomplaint  is  made  or  their  attorney-at-law,  adjourn  the\nhearing of the matter until such time and on such terms as it\nconsiders just; or\n\n(b)\n\ndismiss the application and make an order as to costs.\n\nAn application for a protection order shall be heard within 2 days\n(9)\nafter  the  date  of  service  of  the  application  or  as  soon  as  practicable\nthereafter. ”.\n\nAmendment of section 5 of Cap. 130A\n\n5.\nand substituting the following:\n\nSection 5 of the principal Act is amended by deleting subsection (1)\n\n“(1)\nEvidence on an application for a protection order may be given\non affidavit in accordance with Form 2A as set out in the Schedule to\nthis Act”.\n\n\f12\n\nAmendment of section 6 of Cap. 130A\n\n6.\nthe following:\n\nThe principal Act is amended by deleting section 6 and substituting\n\n“Form of protection orders\n\n6.(1)\nprovisions restraining the respondent from\n\nSubject  to  this  Act,  a  protection  order  may  include\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nbeing  on  the  premises  on  which  the  complainant  for  the\nprotection order or the child in respect of whom the order was\nmade, resides;\n\nbeing on the premises that are the place of education or work\nof the complainant or the place of education or work of the\nchild in respect of whom the order was made;\n\nbeing  in  a  specified  locality,  being  a  locality  in  which\npremises as mentioned in paragraph (a) or (b) or any other\npremises the Court deems it necessary to specify, are situated;\n\napproaching within a specified distance of the complainant\nor the child in respect of whom the order was made;\n\nentering or remaining on the premises, while intoxicated or\nunder the influence of a drug, where the respondent continues\nto reside with the complainant or the child in respect of whom\nthe order was made;\n\n(f)\n\ncausing another person to engage in the conduct referred to\nin paragraph (a) or (c) of subsection (3).\n\n\f13\n\n(2)\n\nA protection order may\n\n(a)\n\nrequire the respondent to\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\n(vi)\n\nleave  the  premises  referred  to  in  paragraph  (a)  of\nsubsection (1);\n\ncontinue any legal or other obligation the respondent\nmay have to pay the rent, mortgage, utilities or taxes\nof the premises referred to in that sub-paragraph where\nthe  respondent\nleave  under  sub-\nparagraph (i);\n\nis  asked\n\nto\n\nallow  the  complainant  to  enter  and  remain  on  the\npremises referred to in paragraph (c) of subsection (1);\n\npay compensation for pecuniary loss suffered by the\ncomplainant as a result of the acts of domestic violence\ncommitted  by  the  respondent,  including  medical\nexpenses, legal expenses, loss of earnings, the cost of\naccommodation, the cost of transportation or any other\nexpense reasonably incurred by reason of injury to the\ncomplainant’s person or property;\n\nthe\nmake  payments\nmaintenance of a dependant of the complainant and\nrespondent;\n\nthe  complainant\n\nfor\n\nto\n\nwhere  no  order  is  in  force  under  Part  III  of  the\nMaintenance Act, Cap. 216 or Part II of the Minors\nAct , Cap. 215 for the maintenance of a child of the\nrespondent  or  Part  VI  of  the  Family  Law  Act,\nCap. 214 for the maintenance of the complainant or a\nchild of the respondent, make interim payments to the\ncomplainant  for  the  benefit  of  the  complainant  or  a\nchild of the respondent until such time as an order is\nmade  under  the  Maintenance  Act,  Cap.  216,  the\n\n\f14\n\n(vii)\n\n(viii)\n\nMinors  Act,  Cap.  215  or  the  Family  Law  Act,\nCap. 214;\n\nwhere  no  order  is  in  force  under  Part  III  of  the\nMaintenance Act, Cap. 216 with respect to the legal\ncustody of a child of the respondent or Part II of the\nMinors  Act,  Cap.  215  or  Part  V  of  the  Family  Law\nAct, Cap. 214 with respect to custody of or access to a\nchild  of  the  respondent,  grant  custody  to  the\ncomplainant  or  such  other  person  as  the  Court\nspecifies, until such time as an order is made under the\nthe  Minors  Act,\nMaintenance  Act,  Cap.  216,\nCap. 215 or the Family Law Act, Cap. 214;\n\nsurrender to the police, for the duration of an interim\nor final protection order, any licences or permits issued\nunder\nthe  Firearms  Act,  Cap.  179  and  any\nammunition,  firearms  or  other  weapons  in  the\npossession or control of the respondent, whether or not\nsuch weapons were used to commit an act of domestic\nviolence; or\n\n(b)\n\nspecify conditions subject to which the respondent may be\non premises or in a locality specified in the order.\n\nA  protection  order  that  includes  a  provision  mentioned  in\n\n(3)\nparagraph (a) of subsection (1) may also include a provision\n\n(a)\n\n(b)\n\nrestraining the respondent from taking possession of personal\nproperty of either the complainant or the respondent, being\nproperty  that  is  reasonably  needed  by  a  member  of  the\nrespondent’s household;\n\ndirecting the respondent to give possession of such property\nas  is  specified  in  the  order,  to  a  specified  member  of  the\nrespondent’s household;\n\n\f15\n\n(c)\n\n(d)\n\nprohibiting  the  respondent  from  damaging  property  of  the\ncomplainant or a child of the complainant or respondent; or\n\nprohibiting  the  respondent  from  causing  another  person  to\nengage in the conduct referred to in paragraph (a) or (c).\n\nA protection order shall, in each case, provide that the respondent\n(4)\nagainst whom the order was sought, attend the Family Services Division\nof the Welfare Department or such other agency as the Court specifies,\nfor appropriate counselling and therapy.\n\nWhere an order referred to in subsection (4) is made against a\n(5)\nmale respondent, the Court shall direct that the respondent enrol in an\nappropriate programme that is facilitated by the Ministry responsible\nfor Social Care.\n\nA  protection  order  may,  in  each  case,  provide  that  the\n(6)\ncomplainant or any other person, including a child, in respect of whom\nthe order was made, attend the Family Services Division of the Welfare\nDepartment or such other agency as the Court specifies, for appropriate\ncounselling and therapy.\n\nWhere a protection order includes provisions under subsections\n(7)\n(4), (5) or (6), the Family Services Division of the Welfare Department,\nthe coordinators of any programme that is facilitated by the Ministry\nresponsible for Social Care or any other agency specified by the Court,\nshall submit to the Court a report setting out the following:\n\n(a)\n\n(b)\n\n(c)\n\nthe dates on which counselling took place;\n\nthe nature of the counselling and therapy carried out; and\n\nthe  response  given  to  the  counselling  and  therapy  by  the\nparties to the order.\n\nThe report referred to in subsection (7) shall be submitted to the\n(8)\nCourt not later than one month before the expiration of the protection\norder or at such other time as the Court specifies.\n\n\f16\n\n(9)\nFor the purposes of this section “complainant” means a person\nagainst  whom  domestic  violence  was  committed  or  who  was\nharassed.”.\n\nAmendment of section 7 of Cap. 130A\n\n7.\ndeleting paragraph (c).\n\nSection  7  of  the  principal  Act  is  amended  in  subsection  (1)  by\n\nInsertion of sections 11A to 11E into Cap. 130A\n\n8.\n11 the following as sections 11A to 11E:\n\nThe principal Act is amended by inserting immediately after section\n\n“Duties of members of the Police Force\n\n11A.(1)\ncomplaint alleging domestic violence.\n\nA  member  of  the  Police  Force  shall  respond  to  every\n\n(2)\nThe  Commissioner  of  Police  shall  keep  a  Domestic  Violence\nRegister for the purpose of recording information obtained by a member\nof  the  Police  Force  who  responds  to  a  complaint  alleging  domestic\nviolence.\n\nA  member  of  the  Police  Force  who  responds  to  a  complaint\n(3)\nalleging domestic violence shall complete a report in accordance with\nForm 6 set out in the Schedule to this Act and record the information\nin a Domestic Violence Register to be maintained by the Commissioner\nof Police.\n\nA member of the Police Force shall, as soon as is practicable after\n(4)\ncompleting  a  report  in  accordance  with  subsection  (3),  provide  the\nperson making the complaint with a copy of the report.\n\n\f17\n\n(5)\nWhere  practicable,  when  responding  to  a  complaint  alleging\ndomestic violence, a member of the Police Force shall render assistance\nto a victim of domestic violence by\n\n(a)\n\n(b)\n\n(c)\n\nseeking  medical  attention  for  a  victim  who  has  suffered\ninjury;\n\naccompanying the victim onto premises for the purpose of\nretrieving personal property;\n\nensuring the welfare and safety of children and other persons\nwho are on the premises; and\n\n(d)\n\npreventing further breaches of the law.\n\nA member of the Police Force shall, as soon as is practicable after\n(6)\nreceiving a complaint alleging domestic violence, verbally inform the\nvictim of domestic violence of the victim’s rights and provide a printed\ncopy of those rights as set out in Form 7 of the Schedule to this Act.\n\nA member of the Police Force shall, pursuant to an order issued\n(7)\nunder  section  11B  or  an  order  of  the  Court,  seize  any  ammunition,\nfirearms  or  other  weapons  in  the  possession  or  control  of  the\nperpetrator, whether or not those weapons were used to commit an act\nof domestic violence.\n\nPower to issue emergency protection order\n\n11B.(1)\nWhere a member of the Police Force exercises his power of\narrest in accordance with section 12(4), a subordinate police officer may\nissue an emergency protection order in accordance with Form 8 as set\nout in the Schedule to this Act, where he has reasonable cause to believe\nthat the issue of an order is necessary to ensure the safety of a person\nat risk.\n\nA subordinate police officer may issue an emergency protection\n\n(2)\norder under subsection (1) without the consent of the person at risk.\n\n\f18\n\nIn determining whether to issue an emergency protection order\n\n(3)\nunder subsection (1), the subordinate police officer shall consider\n\n(a)\n\n(b)\n\n(c)\n\nwhether the person at risk has immediate access to the Court\nto make an application in accordance with section 4;\n\nthe likelihood that the perpetrator will continue to commit\nacts of domestic violence against the person at risk;\n\nthe welfare of any children residing with the perpetrator or\nthe person at risk;\n\n(d)\n\nany hardship that may be caused if the order is issued; and\n\n(e)\n\nany other matter that, in the circumstances of the case, the\nmember of the Police Force considers relevant.\n\nService of emergency protection order\n\nWhere an emergency protection order is issued, it shall be\n11C.(1)\nserved personally by a member of the Police Force on the perpetrator\nas soon as is reasonably practicable after the order is issued.\n\n(2)\nAn order served under subsection (1) shall remain in force until\nsuch time as an order is made by the Court pursuant to an application\nunder section 4, but no longer than 7 days from the date on which it is\nissued.\n\nA  member  of  the  Police  Force  who  serves  an  emergency\n(3)\nprotection order shall explain to the perpetrator in a language that he\nunderstands,\n\n(a)\n\n(b)\n\nthe purpose, terms, duration and effect of the order; and\n\nthe consequences that may follow if the perpetrator fails to\ncomply with the terms of the order.\n\nA  member  of  the  Police  Force  shall,  as  soon  as  is  reasonably\n(4)\npracticable  after  serving  an  emergency  protection  order,  notify  the\n\n\f19\n\nperson at risk of the emergency protection order and the purpose, terms,\nduration and effect of that order.\n\nEffect of emergency protection order\n\n11D.\nWhere  an  emergency  protection  order  is  served  on  a\nperpetrator,  the  perpetrator  shall  immediately  cease  to  engage  in\nbehaviour that constitutes harassment or domestic violence towards the\nperson at risk and, for the duration of the order, shall\n\n(a)\n\n(b)\n\nvacate any premises occupied by the person at risk; and\n\nsurrender to a member of the Police Force any licences or\npermits  issued  under  the  Firearms  Act,  Cap.  179  and  any\nammunition,  firearms  or  other  weapons  in  that  person’s\npossession or control, whether or not such weapons were used\nto commit an act of domestic violence.\n\nBreach of emergency protection order\n\nWhere an emergency protection order is issued and served\n11E.(1)\nin  accordance  with  sections  11B  and  11C  and  the  perpetrator\ncontravenes  the  order  in  any  respect,  the  perpetrator  is  guilty  of  an\noffence and is liable on summary conviction to a fine of $2 500 or to\nimprisonment for a term of 6 months or to both.\n\nA  person  who  is  arrested  for  contravention  of  an  emergency\n(2)\nprotection order shall be brought before the Court within a period of 24\nhours  beginning  at  the  time  of  the  arrest,  or  as  soon  as  reasonably\npracticable thereafter.”.\n\nAmendment of section 12 of Cap. 130A\n\n9.\n\nSection 12 of the principal Act is amended by\n\n(a)\n\ndeleting subsections (3) and (4) and substituting the following:\n\n\f20\n\n“(3)\nWhere a power of arrest is attached to an order under subsection\n(1), a member of the Police Force may arrest without a warrant, a person\nwhom he has reasonable cause to suspect is in breach of such order, by\nreason of that person’s use of violence or unauthorised entry into the\npremises or areas referred to in section 6(1).\n\nA member of the Police Force may arrest without a warrant a\n(4)\nperson whom he has reasonable cause to suspect has committed or is\nabout  to  commit  an  act  of  domestic  violence,  where  a  failure  to  act\nimmediately may result in serious physical injury or death.”; and\n\n(b)\n\ninserting immediately after subsection (4) the following as subsection\n(5):\n\nWhere a person is arrested under subsection (3) or (4), he shall\n“(5)\nbe brought before the Court within the period of 24 hours beginning at\nthe  time  of  his  arrest,  or  as  soon  as  reasonably  practicable\nthereafter.”.\n\nAmendment of section 14 of Cap. 130A\n\n10.\nthe following:\n\nThe principal Act is amended by deleting section 14 and substituting\n\n“Power to enter premises\n\n14.(1)\nany premises for the purpose of giving assistance to anyone present\n\nA member of the Police Force may, without a warrant, enter\n\n(a)\n\nif he has reasonable grounds to suspect that an emergency\nprotection  order,  an  interim  protection  order  or  a  final\nprotection order is being breached; or\n\n(b)\n\nif, upon the invitation of a person resident at the premises or\nindependently, he has reasonable grounds to suspect that a\n\n\f21\n\nperson on the premises has suffered or is in imminent danger\nof suffering physical injury at the hands of some other person.\n\n(2)\nWhere a member of the Police Force exercises a power of entry\nunder subsection (1), he shall, as soon as is reasonably practicable after\nexercising the power, submit to the Commissioner of Police through\nthe Station Sergeant for the district in which the incident occurred, a\nreport which shall include\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe reason for entering the premises without a warrant;\n\nthe offence being committed or about to be committed;\n\nthe manner in which the investigation was conducted; and\n\nthe measures taken to ensure the safety and protection of the\nperson at risk of injury.”.\n\nAmendment of section 16 of Cap. 130A\n\n11.\n(3) and (4).\n\nSection 16 of the principal Act is amended by deleting subsections\n\nInsertion of section 19A into Cap. 130A\n\n12.\n19 the following as section 19A:\n\nThe principal Act is amended by inserting immediately after section\n\n“Obligation to report child abuse\n\n19A.(1)\nA person who attends to, examines or otherwise interacts\nwith a child and is aware or has reasonable cause to suspect that the\nchild  is  a  victim  of  domestic  violence,  shall  immediately  notify  the\nChild Care Board or a member of the Police Force of that suspicion.\n\n\f22\n\n(2)\n\nA person who\n\n(a)\n\n(b)\n\nis aware or has reasonable cause to suspect that a child is a\nvictim of domestic violence and fails to notify the Child Care\nBoard or a member of the Police Force; or\n\nknowingly  and  maliciously  makes  a  false,  inaccurate  or\nmisleading statement to the Child Care Board or a member\nof  the  Police  Force,  alleging  that  a  child  is  a  victim  of\ndomestic violence,\n\nis guilty of an offence and liable on summary conviction to a fine of $5\n000 or imprisonment for a term of 12 months or to both.”.\n\nAmendment of the Schedule to Cap. 130A\n\n13.\n\nThe principal Act is amended by\n\n(a)\n\n(b)\n\n(c)\n\ndeleting Form I of the Schedule and substituting Form I as set out\nin the Schedule to this Act;\n\ninserting  immediately  after  Form  2,  Form  2A  as  set  out  in  the\nSchedule to this Act; and\n\ninserting immediately after Form 5, Forms 6, 7 and 8 as set out in\nthe Schedule to this Act.\n\n\f23\n\nSCHEDULE\n\n(Section 13)\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of Barbados    L.R.O. 1998Domestic Violence (Protection Orders) ActCap. 130AFORM  1(Section 4(1))IN  THE  MAGISTRATE'S  COURT  FOR  DISTRICTAPPLICATION  FOR  PROTECTION  ORDERBetweenA. B. of   ComplainantandC. D. of  RespondentI of  , being the victim/the appointed representative of , a party to a domestic relationship with the respondent, hereby apply for a protection order on the ground(s) that:Taken and sworn before me this day of  .Name of ComplainantAddress of ComplainantName of VictimComplainant(Signature)Magistrate for District\f24\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of Barbados    L.R.O. 1998Schedule - (Cont'd)Domestic Violence (Protection Orders) ActCap. 130AFORM  2A(Section 5(1))IN  THE  MAGISTRATE'S  COURT  FOR  DISTRICTAFFIDAVITI of, ,make oath and say as follows:1. I am the Complainant herein.2. The facts and matters deposed to in this Affidavit are made of my own knowledge and I certify that I believe that the facts stated in this Affidavit are true.3. My relationship with the Respondent is .4. The circumstances which gave rise to this complaint are that:5. I made a complaint/A complaint was made on my behalf by   at District Police Station.A copy of a report dated is annexed hereto and marked  .Sworn to by the Deponentat  on the day of .Before meName of DeponentAddress of DeponentOccupation of DeponentName of ComplainantDistrict NameDate of ReportName of DeponentJustice of the Peace/Magistrate for District\f25\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of Barbados    L.R.O. 1998Schedule - (Cont'd)Domestic Violence (Protection Orders) ActCap. 130AFORM  6(Section 11A(3))DOMESTIC  VIOLENCE  POLICE  REPORTDistrict of station:Date: Time:Diary Reference:Investigating Ofﬁ cer:Name of complainant:Address of complainant:Relationship of complainant to victim:Relationship of victim to perpetrator:Name of victim:Address of victim:Sex: Age: Occupation:(Rank/Number/Name)(Surname/First Name/Middle Name(s))(Suname/First Name/Middle Name(s))\f26\n\n L.R.O. 1998   Schedule - (Cont'd)FORM  6 - (Cont'd)DOMESTIC  VIOLENCE  POLICE  REPORT - (Cont'd)Name of perpetrator:Address of perpetrator:Sex Age: Occupation:Name of witness:Address of witness:Relationship to victim:Brief statement of facts:Injury to victim:State whether medical report is attached: Yes No(Suname/First Name/Middle Name(s))(Suname/First Name/Middle Name(s))\f27\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of Barbados    L.R.O. 1998Schedule - (Cont'd)FORM  6 - (Cont'd)DOMESTIC  VIOLENCE  POLICE  REPORT - (Cont'd)Type(s) of weapon used:State the whereabouts of the children at time of incident:State whether previous complaints were laid against perpetrator:Date(s): Time(s):Diary Reference(s): District of station:Investigating ofﬁ cer:Action taken on previous complaint:Action taken by:State whether an arrest was made: Yes NoDate of arrest:State whether an emergency protection order was issued: Yes NoDate of issue of emergency protection order:(Rank/Number/Name)(Rank/Number/Name)\f28\n\n L.R.O. 1998   Schedule - (Cont'd)FORM  6 - (Cont'd)DOMESTIC  VIOLENCE  POLICE  REPORT - (Cont'd)Status of previous complaint(s):State whether charges were laid:   Yes  NoState the charges laid/State the reason that no charges were laid:State whether a protection order was in force: Yes  NoDate of issue of protection order:Duration of protection order:Action taken on present complaint:Action taken by:State whether an arrest was made:   Yes  NoDate of arrest:State whether charges were laid:   Yes  No(Rank/Number/Name)\f29\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of Barbados    L.R.O. 1998Schedule - (Cont'd)FORM  6 - (Concl'd)DOMESTIC  VIOLENCE  POLICE  REPORT - (Concl'd)State the charges laid/State the reason why no charges were laid:State whether an emergency protection order is in force: Yes  NoDate of issue of emergency protection order:State whether a protection order is in force:   Yes  NoDuration of protection order:Date of issue of protection order:(Name of Investigating Ofﬁ cer)(Name of Station Sergeant)(Signature)(Signature)\f30\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of Barbados    L.R.O. 1998Schedule - (Cont'd)Domestic Violence (Protection Orders) ActCap. 130AFORM  7(Section 11A(6))RIGHTS  OF  THE  VICTIMA victim is hereby advised of the right to:1. Request the assistance of a member of the Police Force in the protection of thevictim and the children, if any.2. Request the assistance of a member of the Police Force in accompanyingthe victim and the children, if any, to a place of safety including the Child Care Board, the home of a family member or friend, a shelter or any other place of safety.3. Request the assistance of a member of the Police Force in accompanyingthe victim and the children, if any, to the residence of the perpetrator to retrievethe victim's or the children's personal property.4. Request the assistance of a member of the Police Force in seeking medicaltreatment or in accompanying the victim and the children, if any, to a medical facility.5. Lay a criminal complaint against the perpetrator where the conduct of the perpetratoramounts to a criminal offence.6. Be provided, by a member of the Police Force, with information regarding how aprotection order may be obtained.7. Seek legal representation.8. Obtain a protection order from the Court to be served on the perpetrator by a marshalof the Court.9. Request that the address of the victim is not disclosed to the perpetrator.10. Request further information on the exercise of the rights of the victim fromthe District Police Station at which the complaint was laid.\f31\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of Barbados    L.R.O. 1998Schedule - (Cont'd)Domestic Violence (Protection Orders) ActCap. 130AFORM  8(Section 11B(1))EMERGENCY  PROTECTION  ORDER1. Date of complaint:2. Name of person(s) at risk:3. Name of perpetrator:4. Address:5. Sex: Age:  Occupation:6. District of Station:7. Investigating Ofﬁ cer: 8. Brief statement of facts:(Rank/Number/Name)I declare that I have reasonable cause to believe that the issue of this emergency protection order is necessary to ensure the safety of the person(s) at risk.  The perpetrator mustimmediately cease to engage in behaviour that constitutes harassment or domestic violencetowards the person(s) at risk and vacate any premises occupied by the person(s) at risk.  The perpetrator must surrender any licences or permits issued under the Firearms Act, Cap. 179 and any ammunition, ﬁ rearms or other weapons in the perpetrator's possessionor control.Dated this              day of                                        , 20      .Police Ofﬁ cer\f32\n\n L.R.O. 1998   Schedule - (Concl'd)FORM  8 - (Concl'd)EMERGENCY  PROTECTION  ORDER   - (Concl'd)NOTICE  TO  THE  PERPETRATOR:This emergency protection order remains in force for a period of 7 days from the date on which it is issued.If you do not comply with this order, you will render yourself liable to arrest without further notice.You are referred to sections 11B to 11E of the Domestic Violence (Protection Orders) Act, Cap. 130A.\f33\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2016.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2016.\n\nPresident\n\n\fDOMESTIC VIOLENCE (PROTECTION ORDERS) (AMENDMENT) ACT, 2016\n\nEXPLANATORY MEMORANDUM\n\nThe Domestic Violence (Protection Orders) Act, Cap. 130A came into force on\n13th February, 1992 to provide for, inter alia, the granting of protection orders in\ncircumstances surrounding domestic violence. However, certain deficiencies in\nthe law have become apparent. The amended legislation purports to enhance the\nprotection offered to victims of domestic violence and ensure that perpetrators\nare held accountable. It will, inter alia, provide a comprehensive definition of\nthe term “domestic violence”, extend the categories of persons considered to be\nin a domestic relationship, extend the categories of persons or agencies that may\nintervene on behalf of a victim of domestic violence and extend the powers of\nthe Police Force when dealing with complaints alleging domestic violence.\n\nClause 1:\n\nstates the short title by which the Act may be cited.\n\nClause 2:\n\nClause 3:\n\nClause 4:\n\nreplaces the definitions of the terms “child”, “harassment” and\n“spouse” used in the principal Act and sets out the definitions\nof other terms used in the legislation.\n\namends  section  3  of  the  principal  Act  to  provide  for  the\ncircumstances  under  which  the  Court  will  issue  a  final\nprotection order. Provision is also made for the issuance of an\ninterim protection order including when such an order may be\nissued, the criteria to be met by a complainant before such an\norder is issued and how that type of order should be served on\nthe respondent.\n\namends section 4 of the principal Act to extend the class of\npersons who may apply to the Court for a protection order. It\nalso provides for the procedure observed by the Court where\nan application is made for a protection order, as well as the\noptions available to the Court in dealing with the application\n\ni\n\n\fClause 5:\n\nClause 6:\n\nClause 7:\n\nDomestic Violence (Protection Orders)\n(Amendment) Act, 2016\n\nwhen  either  the  complainant  or  his  representative  or  the\nrespondent failed to appear at the time and place appointed for\nhearing.\n\namends section 5 of the principal Act to state that affidavit\nevidence  in  accordance  with  Form  2A  as  set  out  in  the\nSchedule,  may  be  given  in  support  of  an  application  for  a\nprotection order.\n\namends section 6 of the principal Act to expand the terms that\ncan be included by the Court when issuing a protection order.\nSuch  terms  include  making  an  order  for  the  payment  of\ncompensation for pecuniary loss suffered by a complainant,\npayment  for  the  maintenance  of  a  dependant  of  the\ncomplainant and respondent and, where no order is in force\nunder other legislation, making an order as to the maintenance\nof the complainant or a child of the complainant, the custody\nof or access to a child of the respondent and the enrolment of\nmale  perpetrators  of  domestic  violence  in  programmes\nfacilitated by the Ministry responsible for Social Care. The\nCourt may also make an order for a respondent to surrender\nto the police, any ammunition, firearms or other weapons in\nthe  respondent’s  control,  whether  or  not  they  were  used  to\ncommit an act of domestic violence.\n\namends section 7 of the principal Act to remove the need for\nthe Court to consider the preservation and protection of the\ninstitution of marriage or a union other than marriage and the\nprovision of protection and assistance to the family as a natural\nand fundamental group unit in society, when determining an\napplication for a protection order.\n\nClause 8:\n\ninserts sections 11A to 11E into the principal Act. Section 11A\nprovides a list of the duties of members of the Police Force\n\nii\n\n\fDomestic Violence (Protection Orders)\n(Amendment) Act, 2016\n\nwhen  dealing  with  complaints  alleging  domestic  violence.\nThey have a duty to respond to every complaint, complete a\nreport in accordance with Form 6 as set out in the Schedule,\nprovide  the  complainant  with  a  copy  of  the  report,  render\nassistance  to  the  victim,  inform  the  victim  of  the  victim’s\nrights, provide a printed copy of those rights and, pursuant to\nan emergency protection order or protection order issued by\nthe Court, seize ammunition, firearms or other weapons in the\ncontrol of the person against whom a complaint is made. It\nalso  states  that  the  Commissioner  of  Police  shall  keep  a\nDomestic  Violence  Register  to  record  information  by\nmembers  of  the  Police  Force  who  respond  to  complaints\nalleging domestic violence. Section 11B vests in a member of\nthe Police Force at the rank of Sergeant, the power to issue\nemergency protection orders in accordance with Form 8 as set\nout in the Schedule, after an arrest is made by a member of\nthe  Police  Force  upon  reasonable  suspicion  that  an  act  of\ndomestic violence was committed or is about to be committed.\nIt  provides  that  the  Sergeant  must  consider  certain  factors\nbefore issuing an emergency protection order, but may issue\nsuch  an  order  without  the  consent  of  the  person  at  risk.\nSections  11C  to  11E  make  provision  for  the  service  of  an\nemergency protection order, the responsibility of a perpetrator\nafter being served with an emergency protection order and the\npenalty  for  breaching  an  emergency  protection  order\nrespectively.\n\namends  section  12  of  the  principal  Act  to  provide  for  the\npower  of  a  member  of  the  Police  Force  to  arrest  without  a\nwarrant,  a  person  who  is  suspected  to  be  in  breach  of  a\nprotection order by reason of that person’s use of violence or\nunauthorised entry into premises or areas referred to in section\n6(1) of the Act. It also confirms that members of the Police\n\niii\n\nClause 9:\n\n\fClause 10:\n\nClause 11:\n\nClause 12:\n\nClause 13:\n\nDomestic Violence (Protection Orders)\n(Amendment) Act, 2016\n\nForce  have  the  power  to  make  an  arrest  on  reasonable\nsuspicion that an act of domestic violence was committed or\nis about to be committed. It states that where the power of\narrest is exercised, the subject of the arrest should be brought\nbefore the Court within 24 hours from the time of his arrest or\nas soon as reasonably practicable thereafter.\n\namends  section  14  of  the  principal  Act  to  provide  for  the\ncircumstances in which a member of the Police Force may\nenter  premises  without  a  warrant  for  the  purpose  of  giving\nassistance to any person on those premises. It also provides\nthat where such a power of entry is exercised, the member of\nthe Police Force who exercised that power must prepare and\nsubmit a report to the Commissioner of Police.\n\namends section 16 of the principal Act by deleting subsections\n(3) and (4).\n\ninserts  section  19A  into  the  principal  Act.  Section  19A\nimposes upon a certain group of individuals, namely, those\nwho examine or attend to a child (e.g. doctor, psychologist,\nteacher) an obligation to report child abuse to the Child Care\nBoard  or  a  member  of  the  Police  Force  and  provides  the\npenalty for a failure to report child abuse or knowingly and\nmaliciously making a false, inaccurate or misleading report.\n\namends the Schedule to the principal Act. Form I is a new\nApplication for Protection Order. Form 2A is the Affidavit in\nsupport of an Application for Protection Order. Form 6 is the\nDomestic Violence Police Report. Form 7 lists the Rights of\nthe Victim. Form 8 is the Emergency Protection Order.\n\niv\n\n"
}