{
  "bill_id": 142,
  "slug": "companies-amendment-bill-2016",
  "title": "Companies (Amendment) Bill, 2016",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3548e851b3fa8f86c5ca6eef4d482aae.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-02-03",
  "first_reading": "2016-02-04",
  "second_reading": "2016-02-02",
  "gazette_date": "2016-02-04",
  "passed_date": "2016-02-04",
  "markdown": "2016-01-13\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Companies  Act,  Cap.  308  to  provide  for  the\n\nestablishment of incorporated cell companies.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 308\n\nAmendment of section 197 of Cap. 308\n\nDeleting and replacing Division G of Part III of Cap. 308\n\n1.\n\n2.\n\n3.\n\n4.\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  amend  the  Companies  Act,  Cap.  308  to  provide  for  the\n\nestablishment of incorporated cell companies.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Companies (Amendment) Act, 2016.\n\n\f4\n\nAmendment of section 2 of Cap. 308\n\n2.\nSection 2(1) of the Companies Act, Cap. 308, in this Act referred to\nas the principal Act, is amended by inserting in the appropriate alphabetical\norder the following definitions:\n\n““ cell”  has the meaning assigned to it in Division G.1 of Part III;\n\n“incorporated cell”  has the meaning assigned to it in Division G of Part\n\nIII;\n\n“incorporated cell company” has the meaning assigned to it in Division\n\nG of Part III;\n\n“segregated cell company” has the meaning assigned to it in Division\n\nG.1 of Part III.”.\n\nAmendment of section 197 of Cap. 308\n\n3.\n\nSection 197 (1) of the principal Act is amended by\n\n(a)\n\n(b)\n\ndeleting the full stop at the end of paragraph (m) and substituting a\nsemi-colon; and\n\ninserting  immediately  after  paragraph  (m)  the  following  new\nparagraphs:\n\n“(n)\n\nwhere the company is an incorporated cell company,\n\n(i)\n\n(ii)\n\nto establish incorporated cells;\n\nto  transfer  incorporated  cells  to  another  incorporated\ncell company;\n\n(iii)\n\nto  transfer  incorporated  cells  to  a  segregated  cell\ncompany;\n\n\f5\n\n(o)\n\nwhere the company is a segregated cell company,\n\n(i)\n\nto transfer cells to another segregated company;\n\n(ii)\n\nto transfer cells to an incorporated cell company.”.\n\nDeleting and replacing Division G of Part III of Cap. 308\n\n4.\nsubstituting the following:\n\nThe principal Act is amended by deleting Division G of Part III and\n\n“DIVISION G\n\nIncorporated Cell Companies and Incorporated Cells\n\nApplication of Division\n\nThis  Division  applies  to  every  company  incorporated  or\n356.21.(1)\ncontinued  under  this  Act  for  the  purposes  of  carrying  on  financial\nservices  activities  including  insurance,  banking  and  mutual  fund\nactivity  in  accordance  with  a  plan  whereby  the  assets  and  business\noperations are divided into incorporated cells in the manner provided\nin accordance with this Division.\n\nWhen  a  provision  of  this  Division  is  inconsistent  with  or\n(2)\nrepugnant  to  any  other  provisions  of  this  Act,  the  provision  of  this\nDivision  shall,  in  so  far  as  it  affects  an  incorporated  cell  company,\nprevail over other provisions of this Act.\n\nApplication of certain sections of the Act\n\n356.22.\nSubject  to  section  356.21,  the  following  provisions  shall,\nwith  such  modifications  as  the  circumstances  require,  apply  to  an\nincorporated cell company and to an incorporated cell as if the reference\nto the term company were to an incorporated cell:\n\n(a)\n\nDivisions A, B, D, E, F, G, H, I, J, K and L of Part I;\n\n\f6\n\n(b)\n\nDivision D of Part III;\n\n(c)\n\nPart V.\n\nInterpretation\n\n356.23.\n\nIn this Division\n\n“incorporated cell” means a cell of an incorporated cell company;\n\n“incorporated  cell  company”  means  a  company  with  separate\n\nincorporated cells.\n\nFormation of incorporated cell companies\n\n356.24.\n\nFor the purposes of conducting business activity,\n\n(a)\n\n(b)\n\na company may incorporate in Barbados as an incorporated\ncell  company  in  accordance  with  the  provisions  of  this\nDivision;\n\nan  existing  company  incorporated  under  this  Act  may  be\nconverted  to  an  incorporated  cell  company  in  the  manner\nprescribed; or\n\n(c)\n\nan external company may be\n\n(i)\n\nregistered as an incorporated cell company in Barbados;\nor\n\n(ii)\n\ncontinued as an incorporated cell company in Barbados.\n\nIncorporated cell companies\n\n356.25.(1)\nA  company  may  be  incorporated  as  an  incorporated  cell\ncompany if its articles of incorporation and by-laws provide that it is\nan incorporated cell company.\n\nAn  incorporated  cell  company  shall  file  its  by-laws  with  the\n\n(2)\nRegistrar within 21 days of its incorporation.\n\n\f7\n\n(3)\nNotwithstanding  section  10,  the  name  of  an  incorporated  cell\ncompany shall include the expression “Incorporated Cell Company” or\nthe abbreviation “ICC” after its name.\n\n(4)\nA company incorporated under the laws of a jurisdiction other\nthan Barbados as an incorporated cell company and continued as an\nincorporated cell company under this Act shall use the name designated\nin the Articles of Continuation with the addition of either the suffix\n“Incorporated Cell Company” or the abbreviation “ICC”.\n\nAn incorporated cell company may by special resolution agree\n\n(5)\nto establish an incorporated cell.\n\nThe special resolution referred to in subsection (5) shall assign\n(6)\nto the incorporated cell a name distinctive from any other incorporated\ncells and the name shall include the suffix “Incorporated Cell” or the\nabbreviation “IC”.\n\nStatus of an incorporated cell\n\n356.26.(1)\nincorporated cell company.\n\nAn  incorporated  cell  is  a  legal  person  separate  from  its\n\nWhere  an  incorporated  cell  is  established  in  accordance\n\n(2)\nwith section 356.25, the incorporated cell shall\n\n(a)\n\nestablish by-laws which state that\n\n(i)\n\nit is an incorporated cell;\n\n(ii)\n\nit may not own shares in its incorporated cell company;\nand\n\n(b)\n\nfile  the  by-laws  within  21  days  of  being  established  as  an\nincorporated cell.\n\nAn incorporated cell may have directors other than directors of\n\n(3)\nits incorporated cell company.\n\n\f8\n\nNotwithstanding section 356.22, an incorporated cell shall have\n\n(4)\nthe same registered office as its incorporated cell company.\n\nRecords of incorporated cells\n\n356.27.(1)\nrecords of the members of each of its incorporated cells.\n\nAn  incorporated  cell  company  shall  maintain  separate\n\nThe  incorporated  cell  company  shall,  in  respect  of  the\n(2)\nmaintenance of records of its incorporated cells, apply subsection (1)\nof section 170 and subsection (2) of section 170.\n\nTransactions of incorporated cell companies and\nincorporated cells\n\nAn incorporated cell company shall have no power, by virtue\n356.28.(1)\nof its position as an incorporated cell company, to enter into transactions\non behalf of any of its incorporated cells.\n\nAn incorporated cell shall have no power, by virtue of its position\n(2)\nas  an  incorporated  cell,  to  enter  into  transactions  on  behalf  of  its\nincorporated  cell  company  or  any  other  incorporated  cell  of  the\nincorporated cell company.\n\nThe directors and officers of an incorporated cell company and\n(3)\nan incorporated cell shall ensure that where a transaction is entered into,\nit is stated in writing\n\n(a)\n\n(b)\n\nwhether the transaction is entered into by the incorporated\ncell company or the incorporated cell; and\n\nwhere the transaction is being entered into by an incorporated\ncell, the name of the incorporated cell.\n\n\f9\n\nAssets and liabilities of incorporated cell companies and\nincorporated cells\n\n356.29.(1)\nThe  directors  of  an  incorporated  cell  company  and  the\ndirectors an of incorporated cell of that company shall ensure that the\nassets and liabilities of the incorporated cell company\n\n(a)\n\n(b)\n\nare  kept  separately  from  the  assets  and  liabilities  of  the\nincorporated cell; and\n\ncan be identified separately from the assets and liabilities of\nthe incorporated cell.\n\n(2)\n\nThe directors of an incorporated cell shall ensure that\n\n(a)\n\nthe  assets  and  liabilities  of  the  incorporated  cell  are  kept\nseparately from the assets and liabilities of other incorporated\ncells; and\n\n(b)\n\ncan be identified separately from the assets and liabilities of\nother incorporated cells.\n\nThe directors are not in breach of subsection (1) or (2) by reason\n(3)\nonly that the directors cause or permit assets of the incorporated cell\ncompany or any of the incorporated cells to be collectively invested or\nmanaged  by  an  investment  manager  where  the  assets  invested  or\nmanaged are separately identifiable.\n\nWhere a creditor of an incorporated cell company has a claim\n(4)\nagainst that company in respect of a transaction between the creditor\nand the company, the creditor may not make a claim against the assets\nof the incorporated cells of the company.\n\n\f10\n\n(5)\nWhere a creditor of an incorporated cell has a claim against the\nincorporated cell in respect of a transaction between the creditor and\nthe incorporated cell, the creditor may not make a claim against the\n\n(a)\n\n(b)\n\nassets of the incorporated cell company of the incorporated\ncell; or\n\nassets of any other incorporated cell of the incorporated cell\ncompany.\n\nAnnual returns of incorporated cells\n\n356.30.(1)\nnot apply to incorporated cells.\n\nNotwithstanding section 356. 22, sections 147 and 148 do\n\nAn incorporated cell company shall submit an annual return for\n\n(2)\neach of its incorporated cells in accordance with section 147.\n\nThe  incorporated  cell  company  shall  ensure  that  its  financial\n(3)\nstatements  are  not  consolidated  with  the  financial  statements  of  its\nincorporated cells.\n\nExpulsion of incorporated cell\n\n356.31.(1)\nexpel an incorporated cell on the following grounds:\n\nAn  incorporated  cell  company  may  apply  to  the  court  to\n\n(a)\n\nthe  affairs  of  the  incorporated  cell  are  being  or  have  been\nconducted in a manner which is unfairly prejudicial to\n\n(i)\n\n(ii)\n\nthe incorporated cell company;\n\nanother  incorporated  cell  of  the  incorporated  cell\ncompany;\n\n(iii)\n\nthe  members  of  the  incorporated  cell  company  or\nanother incorporated cell company; or\n\n(b)\n\nthe incorporated cell is being used for fraudulent purposes.\n\n\f11\n\nWhere  the  court  approves  the  application  to  expel  the\n\n(2)\nincorporated cell, the Registrar shall\n\n(a)\n\n(b)\n\nstrike off the name of the incorporated cell from the Register\nof Companies; and\n\nwithin 14 days of striking the name from the register, publish\nin the Gazette that the name of the incorporated cell has been\nstruck off the register in accordance with this section and the\ndate from which the name is struck off.\n\nTransfer of an incorporated cell\n\nAn incorporated cell of an incorporated cell company may\n356.32.(1)\nbe transferred to another incorporated cell company or to a segregated\ncell company.\n\n(2)\n\nIn order to effect a transfer under subsection (1),\n\n(a)\n\n(b)\n\nan incorporated cell company and another incorporated cell\ncompany; or\n\nan  incorporated  cell  company  and  a  segregated  cell\ncompany,\n\nshall enter into a written agreement that sets out the terms of the transfer.\n\n(3)\n\nNotwithstanding subsection (2),\n\n(a)\n\n(b)\n\nthe directors of each company shall approve the agreement\nin writing;\n\neach company involved in the transfer shall pass a special\nresolution authorising the transfer set out in the agreement;\nand\n\n(c)\n\nthe  incorporated  cell  being  transferred  shall  pass  a  special\nresolution approving the transfer.\n\n\f12\n\nWhere a director of the incorporated cell approves the agreement,\n\n(4)\nhe shall within 21 days\n\n(a)\n\nsign a declaration which states that he reasonably believes\nthat  the  incorporated  cell  is,  where  applicable,  able  to\ndischarge  its  liabilities  when  they  become  due  and  the\ntransfer has been agreed to in accordance with subsection (3);\nand\n\n(b)\n\ndeliver a copy of the declaration to the company to which the\nincorporated cell is to be transferred.\n\nA director who makes a false statement on a declaration is guilty\n\n(5)\nof an offence.\n\nThe company to which the incorporated cell is to be transferred\n(6)\nshall submit the following documents to the Registrar for approval of\nthe transfer:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\na copy of the special resolution of each company authorising\nthe transfer;\n\na  copy  of  the  special  resolution  of  the  incorporated  cell\napproving the transfer;\n\na copy of the transfer agreement;\n\nsubject to subsection (4), a copy of the declaration of each\ndirector;\n\n(e)\n\na copy of its by-laws.\n\nThe incorporated cell company from which the incorporated cell\n(7)\nis to be transferred shall submit a copy of its by-laws to the Registrar.\n\nThe Registrar shall not approve a transfer where the transfer of\n(8)\nthe incorporated cell is inconsistent with the by-laws of the incorporated\ncell,  the  company  transferring  the  cell  or  the  company  to  which  the\nincorporated cell is to be transferred.\n\n\f13\n\n(9)\n\nWhere the Registrar approves a transfer,\n\n(a)\n\n(b)\n\n(c)\n\nthe  Registrar  shall  record  the  transfer  in  the  Register  of\nCompanies;\n\nthe incorporated cell ceases to be a cell of the incorporated\ncell company from which it was transferred;\n\nthe incorporated cell becomes a cell or an incorporated cell,\nas  the  case  may  be,  of  the  company  to  which  it  has  been\ntransferred.\n\n(10)\n\nWhere an incorporated cell is transferred\n\n(a)\n\nto another incorporated cell company,\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\nthe property and rights to which the incorporated cell\nwas  entitled  to  immediately  before  the  transfer  shall\nremain its property and rights;\n\nall liabilities, contracts, debts and other obligations to\nwhich the incorporated cell was subject to immediately\nbefore the transfer shall remain the liabilities, contracts,\ndebts and obligations of the incorporated cell;\n\nall actions and other legal proceedings which before the\ntransfer could have been instituted or continued by or\nagainst  the  incorporated  cell  may  be  instituted  or\ncontinued by or against the incorporated cell after the\ntransfer;\n\nany conviction, ruling, order or judgment in favour or\nagainst the incorporated cell before the transfer may be\nenforced by or against the incorporated cell after the\ntransfer;\n\n\f14\n\n(b)\n\nto  a  segregated  cell  company  to  become  a  cell  of  that\ncompany,\n\n(i)\n\n(ii)\n\n(iii)\n\nthe property and rights to which the incorporated cell\nwas  entitled  to  immediately  before  the  transfer  shall\nbecome the property and rights of the segregated cell\ncompany;\n\nall liabilities, contracts, debts and other obligations to\nwhich  the  incorporated  cell  was  subject  immediately\nbefore the transfer shall remain the liabilities, contracts,\ndebts and obligations of the segregated cell company;\n\nall  actions  and  other\nlegal  proceedings  which\nimmediately  before  the  transfer  could  have  been\ninstituted or continued by or against the incorporated\ncell  may  be  instituted  or  continued  by  or  against  the\nsegregated cell company;\n\n(iv)\n\nany conviction, ruling, order or judgment in favour or\nagainst the incorporated cell before the transfer may be\nenforced by or against the segregated cell company.\n\nWinding up of an incorporated cell company or an\nincorporated cell\n\n356.33.(1)\ncircumstances require, apply to\n\nPart  IV  of  this  Act  shall,  with  such  modifications  as  the\n\n(a)\n\n(b)\n\nan incorporated cell company;\n\nan incorporated cell as if the reference to a company were to\nan incorporated cell.\n\nNotwithstanding subsection (1), an incorporated cell company\n(2)\nthat  is  being  wound  up  shall  not  be  dissolved  until  each  of  its\nincorporated  cells  ceases  to  exist  as  an  incorporated  cell  of  the\nincorporated cell company.\n\n\f15\n\n(3)\nNotwithstanding  section  412,  where  an  incorporated  cell\ncompany is dissolved, the company shall not be struck off the Register\nof Companies until each of its incorporated cells has been\n\n(a)\n\nincorporated\ncompany;\n\nindependently  of\n\nthe\n\nincorporated  cell\n\n(b)\n\nmerged with a company;\n\n(c)\n\ncontinued as a company, a cell of a segregated company or\nan  incorporated  cell  of  another  incorporated  cell  company\nunder the law of another jurisdiction;\n\n(d)\n\ntransferred  to  another  incorporated  cell  company  or  to  a\nsegregated cell company; or\n\n(e)\n\nwound up.\n\nSubject  to  Part  IV,  the  winding  up  of  an  incorporated  cell\n(4)\ncompany shall be carried out in such a manner so as not to prejudice\nthe affairs and assets of its incorporated cells.\n\nRegulations\n\n356.34.(1)\nDivision.\n\nThe Minister may make regulations for the purposes of this\n\n(2)\n\nAny regulations made under subsection (1) may\n\n(a)\n\n(b)\n\n(c)\n\nprovide  for  the  procedure  and  conditions  for  an  existing\ncompany to become an incorporated cell company;\n\nprovide for the sound management of an incorporated cell\ncompany and incorporated cells;\n\nimpose such reporting obligations as the Minister may deem\nnecessary  including  a  report  in  respect  of  the  liquidity\nanalysis and the profit and loss statement of an incorporated\ncell company;\n\n\f16\n\n(d)\n\nprovide for the paying of fees and levying of charges; and\n\n(e)\n\nprovide for any person who commits an offence under the\nregulations to be liable to a fine of $5 000 or to imprisonment\nfor a term of one year or to both.\n\nDIVISION G.1\n\nSegregated Cell Companies and Cells\n\nApplication of this Division\n\nThis  Division  applies  to  every  company  incorporated  or\n356.35.(1)\ncontinued  under  this  Act  for  the  purposes  of  carrying  on  financial\nservices  activities  including  insurance,  banking  and  mutual  fund\nactivity  in  accordance  with  a  plan  whereby  the  assets  and  business\noperations  are  divided  into  cells  in  the  manner  provided  for  in\naccordance with this Division.\n\nWhen  a  provision  of  this  Division  is  inconsistent  with  or\n(2)\nrepugnant  to  any  other  provisions  of  this  Act,  the  provisions  of  this\nDivision shall, in so far as it affects a segregated cell company, prevail\nover other provisions of this Act.\n\nApplication of certain sections of the Act\n\n356.36.\nSubject  to  section  356.35,  the  following  provisions  shall,\nwith  such  modifications  as  the  circumstances  require,  apply  to  a\nsegregated cell company:\n\n(a)\n\n(b)\n\n(c)\n\nDivisions A, B, D, E, F, G, H, I, J, K and L of Part I;\n\nDivision D of Part III;\n\nPart V.\n\n\f17\n\nInterpretation\n\n356.37.(1)\n\nIn this Division\n\n“cell”  means a cell of a segregated cell company;\n\n“cell  shares”    means  shares  created  and  issued  by  a  segregated  cell\ncompany in respect of one of its cells pursuant to section 356. 42;\n\n“cell share capital” means the proceeds of issue of cell shares;\n\n“cellular  assets”\n\n  means\n\nthe  assets  of  a  segregated  cell\ncompany  attributable  to  the  cells  of  the  segregated  cell\ncompany pursuant to section 356. 41;\n\n“cellular  dividend”  means  a  dividend  payable  by  a  segregated  cell\ncompany in respect of cell shares pursuant to subsection (4) of\nsection 356. 42;\n\n“non-cellular assets”  in relation to a segregated cell company means\nthe assets of the segregated cell company which are not cellular\nassets pursuant to section 356.41;\n\n“segregated cell company”  means a company with one or more cells\nof which the assets and liabilities of a cell are segregated from the\nnon-cellular assets of the company and any other cell;\n\n“transaction” means any dealing of whatever nature, including the issue\nof  any  security,  by  which  the  assets  or  liabilities  linked  to  a\nsegregated account are affected or, in the case of assets intended\nby the parties to be applied to a risk of any nature, any dealing\nwhich exposes such assets to liability or loss.\n\nFor the purposes of this Division, an “administration order” is an\n(2)\norder directing that during the period for which the order is in force, the\nbusiness  and  assets  of  or  attributable  to  the  cell  or  the  business  and\nassets  of  the  company  shall  be  managed  by  a  person,  hereinafter\n\n\f18\n\nreferred  to  as  an  “administrator”,  appointed  by  the  court  for  that\npurpose.\n\nFor the purposes of this Division, a “receivership order” is an\n(3)\norder directing that the business and cellular assets of or attributable to\na  cell  shall  be  managed  by  a  person,  hereinafter  referred  to  in  this\nDivision as a “receiver”, specified by the court in the order.\n\nFormation of segregated cell companies\n\n356.38.\n\nFor the purposes of conducting business activity,\n\n(a)\n\n(b)\n\na company may incorporate in Barbados as a segregated cell\ncompany in accordance with the provisions of this Division;\n\nan  existing  company  incorporated  under  this  Act  may  be\nconverted  to  a  segregated  cell  company  in  the  manner\nprescribed; or\n\n(c)\n\nan external company may be\n\n(i)\n\nregistered as a segregated cell company in Barbados; or\n\n(ii)\n\ncontinued as a segregated cell company in Barbados.\n\nSegregated cell companies\n\n356.39.(1)\nprovides that is a segregated cell company.\n\nA  company  is  a  segregated  cell  company  if  its  by-laws\n\nA  segregated  cell  company  shall  file  its  by-laws  with  the\n\n(2)\nRegistrar within 21 days of its incorporation.\n\nA segregated cell company may create one or more cells for the\n\n(3)\npurposes of segregating and protecting cellular assets.\n\nNotwithstanding subsection (3), a segregated cell company is a\n(4)\nsingle  legal  person  and  the  creation  of  a  cell  by  the  segregated  cell\ncompany does not create, in respect of that cell, a legal person separate\nfrom the company.\n\n\f19\n\n(5)\nNotwithstanding  section  10,  the  name  of  a  segregated  cell\ncompany shall include the suffix “Segregated Cell Company” or the\nabbreviation “SCC”.\n\n(6)\nA company incorporated under the laws of a jurisdiction other\nthan Barbados and continued as a segregated cell company under this\nAct shall use the name designated in the Articles of Continuation with\nthe  addition  of  either  the  suffix  “Segregated  Cell  Company”  or  the\nabbreviation “SCC”.\n\nEach cell of a segregated cell company shall have its own distinct\n(7)\ndesignation  or  denomination  which  shall  be  clearly  set  out  in  the\nagreement governing the subscription for cell shares.\n\nRecords of segregated cell companies\n\n356.40.\n\nA segregated cell company shall\n\n(a)\n\n(b)\n\n(c)\n\nmaintain  records  in  accordance  with  this  Act  for  the\npreparation  of  financial  statements  and  the  records  shall\nclearly  show  the  share  capital,  proceeds  of  securities,\nreserves, assets, liabilities, income and expenses, dividends\nand distributions that are linked in the company;\n\nmaintain a record of each transaction linked to a cell account\nmaintained by the company;\n\nmaintain a general account which records in accordance with\nthis Act all the assets and liabilities of the company which\nare linked to a cell account.\n\nCellular and non-cellular assets\n\nThe  assets  of  a  segregated  cell  company  may  comprise\n356.41.(1)\ncellular assets or a combination of both cellular and non-cellular assets.\n\n\f20\n\n(2)\n\nThe directors of a segregated cell company shall\n\n(a)\n\n(b)\n\nkeep cellular assets separate and separately identifiable from\nnon-cellular assets; and\n\nkeep  cellular  assets  attributable  to  each  cell  separate  and\nseparately  identifiable  from  cellular  assets  attributable  to\nother cells.\n\nThe  directors  of  a  segregated  cell  company  may  cause  or\n\n(3)\npermit\n\n(a)\n\ncellular assets and non-cellular assets to be held\n\n(i)\n\nby or through a trustee or other custodian; or\n\n(ii)\n\nby a company, the shares and capital interests of which\nmay  be  cellular  assets  or  non-cellular  assets  or  a\ncombination of both;\n\n(b)\n\ncellular assets or non-cellular assets or a combination of both\nto  be  collectively  managed  by  an  investment  manager,\nprovided that the assets remain identifiable.\n\nThe assets attributable to a cell of a segregated cell company shall\n\n(4)\ncomprise\n\n(a)\n\nassets  represented  by  the  stated  capital  and  reserves\nattributable to the cell; and\n\n(b)\n\nall other assets attributable to or held within the cell.\n\nFor the purposes of subsection (4), “reserves” includes retained\n(5)\nearnings,  capital  reserves,  revaluation  surpluses  and  contributed\nsurpluses.\n\nCell shares and cell share capital\n\n356.42.(1)\nA segregated cell company may, in respect of any of its cells,\ncreate and issue shares and the cell share capital shall be part of the\n\n\f21\n\ncellular assets attributable to the cell in respect of which the cell shares\nwere issued.\n\nThe proceeds of the issue of shares, other than cell shares created\n(2)\nand  issued  by  a  segregated  cell  company,  shall  form  part  of  the\ncompany’s non-cellular assets.\n\nSubject  to  section  51,  a  segregated  cell  company  may  pay  a\n\n(3)\ncellular dividend in respect of cell shares.\n\nCellular  dividends  may  be  paid  in  respect  of  cell  shares  by\n(4)\nreference only to the cellular assets and liabilities attributable to the cell\nin respect of which the cell shares were issued.\n\nIn determining the cellular dividend payment, no account needs\n\n(5)\nto be taken of\n\n(a)\n\nthe profits and losses or the assets and liabilities attributable\nto any other cell of the segregated cell company; or\n\n(b)\n\nnon-cellular profits and losses or assets and liabilities.\n\nReduction of cell share capital of a segregated cell company\n\n356.43.(1)\nSubject to subsection (2), a segregated cell company or a\nholder  of  cell  shares  in  a  cell  of  a  segregated  cell  company  may  by\nspecial resolution of the cell shareholders reduce the cell share capital\nof the company in accordance with sections 44 and 45.\n\nAny creditor who is prejudiced by the authorised reduction of\n(2)\ncapital under subsection (1) may apply to the court for redress or for an\norder restraining or prohibiting the reduction of cell share capital.\n\nThe  court,  in  determining  any  application  brought  under  this\n(3)\nsection, shall have regard to the provisions of this section and such other\nfactors or circumstances as the court deems fit and appropriate.\n\n\f22\n\nLiability of a cell\n\n356.44.(1)\nWhere a liability of a segregated cell company to a person\narises  from  a  transaction  or  is  otherwise  imposed,  in  respect  of  a\nparticular cell,\n\n(a)\n\nthat  liability  of  the  company  shall  extend  only  to  that\nperson and that person shall, in respect of that liability, be\nentitled to have recourse only to\n\n(i)\n\n(ii)\n\nthe cellular assets attributable to that cell which shall be\nprimarily liable; and\n\nthe extent that the cellular assets attributable to that cell\nmay be insufficient, the company’s non-cellular assets,\nwhich shall be secondarily liable;\n\n(b)\n\nthat liability of the company shall not extend to that person\nand that person shall not, in respect of that liability, be entitled\nto have recourse to the cellular assets attributable to any other\ncell.\n\n(2)\n\nWhere a liability of a segregated cell company to a person\n\n(a)\n\narises otherwise than from a transaction related to a particular\ncell; or\n\n(b)\n\nis imposed otherwise than in respect of a particular cell,\n\nthe liability of the company shall extend only to that person and that\nperson shall, in respect of that liability, be entitled to have recourse only\nto the company’s non-cellular assets.\n\nApplication of cellular assets to liabilities\n\nSubject to the provisions of subsection (2), and save to the\n356.45.(1)\nextent that a segregated cell company may have agreed that a liability\nshall be discharged from the cellular assets attributable to a particular\n\n\f23\n\ncell of the company, where any liability which is attributable to that\nparticular cell of the company arises,\n\n(a)\n\n(b)\n\nthe cellular assets so identified of the cell shall be primarily\nattributable to the liability;\n\nwhere  the  cellular  assets  of  the  relevant  cell  have  been\nexhausted,  the  company’s  non-cellular  assets  shall  be\nsecondarily attributable to the liability; and\n\n(c)\n\ncellular assets not attributable to the relevant cell shall not be\nused to discharge the liability.\n\nWhere there is any loss or damage which is caused by fraud and\n(2)\nis  attributable  to  a  particular  cell  of  a  segregated  cell  company,  the\nliability  shall  be  discharged  from  the  company’s  non-cellular  assets\nwithout affecting the liability of any person other than the company.\n\nAny liability not attributable to a particular cell of a segregated\n(3)\ncell  company  shall  be  discharged  solely  from  the  company’s  non-\ncellular assets.\n\n(4)\n\nNotwithstanding the other provisions of this section,\n\n(a)\n\n(b)\n\nthe liability referred to in paragraph (a) of subsection (1) shall\nabate rateably until the value of the aggregate liability equals\nthe  value  of  the  assets  referred  to  in  paragraph  (a)  of\nsubsection (1), but the provisions of this paragraph shall be\ndisregarded  in  assessing  the  existence  and  extent  of  any\nsecondary liability under paragraph (b) of subsection (1);\n\nthe liabilities of the company’s non-cellular assets shall abate\nrateably until the value of the aggregate liabilities equals the\nvalue  of  those  assets,  but  the  provisions  of  this  paragraph\nshall not apply in any situation in which any of the liabilities\nof the company’s non-cellular assets arise from fraud or by\nreason of a special agreement referred to in subsection (1).\n\n\f24\n\nCreditors of a segregated cell company\n\n356.46.(1)\ncorrespond with the liabilities provided in section 356.44.\n\nThe rights of creditors of a segregated cell company shall\n\nNo creditor shall have any rights other than the rights referred to\n\n(2)\nin this section and in sections 356.45 and 356.48.\n\nThere shall be implied, except in so far as the same is expressly\n(3)\nexcluded in writing, in every transaction entered into by a segregated\ncell company the following terms:\n\n(a)\n\n(b)\n\n(c)\n\nthat no party shall seek, whether in any proceedings or by any\nother means whatsoever or wherever, to make or attempt to\nmake liable any cellular assets attributable to any cell of the\ncompany in respect of a liability not attributable to that cell;\n\nthat if any party shall succeed by any means whatsoever or\nwherever in making liable any cellular assets attributable to\nany  cell  of  the  company  in  respect  of  a  liability  not\nattributable  to  that  cell,  that  party  shall  be  liable  to  the\ncompany to pay a sum equal to the value of the benefit thereby\nobtained by him; and\n\nthat if any party shall succeed in seizing or attaching by any\nmeans  or  otherwise  levying  execution  against  any  cellular\nassets attributable to any cell of the company in respect of a\nliability not attributable to that cell, that party shall hold those\nassets or their proceeds on trust for the company and shall\nkeep  those  assets  or  proceeds  separate  and  identifiable  as\nsuch trust property.\n\nAll sums recovered by a segregated cell company as a result of\n(4)\nany such trust as is described in paragraph (c) of subsection (3) shall be\ncredited  against  any  concurrent  liability  imposed  pursuant  to  the\nimplied term as set out in paragraph (b) of subsection (3).\n\n\f25\n\n(5)\nAny  asset  or  sum  recovered  by  a  segregated  cell  company\npursuant  to  the  implied  term  set  out  in  paragraphs  (b)  or  (c)  of\nsubsection (3) or by any other means whatsoever or wherever in the\ncircumstances referred to in those paragraphs, shall, after the deduction\nor payment of any costs of recovery, be applied by the company so as\nto compensate the cell affected.\n\nWhere any cellular assets attributable to a cell of a segregated\n(6)\ncell company are taken in respect of a liability not attributable to that\ncell,  and  in  so  far  as  such  assets  or  compensation  in  respect  thereof\ncannot otherwise be restored to the cell affected, the company shall\n\n(a)\n\n(b)\n\ncause or procure its auditor to certify the value of the assets\nlost to the cell affected; and\n\ntransfer  or  pay,  from  the  cellular  or  non-cellular  assets  to\nwhich the liability was attributable to the cell affected, assets\nor sums sufficient to restore to the cell affected the value of\nthe assets lost.\n\nWhere under paragraph (b) of subsection (6) a segregated cell\n(7)\ncompany is obliged to make a transfer or payment from cellular assets\nattributable to a cell of the company and those assets are insufficient,\nthe company shall so far as possible, make up the deficiency from its\nnon-cellular assets.\n\nRecourse to cellular assets by creditors\n\n356.47.\nattributable to a cell of a segregated cell company\n\nSubject  to  sections  356.45  and    356.46,  cellular  assets\n\n(a)\n\nshall only be available to the creditors of the company who\nare creditors in respect of that cell and who shall thereby be\nentitled, in conformity with the provisions of this Act, to have\nrecourse to the cellular assets attributable to that cell; and\n\n\f26\n\n(b)\n\nshall  be  absolutely  protected  from  the  creditors  of  the\ncompany who are not creditors in respect of that cell and who\naccordingly  shall  not  be  entitled  to  have  recourse  to  the\ncellular assets attributable to that cell.\n\nTransfer of cellular and non-cellular assets from a segregated\ncell company\n\nCellular  assets  attributable  to  a  cell  of  a  segregated  cell\n356.48.(1)\ncompany may be transferred in the ordinary course of the company’s\nbusiness through payments, investments or otherwise to another cell of\nthe  segregated  cell  company  or  to  a  person,  wherever  resident  or\nincorporated.\n\nA  transfer  of  cellular  assets,  pursuant  to  subsection  (1),\n(2)\nattributable to a cell of a segregated cell company shall not of itself\nentitle creditors of that company to have recourse to the assets of the\nperson to whom the cellular assets were transferred, except where such\ntransfer of cellular assets was made by fraud or with intent to defraud\ncreditors.\n\nNon-cellular assets shall not be transferred by a segregated cell\n(3)\ncompany unless the transfer is permitted by a special resolution of the\nsegregated cell company.\n\nThe  provisions  of  this  section  shall  not  affect  any  power  of  a\n(4)\nsegregated cell company to lawfully make payments or transfers from\nthe  cellular  assets  attributable  to  any  cell  of  the  segregated  cell\ncompany to a person entitled, in conformity with the provisions of the\nAct, to have recourse to those cellular assets.\n\nAttribution of non-cellular assets and liabilities\n\n356.49.(1)\nLiabilities  of  a  segregated  cell  company  not  otherwise\nattributable to any of its cells shall be discharged from the company’s\nnon-cellular assets.\n\n\f27\n\n(2)\nIncome, receipts and other property or rights of or acquired by a\nsegregated cell company not otherwise attributable to any cell shall be\napplied to and comprised in the company’s non-cellular assets.\n\nProtection of creditors\n\n356.50.(1)\n\nA segregated cell company shall\n\n(a)\n\n(b)\n\ninform  any  persons  with  whom  it  transacts  that  it  is  a\nsegregated cell company; and\n\nfor the purposes of that transaction, identify or specify the\ncell in respect of which that person is transacting unless that\ntransaction is not a transaction in respect of a particular cell.\n\nWhere,  in  contravention  of  subsection  (1),  a  segregated  cell\n\n(2)\ncompany\n\n(a)\n\n(b)\n\nfails to inform a person that he is transacting with a segregated\ncell company and that person is otherwise unaware that, and\nhas no reasonable grounds to believe that, he is transacting\nwith a segregated cell company; or\n\nfails to identify or specify the cell in respect of which a person\nis transacting and that person is otherwise unaware of and has\nno reasonable basis of knowing which cell he is transacting\nwith,\n\nthen in either such case\n\n(i)\n\nthe directors shall, notwithstanding any provision to the\ncontrary in the company’s articles or in any contract with\nthe company or otherwise, incur personal liability to that\nperson in respect of the transaction; and\n\n(ii)\n\nthe directors shall have a right of indemnity against the\nnon-cellular  assets  of  the  company,  unless  they  were\n\n\f28\n\nfraudulent, they knowingly authorised, acquiesced in or\npermitted the contravention or acted in bad faith.\n\nNotwithstanding sub-paragraph (i) of subsection (2), the court\n(3)\nmay relieve a director of all or part of his personal liability thereunder\nif he satisfies the court that the director ought fairly to be so relieved\nbecause\n\n(a)\n\n(b)\n\nhe  was  not  aware  of  the  circumstances  giving  rise  to  his\nliability and, in being not so aware, he was neither fraudulent,\nnor did he knowingly authorise or acquiesce in, nor permit\nthe contravention, nor did he act in bad faith; or\n\nhe  expressly  objected  and  exercised  rights  as  he  had  as  a\ndirector, whether by way of voting powers or otherwise, so\nas to try to prevent the circumstances giving rise to liability.\n\nWhere,  pursuant  to  the  provisions  of  subsection  (3),  the  court\n(4)\nrelieves  a  director  of  all  or  part  of  his  personal  liability  under  sub-\nparagraph (i) of subsection (2), the court may order that the liability in\nquestion shall instead be met from such of the cellular or non-cellular\nassets  of  the  segregated  cell  company  as  may  be  specified  in  the\norder.\n\nTransfer of a cell\n\n356.51.(1)\nA cell of a segregated cell company may be transferred to\nanother segregated cell company or to an incorporated cell company.\n\n(2)\n\nIn order to effect a transfer under subsection (1),\n\n(a)\n\n(b)\n\na  segregated  cell  company  and  another  segregated  cell\ncompany; or\n\na  segregated  cell  company  and  an  incorporated  cell\ncompany,\n\nshall enter into a written agreement that sets out the terms of the transfer.\n\n\f29\n\n(3)\n\nNotwithstanding subsection (2),\n\n(a)\n\n(b)\n\nthe directors of each company shall approve the agreement\nin writing; and\n\neach company involved in the transfer shall pass a special\nresolution authorising the transfer set out in the agreement.\n\nWhere a director of the segregated cell company approves the\n\n(4)\nagreement, he shall within 21 days\n\n(a)\n\nsign a declaration which states that he reasonably believes\nthat  the  cell,  is,  where  applicable,  able  to  discharge  its\nliabilities when they become due and the transfer has been\nagreed to in accordance with subsection (3); and\n\n(b)\n\ndeliver a copy of the declaration to the company to which the\ncell is to be transferred.\n\nA director who makes a false statement on a declaration is guilty\n\n(5)\nof an offence.\n\nThe company to which the cell is to be transferred shall submit\n\n(6)\nthe following to the Registrar for approval of the transfer:\n\n(a)\n\na copy of the special resolution of each company authorising\nthe transfer;\n\n(b)\n\na copy of the transfer agreement;\n\n(c)\n\nsubject to subsection (4), a copy of the declaration of each\ndirector;\n\n(d)\n\na copy of its by-laws.\n\nThe  segregated  cell  company  from  which  the  cell  is  to  be\n\n(7)\ntransferred shall submit a copy of its by-laws to the Registrar.\n\n\f30\n\n(8)\nThe Registrar shall not approve a transfer where the transfer of\nthe cell is inconsistent with the by-laws of the company transferring the\ncell or the company to which the cell is to be transferred.\n\n(9)\n\nWhere the Registrar approves a transfer,\n\n(a)\n\n(b)\n\n(c)\n\nthe  Registrar  shall  record  the  transfer  in  the  Register  of\nCompanies;\n\nthe cell ceases to be a cell of the segregated cell company\nfrom which it was transferred;\n\nthe cell becomes a cell or an incorporated cell, as the case\nmay be, of the company to which it has been transferred.\n\n(10)\n\nWhere a cell is transferred\n\n(a)\n\nto another segregated cell company,\n\n(i)\n\n(ii)\n\n(iii)\n\nthe property and rights of the cell immediately before\nthe transfer shall become the property and rights of that\nsegregated cell company;\n\nall  liabilities,  contracts,  debts  and  obligations  of  the\nsegregated  cell  company  in  respect  of  the  cell\nimmediately before the transfer shall, in respect of the\ntransferred cell, become the liabilities, contracts, debts\nand obligations of that segregated cell company;\n\nlegal  proceedings  which\nall  actions  and  other\nimmediately  before  the  transfer  could  have  been\ninstituted or continued by or against a segregated cell\ncompany,  in  respect  of  the  cell,  may  be  instituted  or\ncontinued by or against the segregated cell company to\nwhich the cell is transferred;\n\n(iv)\n\nany conviction, ruling, order or judgment in favour or\nagainst a segregated cell company  in respect of the cell\nimmediately before the transfer, may be enforced by or\n\n\f31\n\nagainst  the  segregated  cell  company  to  which  the\ncell is transferred;\n\n(b)\n\nto an incorporated cell company as an incorporated cell,\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\nthe property and rights of a segregated cell company in\nrespect of the cell immediately before the transfer, shall\nbecome the property and rights of the incorporated cell;\n\nall  liabilities,  contracts,  debts  and  obligations  of  the\nsegregated  cell  company,  in  respect  of  the  cell,\nimmediately  before  the  transfer  shall  become  the\nliabilities,  contracts,  debts  and  obligations  of  the\nincorporated cell;\n\nall  actions  and  other\nlegal  proceedings  which\nimmediately  before  the  transfer  could  have  been\ninstituted or continued by or against a segregated cell\ncompany  in  respect  of  the  cell,  may  be  instituted  or\ncontinued by or against the incorporated cell;\n\nany conviction, ruling, order or judgment in favour or\nagainst a segregated cell company in respect of the cell\nbefore the transfer, may be enforced by or against the\nincorporated cell.\n\nApplication for administration order\n\n356.52.(1)\nbe made by\n\nAn application to the court for an administration order may\n\n(a)\n\n(b)\n\n(c)\n\na segregated cell company;\n\nthe directors of the segregated cell company;\n\nthe  shareholders  or  any  class  of  shareholders  of  the\nsegregated cell company or any cell; or\n\n\f32\n\n(d)\n\nany  creditor  of  the  segregated  cell  company,  or  where  the\norder  is  sought  in  respect  of  a  cell,  any  creditor  of  the\ncompany in respect of that cell.\n\n(2)\n\nThe court, on hearing an application\n\n(a)\n\n(b)\n\nfor an administration order; or\n\nfor leave for a resolution for voluntary winding up pursuant\nto subsection (5) of section 356.53,\n\nmay  make  an  interim  order  or  adjourn  the  hearing,  conditionally  or\nunconditionally.\n\nNotice of an application to the court for an administration order\n(3)\nin respect of a segregated cell company or a cell shall be served upon\n\n(a)\n\n(b)\n\n(c)\n\nthe company;\n\nthe Registrar; and\n\nany other person as the court may direct,\n\nwho shall be given an opportunity to make  representation to the court\nbefore the order is made.\n\nAdministration order in relation to segregated cell\ncompanies or cells\n\n356.53.(1)\nrelation to a segregated cell company, the court is satisfied that\n\nSubject  to  the  other  provisions  of  this  section,  where  in\n\n(a)\n\n(b)\n\nthe  cellular  assets  attributed  to  a  particular  cell  of  the\ncompany,  when  account  is  taken  of  the  company’s  non-\ncellular assets, are or are likely to be insufficient to discharge\nthe claims of creditors in respect of that cell; or\n\nthe company’s cellular assets and non-cellular assets are or\nare likely to be insufficient to discharge the liabilities of the\ncompany,\n\n\f33\n\nand the court considers that the making of an order under this section\nmay achieve one of the purposes set out in subsection (4), the court may\nmake an order, hereinafter referred to as “administration order”, under\nthis section in respect of that company.\n\nAn administration order may be made in respect of one or more\n\nThe purposes for which an administration order may be made\n\n(2)\ncells.\n\n(3)\nare\n\n(a)\n\n(b)\n\nthe survival as a going concern of the cell or of the company;\n\nthe more advantageous realisation of the business and assets\nof or attributable to the cell or the business and assets of the\ncompany than would be achieved by the receivership of the\ncell or by the liquidation of the company.\n\nAn administration order, whether in respect of a segregated cell\n\n(4)\ncompany or a cell\n\n(a)\n\nmay not be made where\n\n(i)\n\n(ii)\n\na liquidator has been appointed to act in respect of the\ncompany; or\n\nthe  company  has  passed  a  resolution  for  voluntary\nwinding up;\n\n(b)\n\nshall cease to be of effect upon the appointment of a liquidator\nto act in respect of the company, but without prejudice to prior\nacts.\n\nNo resolution for the voluntary winding up of a segregated cell\n(5)\ncompany  or  any  cell  of  that  company  which  is  subject  to  an\nadministration order shall be effective without the leave of the court.\n\n\f34\n\nFunctions of administrator and effect of administration\norder\n\n356.54.(1)\n\nThe administrator of a cell of a segregated cell company\n\n(a)\n\n(b)\n\nmay do all such things as may be necessary for the purposes\nset  out  in  subsection  (3)  of  section  356.53  for  which  the\nadministration order was made; and\n\nshall  have  all  the  functions  and  powers  of  the  directors  in\nrespect of the business and cellular assets of or attributable\nto the cell.\n\n(2)\n\nThe administrator may at any time apply to the court for\n\n(a)\n\ndirections  as  to  the  extent  or  exercise  of  any  function  or\npower;\n\n(b)\n\nthe administration order to be discharged or varied; or\n\n(c)\n\nan  order  as  to  any  matter  arising  in  the  course  of\nadministration.\n\nIn  exercising  his  functions  and  powers,  the  administrator  is\n(3)\ndeemed to act as the agent of the segregated cell company and shall not\nincur personal liability except to the extent that he is fraudulent, acts in\nbad faith or knowingly authorises, acquiesces in or permits improper\nconduct.\n\nAny person dealing with the administrator in good faith need not\n(4)\nbe concerned to enquire whether the administrator is acting within his\npowers.\n\nWhen an application has been made for an administration order\n(5)\nand during the period of operation of the order in respect of a segregated\ncell company or a cell, no proceedings may be instituted or continued\nby or against the company except by leave of the court, which may be\nconditional or unconditional.\n\n\f35\n\n(6)\nSubject to subsection (5), no steps may be taken to enforce any\nsecurity  in  respect  of  the  business  or  assets  of  the  company  or  the\nbusiness or assets of or attributable to the cell except by leave of the\ncourt, which may be conditional or unconditional.\n\n(7)\n\nDuring the period of operation of an administration order,\n\n(a)\n\nin respect of a cell,\n\n(i)\n\n(ii)\n\nthe functions and power of the directors shall cease in\nrespect  of  the  business  and  cellular  assets  of  or\nattributable to the cell; and\n\nthe  administrator  shall  be  deemed  a  director  of  the\ncompany  in  respect  of  the  company’s  non-cellular\nassets, unless there are no creditors of the company in\nrespect  of  that  cell,  entitled  to  have  recourse  to  the\ncompany’s non-cellular assets;\n\n(b)\n\nin respect of a segregated cell company, the functions and\npowers of the directors shall cease.\n\nDischarge and variation of administration order\n\n356.55.(1)\nit appears to the court that\n\nThe court shall not discharge an administration order unless\n\n(a)\n\n(b)\n\nthe purpose for which the order was made has been achieved\nor is incapable of achievement; or\n\nit would otherwise be desirable or expedient to discharge the\norder.\n\nThe court, on hearing an application for the discharge of variation\n(2)\nof an administration order, may make an interim order or adjourn the\nhearing conditionally or unconditionally.\n\n\f36\n\n(3)\n\nUpon discharging an administration order, the court may direct,\n\n(a)\n\n(b)\n\nwhere  the  administration  order  was  made  in  respect  of\na segregated cell company, that any payment made by the\nadministrator to any creditor of the company shall be deemed\nfull  satisfaction  of  the  liabilities  of  the  company  to  that\ncreditor; and the creditor’s claims against the company shall\nbe deemed extinguished;\n\nwhere the administration order was made in respect of a cell,\nthat any payment made by the administrator to any creditor\nof the company in respect of that cell shall be deemed full\nsatisfaction of the liabilities of the company to that creditor\nin respect of that cell; and the creditor’s claims against the\ncompany in respect of that cell shall be deemed extinguished.\n\nNothing  in  subsection  (3)  shall  operate  so  as  to  affect  or\n(4)\nextinguish any right or remedy of a creditor against any other person,\nincluding any surety of the segregated cell company.\n\nRemuneration of administration\n\n356.56.\nThe  remuneration  of  an  administrator  and  any  expenses\nproperly incurred by him shall be payable in priority to all other claims\nand in the case of\n\n(a)\n\nthe administration of a cell, from\n\n(i)\n\nthe cellular assets attributable to the cell; and\n\n(ii)\n\nto the extent these may be insufficient, the non-cellular\nassets of the segregated cell company; and\n\n(b)\n\nthe administration of a segregated cell company, from\n\n(i)\n\nthe non-cellular asset of the company; and\n\n(ii)\n\nto the extent these may be insufficient, the cellular assets\nin such shares or proportions as the court may direct.\n\n\f37\n\nApplication for receivership order\n\n356.57.(1)\nof a cell of a segregated cell company may be made by\n\nAn application to the court for a receivership order in respect\n\n(a)\n\n(b)\n\n(c)\n\nthe company;\n\nthe directors of the company;\n\nany creditor of the company in respect of that cell;\n\n(d)\n\nany holder of cell shares in respect of that cell;\n\n(e)\n\nthe administrator of that cell; or\n\n(f)\n\nthe Registrar.\n\n(2)\n\nThe court on hearing an application for\n\n(a)\n\n(b)\n\na receivership order; or\n\nfor leave for a resolution for voluntary winding up pursuant\nto subsection (5) of section 356.58,\n\nmay  make  an  interim  order  or  adjourn  the  hearing,  conditionally  or\nunconditionally.\n\nNotice of an application to the court for a receivership order in\n\n(3)\nrespect of a cell of a segregated cell company shall be served upon\n\n(a)\n\nthe company;\n\n(b)\n\nthe administrator, if any, of the cell;\n\n(c)\n\nthe Registrar; and\n\n(d)\n\nsuch other persons as the court may direct,\n\nwho shall be given an opportunity to make representations to the court\nbefore the order is made.\n\n\f38\n\nReceivership order in relation to cells\n\n356.58.(1)\nsegregated cell company the court is satisfied that\n\nSubject to the provisions of this section, if in relation to a\n\n(a)\n\nthe  cellular  assets  attributable  to  a  particular  cell  of  the\ncompany  when  account  is  taken  of  the  company’s  non-\ncellular assets are or are likely to be insufficient to discharge\nthe claims of creditors in respect of that cell; and\n\n(b)\n\nthe making of an order under this section would achieve the\npurposes set out in subsection (3),\n\nthe court may make an order hereinafter referred to as a “receivership\norder” in respect of that cell.\n\nA  receivership  order  may  be  made  in  respect  of  one  or  more\n\n(2)\ncells.\n\n(3)\n\nThe purposes for which a receivership order may be made are\n\n(a)\n\n(b)\n\nthe orderly winding up of the business of or attributable to\nthe cell; and\n\nthe distribution of the cellular assets attributable to the cell to\nthose entitled to have recourse thereto.\n\n(4)\n\nA receivership order\n\n(a)\n\nmay not be made if\n\n(i)\n\n(ii)\n\na liquidator has been appointed to act in respect of the\nsegregated cell company; or\n\nthe segregated cell company has passed a resolution for\nvoluntary winding up;\n\n(b)\n\nmay be made in respect of a cell subject to an administration\norder made under section 356.53;\n\n\f39\n\n(c)\n\nshall cease to be of effect upon appointment of a liquidator\nto act in respect of the segregated cell company, but without\nprejudice to prior acts.\n\n(5)\nNo resolution for the voluntary winding up of a segregated cell\ncompany  or any cell of which is subject to a receivership order shall\nbe effective without leave of the court.\n\nFunctions of receiver and effects of receivership order\n\n356.59.(1)\n\nThe receiver of a cell\n\n(a)\n\n(b)\n\nmay do all such things as may be necessary for the purposes\nset out in subsection (3) of section 356.58; and\n\nshall  have  all  the  functions  and  powers  of  the  directors  in\nrespect  of  the  business  and  cellular  assets  of  the  cell  or\nattributable to the cell.\n\n(2)\n\nThe receiver may at any time apply to the court for\n\n(a)\n\ndirections  as  to  the  extent  or  exercise  of  any  function  or\npower;\n\n(b)\n\nthe receivership order to be discharged or varied; or\n\n(c)\n\nan  order  as  to  any  matter  arising  in  the  course  of  his\nreceivership.\n\nIn exercising his functions and powers, the receiver is deemed to\n(3)\nact  as  the  agent  of  the  segregated  cell  company  and  shall  not  incur\npersonal liability except to the extent that he is fraudulent, acts in bad\nfaith  or  knowingly  authorises,  acquiesces  in  or  permits  improper\nconduct.\n\nAny  person  dealing  with  a  receiver  in  good  faith  need  not  be\n(4)\nconcerned to enquire whether the receiver is acting within his powers.\n\n\f40\n\nWhere an application has been made for a receivership order and\n\n(5)\nduring the period of operation of a receivership order,\n\n(a)\n\n(b)\n\nno proceedings may be instituted or continued by or against\nthe segregated cell company in relation to the cell in respect\nof which the receivership order was made; and\n\nno steps may be taken to enforce any security or in execution\nof legal process in respect of the business or cellular assets\nof  or  attributable  to  the  cell  in  respect  of  which  the\nreceivership order was made,\n\nexcept  by  leave  of  the  court,  which  may  be  conditional  or\nunconditional.\n\n(6)\n\nDuring the period of operation of a receivership order,\n\n(a)\n\n(b)\n\nthe  functions  and  powers  of  the  directors  shall  cease  in\nrespect  of  the  business  and  the  cellular  assets  of  or\nattributable to the cell in respect of which the order was made;\nand\n\nthe  receiver  of  the  cell  shall  be  deemed  a  director  of  the\nsegregated cell company in respect of the non-cellular assets\nof the company, unless there are no creditors in respect of\nthat  cell  entitled  to  have  recourse  to  the  company’s  non-\ncellular assets.\n\nDischarge and variation of receivership order\n\n356.60.(1)\nThe court shall not discharge a receivership order unless it\nappears to the court that the purpose for which the order was made has\nbeen  achieved,  has  been  substantially  achieved  or  is  incapable  of\nachievement.\n\nThe court, on hearing an application for the discharge or variation\n(2)\nof  a  receivership  order,  may  make  any  interim  order  or  adjourn  the\nhearing conditionally or unconditionally.\n\n\f41\n\n(3)\nUpon the court discharging a receivership order in respect of a\ncell of a segregated cell company on the ground that the purpose for\nwhich the order was made has been achieved or substantially achieved,\nthe  court  may  direct  that  any  payment  made  by  the  receiver  to  any\ncreditor of the company in respect of that cell shall be deemed in full\nsatisfaction of the liabilities of the company to that creditor in respect\nof that cell; and the creditor’s claims against the company in respect of\nthat cell shall be deemed to be extinguished.\n\nNothing  in  subsection  (3)  shall  operate  so  as  to  affect  or\n(4)\nextinguish any right or remedy of a creditor against any other person,\nincluding any surety of the segregated cell company.\n\n(5)\n\nSubject to the provisions of\n\n(a)\n\n(b)\n\nthis Act and any law relating to privileges and priorities of\nclaims; and\n\nany agreement between the segregated cell company and any\ncreditors  as  to  the  subordination  of  the  debts  due  to  the\ncreditor or to the debts due to the company’s other creditors,\n\nthe company’s cellular assets attributable to any cell of the company in\nrelation  to  which  a  receivership  order  has  been  made  shall,  in  the\nwinding up of the business of or attributable to that cell pursuant to the\nprovisions of this Part of this Act, be realised and applied in satisfaction\nof the company’s liabilities attributable to that cell pari passu.\n\nUnless the articles of the segregated cell company provide, any\n\n(6)\nsurplus shall thereafter be distributed\n\n(a)\n\n(b)\n\namong the holders of the cell shares or the persons otherwise\nentitled to the surplus; or\n\nwhere there are no cell shares and no such persons, among\nthe holders of the non-cellular shares,\n\n\f42\n\nin  each  case  according  to  their  respective  rights  and  interests  in  or\nagainst the company.\n\nThe court may, upon discharging a receivership order in respect\n(7)\nof a cell, direct that the cell shall be dissolved on such date as the court\nmay specify.\n\nImmediately upon the dissolution of a cell, the segregated cell\n(8)\ncompany shall not undertake business or incur liabilities in respect of\nthat cell.\n\nRemuneration of receiver\n\nThe remuneration of a receiver and any expenses properly\n356.61.\nincurred by him shall be payable, in priority to all other claims, from\n\n(a)\n\n(b)\n\nthe cellular assets attributable to the cell in respect of which\nthe receiver was appointed; and\n\nto the extent that these may be insufficient, the non-cellular\nassets of the segregated cell company.\n\nLiquidation of a segregated cell company\n\n356.62.(1)\nthe liquidation of a segregated cell company, the liquidator\n\nNotwithstanding any statutory provision to the contrary, in\n\n(a)\n\n(b)\n\nshall  be  bound  to  deal  with  the  company’s  assets  in\naccordance  with  the  requirements  of  subsection  (2)  of\nsection 356. 41;\n\nin discharge of the claims of creditors of the segregated cell\ncompany, shall apply the company’s assets to those entitled\nto have recourse thereto in conformity with the provisions of\nthis Act.\n\nThe provisions of this Act relating to the distribution of property\n(2)\non winding up shall apply to a segregated cell company subject to such\n\n\f43\n\nmodifications as may be necessary to bring them in conformity with\nthis Act.\n\nMiscellaneous\n\nRegulations\n\n356.63.(1)\nDivision.\n\nThe Minister may make regulations for the purposes of this\n\n(2)\n\nAny regulations made under subsection (1) may\n\n(a)\n\n(b)\n\n(c)\n\nprovide  for  the  procedure  and  conditions  for  an  existing\ncompany to become a segregated cell company;\n\nprovide  for  the  sound  management  of  a  segregated  cell\ncompany;\n\nimpose such reporting obligations as the Minister may deem\nnecessary  including  a  report  in  respect  of  the  liquidity\nanalysis and the profit and loss statement of a segregated cell\ncompany;\n\n(d)\n\nprovide for the paying of fees and levying of charges; and\n\n(e)\n\nprovide for any person who commits an offence under the\nregulations to be liable to a fine of $5 000 or to imprisonment\nfor a term of one year or to both.”.\n\n\f44\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2016.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2016.\n\nPresident\n\n"
}