{
  "bill_id": 143,
  "slug": "immigration-amendment-bill-2016",
  "title": "Immigration (Amendment) Bill, 2016",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/05ee664338eb9997f026c18615eaa31d.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-05-18",
  "first_reading": "2016-05-25",
  "second_reading": "2016-05-17",
  "gazette_date": "2016-02-15",
  "passed_date": "2016-06-01",
  "markdown": "Explanatory Memorandum after pages 8\n\n2016-02-01\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Immigration Act, Cap. 190 to make provision for\nan  offence  of  smuggling  of  persons  in  accordance  with  the  United  Nations\nConvention Against Transnational Organized Crime and for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\nShort title\n\nAmendment of section 12A of Cap. 190\n\nInsertion of new section 29A in Cap. 190\n\nAmendment of section 30 of Cap. 190\n\nAmendment of the Extradition Act, Cap. 189\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Immigration Act.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Immigration (Amendment) Act, 2016.\n\n\f4\n\nAmendment of section 12A of Cap. 190\n\n2.\nThe Immigration Act, in this Act referred to as the principal Act, is\namended in section 12A by deleting the closing words in subsection (5) and\nsubstituting the following:\n\n“the  master  of  the  vessel  is  guilty  of  an  offence  and  is  liable  on\nconviction on indictment to a fine of $200 000 or to imprisonment for\na term of 5 years or to both.”.\n\nInsertion of new section 29A in Cap. 190\n\n3.\nimmediately after section 29:\n\nThe principal Act is amended by inserting the following new sections\n\n“Offences re smuggling of persons\n\n29A.(1)\nA person is guilty of the offence of smuggling of persons\nwho  with  intent  to  obtain  directly  or  indirectly  a  financial  or  other\nmaterial benefit\n\n(a)\n\nengages  in  conduct  preliminary  to  or  takes  part  in  the\nsmuggling of persons by sea or air without complying with\nthe requirements for legal entry into Barbados;\n\n(b)\n\nwhile engaging in conduct referred to in paragraph (a),\n\n(i)\n\nproduces a fraudulent travel or identity document; or\n\n(ii)\n\nprocures,  provides  or  possesses  a  fraudulent  travel  or\nidentity document; or\n\n(c)\n\narranges  for  a  person  who  is  not  a  national  or  permanent\nresident of Barbados to remain in Barbados without having\nthat person comply with the legal requirements for remaining\nin Barbados.\n\n\f5\n\n(2)\nA  person  is  guilty  of  committing  the  offence  of  smuggling  of\npersons  with  aggravation  where  in  committing  the  offence,  the\nperson\n\n(a)\n\n(b)\n\nendangers the lives of the persons concerned; or\n\nengages in inhumane or degrading treatment.\n\nWhere in proceedings brought under subsection (1), evidence is\n(3)\nfound that a vessel is engaged in the smuggling of migrants by sea, the\nvessel may be seized and forfeited.\n\n(4)\n\nIn this section\n\n“fraudulent travel or identity document” means any travel or identity\n\ndocument that\n\n(a)\n\n(b)\n\nhas been falsely made or altered in some material way by a\nperson other than a person lawfully authorized to make or\nissue the travel or identity document;\n\nhas  been\nmisrepresentation or in any other unlawful manner; or\n\nissued  or  obtained\n\nimproperly\n\nthrough\n\n(c)\n\nis being used by a person other than the rightful holder;\n\n“vessel” means any type of water craft that is capable of being used for\n\ntransportation on water.\n\nPenalties\n\n29B.(1)\nA  person  who  is  convicted  under  section  29A  (1)  of  the\noffence of smuggling of persons is liable on conviction on indictment\nto a fine of $1 500 000 or to imprisonment for 15 years or to both.\n\nA person who is convicted under section 29A (2) of the offence\n(2)\nof smuggling of persons with aggravation is liable on conviction on\nindictment to a fine of $2 000 000 or to imprisonment for 25 years or\nto both.\n\n\f6\n\nForfeiture\n\n29C.(1)\nWhere  a  person  has  been  convicted  of  the  offence  of\nsmuggling of persons or smuggling of persons with aggravation, and\nthe court is satisfied that\n\n(a)\n\nany  property  of  the  person  convicted  was  used  or  was\nintended to be used or was obtained in the course of the crime;\nor\n\n(b)\n\nany benefits were gained from the proceeds of the crime,\n\nthe court shall order that the property or benefits be forfeited and accrue\nto the Criminal Assets Recovery Fund.\n\n(2)\n\nFor the purposes of subsection (1)\n\n(a)\n\n“Criminal  Assets  Recovery  Fund”  means\nthe  fund\nestablished under section 14 of the Transnational Organized\nCrime (Prevention and Control) Act, 2011 (Act 2011-3) and\ncontinued under section 3 of the Criminal Assets Recovery\nFund Act, 2016 (Act 2016- );\n\n(b)\n\n“property” includes money, valuables and other movable and\nimmovable property.\n\nThe forfeiture of property referred to in subsection (1) applies to\n(3)\nthe property of persons convicted of the smuggling of persons or the\nsmuggling of persons with aggravation, whether or not the property is\nlocated in Barbados.”.\n\nAmendment of section 30 of Cap. 190\n\n4.\nthe following:\n\nThe principal Act is amended by deleting section 30 and substituting\n\n\f7\n\n“General penalties\n\n30.(1)\nA person who is guilty of an offence under this Act for which\nno other penalty is provided is liable on summary conviction to a fine\nof $5 000 or to imprisonment for 12 months or to both.\n\nWhere  subsidiary  legislation  made  under  this  Act  creates  an\n(2)\noffence, the subsidiary legislation may provide for such offences to be\ntried summarily or on indictment and the subsidiary legislation may\nprescribe the following penalties:\n\n(a)\n\n(b)\n\nin  the  case  of  an  offence  triable  summarily,  a  fine  not\nexceeding $5 000 or imprisonment for a term of 12 months\nor both;\n\nin  the  case  of  an  offence  triable  on  indictment,  a  fine  not\nexceeding $25 000 or imprisonment for a term of 5 years or\nboth.”.\n\nAmendment of the Extradition Act, Cap. 189\n\n5.\nthe following as paragraph 40:\n\nThe Extradition Act, Cap. 189, is amended in the Schedule by adding\n\n“40.\n\nAny offence concerning the smuggling of persons.”.\n\n\f8\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2016.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2016.\n\nPresident\n\n\fImmigration Act, 2016\n\nEXPLANATORY MEMORANDUM\n\nSUMMARY\nThe  purpose  of  this  Bill  is  to  make  fuller  provision  for  the  prevention  of  the\nsmuggling  of  persons  in  the  terms  of  the  Protocol  against  the  Smuggling  of\nMigrants  by  Land,  Sea  and  Air,  supplementing  the  United  Nations  Convention\n\nAgainst Transnational Organized Crime.\n\nThe creation of offences related to the smuggling of persons in the Immigration Act\nnow reflects the fact that the offences created are essentially immigration offences and\nthat prevention lies in strong border control.\n\nNotwithstanding  the  title  of  the  Protocol,  the  emphasis  of  the  Protocol  is  on  the\nsmuggling of persons by sea. This is clearly expressed in Part II (Articles 7 to 9) of the\nProtocol which is headed “smuggling of migrants by sea”. There are no provision of\nthe Protocol which expressly deal with smuggling by air or land.\n\nThis Bill must be read with the Trafficking in Persons Prevention Bill, 2015 and the\nCriminal  Assets  Recovery  Fund  Bill,  2015  which  provide  for  other  aspects  of  the\n\nConvention Against Transnational Organized Crime.\n\nClause 2: Amendment of section 12A\nThe amendment to this section increases the penalty of imprisonment from to 2 years\nto  5  years.  The  amendment  also  removes  two  existing  ambiguities.  Firstly,  by\nproviding for the offence to be tried on indictment, it makes it clear that the offence is\nnot to be tried summarily. Secondly, it removes the conflict that the general penalty in\nsection 30 applied to the offence under this section.\n\nClause 3: Insertion of new section 29A (offences of the smuggling of persons)\n\n1\n\n\fThis  provision  implements  Article  6  of  the  Protocol  which  requires  states  to\ncriminalize  the  smuggling  of  migrants  especially  where  false  travel  and  identity\ndocuments are used.\n\nSubsection (1): offence of the smuggling of persons\nSubsection (1) creates an offence of the smuggling of persons simpliciter.\n\nSubsection (2): offence of the smuggling of persons with aggravation\nSubsection (2) creates an offence of the smuggling of persons with aggravation. This\nimplements  Article  6  (3)  of  the  Protocol  which  requires  that  a  special  offence  be\ncreated  where  the  lives  of  person  are  endangered  or  where  persons  are  subjected  to\ninhuman or degrading treatment. These circumstances would include for example, the\novercrowding  of  migrant  boats,  the  insufficiency  of  ventilation,  food  and  water  and\nthe infliction of physical abuse.\n\nInsertion of new section 29B: Penalties\nThis  clause  provides  heavy  penalties  in  relation  to  the  offences  prescribed  under\nsection  29A.  A  heavier  penalty  is  prescribed  in  relation  to  the  offence  of  the\nsmuggling of persons with aggravation.\n\nInsertion of new section 29B: Forfeiture\nThis clause implements Articles 12, 13 and 14 of the Convention by providing for the\nforfeiture of assets where an offence of smuggling of persons is committed.\n\nClause: 4 Amendment of section 30 (General penalties)\nThis amendment clarifies the law by removing an ambiguity relating to the mode of\ntrial  of  the  offences  under  the  Act  and  the  imposition  of  the  general  penalty.  The\namendment now makes it clear that the general penalty does not apply to any of the\nindictable  offences  under  the  Act  and  secondly,  that  the  mode  of  trial  for  those\noffences to which the general penalty applies is by way of summary trial.\n\nClause: 5 Amendment of the Extradition Act, Cap. 189\nThis clause would make the offence of smuggling of persons an extraditable offence.\n\n2\n\n"
}