{
  "bill_id": 144,
  "slug": "criminal-assets-recovery-fund-bill-2016",
  "title": "Criminal Assets Recovery Fund Bill, 2016",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/4427754ad48784beddf60555de67ad0d.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-05-18",
  "first_reading": "2016-05-25",
  "second_reading": "2016-05-17",
  "gazette_date": "2016-02-15",
  "passed_date": "2016-06-01",
  "markdown": "Explanatory Memorandum after pages 7\n\n2016-01-13\n\nOBJECTS AND REASONS\n\nThis  Bill  would,  on  the  repeal  of  the  Transnational  Organized  Crime\n(Prevention and Control) Act, 2011, provide for the continuation of the Criminal\nAssets Recovery Fund which consists of the proceeds of crime which have been\nconfiscated by order of a court of law.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nInterpretation\n\nCriminal Assets Recovery Fund\n\nResources of the Fund\n\nAdministration of Fund\n\nApplication of the resources of the Fund\n\nInsufficient funds\n\nInvestment of funds\n\nAccounts\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nReports\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  provide  for  the  continuation  of  the  Criminal  Assets  Recovery\nFund on the repeal of the Transnational Organized Crime (Prevention and\nControl) Act, 2011.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n2016.\n\nThis  Act  may  be  cited  as  the  Criminal  Assets  Recovery  Fund,  Act\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Fund” means the Criminal Assets Recovery Fund;\n\n“seized assets” means property, including money, derived from criminal conduct\n\nand seized by order of a court.\n\nCriminal Assets Recovery Fund\n\nThe  Criminal  Assets  Recovery  Fund,  established  under\n\nthe\n3.\nTransnational  Organized  Crime  (Prevention  and  Control)  Act,  2011\n(Act 2011-3), shall continue in existence under this Act on the repeal of that Act.\n\nResources of the Fund\n\n4.\n\nThere shall be paid into the Fund\n\n(a)\n\nthe  proceeds  of  any  seized  assets  recovered  under  a  forfeiture  or\nconfiscation order pursuant to\n\n(i)\n\n(ii)\n\nthe Proceeds of Crime Act, Cap. 143;\n\nthe Money Laundering and Financing of Terrorism (Prevention\nand Control) Act, Cap. 129;\n\n(iii)\n\nthe Anti-Terrorism Act, Cap. 158;\n\n(iv)\n\nthe Trafficking in Persons Prevention Act, 2016 (Act 2016- ); and\n\n(v)\n\nthe proceeds of any seized assets recovered under a forfeiture or\nconfiscation order pursuant to any other Act;\n\n(b)\n\nany moneys voted for the purpose by Parliament;\n\n\f5\n\n(c)\n\nany  sums  paid  to  the  Government  of  Barbados  by  a  foreign  state\nrecovered  from  seized  assets  whether  under  a  treaty  or  a  bilateral\nagreement which makes provision for the sharing of such assets; and\n\n(d)\n\nany moneys received from any other source for the purposes specified\nin section 6.\n\nAdministration of Fund\n\n5.\ncontrol and direction of the Attorney-General.\n\nThe Fund shall be administered by the Accountant-General under the\n\nApplication of the resources of the Fund\n\n6.\npurposes:\n\n(a)\n\nThe  resources  of  the  Fund  shall  be  applied  towards  the  following\n\nto satisfy an obligation of the Government of Barbados to a foreign\nstate  pursuant  to  a  treaty  or  a  bilateral  agreement  which  makes\nprovision for the sharing of seized assets;\n\n(b)\n\nthe payment of restitution, compensation or costs awarded under the\n\n(i)\n\n(ii)\n\nthe Proceeds of Crime Act, Cap. 143;\n\nthe Money Laundering and Financing of Terrorism (Prevention\nand Control) Act, Cap. 129;\n\n(iii)\n\nthe Anti-Terrorism Act, Cap. 158;\n\n(iv)\n\nthe Trafficking in Persons Prevention Act, 2016 (Act 2016- ); or\n\n(v)\n\nany other Act to which section 4 (a) (v) applies;\n\n(c)\n\nto defray any expenses incurred in respect of the administration of the\n\n(i)\n\n(ii)\n\nthe Proceeds of Crime Act, Cap. 143;\n\nthe Money Laundering and Financing of Terrorism (Prevention\nand Control) Act, Cap. 129;\n\n\f6\n\n(iii)\n\nthe Anti-Terrorism Act, Cap. 158;\n\n(iv)\n\nthe Trafficking in Persons Prevention Act, 2016 (Act 2016- ); or\n\n(v)\n\nany other Act to which section 4 (a) (v) applies; and\n\n(d)\n\nto defray any expenses incurred in respect of the implementation of\nany measures relating to the prevention, detection and investigation of\ncriminal activity.\n\nInsufficient funds\n\nWhere at any time the resources of the Fund are insufficient to make\n7.(1)\nthe payments referred to in section 6, those obligations shall be met from such\nsums as Parliament may vote for the purpose.\n\nAny sum voted by Parliament pursuant to subsection (1) shall be repaid\n\n(2)\nout of the Fund as soon as practicable and paid into the Consolidated Fund.\n\nInvestment of funds\n\n8.\nWhere in the opinion of the Attorney-General it is appropriate to do\nso, he may direct that such sums from the Fund as he determines are to be invested\nin such manner as he may decide.\n\nAccounts\n\n9.(1)\n\nThe Accountant-General shall, in relation to the Fund,\n\n(a)\n\n(b)\n\nmaintain adequate financial and other records; and\n\nprepare a statement of accounts in respect of each financial year.\n\nThe accounts of the Fund shall be audited at least once every financial year\n\n(2)\nby the Auditor-General.\n\n\f7\n\nReports\n\n10.(1)\nThe  Accountant-General  shall  prepare  quarterly  reports  of  the\neconomic  activity  of  the  Fund  and  shall  deliver  the  reports  to  the  Attorney-\nGeneral not later than 21 days following the end of each quarter.\n\nThe Attorney-General shall, as soon as practicable after receiving a report\n\n(2)\nreferred to in subsection (1), cause a copy to be laid in both Houses.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2016.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2016.\n\nPresident\n\n\fCriminal Assets Recovery Fund, Act 2015\n\nEXPLANATORY MEMORANDUM\n\nSUMMARY\n\nThis  Bill  would  on  the  repeal  of  the  Transnational  Organized  Crime  (Prevention  and\nControl) Act, 2011, provide for the continuation of the Criminal Assets Recovery Fund\nwhich consists of the proceeds of crime which have been confiscated by order of a court\nof law.\n\nThe  establishment  of  the  Fund  and  the  rules  governing  the  disposal  of  the  Funds  are\nnecessary for the purposes of good governance and proper administration. Secondly, the\nBill  implements  Articles  12,  13  and  14  of  the  Convention  Against  Transnational\nOrganized Crime by providing for a regime of forfeiture and the disposal of the funds so\nforfeited. Providing for these matters in a separate Bill recognizes the fact that the Fund\nrelates to all proceeds of crime and not only to transnational organized crime.\n\nClause 1: Short title\nThis clause provides for the short title.\n\nClause 2: Interpretation\nThis clause provides definitions for the terms used in the Bill.\n\nClause 3: Criminal Assets Recovery Fund\nThis clause provides for the continuation of the Fund after the repeal of the Transnational\n\nOrganized Crime (Prevention and Control) Act, 2011.\n\nClause 4: Resources of the Fund\nThis clause specifies the sources of forfeited property which are to be placed in the Fund.\n\nClause: 5 Administration of Fund\nThis clause provides that the Fund is to be administered by the Accountant-General.\n\n\fClause 6: Application of the resources of the Fund\nThis clause specifies the purposes to which the resources in the Fund should be applied.\n\nClause 7: Insufficient funds\nThis clause requires any short fall in the Fund to be supplemented from the Consolidated\nFund for the application of the purposes specified in clause 6.\n\nClause 8: Investment of funds\nThis clause permits the Attorney-General to invest the resources of the Fund.\n\nClause 9: Accounts\nThis  clause  requires  the  Accountant-General  to  keep  proper  records  with  respect  to  the\nFund. It also requires the Auditor-General for the purpose of accountability to audit the\nFund.\n\nClause 10: Reports\nThis clause requires the Accountant-General to prepare quarterly reports with respect to\nthe Fund for submission to the Attorney-General for the purposes of good administration.\nIt also requires the Attorney-General to lay the reports in Parliament as a matter of record\nand for the purposes of transparency.\n\n"
}