{
  "bill_id": 145,
  "slug": "trafficking-in-persons-prevention-bill-2016",
  "title": "Trafficking in Persons Prevention Bill, 2016",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/f3cd17747b82425885f98b005cad804b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-03-02",
  "first_reading": "2016-03-09",
  "second_reading": "2016-03-01",
  "gazette_date": "2016-02-15",
  "passed_date": "2016-06-01",
  "markdown": "Explanatory Memorandum after pages 20\n\n2016-01-13\n\nOBJECTS AND REASONS\n\nThis Bill would give effect to the United Nations Protocol to Prevent, Suppress\nand  Punish  Trafficking  in  Persons,  Especially  Women  and  Children,\nSupplementing the United Nations Convention Against Transnational Organized\nCrime and for matters connected therewith.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nInterpretation\n\nOffence of trafficking in persons\n\nTrafficking in children\n\nConsent is not a defence and past sexual behaviour inadmissible\n\nUnlawfully destroying or withholding travel document etc.\n\nTransporting a person for the purpose of exploiting that person’s\nprostitution\n\nKnowingly receiving financial benefit from trafficking in persons\n\nKnowingly receiving financial benefit from trafficking in children\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nForfeiture\n\n11.\n\nRestitution\n\n12.\n\nOffences of bodies corporate\n\n13.\n\nAdditional penalties\n\n14.\n\nVictim may offer a defence\n\n\f3\n\n15.\n\nProtection and safety of victims\n\n16.\n\nPrivacy of victims\n\n17.\n\nInformation for victims\n\n18.\n\nAssistance to victims\n\n19.\n\nImmigration regime for victims\n\n20.\n\nReturn of victims to home country\n\n21.\n\nSpecial considerations for child victims\n\n22.\n\nJurisdiction\n\n23.\n\nExtradition\n\n24.\n\nMutual legal assistance\n\n25.\n\nWarrant\n\n26.\n\nObstructing police officers and other officials\n\n27.\n\nNational Task Force\n\n28.\n\nAmendment of the Extradition Act, Cap. 189\n\n29.\n\nAmendment of the Defence Act, Cap. 159\n\n30.\n\nRepeal of Act 2011-3\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to give effect to the United Nations Protocol to Prevent, Suppress\nand  Punish  Trafficking  in  Persons,  Especially  Women  and  Children,\nSupplementing  the  United  Nations  Convention  Against  Transnational\nOrganized Crime and for matters connected therewith.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n2016.\n\nThis Act may be cited as the Trafficking in Persons Prevention Act,\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“child” means a person under the age of 18 years;\n\n“Criminal Assets Recovery Fund” means the Fund established under section 14\nof  the  Transnational  Organized  Crime  (Prevention  and  Control)  Act,\n2011 (Act 2011-3) and continued under section 3 of the Criminal Assets\nRecovery Fund Act, 2016 (Act 2016- );\n\n“debt bondage” means the status or condition of a person arising from his pledge\nto provide his personal services or those of a person under his control as\nsecurity for a debt, where\n\n(a)\n\n(b)\n\nthe value of those services as reasonably assessed is not applied toward\nthe liquidation of the debt;\n\nthe period during which those services are to be provided is not limited;\nor\n\n(c)\n\nthe nature of those services is not defined;\n\n“exploitation” includes\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nkeeping a person in a state of slavery;\n\nsubjecting a person to practices similar to slavery;\n\ncompelling or causing a person to provide forced labour or services;\n\nkeeping a person in a state of servitude, including domestic and sexual\nservitude;\n\n(e)\n\nthe exploitation of the prostitution of another;\n\n\f7\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nengaging  in  any  other  form  of  commercial  sexual  exploitation,\nincluding, pimping, pandering, procuring, profiting from prostitution\nand maintaining a brothel;\n\nchild pornography;\n\nthe illicit removal of human organs;\n\ncausing a person to transport illegal items within or across borders; and\n\nderiving a benefit through the abuse of another person;\n\n“illicit removal of organs” means the unlawful removal of organs, tissue or body\nparts from a victim irrespective of whether the victim consented to such\nremoval;\n\n“Minister” means the Minister responsible for legal affairs;\n\n“offence of trafficking” means the offence of trafficking in children referred to\nin section 3 and the offence of trafficking in persons referred to in section\n4;\n\n“offence of trafficking in children” means the offence referred to in section 3;\n\n“offence of trafficking in persons” means the offence referred to in section 4;\n\n“slavery” means the status or condition of a person over whom any or all the\n\npowers attaching to the right of ownership are exercised;\n\n“victim” means a person against whom an offence is committed or against whom\n\nan offence is alleged to have been committed under this Act.\n\nOffence of trafficking in persons\n\n3.(1)\nspecified in subsection (2)\n\nA person who, for the purpose of exploitation by any of the means\n\n(a)\n\nrecruits,  transports,  transfers,  harbours  or  receives  persons  into  or\nwithin Barbados;\n\n\f8\n\n(b)\n\nrecruits,  transports  or  transfers  persons  from  Barbados  to  another\njurisdiction; or\n\n(c)\n\nreceives or harbours persons from Barbados in another jurisdiction,\n\nis guilty of the offence of trafficking in persons and is liable on conviction on\nindictment, to a fine of $1 000 000 or to imprisonment for 25 years or to both.\n\n(2)\n\nThe means referred to in subsection (1) are\n\n(a)\n\n(b)\n\n(c)\n\nthreats or the use of force or other forms of coercion;\n\nabduction;\n\nfraud or deception;\n\n(d)\n\nthe abuse of power or the abuse of a position of vulnerability; or\n\n(e)\n\nthe giving or receiving of payment or benefits to achieve the consent\nof a person having control over another person.\n\nA person who incites or directs another person to traffic in persons is guilty\n(3)\nof the offence of trafficking in persons and is liable on conviction on indictment,\nto a fine of $1 000 000 or to imprisonment for 25 years or to both.\n\n(4)\n\nFor the purposes of subsection (1), coercion means\n\n(a)\n\n(b)\n\nviolent coercion; or\n\nnon-violent or psychological coercion, such as\n\n(i)\n\nthreats of serious harm to or physical restraint against a person;\n\n(ii)\n\nthe abuse or threatened abuse of legal process; or\n\n(iii)\n\nany scheme, plan or pattern intended to cause a person to believe\nthat failure to perform an act would result in serious harm to or\nphysical restraint against a person.\n\n\f9\n\nTrafficking in children\n\n4.(1)\n\nA person who for the purpose of exploitation\n\n(a)\n\nrecruits, transports, transfers, harbours or receives a child into or within\nBarbados;\n\n(b)\n\nreceives or harbours a child from Barbados in another jurisdiction; or\n\n(c)\n\nrecruits,  transports  or  transfers  a  child  from  Barbados  to  another\njurisdiction,\n\nis guilty of the offence of trafficking in children and is liable on conviction on\nindictment to a fine of $2 000 000 or to imprisonment for life or to both.\n\nThe recruitment, transportation, transfer, harbouring or receipt of a child\n(2)\nfor the purpose of exploitation is sufficient to establish the offence of trafficking\nin children.\n\nA person who incites or directs another person to traffic in children is guilty\n(3)\nof the offence of trafficking in children and is liable on conviction on indictment,\nto a fine of $2 000 000 or to imprisonment for life or to both.\n\nConsent is not a defence and past sexual behaviour inadmissible\n\n5.(1)\nIn any prosecution for an offence of trafficking under this Act, the\nalleged  consent  of  the  victim  to  the  intended  or  realized  exploitation  is  not  a\ndefence.\n\nIn any prosecution for an offence of trafficking under this Act, the legal\n\n(2)\nage of consent to sex or to marriage is not a defence.\n\nIn any prosecution for an offence of trafficking under this Act, evidence\n\n(3)\nof a victim’s past sexual behaviour is inadmissible for the purpose of proving\n\n(a)\n\n(b)\n\nthat the victim engaged in other sexual behaviour; or\n\nthe victim’s sexual predisposition.\n\n\f10\n\nUnlawfully destroying or withholding travel document etc.\n\n6.(1)\nin children\n\nA person who for the purpose of trafficking in persons or trafficking\n\n(a)\n\n(b)\n\nacts  or  purports  to  act  as  another  person’s  employer,  manager,\nsupervisor, contractor, employment agent, or solicitor of clients; and\n\nknowingly  procures,  destroys,  conceals,  removes,  confiscates,  or\npossesses  any  travel  document  belonging  to  another  person  or\ndocument  that  establishes  or  purports  to  establish  another  person’s\nidentity or immigration status,\n\nis  guilty  of  an  offence  and  is  liable  on  conviction  on  indictment  to  a  fine  of\n$250 000 or to imprisonment for 20 years or to both.\n\nFor the purposes of subsection (1), “travel document” means any document\n\n(2)\nthat can be used for travel between states such as\n\n(a)\n\n(b)\n\n(c)\n\na passport;\n\na visa;\n\na tourist card;\n\n(d)\n\nan airline ticket; and\n\n(e)\n\nany other document used under the laws of a state to establish identity\nin that state.\n\nTransporting a person for the purpose of exploiting that person’s\nprostitution\n\n7.\nA person who transports or conspires to transport another person into\nor within Barbados or across an international border for the purpose of exploiting\nthat person’s prostitution is guilty of an offence and is liable on conviction on\nindictment to a fine of $1 000 000 or to imprisonment for 25 years or to both.\n\n\f11\n\nKnowingly receiving financial benefit from trafficking in persons\n\nA person who receives or obtains a financial or other benefit, knowing\n8.\nthat the financial or other benefit results from the offence of trafficking in persons,\nis  guilty  of  an  offence  and  is  liable  on  conviction  on  indictment,  to  a  fine  of\n$1 000 000 or to imprisonment for 25 years or to both.\n\nKnowingly receiving financial benefit from trafficking in children\n\n9.\nA person who receives or obtains a financial or other benefit, knowing\nthat  the  financial  or  other  benefit  results  from  the  offence  of  trafficking  in\nchildren, is guilty of an offence and is liable on conviction on indictment, to a\nfine of $2 000 000 or to imprisonment for life or to both.\n\nForfeiture\n\n10.(1)\npersons or trafficking in children, and the court is satisfied that\n\nWhere a person has been convicted of the offence of trafficking in\n\n(a)\n\nany property of the person convicted was used or was intended to be\nused or was obtained in the course of the crime; or\n\n(b)\n\nany benefits were gained from the proceeds of the crime,\n\nthe court shall order that the property or benefits be forfeited and accrue to the\nCriminal Assets Recovery Fund.\n\nFor the purposes of subsection (1) “property” includes money, valuables\n\n(2)\nand other movable and immovable property.\n\nThe  forfeiture  of  property  referred  to  in  subsection  (1)  applies  to  the\n(3)\nproperty of persons convicted of trafficking in persons or trafficking in children\nwhether or not the property is located in Barbados.\n\n\f12\n\nRestitution\n\n11.(1)\nWhere a person is convicted of an offence of trafficking, the court\nmay, in addition to any penalty imposed pursuant to this section, order that person\nto pay restitution to the victim.\n\n(2)\n\nRestitution must compensate, where applicable, for any of the following:\n\n(a)\n\n(b)\n\n(c)\n\ncosts of medical and psychological treatment;\n\ncosts of physical and occupational therapy and rehabilitation;\n\ncosts of necessary transportation, temporary housing and child care;\n\n(d)\n\nlost income;\n\n(e)\n\nattorney’s fees and other legal costs;\n\n(f)\n\n(g)\n\ncompensation for emotional distress, pain and suffering;\n\nany  other  losses  suffered  by  the  victim  which  the  court  considers\napplicable.\n\nNotwithstanding subsection (2), where the property of a person convicted\n(3)\nunder this Act is forfeited, restitution shall be paid to the victim as far as possible\nfrom that property or from the Criminal Assets Recovery Fund.\n\nOffences of bodies corporate\n\n12.(1)\nbody corporate is liable on conviction on indictment to a fine of $5 000 000.\n\nWhere a body corporate is guilty of an offence under this Act, that\n\nWhere a body corporate is guilty of an offence under this Act, any officer,\n(2)\ndirector  or  agent  of  the  company  who  directed,  authorized,  assented  to,\nacquiesced  in  or  participated  in  the  commission  of  the  offence  is  liable  on\nconviction to the punishment provided for the offence.\n\n\f13\n\nAdditional penalties\n\nWhere a body corporate or its director, manager, secretary or other\n13.\nsimilar  officer  concerned  with  the  management  of  a  body  corporate  has  been\nconvicted of an offence under this Act, the court may, in addition to imposing\nthe penalty prescribed for the stated offence,\n\n(a)\n\n(b)\n\n(c)\n\nrevoke the business licence of the body corporate;\n\norder that the body corporate be wound up;\n\nforfeit the assets and properties of the body corporate to the Criminal\nAssets Recovery Fund; or\n\n(d)\n\nprohibit the body corporate from performing any further activities.\n\nVictim may offer a defence\n\nWhere a victim has been compelled to engage in unlawful activities\n14.\nas  a  direct  result  of  being  trafficked,  and  the  victim  has  committed  any\nimmigration-related offence or any other criminal offence for which he is being\nprosecuted, the victim may offer as a defence, evidence of having been compelled\nas a victim of trafficking to engage in such unlawful activities.\n\nProtection and safety of victims\n\n15.\nin persons, the following guiding principles shall apply:\n\nIn the investigation and prosecution of offences relating to trafficking\n\n(a)\n\n(b)\n\n(c)\n\nall steps necessary to identify a victim of trafficking shall be taken;\n\na victim shall be given reasonable protection to prevent recapture by\nthe traffickers and their associates;\n\na victim’s family shall be given reasonable protection if they reside in\nBarbados, from threats, reprisals or intimidation by the traffickers or\ntheir associates;\n\n\f14\n\n(d)\n\n(e)\n\n(f)\n\na  victim  shall  be  given  assistance  in  understanding  the  laws  of\nBarbados and his rights as a victim;\n\na  victim  shall  be  given  assistance  in  language  interpretation  and\ntranslation where necessary;\n\na victim shall have an opportunity to consult with an attorney-at-law\nor any other appropriate person or agency with respect to his rights,\nsafety and welfare.\n\nPrivacy of victims\n\nIn a prosecution for trafficking under this Act, the identity of the victim\n16.(1)\nand the victim’s family shall be kept confidential by ensuring that names and\nidentifying information of the victim and the victim’s family are not released to\nany member of the public or published in the press or media.\n\nA  hearing  under  this  section  shall  be  held  in  camera  unless  the  court\n\n(2)\notherwise directs.\n\nA person who contravenes subsection (1) is guilty of an offence and is\n\n(3)\nliable on summary conviction to a fine of $100 000.\n\nInformation for victims\n\n17.\nThe Minister shall ensure that, as appropriate, a victim of trafficking\nis informed of his legal rights as well as the progress of court and administrative\nproceedings in a language that the victim can understand; and such information\nshall include,\n\n(a)\n\n(b)\n\n(c)\n\nproceedings involving the criminal offenders;\n\nproceedings for the return of the victim to his country of citizenship or\nlawful residence; and\n\nprocedures for seeking legal immigration status for the victim under\nthe Immigration Act, Cap. 190.\n\n\f15\n\nAssistance to victims\n\n18.(1)\nA  victim  of  trafficking  who  is  not  a  national  of  Barbados  and  the\nvictim’s accompanying dependent children may receive for the duration of their\nstay in Barbados, such benefits as may be determined by the appropriate Minister\nresponsible for the relevant benefit; and those benefits may include\n\n(a)\n\n(b)\n\n(c)\n\nappropriate housing;\n\neducation and training opportunities;\n\npsychological counselling;\n\n(d)\n\nlegal assistance and legal information; and\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nassistance  in  obtaining  any  relevant  documents  and  information  to\nassist with legal proceedings;\n\nthe provision of safe shelter;\n\nassistance to cover living expenses; and\n\nmedical assistance.\n\nIn  the  absence  of  exigent  circumstances,  a  victim  of  trafficking,  when\n(2)\nidentified as such, shall not be housed in a prison or other detention facility for\naccused persons or convicted criminals.\n\nA child victim of trafficking, when identified as such, shall not be housed\n(3)\nin a prison or other detention facility for accused or convicted criminals under\nany circumstances.\n\nImmigration regime for victims\n\n19.\nThe  Minister  responsible  for  immigration  may  provide  a  victim  of\ntrafficking and any accompanying dependent children with appropriate permits\nor other required authorization to allow them to remain and work in Barbados\nfor the duration of the criminal prosecution against the traffickers.\n\n\f16\n\nReturn of victims to home country\n\n20.(1)\nThe Minister shall establish a system to effect the return of a victim\nto his country of citizenship or to a country in which the victim holds permanent\nresidence.\n\n(2)\n\nThe system established under subsection (1) shall take into account\n\n(a)\n\n(b)\n\n(c)\n\nthe safety of the victim while in Barbados;\n\nthe safe return of the victim without undue delay; and\n\nthe wishes of the victim as to the choice of country to which he is to\nbe sent.\n\nSpecial considerations for child victims\n\nIn implementing any provision of this Act, special consideration shall\n21.\nbe given to a trafficking victim who is a child in a manner that is in the child’s\nbest interests and appropriate to the situation.\n\nJurisdiction\n\n22.\nthis Act where the act constituting the offence has been carried out\n\nA court in Barbados shall have the jurisdiction to try an offence under\n\n(a)\n\n(b)\n\n(c)\n\nwholly or partly in Barbados;\n\nby a national of Barbados, whether in Barbados or elsewhere; or\n\nby a person on board a vessel or aircraft that is registered in Barbados.\n\nExtradition\n\n23.(1)\nWhere a person who has committed or is alleged to have committed\nan offence under this Act is present in Barbados and it is not intended to extradite\nthat person, the Director of Public Prosecutions shall prosecute the offender for\nthe offence where the direction of the Attorney-General to do so is given under\nparagraph (b) of section 79A(2) of the Constitution.\n\n\f17\n\n(2)\nNotwithstanding the provisions of this Act, no person shall be extradited\npursuant to this Act where the Government of Barbados has substantial grounds\nfor believing that a request for extradition for an offence under this Act has been\nmade for the purpose of prosecuting or punishing a person on account of that\nperson’s  race,  religion,  nationality,  ethnic  origin  or  political  opinion  or  that\ncompliance with the request would be prejudicial to that person’s rank or status\nfor any of those reasons.\n\nMutual legal assistance\n\nThe Mutual Assistance in Criminal Matters Act, Cap. 140A shall apply\n24.\nto this Act in relation to an offence under this Act as if the offence were a serious\noffence within the meaning of section 2 of that Act.\n\nWarrant\n\nWhere  a  Judge,  Magistrate  or  Justice  of  the  Peace  is  satisfied  by\n25.(1)\ninformation on oath that there are reasonable grounds for suspecting that evidence\nof or relating to an offence under this Act is to be found on any premises specified\nin  the  information,  the  Judge,  Magistrate  or  Justice  of  the  Peace  may  issue  a\nwarrant in accordance with subsection (2).\n\nA warrant issued under subsection (1) may authorize a police officer named\n(2)\nin the warrant to enter the premises specified in the warrant, with such assistance\nand by the use of such force as is necessary and reasonable to\n\n(a)\n\n(b)\n\n(c)\n\nenter upon the premises;\n\nsearch the premises for evidence of or relating to an offence under this\nAct; and\n\nseize and search any article, vehicle or property found in the course of\nthe search that the police officer believes, on reasonable grounds, to be\nevidence of or relating to an offence under this Act.\n\n\f18\n\nObstructing police officers and other officials\n\n26.\n\nA person who\n\n(a)\n\n(b)\n\nthreatens,  assaults  or  obstructs  a  police  officer,  a  member  of  the\nBarbados Coast Guard or an immigration officer acting in the execution\nof his duty under this Act; or\n\nthreatens, assaults or obstructs a social worker, shelter worker, case\nmanagement  worker  or  any  other  worker  who  is  involved  in  the\nprovision of assistance and protection to a victim,\n\nis guilty of an offence and is liable on summary conviction to a fine of $20, 000\nor to imprisonment for 3 years or to both.\n\nNational Task Force\n\n27.(1)\nTask Force Against Trafficking in Persons”.\n\nThere shall be established a Task Force to be known as the “National\n\n(2)\n\nThe functions of the Task Force shall be\n\n(a)\n\nto  establish  policies  and  develop  a  national  plan  of  action,  for  the\npurposes of\n\n(i)\n\n(ii)\n\nthe  prevention  of  trafficking  in  persons  and  trafficking  in\nchildren;\n\nthe identification of victims of trafficking and the provision of\nassistance to and protection of those victims;\n\n(iii)\n\nthe prosecution of traffickers;\n\n(iv)\n\nthe repatriation of victims; and\n\n(b)\n\nto co-ordinate the implementation of the national plan in partnership\nwith\ninter-governmental\norganizations and other States.\n\nnon-governmental\n\norganizations,\n\n\f19\n\nThe Minister shall appoint such number of persons as he thinks fit from\n\n(3)\nappropriate organizations and Ministries to be members of the Task Force.\n\n(4)\n\nThe Minister shall appoint a member to be the Chairman of the Task Force.\n\nThe Task Force shall meet at such times and on such days as the Task Force\n\n(5)\nmay determine.\n\nThe Chairman shall preside at all meetings of the Task Force, but where\n(6)\nhe  is  absent,  the  members  present  shall  appoint  a  Chairman  to  preside  at  the\nmeeting.\n\n(7)\n\nThe Task Force shall regulate its own procedure.\n\nAmendment of the Extradition Act, Cap. 189\n\n28.\nparagraph 39 and substituting the following:\n\nThe Extradition Act, Cap. 189 is amended in the Schedule by deleting\n\n“39. Offences under the Trafficking in Persons Prevention Act, 2016\n(Act 2016- ).”\n\nAmendment of the Defence Act, Cap. 159\n\n29.\nadding the following at the end thereof:\n\nThe  Third  Schedule  to  the  Defence  Act,  Cap.  159  is  amended  by\n\n“17. Trafficking in Persons Prevention Act, 2016 (Act 2016- )”.\n\nRepeal of Act 2011-3\n\n30.\n2011 (Act 2011-3) is repealed.\n\nThe Transnational Organized Crime (Prevention and Control) Act,\n\n\f20\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2016.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2016.\n\nPresident\n\n\fTrafficking in Persons Prevention Bill, 2015\n\nEXPLANATORY MEMORANDUM\n\nSUMMARY\nThe purpose of this Bill is to repeal the Transnational Organized Crime (Prevention and\nControl) Act, 2011 (Act 2011-3) in order to make fuller provision for the prevention of\nthe  trafficking  in  persons  and  the  implementation  of  the  United  Nations  Protocol  to\n\nPrevent,  Suppress  and  Punish  Trafficking  in  Persons,  Especially  Women  and\nChildren,  supplementing\nthe  United  Nations  Convention  Against  Transnational\nOrganized Crime.\n\nThe Bill broadens the scope of the offences by creating an offence where trafficking in\npersons  takes  place  within  the  country  and  creates  a  special  offence  with  heavier\npenalties in relation to the trafficking of children.\n\nThe Bill now makes extensive provision for the protection of victims and the treatment of\nvictims.  Certain  privileges  relating  to  immigration  matters  and  legal  proceedings  are\ngranted  to  victims.  Special  provision  is  made  for  the  treatment  of  victims  who  are\nchildren.\n\nThis Bill is related to  the Immigration Amendment (No.    )  Bill, 2015 and the Criminal\nAssets Recovery Fund Bill, 2015 which also make better provision for other aspects of the\nConvention  Against  Transnational  Organized  Crime.  The  first  mentioned  Bill  will\nprovide  for  the  offence  of  the  smuggling  of  persons  on  the  repeal  of  the  Transnational\nOrganized Crime (Prevention and Control) Act. The amendment to the Immigration Act\nreflects  the  fact  that  the  offences  created  are  essentially  immigration  offences  and  that\nprevention lies in strong border control.\n\nThe  Criminal  Assets  Recovery  Fund  Bill,  2015  will  provide  on  the  repeal  of  the\nTransnational Organized Crime (Prevention and Control) Act, 2011 for the continuation\nof  the  Criminal  Assets  Recovery  Fund  in  which  confiscated  proceeds  of  crime  are\n\n\fdeposited. Providing for these matters in a separate Bill emphasizes the fact that the Fund\nrelates to all proceeds of crime and not only to transnational organized crime.\n\nThe Bill makes no specific reference to organized criminal groups within the meaning of\nArticle 5 of the Convention as the general law will apply. The offences in the Bill will\napply  not  only  to  individuals  but  also  where  two  or  more  persons  are  acting  in  concert\n(also  referred  to  as  “joint  criminal  enterprise”).  In  particular,  the  law  relating  to\nconspiracy, inchoate offences and accomplices will apply.  The Bill also makes specific\nprovision for the important inchoate offence of incitement and the secondary offence of\nreceiving financial benefit from the offence of trafficking in persons.\n\nClause 1: Short title\nThis clause provides for the short title.\n\nClause 2: Interpretation\nThis  clause  provides  definitions  for  the  terms  used  in  the  Bill.  In  particular,  the  term\n“exploitation”  is  widely  defined  in  accordance  with  Article  3  (a)  of  the  Protocol  to\ninclude slavery, sexual servitude, prostitution, child pornography and the illicit removal\nof organs.\n\nThe  term  “child”  carries  the  same  definition  as  the  Protocol.  That  term  is  defined  in\nArticle 3 (d) of Protocol.\n\nClause 3: Offence of trafficking in persons\nThis clause specifies the elements of the offence of trafficking in persons, including the\ninchoate offence of inciting another to commit the offence. Despite the narrow scope of\napplication  in  Article  4  of  the  Protocol,  the  offence  created  in  this  clause  need  not  be\ntransnational  in  nature  or  involve  an  organized  criminal  group.  The  clause  therefore\nfollows  Article  34  (2)  of  the  Convention  which  requires  that  offences  should  be\n“established in domestic law independently of the transnational nature or the involvement\nof an organized criminal  group”. The offence is therefore committed whether the act is\ncommitted by an individual or by several persons acting in concert.\n\n\fClause 4: Trafficking in children\nIn accordance with the Article 3 (c) of the Protocol a stricter offence is created in relation\nto the trafficking in children.\n\nClause 5: Consent is not a defence and past sexual behaviour inadmissible\nThis clause complies with Article 3 (b) of the Protocol by providing that the consent of a\nvictim to exploitation should not be a defence to the charge of trafficking in persons.\n\nClause 6: Unlawfully destroying or withholding travel document etc.\nThis  clause  creates  a  special  offence  in  relation  to  destroying  or  withholding  travel\ndocuments as this is a common means of securing the exploitation of persons.\n\nClause  7:  Transporting  a  person  for  the  purpose  of  exploiting  that  person’s\nprostitution\nThis  clause  creates  a  special  offence  in  relation  to  sexual  exploitation  as  a  means  of\npreventing this type of exploitation.\n\nClause 8: Knowingly receiving financial benefit from trafficking in persons\nThis clause creates an offence for the purpose of punishing accomplices and accessories\nto the offence of trafficking in persons.\n\nClause 9: Knowingly receiving financial benefit from trafficking in children\nThis  clause  creates  a  special  offence  with  heavier  penalties  where  financial  benefit  is\nderived from trafficking in children.\n\nClause 10: Forfeiture\nThis  clause  implements  Articles  12,  13  and  14  of  the  Convention  by  providing  for  a\nregime of forfeiture and the disposal of the funds so forfeited.\n\nClause 11: Restitution\nThis  clause  makes  provision  for  restitution  to  be  made  to  victims  in  appropriate\ncircumstances and in particular it implements Article 14 (2) of the Convention.\n\n\fClause 12: Offences of bodies corporate\nThis clause supplements the general law relating to the prosecution of corporate bodies in\naccordance with Article 10 of the Convention and provides for the imposition of heavy\npenalties where an offence is committed under the Act.\n\nClause 13: Additional penalties\nThis clause provides for action to be taken to close businesses which are involved in the\ncommission of offences under the Act.\n\nClause 14: Victim may offer a defence\nThis clause in accordance with Article 6 (2) gives a victim of trafficking the right to give\nevidence to prove that he or she was not complicit in the offence of trafficking but was\ngenuinely exploited.\n\nClause 15: Protection and safety of victims\nThis clause implements Article 6 of the Protocol by making provision for the protection\nof victims of trafficking from recapture and reprisals.\n\nClause 16: Privacy of victims\nThis clause provides for hearings to be held in camera and gives victims the right to have\ntheir identity protected in accordance with Article 6 (1) of the Protocol.\n\nClause 17: Information for victims\nThis clause in accordance with Article 6 (2) makes provision for pertinent information to\nbe given to victims in relation to their immigration status and any legal proceedings that\nmay be undertaken.\n\nClause 18: Assistance to victims\nThis  clause  implements  Article  6  (3)  to  (5)  of  the  Protocol  by  making  provision  for\nfinancial, social and legal assistance to be granted to victims of trafficking.\n\n\fClause 19: Immigration regime for victims\nThis clause provides for immigration leniency to be provided to victims of trafficking in\naccordance with Article 7 of the Protocol.\n\nClause 20: Return of victims to home country\nThis  clause  provides  for  a  repatriation  regime  in  accordance  with  Article  8  of  the\nProtocol.\n\nClause 21: Special considerations for child victims\nThis  clause  requires  that  special  consideration  be  given  to  child  victims  in  accordance\nwith Article 6 (4) of the Protocol.\n\nClause 22: Jurisdiction\nThis  clause provides  for the  circumstances in which Barbados will exercise jurisdiction\nover person involved in trafficking in persons. This jurisdiction is consistent with Article\n15 of the Convention.\n\nClause 23: Extradition\nThis  clause  generally  restates  the  law  applicable  to  extradition.  It  is  consistent  with\nArticle 16 of the Convention.\n\nClause 24: Mutual legal assistance\nThis clause makes it clear that that the Mutual Assistance in Criminal Matters Act, Cap.\n140A applies to the offence of trafficking in persons. This provision implements Article\n18 of the Convention.\n\nClause 25: Warrant\nThis clause would facilitate the conduct of investigations and strengthen enforcement.\n\nClause 26: Obstructing police officers and other officials\nThis  clause  creates  an  offence  in  relation  to  obstruction  and  so  facilitates  the\nadministration and enforcement of the Act.\n\n\fClause 27: National Task Force\nThis clause formally establishes the National Task Force Against Trafficking in Persons.\nThe Task Force will develop policies and establish best practices to prevent and control\ntrafficking  in  Persons.  The  Task  Force  will  also  be  responsible  for  public  awareness\nstrategies in accordance with Article 31 of the Protocol.\n\nClause 28: Amendment of the Extradition Act Cap. 189\nThis  clause  makes  a  consequential  amendment  to  the  Extradition  Act  by  applying  that\nAct to this Bill.\n\nClause 29: Amendment of the Defence Act Cap. 159\nThis  clause  makes  a  consequential  amendment  to  the  Defence  Act  by  applying  the\nprovisions of that Schedule to this Bill.\n\nClause 30: Repeal of Act 2011-3\nThis  clause  provides  for  the  repeal  of  the  Transnational  Organized  Crime  (Prevention\nand Control) Act, 2011.\n\n"
}