{
  "bill_id": 149,
  "slug": "supplementary-estimates-no10-20152016",
  "title": "Supplementary Estimates No.10 2015-2016",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/c0e65bba8502338ac04028ee082c855e.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2016-03-17",
  "first_reading": "2016-03-17",
  "second_reading": "2016-03-19",
  "gazette_date": null,
  "passed_date": "2016-03-19",
  "markdown": "HOUSE OF ASSEMBLY\nResolved that the sum of SIXTY THREE MILLION, EIGHT HUNDRED AND EIGHTY ONE THOUSAND, FIVE HUNDRED AND SIXTY-FIVE DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2015-2016 as shown in the Supplementary Estimates No.10 2015-2016 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2015 ~ 2016 No.10\nT\nHEAD Code Number HEAD: 12 PARLIAMENT Program: 030 Parliament Subprogram: 0030 Management Commission of Parliament Account Code: 316 - Grants to Public Institutions HEAD: 42 MINISTRY OF SOCIAL CARE, CONSTITUENCY EMPOWERMENT AND COMMUNITY DEVELOPMENT Program: 634 Poverty Alleviation and Reduction Programme | Subprogram: 04371 Alleviation and Reduction of Poverty Account Code: 415 - Grants to Non-Profit Organisations j , 120300030 426340431 i Provision in Approved Estimates 2015 - 2016 Other Expenditure 10,586,304\n5 Provision in Supplementary Supplementary Provision Estimates Required No, 1-9\nOther Other Expenditure Expenditure\nj\nj\n943,289\n949,850\nHEAD: 72 MINISTRY OF AGRICULTURE, FOOD, FISHERIES AND WATER RESOURCE MANAGEMENT Program: 161 Measures to Stimulate Increased Livestock Production Subprogram: 0639 Southern Meats 721610639 Account Code: 316 — Grants to Public Institutions | Program: 518 Barbados Water Authority Subprogram: 0542 Barbados Water Authority 725180542 Account Code: 416 — Grants to Public Institutions HEAD: 75 MINISTRY HOUSING, LANDS AND RURAL DEVELOPMENT Program: 520 Housing Program | Subprogram: 0533 National Housing Corporation | 755200533 | Account Code: 316 — Grants to Public Institutions 100 80,387,815 5,953,940\n600,000\n183,882\n49,136,358\n12,668,186\nADDENDUM\nHead 12: Parliament\nProgram 030\nParliament\nSubprogram 0030\nManagement Commission of Parliament\nAccount Code 316 Grants to Public Institutions - $943,289\nThe sum of nine hundred and forty three thousand two hundred and eighty nine dollars ($943,289) is required to meet commitments to the end of the current financial year.\nADDENDUM\nHead 42: Ministry of Social Care, Constituency Empowerment and Community Development\nProgram 634\n- Poverty Alleviation and Reduction Programme\nSubprogram 0431\n- Alleviation and Reduction of Poverty\nAccount Code 415 Grants to Non-Profit Organisation - $949,850\nThe sum of nine hundred and forty nine thousand eight hundred and fifty dollars ($949,850) is required to meet the cost of expenditure under the Ministry's Poverty Alleviation and Reduction Programme.\nADDENDUM\nHead 72: Ministry of Agriculture, Food, Fisheries and Water Resource Management\nProgram 161\n- Measures to Stimulate Increased Livestock Production\nSubprogram 0639\n- Southern Meats\nAccount Code 316 Grants to Public Institutions - $183,882\nThe sum of one hundred and eighty three thousand eight hundred and eighty two dollars ($183,882) is required to provide support to Southern Meats Inc.\nProgram 518 - Barbados Water Authority Subprogram 0542 - Barbados Water Authority\nAccount Code 416 Grants to Public Institutions - $49,136,358\nThe sum of forty nine million one hundred and thirty six thousand three hundred and fifty-eight dollars ($49,136,358) is required to provide support to the Barbados Water Authority.\nADDENDUM\nHead 75: Ministry of Housing, Lands and Rural Development\nProgram 520\nHousing Program\nSubprogram 0533\nNational Housing Corporation\nAccount Code 316 Grants to Public Institutions\n$12,668,186\nThe sum of twelve million six hundred and sixty eight thousand one hundred and eighty six dollars ($12,668,186) is required to cover loan payments and assist with salaries and wages for the National Housing Corporation.\n"
}