{
  "bill_id": 151,
  "slug": "vesting-in-bwa-at-garden-land-and-skeetes-road",
  "title": "Vesting in BWA at Garden Land and Skeetes Road",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/1eb58542394538d0baedb68d2b80e87e.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-05-03",
  "first_reading": "2016-05-25",
  "second_reading": null,
  "gazette_date": null,
  "passed_date": "2016-05-25",
  "markdown": "PARLIAMENT\nRESOCLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, approve the vesting in the Barbados Water Authority of the parcels of land, the property of the Crown, situate at Lot 60, The Garden Land and Skeete's Road, Bank Hall respectively, both in the parish of Saint Michael, in this Island, more particularly described in the Schedules to this Resolution for the public purpose of the construction of a pump station and septic tank as part of the Housing and Neighbourhood Upgrading Programme (HNUP).\nAPPROVED by the House of Assembly this\nday of\nTwo\nthousand and sixteen.\nSpeaker\nAPPROVED by the House of Assembly this\nday of\nTwo\nthousand and sixteen.\nPresident\nFIRST SCHEDULE\nCrown,\nALL THAT land the property of the situate at Lot 60, The Garden Land, in the parish of Saint Michael, in this Island, containing by admeasurement 210.8 square meters or thereabouts (inclusive of 20.4 square meters in a public drain and 27.7 square meters in road) together with the pump station, wells, manholes, sewerage pipes and connections thereon Abutting and Bounding on lands now or late of James Hinds (Lot 61) on lands now or late of Dorian Cumberbatch on lands now or late of Ione M. Beckles (Lot 59) and on a public road which leads to Forde's Road in one direction and to Skeete’s Road in the other direction or however else the same may abut and bound as shown and delineated on a plan certified on the 4\" day of February, 2011 by Camille Belgrave, Land Surveyor and recorded in the Lands and Surveys Department on the 7 day of February, 2011 as Plan No. 135/2011.\nSECOND SCHEDULE\nCrown situate\nALL THAT land the property of the at Skeete's Road, Bank Hall, in the parish of Saint Michael, in this Island, containing by admeasurement 89.9 square meters or thereabouts (inclusive of 7.8 square meters in road reserve) together with the septic tank, wells, manholes, sewerage pipes and connections thereon Abutting and Bounding on three sides on lands now or late of Fleetwood Waterman and on a road known as Skeete's Road which leads to The Garden Land in one direction and to Bank Hall Cross Road in the other direction or however else the same may abut and bound as shown and delineated on a plan certified on the 4% day of February, 2011 by Camille Belgrave, Land Surveyor and recorded in the Lands and Surveys Department on the 7 day of February, 2011 as Plan No. 136/2011.\nADDENDUM\nOn the 2\"? day of April, 2015, the Cabinet of Barbados agreed to the vesting in the Barbados Water Authority of parcels of land containing by admeasurement 210.8 square meters or thereabouts and 89.9 square meters or thereabouts situate at The Garden Land and at Skeete's Road, Bank Hall respectively, both in the parish of Saint Michael, in this Island.\nThe parcels of land more particularly described in the Schedules hereto were acquired by compulsory acquisition pursuant to section 5 of the Land Acquisition Act, Cap. 228 dated the 3 day of June, 2010 which was published in the Official Gazette on 14% day of May, 2012 as S.I. 2012 No. 29.\nIn accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is now sought for the vesting in the Barbados Water Authority of the parcels of land described in the Schedules to this Resolution for the public purpose of the construction of a pump station and septic tank as part of the Housing and Neighbourhood Upgrading Programme (HNUP).\nLANDS AND SURVEYS DEPARTMENT\nrvey Order No: 4/2011\nrrespondence No: LS 2/11/HNUP\n| i\n|\nQin\nI rip NorTH\nTs Forde's Road\n| ale 3 | ' ~ = 5 : i Z : 'o ” ! 1 - ' re i raul et ied i} a 1 1 Oo Ble Ss 5 2 1 - (LoT ° £:24378.45 ,>? ! N:66871.68 James , nen 1 1 i “ 19715\" f EY oa 45: (026 ) | [:) i Seole 1: 125 61) Hinds Dori (LOT 59) lone . M . Beckles Area (3.8 sq.m.) now occupied by lone Now or Formerly ian Cumberbatch due to 27.4 sq.m. of concrete road consiructed through the property.\nBarbados\nPLAN OF LAND (bordered green, blue and brown)\nSCALE\n1\n:250\nDistances are in metres Bearings ore referred to Grid North derived from DLS Control 12441 & 12442\nat\nLOT 60, THE GARDEN LAND, ST. MICHAEL\n+ denotes computed point\ncontaining Land 162.7 sq.m. (green) Public Drain 20.4 sq.m. (blue) Road 27.7 sq.m. (brown) TOTAL 210.8 sq.m.\n© denotes tron found @ denotes x cut © denotes iron put\nLand tax: 80.01.18.060 For Lands and Surveys Dep! only\nsurveyed for MINISTRY OF HOUSING and LANDS, URBAN and RURAL DEVELOPMENT\nCartified\n2011 Ath February.\nParish of: St. Michael Locality: The Garden\nBeckles of Lot 59,\nbie\n/\nLANDS AND SURVEYS DEPARTMENT\nSurvey Orc . No: 4/2011 Correspondence No: LS 2/11/HNUP\nParish of: St. Michael Locality: Skeetes Road\nJ ™~ \\ 9 S GRID / . Lands of Sth & oO & / Q / ko / Fleetwood oD > uy Fs Waterman | &$ xe g / é 2 Other / Lands of v 2° ! / Lands of I / Fleetwood Fleetwood Waterman f Waterman £:24442.06 N:66996.13\nBarbados\nSCALE 1 :250\nPLAN OF LAND (bordered green and brown)\nSKEETES ROAD, BANK HALL, ST. Land Reserve TOTAL 82.1 sq.m. (green) 7.8 sq.m. (brown) 89.9 sq.m. containing\nat\nMICHAEL\nDistances are in metres Bearings are referred to Grid North derived from DLS Control 72441 & 72442\n© denotes computed: point\n© denotes Iron put unless otherwise stated\n® denotes x cut\nLand tax: part of 70.14.03.005\nsurveyed for MINISTRY OF HOUSING & LANDS URBAN & RURAL DEVELOPMENT\nCertified\n4th February, 2011 thai.\nFor Lands and Surveys Dept only\nad\n"
}