{
  "bill_id": 152,
  "slug": "caribbean-accreditation-authority-education-in-medicine-and-other-health-professionals-incorporation",
  "title": "Caribbean Accreditation Authority (Education in Medicine and Other Health Professionals) (Incorporation)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/8cc2998aded563a1bcc9d1bb73b28530.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-05-03",
  "first_reading": "2016-05-25",
  "second_reading": null,
  "gazette_date": null,
  "passed_date": "2016-05-25",
  "markdown": "2016-03-07\nOBIECTS AND REASONS\nThis Bill would provide for the implementation by Barbados of the Agreement establishing the Caribbean Accreditation Authority lor Education in Medicine and other [Health Professions.\nww\nArrangement of Sections\n1. Short title\n2. ‘Interpretation\n3. Incorporation\n4. Provisions of Agrecment having force of law\n5. Proof of entitlement to immunities and privileges\n6. Financial provisions\n7. Regulations\nSCHEDULE\nAGREEMENT ESTABLISHING THE CARIBBEAN ACCREDITATION AUTHORITY FOR EDUCATION IN MEDICINE AND OTHER HEALTH PROFESSIONS\nBARBADOS\nA Bill entitled\nAn Act to provide for the implementation by Barbados of the Agreement establishing the Caribbean Accreditation Authority for Education in Medicine and other Health Professions.\nENACTED by the Parliament of Barbados as follows:\nShort lille\ni. This Act nowy be cited as the Caribhean Accreditation Authority (Education in Medicine and Other Ucalth Professions) (incorporation) Act, 2016.\nInterpretation\n2. For the purposes of this Act\n“Agreement” means the Agreement establishing the Caribbean Accreditation Authority for Education in Medicine and other Health Professions, the text of which is set out in the Schedule and to which Barbados is a party;\n“Authority” means the Caribbean Accreditation Authority for Education in Medicine and other Health Professions established by Article 2 of the Agreement.\nIncorporation\n3. The Authority is a body corporate to which, subject to the Agreement, section 2! of the Jnterpretation Act, Cap. | applies.\nProvisions of Agreement having force of law\n4. Subject to this Act, Articles 14, 15 and 16 of the Agreement shall have the force of law in Barbados.\nProof of entitlement to immunities and privileges\n5. Where in any proceedings a question arises as to whether the Authority or any other person is entitled to any immunity or privilege granted by this Act, a certificate issued by or under the authority of the Minister responsible for Foreign Affairs containing a statement that the Authority or that other person is or is not so entitled is conclusive evidence of the fact certified.\n\nFinancial provisions\n6.41) All payments required (o be made by fhe Government to the Authority in respect of the obligations of Barbados under the Agreement are charged on and are payable out of the Consolidated Fund.\n(2) All sums reecived by the Government from the Authority under the Agreement shall be paid into the Consolidated Fund.\nRegulations\ntc The Minister may make regulations for giving effect to the provisions of this Act.\nb\nSCUEDULE\n(Section 2)\nAGREEMENT ESTABLISHING THL CARIBBEAN ACCREDITATION AUTHOREPY FOR EDUCATION IN MEDICINE AND OTHER HBALTIt PROFESSIONS\nTHE CONTRACTING PARTIES\nRecalling the provisions of the Revised Trealy of Chaguaramas establishing the Caribbean Community, including the CARICOM Single Markel and Economy signed at Nassau, The Bahiwnas, on 5 July, 2001;\nConceraed (hat international trends in the acereditation of training programmes in certain fields, in particular, the regional accreditation initiatives of the European Union will have implications for the traditional methods of accrediting medical programmes offered by institutions in the Caribbean Communily:\nAcknowledging the absence of a regional system of accreditation for training programmes in the Caribbean Community in medicine and other health professions:\nRecognizing thal the establishment of such a system is essential within the Caribbean Community and that such a system must be internationally recognized:\nConscious that the primary focus of accreditation and quality assurance initiatives tn the Caribbean Community must be on the delivery of programmes of study aimed at achieving recognized, pre-determined quality standards, by Universities and like institutions tn the Caribbean Community engaged in providing training in medicine and other health professions:\nAware of the critical importance of international comparability of programmes of study accredited by a body established within the Caribbean Community:\nDetermined to establish in the Caribbean Community a regional mechanism for the accreditation of training programmes in medicine and other health professions:\nHaye agreed as follows:\n?\nARTICELE 1\nUSE OF TERMS\nI. In this Agreement, untess the context ofherwise requires:\n“accredit” means the according of recognition by the Authority, on the basis of an informed evaluation, thal the programmes of study offered by an institution and any awatd it confers, salisly standards prescribed or approved by the Authority; and “reaccredit™, “accreditation” and other cognate expressions shat] be construed accordingly;\n“Associate Member” means a state or territory that is admittcd (o associate membership of the Community under Article 231 of the Revised Treaty of Chaguaramas signed at Nassau, The Bahamas, on 5 July, 2001;\n“Authority” means the Authority established by Article 2;\n“award” means a degree, diploma, certificate or other evidence that prescribed programmes of study in medicine and other health professions have been completed successfully;\n“Contracting Party” means a Member State or an Associate Member State of the Community for which this Agreement is in force;\n“Community” means the Caribbean Community, including the CARICOM Single Market and Economy established by the Revised Treaty of Chaguaramas signed at Nassau, The Bahamas, on 5 July, 2001;\n“Executive Director” means the Executive Director appointed by Article 11;\n“medicine” includes dental medicine and veterinary medicine;\n“other health professions” means any health profession other than medicine\nspecified by the Authority pursuant to paragraph 4 of Article 9,\n“quality assurance” means a system or process of ensuring that awards granted or programmes of study offered in medicine and other health professions by\n§\nUniversities or like institutions satis{y standards prescribed or acecpted by the Authority;\n“Sceretariat” means the Secretariat established by the Authority by Article 10:\n“Secretary-Gencral” means the Sceretary-General of the Community;\n“standard” means a clearly defined level of academic achievement employed as a measurement of the quality of education,\n2. Vor the purposes of this Agreement any reference in the following Articles to the Community shall include a reference to an Associate Member.\nARTICLE 2\nESTABLISHMENT OF THE AUTHORITY\n1. There is hereby established the Caribbean Accreditation Authority for Education in Medicine and other Health Professions having the objectives, powers and functions set out in this Agreement.\n2. The Headquarters of the Authority shall be located ina Member State of the Community to be determined by the Contracting Parties.\nARTICLE 3\nOBJECTIVES OF THE AUTHORITY\nThe Authority shall have the following objectives:\n(a) the achievement and maintenance of standards of excellence in programmes of study in medicine and other health professions offered by institutions in the Community;\nA & >\nD)\n(fh) the establishment ol an efficient system of regulation in relation to the standards and quality of programmes of study in medicine and other health professions;\n(c) the securing, of international recognition of the programmes of study in medicine and other health professions;\n(d) maintaining the confidence of the peoples of the region in the quality of training offered in the Community in medicine and other health professions.\nARTICLE 4\nCOMPOSITION OF THE AUTHORITY\nL. Subject to this Article and to Article 5, the Authority shall consist of the following members:\n(a) three (3) persons nominated jointly by academic institutions in the Community offering training in medicine (other than dental medicine and veterinary medicine);\n(b) one (1) person nominated jointly by academic institutions in the Community offering training in dental medicine;\n(c) one (1) person nominated jointly by academic institutions in the Community offering training in veterinary medicine;\n(d) two (2) persons nominated Jointly by regional organizations representing civil society;\n(¢) two (2) students enrolled in training programmes in medicine at academic institutions in the Community and nominated by the institutions; :\n10\n(f) two (2) persons from outside the region who have expertise in the accreditation of training, programmes in medicine or other health professions;\n(a) one (1) person representing the Caribbean Association of Medical Councils (CAMC);\n(h) three (3) persons, cach appointed by a Contracting Party selected by the Secretary-Gencrat on a rotational basis;\n(@) the Executive Director, who shall be an ev-officto member.\n2. Persons referred to in sub-paragraphs (a), (b), (c), (d) and (gz) of paragraph { and sub-paragraph (a) of paragraph 6 shall be appointed for a term of three years and shail be eligible for re-appointment for a further term of three years. No such persons may be appointed for more than six consecutive years.\n3. Persons referred to in sub-paragraph (c) of paragraph 1 and sub- paragraph (b) of paragraph 6 shall be appointed for a term of one year and shall be eligible for re-appointment for another one-year tcrm. No such persons may be appointed for more than two consccutive years.\n4. Persons referred to in sub-paragraph () of paragraph | shall be appointed for a single term not exceeding three years.\n5. Persons referred to in sub-paragraph (h) of paragraph | shall be appointed for a term of three years.\n6. Where under paragraph 4 of Article 9, the Authority specifies which professions are to be treated as other health professions, membership of the Authority shall be extended to include —\n(a) two (2) persons nominated jointly by academic institutions offering training in other health professions in the Community;\n11\nh) two (2) students enrolled in training programmes in other health & prog! professions in institutions in the Community nominated jointly by those institudions.\nie Where the institutions fail, within the time specified in the request, to haminale any person under this Article, the Secretary-General may designate such person\n8. Where a member is unable to act or resigns, the competent institutions shall nominate another person to act in the place of that member.\n9. A member may resign by transmitling a written notice in that behalf to the Chairman, In the case of the Chairman, such notice should be transmitted (vu the Vice-Chairman.\nARTICLE 5\nCRITERIA FOR MEMBERSHIP OF THE AUTHORITY\n1. The members nominated pursuant to paragraph 1 (a) of Article 4 shall currently hold, or have held, a faculty appointment at an academic institution ceferred to in that paragraph or otherwise have knowledge and experience in the process of accrediting programmes of study in medicine.\n2. The members nominated pursuant to paragraph 1 (b) or (c) of Article 4 shall hold the appropriate academic qualifications, and be actively engaged in or have recent experience in the practice of their discipline.\n3. The members nominated pursuant to paragraph 1 (d) of Article 4 shall, by virtue of education, experience and public service, possess qualifications © which enable them to provide a public perspective in evaluating programmes of stucly in medicine or other health professions.\n[2\n4, The members nominated pursuant to paragraph | (c) of Article 4 should normally be in their penullimate year of (ining, be in good academic standing, and should be students drawn from among ivsttations in the Community.\n5. The members nominated pursuant Co paragraph 6 (a) of Article 4 shall currently hold, or have held, a faculty appointment al an academic institution referred to in that paragraph or otherwise have knowledge and experience in the process of accrediting programmes of study in other health professions.\n6. The members nominated pursuant to paragraph 6 (b) of Article 4 should normally be in their penultimate year of training, be in good academic standing and should be students drawn (rom among institutions in’ the Community.\n1b Subject to Article 25, the Secretariat shall be responsible for soliciting nominations for membership.\nARTICLE 6\nCHAIRMAN AND VICE-CHAIRMAN\n1. Atits first meeting, and as required thereafter, the Authority shail elect a Chairman and Vice-Chairman, from among its members referred fo in paragraph 1(a), (b), (c), (d), and (g) and paragraph 6 (a) of Article 4.\n2. The Chairman and Vice-Chairman shall each hold office for three years and shall be eligible for re-election.\n3. The Chairman may resign from the office of Chairman by notice in writing addressed to the Vice-Chairman and the resignation shall take effect on the date of receipt of the notice,\n\n13\n4. The Vice-Chairman may resign fron that position by notice in writing addressed (o the Chairman and the resignation shall lake effect on the date of receipt of the notice by the Chairman.\n§. The Chairman shall preside at all meetings of the Authority and in the event of the Chairman’s absence the Vice-Chairman shall preside.\n6. If both the Chairman and the Vice-Chairman are absent from a meeting, the members present shall elect one of the members qualified under paragraph | to act as Chairman or Vice-Chairman at the meeting,\nARTICLE 7\nPROCEDURES OF THE AUTHORITY\nbE. The Authority shall meet in ordinary session at Icast once in every year and in special session as often as circumstances may require. Special sessions of the Authority shall be convened upon the written request of two-thirds of the members in that behalf.\n2. Decisions of the Authority shall be made by a two-thirds majority of the members of the Authority who are eligible to vote. A simple majority of such members of the Authority shall constitute a quorum.\n3. Where circumstances warrant, the Authority may make decisions without meeting in formal session.\n4, Minutes of the proceedings of the Authority shall be kept in proper form.\n5. Subject to this Agreement, the Authority shall establish its rules of procedure.\n[4\nARTICLALS\nTHEE SHAT. OF THE AUTHORITY\nI. The Authority shall have and use as occasion may require a Seal having a device or inpression with the inscription “Caribbean Accreditation Authority for Education ia Medicine and Other I ealth Professions”.\n2. The Seal of the Authority shall be kept in the custody of the Exccutive Director and shall be affixed to documents pursuant to a resolution of the Authority in the presence of the Chairman and any other member of the Authority and the Executive Director.\n3. The Seal shall be authenticated by the signatures of the Chairman or any other member authorised to act in that behalf.\nARTICLE 9\nPOWERS AND FUNCTIONS OF THE AUTHORITY\n1. The Authority shall perform such functions as may be required for the achievement of the objectives set out in Article 3.\n2. Without prejudice to the provisions of paragraph |, the Authority shall inter alia\n(a) determine and prescribe standards, criteria and systems for the accreditation of programmes of study in the Community in medicine and other health professions;\n(b) select suitable persons as assessors and appoint panels of assessors;\n(c) accredit, on the basis of the reports of the assessors, programmes of study in medicine and other health professions;\n\n15\n(d) facilitate the development of an accreditation and qualily assurance ethos in the Community;\n(c) collaborate with professional bodies (o develop (raining programmes designed to create a regional cadre of rained assessors;\n7) establish rules, guidelines and procedures in’ relation (othe accreditation of programmes in medicine and other health professtons;\n(g) approve arrangements and systems for accrediting programmes of study in medicine and other health professions;\n(h) withdraw or modify, as appropriate, aceredilation granted to any programme;\n(i) establish and maintain relations with bodies outside the Community having functions in relation to accreditation and qualily assurance,\n@) determine the basis and procedures for the removal of a member,\n(k} approve the budget of the Authority;\n) approve the staff regulations and financial regulations of the Authority;\n(m) appoint an auditor;\n(n) determine the fees payable by institutions in connection with the accreditation of their programmes;\n(0) do all such other acts and things as may be required for the achievement of the objectives of the Authority.\nThe Authority may —\n(a) establish committees of the Authority and invite persons to serve on such committees;\n(b) delegate to such committees, the functions of the Authority specified in the instrument of delegation, provided that a person invited pursuant to sub-paragraph (a) shall not be deemed to be a member of the Authority.\n16\n4, ‘The Authority shall specify the professions which are to be treated as other health professions for the purposes of this Agreement. The Executive Director shall notify (he Contracting Parties of such decisions of the Authority.\nARTICLE 10\nTHE SECRETARIAT\ni The Authority shall establish a Secretariat which shall be responsible for the gencral administration of the affairs of the Authority.\n2. The Secretariat shall comprise an Executive Director and such professional, administrative and other staff as may be required to carry out its functions.\n3. The appointment of the Executive Director and professional, administrative and other staff shall be subject to such terms and conditions as the Authority shall determine.\n4. In addition to any functions which may be assigned to it by the Authority, the Secretariat shall inter alia:\n(a) conduct research on accreditation and quality assurance so as to inform the work of the Authority;\n(b) manage the accreditation cycle for programmes subject to the Authority’s accreditation process;\n(c) communicate with and provide guidance and advice to institutions that are engaged in or propose to be engaged in the Authority’s accreditation process;\n(d) undertake or arrange for the training of persons as assessors of programmes;\n\n17\n(c) provide information on the work of the Authority to the Contracting Parties, institutions providing training in medicine and ather health professions and to members of the public:\n) maintain a record of all activities;\n(x) prepare an annual report of the Authority's work:\n(h) maintain, on behalf of the Authority, contacts with bodies outside of the Community having functions in relation to accreditation and qualily assurance;\n(i) prepare the draft budget of the Authority and submit it for the consideration and approval of the Authority;\n@) prepare and submit for the consideration and approval of the Authority, the staff regulations and financial regulations of the Authority;\n(k) prepare an annual Work Programme and present it lo the Authority for approval;\n2) service meclings of the Authority and any commiltec thercof.\nARTICLE 11\nEXECUTIVE DIRECTOR\nThe Executive Director shall be appointed by the Authority for a term of three (3) years, on such other terms and conditions as may be specified in the instrument of appointment, and shall be eligible for re-appointment.\nThe Executive Director shall attend and participate in all meetings of the Authority but shall have no right to vote on any matter before the Authority.\n18\n3 The Executive Director shall be responsible for the day-to-day management and operations of the Scerctariat and without limiting the generality of the forepoing\n(a) shall ensure the efficient use and management of the resources of the Authority;\n(h) shall make recommendations for an in rclation to the achievement of the objectives set out in Article 3;\n() shall implement the directives of the Authority;\n(d) may cnter into contracts and sign instruments and documents on behalf’ of the Authority;\n(ce) shall carry out such other duties as may be assigned by the Authority.\nThe Executive Director shall appoint such staff as may be required for the operations of the Secretariat.\nARTICLE 12\nFINANCIAL PROVISIONS\nThe funds of the Authority shall comprise:\n(a) annual contributions from the Contracting Parties;\n(b) grant funds received from donor agencies;\n(¢) income derived from earnings for services provided by the Authority;\n@ fees from institutions whose programmes are accredited by the Authority; :\nmonies received from any other source of funding.\n19\n2. The dealt budget prepared by the Sceretariat shall be presented to the Authority for approval (with or wifhoul modifications).\n3. Upon approval of the draft budget, the Authority shall submit to the Council for Human and Social Development (an organ of the Community so named in paragraph 2 of Article 10 of the Treaty) for approval,\n4. The Executive Director shall cause proper accounts of the Authority to be kept and such accounts shall be audited by an auditor appointed by the Authority under Article 9.\n5. The Authority shall, within thirty (30) days of the receipt of the report of the auditor and the audited accounts of the Authority, transmit copics of the report and audited accounts to the Contracting Parties and the Council for Human and Social Development.\nARTICLE 13\nPROVISIONAL BUDGETARY MEASURES\nThe Authority is empowered to commit provisionally and pending approval of the budget, expenditure not exceeding one-fifth (1/5) of the regular Budget of the previous year.\nARTICLE 14\nEXEMPTION FROM TAXATION\n1. The income of the Authority shall be exempt from income tax.\n20\nis The Authority shall be exempt from property tax and stamp duty in respeet of instruments exccuted by or on its behalf.\n3. The Authority shall be excmpt fiom customs duties and taxes on goods imported, purchased or taken out of bond and used for the execution of ils functions.\nARTICLE 15\nLEGAL STATUS OF THE AUTHORITY\nL. The Authority shall possess full legal capacity and in particular full capacity —\n(a) to contract;\n(b) to acquire and dispose of movable and immovable property;\n(c) to institute and defend legal proceedings.\n2. The Authority may cnter into agreements with any entity for the achievement of its objectives.\n3. The Authority shall conclude with the Contracting Party in which the Headquarters is to be located, an agreement relating to the privileges and immunities to be granted or accorded to the Authority.\n4, In any legal proceedings the Authority shall be represented by the Executive Director,\n3)\n21\nARTICLE 16\nPROTECTION FROM LEGAL PROCESS\nNo action, suit or other proceeding shall be instituted against any member of the Authority or any member of the staff of the Secretariat for any acls done bona fide in the execution of their functions under this Agreement.\nARTICLE 17\nSIGNATURE\nThis Agreement shall be open for signature by any Member State or Associate Member of the Community.\nARTICLE 18\nENTRY INTO FORCE\nThis Agreement shall enter into force on the signature by all Member States of the Communily.\nARTICLE 19\nPROVISIONAL APPLICATION\nThis Agreement may be provisionally applied on signature by not less than four Member States of the Community.\n7\na\nARTICLE 20\nDEPOSTTARY\nThis Agreement shall be deposited with the Sceretary-Cieneral (hereinafter called “the Depositary™. The Depositary shall transmit copies of this Agreement to cach Contracting Party.\nARTICLE 21\nACCESSION\nt. After its entry into force any Member State or Associate Member of the Community may accede to this Agreement.\n2. Instruments of Accession shall be deposited with the Depositary.\nARTICLE 22\nAMENDMENT\n1. A proposal for the amendment of this Agreement shall be transmitted by the Chairman of the Authority to each Contracting Party within 30 days of the date of the proposal.\n2. The amendment shall have effect upon the acceptance thereof by the Contracting Parties.\n23\nARTICLE 23\nWITHDRAWAL\ni. A Contracting Party may withdraw from this Agreement by giving twelve months’ notice in wriling fo the Depositary who shall promptly notily the other Contracting Parties accordingly and the withdrawal shall take cffect one year after the date on which the notice has been received by the Depositary, untess the Contracting, Party, before the withdrawal becomes effective, notifies the Depositary in writing of the cancellation of its notice of withdrawal.\n2. A Contracting Party that withdraws from this Agreement undertakes to honour financial or other obligations duly assumed as a Contracting Party.\nARTICLE 24\nIMPLEMENTATION\nThe Contracting Parties shall take all necessary action, whether of a legislative, executive or administrative nature, for the purpose of giving effect to this Agreement. Such action shall be taken as expeditiously as possible, and the Executive Director shall be informed accordingly.\nARTICLE 25\nINAUGURAL MEETING\nUpon the provisional application of this Agreement, the Secretary- General shall take the necessary steps to secure the nomination of the members of the Authority referred to in Article 4 and to convene the Inaugural Meeting of the Authority.\n24\nIN WETNESS WHEREOR the undersigned duly\nauthorized in that behalf by their respective Governments have exceuted this Agreement,\nDONE al Castries, Saint Lucia on the 13\" day of\nNovember, 2003.\nSigned by Lester Bird\nfor the Government of Antigua and Barbuda on the 13!\" day of November, 2003 at Castries, Saint Lucia\nSigned by P.G. Christie\nfor the Government of The Bahamas on the 25\" day of March, 2004 at Basseterre, St. Kilts & Nevis,\nSigned by O.S, Arthur\nfor the Government of Barbados on the 15\" day of December, 2005 at Bridgetown, Barbados.\nSigned by Said Musa\nfor the Government of Belize on the (3 day of November, 2003 at Castries, Saint Lucia\nSigned by for the Government of the Commonwealth of Dominica on the day of\n2003\nat\nSigned by Keith Mitchel!\nfor the Government of Grenada on the 4\" day of July, 2004 at St. George’s, Grenada.\nSigned by B. Jagdeo\nfor the Government of the Co-operative Republic of Guyana on the 16\" day of January, 2007 at Georgetown, Guyana.\nSigned by for the Government of the Republic of Haiti onthe day of\n2003\nat\n\nD4 Signed by 2. Pallersan for the Gavernment of damaien on the 13\" day of November, 2003 al Casinies, Saint Lucia. Signed by for the Government of Montserrat an the day of 2003 at Signed by Denzil L. Douglas for the Government of St. ills and Nevis on the 10\" day of February, 2006 at Porl-al-Spain, Trinidad. Signed by for (he Government of Saint Lucia onthe day al 2003 al Signed by for the Government of SL Vincent and the Grenadines onthe day of 2003 al Signed by R. Vencliaan for the Government of the Republic of Suriname on the 13\" day of November, 2003 at Castries, Saint Lucia. Signed by Patrick Manning for the Government of the Republic of Trinidad and ‘Tobago on the 13\" day of November,\nfor the Government of the Republic of Trinidad and ‘Tobago on the 13\" day of November, 2003 at Castries, Saint Lucia.\n26\nRead three times and passed the House of Assembly this day of » 2046.\nSpeaker\nRead three times and passed the Senate this , 2016.\nPresident\nday of\n\n"
}