{
  "bill_id": 157,
  "slug": "magistrates-courts-amendment-bill-2016",
  "title": "Magistrate's Courts (Amendment) Bill, 2016",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/8a4c85390da5f4b648012d82d96a3c32.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-07-13",
  "first_reading": "2016-07-27",
  "second_reading": "2016-07-12",
  "gazette_date": "2016-06-27",
  "passed_date": "2016-07-27",
  "markdown": "Explanatory Memorandum After Page 26\n\n2016-03-16\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Magistrate’s Courts Act, Cap. 116A to\n\n(a)\n\nmake  better  provision  for  committal  proceedings  under  the  Act  by\nrequiring the general use of written statements rather than the general\nuse of oral evidence and depositions; and\n\n(b)\n\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 116A\n\nAmendment of section 17 of Cap. 116A\n\nInsertion of section 17A into Cap. 116A\n\nInsertion of sections 18A, 18B, 18C, 18D, 18E, 18F, and 18G into Cap.\n116A\n\nAmendment of section 19 of Cap. 116A\n\nAmendment of section 20 of Cap. 116A\n\nAmendment of section 21 of Cap. 116A\n\nAmendment of section 23 of Cap. 116A\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nAmendment of section 30 of Cap. 116A\n\n11.\n\nAmendment of section 55 of Cap. 116A\n\n12.\n\nRepeal of section 132 of Cap. 116A\n\n13.\n\nAmendment of section 136 of Cap. 116A\n\n14.\n\nTransitional Provision\n\n\f3\n\n15.\n\nAmendment of the enactments in the Schedule\n\n16.\n\nCommencement\n\nSCHEDULE\n\nEnactments to be Amended\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Magistrate’s Courts Act.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2016.\n\nThis Act may be cited as the Magistrate’s Courts (Amendment) Act,\n\n\f6\n\nAmendment of section 2 of Cap. 116A\n\n2.\nAct, is amended by\n\nThe Magistrate’s Court Act, in this Act referred to as the principal\n\n(a)\n\ndeleting the definition of “committal proceedings” and substituting\nthe following definition:\n\n“  “committal  proceedings”  means  proceedings  held  before  an\nexamining magistrate to consider whether a prima facie case has\nbeen  established  for  the  committal  of  a  person  accused  of  an\nindictable  offence  for  the  trial  of  that  offence  by  the  High\nCourt;”; and\n\n(b)\n\ninserting  the  following  definitions  in  the  appropriate  alphabetical\norder:\n\n“ “accused” or “accused person” means a person who has been accused,\narrested and brought before a magistrate or person who has been\ncharged with an offence;\n\n“examining magistrate” means a magistrate assigned to preside over\n\ncommittal proceedings under this Act; and\n\n“Registrar” has the meaning assigned to it by section 2 of the Supreme\n\nCourt of Judicature Act, Cap. 117A;”.\n\nAmendment of section 17 of Cap. 116A\n\n3.\nthe following:\n\nThe principal Act is amended by deleting section 17 and substituting\n\n\f7\n\n“General nature of committal proceedings\n\n17.(1)\nAn  examining  magistrate  shall  sit  in  open  court  while\npresiding  over  committal  proceedings,  to  consider  whether  a  prima\nfacie case has been established for the committal of a person accused\nof an indictable offence for the trial of that offence by the High Court,\nexcept where\n\n(a)\n\n(b)\n\nan enactment contains an express provision to the contrary;\nor\n\nit appears to him that in respect of the whole or any part of\nthe committal proceedings that the ends of justice would not\nbe served by his sitting in open court.\n\nCommittal  proceedings  and  any  determination  made\n\nin\n(2)\ncommittal proceedings by an examining magistrate shall be given in\nthe presence of the accused person, but the examining magistrate may\nallow  the  committal  proceedings  to  proceed  or  be  completed  in  the\nabsence of the accused person if\n\n(a)\n\n(b)\n\n(c)\n\nhe considers that by reason of the disorderly conduct of the\naccused  person  before  him  it  is  not  practicable  for  the\nevidence to be given in the presence of that accused person;\n\nhe considers it necessary for the purposes of receiving oral\nevidence in a matter to which section 133 applies; or\n\nthe accused person cannot be present for reasons of health,\nbut is represented by an attorney-at-law and has consented in\nwriting to the evidence being given in his absence.\n\n(3)\n\nIn this Part,\n\n“High Court” means the Criminal Division of the High Court.”.\n\n\f8\n\nInsertion of section 17A into Cap. 116A\n\n4.\nafter section 17:\n\nThe principal Act is amended by inserting the following new section\n\n“Submission of evidence in committal proceedings\n\n17A.(1)\nSubject  to  section  18B,  for  the  purposes  of  committal\nproceedings, evidence with or without exhibits, before an examining\nmagistrate  shall  consist  of  written  statements,  whether  for  the\nprosecution  or  the  defence,  and  these  written  statements  shall  be\nadmissible as evidence in the same manner as oral evidence given by a\nperson where the written statement\n\n(a)\n\nis prepared from a statement which was recorded, whether in\nwriting or by electronic means, by a senior member of the\nRoyal Barbados Police Force not below the rank of Sergeant\nor an attorney-at-law;\n\n(b)\n\npurports to be signed by the person who made it;\n\n(c)\n\n(d)\n\ncontains a declaration or statement by the person who made\nit, stating that the written statement is true to the best of his\nknowledge and belief; and\n\ncontains a declaration by the person who made it stating that\nhe  made  the  written  statement  knowing  that,  if  it  were\ntendered in evidence, he would be liable to prosecution if he\nwilfully stated in it anything which he knew to be false or did\nnot believe to be true.\n\n(2)\n\nWhere a written statement to which subsection (1) applies\n\n(a)\n\nis made by a person under the age of 18, it shall state or give\nthe age of that person;\n\n\f9\n\n(b)\n\n(c)\n\n(d)\n\nis made by the accused person, it shall contain a declaration\nor  statement  stating  that  he  made  the  written  statement\nknowing that, if it were tendered in evidence, he may be liable\nto be committed for prosecution by the High Court;\n\nis made by a person who cannot read, it shall be read to him\nbefore  he  signs  it,  and  that  written  statement  shall  be\naccompanied  by  a  declaration  by  the  person  who  read  the\nwritten  statement,  and  that  declaration  shall  state  that  the\nwritten  statement  was  read  to  the  person  who  made  the\nwritten statement; or\n\nmakes reference to any other document as an exhibit, the copy\nof the written statement given to the examining magistrate or\nto any other party to the proceedings under subsection (3),\nmust be accompanied by a copy of that document or by such\ninformation as may be necessary in order to enable the party\nto whom it is given to inspect that document or a copy thereof.\n\nBefore a written statement tendered in evidence in accordance\n(3)\nwith  subsection  (1)  is  used  in  committal  proceedings,  an  examining\nmagistrate shall ensure that\n\n(a)\n\na copy of the written statement is given, by or on behalf of\nthe party proposing to tender it, to each of the other parties\nto the committal proceedings; and\n\n(b)\n\nnone of the other parties object to the written statement being\ntendered in evidence under this section.\n\nAny document or object referred to as an exhibit and identified\n(4)\nin a written statement tendered in evidence under this section shall be\ntreated as if it had been produced as an exhibit and identified in court\nby the maker of the written statement.\n\nNotwithstanding  subsection  (1),  nothing  shall  prevent  the\n(5)\naccused person or his attorney-at-law from making a submission to the\n\n\f10\n\nexamining magistrate that the evidence is not sufficient to commit the\naccused person to the High Court for the trial of the alleged indictable\noffence, and if any such submission is made, the same shall be taken\ninto  consideration  by  the  examining  magistrate  for  the  purposes  of\nsection 19, and where a person is not represented by an attorney-at-law\nthe examining magistrate shall inform the accused of his right under\nthis subsection.\n\nFor  the  purposes  of  this  Part,  section  25  of  the  Criminal\n(6)\nProcedure Act, Cap. 127 applies to any written statement tendered in\nevidence in committal proceedings, as it applies to a deposition taken\nin such proceedings, but in its application to any such written statement\nthat section has effect as if the words “and where it is also proved that\nsuch a deposition was taken in the presence of the person so accused\nand  that  he  or  his  attorney-at-law  had  a  full  opportunity  of  cross-\nexamining the witness, then if such a deposition purports to be signed\nby the magistrate by or before whom the same purports to have been\ntaken” were omitted therefrom.\n\nFor  the  purposes  of  this  Part,  section  4(3)  of  the  Criminal\n(7)\nProcedure Act, Cap. 127 applies to the facts disclosed in any written\nstatement as it would apply to facts disclosed in a deposition.\n\nA person whose written statement is tendered in evidence under\n(8)\nthis section shall be treated for the purposes of section 30 as a witness\nwho has been examined by the examining magistrate.”.\n\nInsertion of sections 18A, 18B, 18C, 18D, 18E, 18F, and 18G into Cap.\n116A\n\n5.\nafter section 18:\n\nThe principal Act is amended by inserting the following new sections\n\n\f11\n\n“Oral evidence from persons other than the accused\n\n18A.(1)\n\nNotwithstanding section 17A, an examining magistrate may\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nafter considering the written statements;\n\non application by the accused person;\n\non  application  by  any  other  party  to  the  committal\nproceedings; or\n\nupon  hearing  a  submission  by  the  accused  made  in\naccordance with section 18B or otherwise\n\nauthorise  or  require  the  giving  or  taking  of  oral  evidence  at  the\ncommittal proceedings from any person other than the accused, whether\nor  not  a  written  statement  from  that  person  has  been  tendered  in\nevidence,  if  he  is  satisfied  that  oral  evidence  from  that  person  is\nnecessary in the circumstances of the case in order for a determination\nto be made for the purposes of section 19.\n\nWhere  any  person,  other  than  the  accused  person,  gives  oral\n(2)\nevidence in committal proceedings before an examining magistrate that\noral evidence, given under oath, may be subject to cross-examination.\n\nOral evidence given under this section shall be recorded, whether\n(3)\nin writing or by electronic means, and the deposition prepared from the\noral evidence shall be read over to the person giving the oral evidence\nand signed by him and signed by the examining magistrate.\n\nWhere the accused is not represented by an attorney-at-law, the\n(4)\nexamining  magistrate  shall  inform  the  accused  of  his  right  under\nsubsection (1).\n\nWhere an application is made under subsection (1) by a party\n(5)\nother  than  the  accused,  and  the  accused  is  not  represented  by  an\nattorney-at-law  or  the  circumstances  of  the  committal  proceedings\nmake  it  necessary,  before  making  a  determination  to  authorise  the\n\n\f12\n\ntaking  of  oral  evidence  pursuant  to  subsection  (1),  the  examining\nmagistrate  shall  inform  the  accused  of  his  right  to  also  make  a\nsubmission under subsection (1) and of the benefits of making such an\napplication.\n\nWhere an examining magistrate pursuant to subsection (1), needs\n(6)\nto hear oral evidence from any person he may issue a summons or a\nwarrant, as the case may be, to cause that person to attend before him\nto give oral evidence in the committal proceedings.\n\nEvidence of the Accused\n\n18B.(1)\n\nAn accused person may at his option\n\n(a)\n\n(b)\n\n(c)\n\ntender in evidence his own written statement;\n\nelect to make an unsworn statement;\n\ngive oral evidence; or\n\n(d)\n\nremain silent.\n\nWhere an accused person elects to give oral evidence pursuant\n(2)\nto subsection (1) the examining magistrate shall, before taking that oral\nevidence, caution the accused person in the words set out in rule 22(2)\nof  the  Magistrate’s  Courts  (Criminal  Procedure)  Rules,  2001\n(S.I. 2001 No. 98) or with words of like effect.\n\nOral evidence given by the accused person pursuant to subsection\n\n(3)\n(1) shall be\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nrecorded, whether in writing or by electronic means;\n\nread over to the accused person;\n\nsigned by the accused person and signed by the examining\nmagistrate;\n\nkept with the written statements, or depositions, if any, of the\nwitnesses; and\n\n\f13\n\n(e)\n\ntransmitted in accordance with section 23 to the Director of\nPublic Prosecutions,\n\nand may, upon the trial of the accused person, be admitted in evidence\nwithout further proof thereof.\n\nWhere the accused person elects not to give oral evidence or not\n(4)\nto  tender  a  written  statement  he  or  his  attorney-at-law  shall,  at  the\ncommencement of the proceedings, notify the examining magistrate,\nthe  prosecution  and  any  other  party  to  the  committal  proceedings,\nwhether in writing or otherwise, of this election.\n\nCopies of statements to be served on other parties to the\ncommittal proceedings\n\nFor the purposes of committal proceedings, the prosecution\n18C.(1)\nshall  make  available  to  all  other  parties  to  a  committal  proceedings\ncopies  of  the  written  statements  or  any  other  documents  which  are\nintended for consideration at the committal proceedings for the offence.\n\nFor the purposes of committal proceedings, the accused person\n(2)\nmay  make  available  to  the  prosecution  or  to  any  other  party  to  a\ncommittal proceedings such written statements or other documents as\nthe accused person intends to use for consideration at the committal\nproceedings for the offence.\n\nSubject to subsection (4), written statements or other documents\n(3)\nreferred to in subsection (1) or (2) shall be served on a party referred to\nin subsections (1) or (2) not less than 7 clear days before the sitting of\nthe  examining  magistrate  at  the  committal  proceedings,  or  any\nadjournment thereof, for which those written statements or documents\nare to be considered.\n\n\f14\n\n(4)\n\nAn examining magistrate may\n\n(a)\n\n(b)\n\nin  his  discretion,  as  regards  any  written  statement  or\ndocument to be considered in committal proceedings, vary\nthe time stated or given by subsection (3); or\n\non the application of any party to the committal proceedings,\nwhere he is satisfied that the party making the application has\nnot had adequate time to consider the written statements or\ndocuments,  adjourn  the  committal  proceedings  for  such  a\nperiod  of\nthe\ncircumstances.\n\ntime  as  he  considers  appropriate\n\nin\n\nSigning of statements by examining magistrate\n\n18D.\nproceedings shall sign\n\nThe  examining  magistrate  presiding  over  committal\n\n(a)\n\nevery written statement tendered to the court or deposition\nmade by the court; and\n\n(b)\n\nevery document tendered as an exhibit.\n\nWitness Statements and the trial of the accused\n\n18E.(1)\nAt the trial of an accused person, pursuant to any committal\nproceedings, and subject to section 17A, a written statement by any\nperson is admissible as evidence to the like extent as oral evidence or\na deposition made by the person for the purposes of a trial or otherwise.\n\nAt the trial of an accused person, if the court is satisfied that any\n(2)\nperson whose written statement has been admitted in evidence or whose\ndeposition has been taken in the committal proceedings\n\n(a)\n\n(b)\n\nis dead;\n\nis unfit, by reason of his bodily or mental condition, to attend\ntrial;\n\n\f15\n\n(c)\n\n(d)\n\nis outside of Barbados and it is not reasonably practicable to\nsecure his attendance;\n\ncannot be found after all reasonable steps have been taken to\nfind him; or\n\n(e)\n\nis kept way from the trial by threat of bodily harm or death\n\nthen  the  written  statement  or  deposition  signed,  or  purported  to  be\nsigned, by the examining magistrate who presided over the committal\nproceedings, and any documentary exhibit relevant thereto, as the case\nmay be, shall unless the court determines otherwise, be admissible at\nthe trial as evidence of any fact without further proof that it was in fact\nsigned by the examining magistrate purporting to have signed it.\n\nWarning in respect of an alibi\n\nWhere the examination of the witnesses called on behalf of\n18F.(1)\nthe prosecution has been completed, and before any presentation by the\naccused  person,  where  he  so  elects,  the  examining  magistrate  shall\naddress the accused person in the words set out in rule 22(4) of the\nMagistrates’  Courts\n2001\n(S.I. 2001 No. 98) or with words of like effect.\n\n(Criminal  Procedure)  Rules,\n\nThe  examining  magistrate  shall  not  be  required  to  give  the\n(2)\nwarning in subsection (1) in any case where it appears to him, having\nregard to the nature of the offence with which the accused person is\ncharged, that it is unnecessary to do so.\n\nWhere the examining magistrate has given the accused person\n(3)\nthe warning required by subsection (1), the examining magistrate shall\nexplain  the  provisions  of  section  18G  to  the  accused  and  where  the\naccused person seeks leave to file the notice of the defence of an alibi\nin accordance with section 18G, the examining magistrate shall ensure\nthat the accused person understands the meaning of the terms “7 clear\ndays” and “alibi”, as well as the provisions of section 18G(2).\n\n\f16\n\nNotice of the Defence of an Alibi\n\n18G.(1)\nAn  accused  person  who  intends  to  proffer  an  alibi  as  his\ndefence at the trial of the offence shall give notice of the defence of an\nalibi  at  the  committal  proceedings  for  that  offence,  and  where  the\naccused person does not give notice of the defence of an alibi he shall\nnot be permitted to raise that defence at the trial for that offence.\n\nA notice of the defence of an alibi referred to in subsection (1)\n\n(2)\nshall include:\n\n(a)\n\n(b)\n\nthe name and address of the witness, or, if the name or address\nis not known to the accused at the time he gives the notice,\nany information in his possession which might be of material\nassistance in finding the witness; and\n\ndetails  of  the  alibi,  such  as  the  date,  time,  location,  and\nspecific information showing that the accused person was at\na place or number of places at the time of the commission of\nthe offence.\n\nWithout prejudice to subsection (1), the accused person may with\n(3)\nleave from the examining magistrate file notice of the defence of an\nalibi within 7 clear days from the end of the committal proceedings,\nand where the accused person is granted leave to file a notice of the\ndefence  of  an  alibi,  that  notice  of  the  defence  of  an  alibi  shall  be\nforwarded to\n\n(a)\n\n(b)\n\nthe examining magistrate; and\n\nthe Director of Public Prosecutions.\n\n(4)\n\nIn this section,\n\n“notice of the defence of an alibi” means evidence tending to show that\nby reason of the presence of the accused person at a particular place\nor in a particular area at a particular time that he was not, or was\n\n\f17\n\nunlikely to have been, at the place where the offence is alleged to\nhave been committed at the time of its alleged commission.”.\n\nAmendment of section 19 of Cap. 116A\n\n6.\nthe following:\n\nThe principal Act is amended by deleting section 19 and substituting\n\n“Discharge or committal for trial by examining magistrate\n\n19.(1)\nAn  examining  magistrate  shall,  after  the  examination  and\nconsideration of the written or oral statements, including any written or\noral statement of the accused person, as well as any exhibits or any other\nevidence  presented  to  him,  make  a  determination  in  respect  of  the\ncommittal proceedings and he may\n\n(a)\n\n(b)\n\nwhere he is of the opinion, that there is sufficient evidence to\nput  the  accused  person  on  trial  by  jury  for  an  indictable\noffence, commit the accused person for trial at the next sitting\nof the High Court; or\n\nwhere he is of the opinion, that there is insufficient evidence\nto put the accused person on trial by jury for an indictable\noffence, and the accused is in custody for no other cause than\nthe offence under his consideration, discharge him.\n\nSubject to section 5 of the Bail Act, Cap. 122A, an examining\n\n(2)\nmagistrate may commit an accused person for trial\n\n(a)\n\n(b)\n\nby  committing  him  to  custody,  to  be  safely  kept  until\ndelivered by due course of law for trial; or\n\nby granting him bail and directing him to appear before the\nHigh  Court  for  trial,  but  where  his  release  on  bail  is\n\n\f18\n\nconditional  on  his  providing  one  or  more  sureties,  the\nexamining magistrate shall\n\n(i)\n\nin  accordance  with  section  14  of  the  Bail  Act,\nCap.  122A  fix  the  amount  in  which  a  surety  is  to  be\nbound with a view to his entering into his recognizance\nin accordance with subsections (2), (3), (4) and (5) of\nsection 14 of the Bail Act, Cap. 122A; and\n\n(ii)\n\ncommit  the  accused  to  custody  in  accordance  with\nparagraph (a) until the conditions of his bail are met.\n\nWhere  the  examining  magistrate  has  committed  a  person  to\n(3)\ncustody  in  accordance  with  paragraph  (a)  of  subsection  (2),  the\nexamining magistrate may where that person is in custody for no other\ncause, at any time before the first sitting of the High Court at which he\nis  to  be  tried,  grant  him  bail  in  accordance  with  the  Bail  Act,\nCap.  122A  subject  to  a  duty  to  appear  before  the  High  Court  for\ntrial.”.\n\nAmendment of section 20 of Cap. 116A\n\n7.\nthe following:\n\nThe principal Act is amended by deleting section 20 and substituting\n\n“Bail and the accused person after the committal proceedings\n\n20.\nNotwithstanding paragraph (a) of section 19(2), an accused\nperson may make such applications as may be permitted in accordance\nwith the provisions  Bail Act, Cap. 122A, at any time before the first\nsitting of the High Court at which he is to be tried. ”.\n\n\f19\n\nAmendment of section 21 of Cap. 116A\n\n8.\nthe following:\n\nThe principal Act is amended by deleting section 21 and substituting\n\n“Committal for sentence\n\n21.\nExcept where the charge is one of high treason, treason or\nmurder, where an accused person in any written or oral statement made\nto the examining magistrate says or admits that he is guilty of the charge,\nthen the examining magistrate shall commit him for sentence, and, as\nthe case may be, subsections (2) and (3) of section 19 shall apply.”.\n\nAmendment of section 23 of Cap. 116A\n\n9.\nthe following:\n\nThe principal Act is amended by deleting section 23 and substituting\n\n“Written Statements to be sent to the Director of Public\nProsecution and Registrar\n\n23.\nAn examining magistrate who commits an accused person\nfor  trial  or  sentence  shall,  within  14  clear  days  after  the  end  of  the\ncommittal proceedings, transmit to the Director of Public Prosecutions\nand  the  Registrar  the  written  statements,  depositions  or  exhibits\ntendered  under  sections  17A,  18A  or  18B  in  addition  to  any  other\nrelevant or prescribed documents.”.\n\nAmendment of section 30 of Cap. 116A\n\n10.\nthe following:\n\nThe principal Act is amended by deleting section 30 and substituting\n\n\f20\n\n“Binding over to attend trial\n\n30.(1)\nThe  examining  magistrate  shall  bind  each  witness  whose\nwritten statements were tendered in committal proceedings, whether or\nnot that person was examined before him, other than the accused person\nand  any  witness  merely  to  the  character  of  the  accused,  by  a\nrecognizance to attend and give evidence before the High Court and he\nshall bind the prosecutor by a recognizance to prosecute the accused\nbefore that Court.\n\nWhere it appears to the examining magistrate, after taking into\n(2)\naccount any representations made by the accused person or prosecutor,\nthat the attendance at the High Court of any witness examined before\nhim is unnecessary by reason of any written statement or statement by\nthe accused person or of the accused person having admitted before the\nexamining magistrate the truth of the charge or of the evidence of the\nwitness being merely formal, the examining magistrate shall\n\n(a)\n\n(b)\n\nif the witness has not already been bound over, bind him over\nto attend the High Court conditionally, that is to say, on notice\nbeing given to him and not otherwise;\n\nif the witness has already been bound over, direct that he shall\nbe  treated  as  having  been  bound  over  to  attend  the  trial\nconditionally as aforesaid.\n\nAn examining magistrate on committing any accused person for\n(3)\ntrial shall inform him of his right to require the attendance at the trial\nof any witness bound over, or treated as bound over conditionally, and\nof the steps that he must take for enforcing the attendance.\n\nWhere any witness, on being required to enter into a recognizance\n(4)\nunder  this  section,  refuses  to  do  so,  the  examining  magistrate  may\ncommit him to custody until after the trial of the accused person or until\nhe  sooner  enters  into  the  recognizance;  but  where  the  examining\n\n\f21\n\nmagistrate does not commit the accused person for trial or sentence he\nshall release the witness.”.\n\nAmendment of section 55 of Cap. 116A\n\n11.\nthe following:\n\nThe principal Act is amended by deleting section 55 and substituting\n\n“Committal proceedings and evidence in a summary trial\n\n55.\nWhere under section 52(3) or (7) a magistrate, having begun\nto inquire into an information as an examining magistrate, proceeds to\ntry  the  information  summarily,  then,  subject  to  sections  17A,  18A,\n18B and 133(3), any evidence already given before the magistrate, as\nwritten statements or otherwise, shall be deemed to have been given in\nand for the purposes of the summary trial. ”.\n\nRepeal of section 132 of Cap. 116A\n\n12.\n\nSection 132 of the principal Act is repealed.\n\nAmendment of section 136 of Cap. 116A\n\n13.\nSection 136 of the principal Act is amended by deleting the words\n“  under  section  132”  where  they  appear  and  substituting  the  words  “under\nsections 17A or 18B ,”.\n\nTransitional Provision\n\n14.(1)\nproceedings for indictable offences committed after the commencement date.\n\nSubject  to  subsection  (2),  this  Act  shall  apply  to  committal\n\nFrom  the  commencement  date,  committal  proceedings  for  an  existing\n(2)\ncharge  shall  only  be  conducted  in  accordance  with  the  provisions  of  this  Act\n\n\f22\n\nwhere  at  or  after  the  commencement  date  the  committal  proceedings  for  the\nexisting charge has not commenced.\n\nAn  accused  person  for  whom  committal  proceedings  have  commenced\n(3)\nprior to the commencement date may, in respect of an existing charge, make an\napplication to the examining magistrate for those committal proceedings to be\ncontinued in accordance with the provisions of this Act.\n\nWhere an application under subsection (3) is granted by the examining\n(4)\nmagistrate any written statements made prior to the commencement date shall be\ntreated as written statements which were made in accordance with sections 17A,\n18A or 18B, as the case may be.\n\nWhere  the  accused  person  does  not  make  a  written  submission  in\n(5)\naccordance with subsection (3) the provisions of this Act shall not apply to the\ncommittal proceedings in respect of that accused person.\n\n(6)\n\nIn this section,\n\n“commencement date” means the date on which this Act comes into operation;\n\n“existing charge” means a charge for an indictable offence which has been laid\n\nagainst an accused person prior to the commencement date.\n\nAmendment of the enactments in the Schedule\n\n15.\nin the manner specified opposite thereto in Column 2 of the Schedule.\n\nThe enactments set out in Column 1 of the Schedule are amended\n\nCommencement\n\n16.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f23\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosSCHEDULE(Section 15)Amendments to enactments in the ScheduleColumn 1EnactmentsCommunity Legal Services Act, Cap. 112AColumn 2AmendmentsSection 17 is deleted and the following is substituted:\"Application for legal aid certiﬁ cate by person charged 17. Notwithstanding anything containedin this Act or the regulations, but subject to section 20, an application for a legal aid certiﬁ cate may be made by or on behalf of a person charged with a scheduled offence to(a) a magistrate before whom, and at such time as, he is charged or may appear upon remand;(b) the examining magistrate by whom the committal proceedings in relation to that offence is held;(i) at the commencement of the committal proceedings; or(ii) where the person charged  is committed for trial, at   the conclusion of the  committal proceedings;(c) a Judge at any time between committal for trial and the  appearance of the person  charged before the High Court  to plead to the indictment; or(d) the trial Judge in relation to  a certiﬁ ed offence at any time  during the hearing.\".\f24\n\n Schedule - (Cont'd)Amendments to enactments in the Schedule - (Cont'd)Column 1EnactmentsEvidence Act, Cap. 121Geneva Conventions Act, Cap.17ASupreme Court Act, Cap. 117AColumn 2AmendmentsSection 156 is amended by deleting subsection (1) and substituting the following: \"(1) If any person in a written statement tendered in evidence in criminal proceedings under the Magistrate's Court Act, Cap. 116A or under section 158 of this Act wilfully makes a statement material in those proceedings which he knows to be false or does not believe to be true, he is liable on conviction on indictment to imprisonment for 2 years, a ﬁ ne or to both.\".Section 7(2) is deleted and the following is substituted: \"(2) The notice referred to in subsection (1)must contain(a) a precise wording of the  ﬁ nding and sentence;(b) a summary of the committal proceedings; and(c) a copy of any order denying pardon or reprieve to the protected prisoner of war or protected internee, as the case may be.\".Paragraph 1 of the Second Schedule is deleted andthe following is substituted:\"Constitution of Rules Committee 1. The Rules Committee consists of(a) the Chief Justice, who shall be chairman;(b) the Justices of Appeal and the Judges;(c) the Master of the High Court;(d) the Solicitor-General;(e) the Chief Parliamentaary Counsel;(f) the President of the Bar Association as deﬁ ned in section 2 of the Legal Profession Act, Cap. 370A;\f25\n\n Schedule - (Concl'd)Amendments to enactments in the Schedule - (Concl'd)Column 1EnactmentsSupreme Court Act, Cap. 117A (Concl'd)Theft Act, Cap. 155Column 2Amendments(g) 3 attorneys-at-law nominated by the Council of the Bar Association and appointed by the Governor-General. 2. The Rules Committee shall performthe functions conferred on that Committeeby section 82, as well as such other functions as may be conferred by any other enactment.\".Section 31 is amended by(a) deleting subsection (4) and substituting the following: \"(4) The court shall not exercisethe powers conferred by this sectionunless in the opinion of the court the relevant facts sufﬁ ciently appearfrom evidence given at the trialor available documents, togetherwith admission made by or on behalf of any person in connectionwith any proposed exercise ofthe powers.\"; and(b) inserting the following subsection after subsection (7): \"(8) For the purposes of thissection,\"the available documents\" means any written statements or admissions used in trial, where those written statements or admissions were admissible as evidence at the trial, as well as the written statements or any depositions taken in committal proceedings, and any other documentation or admissions used as evidence in the committal proceedings.\".\f26\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2016.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2016.\n\nPresident\n\n\fMAGISTRATE’S COURTS (AMENDMENT) ACT, 2016\n\nEXPLANATORY MEMORANDUM\n\nThis Bill would amend the Magistrate’s Courts Act, Cap. 116A to make better\nprovision for committal proceedings under the Act by requiring the general use\nof written statements rather than the general use of oral evidence and depositions,\nand to provide for related matters.\n\nClause 1:\n\nClause 2:\n\nClause 3:\n\nClause 4:\n\ngives the citation of the amending Act; this the Act should be\ncited as the Magistrate’s Courts (Amendment) Act, 2016.\n\namends  the  interpretation  section  of  the  Act  to  amend  the\ndefinition of committal proceedings and to insert a definitions\nfor examining magistrate, Registrar, and accused or accused\nperson.\n\namends section 17 to make provision for any determination\nmade by an examining magistrate to be given in the presence\nof the accused, but provides for certain instances in which a\ndetermination may be made in the absence of the accused. This\nsection also defines High Court for the purposes of the this\nPart of the Act.\n\nprovides  for  the  submission  of  evidence  in  committal\nproceedings to be by way of written statements, in addition it\nalso provides for what must be done for a written statement to\nbe accepted for use in committal proceedings.\n\nClause 5:\n\ninserts 7 new sections into the Magistrates’ Courts Act, Cap.\n116A. These sections will be discussed in turn:\n\nClause 18A: makes provision for the examining magistrate to take oral\nevidence  where  the  taking  of  such  evidence  will  assist  the  court  in\n\ni\n\n\fMagistrate’s Courts (Amendment) Act,\n2016\n\nmaking a determination in the matter and for any party to the committal\nproceedings to make an application for oral evidence to be taken.\n\nClause 18B: expressly retains certain options for the accused, in the\ninterest of justice, this clause makes it clear that the accused need not\ngive a written statement, oral evidence or an unsworn statement.\n\nClause 18C provides for the exchange of written statements prior to\nthe  commencement  of  committal  proceedings  and  requires  that  this\nexchange should be done at least seven days before the commencement\nof  the  committal  proceedings.  This  is  to  give  adequate  notice  to\nfacilitate  preparation  for  the  committal  proceedings,  and  where\nadequate  notice  has  not  been  given  this  clause  provides  for  an\napplication to be made for more time.\n\nClause 18D: provides for the examining magistrate to sign the written\nstatements  and  the  exhibits  to  ensure  easy  verification  of  the\nauthenticity and integrity of the material which is to be transmitted for\nthe trial of the offence.\n\nClause 18E: provides for the use of the written statements from the\ncommittal  proceeding  in  the  trial  of  the  accused  where  the  person\nmaking that written statement cannot be at the trial due to death, illness,\nthreat or for other stated reasons.\n\nClause 18F: provides for the examining magistrate to give a warning\nof the requirement to give notice of the defence of an alibi and requires\nthe examining magistrate to explain the consequences of not giving\nthis notice of the defence of alibi. It also provides for the examining\nmagistrate to ensure that the accused understands the terminology in\nclause 18G as well as options available to the accused in respect of the\ngiving of the notice of the defence of alibi; and\n\nClause 18G: makes mandatory provision for the accused to give notice\nof the defence of alibi in order for the accused to be able to rely on the\ndefence of alibi at the trial of the offence. This will assist in ensuring\n\nii\n\n\fMagistrate’s Courts (Amendment) Act,\n2016\n\nthat an accused person with a verifiable alibi does not waste judicial\ntime or the financial resources of the public.\n\nClause 6:\n\nClause 7:\n\nClause 8:\n\nClause 9:\n\nClause 10:\n\nClause 11:\n\namends  section  19  to  makes  provision  for  the  examining\nmagistrate to either discharge the accused or commit him for\ntrial by the High Court on the basis of written statements and\nwhere  the  examining  magistrate  decides  to  commit  the\naccused  for  trial  he  can  either  grant  bail  or  commit  him  to\ncustody until trial.\n\namends  section  20  of  the  principal  Act  to  provide  for  the\naccused who has been placed in custody under section 19(2)\nto make such further applications for bail as may be permitted\nunder the Bail Act, Cap. 122A\n\namends section 21 to make provision for the use of written\nstatements in instances where there is an admission of guilt,\nbut this can only be used for offences other than the offence\nof murder, treason or high treason.\n\namends section 23 to provide the transmission of the written\nstatements  and  the  written  record  of  depositions  to  the\nDirector  of  Public  Prosecutions  and  the  Registrar  of  the\nSupreme Court.\n\namends section 30 of the Act to make provision for the use of\nwritten statements.\n\namends section 55 to provide for written statements used in a\ncommittal proceeding to be used in a summary trial where the\ncommittal proceedings are converted to a summary trial.\n\nClause 12:\n\nrepeals section 132 as this section is no longer required in the\nnew legislative scheme.\n\niii\n\n\fClause 13:\n\nClause 14:\n\nClause 15:\n\nClause 16:\n\nMagistrate’s Courts (Amendment) Act,\n2016\n\namends  section  136  to  make  provision  for  the  offence  of\nperjury in respect of sections 17A or section 18B rather than\nunder section 132, as section 132 is now repealed.\n\nmakes specific provision for the transition from the general\nuse of depositions to the general use of written statements and\nfor  the  provisions  of  this  Act  to  automatically  apply  to\ncommittal  proceedings  which  are  slated  to  begin  after  the\ncommencement  of  this  Act.  In  the  interest  of  fairness\nprovision  is  also  made  for  an  accused  to  elect  to  have  his\ncommittal  proceedings  subject  to  this  Act  in  circumstances\nwhere those committal proceedings are already in process at\nthe commencement of this Act.\n\namends other Acts which will be affected by the new regime\nfor committal proceedings .\n\nmakes provision for this Act to commence on a date set by\nProclamation, as this allows for the time which may necessary\nto make any administrative changes which may be required\nand also provides for the training of staff and attorneys-at-law.\n\niv\n\n"
}