{
  "bill_id": 161,
  "slug": "resolution-re-guarantee-barbados-agricultural-management-co-ltd-73000000",
  "title": "Resolution re Guarantee Barbados Agricultural Management Co. Ltd. $73,000,000",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/0d6b730a83edfe9e66a0e1b1fec43ee1.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-12-07",
  "first_reading": "2016-12-14",
  "second_reading": "2016-12-06",
  "gazette_date": "2016-12-14",
  "passed_date": "2016-12-14",
  "markdown": "RESOLUTION NO.\nPARLIAMENT\nManagement\nWHEREAS by virtue of section 3 of the Barbados Agricultural Co. Ltd. (Sugar Bonds Guarantee) Act, Cap. 255. the Minister may. with the approval of Parliament, guarantee in such manner and on such terms and conditions as the Minister thinks fit, the payment of the principal and interest necessary for the redemption of bonds issued by the Barbados Management Co. Ltd. for the purpose of the financing of the sugar industry;\nAgricultural\nto BBD 73 000 000\nAND WHEREAS the company proposes to raise up or USD equivalent by way of the issuance of a bond arranged by ANSA Merchant Bank Limited for the purpose of providing working capital support to the company and to provide funding to support the company's expenses and costs relating to the Barbados Cane Industry Support Project on the terms and conditions set out in the Schedule to this Resolution;\nby the Minister\nBE IT RESOLVED that Parliament approve the guarantee responsible for Finance of the payment of the principal and interest in respect of the issuance ofa of to BBD 73 000 000 or USD equivalent.\nbond in the sum\nup\nAPPROVED by the House of Assembly this\nday of\n2016.\nSpeaker\nAPPROVED by the Senate this\nday of\n2016.\nPresident\n>\nSCHEDULE\nTERMS AND CONDITIONS\nIssuer: Barbados Agricultural Management Co. Ltd.\nGuarantor:\nGovernment of Barbados.\nIssue: Face Amount: Currency: Use of Proceeds: Arranger: Placement Agent: Coupon: Term to Maturity: Basis; Fixed Rate Non-Callable Bonds. Up to BBD 73 000 000 (or USD equivalent) as follows: Class A Series 1 - BBD 32 000 000 as follows: Class A 1A - USD 10 525 000 Class A 1B - BBD 10 950 000 Class A Series 2 - BBD 22 500 000 (or USD equivalent) Class A 2A - USD 2 700 000 Class A 2B - BBD 17 100 000 Class B - BBD 18 500 000 (or USD equivalent). Barbados Dollars (BBD) and United States Dollars (USD). Class A 1A and 1B - to provide working capital support to BAMC Class A 2A, 2B and Class B - to provide funding to BAMC for its expenses and costs relating to the Barbados Cane Industry Support Project. ANSA Merchant Bank Limited. ANSA Merchant Bank Limited. Class A-1A fixed at 6.75 % p.a. for three (3) years; Class A-1B - fixed at 6.50 % p.a. for three (3) years; Class A - 2A fixed at 6.75 % p.a. for the period to February 12, 2018; Class A - 2B fixed at 6.50 % p.a. for the period to February 12, 2018; Class B fixed at 8.00 % p.a. for eight (8) years. Class A - Three (3) years from disbursement; Class B - Eight (8) years from disbursement. 30/360 daily basis.\nLee\nIssue Price: Class A - 1A - 97.62 %; Class A - 1B - 98.66 %: Class A - 2A - 97.62 %; Class A - 2B - 98.66 %; Class B - 96.55%.\nPrincipal and Interest Repayment:\nClass A\nInterest Payments on each Series of the Class A Bond to be paid on a semi-annual basis in arrears commencing 6 months after the issue date.\nNo principal payments during the tenor of Class A Bonds. Principal of each Series of the Class A Bonds to be repaid at maturity via a single Bullet Payment.\nTaxes: Security: Trustee: Registrar and Paying Agent: Conditions Precedent: maturity Class B Bond Interest Payments on Class B Bonds to be paid on a semi-annual basis in arrears commencing 6 months after the issue date. Principal on Class B Bonds to be repaid in Sixteen (16) equal semi-annual payments. All payments of Principal, Interest and all other amounts shall be made in Barbados Dollars or United States Dollars and will be paid without withholding or deductions for, or on account of any taxes imposed by any Government including the Government of Barbados. The Bonds shall be secured via a Letter of Comfort pending the provision of a Government of Barbados Guarantee. First Citizens Trustee Services Limited. First Citizens Trustee Services Limited. The execution of this transaction will be subject to the fulfillment of the following general Conditions Precedent: (1) Irrevocable sovereign guarantee from the Government of Barbados; (2) Executed Letter of Comfort from the Government of Barbados; (3) Absence of any material adverse change in the financial, political, economic or other conditions in Barbados and Trinidad and Tobago that in the sole opinion of the Arranger of the\nmay affect the successful disbursement and syndication Facility between the date of the proposal and the closing date;\nConditions Precedent: - (Cont'd)\n(4) The successful negotiation. preparation and execution of a final definitive agreement with respect to the F acility. such agreement being satisfactory to the Arranger at their sole discretion and the satisfaction of all conditions contained therein. The Arranger will be bound to arrange the Facility on the terms and conditions referred to in the proposal only after execution of the final Facility Agreements and to the extent of the successful syndication of the Facility:\n(5) The non-occurrence of material changes in the financial condition or prospects of the Issuer between the date of the proposal and the closing date, that may be expected, in the sole opinion of the Arranger, to have an adverse impact on the marketing of the Facility;\n(6) Presentation, execution, delivery and perfection of all transaction documentation prior to final disbursement in a form and substance satisfactory to the Arranger and their counsel, incorporating substantially the terms and conditions referred to above;\n(7) Exchange Control Authority (\"ECA\") approval to remit payments in US dollars:\n(8) Submission of financial information as may be required by the Arranger. All financial information to be assessed and deemed satisfactory in the sole opinion of the Arranger;\n(9) Submission of all relevant company documents by the Issuer:\n(10) The Facility must be pre-sold prior to disbursement;\n(11) Class B is also subject to the following:\n(a) approval and execution of the main transaction documents for the financing of the factory upgrade;\n(b) approval from the Ministry of Finance and the Minisiry of Agriculture of Barbados for the factory upgrade;\n(c) Appointment of an EPC Contractor;\n(d)_ the non-occurrence of material changes in the financial condition or prospects of the Issuer since the issue of the Class A Bonds that may be expected, in the sole opinion of the Arranger, to have an adverse impact on the marketing of the F, acility;\nta Conditions Precedent: {e) _ receipt of subscription amounts of Class B Bonds with a - (Concl'd) principal value of at least BBD 18 500 000 (or USD equivalent): (12) Any other conditions as are standard for Facilities of this nature and as recommended by the Arranger's Legal Counsel. Fees: Registrar and Paying Agent - USD 5 000 annually payable in advance. Trustee - USD 6 000 annually payable in advance. No new fees. All fees inclusive of legal fees, are for the account of the Issuer. Arrangement fees: Seventy five basis points (0.75 %) of the face value of the Bonds payable upon initial disbursement of each Class or Series of Class A. Covenants: Standard, general covenants as are usual in a facility of this size and nature to be included in the Trust Deed. Governing Law: Laws of Barbados.\nADDENDUM\nThe Barbados Agricultural Management Co. Ltd. is seeking to raise up to BBD 73 000 000 by way of the issuance of a bond arranged by ANSA Merchant Bank Limited. The bond is authorised and secured in accordance with the Barbados Agricultural Management Co. Ltd. (Sugar Bonds Guarantee) Act. Cap. 255.\nThe proceeds of the bond issue are to be used for the purpose of providing working capital support to the company and to provide funding to support the company's expenses and costs relating to the Barbados Cane Industry Support Project.\nInaccordance with section 3 of the Barbados Agricultural Management Co. Ltd (Sugar Bonds Guarantee) Act, Cap. 255, the approval of Parliament is being sought for the payment by the Government of the principal and interest necessary for the redemption of the bond by the Barbados Agricultural Management Co. Ltd.\n"
}