{
  "bill_id": 162,
  "slug": "supplementary-estimates-no1-20162017-33-111-620",
  "title": "Supplementary Estimates No.1  2016-2017  $33 111 620",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/fbc047aba51f27bf9d28dc7014f1dd7a.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2016-07-18",
  "first_reading": "2016-12-06",
  "second_reading": "2016-12-06",
  "gazette_date": "2016-12-06",
  "passed_date": "2016-12-06",
  "markdown": "HOUSE OF ASSEMBLY\nResolved that the sum of THIRTY-THREE MILLION ONE HUNDRED AND ELEVEN THOUSAND SIX HUNDRED AND TWENTY DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2016-2017 as shown in the Supplementary Estimates No.1 2016-2017 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2016 — 2017 No.1\nHEAD Code Provision in Provision in Supplementary Number Approved Supplementary Provision Estimates Estimates Required 2016 - 2017 No. 1 Other Other Other Expenditure Expenditure Expenditure HEAD: 21 MINISTRY OF FINANCE AND ECONOMIC AFFAIRS Program: 040 Direction and Policy Formulation Services Subprogram: 7010 General Management and 210407010 Coordination Services Account Code: 417 Capital Subscriptions 0 33,111,620\nADDENDUM\nHead 21: Ministry of Finance and Economic Affairs Programme 040: Direction & Policy Formulation Services Sub-programme 7010: General Management and Coordination Services\nAccount Code 417: Capital Subscriptions - $33,111,620\nThe sum of BDS$33,111,620 is required to bring to book equity contributions made by the Government of Barbados to LIAT (1974) Limited over the four (4) financial years 2012/2013 to 2015/2016 for the purposes as follows:\ne BDS $26,568,000 to meet expenses associated with a replacement fleet of aircraft as well as budgetary support; and\ne BDS $6,543,620 for the liquidating of a short term bridging facility with the Antigua Commercial Bank until the completion of the sale of the DASH 8 aircraft.\n"
}