{
  "bill_id": 164,
  "slug": "resolution-re-guarantee-needhams-point-holdings-limited-12000000",
  "title": "Resolution Re : Guarantee Needhams Point Holdings Limited $12,000,000.",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/12ae02cdee9fd689087b4b14ceacb2cc.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-12-10",
  "first_reading": "2016-12-14",
  "second_reading": "2016-12-09",
  "gazette_date": "2016-12-14",
  "passed_date": "2016-12-14",
  "markdown": "2016-08-11\nRESOLUTION NO.\nPARLIAMENT\nWHEREAS by paragraph (1) of section 3 of the Guarantee of Loans (Companies) Act, Cap. 96, the Government may, with the approval of Parliament, and in such manner and on such terms and subject to such conditions as may be agreed between it and a lending agency, guarantee the borrowing of such sums by a company from a lending agency as is authorised by the Government;\nAND WHEREAS Needham's Point Holdings Limited, a company incorporated under the Companies Act, Cap. 308 is controlled by the Government within the meaning of section 2 of the Guarantee of Loans (Companies) Act;\nin\nAND WHEREAS Needham's Point Holdings Limited is seeking a loan of BBD $12.0 million from First Citizens Bank (Barbados) Limited, on the terms and conditions set out the Schedule hereto, for the purpose of assisting with renovations to the Hilton Barbados Hotel;\nAND WHEREAS by virtue of section 4 of the Guarantee of Loans (Companies) Act, the aggregate amount of all borrowings by companies that are guaranteed by the Government shall not exceed $1 000 000 000 without taking into account any amount in respect of interest, commissions and any other expenses secured by the guarantee, and the Minister of Finance has certified that the aggregate amount of all borrowings by the Government and any further borrowings do not exceed the limit stipulated by that section;\nBE IT RESOLVED that Parliament approve the guarantee by the Minister of Finance of the payment of the principal sum of BBD $12.0 million be borrowed by Needham's Point Holdings Limited from First Citizens Bank (Barbados) Limited on the terms and conditions set out in the Schedule hereto.\nto\nAPPROVED by the House of Assembly this\n, 2016.\nSpeaker\nAPPROVED by the Senate this\nday of\n2016.\nPresident\nday of\nSCHEDULE\nTERMS AND CONDITIONS\nBorrower: Needham's Point Holdings Limited Lender: First Citizens Bank (Barbados) Limited Facility: Term Loan Amount: $12.0 million Currency: Barbados dollars Purpose: To assist with renovations of the Hilton Barbados Hotel Repayment Terms: 10 year loan. Interest only during the drawdown/refurbishment period of one (1) year, thereafter amortised over a nine (9) year period, repayable in monthly blended payments of BBD $147,054.18 Interest Rate: 6.5% per annum. Fixed for three (3) years, thereafter subject to three (3) year resets with a floor of 6.5%. Interest will be calculated on the actual number of days elapsed and a 365 day year. Fees: 0.5% of the facility amount; BBD $60 000. Security: (i) Letter of Comfort to be replaced by a Parliamentary Guarantee for BBD $12.0 million. (ii) Lien over a debt service account to be funded by a minimum of six (6) months' payments.\nConditions Precedent: Events of Default: The Bank is to be provided with a detailed costing of the remaining works, supported by the contractor's estimate and suppliers quotations, reviewed by a Quantity Surveyor, approved by the Bank and supported by a drawdown schedule. Government of Barbados is to provide a guarantee within twelve (12) months but a Letter of Comfort will be provided in the interim. Written confirmation that all cost overruns will be met by the Borrower or the Government. Written confirmation from the syndicate or some other acceptable formal confirmation that Needham's Point Holdings Limited can incur this additional debt. The debt service account to be set up at a branch of First Citizens Bank. The Borrower undertakes that so long as any moneys or obligations are outstanding it will on an annual basis provide the Bank with evidence of payment ofall necessary franchise fees, insurances and taxes. (a) If the Borrower fails to pay any sum on the due date for payment under the Facility Letter, or any Security Document to which it is a party or any other sum due and payable to the Bank. (b) If the Borrower shall neglect to carry out or observe any covenant or condition (other than those relating to the payment of any sum payable under the Facility Letter or under any Security Document), provided the Borrower shall have 21 days to make good such default before the Borrower shall be in default. (c) Ifa petition (other than a petition which is frivolous or vexatious and which is withdrawn within 21 days) is presented or an order is made or resolution is passed for the liquidation, bankruptcy, sequestration, winding-up or administration of the Borrower or the Borrower seeks protection from its creditors or\nfiles a plan or scheme of arrangement (except for the purpose of a solvent amalgamation or reconstruction - on terms and conditions which have first been approved by the Bank in writing).\nEvents of Default: - (Cont'd)\n(d) If any distress, execution, sequestration or other legal process is levied or enforced or sued out against any of the assets or undertaking of the Borrower.\n(©) If any person takes possession of, or a receiver on liquidation is appointed over, the whole or any part of the assets of the Borrower.\n(f) If the Borrower ceases or suspends payment of sums due or is unable to pay debts as they fall due or is deemed unable to pay sums due or is deemed insolvent under insolvency legislation.\nIf the Borrower is unable or admits in writing its inability to pay its debts generally as they fall due or is otherwise deemed to be so unable or to be otherwise insolvent or commences negotiations with a view to, or takes any proceedings for, a readjustment, rescheduling or deferment of all or any of its obligations, or proposes, makes or enters into a general assignment, arrangement or composition with or for the benefit of its creditors (or if any step is taken in connection with any of the aforesaid), or if the Borrower or any Guarantor shall otherwise generally stop or propose to stop payment of its debts or any class of them or cease or threaten to cease to carry on business.\n(g)\n(h) If there shall, in the opinion of the Bank, acting reasonably, occur any change of circumstance in the assets or concession of the Borrower from that existing at the date of the Facility Letter which has, or is likely to have a material adverse effect on the financial condition of the Borrower or materially imperil, delay or prevent fulfilment by the Borrower of its obligations under the Facility Letter or any of the Security Documents.\n@) If any representation, warranty, statement or disclosure which is made or deemed to have been made or acknowledged to have been made by or on behalf of the Borrower in any Security Document or which is contained in any certificate, statement, legal opinion or notice provided hereunder or in connection with any Security Document, or any other document delivered to the Bank in connection with the Facility Letter, is untrue and incorrect in any material respect when made or deemed to have been made.\nEvents of Default: - (Concl'd) G) If any obligation or other provision in any Security Document terminates or ceases to be the legally valid, binding and enforceable obligation of the Borrower or a Guarantor if the Borrower or a Guarantor contests in any manner, or repudiates the legality, validity, binding nature or enforceability of any Security Document.\n(k) If any governmental or other consent, license or authorization required to make any Security Document legal, valid, binding and enforceable or is required in order to enable the Borrower to perform its obligations thereunder, is withdrawn or ceases to be in full force and effect and which consent, licence or authorization is not capable of being reissued or reinstated within a reasonable period of time and in any event within 21 days.\n@) If any of the matters referred to in \"a\" and \"c\" through \"k\" above are applicable to a Guarantor.\nIn connection with an Event of Default, the Borrower hereby waives presentment for payment, notice of protest, demand for payment, notice of non-payment and notice of any other kind.\nADDENDUM\nNeedham's Point Holdings Limited entered into an Agreement with First Citizens Bank (Barbados) Limited for a loan in the sum of $12 million Barbados dollars for the purpose of assisting with renovations to the Hilton Barbados Hotel.\nParliamentary approval for the guarantee of the loan by the Government of Barbados is being sought in accordance with section 3(1) of the Guarantee of Loans (Companies) Act, Cap. 96.\n"
}