{
  "bill_id": 168,
  "slug": "resolution-re-land-compulsory-acquisition-at-prince-road-st-michael",
  "title": "Resolution re Land Compulsory Acquisition at  Prince Road, St Michael",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/89f874b49981ed6fc518f11aa97be0e4.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-12-14",
  "first_reading": "2016-12-14",
  "second_reading": "2016-12-13",
  "gazette_date": "2016-12-14",
  "passed_date": "2016-12-14",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Land Acquisition Act, Cap. 228 approve the compulsory acquisition by the Crown of the parcel of land the property of Mildred Prince-Cumberbatch situate at Prince Road, Upper Collymore Rock in the parish of Saint Michael in this Island, more particularly described in the Schedule hereto, for the public purpose of the construction of a roundabout and Prince Road Improvement Project.\nAPPROVED by the House of Assembly this\nday\nof\n, Two thousand and sixteen.\nSpeaker\nAPPROVED by the Senate this\nday\nof\n, Two thousand and sixteen.\nPresident\nte\nSCHEDULE\nALL THAT land the property of Mildred Prince-Cumberbatch situate at Prince Road, Upper Collymore Rock in the parish of Saint Michael in this Island containing the aggregate 1557.1 square metres or thereabouts Abutting and Bounding on lands now or formerly of Herbert Grant on lands now or formerly of Louise Gibbs on a public road called Highway 6 and on another public road called Prince Road together with two dwellinghouses thereon or however else the same may abut and bound as shown and delineated on a Plan certified on the 11\" day of December, 2015 by Brandford K. M. Howell, Land Surveyor and recorded in the Lands and Surveys Department on the 10\" day of December, 2015 as Plan No. 1133/2015.\nADDENDUM\nOn the 17\" day of April, 2014, the Cabinet agreed to the acquisition of approximately 1,360.71 square metres of land situate at Prince Road, Upper Collymore Rock in the parish of Saint Michacl, the property of Mildred Prince-Cumberbatch for the public purpose of the construction of a roundabout and Prince Road Improvement Project.\nIn accordance with section 5 of the Land Acquisition Act, Cap. 228, the approval of Parliament is now sought for the compulsory acquisition of the parcel of land, described in the Schedule hereto, so that the Crown may acquire an indefeasible title to the said parcel of land.\nN.T.W File No.: 3200/95.\n{ —a_To Cul-de-sac \" ° T Ber gg, tne Plantation Road 16.36 0 7.29 Now or Formerly Herbert Grant yp ~~ _ 26 082.31 mE és 65 558.97 mN Distance 255°41' | 3.29 | Ey [1.21 | [1.05 | Now or Formerly Louise Gibbs Culloden Road — _% 16.36 —0----~ To Wildey Plan: ty aie 25th November 1957, by H.W. Clarke. ‘af “—\nOAD NORTH\nfab | Pd-e | is3es2 Pe-f [27°13\n—e—To\nReference 1. Certified\naff\n1B a rb ad oO g PLAN OF LAND Bordered Green and Brown\nDistances awe vemtres\nBearings are referred to Grid North derived T2602 and T2603\nat\nPrince Road, St. Michael\ncontaining\nLand Road Reserve\n1268.2 sq.m. 288.9 sq.m. Taal :«C*ABSB1 cm. co eeu sbi\n© denotes iron found unless otherwise stated\n@ denotes x cut\ne denotes computed point\nsurveyed for Ministry Transport and Works\nLand Tax #: Part of 80.12.03.011-013\ncertified\n11th December, 2015\nHowell yor\nFor Lands and Surveys Dept only\n7 wA . AO\n"
}