{
  "bill_id": 171,
  "slug": "minimum-wage-bill-2017",
  "title": "Minimum Wage Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/4ffa2f6d1ff1e554f3fb5d7aff65593d.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-01-18",
  "first_reading": "2017-02-01",
  "second_reading": "2017-01-17",
  "gazette_date": "2016-11-28",
  "passed_date": "2017-02-01",
  "markdown": "2017-01-23\n\nOBJECTS AND REASONS\n\nThis Bill would repeal and replace the Holidays with Pay Act, Cap. 348 in\n\norder to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nmake better provision for the granting of the annual holiday due to an\nemployee;\n\nmake better provision for the calculation of the sum to be paid to an\nemployee who has taken his annual holiday;\n\nincrease the penalties for offences under the Act;\n\nmake  better  provision  for  the  Chief  Labour  Officer  to  initiate\nproceedings for offences under the Act; and\n\n(e)\n\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nShort title\n\nInterpretation\n\nPART II\n\nTHE ANNUAL HOLIDAY OF AN EMPLOYEE\n\nAdministration\n\nGrant of annual holiday\n\nPayment for annual holiday\n\nTermination and annual holiday\n\nTermination after 3 months employment\n\nPublic holidays and annual holidays\n\nPART III\n\nMISCELLANEOUS\n\n9.\n\nRecords to be kept\n\n\f3\n\n10.\n\nVoid contract or contract terms\n\n11.\n\nOffences\n\n12.\n\nPower to initiate proceedings\n\n13.\n\nLimitation period\n\n14.\n\nMinister may amend First Schedule\n\n15.\n\nSavings\n\n16.\n\nAmendment of the enactment in the Second Schedule\n\n17.\n\nRepeal\n\nFIRST SCHEDULE\n\nAllowances\n\nSECOND SCHEDULE\n\nEnactment to be Amended\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  repeal  and  replace  the  Holidays  with  Pay  Act  to  make  better\n\nprovision for the granting of an annual holiday with pay to employees.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Holidays with Pay Act, 2017.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“average pay”   means the sum that\n\n(a)\n\nan employer pays an employee for the annual holiday of the employee\nor a part thereof; and\n\n(b)\n\nis calculated in accordance with section 5(1);\n\n“basic wage” means the sum of money paid to an employee for the standard work\nperiod provided for in a contract of employment, whether the employee is\npaid  monthly,  weekly,  fortnightly,  daily,  on  an  hourly  basis,  or  by  work\ndone, as the case may be, but does not include any additional payment made\nto the employee as a bonus, commission or overtime;\n\n“contract  of  employment”  has  the  meaning  assigned  to  it  by  section  3  of  the\n\nEmployment Rights Act (Act 2012 - 9);\n\n“commission”  means  a  sum  of  money  paid  under  the  terms  of  a  contract  of\nemployment which is based on the performance of the employee and is paid\nper  unit  of  sale  or  per  completed  task,  and  where  the  payment  of\ncommission\n\n(a)\n\nforms a part of the salary, remuneration, or wage of the employee it\nshall be paid together with the basic wage; or\n\n\f7\n\n(b)\n\nconstitutes the basic wage of the employee it shall be paid in the manner\nin which the employee is to be paid whether on a monthly, weekly,\nfortnightly, daily, on an hourly basis or by work done;\n\n“employee” has the meaning assigned to it by section 2 of the Employment Rights\n\nAct (Act 2012-9);\n\n“employer” means a person who employs one or more employees and includes\nany agent or representative of that person where the agent or representative\nis directly or indirectly responsible for the payment, whether in whole or in\npart, of the total remuneration to an employee;\n\n“ incentive payment” means a sum of money paid under the terms of a contract\n\nof employment which is\n\n(a)\n\n(b)\n\nbased  on  the  performance  of  the  employee  or  the  performance  or\nproduction of a group of employees; and\n\npaid with the basic wage of the employee or paid separately in similar\nmanner as the basic wage or at the same time;\n\n“public holiday” means a day designated as such in the First Schedule to the\n\nPublic Holidays Act, Cap. 352;\n\n“standard work period” means the time period or fixed hours stipulated in the\ncontract  of  employment  and  includes  the  required  hours  of  work  which\ncomprises a work day, as well as the required work days;\n\n“terminated” means the end of a contract of employment by\n\n(a)\n\n(b)\n\n(c)\n\nan employer dismissing the employee;\n\nan employer making the employee redundant; or\n\nthe  employee  tendering  his  resignation  and  resigning  from  his\nemployment;\n\n\f8\n\n“total remuneration” means the total sum paid to an employee in respect of the\nlabour  or  services  performed  for  his  employer  under  a  contract  of\nemployment, being the sum of his basic wage\n\n(a)\n\ntogether with any sum paid\n\n(i)\n\n(ii)\n\nfor  services  done  or  labour  performed  on  a  Sunday  or  Public\nHoliday where the contract of employment stipulates these days\nas a part of the standard work period; and\n\nas  a  commission,  or  incentive  payment,  or  any  other  sum  paid\nbased on the productivity of the employee where that sum is paid\ntogether with the basic wage, or paid in a similar manner as the\nsalary or wage of the employee; and\n\n(b)\n\ntogether with the cash value of any\n\n(i)\n\n(ii)\n\nboarding or lodging provided by the employer which shall be paid\nat the rate specified in the First Schedule, unless the terms of the\ncontract of employment between the employer and employee, or\nany other agreement or implied term states otherwise and provides\nfor  a  rate  that  is  higher  than  the  rate  specified  in  the  First\nSchedule; and\n\nmeals provided by the employer which shall be paid at the rate\nspecified in the First Schedule unless the terms of the contract of\nemployment between the employer and employee, or any other\nagreement or implied term states otherwise and provides for a rate\nthat is higher than the rate specified in the First Schedule; but\n\n(c)\n\nshall  not  include  a  discretionary  payment  of  any  kind,  paid  by  an\nemployer to an employee;\n\n\f9\n\n“year of employment” means any period of 12 months during which an employee\nhas performed labour or rendered services for the same employer, and where\nthe employee is employed\n\n(a)\n\n(b)\n\non a weekly, fortnightly or monthly basis, the year of employment shall\nbe a minimum aggregate of 208 days; and\n\nother  than  on  a  weekly,  fortnightly  or  monthly  basis,  the  year  of\nemployment shall be a minimum aggregate of 150 days.\n\nPART II\n\nTHE ANNUAL HOLIDAY OF AN EMPLOYEE\n\nAdministration\n\nThe  Chief  Labour  Officer  shall  be  responsible  for  the  application,\n3.(1)\nadministration and enforcement of this Act, and for such other matters as the\nMinister may direct.\n\n(2)\n\nThe functions of the Chief Labour Officer are to\n\n(a)\n\n(b)\n\n(c)\n\nreceive  and  investigate  any  representations  made  to  him  or  any\ninstrument in writing sent to him concerning the Act or matters arising\nthereunder;\n\nprovide information and advice to employers and employees on the\napplication of this Act; and\n\nenforce the provisions of the Labour Department Act, Cap. 23, and the\nEmployment Rights Act (Act 2012 - 9) in so far as they are applicable\nto the provisions of this Act.\n\n\f10\n\nGrant of annual holiday\n\n4.(1)\n\nAn employee who\n\n(a)\n\n(b)\n\ncompletes  a  year  of  employment  with  the  same  employer  shall  be\nentitled to an annual holiday for a minimum period of 3 weeks; or\n\nhas been in the employment of the same employer for more than one\nyear  of  employment  but  less  than  5  years  of  employment  shall  be\nentitled to an annual holiday for a minimum period of 3 weeks.\n\nAn employee who has been in the employment of the same employer for\n(2)\n5  or  more  years  of  employment  shall  be  entitled  to  an  annual  holiday  for  a\nminimum period of 4 weeks.\n\nNotwithstanding subsections (1) and (2), an employee may be granted an\n(3)\nannual holiday which is greater than any period specified in those subsections\nwhere the duration of the annual holiday is\n\n(a)\n\n(b)\n\na part of the contract of employment of that employee;\n\na part of a collective agreement which has been incorporated into the\ncontract  of  employment  or  which  is  to  be  implied  as  a  term  of  the\ncontract of employment of that employee; or\n\n(c)\n\ngranted by way of custom or practice at his place of work for his years\nof service as an employee.\n\nAn annual holiday shall be given and taken in a single continuous period\n(4)\nunless the employer and the employee agree otherwise, and where they so agree,\nthe annual holiday may be taken in two separate periods or in such periods as\nmay be agreed.\n\nAn employer shall determine the date on which the annual holiday of an\n(5)\nemployee is due to commence and shall give the employee no less than 14 days\nnotice of the date on which that annual holiday is due to commence.\n\n\f11\n\n(6)\nAn employee may, where the notice required by subsection (5) has not\nbeen given, notify the Chief Labour Officer of that fact by an instrument in writing\nand  the  Chief  Labour  Officer  may,  where  he  considers  it  necessary  in  the\ncircumstances,  make  a  complaint  in  respect  of  the  matter  to  the  Employment\nRights Tribunal.\n\nAn employee who is entitled to an annual holiday shall be granted that\n(7)\nannual holiday by his employer within a 6 month period from the date on which\nthe annual holiday is due to commence unless\n\n(a)\n\n(b)\n\nthe employer and the employee agree in writing to postpone the annual\nholiday until a specified date; and\n\nthe Chief Labour Officer is notified and submits his consent in writing\nin respect of the postponement of the annual holiday until that specified\ndate.\n\nWhere the employer and employee so agree, the annual holiday may be\n(8)\ntaken wholly or partly, in advance, that is before the employee becomes entitled\nto the annual holiday.\n\nWhere  an  annual  holiday  or  any  part  thereof  has  been  taken  before  the\n(9)\nentitlement to that annual holiday has accrued, the employee shall not be entitled\nto another annual holiday, though he may be granted any remainder where only\na part has been taken in advance, until the expiration of the 12 month period in\nrespect of that annual holiday has passed.\n\nAn employer shall not give an employee a notice of termination prior to\n(10)\nor during an annual holiday, and where any such notice is given it shall be void\nand of no effect.\n\nWhere a notice of termination has been given to an employee prior to or\n(11)\nduring an annual holiday, the employee shall notify the Chief Labour Officer of\nthat fact by an instrument in writing and the Chief Labour Officer may, where\nhe considers it necessary in the circumstances, make a complaint in respect of\nthe matter to the Employment Rights Tribunal.\n\n\f12\n\nPayment for annual holiday\n\n5.(1)\npay for that annual holiday by his employer and in respect of an employee\n\nAn employee who takes his annual holiday shall be paid his average\n\n(a)\n\n(b)\n\nwho has one or more years of employment but less than 5 years of\n# employment, with the same employer, the average pay shall be 3/52 of\ntotal remuneration for that year of employment;\n\nwhose employment with the same employer is for a period of 5 or more\n# years  of  employment,  the  average  pay  shall  be  4/52  of  the  total\nremuneration for that year of employment;\n\n(c)\n\nwhose annual holiday is\n\n(i)\n\ndetermined by his contract of employment, a term to be implied\ninto his contract of employment or by custom; and\n\n(ii)\n\ngreater than the minimum period specified in section 4\n\nthe average pay shall be the number of weeks given for the annual holiday\ndivided by 52 and multiplied by the total remuneration of the employee for\nthat year of employment.\n\nAn employee, whether employed on a weekly, fortnightly or monthly basis,\n(2)\nwho takes his annual holiday or part thereof, shall not be paid any less for the\nduration of that holiday than he would have been paid for a week, fortnight or\nmonth in the course of his usual employment.\n\nWhere an employee takes his annual holiday as a single period his average\n(3)\npay  shall  be  paid  to  him  no  later  than  the  day  immediately  preceding  the\ncommencement of his annual holiday.\n\nWhere  an  employee  takes  his  annual  holiday  in  separate  periods,  the\n(4)\nproportionate part of his average pay shall be paid to him in respect of each period,\nand  payment  shall  be  made  no  later  than  the  day  immediately  preceding  the\ncommencement of each period.\n\n\f13\n\nTermination and annual holiday\n\n6.(1)\nAn employee whose employment is terminated before he has taken\nthe annual holiday to which he is entitled shall be deemed to have been given his\nannual holiday from the date of his termination and the employer shall forthwith\npay to the employee, in addition to any other sum due to him, his average pay in\nrespect of his annual holiday.\n\nAn  employee  who  has  taken  a  part  of  his  annual  holiday  and  whose\n(2)\nemployment is terminated before he has taken the remainder of his annual holiday\nshall be deemed to be given the remainder of his annual holiday from the date of\nthe termination, and the employer shall forthwith pay to the employee, in addition\nto any other sum due to him, his average pay in respect of the remainder of his\nannual holiday.\n\nWhere the annual holiday or any part thereof has been taken in advance by\n\n(3)\nan employee and\n\n(a)\n\n(b)\n\nthe employment of the employee is terminated before he has completed\nhis year of employment in respect of which the annual holiday or part\nthereof was taken; and\n\nthe sum paid by the employer to the employee in respect of the annual\nholiday or part thereof exceeds the sum which the employer is required\nto pay to the employee under subsection (1) or (2),\n\nthe employer shall not be liable to make any further payment to the employee\nand  shall  be  entitled  to  deduct  the  amount  of  any  such  excess  from  any\nremuneration payable to the employee upon the termination of his employment.\n\nTermination after 3 months employment\n\n7.(1)\n\nNotwithstanding section 4, an employee who\n\n(a)\n\nhas been employed by the same employer for a period of at least 3\nmonths; and\n\n\f(b)\n\nhas his employment terminated\n\n14\n\nshall, in addition to all other sums due to him, be entitled to payment for the\nportion  of  the  annual  holiday  which  has  accrued  during  the  tenure  of  his\nemployment, and his employer shall forthwith pay that sum and all other sums\ndue to the employee.\n\nWhere subsection (1) applies to an employee, the sum to be paid shall be\n(2)\ndetermined by multiplying the total remuneration paid to the employee during\n# his employment by 3/52.\n\n(3)\n\nFor the purposes of this section,\n\n“3  months”  means  an  aggregate  of  no  less  than  48  days  in  three  consecutive\nmonths during which the employee was employed by the same employer.\n\nPublic holidays and annual holidays\n\nNotwithstanding sections 4, 5, 6 and 7, where a public holiday granted\n8.(1)\nunder the Public Holidays Act, Cap. 352 occurs within any period taken by an\nemployee as annual holiday or as a part thereof, that day shall be deemed to be\ngranted in accordance with the Public Holidays Act, Cap. 352, and accordingly\nshall not be computed as a part of the annual holiday of the employee.\n\n(2)\n\nWhere subsection (1) applies,\n\n(a)\n\n(b)\n\nthe period of the annual holiday shall be increased by one day in respect\nof that public holiday; and\n\nthe employee shall be paid his average pay in respect of that additional\nday.\n\nNotwithstanding subsection (2)(b),the terms of the contract of employment\n(3)\nof an employee as it relates to payment for a public holiday shall apply in respect\nof payment for that public holiday.\n\n\f15\n\nPART III\n\nMISCELLANEOUS\n\nRecords to be kept\n\n9.(1)\n\nAn employer shall keep a record of\n\n(a)\n\n(b)\n\n(c)\n\nthe date on which an employee begins his employment, that is the first\nday  that  the  employee  reports  for  work  unless  the  contract  of\nemployment or agreement provides for an earlier date;\n\nthe basic wage of an employee or, where relevant, the amount paid as\nearnings to that employee as well as the manner in which the basic\nwage  or  the  earnings  is  paid,  that  is  whether  the  employee  is  paid\nmonthly,  weekly,  fortnightly,  daily,  on  an  hourly  basis,  or  by  work\ndone;\n\nthe annual holiday or part thereof taken by an employee specifying the\ndate on which the annual holiday or part thereof began and the date on\nwhich it ended, and state the duration thereof, in days or weeks as the\ncase  may  be,  as  well  as  the  total  remuneration  paid  for  that  annual\nholiday; and\n\n(d)\n\nany other amounts paid to an employee for his annual holiday or part\nthereof.\n\nThe  records  shall  be  kept  by  the  employer  in  such  form  as  may  be\n\n(2)\nprescribed by the Chief Labour Officer.\n\nThe Chief Labour Officer, or any person duly authorised by him, may at\n(3)\nany reasonable time enter any premises or place where an employee to whom\nthis Act applies is employed and inspect the records which are required to be kept\npursuant to subsection (1).\n\n\f16\n\nVoid contract or contract terms\n\nA  contract  of  employment  or  an  agreement,  or  any  term  thereof\n10.\nbetween an employer and an employee which purports to exclude the operation\nof any of the provisions of this Act shall be null and void, and where the Chief\nLabour Officer is notified by an instrument in writing of any such term, he may\nwhere he considers that the circumstances require it, make a complaint in respect\nof the matter to the Employment Rights Tribunal.\n\nOffences\n\n11.(1)\n\nAny employer who\n\n(a)\n\n(b)\n\n(c)\n\nrefuses to allow an employee to take an annual holiday to which he is\nentitled under this Act;\n\ngives an employee less annual holiday than the annual holiday to which\nthat employee is entitled;\n\nfails to pay an employee the average pay or part thereof, to which he\nis entitled in respect of his annual holiday or part thereof, in accordance\nwith the provisions of this Act;\n\n(d)\n\ncontravenes section 4(5);\n\n(e)\n\ncontravenes section 4(10);\n\n(f)\n\n(g)\n\n(h)\n\nfails to keep records in accordance with section 9;\n\nknowingly enters or causes to be entered in the records required under\nsection 9 any false particular; or\n\nwilfully delays or obstructs the Chief Labour Officer or any person\nduly authorised by him in the exercise of any power under section 9(3),\n\nis guilty of an offence and is liable on summary conviction to a fine of $10 000,\nor to imprisonment for a term of one year, or to both.\n\n\f17\n\n(2)\nWhere  a  person  is  convicted  of  an  offence  under  this  Act  and  a  fine  is\nimposed, and that person fails to comply with the order of the court in respect of\nthat fine, that person is liable to a further fine of $500 for each day during which\nthe failure to comply continues.\n\nPower to initiate proceedings\n\nThe Chief Labour Officer may institute proceedings in his own name\n12.(1)\nagainst an employer for any offence under this Act and may appear and conduct\nthe proceedings.\n\nWhere  a  magistrate  finds  an  employer  guilty  of  an  offence  under\n(2)\nparagraphs (a),(b) or (c) of section 11(1), the magistrate may, in addition to the\nfine or sentence imposed, order the employer to pay to the employee concerned\nany payment due to him under the Act, and this payment shall be subject to such\nrate of interest as the magistrate considers appropriate in the circumstances.\n\nLimitation period\n\n13.\nthe expiration of one year from the date of the commission of the offence.\n\nNo prosecution for an offence under this Act shall be instituted after\n\nMinister may amend First Schedule\n\n14.\n\nThe Minister may by Order amend the First Schedule.\n\nSavings\n\n15.(1)\nA person whose employment commenced after 1st day January, 1952\nand before the commencement of the Holidays with Pay Act, 2017 shall be treated\nas  if  his  year  of  employment  began  on  the  date  on  which  he  commenced  his\nemployment, or, if that date is sooner, the date on which he signed his contract\nof employment.\n\nThe  provisions  of  the  Holidays  with  Pay  Act,  2017  shall  apply  to  all\n(2)\ncontracts of employment which are in force at the commencement of the this Act.\n\n\f18\n\nNotwithstanding section 17, where an offence committed under the former\n\n(3)\nAct,\n\n(a)\n\n(b)\n\nis being tried under the Magistrate’s Courts Act, Cap. 116A; or\n\nwas to be tried under the Magistrate’s Courts Act, Cap. 116A\n\nbefore the commencement of the Holidays with Pay Act, 2017, the trial in respect\nof that offence shall be continued to its final determination in accordance with\nthe provisions of the former Act.\n\n(4)\n\nFor the purposes of subsection (3),\n\n“former Act” means the Holidays with Pay Act, Cap. 348.\n\nAmendment of the enactment in the Second Schedule\n\n16.\nin the manner specified opposite thereto in Column 2 of the Second Schedule.\n\nThe enactment set out in Column 1 of the Second Schedule  is amended\n\nRepeal\n\n17.\n\nThe Holidays with Pay Act, Cap. 348 is repealed.\n\n\f19\n\nFIRST SCHEDULE\n\nAllowances\n\n(Sections 2 and 14)\n\nNature of the Allowance\n\nMinimum Monetary Value per Week\n\nBoarding or Lodging Allowance\n\nMeal Allowance\n\n$\n\n8.00\n\n25.00\n\n\f20\n\nSECOND SCHEDULE\n\nEnactment to be Amended\n\n(Section 16)\n\nEnactment\n\nAmendment\n\nEmployment Rights Act, 2012-9\n\nSection 2 is amended by deleting the definition\nof “ complaint” and substituting the following:\n\n“complaint” means a complaint made to the\nTribunal by an employee, by way of the Chief\nLabour Officer or by a trade union, as the case\nmay be;”.\n\nSection 7 is deleted and the following is\nsubstituted:\n\nFunction of Tribunal\n7. (1) The function of the Tribunal is to enforce\nthe rights conferred upon persons by this Act or\nunder any other enactment that provides for\nenforcement by the Tribunal, and for that\npurpose to exercise the jurisdiction specified in\nsubsection (2).\n\n(2) The jurisdiction of the Tribunal is to\ndetermine complaints made to it under this Act\nor under any other enactment that provides for\nenforcement by the Tribunal, and subject to\nsection 48, to make awards and other decisions\nin relation to those complaints in accordance\nwith its powers under this Act.\n\n(3) Subject to subsection (4), sections 11, 12,\n13, 14, 15 and 21 of the Commissions of Inquiry\nAct, Cap. 112 apply in respect of the\n\n\f21\n\ndetermination of complaints by the Tribunal,\nwith such modifications and adaptations as may\nbe necessary, as those sections apply in relation\nto an investigation by a commission under that\nAct.\n\n(4) Where there is a conflict between this Act\nand the Commissions of Inquiry Act, Cap. 112 ,\nthis Act shall prevail.\n\n(5) Where the Tribunal determines a complaint\nunder this Act, the Tribunal may in addition to\nany other remedy, award or decision, require an\nemployer or employee to\n(a) comply with the terms of the contract of\nemployment; or\n(b) comply with the provisions of this Act or any\nother enactment that provides for enforcement\nby the Tribunal.\n\n(6) A person who contravenes subsection (5) is\nguilty of an offence and is liable on summary\nconviction to a fine of $20 000, to imprisonment\nfor 6 months or to both.”.\n\nSection 42 is deleted and the following is\nsubstituted:\n\nComplaints to be referred to the Chief\nLabour Officer\n\n“42. (1) Where an employee believes that there\nis a dispute or issue concerning an infringement\nof any right or benefit conferred on him by this\nAct, or under the provisions of any other\nenactment dealing with employment standards\nor other employment rights, he may make a\ncomplaint in writing to the Chief Labour\nOfficer.\n\n\f22\n\n(2) Notwithstanding subsection (1), a complaint\nmay also be made under this section by a trade\nunion or another representative group on behalf\nof the employee.\n\n(3) Where a group of employees, having the\nsame or substantially the same interests, has a\ncomplaint, one employee may make the\ncomplaint in a representative capacity or the\ncomplaint may be made by a trade union or\nanother representative group on behalf of the\ngroup of employees.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2017.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2017.\n\nPresident\n\n"
}