{
  "bill_id": 172,
  "slug": "barbados-jubilee-honour-bill-2016",
  "title": "Barbados Jubilee Honour Bill, 2016",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/c1deadf9873195834d5a987131362ed2.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-11-23",
  "first_reading": "2016-11-23",
  "second_reading": "2016-11-22",
  "gazette_date": null,
  "passed_date": "2016-11-23",
  "markdown": "2016-11-15\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the conferment of the Barbados Jubilee Honour\non  fifty  persons  who  have  contributed  to  the  development  of  the  nation  of\nBarbados since the attainment of Independence and for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\nShort title\n\nInterpretation\n\nEstablishment of the Barbados Jubilee Honour\n\nConferment of the Barbados Jubilee Honour\n\nEligibility for conferment of the Barbados Jubilee Honour\n\nPublication\n\nPost nominals and insignia\n\nCriteria for the Selection of Nominees for the Barbados Jubilee Honour\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the conferment of the Barbados Jubilee Honour on\nfifty  persons  who  have  contributed  to  the  development  of  the  nation  of\nBarbados since the attainment of Independence and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n\nThis Act may be cited as the Barbados Jubilee Honour Act, 2016.\n\nInterpretation\n\n2.\nby that name established by section 3.\n\nIn this Act “Barbados Jubilee Honour” means the honour to be known\n\nEstablishment of the Barbados Jubilee Honour\n\n3.\nHonour.\n\nThere is hereby established an honour entitled the Barbados Jubilee\n\nConferment of the Barbados Jubilee Honour\n\nSubject to subsection (2), the Governor-General may by instrument\n4.(1)\nunder Public Seal confer the Barbados Jubilee Honour upon a person referred to\nin section 5.\n\nThe power conferred on the Governor-General by subsection (1) shall be\n\n(2)\nexercised by him on the advice of the Prime Minister.\n\nA conferment of the Barbados Jubilee Honour shall take effect from the\n(3)\ndate of the affixing of the Public Seal or from such other date as may be specified\nin the instrument.\n\nEligibility for conferment of the Barbados Jubilee Honour\n\n5.\n\nA person who\n\n(a)\n\n(b)\n\n(c)\n\nhas been nominated for the honour by Barbadians living in Barbados\nor elsewhere;\n\nis a citizen of Barbados or is entitled to be registered as a citizen of\nBarbados;\n\nhas given significant or meritorious service to his community and to\nthe nation; and\n\n\f5\n\n(d)\n\nhas satisfied the criteria for selection in one of the categories set out in\nthe Schedule,\n\nis eligible for the conferment of the Barbados Jubilee Honour.\n\nPublication\n\n6.\nis conferred shall be published in the Official Gazette.\n\nThe names of those persons upon whom the Barbados Jubilee Honour\n\nPost nominals and insignia\n\n7.(1)\nconferred is entitled to\n\nEvery  person  upon  whom  the  Barbados  Jubilee  Honour  has  been\n\n(a)\n\n(b)\n\nhave the letters “B.J.H.” placed after his name on all occasions when\nthe use of letters after a name is customary; and\n\nwear as a decoration the prescribed insignia for holders of the Barbados\nJubilee Honour.\n\nFor the purposes of this section, the letters “B.J.H.” mean Barbados Jubilee\n\n(2)\nHonour.\n\n\f6\n\nSCHEDULE\n\n(Section 5(d))\n\nCriteria for the Selection of Nominees for the Barbados Jubilee Honour\n\n1. Business\n\nA person who has displayed innovation through the development of a product or a service. The\nperson must also have demonstrated an ability to form strategic partnerships, thereby assisting\nin the creation of jobs. The person must have exhibited a capacity to earn foreign exchange and\npromote the regional and international profile of Barbados and should have the potential to expand\nthe product or the service beyond the shores of Barbados.\n\n2. Civil Society\n\nA person who has demonstrated transformational leadership, while inspiring positive change and\naddressing  specific  community  needs.  The  person  must  also  have  contributed  to  satisfying  a\ncritical need within the country, by using an innovative approach. The person must have assisted\nin the upliftment of the needy and oppressed members of the Barbadian society and contributed\nto the empowerment of Barbadian communities through the sharing of knowledge, expertise and\nexperience.\n\n3. Cultural Arts\n\nA person who has demonstrated outstanding skill and aptitude in his chosen field and by mastering\nhis art, has contributed significantly to the cultural landscape of Barbados. The person must also\nhave influenced others positively, thus helping to increase the creative capacity of the nation and\nallowing Barbados to make a meaningful contribution to the arts regionally and internationally.\n\n4. Education\n\nA  person  who  is  an  educator  at  the  primary,  secondary  or  tertiary  level  and  has  exhibited\noutstanding commitment and dedication to the teaching profession. The person must also have\ncontributed to the intellectual, social and moral development of his charges. The person should\nbe a positive role model with the ability to inspire his students to achieve their best in every sphere\nof endeavour.\n\n5. Entrepreneurship\n\nA person who has demonstrated initiative, innovation and successful risk management and has\nfulfilled a vital need in the landscape of the Barbadian community. The person must also have\n\n\f7\n\nexhibited  qualities  of  leadership,  perseverance,  bravery  and  an  ability  to  overcome  negative\ncircumstances in the pursuit of his dreams.\n\n6. Innovation\n\nA person who has pioneered an idea or has developed an idea which is designed to enhance\nexisting technology, or a person who has launched a unique and viable venture or product and\nhas demonstrated excellence in design, strategic planning and the ability to impact his community\npositively. The venture or product must have a practical application with significant potential to\nearn or produce tangible benefits to an aspect of the Barbadian society.\n\n7. Medicine\n\nA  practitioner  whose  distinguished  service  in  the  medical  profession  has  contributed  to  the\nadvancement of medical science, medical education or medical care in Barbados and the region.\nThe  contribution  must  have  been  sustained  over  a  significant  term  of  service  and  largely\ninfluenced the goals and ideals of the medical profession. The person must also have, through\nhis practice, aided in the upliftment and education of the Barbadian population.\n\n8. Public Service\n\nA person whose personal attributes and exceptional skill, demonstrated through his own actions\nor his guidance of others, have enabled him to make a significant contribution, throughout his\ncareer,  to  his  department  or  the  wider  public  service.  The  person  must  also  have  displayed\noutstanding dedication to his work, remained highly committed to the values and ethics of the\npublic service and inspired other employees. The person must have demonstrated good leadership\nskills and maintained transparency in the management of human resources.\n\n9. Science and Technology\n\nA person who has demonstrated a passion for learning and scientific achievement. The person\nmust also have made a significant breakthrough or discovery in scientific advancement or in the\napplication  or  implementation  of  technology,  products  or  processes.  The  breakthrough,\ndiscovery,  application  or  implementation  must  have  contributed  to  the  improvement  of  the\nBarbadian society, as it faces the complex challenges of the 21st century.\n\n10. Sports\n\nA person who has consistently maintained an outstanding level of performance in his chosen\nsport, which has helped to bring Barbados to global prominence. The person must also have\ndisplayed exceptional dedication and commitment in mastering his discipline and exhibited a\n\n\f8\n\nhigh level of personal and professional integrity. The person must be an inspirational role model\nwhom the youth in Barbados can emulate.\n\n11. The Labour Movement\n\nA person who has demonstrated an ability to organise workers and negotiate on their behalf. The\nperson must also have exhibited a visionary approach to bargaining for improved conditions for\nworkers in Barbados.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2016.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2016.\n\nPresident\n\n"
}