{
  "bill_id": 176,
  "slug": "resolution-re-land-barbados-national-terminal-company-limited",
  "title": "Resolution Re Land Barbados National Terminal Company Limited",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/5f1e617a8e8999beeb369cd7cf9bb6ee.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-12-10",
  "first_reading": "2016-12-14",
  "second_reading": "2016-12-09",
  "gazette_date": "2016-12-14",
  "passed_date": "2016-12-14",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, approve the sale to the Barbados National Terminal Company Limited of the parcel of land, the property of the Crown, situtate at Coverley in the parish of Christ Church in this Island and more particularly described in the Schedule hereto.\nAPPROVED by the House of Assembly this\nday\nof\n, Two thousand and sixteen.\nSpeaker\nAPPROVED by the Senate this\nday\nof\n, Two thousand and sixteen.\nPresident\nSCHEDULE\nALL THAT land the property of the Crown situate at Coverley parish of Christ Church in this Island containing by admeasurement 14.207 hectares (inclusive of 0.101 hectares of road reserve) or thereabouts Abutting and Bounding on lands now or formerly of the Barbados Agricultural Development Management Corporation (Fairy Valley Plantation), on a public road known as Highway 7 leading to Grantley Adams International Airport in one direction, on lands now or formerly of the Barbados Government and on a public road leading to Industrial Estate in one direction or however else the same may abut and bound as shown and delineated on a plan certified on the 16\" day of February, 2004 by W.A.G. Scott, Land Surveyor and recorded in the Lands and Surveys Department on the 24\" day of September, 2004 as Plan No. 977 of 2004.\nin the\nADDENDUM\nOn the 25\" day of August 2016 the Cabinet agreed that 14.207 hectares of land situate at Coverley (Fairy Valley Plantation) in the parish of Christ Church in this Island should be sold to the Barbados National Terminal Company Limited for the sum of $15.2 million.\nThe said parcel of land, more particularly described in the Schedule hereto, was acquired by the Crown by deed of conveyance dated 18\" October, 1965 between Oldbury Estates Limited and the Crown in right of its Government of the Island of Barbados and recorded in the Land Registry on the 30\" day of November, 1965 as Deed No. 4185.\nIn accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is now sought for the sale to the Barbados National Terminal Company Limited of the parcel of land more particularly described in the Schedule to this Resolution.\n"
}