{
  "bill_id": 177,
  "slug": "resolution-re-borrowing-15-million-from-first-citizens-bank-limited",
  "title": "Resolution re borrowing $15 Million from First Citizens Bank Limited",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/4a22880be7541f2694019dd68fc7ae29.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2016-12-14",
  "first_reading": "2016-12-14",
  "second_reading": "2016-12-13",
  "gazette_date": "2016-12-14",
  "passed_date": "2016-12-14",
  "markdown": "2016-12-12\nRESOLUTION NO.\nPARLIAMENT\nWHEREAS the Government of Barbados is desirous of borrowing USD$15 million from First Citizens Bank Limited in Trinidad and Tobago by way of a revolving credit line;\nby\nAND WHEREAS the proceeds will be used to fund projects approved the Government in accordance with the requisite criteria for the utilization of funding available to the Government from the Development Bank of Latin America,\nRESOLVED therefore that Parliament approve the borrowing of the sum of USD$15 million from First Citizens Bank Limited in Trinidad and Tobago on the terms and conditions set out in the Schedule.\nAPPROVED by the House of Assembly this\nday of\n, 2016.\nSpeaker\nAPPROVED by the Senate this\nday of\n2016.\nPresident\nSCHEDULE\nTERMS AND CONDITIONS\nBorrower: Lender: Amount: Purpose of loan: Facility: Term: Repayment: Interest rate: Prepayment: Fees: Security: Government of Barbados. First Citizens Bank Limited in Trinidad and Tobago. USD $15,000,000.00 To provide a revolving line of credit to fund Projects which will be executed in Barbados and approved by the Government of Barbados which meet all the requisite criteria for the utilization of funding available to the Government from the Development Bank of Latin America. Revolving Credit Line. 6 months Principal and interest at maturity. Six (6) month Libor plus 5.6% (current effective 6.891% per annum); to be set 2 days prior to disbursement. The rate may be increased by 0.5% to 0.75% per annum in the event that there is a further downgrade in the Borrower's credit rating during the term of the loan. Allowed without penalty. 1.375% of facility amount due on disbursement. Additionally, a fee of 0.25% of the unutilized balance to be payable on a quarterly basis. Legal fees and charges as well as costs and expenses arising from the transaction are for the account of the borrower. Executed Letter of Offer, Promissory Note and Letter of Undertaking.\nConditions precedent:\nto\nThe execution of this transaction will be subject to the fulfilment of the following general conditions precedent:\n(1) The duplicate of the Letter of Offer duly signed on the Borrower's behalf;\n2) A gazetted copy of the Parliamentary Resolution authorizing the borrowings;\n@) The Loan Agreement and any additional documentation as may be advised by the Lender's legal counsel must be duly prepared, executed, stamped and delivered to the Lender;\n(4) A Letter of Undertaking from the Ministry of Finance and Economic Affairs in Barbados indicating that they will utilize a Development Bank of Latin America loan facility obtained for the repayment of the proposed facility;\n(5) Obtaining of all approvals, authorizations, consents, exemptions, licenses, permits and registration (\"collectively referred to as \"Consents\") required from any regulatory, governmental, parliamentary or other authority or person in order for the Borrower to be a party to the Facility;\n(6) An opinion from the Solicitor General of Barbados confirming that the Government will receive all requisite Consents and that the execution by the Borrower of the proposed Letter of Offer and any related legal documentation as well as the performance of the obligations undertaken by the Borrower do not and will not contravene any law, regulation, directive or judgment to which the Borrower is subject;\n(7) A letter from Development Bank of Latin America to the Government of Barbados authorizing the funding and confirming that all conditions have been met and stating the disbursement amount relative to each project;\n(8) Evidence of all required approvals authorizing the execution of the project;\nConditions precedent: - (Cont'd) (9)\nRepresentations and warranties:\nThere must not be prior to disbursement, any further downgrade in credit ratings of Barbados or any other change in the financial condition of the Borrower, or in the financial or economic conditions in Barbados, which, in the reasonable opinion of the Lender, may have a material adverse effect (as defined in (10) below) on the ability or willingness of the Borrower to comply with any of its obligations under the Letter of Offer;\n(10) A \"material adverse effect\" means\n(a) a material adverse effect on the economic or financial condition or stability (whether financial, political or otherwise) of the Government of Barbados;\n(b) the Borrower's ability to perform its obligations under the Letter of Offer or any related loan or security document;\n(c) the validity or enforceability of the Letter of Offer or the rights and remedies or benefits available to the Lender under the Letter of Offer or under any related loan or security document.\nThe following representations and warranties are made by the Borrower to the Lender:\n(1) The obligations assumed by the Borrower under the Letter of Offer constitute valid, legal, binding and enforceable obligations;\n(2) Neither the execution of the Letter of Offer (or any other document contemplated therein) nor the performance or observance of any obligation contained therein will conflict with or result in any breach of any law, regulation, obligation, duty, agreement or other instrument by which the Borrower is bound;\nThe entry by the Borrower into the Letter of Offer (or any other document contemplated therein) and the exercise by it ofrights and performance of its obligations under them will constitute private and commercial acts performed for private and commercial purposes. The Borrower will not be entitled to claim immunity on the grounds of sovereign immunity or otherwise from suit, execution, attachment or other legal process in any proceedings taken in relation to the Letter of Offer or any other financing or security document made in relation to the Facility thereunder;\n(3)\nRepresentations and warranties: - (Concl'd)\nEvents of default:\n(4) There exists no litigation or administrative or arbitration proceedings (pending or threatened in writing) against or affecting the Borrower before any court, government, authority or arbitrator which would have a material adverse effect on the financial condition of the Borrower;\n(6) The Borrower is not in any breach of or in any default under any law, statute, regulations, mortgage, charge, lien, agreement or other instrument, arrangement, obligation or duty by which it is bound;\n(6) The Borrower also affirms that it will use all of the proceeds of the loan only for the purposes specified;\n(7) The Borrower agrees to provide the Lender with prompt notice of any material litigation proceedings or dispute threatened in writing or commenced against the Borrower and to provide all information reasonably requested by the Lender concerning the nature and status of the same.\nThe following are the events of default:\n(1) Ceasing to be a Member of Development Bank of Latin America;\nQ) Any default of the Borrower in the stipulated payments when due;\n(3) Any statement, certificate, warranty or representation given in pursuance of the Letter of Offer proving to be untrue, false or misleading in any material respect;\n(4) Breach of any other of the Borrower's obligations under the facility for more than fourteen days after written notice from the Lender to the Borrower requiring such breach to be remedied;\n(5) Any creditor or creditors of the Borrower becoming entitled to declare that any debt or part of the debt remains unpaid in whole or in part;\nEvents of default: - (Concl'd)\nAny security agent, trustee or a holder or holders under a lien, loan or other arrangement declaring a breach and legally entitled to accelerate payment obligations under these arrangements in which the Borrower is a party and which would have a material adverse effect (as defined under conditions precedent at 10 above) on the Borrower's ability to make the payments as stipulated or to repay the facility under the Letter of Offer;\n(6)\n7) Default by the Borrower in the payment of any of its debt obligations or admission by the Borrower of its inability to pay its debts generally as they fall due;\n(8) The Letter of Offer or any related loan or security document shall fail to be in full force and effect if the Borrower denies or repudiates its obligations thereunder or does any act or thing evidencing an intention to deny or repudiate its obligations thereunder;\n(9) The Borrower making any arrangement or assignment for the benefit of creditors or to compromise with its creditors with a view to general adjustment or rescheduling its payments;\n(10) The Borrower declares a general suspension of or a moratorium on payments of the Facility or on the indebtedness of the Borrower;\n(1) Any proceedings or action taken by or against the Borrower arising from its defaulting in the payment of its debt obligations or its inability to pay its debts;\n(12) Any circumstance or change of situation of the Borrower as represented or warranted by the Borrower which in the opinion of the Lender, is likely to materially or adversely impact on the ability or willingness of the Borrower to perform any or all of its obligations under the Facility Letter, any related Loan Agreement or other related legal documentation as the case may be;\n(13) An event or circumstance at any time in which it becomes unlawful for the Borrower to perform or comply with any or all of its obligations under the Letter of Offer.\nPriority of the loan:\nTaxation:\nGoverning law:\nThe Borrower shall not enter into any obligations which have priority to this debt without the Lender's stated written consent. Where this condition is breached, the following shall apply:\n(1) Should the Borrower enter into any subsequent agreement with any other lender during the term of the facility letter which provides for benefits or terms more favourable that those contained in the Facility Letter, then the Facility Letter shall be deemed to be modified to provide the Lender with those more favourable benefits and terms including but not however limited to any terms by which the borrower undertakes to enhance the other lender's collateral; or to grant the other lender a security interest in any fixed assets of the Borrower.\nThe Borrower shall notify the Lender promptly of the existence of any more favourable benefits and terms mentioned at (1) above. Any collateral enhancement to security interest granted by the Borrower to the Lender pursuant to this clause shall rank pari-passu with the collateral enhancement or security interest granted by the Borrower to the other lender. If requested in writing by the Lender, the Borrower shall execute an amendment to the Facility Letter to include the more favourable terms and conditions and all costs associated with such a transaction will be for the account of the Borrower.\n(2)\nAll payments by the Borrower will be made free and clear of all present and future taxes, withholdings or deductions of whatsoever nature. The Borrower will also be responsible for the due payment of all levies, imposts, taxes and duties or charges incurred in connection with the facility.\nThe law of Trinidad and Tobago.\nADDENDUM\nThis Resolution seeks the approval of Parliament for the borrowing of USD$15 million by way ofa revolving line of credit from the First Citizens Bank Limited in Trinidad and Tobago.\nThe proceeds of the loan will be used to fund projects approved by the Government of Barbados which meet all the requisite criteria for the utilization of funding available to the Government of Barbados from the Development Bank of Latin America.\n"
}