{
  "bill_id": 184,
  "slug": "resolution-re-borrowing-15-million-from-first-citizens-bank-limited-2017",
  "title": "Resolution re borrowing $15 Million from First Citizens Bank Limited (2017)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/fb896f48fd5858a85b69aa724e8976bd.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-01-18",
  "first_reading": "2017-01-25",
  "second_reading": "2017-01-17",
  "gazette_date": "2017-01-17",
  "passed_date": "2017-01-25",
  "markdown": "RESOLUTION NO.\n\n2017-01-09\n\nPARLIAMENT\n\nWHEREAS  by  section  2  of  the  Special  Loans  Act,  Cap.  105  the  Government\n\nis authorised from time to time to borrow from any government, bank, corporation, company or\n\nother  institution  sums  of  money  not  exceeding  in  the  aggregate  BDS$2,500,000,000  on\n\nsuch  terms  as  may  be  agreed  upon  between  the  Government  and  the  lender  of\n\nany such sum of money;\n\nAND  WHEREAS  by  section  3  of  the  said Act  it  is  provided  that  any  money\n\nborrowed  under  the  authority  of  the  Act  shall  be  appropriated  and  applied  to  such\n\npurposes  as  Parliament  may  approve  by  resolution  and  that  such  money  and  any\n\ninterest  payable  thereon  is  charged  upon  the  general  revenues  and  assets  of  Barbados;\n\nAND  WHEREAS  the  Government  considers  it  necessary  to  borrow  the  sum  of\n\nUSD$15.0  million  from  First  Citizens  Bank  Limited  in  Trinidad  and  Tobago  by  way\n\nof  a  revolving  credit  line,  the  proceeds  of  which  will  be  used  to  fund  projects  approved\n\nby the Government in accordance with the requisite criteria for the utilization of funding available\n\nto the Government from the Development Bank of Latin America;\n\nAND WHEREAS the said sum of USD$15.0 million is borrowed on the terms and\n\nconditions contained in an Agreement, the main provisions  of which are set out in the Schedule;\n\n\f2\n\nAND  WHEREAS  the  said  sum  of  USD$15.0  million  is  within  the  authorised\n\nborrowing limit given to the Government under section 2 of the said Act;\n\nRESOLVED  therefore  that  Parliament  approve  the  borrowing  of  the  said  sum  of\n\nUSD$15.0  million  from  First  Citizens  Bank  Limited  in Trinidad  and Tobago  by  way  of  revolving  credit\n\nline  on  the  terms  and  conditions  contained  in  the Agreement,  the  main  provisions  of  which  are  set  out\n\nin the Schedule.\n\nA P P R O V E D   b y   t h e   H o u s e   o f   A s s e m b l y   t h i s                                       d a y   o f\n\n                                                , Two thousand and seventeen.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                                  ,\n\nTwo thousand and seventeen.\n\nPresident\n\n\f3\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nGovernment of Barbados.\n\nFirst Citizens Bank Limited in Trinidad and Tobago.\n\nUSD $15,000,000.00\n\nTo provide a revolving line of credit to fund Projects which will be\nexecuted in Barbados and approved by the Government of Barbados\nwhich  meet  all  the  requisite  criteria  for  the  utilization  of  funding\navailable  to  the  Government  from  the  Development  Bank  of\nLatin America.\n\nRevolving Credit Line.\n\n6 months\n\nPrincipal and interest at maturity.\n\nSix  (6)  month  Libor  plus  5.6%  (current  effective  6.891%  per\nannum); to be set 2 days prior to disbursement.\n\nThe rate may be increased by 0.5% to 0.75% per annum in the event\nthat there is a further downgrade in the Borrower's credit rating during\nthe term of the loan.\n\nAllowed without penalty.\n\n1.375% of facility amount due on disbursement. Additionally, a fee\nof 0.25% of the unutilized balance to be payable on a quarterly basis.\n\nLegal  fees  and  charges  as  well  as  costs  and  expenses  arising  from\nthe transaction are for the account of the borrower.\n\nBorrower:\n\nLender:\n\nAmount:\n\nPurpose of loan:\n\nFacility:\n\nTerm:\n\nRepayment:\n\nInterest rate:\n\nPrepayment:\n\nFees:\n\nSecurity:\n\nExecuted Letter of Offer, Promissory Note and Letter of Undertaking.\n\n\f4\n\nConditions precedent:\n\nThe execution of this transaction will be subject to the fulﬁ lment of\nthe following general conditions precedent:\n\n(1)  The duplicate of the Letter of Offer duly signed on the Borrower's\n\nbehalf;\n\n(2)  A gazetted copy of the Parliamentary Resolution authorizing the\n\nborrowings;\n\n(3)  The Loan Agreement and any additional documentation as may\nbe advised by the Lender's legal counsel must be  duly prepared,\nexecuted, stamped and delivered to the Lender;\n\n(4)  A    Letter  of  Undertaking  from  the  Ministry  of  Finance  and\nEconomic Affairs in Barbados indicating that they will utilize a\nDevelopment Bank of Latin America loan facility obtained for\nthe repayment of the proposed facility;\n\n(5)  Obtaining of all approvals, authorizations, consents, exemptions,\nlicenses,  permits  and  registration  (\"collectively  referred  to\nas  \"Consents\")  required  from  any  regulatory,  governmental,\nparliamentary  or  other  authority  or  person  in  order\nfor the Borrower to be a party to the Facility;\n\n(6)  An opinion from the Solicitor General of Barbados conﬁ rming\nthat  the  Government  will  receive  all  requisite  Consents  and\nthat  the  execution  by  the  Borrower  of  the  proposed  Letter\nof  Offer  and  any  related  legal  documentation  as  well  as  the\nperformance  of  the  obligations  undertaken  by  the  Borrower\ndo  not  and  will  not  contravene  any  law,  regulation,  directive\nor judgment to which the Borrower is subject;\n\n(7)  A  letter  from  Development  Bank  of  Latin America  to  the\nGovernment of Barbados authorizing the funding and conﬁ rming\nthat all conditions have been met and stating the disbursement\namount relative to each project;\n\n(8)  Evidence of all required approvals authorizing the execution of\n\nthe project;\n\n\fConditions precedent: - (Cont'd)\n\n# 5\n\n(9)  There must not be prior to disbursement, any further downgrade\nin credit ratings of Barbados or any other change in the ﬁ nancial\ncondition  of  the  Borrower,  or  in  the  ﬁ nancial  or  economic\nconditions in Barbados, which, in the reasonable opinion of the\nLender, may have a material adverse effect (as deﬁ ned in (10)\nbelow) on the ability or willingness of the Borrower to comply\nwith any of its obligations under the Letter of Offer;\n\n(10)  A \"material adverse effect\" means\n\n(a)\n\n(b)\n\n(c)\n\na  material  adverse  effect  on  the  economic  or  ﬁ nancial\ncondition  or  stability  (whether  ﬁ nancial,  political  or\notherwise)  of the Government of Barbados;\n\nthe Borrower's ability to perform its obligations under the\nLetter of Offer or any related loan or security document;\n\nthe  validity  or  enforceability  of  the  Letter  of  Offer  or\nthe  rights  and  remedies  or  benefits  available  to  the\nLender  under  the  Letter  of  Offer  or  under  any  related\nloan or security document.\n\nRepresentations and warranties:\n\nThe  following  representations  and  warranties  are  made\nby the Borrower to the Lender:\n\n(1)  The obligations assumed by the Borrower under the Letter of\nOffer constitute valid, legal, binding and enforceable obligations;\n\n(2)  Neither the execution of the Letter of Offer (or any other document\ncontemplated  therein)  nor  the  performance  or  observance  of\nany obligation contained therein will conﬂ ict with or result in\nany breach of any law, regulation, obligation, duty, agreement\nor other instrument by which the Borrower is bound;\n\n(3)  The entry by the Borrower into the Letter of Offer (or any other\ndocument contemplated therein) and the exercise by it of rights and\nperformance of its obligations under them will constitute private\nand  commercial  acts  performed  for  private  and  commercial\npurposes. The Borrower will not be entitled to claim immunity\non the grounds of sovereign immunity or otherwise from suit,\nexecution, attachment or other legal process in any proceedings\ntaken in relation to the Letter of Offer or any other ﬁ nancing or\nsecurity document made in relation to the Facility thereunder;\n\n\fRepresentations and warranties:\n- (Concl'd)\n\n# 6\n\n(4)  There  exists  no  litigation  or  administrative  or  arbitration\nproceedings  (pending  or  threatened  in  writing)  against\nor  affecting  the  Borrower  before  any  court,  government,\nauthority  or  arbitrator  which  would  have  a  material  adverse\neffect on the ﬁ nancial condition of the Borrower;\n\n(5)  The Borrower is not in any breach of or in any default under\nany law, statute, regulations, mortgage, charge, lien, agreement\nor  other  instrument,  arrangement,  obligation  or  duty\nby which it is bound;\n\n(6)  The Borrower also afﬁ rms that it will use all of the proceeds\n\nof the loan only for the purposes speciﬁ ed;\n\n(7)  The  Borrower  agrees  to  provide  the  Lender  with  prompt\nnotice  of  any  material  litigation  proceedings  or  dispute\nthreatened  in  writing  or  commenced  against  the  Borrower\nand  to  provide  all  information  reasonably  requested  by\nthe  Lender  concerning  the  nature  and  status  of  the  same.\n\nEvents of default:\n\nThe following are the events of default:\n\n(1)  Ceasing  to  be  a  Member  of  the  Development  Bank  of  Latin\n\nAmerica;\n\n(2)  Any default of the Borrower in the stipulated payments when due;\n\n(3)  Any  statement,  certiﬁ cate,  warranty  or  representation  given\nin pursuance of the Letter of Offer proving to be untrue, false\nor misleading in any material respect;\n\n(4)  Breach of any other of the Borrower's obligations  under  the\nfacility for more than fourteen days after written notice from the\nLender to the Borrower requiring such breach to be remedied;\n\n(5)  Any creditor or creditors of the Borrower becoming entitled to\ndeclare  that  any  debt  or  part  of  the  debt  remains  unpaid  in\nwhole or in part;\n\n\fEvents of default: - (Concl'd)\n\n# 7\n\n(6)  Any security agent, trustee or a holder or holders under a lien,\nloan  or  other  arrangement  declaring  a  breach  and  legally\nentitled  to  accelerate  payment  obligations  under  these\narrangements in which the Borrower is a party and which would\nhave  a  material  adverse  effect  (as  deﬁ ned  under  conditions\nprecedent at 10 above) on the Borrower's ability to make the\npayments as stipulated or to repay the facility under the Letter\nof Offer;\n\n(7)  Default  by  the  Borrower  in  the  payment  of  any  of  its  debt\nobligations  or  admission  by  the  Borrower  of  its  inability\nto pay its debts generally as they fall due;\n\n(8)  The Letter of Offer or any related loan or security document\nshall fail to be in full force and effect if the Borrower denies or\nrepudiates its obligations thereunder or does any act or thing\nevidencing  an  intention  to  deny  or  repudiate  its  obligations\nthereunder;\n\n(9)  The Borrower making any arrangement or assignment for the\nbeneﬁ t  of  creditors  or  to  compromise  with  its  creditors  with\na  view  to  general  adjustment  or  rescheduling  its  payments;\n\n(10)  The  Borrower  declares  a  general  suspension  of  or  a\nmoratorium on payments of the Facility or on the indebtedness\n of the Borrower;\n\n(11)  Any  proceedings  or  action  taken  by  or  against  the  Borrower\narising  from  its  defaulting  in  the  payment  of  its  debt\nobligations or its inability to pay its debts;\n\n(12)  Any  circumstance  or  change  of  situation  of  the  Borrower  as\nrepresented or warranted by the Borrower which in the opinion\nof  the  Lender,  is  likely  to  materially  or  adversely  impact  on\nthe  ability  or  willingness  of  the  Borrower  to  perform  any  or\nall of its obligations under the Facility Letter, any related Loan\nAgreement  or  other  related  legal  documentation  as  the\ncase may be;\n\n(13)  An  event  or  circumstance  at  any  time  in  which  it\nbecomes  unlawful  for  the  Borrower  to  perform  or  comply\nwith  any  or  all  of  its  obligations  under  the  Letter  of  Offer.\n\n\fPriority of the loan:\n\nTaxation:\n\n# 8\n\nThe  Borrower  shall  not  enter  into  any  obligations  which  have\npriority  to  this  debt  without  the  Lender's  stated  written  consent.\nWhere  this  condition  is  breached,  the  following  shall  apply:\n\n(1)\n\nShould the Borrower enter into any subsequent agreement with\nany  other  lender  during  the  term  of  the  facility  letter  which\nprovides  for  benefits  or  terms  more  favourable  that  those\ncontained  in  the  Facility  Letter,  then  the  Facility  Letter\nshall  be  deemed  to  be  modiﬁ ed  to  provide  the  Lender  with\nthose  more  favourable  beneﬁ ts  and  terms  including  but  not\nhowever limited to any terms by which the Borrower undertakes\nto  enhance  the  other  lender's  collateral;  or  to  grant  the  other\nlender a security interest in any ﬁ xed assets of the Borrower.\n\n(2)  The Borrower shall notify the Lender promptly of the existence\nof  any  more  favourable  beneﬁ ts  and  terms  mentioned  at  (1)\nabove.  Any collateral enhancement to security interest granted\nby  the  Borrower  to  the  Lender  pursuant  to  this  clause  shall\nrank  pari-passu  with  the  collateral  enhancement  or  security\ninterest granted by the Borrower to the other lender.  If requested\nin writing by the Lender, the Borrower shall execute an amendment\nto  the  Facility  Letter  to  include  the  more  favourable  terms\nand conditions and all costs associated with such a transaction\nwill be for the account of the Borrower.\n\nAll  payments  by  the  Borrower  will  be  made  free  and  clear  of\nall present and future taxes, withholdings or deductions of whatsoever\nnature. The  Borrower  will  also  be  responsible  for  the  due  payment\nof  all  levies,  imposts,  taxes  and  duties  or  charges  incurred  in\nconnection with the facility.\n\nGoverning law:\n\nThe law of Trinidad and Tobago.\n\n\f9\n\nADDENDUM\n\nThis Resolution seeks the approval of Parliament for the borrowing of USD$15.0 million\n\nby way of a revolving line of credit from First Citizens Bank Limited in Trinidad and Tobago.\n\nThe  sum  of  USD$15.0  million  is  within  the  limit  of  the  Special  Loans Act,  Cap.  105.\n\nThe proceeds of the loan will be used to fund projects approved by the Government of\n\nBarbados  which  meet  all  the  requisite  criteria  for  the  utilization  of  funding  available\n\nto the Government of Barbados from the Development Bank of Latin America.\n\n"
}