{
  "bill_id": 186,
  "slug": "barbados-revenue-authority-amendment-bill-2017",
  "title": "Barbados Revenue Authority (Amendment) Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/2a5d388ae41582a58d2c722ad357ee12.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-02-15",
  "first_reading": "2017-01-24",
  "second_reading": "2017-02-14",
  "gazette_date": "2017-02-06",
  "passed_date": "2017-03-08",
  "markdown": "2017-01-03\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Barbados Revenue Authority Act (Act 2014-1) to\nmake  provision  for  the  issuance  of  tax  clearance  certificates  and  for  related\nmatters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\nShort title\n\nAmendment of section 2 of Act 2014-1\n\nInsertion of section 8A into Act 2014-1\n\nAmendment of First Schedule to Act 2014-1\n\nAmendment to certain enactments\n\nSCHEDULE\n\nCONSEQUENTIAL AMENDMENTS\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Barbados Revenue Authority Act (Act 2014-1) to make\nprovision for the issuance of tax clearance certificates and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment) Act, 2017.\n\nThis  Act  may  be  cited  as  the  Barbados  Revenue  Authority\n\nAmendment of section 2 of Act 2014-1\n\nSection 2 of the Barbados Revenue Authority Act, in this Act referred\n2.\nto as the principal Act, is amended by inserting in the appropriate alphabetical\norder, the following definition:\n\n“ “tax clearance certificate” means a certificate issued by the Authority\n\npursuant to section 8A;”.\n\nInsertion of section 8A into Act 2014-1\n\n3.\n8, the following as section 8A:\n\nThe principal Act is amended by inserting immediately after section\n\n“Commissioner to issue tax clearance certificates\n\n8A.(1)\nclearance certificate and the Commissioner is satisfied that\n\nWhere an application is made to the Commissioner for a tax\n\n(a)\n\n(b)\n\n(c)\n\nno taxes are due under the taxing Acts;\n\nall taxes, interest and penalties which have accrued under the\ntaxing Acts have been paid; or\n\nan amount satisfactory to the Commissioner that is equal to\nnot less than 10 per cent of the taxes, interest and penalties\nwhich have accrued under the taxing Acts has been paid and\nan agreement has been executed with the Authority for the\npurpose of making scheduled payments to liquidate the sums\nowed,\n\n\f5\n\nthe Commissioner shall issue the tax clearance certificate.\n\nNotwithstanding  paragraph  (c)  of  subsection  (1),  where  an\n(2)\napplication is made to the Commissioner for a tax clearance certificate\nto facilitate a conveyance of land, an applicant shall\n\n(a)\n\n(b)\n\n(c)\n\npay all tax, interest and penalties which have accrued under\nthe Land Tax Act, Cap. 78A;\n\nrepay all input tax in accordance with section 48(4) of the\nValue Added Tax Act, Cap. 87, where such tax was previously\nallowed under section 46(2) of that Act; and\n\npay an amount satisfactory to the Commissioner that is equal\nto not less than 10 per cent of the taxes, interest and penalties\nwhich have accrued under the other taxing Acts and execute\nan agreement with the Authority for the purpose of making\nscheduled payments to liquidate the sums owed under those\nActs.\n\nA tax clearance certificate shall bear the date of its issue, state\n\n(3)\nthe period from that date for which it is valid and certify that\n\n(a)\n\n(b)\n\n(c)\n\nno taxes are due under the taxing Acts;\n\nall taxes, interest and penalties which have accrued under the\ntaxing Acts have been paid; or\n\na percentage of the taxes, interest and penalties which have\naccrued under the taxing Acts has been paid.\n\n(4)\n\nFor the purposes of this section,\n\n“conveyance”  has  the  meaning  assigned  to  it  by  section  2  of  the\n\nProperty Act, Cap. 236; and\n\n“taxing Acts” means\n\n(a)\n\nthe Excise Tax Act (Act 2015-32);\n\n\f6\n\n(b)\n\nthe Income Tax Act, Cap. 73;\n\n(c)\n\nthe Land Tax Act, Cap. 78A;\n\n(d)\n\nthe Value Added Tax, Cap. 87,\n\nand any subsidiary legislation made thereunder.”.\n\nAmendment of First Schedule to Act 2014-1\n\n4.\nparagraph 10 and substituting the following:\n\nThe  First  Schedule  to  the  principal  Act  is  amended  by  deleting\n\n“10. Excise Tax Act (Act 2015-32)”.\n\nAmendment to certain enactments\n\n5.\namended in the manner set out opposite thereto in the second column.\n\nThe  enactments  set  out  in  the  first  column  of  the  Schedule  are\n\n\f7\n\n Column 1Enactments1.  Land Tax Act, Cap. 78AColumn 2Amendments1. In section 41, delete subsection (1)(a)and substitute the following: \"(1) Subject to subsection (1A), theRegistrar shall not stamp as duly stamped or as not chargeable with any duty under the Stamp Duty Act, Cap. 91any conveyance of land or any lease of land for a period exceeding 3 years unlessthere is produced to him(a) a valid tax clearance certiﬁ cate issued in accordance with section 8A of the Barbados Revenue Authority, Act (Act 2014-1) that (i) includes a statement that all tax due on the land has been paid or that no tax is due on the land;(ii) bears the date of its issue; and(iii) states a period from the date of its issue for which it shall be valid; and\".SCHEDULE(Section 5)CONSEQUENTIAL AMENDMENTS\f8\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosSchedule - (Cont'd)Column 1Enactments2.  Liquor Licenses Act, Cap. 182Column 2Amendments2. In section 30, delete subsections (2), (3) and (4) and substitute the following: \"(2) Subject to subsection (4), noapplication for the renewal of a licence of the class specified in paragraph (b), (d), (e), (g) or (h) of section 4(1) shall be granted unless the applicant furnishes to the licensing authority a tax clearance certificate issued in accordance with section 8A of the Barbados RevenueAuthority Act (Act 2014-1) and a certiﬁ cate from the Director of National Insurance stating that all liabilities for the payment of taxes and national insurance contributionsin respect of the business or trade to which the application for the renewal of the licence relates have been discharged. (3) The tax clearance certificate and the certificate referred to in subsection(2) shall be issued by the RevenueCommissioner and the Director of NationalInsurance respectively, upon satisfaction that all liabilities for the payment of taxes or national insurance contributions, as thecase may be, have been discharged. (4) Where an applicant for the renewal of a liquor licence is not the fee simple owner of premises on which the businessor trade to which the application for renewalrelates is located, the requirement to showthat an amount has been paid to liquidateany tax, interest or penalties which haveaccrued under the Land Tax Act, Cap. 78A, shall not apply to such an applicant.\".\f9\n\n Schedule - (Cont'd)Column 1Enactments3.  Property Transfer Tax Act, Cap. 84AColumn 2Amendments3. In section 13,(a) delete sub-paragraph (iii) of subsection (1) and substitute the following:\"(iii) subject to subsections (2) and (3) and in respect of a transfer where the transferor is a person to whom section 48(3) of the Value Added Tax Act Cap. 87 applies, there is presented to the Registrar a tax clearance  certificate issued in  accordance with section  8A of the Barbados  Revenue Authority  (Act 2014-1) that includes a statement that(A) no input tax has been previously allowed under section 46(2) of the Value Added Tax Act; or (B) input tax previously allowed under section 46(2) of the Value Added Tax  Act,  Cap. 87 has been repaid in accordance with  section 48(4) of the Value Added Tax Act, Cap. 87.\";\f10\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosSchedule - (Concl'd)Column 1Enactments3. Property Transfer Tax Act, Cap. 84A - (Concl'd)Column 2Amendments(b) delete subsection (3) and substitute  the following: \"(3) Where  the  declaration  referred to in subsection (2) states that no input tax has been allowed, the statement referred to in sub-paragraph (iii) of subsection (1) is not required to be included on the tax clearance certificatein accordance with that sub-paragraph.\".4. In section 13A, delete subsection (2)and substitute the following: \"(2) The stamp of the Registrar on a document or instrument of transfer denoting the issuance of a tax clearance certiﬁ cate that includes a statement undersub-paragraph (iii)(B) of section 13(1) shall operate to release the land fromthe charge under subsection (1).\".\f11\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2017.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2017.\n\nPresident\n\n"
}