{
  "bill_id": 188,
  "slug": "minimum-wage-pay-bill-2017",
  "title": "Minimum Wage Pay Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/28601e67ca4cd024137c48f875457e27.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-01-18",
  "first_reading": "2017-02-01",
  "second_reading": "2017-01-17",
  "gazette_date": "2016-11-28",
  "passed_date": "2017-02-01",
  "markdown": "Explanatory Memorandum after pages 22\n\nOBJECTS AND REASONS\n\nThis Bill would make provision for\n\n(a) the establishment of a Minimum Wage Board;\n\n(b) the making of Minimum Wage Orders by the Minister to establish either\na minimum wage to be applied generally or a minimum wage for employees\nin a specified group or sector;\n\n(c) the repeal of the Wages Councils Act, Cap. 362; and\n\n(d) related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nEstablishment of a Minimum Wage Board\n\nFunctions of the Board\n\nThe Board to make recommendations to the Minister\n\nMinimum Wage Orders\n\nPublic notification\n\nRequirement to pay minimum wage\n\nRecords\n\n10.\n\nDuty of employer to inform employee of an existing Minimum Wage Order\n\n11.\n\nPowers of the Chief Labour Officer\n\n12.\n\nPower to institute proceedings\n\n13.\n\nExpenses of the Board\n\n14.\n\nOffences\n\n15.\n\nDuty of non-disclosure\n\n\f3\n\n16.\n\nLimitation period\n\n17.\n\nRegulations\n\n18.\n\nAct binds the Crown\n\n19.\n\nSavings\n\n20.\n\nRepeal Cap. 362\n\nSCHEDULE\n\nConstitution and management of the Board\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to make provision for\n\n(a) the establishment of a Minimum Wage Board;\n\n(b) the making of Minimum Wage Orders by the Minister to establish either\na minimum wage to be applied generally or a minimum wage for employees\nin a specified group or sector;\n\n(c) the repeal of the Wages Councils Act, Cap. 362; and\n\n\f6\n\n(d) related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Minimum Wage Act, 2017.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Board” means the Minimum Wage Board established under section 3;\n\n“CARICOM”  means  the  Caribbean  Community,  established  by  the  Revised\nTreaty of Chaguaramas signed in the Bahamas on the 5th day of July, 2001,\nwhich includes the members of the CARICOM Single Market and Economy\nas set out by section 5 of the Caribbean Community Act, Cap. 15;\n\n“Chief  Labour  Officer”  includes  the  Deputy  Chief  Labour  Officer,  a  Labour\nOfficer or any person authorised in writing by the Chief Labour Officer to\nact on his behalf;\n\n“employee” has the meaning assigned to it by section 2 of the Employment Rights\n\nAct (Act 2012- 9 );\n\n“employer” means a person who employs one or more employees and includes\nany  agent,  manager  or  representative  of  that  person  where  the  agent,\nmanager  or  representative  is  directly  or  indirectly  responsible  for  the\npayment, whether in whole or in part, of the remuneration of an employee;\n\n“national  minimum  wage”  means  a  sum  prescribed  under  a  Minimum  Wage\nOrder  as  the  lowest  sum  which  an  employer  shall  pay  an  employee  in\nBarbados.\n\n\f7\n\nEstablishment of a Minimum Wage Board\n\n3.(1)\nThere  is  hereby  established  a  Minimum  Wage  Board  to  advise  the\nMinister on all matters relating to the fixing of a minimum wage including the\n\n(a)\n\n(b)\n\n(c)\n\nnational minimum wage to be paid to an employee;\n\nminimum wage to be paid to a specified group or sector of employees;\nand\n\nterms and conditions of service and the minimum work conditions of\nan employee to whom a minimum wage applies.\n\nThe Schedule has effect with respect to the constitution and management\n\n(2)\nof the Minimum Wage Board.\n\nFunctions of the Board\n\n4.\n\nThe Board shall perform the following functions:\n\n(a)\n\n(b)\n\nobtain  and  record  information  in  relation  to  wages,  other  forms  of\nbenefits, terms and conditions of service and all other factors affecting\nthe circumstances of employment and remuneration of employees paid\na minimum wage;\n\nkeep  the  information  referred  to  in  paragraph  (a)  under  continuous\nreview  and  periodically  make  reports  to  the  Minister  on  this\ninformation;\n\n(c)\n\nconsider and advise the Minister on all matters relating to\n\n(i)\n\na national minimum wage; or\n\n(ii)\n\na minimum wage for a specified group or sector of employees;\n\n(d)\n\nrecommend  a  national  minimum  wage  or  a  minimum  wage  for  a\nspecified group or sector of employees;\n\n\f8\n\n(e)\n\nrecord and keep under review any minimum wage fixed by the Minister\nas  well  as  the  minimum  terms  and  conditions  of  service  in  relation\nthereto; and\n\n(f)\n\nmake recommendations to the Minister in respect of a minimum wage\nand the minimum terms and conditions of service in relation thereto.\n\nThe Board to make recommendations to the Minister\n\n5.(1)\nThe Board may, where it is of the opinion that the Minister should fix\na minimum wage or make specific provision regarding the minimum terms and\nconditions of service in respect of employees generally or in respect of a specified\ngroup or sector of employees, forward a recommendation to the Minister and the\nrecommendation may include\n\n(a)\n\n(b)\n\nthe proposed minimum wage;\n\nthe proposed change in the minimum terms and conditions of service\nof employees generally or in relation to a specified group or sector of\nemployees; and\n\n(c)\n\nany other related matter.\n\nBefore making a recommendation under subsection (1), the Board shall\n\n(2)\nconsider\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe  rate  of  inflation,  cost  of  living  and  general  level  of  wages  in\nBarbados;\n\ncontributions  payable  and  benefits  provided  under  the  National\nInsurance Act, Cap. 47;\n\nthe  taxes  to  be  deducted  in  accordance  with  the  provisions  of  the\nIncome Tax Act, Cap. 73;\n\nfactors,\n\neconomic\nrequirements  of  economic\nthe\ndevelopment, level of productivity and the desirability of attaining and\nmaintaining high levels of employment;\n\nincluding\n\n\f9\n\n(e)\n\npayment for similar jobs or tasks in other countries in CARICOM, the\nCommonwealth or similar jurisdictions; and\n\n(f)\n\nany other relevant or related factors.\n\nThe Minister may accept the recommendations or advice of the Board or\n\n(3)\nimplement such measures as he considers appropriate in the circumstances.\n\nMinimum Wage Orders\n\n6.(1)\n\nThe Minister may by Order\n\n(a)\n\n(b)\n\nprescribe a national minimum wage and specify the minimum terms\nand conditions of service in respect of all employees; or\n\nprescribe  a  minimum  wage  and  specify  the  minimum  terms  and\nconditions of service in respect of employees in a specified group or\nsector.\n\n(2)\n\nThe Minister may amend or revoke any Order made under subsection (1).\n\nWhere the Minister makes an Order under subsection (1)(b) the minimum\n(3)\nwage to be paid to that specified group or sector of employees shall not be less\nthan the national minimum wage.\n\nPublic notification\n\nBefore making a Minimum Wage Order under section 6 the Minister\n7.(1)\nshall publish a notice of his intention to make the Minimum Wage Order in a\nnewspaper in circulation in Barbados.\n\n(2)\n\nThe notice referred to in subsection (1) shall state\n\n(a)\n\n(b)\n\nwhere a copy of the proposed Minimum Wage Order may be obtained;\nand\n\nthe minimum period, being no less than 40 days from the date of the\ninitial notification, during which objections may be received.\n\n\f10\n\nA person objecting to the making of a Minimum Wage Order shall forward\n\n(3)\nhis objection to the Minister, and that objection shall state\n\n(a)\n\n(b)\n\n(c)\n\nthe grounds of his objection;\n\nthe nature of his interest in the matter; and\n\nany additions or amendments which should be made to the Order.\n\nThe Minister shall refer all objections received under subsection (3) to the\n\n(4)\nBoard for the review of the Board.\n\nThe Board shall submit their comments on the objections to the Minister\n(5)\nand may also submit such additions or amendments to the Minimum Wage Order\nas the Board considers necessary and the Minister may, after considering all the\ndocumentation from the Board, make the Minimum Wage Order in such terms\nas he thinks fit.\n\nRequirement to pay minimum wage\n\nAn employer to whom this Act applies shall not pay to any employee\n8.(1)\nany sum which is less than the sum stipulated in a Minimum Wage Order and\nshall  not  retain  or  withhold  any  sum  therefrom  other  than  an  amount  to  be\ndeducted under the provisions of the Protection of Wages Act, Cap. 351 or in\naccordance with the provisions of any other enactment.\n\n(2)\n\nWhere an employer pays an employee\n\n(a)\n\n(b)\n\n(c)\n\nan incentive based payment or commission;\n\na monetary allowance;\n\na payment for overtime worked; or\n\n(d)\n\nany other additional sums\n\nthe payment of these sums shall not be discontinued, but shall, where the terms\nand conditions of the employee’s contract and the duties performed so require,\ncontinue to be paid in addition to the sum prescribed in the Minimum Wage Order.\n\n\f11\n\nRecords\n\nAn employer to whom this Act applies shall keep such records as are\n9.\nnecessary to show that the required wage is being paid to each employee to whom\nthis Act applies and these records shall be kept in the form or manner required\nby the Chief Labour Officer.\n\nDuty of employer to inform employee of an existing Minimum Wage\nOrder\n\nAn employer to whom this Act applies shall, where a Minimum Wage\n10.(1)\nOrder will affect the remuneration or conditions of service of an employee, notify\nthat employee of the making of the Minimum Wage Order.\n\n(2)\n\nAn employer referred to in subsection (1)\n\n(a)\n\n(b)\n\nshall affix a copy of the Minimum Wage Order in a place where it will\nbe easily seen and can be easily read by an employee ; and\n\nmay also send copies of the Minimum Wage Order by electronic means\nto an employee.\n\nPowers of the Chief Labour Officer\n\n11.\nThe  Chief  Labour  Officer  shall,  in  addition  to  any  other  powers\nprovided for in the provisions of the Labour Department Act, Cap. 23 or under\nany other enactment, have the power to\n\n(a)\n\nrequire the production of wage sheets or other records of wages kept\nby an employer as well as the production of other related records that\nemployers  are  required  to  keep  under  this  Act  and  to  inspect  and\nexamine  those  sheets  or  records  and  to  copy  any  material  or  part\nthereof;\n\n(b)\n\nat a reasonable time, enter any premises where an employer carries on\nhis business or enter any premises which the Chief Labour Officer has\nreasonable cause to believe is being used by the employer to provide\n\n\f12\n\n(c)\n\n(d)\n\n(e)\n\nliving accommodation an for employee to whom a Minimum Wage\nOrder applies;\n\nexamine,  either  alone  or  in  the  presence  of  any  other  person,  with\nrespect  to  any  matter  under  this  Act,  any  person  whom  he  has\nreasonable cause to believe to be or to have been an employee to whom\na Minimum Wage Order applies or applied; or\n\nexamine,  either  alone  or  in  the  presence  of  any  other  person,  with\nrespect to any matter under this Act, an employer or an agent of the\nemployer, employed in the employer’s business; and\n\nrequire  every  person  who  is  examined  pursuant  to  paragraph  (c)  or\nparagraph  (d)  to  sign  a  declaration  of  the  truth  in  respect  of  the\ninformation he has given in the matter, but no person shall be required\nto incriminate himself under this paragraph.\n\nPower to institute proceedings\n\nThe Chief Labour Officer may institute proceedings in his own name\n12.(1)\nagainst an employer for any offence under this Act and may appear and conduct\nthe proceedings including civil proceedings to collect sums due to an employee\nwhere  an  employer  pays  the  employee  less  than  the  amount  prescribed  by  a\nMinimum Wage Order.\n\nThe power given under subsection (1) for the recovery of sums due from\n(2)\nan  employer  to  an  employee  shall  not  be  in  derogation  from  any  right  of  the\nemployee to recover such sums by civil proceedings.\n\nExpenses of the Board\n\n13.\nThere shall be paid out of the Consolidated Fund monies voted for the\npurpose by Parliament to pay any expenses incurred by the Board or generally\nfor the purposes of carrying into effect the purposes of this Act.\n\n\f13\n\nOffences\n\n14.(1)\n\nA person who\n\n(a)\n\nfails to comply with his duty as an employer, or an agent of an employer\n\n(i)\n\nto keep the records required under section 9; or\n\n(ii)\n\nto notify an employee of the matters required under section 10;\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nmakes or causes to be made, or knowingly allows to be made in any\nrecord required to be kept under this Act by an employer an entry which\nhe knows to be false in a material particular;\n\nfor purposes connected with this Act produces or furnishes, any wage\nsheet,  record,  list  or  information  which  he  knows  to  be  false  in  a\nmaterial particular;\n\npays an employee less than the sum prescribed by a Minimum Wage\nOrder irrespective of whether the person making the payment is the\nemployer, or an employee or agent of the employer;\n\ncontrary to section 8(2), reduces or adjusts overtime rates or additional\nsums usually paid to an employee by contract or custom due to the\nrequirement to pay a minimum wage; or\n\nobstructs the Chief Labour Officer, Deputy Chief Labour Officer or a\nLabour Officer in the exercise of any power conferred under section\n11\n\nis guilty of an offence and is liable on summary conviction to a fine of $10 000\nor to imprisonment for a term of 2 years or to both.\n\nWhere a person is convicted of an offence under subsection (1) in respect\n(2)\nof which the court imposes a fine and that person fails to comply with the Order\nof the court in respect of that fine, that person is liable to a further fine of $500\nfor each day during which the failure to comply continues.\n\n\f14\n\nDuty of non-disclosure\n\n15.(1)\n\nA person who is\n\n(a)\n\n(b)\n\na member of the Board; or\n\ninvited to and was present at a Board meeting;\n\nand who discloses any information or the contents of any document which has\nbeen furnished by or to the Board, except with the written consent of the person\nto whom the information belongs, is guilty of an offence and is liable on summary\nconviction to a fine of $10 000 or imprisonment for a period of 2 years or to both.\n\nWhere a person is convicted of an offence under subsection (1), in respect\n(2)\nof which the court imposes a fine and that person fails to comply with the Order\nof the court in respect of that fine, that person is liable to a further fine of $500\nfor each day during which the failure to comply continues.\n\nLimitation period\n\n16.\nthe expiration of one year from the date of the commission of the offence.\n\nNo prosecution for any offence under this Act shall be instituted after\n\nRegulations\n\n17.(1)\nThe Minister may make regulations for carrying out the purposes of\nthis  Act,  and  to  prescribe  anything  which  is  required  or  authorised  to  be\nprescribed under this Act.\n\n(2)\n\nAll regulations made under this Act shall be subject to negative resolution.\n\nAct binds the Crown\n\n18.\n\nThis Act binds the Crown.\n\n\f15\n\nSavings\n\n19.\n\nAny\n\n(a)\n\n(b)\n\ndecision of a Wages Council; or\n\nOrder made by the Minister under the Wages Council Act, Cap. 362\n\nmade prior to the commencement of this Act, shall be in force and shall remain\nin force until it is reviewed by the Board and, where necessary, revoked by the\nMinister to effect the purposes of this Act.\n\nRepeal Cap. 362\n\n20.\n\nThe Wages Council Act, Cap. 362 is hereby repealed.\n\n\f16\n\nSCHEDULE\n\nConstitution and management of the Board\n\n(Section 3(2))\n\nConstitution and appointment of the Board\n\n1.\nappointed by the Minister by an instrument in writing.\n\nSubject  to  paragraph  2,  the  Board  shall  be  comprised  of  9  persons\n\nComposition of the Board\n\n2.\n\nThe Board shall be comprised of\n\n(a)\n\n(b)\n\n(c)\n\nsuch a number of persons being no more than 3 persons chosen by the\nMinister;\n\nsuch  a  number  of  persons  being  no  more  than  3  persons  ,who  are\nrepresentative of employers to whom the Act applies; and\n\nsuch  a  number  of  persons  being  no  more  than  3  persons,  who  are\nactively  involved  with  or  who  hold  office  in  an  organization  which\nrepresents employees to whom this Act applies.\n\nRequirement for consultation\n\n3.\nthe Minister shall\n\nBefore appointing a person under paragraph 2(b) or paragraph 2(c)\n\n(a)\n\n(b)\n\nconsult with organizations or associations which represent employers\nand organizations or associations which represent employees; and\n\nreceive  written  recommendations  from  those  organizations  or\nassociations.\n\n\f17\n\nChairman and Deputy Chairman\n\n4.(1)\nand another member to be Deputy Chairman.\n\nThe Minister shall appoint a member to be the Chairman of the Board\n\nThe  Board  shall  appoint  from  among  its  members  a  person  to  be  the\n\n(2)\nSecretary of the Board.\n\nTenure\n\n5.(1)\n\nA member of the Board shall hold office for a term of 3 years.\n\nA member is eligible for re-appointment for a further term on the expiration\n\n(2)\nof the term of his appointment.\n\nVacancy in the Board\n\n6.(1)\nin the case of\n\nA vacancy shall be deemed to arise in the membership of the Board\n\n(a)\n\n(b)\n\nthe death or resignation of a member;\n\nthe absence of a member without leave of the Minister from 3 or more\nconsecutive meetings of the Board; or\n\n(c)\n\na revocation under paragraph 7.\n\n(2)\n\nA person appointed to fill a vacancy in the membership of the Board shall\n\n(a)\n\nbe  from  the  same  category  of  persons  in  paragraph  2  as  the  former\nmember; and\n\n(b)\n\nbe eligible for re-appointment.\n\nA person appointed to fill a vacancy by the Minister shall hold office only\n\n(3)\nfor the unexpired portion of the term of that former member.\n\n\f18\n\nRevocation of appointment\n\nThe Minister may by an instrument in writing, revoke the appointment\n7.\nof the Chairman, Deputy Chairman or any other member if he is satisfied that the\nmember\n\n(a)\n\n(b)\n\nfails to carry out any of the functions conferred or imposed on him\nunder the Act,\n\nis incapacitated physically or mentally to such an extent as to impair\nhis  ability  to  perform  his  duties,  or  is  otherwise  unable  or  unfit  to\nperform his duties;\n\n(c)\n\nis bankrupt; or\n\n(d)\n\nis guilty of serious misconduct in relation to his duties under this Act.\n\nGazetting of appointments\n\n8.\nany member of the Board shall be published in the Official Gazette.\n\nThe appointment, temporary appointment, removal or resignation of\n\nLeave of absence\n\n9.\nThe Minister may in writing grant a leave of absence to any member,\nand in case of the inability of any member of the Board to act, the Minister may\nappoint another person to act temporarily in the place of that member.\n\nResignation\n\n10.(1)\nThe Chairman may, at any time resign his office by an instrument in\nwriting addressed to the Minister, and such resignation shall take effect from the\ndate of the receipt of the instrument by the Minister, and the Chairman ceases to\nbe Chairman unless some other date is stated in the instrument, and the Chairman\nalso ceases to be a member of the Board.\n\nAny member other than the Chairman may at any time resign his office by\n(2)\nan instrument in writing addressed to the Chairman, who shall forthwith forward\n\n\f19\n\nit to the Minister, and that member shall cease to hold office as from the date of\nthe receipt of the instrument by the Minister, unless some other date is stated in\nthe instrument.\n\nTemporary Appointment\n\nIn  the  absence  of  a  member,  or  in  case  of  his  inability  to  act,  the\n11.(1)\nMinister  may  by  an  instrument  in  writing  appoint  another  person  to  act\ntemporarily in the place of that member.\n\nA person appointed to fill a temporary vacancy in the membership of the\n\n(2)\nBoard shall\n\n(a)\n\nbe  from  the  same  category  of  persons  in  paragraph  2  as  the  former\nmember; and\n\n(b)\n\nbe eligible for re-appointment.\n\nMeetings of Board\n\nThe Board shall meet as often as may be necessary or expedient for\n12.(1)\nthe transaction of its business, and such meetings shall be held at such places and\ntimes and on such days as the Board may determine.\n\nThe Chairman shall preside at the meetings of the Board and in the absence\n\n(2)\nof the Chairman, the Deputy Chairman shall preside.\n\nWhere  neither  the  Chairman  nor  the  Deputy  Chairman  is  present  the\n(3)\nmembers present and constituting a quorum may elect a person from among the\nmembers who shall preside over that meeting as chairman.\n\nThe  Chairman,  or  if  he  is  for  any  reason  whatsoever  unable  to  act  the\n(4)\nDeputy Chairman, may by issuing an instrument in writing to each member call\na special meeting of the Board at anytime.\n\nAny member of the Board may by an instrument in writing addressed to\n(5)\nthe Chairman request a special meeting of the Board and the Chairman, or if he\nis  for  any  reason  whatsoever  unable  to  act,  the  Deputy  Chairman  may  call  a\n\n\f20\n\nspecial  meeting  of  the  Board  or  notify  the  member  that  the  request  has  been\ndenied.\n\nAttendance of non-members at meetings\n\n13.(1)\nThe Chairman may by an instrument in writing require any person to\nattend a meeting of the Board where the Board considers it necessary to do so.\n\nA person referred to in sub-paragraph (1) may take part in the deliberations\n\n(2)\nof the Board but shall not vote on any matter.\n\nDecisions of the Board\n\nA decision of the Board shall be by a majority of votes and, in any\n14.\ncase in which the voting is equal, the Chairman, the Deputy Chairman or the\ntemporary Chairman presiding at the meeting has , in addition to his original vote,\na second or casting vote.\n\nMinutes\n\n15.(1)\nMinutes of a meeting of the Board shall be kept by the secretary of\nthe Board and those minutes shall be confirmed by a decision of Board at the\nnext meeting of Board.\n\nThe  Board  shall  forward  a  copy  of  the  confirmed  minutes  from  each\n(2)\nmeeting to the Minister within one month of the date of the meeting at which the\nminutes were confirmed.\n\nQuorum\n\n16.\n\nA quorum shall consist of 5 members including\n\n(a)\n\nthe Chairman, and in the absence of\n\n(i)\n\nthe Chairman, the Deputy Chairman; or\n\n(ii)\n\nboth  the  Chairman  and  the  Deputy  Chairman,  any  person\nappointed to act as chairman for that meeting;\n\n\f21\n\n(b)\n\na person appointed under paragraph 2(a)\n\n(c)\n\na person appointed under paragraph 2(b); and\n\n(d)\n\na person appointed under paragraph 2(c).\n\nSeal and execution of documents\n\nThe seal of the Board shall be kept in the custody of the Chairman,\n17.(1)\nDeputy Chairman or such officer of the Board as the Board approves, and may\nbe affixed to documents or instruments pursuant to a resolution of the Board in\nthe presence of the Chairman or Deputy Chairman and the Secretary.\n\nThe  seal  of  the  Board  shall  be  authenticated  by  the  signature  of  the\n\n(2)\nChairman and Secretary.\n\nAll documents or instruments, other than those required by law to be under\n(3)\nseal, and all decisions of the Authority may be signified under the hand of the\nChairman or Deputy Chairman.\n\nSignature\n\n18.\nAll decisions made by the Board and all documents of the Board shall\nbe signed by the Chairman, and in his absence the Deputy Chairman, and in the\nabsence of the Chairman and Deputy Chairman, such documents shall be signed\nby any person authorised to act as chairman.\n\nProceedings of the Board\n\n19.(1)\nSubject to this Schedule, the Board may regulate its own procedure\nand may delegate to any of its members or to a committee of its members the\npower and authority to carry out, on behalf of the Board, such duties as the Board\ndetermines.\n\nThe Minister may assign such persons as are necessary to assist the Board\n\n(2)\nwith discharging its functions.\n\n\f22\n\nRemuneration\n\n20.\nentitled to such remuneration and allowances as the Minister may determine.\n\nThe Chairman, Deputy Chairman and other members of the Board are\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2017.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2017.\n\nPresident\n\n\fEXPLANATORY MEMORANDUM\n\nThe Bill would make provision for the permanent establishment of a Minimum\nWage Board to keep the Minister responsible for Labour fully apprised of all\nissues relating to the segment of the workforce which earns a minimum wage to\nensure that those wages are increased where necessary and in a timely fashion.\n\nClause 1:\n\nClause 2:\n\nClause 3:\n\nClause 4:\n\nClause 5:\n\nClause 6:\n\nprovides a short title for the citation for the Act for ease of\nreference.\n\ndefines the terms which need to be defined for the purposes\nof the Bill.\n\nestablishes the Minimum Wage Board as an advisory body to\nassist the Minister with setting a minimum wage and keeping\nthe Minister abreast of matters which relate to minimum wage\nearners and their conditions of work.\n\noutlines the functions of the Minimum Wage Board. This is\nessentially to keep the Minister abreast of matters relating to\nminimum wage earners in such a manner that it would keep\nthe Minister up to date on such issues so that the Minister can\nmake Minimum Wage Orders which are relevant and issued\nin a timely fashion.\n\nprovides for the Board to recommend a minimum wage to the\nMinister in respect of a national minimum wage or minimum\nfor a group or sector of employees.\n\nprovides for the Minister to make Minimum Wage Orders in\norder  to  prescribe  a  national  minimum  wage  order  or  a\nminimum wage for a specified group or sector.\n\ni\n\n\fClause 7:\n\nClause 8:\n\nClause 9:\n\nClause 10:\n\nrequires public notification of any Minimum Wage Order and\nprovides a mechanism for the public to notify the Minister of\ntheir objections and concerns and provides for the Board to\nreview  the  concerns  and  objections  raised  and  forward  its\ndeliberations on the same to the Minister.\n\nrequires  an  employer  to  pay  the  sum  prescribed  as  the\nminimum  wage  and  not  discontinue  any  other  financial\nbenefit which is being paid to the employee.\n\nrequires employees to keep records necessary to show that the\nrequired minimum wage is being paid to employees covered\nby the Act.\n\nrequires the employer to ensure that all employees affected by\na change in the minimum wage are aware that there has been\na  change  in  the  minimum  wage,  by  ensuring  that  these\nemployees see a copy of the Minimum Wage Order.\n\nClause 11:\n\nempowers the Chief Labour Officer to\n\n(a) require the production of wage sheets and to enter premises; and\n\n(b) ensure that the required wages are being paid and that the conditions\nunder which the minimum wage employee works is acceptable.\n\nClause 12:\n\nClause 13:\n\nClause 14:\n\nempowers the Chief Labour Officer to institute proceedings\nin his own name.\n\ncharges the expenses for the Minimum Wage Board on the\nConsolidated Fund.\n\ncreates a series of offences under the Act including, the failure\nto keep the required records, the failure to give notice of a\nMinimum  Wage  Order,  and  the  failure  to  pay  the  required\nminimum wage.\n\nii\n\n\fClause 15:\n\nClause 16:\n\nClause 17:\n\nClause 17:\n\nClause 19:\n\nimposes  a  duty  of  non-disclosure  on  each  member  of  the\nBoard as well as on any person who meets with the Board for\nthe purposes of the Act.\n\nimposes a limitation period of one year for the prosecution of\nany offence under the Act.\n\nprovides for Regulations to be made for the purposes of the\nAct  and  for  these  Regulations  to  be  subject  to  negative\nresolution.\n\nimposes the obligation to pay at least the required minimum\nwage on the Crown.\n\npreserves as law all decisions and Orders made by a Wages\nCouncil  prior  to  this  Act  coming  into  force  until  they  are\nrevoked and replaced by Minimum Wage Orders made under\nthis Act.\n\nClause 20:\n\nrepeals the Wages Councils Act, Cap 362 .\n\niii\n\n"
}