{
  "bill_id": 191,
  "slug": "resolution-vesting-of-land-at-pinfold-street-magazine-lane-st-michael",
  "title": "Resolution Vesting of Land at Pinfold Street & Magazine Lane, St. Michael",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/192ca9db59f2bf38e94cd5e7d5e0d872.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2017-02-03",
  "first_reading": "2017-02-07",
  "second_reading": "2017-02-07",
  "gazette_date": null,
  "passed_date": "2017-02-07",
  "markdown": "PARLIAMENT\n@\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 approve the vesting in the Barbados Jewish Community Inc. of the parcel of land, the property of the Crown situate at Pinfold Street and Magazine Lane in the parish of Saint Michael in this Island and more particularly described in the Schedule to this Resolution hereto to facilitate the completion of the Synagogue Restoration Project.\nAPPROVED by the House of Assembly this\nday of\nTwo thousand and seventeen.\nSPEAKER\nAPPROVED by the Senate this\nday of\nTwo\nthousand and seventeen.\nPRESIDENT\nSCHEDULE\n@\nALL THAT land the property of the Crown situate at Pinfold Street and Magazine Lane, Bridgetown in the parish of Saint Michael containing by admeasurement 534.5 square metres or thereabouts Abutting and Bounding on lands of the Nidhe Isreal Synagogue on other lands now or formerly of the Government of Barbados on two sides on a public road known as Magazine Lane leading to Whitepark Road in one direction and to Synagogue Lane in the other direction and on the Jewish Cemetery ‘A’ or however else the same may abut and bound as shown and delineated on a Plan certified on the 20th day of February, 2015 by D.G. Godson, Land Surveyor and recorded in the Lands and Surveys on the 24% day of March, 2015 as Plan No. 228/2015.\nADDENDUM\nThe Cabinet at its meeting held on the 13 day of August, 2015 agreed to the vesting of the 534.5 square metres of land situate at Pinfold Street and Magazine Lane in the parish of Saint Michael in this Island in the Barbados Jewish Community Inc. to facilitate the completion of the Synagogue Restoration Project.\nThe land more particularly described in the Schedule hereto was acquired by Conveyance dated 10t day of January, 1917 between Sarah Elizabeth Johnson in her own right of the First Part and Sarah Elizabeth Johnson as the sole Trustee of the Will of Jane Ann Johnson of the Second Part and the Executive Committee of the Island of Barbados of the Third Part and recorded on the 19 day of January, 1917 as Deed Number 37A.\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is now sought for the vesting in the Barbados Jewish Community Inc. of the parcel of land more particularly described in the Schedule to the Resolution.\n"
}