{
  "bill_id": 192,
  "slug": "resolution-re-vesting-of-land-at-pinfold-street-to-the-jewish-community",
  "title": "Resolution re vesting of land at Pinfold Street to the Jewish Community",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/bcc5431b90a19c3e37bce97d6d2d8b6c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-02-08",
  "first_reading": "2017-02-22",
  "second_reading": "2017-02-07",
  "gazette_date": null,
  "passed_date": "2017-02-22",
  "markdown": "PARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the\n\nCrown Lands (Vesting and Disposal) Act, Cap. 225, approve the vesting in the Barbados Jewish\n\nCommunity Inc. of the parcel of land, the property of the Crown situate at Pinfold Street and\n\nMagazine Lane in the parish of Saint Michael in this Island and more particularly described in the\n\nSchedule to this Resolution hereto to facilitate the completion of the Synagogue Restoration Project.\n\nAPPROVED  by  the  House  of  Assembly  this                    day  of\n\n                                     , Two thousand and seventeen.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and seventeen.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  the  property  of  the  Crown  situate  at  Pinfold  Street  and\n\nMagazine  Lane,  Bridgetown  in  the  parish  of  Saint  Michael  containing  by  admeasurement\n\n534.5 square metres or thereabouts Abutting and Bounding on lands of the Nidhe Isreal Synagogue\n\non other lands now or formerly of the Government of Barbados on two sides on a public road\n\nknown as Magazine Lane leading to Whitepark Road in one direction and to Synagogue Lane in the\n\nother direction and on the Jewish Cemetery ‘A’ or however else the same may abut and bound as\n\nshown and delineated on a Plan certiﬁ ed on the 20th day of February, 2015 by D.G. Godson, Land\n\nSurveyor and recorded in the Lands and Surveys on the 24th day of March, 2015 as Plan No. 228/2015.\n\n\f3\n\nADDENDUM\n\n  The  Cabinet  at  its  meeting  held  on  the  13th  day  of  August,  2015  agreed  to\n\nthe  vesting  of  the  534.5  square  metres  of  land  situate  at  Pinfold  Street  and  Magazine\n\nLane  in  the  parish  of  Saint  Michael  in  this  Island  in  the  Barbados  Jewish  Community\n\nInc. to facilitate the completion of the Synagogue Restoration Project.\n\nThe land more particularly described in the Schedule hereto was acquired by Conveyance\n\ndated  10th  day  of  January,  1917  between  Sarah  Elizabeth  Johnson  in  her  own  right  of\n\nthe  First  Part  and  Sarah  Elizabeth  Johnson  as  the  sole  Trustee  of  the  Will  of  Jane Ann\n\nJohnson  of  the  Second  Part  and  the  Executive  Committee  of  the  Island  of  Barbados\n\nof  the  Third  Part  and  recorded  on  the  19th  day  of  January,  1917  as  Deed  Number  37A.\n\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal)\n\nAct, Cap. 225, the approval of Parliament is now sought for the vesting in the Barbados Jewish\n\nCommunity Inc. of the parcel of land more particularly described in the Schedule to the Resolution.\n\n"
}