{
  "bill_id": 194,
  "slug": "resolution-re-guarantee-barbados-conference-services-limited-bbd17625-million",
  "title": "Resolution re Guarantee Barbados Conference Services Limited BBD$17.625 million",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b8a80f4e9c6420d5388912bb158b19c5.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-03-25",
  "first_reading": "2017-03-24",
  "second_reading": "2017-03-24",
  "gazette_date": null,
  "passed_date": "2017-03-29",
  "markdown": "RESOLUTION NO.\n\n2017-01-27\n\nPARLIAMENT\n\nWHEREAS by paragraph (a) of section 3(1) of the  Guarantee of Loans (Companies)\n\nAct, Cap. 96, the Government may, with the approval of Parliament, guarantee the borrowing of\n\nsuch sums by a company from a lending agency as is authorised by the Government;\n\nAND  WHEREAS  Barbados  Conference  Services  Limited,  a  company\n\nincorporated  under  the  Companies Act,  Cap.  308  is  a  company  controlled  by  the  Government\n\nwithin the meaning of section 2 of the Guarantee of Loans (Companies) Act, Cap. 96;\n\nAND WHEREAS Barbados Conference Services Limited is seeking a loan in the sum\n\nof BBD$17.625 million from First Citizens Bank (Barbados) Limited on the terms and conditions\n\nset out in the Schedule for the purpose of assisting with the outﬁ tting of new ofﬁ ces at the Lloyd\n\nErskine Sandiford Centre;\n\nAND WHEREAS by virtue of section 4 of the Guarantee of Loans (Companies)\n\nAct, Cap. 96 the aggregate amount of all borrowings by companies that are guaranteed by the\n\nGovernment shall not exceed $1,000,000,000 without taking into account any amount in respect\n\nof interest, commission and any other expenses secured by the guarantees; and the Minister of\n\nFinance has certiﬁ ed that the aggregate amount of all borrowings guaranteed by the Government\n\nand any further borrowings does not exceed the limit;\n\n\f2\n\nBE IT RESOLVED that Parliament approve the guarantee by the Minister of Finance of the\n\npayment  of  the  principal  sum  of  BBD$17.625  million  and  interest  thereon  to  be  borrowed  by  Barbados\n\nConference Services Limited from First Citizens Bank (Barbados) Limited on the terms and conditions set\n\nout in the Schedule hereto.\n\nAPPROVED by the House of Assembly this                   day of                                                           ,\n\nTwo thousand and seventeen.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                                  ,\n\nTwo thousand and seventeen.\n\nPresident\n\n\f3\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nBarbados Conference Services Limited\n\nFirst Citizens Bank (Barbados) Limited\n\nGovernment of Barbados\n\n(i)\n(ii)\n\nBridging Loan - BBD$17.625 million\nDemand Loan - BBD$17.625 million\n\nBBD$17.625 million\n\nBarbados dollars\n\nTo  assist  with  the  outﬁ tting  of  new  ofﬁ ces  at  the  Lloyd  Erskine\nSandiford Centre.\n\nPrime  less  1.0  percent  for  a  current  effective  rate  of  6.65  percent\nper  annum.  Interest  will  be  calculated  on  the  actual  number  of\ndays elapsed and a 365 day year.\n\nBorrower:\n\nLender:\n\nGuarantor:\n\nFacility:\n\nAmount:\n\nCurrency:\n\nPurpose:\n\nInterest rate:\n\nRepayment terms:\n\n(i)\n\nBridging Loan - Fifteen (15) months from the date of the ﬁ rst\nadvance with interest to be serviced quarterly. After the ﬁ fteen\n(15) months period the principal debt is to be liquidated by\nthe Demand loan.\n\n(ii)\n\nDemand  Loan  -  Ten  (10)  years  from  the  date  of  the\ndisbursement of the loan. The loan will be repaid by equal\nmonthly  installments  representing  a  blended  payment  of\nprincipal and interest of BBD$201,476.08 commencing from\nthe date of disbursement of the loan.\n\nFees:\n\n0.5 percent of the facility amount; BBD$88,125.00.\n\n\f4\n\nSecurity:\n\n(i)\n\nLetter of Comfort for BBD$17.625 million;\n\nPrepayment:\n\nConditions precedent:\n\n(ii)  Guarantee from the Government of Barbados for BBD$17.625\n\nmillion;\n\n(iii)  Assignment of the monthly lease proceeds from the Government\n\ndepartments or agencies occupying the ofﬁ ce space.\n\nPermitted without penalty after three (3) years. The penalty is three (3)\nmonths interest at the rate of being charged on the loan.\n\nThe  Lender  shall  be  obliged  to  make  the  Bridging  Loan  advance\nunless inter alia\n\n(i)\n\n(ii)\n\nthe Lender is provided with written evidence that all statutory\napprovals, consents and licences are in place and in full force\nfor the building to be outﬁ tted;\n\nthe Lender is provided with a detailed costing of the budgeted\nexpenses  for  the  works  to  be  undertaken  or  reviewed  by  a\nquantity surveyor and supported by a drawdown schedule for\nreview;\n\n(iii)  a  Letter  of  Comfort  is  held  pending  provision  of  the\ngovernment guarantee supported by a legal opinion from the\nLender's legal counsel that the interim Letter of Comfort will\nprovide the same collateral beneﬁ ts and be treated as is it were\na government guarantee;\n\n(iv)\n\nthere is a satisfactory review of the ﬁ xed price contract for the\noutﬁ t of the ofﬁ ce space and all other contract documents and\nagreements;\n\n(v)\n\nthere is a satisfactory review of copies of the lease agreements\nwith the Ministry of Housing, Lands and Rural Development;\n\n(vi)\n\nthere  is  a  legal  opinion  from  the  Lender's  legal  counsel\nconﬁ rming  that  there  will  be  no  negative  implications  to  the\nLender entering into an Agreement with the Borrower in light\nof the company's insolvent Balance Sheet;\n\n\f5\n\nConditions precedent: - (Concl'd)\n\n(vii)\n\nthere is written conformation that all cost over runs will be met\nby the Borrower or the Government of Barbados;\n\n(viii)  a certiﬁ cate of practical completion is evidenced to the Lender\n\nupon completion of the outﬁ tting works.\n\nEvents of default:\n\nThe following are the events of default:\n\n(1)\n\n(2)\n\n(3)\n\n(4)\n\n(5)\n\nIf the Borrower fails to pay any sum on the due date for payment\nunder the Facility Letter, or any Security Document, to which\nit is a party or any other sum due and payable to the Lender.\n\nIf  the  Borrower  shall  neglect  to  carry  out  or  observe  any\ncovenant or condition (other than those relating to the payment\nof  any  sum  payable  under  the  Facility  Letter  or  under  any\nSecurity Document), provided the Borrower shall have 21 days to\nmake good such default before the Borrower shall be in default.\n\nIf a petition (other than a petition which is frivolous or vexatious\nand which is withdrawn within 21 days) is presented or an order\nis made or resolution is passed for the liquidation, bankruptcy,\nsequestration, winding-up or administration of the Borrower or\nthe Borrower seeks protection from its creditors or ﬁ les a plan\nor scheme of arrangement (except for the purpose of a solvent\namalgamation or reconstruction - on terms and conditions which\nhave ﬁ rst been approved by the Lender in writing.)\n\nIf any distress, execution, sequestration or other legal process\nis levied or enforced or sued out against any of the assets or\nundertaking of the Borrower.\n\nIf any person takes possession of, or a receiver on liquidation\nis  appointed  over,  the  whole  or  any  part  of  the  assets  of  the\nBorrower.\n\n\fEvents of default (Cont'd):\n\n(6)\n\n(7)\n\n(8)\n\n(9)\n\n# 6\n\nIf the Borrower ceases or suspends payment of sums due or is\nunable to pay debts as they fall due or is deemed unable to pay\nsums due or is deemed insolvent under insolvency legislation.\n\nIf the Borrower is unable or admits in writing its inability to pay\nits  debt  generally  as  they  fall  due  or  is  otherwise  deemed  to\nbe  so  unable  or  to  be  otherwise  insolvent  or  commences\nnegotiations  with  a  view  to,  or  takes  any  proceedings  for,  a\nreadjustment,  rescheduling  or  deferment  for  all  or  any  of\nits  obligations,  or  proposes,  makes  or  enters  into  a  general\nassignment,  arrangement  or  composition  with  or  for\nthe beneﬁ t of its creditors (or if any step is taken in connection\nwith any of the aforesaid), or if the Borrower or any Guarantor\nshall otherwise generally stop or propose to stop payment of its\ndebts or any class of them or cease or threaten to cease to carry\non business.\n\nIf there shall, in the opinion of the Lender, acting reasonably,\noccur any change of circumstance in the assets or concession of\nthe Borrower from that existing at the date of the Facility Letter\nwhich has, or is likely to have a material adverse effect on the\nﬁ nancial condition of the Borrower or materially imperil, delay\nor prevent fulﬁ lment by the Borrower of its obligations under\nthe Facility Letter or any of the Security Documents.\n\nIf any representation, warranty or statement which is made or\ndeemed to have been made or acknowledged to have been made\nby  or  on  behalf  of  the  Borrower  in  any  Security  Document\nor  which  is  contained  in  any  certificate,  statement,  legal\nopinion  or  notice  provided  hereunder  or  in  connection  with\nany Security Document, or  any other document delivered to\nthe Lender in connection with this Facility Letter, is untrue and\nincorrect in any material respect when made or deemed to have\nbeen made.\n\n\fEvents of default (Concl'd):\n\n# 7\n\n(10)  If any obligation or other provision in any Security Document\nterminates  or  ceases  to  be  legally  valid,  binding  and\nenforceable obligation of the Borrower or a Guarantor if the\nBorrower or a Guarantor contests in any manner, or repudiates the\nlegality, validity, binding nature or enforceability of any Security\n Document.\n\n(11)\n\nIf  any governmental or other consent, license or authorization\nrequired to  make any Security Document legal, valid, binding\nand enforceable or is required in order to enable the Borrower\nto  perform its obligations thereunder, is withdrawn or ceases to be\nin  full  force  and  effect  and  which  consent  licence  or\nauthorization  is  not  capable  of  being  reissued  or  reinstated\nwithin  a  reasonable  period  of  time  and  in  any  event\nwithin 21 days.\n\n(12)  If  any  of  the  matters  referred  to  in  (1)  and  (3)  through  (11)\n\nabove are applicable to a Guarantor.\n\n(13)  In connection with an Event of Default, the Borrower hereby\nwaives  presentment  for  payment,  notice  of  protest,\ndemand for payment, notice of non-payment and notice of any\nother kind.\n\nGoverning Law:\n\nThe law of Barbados.\n\n\f8\n\nADDENDUM\n\nThis  Resolution  seeks  the  approval  of  Parliament  in  respect  of  a  guarantee\n\nby  the  Government,  for  the  borrowing  by  Barbados  Conference  Services  Limited\n\nof  the  sum  of  BBD$17.625  million  from  First  Citizens  Bank  (Barbados)  Limited\n\non  terms  and  conditions  set  out  in  the  Schedule  for  the  purpose  of  assisting  with  the\n\noutﬁ tting of new ofﬁ ces at the Lloyd Erksine Sandiford Centre.\n\nThe  sum  of  BBD$17.625  million  is  within  the  limit  of  the  amount  mentioned  in  the\n\nGuarantee of Loans (Companies) Act, Cap. 96.\n\n"
}