{
  "bill_id": 195,
  "slug": "resolution-compulsory-acquisition-of-land-at-brighton-st-george-for-the-public-purpose-of-housing",
  "title": "Resolution Compulsory Acquisition of land at Brighton, St. George for the public purpose of housing",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/99c57bc0610c2c72ef86df84111c6fc6.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-03-08",
  "first_reading": "2017-05-03",
  "second_reading": "2017-03-07",
  "gazette_date": null,
  "passed_date": "2017-05-03",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament, in accordance with section 5 of the Land Acquisition Act, Cap. 228, approve the compulsory acquisition by the Crown of the parcel of land, the property of Brighton Plantation Limited, situate at Brighton in the parish of Saint George in this Island, more particularly described in the Schedule hereto, for the public purposc of housing development.\nAPPROVED by the House of Assembly this\nday of\n. Two Thousand and Seventeen.\nSpeaker\nAPPROVED by the Senate this\nday of\n, Two\nThousand and Seventeen.\nPresident\ntN\nSCHEDULE\nALL THAT land the property of Brighton Plantation Limited situate\nat Brighton in the parish of Saint George in this Island containing by admeasurement 2.943 hectares (metric conversion 29,427.7 square metres) (inclusive of 0.181 hectares in road reserve) Abutting and Bounding on lands now or formerly of the said Brighton Plantation Limited and on a cart road which is part of other lands now or formerly of the said Brighton Plantation Limited on lands now or formerly of Buttals Development Limited on lands now or formerly of Alphonso Wood on lands now or formerly of Randolph Moore on lands now or formerly of Marlene Moore on lands now or formerly of Angela Carter on lands now or formerly of the said Brighton Plantation Limited on lands now or formerly of Glenda Alleyne on lands now or formerly of the said Brighton Plantation Limited on lands now or formerly of Andria Sage on lands now or formerly of the said Brighton Plantation Limited and on a public road leading to Ellerton in one direction to Highway 4 in another direction and to Highway 4B in another direction or however else the same may abut or bound as shown and delineated on a Plan certified on the 11\" day of October, 2016 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Surveys Department on the 13\" day of October, 2016 as Plan No. 976/2016.\nADDENDUM\nOn the 4\" day of July, 2013, the Cabinet agreed to the acquisition of approximately 2.980 hectares of land situate at Brighton in the parish of Saint George the property of Brighton Plantation Limited for the public purpose of housing development.\nIn accordance with section 5 of the Land Acquisition Act, Cap. 228, the approval of Parliament is now sought for the compulsory acquisition of the parcel of land, described in the Schedule hereto, so that the Crown may acquire an indefeasible title to the said parcel of land.\nSurvey Order No: 24/2015 Correapondence No: 030/930 Vol. + kprense Wood (eat 140) a rapeasoasane Brighton Plantolien United Tee s01/008 Barbados PLAN OF (AND Qarderes grean orc tome) SCHR 1:75 . Tatorees ofe a metres at BRGHTOY PLANTATION, 5°. GEGRGE Zeoregs ore rateired to Gd Noth Served from o onicgus pian by containing wang... 2.767 na (27 81S 2 3q 1) igvens 2. G, Godson cutied 19-03-3598 one Rood... 0.18 bo {1 812.4 sq. m) ecotded 24 0. LS. F: 766/98 Tato... 2943 ho (79 427.7 sqm} 5 on tana . © sereter bon rat surveyed for MNSIRY OF HOUSING, LANDS & : toe RURAL DELOPMENT = corehes computed post cartifled Tin October, = 2216 vend Fae f Fort st D/H AIINS . For Landa ong Surveys Sept ony Drone’ $A eae Ye, Sorel N. Toys _ ORsee> Land Surteyor . ‘ ad LANGS AND SURVEYS DEPARTMENT g NOAH = fi 1 Now oF Formmathy Hi 1 Gerds Aarne | on tepeta Corter \"Hom OF Foemnerny 8 Se ‘ iF (et 38) oy rgnisa Mita, 338,18 . vo (ter sap, Brenan On 2. aS . 637957067059 3,3 Fs sspears” q gig 2 3 assesses : io 23s 5 -..-592§ sae se prt? ie py ne < mo Hee or Formany 7 Stee oF Formerty Srigran Pin, Ls 1 ' ‘ ' 1 ' i fe Giese” > “95, RL Woe ye HSL, 238 OO gg & U z te & - z oy ote (lor t} sssisfearoo ig 3 nom of foereny |B Arde Sogo; Brighten Plentahen Lnvted Poreronce stems ty: TR OM Seerurlaine corted 29-07-1908 ane rocardes on © LS 1D. Frekbe ceeded 19-62-1999 and vererded a6 OL Sf: THR Conane certiog 73-04-1958 cae moceroed ax OL Sf. 20 and reverdas aD. TDS Fron coraiied 19-03-2067 and racerdes om B. oT. 2. S Coben cormted (9-01-1095 ere rewerded a LS. f: TF. MEA. Pekan certiind H-OR62013 cmd reneeded oe D+ Sg mate § Chain~inied force taanging te thihots Onettepment Lite? Wn m0 chariates coed by 220 98\nesctiechen\nF O7/H, APNE Lume tar fF 63/95 /D47016-017. TAE/96 fame ton #. SH/S/BL/00} 8. #: $9/1 GF $43/1007 (umd Tos fs 43/13/04/093), 245A as be Pet at 73/00/01 7063). 16I8/Z0I3 (Land Toe § 7503/93/01)\n73/04/01 7008\nLocality: Brighton\nParish of:\nSt. George\n"
}