{
  "bill_id": 205,
  "slug": "supplementary-estimates-no13-20162017-50359504",
  "title": "Supplementary Estimates No.13 2016-2017 $50,359,504",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/9a10ffb9911b982fa352e687ce0b9597.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2017-03-15",
  "first_reading": null,
  "second_reading": "2017-03-18",
  "gazette_date": "2017-03-18",
  "passed_date": "2017-03-18",
  "markdown": "HOUSE OF ASSEMBLY\nResolved that the sum of FIFTY MILLION THREE HUNDRED AND FIFTY-NINE THOUSAND FIVE HUNDRED AND FOUR DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2016-2017 as shown in the Supplementary Estimates No.13 2016-2017 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2016 — 2017 No.13\nHEAD Code Provision in Number Approved Estimates 2016 - 2017 Other Expenditure HEAD: 21 MINISTRY OF FINANCE AND ECONOMIC AFFAIRS Program: 113 Revenue Collection Subprogram: 0133 Customs 211130133 Account Code: 102 Other Personal Emoluments 853,384 Account Code: 103 Employers Contributions 419,401 Program: 127 Revenue & Non- Bank Regulatory Management Subprogram: 0129 Special Projects — Central 211270129 Revenue Authority Account Code: 212 Operating Expenses Account Code: 212 Professional Services Account Code: 752 Machinery and Equipment\nProvision in Supplementary Supplementary Provision Estimates Required No. 1-12\nOther Other Expenditure Expenditure\n2,400,000\n1,500,000\n150,000\n909,504\n100,000\nAccount Code: 755 Computer Software\n300,000\nHEAD: 77 MINISTRY OF EDUCATION, SCIENCE, TECHNOLOGY AND INNOVATION Program: 273 Tertiary Subprogram: 0284 University of the West Indies Account Code: 316 Grants to Public Institutions 772730284 71,300,000\n45,000,000\nADDENDUM\nHead — 21:\nMINISTRY OF FINANCE AND ECONOMIC AFFAIRS\nProgramme — 113:\nRevenue Collection\nSub-programme — 0133: Customs and Excise Standard Account Code 102: Other Personal Emoluments $2,400.000 Standard Account Code 103: Employers Contributions $1,500.000 Programme 127: Revenue & Non-Bank Regulatory Management Sub-Programme 0129 : Special Projects - Central Revenue Authority Standard Account Code 212: Operating Expenses $150,000 Standard Account Code 226: Professional Services $909,504 Standard Account Code 752: Machinery and Equipment $100,000 Standard Account Code 755: Computer Software $300,000\nThe Supplementary funds are required for the satisfactory implementation of outstanding activities, the utilisation of corresponding resources allocated under the Loan and salaries for the posts which are in transition from the Customs Department to the Barbados Revenue Department.\nADDENDUM\nProgramme 273: Tertiary\nSubprogramme 0284: University of the West Indies Account Code 316 - Grants to Public institutions -\n$45,000,000\nTo meet the economic costs and contributions due to the University of the West Indies.\n"
}