{
  "bill_id": 207,
  "slug": "supplementary-estimates-no15-20162017-26974519",
  "title": "Supplementary Estimates No.15 2016-2017  $26,974,519",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/80c831e010231cf80410f90d12f83f4c.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2017-03-17",
  "first_reading": "2017-03-17",
  "second_reading": "2017-03-18",
  "gazette_date": null,
  "passed_date": "2017-03-18",
  "markdown": "HOUSE OF ASSEMBLY\nResolved that the sum of TWENTY-SIX MILLION, NINE HUNDRED AND SEVENTY-FOUR THOUSAND, FIVE HUNDRED AND NINETEEN DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2016-2017 as shown in the Supplementary Estimates No.15 2016-2017 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2016 — 2017 No.15\nCode Provision in Number Approved Estimates 2016 - 2017 Other Expenditure HEAD: 72 MINISTRY OF AGRICULTURE, FOOD, FISHERIES AND WATER RESOURCE MANAGEMENT Program: 518 Barbados Water Authority Subprogram:0542 Barbados Water Authority 725180542 Account Code: 416 —- Grants to Public Institutions 32,425,212 HEAD: 79 MINISTRY OF INDUSTRY, INTERNATIAL BUSINESS, COMMERCE AND SMALL BUSINESS DEVELOPMENT Program: 128 Micro-Enterprise Development Subprogram: 0157 Barbados Agency for Micro - Enterprise Development (Fund Access) 791280157 Account Code: 416 - Grants to Public institutions\nProvision in Supplementary Supplementary Provision Estimates Required No. 1-14\nOther Other Expenditure Expenditure\n16,974,519\n10,000,000\nADDENDUM\nHead 72: Program 518: Subprogram 0542: Account Code 416: Amount Required: MINISTRY OF AGRICULTURE, FOOD, FISHERIES AND WATER RESOURCE MANAGEMENT Barbados Water Authority Barbados Water Authority Grants to Public Institutions $16,974,519\nThe amount of $16,974,519 is required to provide support to the Barbados Water Authority.\nADDENDUM\nHead 79: Program 128: Subprogram 0157: Account Code 416: Amount Required: MINISTRY OF INDUSTRY, INTERNATIONAL BUSINESS, COMMERCE AND - SMALL BUSINESS DEVELOPMENT Micro-Enterprise Development Barbados Agency for Micro-Enterprise Development (Fund Access) Grants to Public Institutions $10,000,000\nThe sum of $10,000,000 is required to facilitate a transfer of funds from the Central Bank to Fund Access to meet the provision of grant funding and soft loans to the Micro, Small and Medium-Sized and Enterprise Sector through Fund Access.\n"
}