{
  "bill_id": 209,
  "slug": "resolution-vesting-in-barbados-national-terminal-company-ltd-of-land-at-oistins-christ-church",
  "title": "Resolution vesting in Barbados National Terminal Company Ltd. of land at Oistins, Christ Church",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b4fff25117a67ee05667fdc2843be3b6.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-03-19",
  "first_reading": "2017-03-18",
  "second_reading": "2017-03-18",
  "gazette_date": null,
  "passed_date": "2017-03-22",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament in accordance with section 5(1)(c) of the Crown Lands (Vesting and Disposal) Act, Cap. 225, approve the lease to the Barbados National Terminal Company Limited of the parcels of land, the property of the Crown, situate at Oistins in the parish of Christ Church in this Island together with the structures thereon, more particularly described in the First and Second Schedules to this Resolution on the terms and conditions set out in the Third Schedule to this Resolution to facilitate the siting of its pumping station.\nAPPROVED by the House of Assembly this\nday of\nTwo thousand and seventeen.\nSpeaker\nAPPROVED by the Senate this\nday of\n, Two\nthousand and seventeen.\nPresident\nFIRST SCHEDULE\nALL THAT land situate at Oistins in the parish of Christ Church in this Island and being the Lot B containing by admeasurement 2,984.2 square metres or thereabouts Abutting and Bounding on lands now or formerly of the Barbados Government (being the Lot C) on lands now or late of Orie Greendige and on other lands now or formerly of the Barbados Government (being the Lot A) or however else the same may abut and bound together with the structures thereon as shown and delineated on a Plan certified on the 3“ day of February, 2017 by Anderson R. Alleyne, Land Surveyor and recorded in the Lands and Surveys Department on the 7\" day of February, 2017 as Plan No. 107/2017.\nSECOND SCHEDULE\nALL THAT land situate at Oistins in the parish of Christ Church in this Island containing by admeasurement 213.8 square metres or thereabouts consisting of 98.9 square metres in Right of Way and 6.6 square metres in road reserve Abutting and Bounding on all sides by lands now or formerly of the Barbados Government or however else the same may abut and bound together with the buildings thereon as shown and delineated on a Plan certified on the 2™ day of February, 2017 by Anderson R. Alleyne, Land Surveyor and recorded. in the Lands and Surveys Department on the 7\" day of February, 2017 as Plan No. 106/2017.\nTHIRD SCHEDULE\nTERMS AND CONDITIONS:\n1. The Lease is for a period of fifty (50) years with an option to renew for a further period of twenty-five (25) years;\nThe rent shall be $50,000.00 per annum payable in advance;\nThere shall be a rent review every five (5) years;\nThe lease shall terminate if the terminal operations at the Fairy Valley site are ended permanently or if there is a change in the use of the terminal site;\nThe Lessee shall be responsible for:\n(a) all outgoings associated with the property, including land tax, utility charges, developmental costs, maintenance, etc.; and\n(b) remediating the site on the termination or expiration of the lease and reinstating. the land to its former state;\nThe Lessee shall indemnify and keep the Crown harmless from all and any actions arising from its use of the property; and\nThe Lessee shall comply with the Town and Country Planning Act, Cap. 240, the Coastal Zone Management Act, Cap. 394, the Marine Pollution and Control Act, Cap. 392A and other laws and statutory requirements of Barbados relating to the protection of the environment throughout the term of the lease.\nADDENDUM\nThe Cabinet at its meeting held on the 9\" day of February, 2017 considered Note (17) 88/MHLR 12 and agreed to the granting of a lease of two parcels of land containing by admeasurement 2,984.2 square metres and 213.8 square metres respectively, both situate at Oistins in the parish of Christ Church in this Island to the Barbados National Terminal Company Limited to site its pumping station.\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is now sought for the lease to the Barbados National Terminal Company Limited of the parcels of land more particularly described in the First and Second Schedules to this Resolution to site its pumping station on the terms and conditions set out in the Third Schedule to this Resolution.\n"
}