{
  "bill_id": 211,
  "slug": "offshore-petroleum-amendment-bill-2017",
  "title": "Offshore Petroleum (Amendment) Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/a1853a8c8ef804a8fa5b30f2e9cb6823.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-07-26",
  "first_reading": "2017-08-02",
  "second_reading": "2017-07-18",
  "gazette_date": "2017-05-08",
  "passed_date": "2017-08-02",
  "markdown": "2017-02-08\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Offshore Petroleum Act, Cap. 282A.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 15 of Cap. 282A\n\nAmendment of section 19 of Cap. 282A\n\nRepeal and replacement of heading of Part VI of Cap. 282A\n\nInsertion of section 29A into Cap. 282A\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Offshore Petroleum Act.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2017.\n\nThis Act may be cited as the Offshore Petroleum (Amendment) Act,\n\n\f4\n\nAmendment of section 15 of Cap. 282A\n\n2.\nSection 15 of the Offshore Petroleum Act, Cap. 282A, in this Act\nreferred  to  as  the  principal  Act,  is  amended  by  deleting  subsection  (3)  and\nsubstituting the following:\n\n“(3)\nThe applicant shall submit the environmental impact assessment\nand the environmental plan within 9 months of receipt of the notice of\nthe Designated Authority pursuant to subsection (2).”.\n\nAmendment of section 19 of Cap. 282A\n\n3.\n(a) and substituting the following:\n\nSection 19(1) of the principal Act is amended by deleting paragraph\n\n“(a)\n\nafter each phase of an exploration licence, other than the final\nphase, relinquish not less than 25 per cent of the licence area;\nand”.\n\nRepeal and replacement of heading of Part VI of Cap. 282A\n\n4.\nfollowing is substituted:\n\nThe  heading  of  Part  VI  of  the  principal  Act  is  deleted  and  the\n\n“PART VI\n\nCHANGE OF CONTROL OF LICENSEE AND TRANSFER,\nSURRENDER, SUSPENSION AND CANCELLATION OF\nLICENCE”.\n\n\f5\n\nInsertion of section 29A into Cap. 282A\n\n5.\nVI, the following:\n\nThe principal Act is amended by inserting after the heading of Part\n\n“Change of control of licensee\n\n29A.(1)\napproval of the Designated Authority.\n\nThere shall be no change of control of a licensee without the\n\nA licensee may apply to the Designated Authority for approval\n\n(2)\nof a change of control\n\n(a)\n\n(b)\n\nwithin 90 days of the proposed change; and\n\nupon payment of the prescribed fee and submission of such\ndocumentation  and  other  information  as  the  Designated\nAuthority may require to determine whether to grant approval\nfor the change.\n\nThe Designated Authority shall, within 45 days of receipt of the\n(3)\napplication, notify the licensee in writing of its decision to approve or\nnot to approve the change of control.\n\nThe Designated Authority may approve a change of control of a\n(4)\nlicensee subject to such conditions as it deems necessary to ensure that\nthe licensee continues to comply with this Act and the licence.\n\n(5)\n\nFor the purpose of this section\n\n(a)\n\n“control” means, in relation to a body corporate, the power\nof a person to ensure that the affairs of the body corporate are\n\n\f6\n\nconducted  in  accordance  with  the  wishes  of  the  person  by\nvirtue of\n\n(i)\n\n(ii)\n\nthe holding of shares or the possession of voting power\nin, or in relation to, the body corporate or any other body\ncorporate;\n\nany power conferred by the articles of incorporation or\nany other document regulating the body corporate or\nany other body corporate; or\n\n(iii)\n\nany other means; and\n\n(b)\n\na change of control occurs where a person who controls a\nbody  corporate  ceases  to  do  so  or  another  person  acquires\ncontrol of the body corporate.\n\nThis section does not apply where a change of control occurs as\n\n(6)\na result of involuntary winding-up, bankruptcy or receivership.”.\n\n\f7\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2017.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2017.\n\nPresident\n\n"
}