{
  "bill_id": 214,
  "slug": "resolution-vesting-in-nhc-land-at-speightstown-st-peter",
  "title": "Resolution - vesting in NHC land at Speightstown, St Peter",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b93ef3cd6439981bdcbd56f5fc292393.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-12-11",
  "first_reading": "2017-12-13",
  "second_reading": "2017-12-08",
  "gazette_date": null,
  "passed_date": "2017-12-13",
  "markdown": "PARLIAMENT\n\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands\n\n(Vesting and Disposal) Act, Cap. 225 approve the vesting in the National Housing Corporation\n\nof the parcel of land, the property of the Crown, situate at Speightstown in the parish of Saint\n\nPeter in this Island more particularly described in the Schedule hereto.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and seventeen.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and seventeen.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  the  property  of  the  Crown  situate  at  Speightstown  in  the\n\nparish  of  Saint  Peter  in  this  Island  containing  by  admeasurement  3459.4  square  metres  or\n\nthereabouts (inclusive of 410.1 square metres in road reserve) Abutting and Bounding on lands\n\nnow or formerly or Bjorn Bjerkhamn on lands now or late of Allan Ishmael on lands now or late\n\nof Dorothy Westerman on lands now or formerly of Percy Whitehead on the Caribbean Sea and\n\non a public road or however else the same may abut and bound as shown and delineated on a Plan\n\ncertiﬁ ed on the 12th day of September, 2011 by Camille Belgrave, Land Surveyor and recorded\n\nin the Lands and Surveys Department on the 14th day of September, 2011 as Plan No. 902/2011.\n\n\f3\n\nADDENDUM\n\n  The  Cabinet  at  its  meeting  held  on  the  17th  day  of  November,  2016  agreed  to  the\n\nvesting in the National Housing Corporation of 3459.4 square metres of Crown land situate at\n\nSpeightstown in the parish of Saint Peter.\n\nThe parcel of land formed part of the estates and property in this Island occupied by or for\n\nthe beneﬁ t of the Naval Service of the United Kingdom, and was vested in the Lord High Admiral\n\nor the Commissioners for executing the Ofﬁ ce of Lord High Admiral of the said United Kingdom\n\nfor the time being under the Naval Property (Vesting) Act 1862 (1862-2), and in accordance with\n\nsection 12 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 became vested in the Crown.\n\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal)\n\nAct, Cap. 225, the approval of Parliament is now sought for the vesting in the National Housing\n\nCorporation of the parcel of land more particularly described in the Schedule.\n\n"
}