{
  "bill_id": 217,
  "slug": "national-social-responsibility-levy-bill-2017",
  "title": "National Social Responsibility Levy Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/9c262c0365403f859770cbd9dcf5e59f.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-06-03",
  "first_reading": "2017-06-02",
  "second_reading": "2017-06-02",
  "gazette_date": null,
  "passed_date": "2017-06-14",
  "markdown": "Final Draft 2017-05-23\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the imposition of a levy on imported goods and\n\non goods which are manufactured or produced in Barbados.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nAdministration\n\nPurpose of the levy\n\nImposition of levy\n\nExemption re certain goods and imports\n\nExemption of diplomats and diplomatic missions\n\nExemption where goods are for export\n\nRegistration\n\n10.\n\nPayment of levy\n\n11.\n\nKeeping of accounts and records\n\n12.\n\nAudit\n\n13.\n\nCopies of documents\n\n14.\n\nObstruction of officers\n\n15.\n\nAssessment of levy\n\n\f3\n\n16.\n\nReassessments\n\n17.\n\nNotice of assessment\n\n18.\n\nRefund for overpayment\n\n19.\n\nWaivers and refunds\n\n20.\n\nObjections\n\n21.\n\nAppeal to Tribunal\n\n22.\n\nAppeal to the High Court\n\n23.\n\nRecovery of the levy\n\n24.\n\nRegulations\n\n25.\n\nValidation\n\n26.\n\nAmendment of the enactment in the Schedule\n\n27.\n\nCommencement\n\nSCHEDULE\n\nAmendment of Enactment\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the imposition of a levy on imported goods and on\n\ngoods which are manufactured or produced in Barbados.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n2017.\n\nThis Act may be cited as the National Social Responsibility Levy Act,\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Barbados  Revenue  Authority”  or  “Authority”  means  the  Barbados  Revenue\nAuthority established under section 3 of the Barbados Revenue Authority\nAct, 2014 (Act 2014-1);\n\n“domestic output” means locally manufactured or produced goods;\n\n“locally  manufactured  or  produced  goods”  means  goods  manufactured  or\n\nproduced in Barbados;\n\n“levy” means the national social responsibility levy imposed by section 5;\n\n“officer”  means  a  person  who  is  authorised  to  assist  the  Barbados  Revenue\n\nAuthority in the administration and enforcement of this Act;\n\n“registrant” means a person who is required to register and pay the levy under\n\nsections 9 and 10;\n\n“payment period” means the taxable period specified for the payment of value\n\nadded tax in the Value Added Tax Act, Cap. 87;\n\n“Revenue Commissioner” means the Revenue Commissioner appointed under\nsection 7 of the Barbados Revenue Authority Act, 2014 (Act 2014-1);\n\n“Tribunal”  means  the  Barbados  Revenue  Appeals  Tribunal  established  under\nsection 24 of the Barbados Revenue Authority Act, 2014 (Act 2014-1).\n\n\f7\n\nAdministration\n\nThe  Barbados  Revenue  Authority  shall  be  responsible  for  the\n3.\nadministration of this Act and for the assessment, collection and recovery of the\nlevy.\n\nPurpose of the levy\n\n4.\nprovision of sanitation services and the enhancement of the environment.\n\nThe levy shall be applied towards the provision of health care, the\n\nImposition of levy\n\n5.(1)\nsocial responsibility levy” shall be imposed in accordance with this Act\n\nSubject to sections 6, 7 and 8, a levy to be known as the “national\n\n(a)\n\n(b)\n\non goods manufactured or produced in Barbados by a registrant; and\n\non goods imported into Barbados.\n\nThe levy imposed by subsection (1)(a) is equal to 2 per cent of the price\n\n(2)\nat which the goods are sold, exclusive of value added tax.\n\nThe levy imposed by subsection (1)(b) is equal to 2 per cent of the customs\n(3)\nvalue of the goods and is payable at the time the goods are entered for use within\nBarbados by the importer or other person who is liable under the Customs Act,\nCap. 66 to pay duties on the goods.\n\nAny person who demands or receives payment of the levy on any goods\n(4)\ncontrary to this Act is guilty of an offence and liable on summary conviction to\na fine of $10 000 or to imprisonment for 6 months or to both.\n\n\f8\n\nExemption re certain goods and imports\n\n6.(1)\n\nNo levy is payable\n\n(a)\n\n(b)\n\non goods which are manufactured or produced in Barbados where the\ngoods are sold by a manufacturer or producer to another manufacturer\nor producer in Barbados;\n\nby any person exempt from the payment of import duties under any\nenactment relating to the manufacturing, agricultural or tourism sector\non the items and goods specified in that enactment and subject to the\nterms and conditions specified in the enactment.\n\nNotwithstanding any other enactment granting exemptions from taxation,\n(2)\nand subject to the provisions of this Act, the levy is payable on all goods which\nare imported into Barbados.\n\nExemption of diplomats and diplomatic missions\n\n7.\n\nNo levy is payable where goods are supplied to or imported by\n\n(a)\n\n(b)\n\n(c)\n\na diplomatic mission, consulate or international organisation;\n\na member of the diplomatic or consular service or a member of his\nfamily forming part of his household; or\n\nany other person entitled to be exempt from duties and taxes pursuant\nto the Diplomatic Immunities and Privileges Act, Cap. 18.\n\non production of evidence that the goods are for the exclusive use of the person,\nentity or organization referred to in paragraphs (a) to (c).\n\nExemption where goods are for export\n\n8.(1)\nmanufactured or produced in Barbados are exported.\n\nNo levy is payable under this Act by a person where goods which are\n\n\f9\n\nA person who imports goods shall be granted a refund of the levy paid on\n\n(2)\nsuch goods if\n\n(a)\n\n(b)\n\nthe person satisfies the Revenue Commissioner that the goods were re-\nexported without having been used in Barbados; and\n\nthe person applies to the Revenue Commissioner for a refund within 2\nyears of the exportation of the goods.\n\nRegistration\n\nWhere  the  domestic  output  of  a  manufacturer  or  producer  exceeds\n9.(1)\n$200 000 annually that person shall register and pay the levy in accordance with\nthis Act.\n\nPart V of the Value Added Tax Act, Cap. 87 relating to registration shall\n\n(2)\napply with the necessary modifications to registration under this Act.\n\nPayment of levy\n\nEvery registrant shall, within 21 days after the end of each payment\n10.(1)\nperiod, file with the Barbados Revenue Authority, in such manner as the Revenue\nCommissioner determines, a return for the payment period, in such form as the\nRevenue Commissioner approves, together with such additional information as\nthe Revenue Commissioner requires.\n\nEvery registrant shall, within 21 days after the end of each payment period,\n(2)\npay to the Barbados Revenue Authority, the levy payable by that person for the\npayment period.\n\nPart VI of the Value Added Tax Act, Cap. 87 relating to returns and payment\n(3)\nof tax, shall apply with the necessary modifications to the payment of the levy\nunder this Act.\n\nA  registrant  who  files  a  return  after  the  payment  period  specified  in\n(4)\nsubsection (1) shall pay a penalty of $100 to the Barbados Revenue Authority.\n\n\f10\n\nA  registrant  who  fails  to  pay  the  amount  of  the  levy  payable  by  that\n\n(5)\nregistrant within the period specified in subsection (2) shall pay\n\n(a)\n\n(b)\n\na penalty of 10 per cent of the amount of the levy that is payable; and\n\ninterest at the rate of one per cent per month calculated for each month\nor part of a month during which any amount of the levy and penalty\nremains unpaid on the largest amount of the levy and penalty that was\ndue and unpaid at any time in that month.\n\nKeeping of accounts and records\n\nEvery  registrant  shall  keep  appropriate  records,  information  and\n11.(1)\naccounts so as to enable the Revenue Commissioner to determine the amount of\nthe levy which is payable by that registrant for any payment period.\n\nWhere a registrant fails to keep adequate records, information and accounts\n(2)\nfor the purposes of this Act, the Revenue Commissioner may require that person\nto keep such records, information and accounts as the Authority determines.\n\nEvery person required by subsection (2) to keep records, information and\n(3)\naccounts shall retain the records, information and accounts until the expiration\nof 5 years after the end of the year to which the records, information and accounts\nrelate or for such shorter period as the Revenue Commissioner may determine.\n\nAny person who fails to keep adequate records, information and accounts\n(4)\nin accordance with this section is guilty of an offence and is liable on summary\nconviction to a fine of $5 000.\n\n\f11\n\nAudit\n\n12.(1)\nAn officer may, at any reasonable time, enter any premises or place\nwhere  goods  are  locally  manufactured  or  produced  or  any  place  where  any\nrecords, information or books of account relating thereto are kept and\n\n(a)\n\ninspect, audit or examine the records, information and books of account\nof a person or any property or process of that person or any other matter\nthat may be relevant in determining\n\n(i)\n\n(ii)\n\nthe amount of levy or any other amount payable by that person\nunder this Act; or\n\nthe amount of a refund that is payable to that person under this\nAct;\n\n(b)\n\nrequire the owner or manager of the property or any employee to give\nhim all reasonable assistance with his inspection, audit or examination\nand to answer all questions relating to his responsibility for the payment\nof the levy under this Act either orally or in writing.\n\nFor the purposes of subsection (1), the officer may require the owner or\n(2)\nmanager of the business to be present at the premises or place with him for the\ninspection,  audit  or  examination  and  to  answer  any  question  relating  to  his\nresponsibility for the payment of the levy under this Act.\n\nWhere,  during  the  course  of  an  audit  or  examination  referred  to  in\n(3)\nsubsection (1), it appears to the officer referred to in that subsection that there\nhas been a violation of this Act or any regulations made under this Act, the officer\nmay seize and take away any records, information or books of account which\nmay afford evidence of the violation.\n\nThe  Revenue  Commissioner  may,  for  any  purpose  related  to  the\n(4)\nadministration of this Act, by registered letter or by a demand served personally,\nrequire any person\n\n(a)\n\nto provide any information in the form of a return or otherwise; and\n\n\f12\n\n(b)\n\nto produce any record, information or books of account, within such\ntime as the Revenue Commissioner specifies.\n\nCopies of documents\n\n13.\nWhere  any  document,  information  or  book  of  account  has  been\nproduced, seized, inspected or examined by an officer under this Act, the officer\nmay make copies; and a document purporting to be certified by the officer to be\na copy made pursuant to this section is admissible in evidence and has the same\nprobative value as the original document.\n\nObstruction of officers\n\nA person who threatens, assaults or obstructs any officer acting in the\n14.\nexecution  of  his  duty  under  this  Act  is  guilty  of  an  offence  and  is  liable  on\nsummary conviction to a fine of $20 000 or to imprisonment for 3 years or to\nboth.\n\nAssessment of levy\n\n15.(1)\n\nWhere\n\n(a)\n\n(b)\n\n(c)\n\na registrant has failed to file a return in accordance with section 10(1);\n\na registrant has failed to pay the levy payable in accordance with section\n10(2); or\n\nthe Revenue Commissioner is satisfied that a true account of the levy\npayable has not been given in a return,\n\nthe  Revenue  Commissioner  may,  after  consideration  of  any  representation  or\ninformation  which  the  registrant  may  make  or  supply  to  him,  assess  the  levy\npayable by that registrant for the applicable payment period; and the levy for that\nperiod shall be paid on the amount assessed.\n\nDivision  IV  of  Part  X  of  the  Value  Added  Tax  Act,  Cap.  87  relating  to\n(2)\nassessments, determinations and overpayments shall apply with the necessary\nmodifications to assessments, determinations and overpayments under this Act.\n\n\f13\n\nReassessments\n\nAfter  an  assessment  has  been  made  under  section  15,  the  Revenue\n16.\nCommissioner may make a reassessment of the levy for the applicable period\nwhere  the  Revenue  Commissioner  is  satisfied  that  the  registrant  has  made  a\nmisrepresentation or has failed to disclose any material fact or information in\nmaking a return.\n\nNotice of assessment\n\nAfter making an assessment or a reassessment under section 15 or 16,\n17.\nthe Revenue Commissioner shall deliver a notice of assessment or reassessment,\nas the case may be, to the registrant showing the amount of his proceeds for the\napplicable period.\n\nRefund for overpayment\n\nWhere a person, other than a registrant, has paid an amount as levy on\n18.\ngoods and that amount exceeds the amount that was payable by him under this\nAct, the Revenue Commissioner shall pay a refund to that person equal to the\namount of the excess where that person applies for the refund within 2 years after\nthe amount was paid.\n\nWaivers and refunds\n\n19.\nThe  Minister  may  by  order,  where  he  thinks  it  equitable  to  do  so,\nexempt or refund, in whole or in part, the amount of the levy payable or paid\nunder this Act by any person.\n\nObjections\n\n20.(1)\n\nSubject to this section, a person who\n\n(a)\n\n(b)\n\nhaving been assessed, disagrees with the assessment; or\n\nhaving made an application for a refund of the levy, disagrees with the\nRevenue Commissioner's determination respecting the application,\n\n\f14\n\nmay object to the assessment or determination by filing a notice of objection with\nthe  Revenue  Commissioner  within  21  days  after  the  date  of  the  notice  of\nassessment or notice of determination, as the case may be, or such longer period\nas the Revenue Commissioner allows.\n\nExcept with leave of the Revenue Commissioner, a person may not object\n(2)\nto an assessment unless the person has either paid the amount that was so assessed\nor given security, in an amount and form satisfactory to the Commissioner, for\nthe payment thereof.\n\nA notice of objection shall be in writing and shall state the precise grounds\n\n(3)\nfor the objection.\n\nThe Revenue Commissioner shall give a person who has objected to an\n(4)\nassessment or determination an opportunity to support his objection by a written\nor oral submission to the Commissioner.\n\nThe Revenue Commissioner shall, after receiving a notice of objection in\n(5)\nrespect  of  an  assessment  or  determination  and  after  giving  the  person  who\nobjected an opportunity to support his objection,\n\n(a)\n\n(b)\n\nreview the assessment or determination and either confirm it or make\na reassessment or redetermination, as the case may require; and\n\ndeliver to the person who objected, a notice of confirmation, a notice\nof reassessment or a notice of redetermination, as the case may require.\n\nDivision  V  of  Part  X  of  the  Value  Added  Tax  Act,  Cap.  87  relating  to\n(6)\nobjections shall apply with the necessary modifications to objections under this\nAct.\n\nAppeal to Tribunal\n\n21.(1)\nAny person who has objected to an assessment or determination and\nwho  received  a  notice  of  confirmation,  reassessment  or  redetermination,  may\nappeal from the decision of the Revenue Commissioner to the Barbados Revenue\nAppeals  Tribunal,  within  30  days  after  the  day  on  which  the  notice  of\n\n\f15\n\nconfirmation, reassessment or redetermination, as the case may be, was delivered\nto him.\n\nWhere  a  person  has  filed  a  notice  of  objection  under  this  Act  and  the\n(2)\nRevenue  Commissioner  has  not,  within  6  months  thereafter,  delivered  to  the\nperson a notice of confirmation, reassessment or redetermination, the person may\nappeal to the Tribunal in respect of the objection.\n\nWhere  the  Revenue  Commissioner  delivers  to  a  person,  a  notice  of\n(3)\nconfirmation, reassessment or redetermination respecting an objection after the\nexpiration of the period of 6 months referred to in subsection (2), the person may\nappeal to the Tribunal within 30 days after the delivery of the notice.\n\nAn appeal under this section shall be instituted by filing a notice of appeal\n(4)\nwith the Tribunal together with such copies thereof as the Tribunal may require,\nand such notice shall, as far as possible, state the precise grounds of appeal.\n\nWhere the Tribunal is satisfied that there is good reason for the failure of\n(5)\na  person  to  object  or  appeal  within  the  time  specified  in  section  20  or  in\nsubsections (1), (2) or (3), the Tribunal may allow the person such further time\nas the Tribunal thinks fit.\n\nAppeal to the High Court\n\n22.(1)\nof the Tribunal to the High Court on a point of law.\n\nAny party to an appeal to the Tribunal may appeal from the decision\n\nIn disposing of an appeal under this section in respect of an assessment or\n\n(2)\ndetermination, the High Court may\n\n(a)\n\n(b)\n\nconfirm or set aside the assessment or determination;\n\nmake an order referring the assessment or determination back to the\nRevenue  Commissioner  for  reassessment  or  redetermination  in\naccordance with the directions of the Court; or\n\n(c)\n\nmake such other order as it thinks fit.\n\n\f16\n\nRecovery of the levy\n\nThe  levy  payable  under  this  Act  and  any  other  amount  payable  as\n23.\npenalties and interest is a debt due to the Crown and recoverable as such in civil\nproceedings  in  the  magistrate’s  court  for  District  A,  notwithstanding  that  the\namount  involved  exceeds  the  normal  monetary  limit  on  the  jurisdiction  of  a\nmagistrate’s court.\n\nRegulations\n\n24.\nprovisions of this Act.\n\nThe  Minister  may  make  regulations  generally  for  carrying  out  the\n\nValidation\n\nNotwithstanding the sections 3 (2) and 5 of the Provisional Collection\n25.\nof  Taxes  Act,  Cap.  85,  all  monies  collected  in  relation  to  the  levy  from  1st\nSeptember, 2016 to the commencement of this Act, shall be deemed to have been\nvalidly and lawfully collected as if collected under this Act.\n\nAmendment of the enactment in the Schedule\n\n26.\nto the extent set out in the second column opposite thereto.\n\nThe enactment set out in the first column of the Schedule is amended\n\nCommencement\n\n27.\nSeptember, 2016.\n\nThis  Act  shall  be  deemed  to  have  come  into  operation  on  1st\n\n\f17\n\nSCHEDULE\n\n(Section 26)\n\nAmendment of Enactment\n\nColumn 1\n\nEnactment\n\nColumn 2\n\nAmendment\n\nValue Added Tax Act, Cap. 87\n\nIn section 7, insert the following subsection after subsection\n(3):\n\n“(3B) For the avoidance of doubt, the calculation of value\nadded tax for the purposes of this section shall include the\nnational social responsibility levy imposed by section 5 of the\nNational Social Responsibility Levy Act, 2017 (Act 2017\n- ).”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2017.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2017.\n\nPresident\n\n"
}