{
  "bill_id": 220,
  "slug": "national-assistance-miscellaneous-provisions-bill-2017",
  "title": "National Assistance (Miscellaneous Provisions) Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/92183a8fb925a2fb03a17e3bf2b77a56.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2017-06-27",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "2017-05-08\nOBJECTS AND REASONS\nThis Bill will amend the enactments listed in the\n(a) First Schedule to this Act by deleting the words “Welfare Department” wherever they appear and substituting the words “Department of Social Services”; and\n(b) Second Schedule to this Act by deleting the words “National Assistance Board” wherever they appear and substituting the words “Commission. of Elder Affairs”.\nArrangement of Sections\n1. — Short title\n2. Amendment of enactments set out in the First Schedule\n3. Amendment of enactments set out in the Second Schedule\nFIRST SCHEDULE\nREPLACEMENT OF REFERENCE TO WELFARE DEPARTMENT\nSECOND SCHEDULE\nREPLACEMENT OF REFERENCE TO NATIONAL ASSISTANCE BOARD\nBARBADOS\nA Bill entitled\nAn Act to amend certain enactments listed in the Schedules to the Act by deleting the words “Welfare Department” and “National Assistance Board™ and substituting the words “Department of Social Services” and “Commission of Elder Affairs”, respectively.\nENACTED by the Parliament of Barbados as follows:\nShort title\n1. This Act may be cited as the National Assistance (Miscellaneous Provisions) Act, 2017.\nAmendment of enactments set out in the First Schedule\n2. The enactments set out in the First Schedule are amended by deleting the words “Welfare Department” wherever they appear and substituting the words “Department of Social Services”.\nAmendment of enactments set out in the Second Schedule\n3. The enactments set out in the Second Schedule are amended by deleting the words “National Assistance Board” wherever they appear and substituting the words “Commission of Elder Affairs”.\n5\nFIRST SCHEDULE\n(Section 2)\nREPLACEMENT OF REFERENCE TO WELFARE DEPARTMENT\nEnactments\n1. Adoption Act, Cap. 212\n2. Domestic Violence (Protection Orders) Act, Cap. 130A\n3. Family Law Act, Cap. 214\n4, Maintenance Act, Cap. 216\n5, Public Service Act, Cap. 29\n6. Public Officers Loan and Travelling Allowances Regulations, 2007 (S.1. 2001 No. 36)\n7. Public Service (Qualifications) Order, 2016 (S.1. 2016 No. 92)\n8. Public Service (General) Orders, 2016 (S.1. 2016 No. 94)\n9. Community Legal Services (Tariff of Fees) Regulations, 2000 (S.A. 2000 No. 73)\n10. Representation of the People (Identification Cards Replacement Fee) Regulations, 2007 (S.I. 2007 No. 10)\n6\nSECOND SCHEDULE\n(Section 3)\nREPLACEMENT OF REFERENCE TO NATIONAL ASSISTANCE BOARD\nEnactments\n1. Charities Act, Cap. 243\n2. Health Services Act. Cap. 44\n3. Statutory Boards Casual Employees (Pensions) Act, Cap. 383\n4, Statutory Boards (Pensions) Act, Cap, 384\n©\nRead three times and passed the House of Assembly this day of , 2017.\nSpeaker\nRead three times and passed the Senate this 2017.\nPresident\nday of\n"
}