{
  "bill_id": 221,
  "slug": "national-assistance-bill-2017",
  "title": "National Assistance Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3363015848bc95418145035f5f733d10.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2017-06-27",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "OBJECTS AND REASONS\nThis Bill would\n(a) revise provisions that relate to national assistance in Barbados;\n(6) repeal and replace the National Assistance Act, Cap. 48.\n2017-05-08.\nArrangement of Sections\nPARTI\nPRELIMINARY\nShort title\nInterpretation\nPART II\nMINISTERIAL RESPONSIBILITIES\nFunctions of Minister\nPART III\nCOMMISSION OF ELDER AFFAIRS\nEstablishment of Commission\nFunctions of the Commission\nOffices of Commission\nAccounts and reports\n8. Protection of the Commission\nPART IV\nDEPARTMENT OF SOCIAL SERVICES\nFunctions of the Department of Social Services\n10. Functions of the Chief Welfare Officer and Welfare Officer\n11. Functions of the Chief Welfare Officer in relation to national assistance\nPART V\nDECISIONS AND APPEALS\n12. Notification of decisions\n13. Appeals\n14. Appeal Committees\n15. Appealed decisions\nPART VI\nCHEQUES\n16. Lost or destroyed cheques\n17. Receipt of new cheques and cashing of original cheques\nPART VII\nMISCELLANEOUS\n18. Pensions of transferred officers under former Act\n19. Existing employment\n20. Savings of pensions\n21. Expenses\n22. Regulations\n23. Repeal and revocation\nFIRST SCHEDULE\nCommission of Elder Affairs\nSECOND SCHEDULE\nAppeal Committee\nTHIRD SCHEDULE\nFORM\nBARBADOS\nA Bill entitied\nAn Act to revise the provisions that relate to national assistance and repeal and replace the National Assistance Act, Cap. 48.\nENACTED by the Parliament of Barbados as follows:\nPARTI\nPRELIMINARY\nShort title\n1, This Act may be cited as the National Assistance Act, 2017.\nInterpretation\n2. For the purposes of this Act,\n“Appeal Committee” or “Committee” means an Appeal Committee appointed in accordance with section 14;\n“assistance in kind” means the provision of assistance other than the grant of cash in respect of clothing, house repairs, household furnishings, food, burials and legal aid;\n“Commission of Elder Affairs” or “Commission” means the Commission of Elder Affairs established under section 4;\n“Department” means the Department of Social Services;\n“elderly person \"means a person over the age of 49 years;\n“former Act” means the former National Assistance Act, Cap. 48;\n“national assistance” means relief in any form for a person or an elderly person;\n“National Assistance Board” means the National Assistance Board established by section 4 of the former Act.\n7\nPART II\nMINISTERIAL RESPONSIBILITIES\nFunctions of Minister\n3. The Minister shall be responsible for the administration of this Act and this includes the provision of such national assistance as may be necessary for persons or elderly persons in need, either by the grant of money or by assistance in kind.\nPART III\nCOMMISSION OF ELDER AFFAIRS\nEstablishment of Commission\n4.1) There is established a Commission of Elder Affairs.\n(2) The First Schedule has effect with respect to the constitution of the Commission and otherwise in relation thereto.\n(3) The Minister may amend the First Schedule by Order.\n(4) The Minister shall, by an instrument in writing, appoint the members of the Commission.\n(5) The Minister may revoke an appointment by an instrument in writing.\n(6) The Commission shali be a body corporate and section 21 of the Interpretation Act, Cap. 1 shall apply to the Commission.\nFunctions of the Commission\n5.(1) The Commission shall\n(a) advise the Minister on the provision of national assistance to elderly persons in need;\n(b) enquire into the condition of elderly persons and the needs of elderly persons in Barbados for national assistance and report thereon to the Minister;\n(c) carry out such duties and functions in connection with national assistance to elderly persons\n(i) as may be imposed on it by this Act or any other enactment; or\n(ii) as the Minister may direct it to perform;\n(d) accept and administer gifts, money or property from individuals or organisations donated to it for the benefit of elderly persons;\n(¢) determine the nature and the amount of national assistance to be given to elderly persons that apply for national assistance;\n@ subject to the provisions of this Act and regulations made under this Act, approve the award of national assistance to elderly persons;\n@ advise the Minister on any matter that relates to elderly persons that the Minister refers to it.\n(2) The Commission may\n(a) subject to the approval of the Minister, provide for the terms and conditions of employment of officers and servants who are necessary to assist the Commission with its functions;\n(b) provide and maintain institutions for the care and protection of elderly persons who are poor and needy;\n9\n(c) subject to the approval of the Minister, make bye-laws for the conduct and management of any institution that it maintains in accordance with paragraph (}); and\n(d) without prejudice to the generality of the foregoing, make bye-laws that prescribe the\n(i) procedure for admission to and discharge from an institution that the Commission maintains in accordance with paragraph (b); and.\n(ii) fees payable for admission and care of elderly persons at the institution.\nOffices of Commission\n6. For the purposes of discharging its functions under the Act, the Commission shall, with the approval of the Minister, set up offices in places and areas as it may think fit.\nAccounts and reports\n7.1) The Commission shail\n(a) keep proper accounts and adequate financial and other records in relation thereto; and\n(b) within 3 months after the end of each financial year,\n(i) _ prepare a statement of accounts in respect of that financial year;\n(ii) submit the statement of accounts for the financial year to the Auditor-General for audit and a copy of the statement to the Minister; and\n(iii) submit to the Minister a report on its activities in that financial year.\n10\n(2) The Auditor-General shall, as soon as may be practicable after the receipt of the statement of accounts of the Commission,\n(a) audit the accounts; and\n(b) submit a report to the Minister and to the Commission on the audit.\n(3) The Minister shall cause copies of every\n(a) statement and report prepared in accordance with subsection (1)(b); and\n(b) report prepared in accordance with subsection (2),\nto be laid before Parliament as soon as is practicable.\nProtection of the Commission\n8.(1) No act done by the Commission under this Act shall be questioned on the ground of\n(a) the existence of any vacancy in the membership or any defect in the constitution of the Commission;\n(b) any omission, defect or irregularity not affecting the merits of the act of the Commission.\n(2) No action, suit, prosecution or other proceedings shall be brought or instituted personally against any member in respect of any act done bona fide by the member in pursuance of, in execution of or in an intended execution of this Act.\nIl\nPART IV\nDEPARTMENT OF SOCIAL SERVICES\nFunctions of the Department of Social Services\n9. The Permanent Secretary responsible for the Department shall, in respect of persons other than elderly persons,\n(a) advise the Minister on the provision of national assistance to persons;\n(6) enquire into the condition of persons and the needs of persons in Barbados for national assistance and report thereon to the Minister;\n(c) carry out such duties and functions in connection with the provision of national assistance to persons\n(i) as may be imposed on the Department by this Act or any other enactment; or\n(ii) as the Minister may direct the Department to perform;\n(d) advise the Minister on any matter that relates to persons that he may refer to the Department.\nFunctions of the Chief Welfare Officer and Welfare Officer\n10.(1) The Chief Welfare Officer shall discharge the functions conferred on the Minister under this Act in respect of persons other than elderly persons.\n(2) Notwithstanding subsection (1), the Minister may direct that a public officer other than the Chief Welfare Officer shall discharge the functions conferred on him under this Act in respect of persons other than elderly persons.\n(3) Every Welfare Officer or other public officer shall discharge functions under this Act as the Minister directs in respect of persons other than elderly persons.\n12\n(4) Subject to subsections (2) and (3), the relevant public officers may take such steps as are necessary for the\n(a) execution and administration of this Act or regulations made in accordance with this Act; or\n(b) execution of directions given by the Minister.\nFunctions of the Chief Welfare Officer in relation to national assistance\n11.) Notwithstanding section 10, the functions of the Chief Welfare Officer in relation to national assistance for a person other than an elderly person shall be to\n(a) carry out all necessary enquiries into the particular circumstances of the person who applies for or who receives national assistance;\n(b) determine the nature and amount of national assistance to be given to the person who applies for national assistance;\n(c) subject to the provisions of this Act or regulations made in accordance with this Act, approve the award of national assistance to a person;\n(d) as far as is practicable, set to work any able bodied person who is granted national assistance;\n(e) accept and administer gifts, money or property from persons donated to the Department for the benefit of persons;\n() keep and maintain books, rolls, accounts, records and other documents in respect of\n(i) an application that a person makes for national assistance; and\n(ii) decisions and reports made in respect of the application;\n(g) perform duties imposed on him\n(i) by this Act or any regulations made in accordance with this Act or any other enactment; and\n13\n(ii) by directions given by the Minister.\n(2) The Chief Welfare Officer may delegate his duties under subsection (1) to such public officers as he may think fit.\nPART V\nDECISIONS AND APPEALS\nNotification of decisions\n12.(1) Where the Chief Welfare Officer makes a decision in respect of an application for national assistance, he shall\n(a) notify the person of the decision in writing within 14 working days of making the decision; and\n(b) ensure that the notification states that the person has the right to appeal against the decision to an Appeal Committee where the person feels aggrieved by the decision.\n(2) Where an elderly person submits an application for national assistance to the Commission and the Commission makes a decision in respect of that application, the Commission shall apply subsection (1) mutatis mutandis.\nAppeals\n13.(1) Where a person applies for national assistance and he is aggrieved by the decision made by the Chief Welfare Officer, he shall have the right to appeal to an Appeal Committee that is assigned to the district where he resides.\n(2) Where an elderly person applies for national assistance and he is aggrieved by a decision made by the Commission in respect of his application, subsection (1) shall apply mutatis mutandis.\nAppeal Committees\n14.(1) For the purpose of hearing and determining appeals under this Act, the Minister shall appoint\n(2) such number of Appeal Committees as may be prescribed by regulations made in accordance with this Act; and\n(b) the members of the Appeal Committees.\n(2) The Second Schedule has effect with respect to the constitution of an Appeal Committee and otherwise in relation thereto.\n(3) An Appeal Committee shall have jurisdiction over the areas prescribed by the regulations.\nAppealed decisions\n15. An Appeal Committee may confirm, vary or disallow any decision appealed against in accordance with this Act.\nPART VI\nCHEQUES\nLost or destroyed cheques\n16.(1) Where a national assistance cheque issued to a person is lost or destroyed, the Chief Welfare Officer may, notwithstanding anything contrary contained in law, issue to the person a new cheque to replace the cheque that was lost or destroyed.\n(2) Where a national assistance cheque issued to an elderly person is lost or destroyed, the Commission may apply subsection (1) mutatis mutandis.\n15\n(3) The Chief Welfare Officer or the Commission may refuse to issue a new cheque unless the person or the elderly person makes an application to the Chief Welfare Officer or the Commission, respectively,\n(a) inthe Form prescribed in the Third Schedule for a new cheque; and\n(6) a reasonable time has elapsed since the loss or destruction of the cheque.\n(4) A person or an elderly person who receives a new cheque in accordance with this section and who finds the original cheque after receipt of the new cheque\n(a) shall not cash the original cheque; and\n(b) shall surrender the original cheque to the Chief Welfare Officer or the Commission, respectively.\n(5) A person who contravenes subsection (4) is guilty of an offence and is liable on summary conviction to a term of imprisonment for 12 months.\nReceipt of new cheques and cashing of original cheques\n17. Where the Chief Welfare Officer or the Commission discovers that a person or an elderly person who received a new cheque for national assistance in accordance with section 16\n(a) cashed the original cheque after receipt of a new cheque; and\n(b) is still eligible to receive national assistance,\nthe Chief Welfare Officer or the Commission may refuse to issue the person or elderly person with a cheque for national assistance in the month subsequent to the discovery.\n16\nPART VII\nMISCELLANEOUS\nPensions of transferred officers under former Act\n18.(1) The provisions of this section shall apply notwithstanding any provision to the contrary contained in any enactment relating to pensions.\n(2) The pension, gratuity or other allowance which may be granted to or in respect of an officer who pursuant to the former Act is transferred to or becomes employed in the public service and who on the date on which he so transferred or becomes so employed attained the age of 60 years, shall be determined in accordance with the law applicable in respect of such officer immediately before he is so transferred or becomes so employed.\n(3) Any officer who pursuant to the former Act is transferred to or becomes employed in the public service and who on the date on which he is so transferred to or becomes so employed has not attained the age of 60 years may within 12 months of the appointed day or within such further time as the Governor-General, acting in his discretion, may in a special case allow, by notice in writing to the Accountant-General elect not to come under the provisions of the Pensions Act, Cap. 25, and any pension, gratuity or allowance which may be granted to or in respect of such officer shall be determined in accordance with the law applicable in respect of such office immediately before he is so transferred or becomes so employed.\nExisting employment\n19. Any person who immediately before the commencement of this Act was employed in the service of the National Assistance Board by virtue of the former Act shall, with effect from the date of the commencement of this Act, be deemed to be employed by the Commission and shall continue to be employed on terms and conditions that are the same or no less favourable than those on which he was employed immediately before the commencement of this Act.\n17\nSavings of pensions\n20.(1) Notwithstanding the commencement of this Act, where a public officer who had pensionable service was transferred or became employed in the service of the National Assistance Board, his service with the National Assistance Board shall, whether or not there was a break in service, be aggregated with his service in the public service and his pension shall be calculated in accordance with the Pensions Act, Cap. 25 and the Pensions Regulations, 1947 (1947-20) as if all of his service was service in the public service.\n(2) Where a public officer referred to in subsection (1) becomes employed in the service of the Commission, his service with the National Assistance Board and the Commission shall, whether or not there was a break in service, be aggregated with his service in the public service and his pension shall be calculated in accordance with the Pensions Act, Cap. 25 and the Pensions Regulations, 1947 (1947-20) as if all of his service was service in the public service.\nExpenses\n21. The expenses incurred in the administration of this Act shall be defrayed out of the moneys voted by Parliament for such purposes.\nRegulations\n22.(1) The Minister may make regulations\n(a) to facilitate the performance by him of his functions under this Act;\n(b) to prescribe the procedure to be followed in respect of applications for national assistance and the forms to be used for the applications;\n(c) to determine the nature and amount of national assistance, if any, to be given to an applicant for national assistance and any conditions or provisions to be attached to the grant of the national assistance;\n18\n(d) to prescribe the method and places of payment of national assistance granted in accordance with this Act;\n(e) to provide for the maintenance of records of applications for national assistance and reports and decisions in respect of the applications;\n() to provide for the inquiry into the circumstances of every applicant for or recipient of national assistance;\n(g) to provide for matters incidental to the appointment of an Appeal Committee;\n(h) to prescribe the procedure to be followed in respect of an appeal to an Appeal Committee and the forms to be used in relation to the appeal; and\n(i) for the better carrying into effect of this Act.\n(2) Regulations made under subsection (1) shall be subject to negative resolution.\nRepeal and revocation\n23.(1) The National Assistance Act, Cap. 48 is repealed.\n(2). The National Assistance Regulations, 1969 (S.1. 1969 No. 144) are revoked.\n19\nFIRST SCHEDULE\n(Section 4(2) )\nCommission of Elder Affairs\nMembership\n1.(1) The Commission shall consist of a Chairman, a Deputy Chairman and 7 other members.\n(2) The members of the Commission shail include the following persons:\n(a) a person designated as the Chairman by the Minister;\n(b) aperson designated as the Deputy Chairman by the Minister;\n(c) the Permanent Secretary of the Ministry responsible for National Assistance, ex officio, or a nominee of the Permanent Secretary.\nPeriod of appointment\n2. The members of the Commission shall hold office for a period of 3 years and shall be eligible for re-appointment.\nRemuneration\n3. The members of the Commission shall be eligible for such remuneration as the Minister may determine.\nVacancy\n4. A vacancy in the membership of the Commission shall be deemed to arise\n(a) in the case of the death or resignation of a member;\n(b) where a member fails to attend 3 consecutive meetings of the Commission without the approval of the Minister; or\n20\n(c) on revocation of an appointment of a member by the Minister where the Minister determines that the member is no longer a fit and proper person to be a member of the Commission due to illness, incapacity or misconduct.\nResignation of Chairman or Deputy Chairman\n5.(1) Where a Chairman or Deputy Chairman wishes to resign from his office as Chairman or Deputy Chairman, he shall submit his resignation in writing to the Minister.\n(2) Subject to subparagraph (1), the Chairman or Deputy Chairman shall cease to hold his office from the date of receipt of the resignation by the Minister.\nResignation of members\n6.(1) Where a member wishes to resign from the Commission, he shall submit his resignation, in writing, to the Minister.\n(2) The member shall cease to be a member from the date of receipt of the resignation by the Minister.\nPublications in Official Gazette\n7. The Chairman shall cause to be published in the Official Gazette the appointment, removal, resignation or death of any member of the Commission.\nQuorum\n8. Five members of the Commission shall form a quorum, one of whom shall be the Chairman or, in the absence of the Chairman, the Deputy Chairman.\nMeetings\n9.1) A meeting of the Commission shall be summoned on the initiative of the Chairman or at the written request of 2 or more members of the Commission.\n21\n(2) The Chairman shall summon a meeting of the Commission at least once every 3 months.\nVotes\n10.(1) Where there is an equality of votes at a meeting of the Commission, the Chairman shall have a second vote.\n(2) Where the Chairman is absent from the meeting, the Deputy Chairman shall have the second vote.\nRegulation of Commission\nll. The Commission may establish its own rules and procedures for dealing with the business before it.\n22\nSECOND SCHEDULE\n(Section 14(2))\nAppeal Committee\nMembership\n1, An Appeal Committee shall consist of 3 members.\nChairman\n2.(1) Each Appeal Committee shall elect one of its members as the Chairman of the Appeal Committee.\n(2) Subject to the Act and regulations made in accordance with the Act, the Chairman may determine the procedure to be followed in matters under the jurisdiction of the Appeal Committee.\nClerk of Appeal Committee\n3.(1) The Chief Welfare Officer shall appoint a Welfare Officer for each Appeal Committee as the Clerk of the Appeal Committee.\n(2) The Clerk shall attend all meetings and oral hearings of the Appeal Committee.\n(3) The Welfare Officer shall perform the role of Clerk of an Appeal Committee for a period of 3 years and is eligible for re-appointment.\nPeriod of appointment of an Appeal Committee\n4. The members of an Appeal Committee shall hold office for a period of 3 years and shall be eligible for re-appointment.\nResignation\n5. Where a member wishes to resign from an Appeal Committee, he shall submit his resignation in writing to the Minister.\n23\nQuorum\n6. Two members of an Appeal Committee shall form a quorum for that Appeal Committee.\nRemuneration\n7. The members of an Appeal Committee and the Clerk of the Appeal Committee shall be eligible for such remuneration as the Minister may determine.\n24\nTHIRD SCHEDULE\n(Section 16(3}(a))\n\nNational Assistance Act, 2017 (Act 2017- )\nApplication Form for Replacement Cheque\nDate: Date/Mouth/Year Name of Applicant: Name in capital letters Address of Applicant: Address National Registration Number of Applicant: National Registration Number Telephone Number of Applicant: Telephone Number Period on Cheque: Date/Month/Year Amount stated on Cheque:\nSignature of Applicant\nVerified by:\nPost of Officer:\nDate:\nApproved by:\nPost of Officer:\nDate:\n*Delete where not applicable\n25\nTHIRD SCHEDULE - (Concl'd}\n- *Name of Officer of the Commission of Elder Affairs/ *Department of Social Services\nDate/Mouh ear\nName of Officer of the Commission of Elder Affairs/ *Department of Social Services\nDate/Month/Year\n26\nRead three times and passed the House of Assembly this day of » 2017.\nSpeaker\nRead three times and passed the Senate this ,2017.\nPresident\nday of\n"
}