{
  "bill_id": 223,
  "slug": "latin-american-development-bank-amendment-bill-2017",
  "title": "Latin American Development Bank (Amendment) Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/13a3d34fca5bb68e8b330ad1fc301bfd.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-10-04",
  "first_reading": "2017-10-11",
  "gazette_date": "2017-10-09",
  "markdown": "2017-08-10\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Latin American Development Bank Act, 2015 (Act\n2015-24)  to  provide  for  the  Government  to  subscribe  to  additional  shares  of\nCommon Capital Stock of the Bank.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 3 of Act 2015-24\n\nInsertion of section 4A into Act 2015-24\n\nRepeal and replacement of section 6 of Act 2015-24\n\n1.\n\n2.\n\n3.\n\n4.\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Latin American Development Bank Act, 2015.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n(Amendment) Act, 2017.\n\nThis  Act  may  be  cited  as  the  Latin  American  Development  Bank\n\n\f4\n\nAmendment of section 3 of Act 2015-24\n\nSection 3(2) of the Latin American Development Bank Act, 2015\n2.\n(Act 2015-24), in this Act referred to as the principal Act, is amended by deleting\nthe word “and” appearing immediately after the words “any sums payable in\nrespect of such notes or securities so issued”.\n\nInsertion of section 4A into Act 2015-24\n\n3.\nfollowing:\n\nThe  principal  Act  is  amended  by  inserting  after  section  4,  the\n\n“Agreements for subscription of additional shares\n\n4A.(1)\nThe Government may, in accordance with such terms as may\nbe agreed upon between the Government and the Bank, subscribe to\n1080  additional  Series  “C”  shares  of  Common  Capital  Stock  of  the\nBank  which  have  the  characteristics  indicated  in  Annex  1  of  the\nAgreement and which each has a value of USD$14 200.\n\n(2)\nThe Government may, subject to the approval of Parliament by\nResolution and in accordance with such terms as may be agreed upon\nbetween the Government and the Bank, subscribe to further additional\nshares of Common Capital Stock of the Bank.\n\nSections  3  and  4  apply,  with  such  modifications  as  may  be\n(3)\nnecessary, to an agreement between the Government and the Bank for\nthe subscription of shares under this section as those sections apply in\nrelation to the Agreement.”.\n\nRepeal and replacement of section 6 of Act 2015-24\n\n4.\nsubstituted:\n\nSection  6  of  the  principal  Act  is  repealed  and  the  following\n\n\f5\n\n“Power of Minister to make Orders\n\n6.\nThe Minister may, by order, make such provision as may be\nnecessary for carrying into effect any provision of the Agreement, the\nImmunities  Agreement  or  an  agreement  for  the  subscription  of\nadditional shares referred to in section 4A.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2017.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2017.\n\nPresident\n\n"
}