{
  "bill_id": 227,
  "slug": "national-social-responsibility-levy-amendment-bill-2017",
  "title": "National Social Responsibility Levy  (Amendment) Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/f5eb1112d60189e6e4f86b618ba7b775.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-10-23",
  "first_reading": "2017-10-03",
  "gazette_date": "2017-10-03",
  "markdown": "Certified Draft 2017-09-27\n\nOBJECTS AND REASONS\n\nThis Bill would amend the National Social Responsibility Levy Act, 2017 to\n\n(a)\n\n(b)\n\nincrease the levy with effect from 1st July, 2017;\n\nprovide for certain food items and products to be exempt from the levy;\nand\n\n(c)\n\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\nShort title\n\nAmendment of section 2 of Act 2017-15\n\nAmendment of section 5 of Act 2017-15\n\nAmendment of section 6 of Act 2017-15\n\nAmendment of Schedule to Act 2017-15\n\nInsertion of Second Schedule in Act 2017-15\n\nCommencement\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  amend  the  National  Social  Responsibility  Levy  Act,  2017  to\n\nincrease the levy with effect from 1st July, 2017.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment) Act, 2017.\n\nThis  Act  may  be  cited  as  the  National  Social  Responsibility  Levy\n\nAmendment of section 2 of Act 2017-15\n\nSection 2 of the National Social Responsibility Levy Act, 2017 (Act\n2.\n2017-15), in this Act referred to as the principal Act, is amended by inserting\nthe following definition in its appropriate alphabetical order:\n\n“ “manufacturing or production cost” means the cost incurred in the\nmanufacture  or  production  of  goods  in  Barbados  but  does  not\ninclude any distribution or storage cost of the goods;”.\n\nAmendment of section 5 of Act 2017-15\n\n3.\nand (3) and substituting the following:\n\nSection 5 of the principal Act is amended by deleting subsections (2)\n\nWith effect from 1st July, 2017, the levy imposed by subsection\n“(2)\n(1)(a) is equal to 10 per cent of the manufacturing or production cost\nof the goods.\n\nWith effect from 1st July, 2017, the levy imposed by subsection\n(3)\n(1)(b) is equal to 10 per cent of the customs value of the goods and is\npayable at the time the goods are entered for use within Barbados by\nthe  importer  or  other  person  who  is  liable  under  the  Customs  Act,\nCap. 66 to pay duties on the goods.”.\n\nAmendment of section 6 of Act 2017-15\n\n4.\n\nSection 6 of the principal Act is amended\n\n(a)\n\nin subsection (1) by:\n\n\f5\n\n(i)\n\n(ii)\n\ndeleting the full stop appearing at the end of paragraph (b) and\ninserting a semi-colon; and\n\ninserting  immediately  after  paragraph  (b),  the  following  as\nparagraph (c):\n\n“(c)\n\non  any  goods  which  are  specified  in  the  Second  Schedule\nsubject to such terms and conditions as are set out in relation\nthereto.”; and\n\n(b)\n\nby  inserting  immediately  after  subsection  (2)  the  following  as\nsubsection (3):\n\n“(3)\n\nThe Minister may by order amend the Second Schedule.”.\n\nAmendment of Schedule to Act 2017-15\n\n5.\nSchedule as the First Schedule.\n\nThe  Schedule  to  the  principal  Act  is  amended  by  renaming  that\n\nInsertion of Second Schedule in Act 2017-15\n\n6.\nas the Second Schedule.\n\nThe principal Act is amended by inserting the Schedule to this Act\n\nCommencement\n\n7.\n\nThis Act shall have effect as follows:\n\n(a)\n\nThe  provisions  of  this  Act,  except  for  paragraph  5  of  the  Second\nSchedule as inserted by the Schedule to this Act, shall have effect\nfrom 1st July, 2017;\n\n(b)\n\nparagraph 5 of the Second Schedule, as inserted by the Schedule to\nthis Act, shall have effect from 13th July, 2017.\n\n\f6\n\nSCHEDULE\n\n(Section 5)\n\n(Section 6(1)(c))\n\n“SECOND SCHEDULE\n\nGoods Exempted from the Levy\n\n1.\nSchedule to the Value Added Tax Act, Cap. 87.\n\nThe  food  items  specified  in  paragraph  20  of  the  First\n\n2.\nheading number 2710.19.10 of the Customs Tariff.\n\nKerosene imported for use as airline fuel falling under tariff\n\n3.\nnumber 2710.19.60 of the Customs Tariff.\n\nHeavy  fuel  oil  (Bunker  C)  falling  under  tariff  heading\n\nDrugs imported or purchased out of a bonded warehouse or\n4.\nthe purchase of drugs in Barbados where the drugs are issued by the\nBarbados Drug Service.\n\n5.(1)\nGoods imported or purchased out of a bonded warehouse by\nan  international  business  company  licensed  under  the  International\nBusiness  Company,  Cap.  77  or  a  society  with  restricted  liability\nthe  Societies  with  Restricted  Liability  Act,\norganized  under\nCap. 318B, where the products of those inputs are exported.\n\nWhere the products of the inputs referred to in sub-paragraph (1)\n(2)\nare not exported, the amount of the levy which was waived shall be paid\n\n\f7\n\nto the Comptroller of Customs by the international business company\nor the society with restricted liability, as the case may be.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2017.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2017.\n\nPresident\n\n"
}