{
  "bill_id": 230,
  "slug": "supplementary-estimates-no-4-20172018-2082559",
  "title": "Supplementary Estimates No. 4 2017-2018 $2,082,559",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/0e693ac1d38695338d5f057030db1de2.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2017-10-13",
  "first_reading": "2017-10-17",
  "gazette_date": "2017-10-17",
  "markdown": "HOUSE OF ASSEMBLY\nResolved that the sum of TWO MILLION, AND EIGHTY-TWO THOUSAND, FIVE HUNDRED AND FIFTY-NINE DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2017-2018 as shown in the Supplementary Estimates No.4 2016-2017 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2017 — 2018 No.4\n—\nHEAD Code Provision in Number Approved Estimates 2017 - 2018 Other Expenditure HEAD: 16 MINISTRY OF THE CIVIL SERVICE Program: 050 Civil Service Subprogram: 7025 General Management and 160507025 Coordination Services | Account Code: 102 — Other Personal Emoluments 429,679 HEAD: 23 MINISTRY OF HEALTH Program: 040 Direction and Policy Formulation Services Subprogram: 7045 General Management and 230407045 Coordination Services | Account Code: 785 — Assets Under Construction 786,339\nProvision in Supplementary Supplementary Provision Estimates Required No. 3\nOther Expenditure Other Expenditure\n201,005\n4,881,554\nADDENDUM\nSupplementary provision in the amount of $201,005.00 is required\nfor:\nHead 16\nMinistry of the Civil Service\nProgramme 050\nCivil Service\nSub-programme 7025 - General Management and Coordination Services\nAccount Code 102 - Other Personal Emoluments\nThe sum of $201,005.00 is required to meet additional costs under this item. Increased costs are associated with the payment of salaries, acting, entertainment and travelling allowances. These situations arose as a consequence of payment of officers and substitutes who are replacing persons acting outside of the Ministry.\nADDENDUM\nHead 23: Program 040: Subprogram 7045: Account Code 785: Ministry of Health Direction and Policy Formulation Services General Management and Coordination Services Assets Under Construction\nAmount Required: $1,881,554\nThe sun of $1,881,554 is required to provide funding for final payments towards the construction of the David Thompson Health and Social Services Complex.\n"
}