{
  "bill_id": 231,
  "slug": "employment-sexual-harassment-prevention-bill-2017-revised-20171018",
  "title": "Employment Sexual Harassment (Prevention) Bill, 2017 Revised 2017-10-18",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/748759a608a0364b2603f7d9ad875629.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2017-10-19",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "Revised 2017-10-18\n\nOBJECTS AND REASONS\n\nThis Bill would\n\n(a)\n\n(b)\n\n(c)\n\nmake  provision  for  the  protection  of  employees  in  both  the  public\nsector and private sector from sexual harassment at their workplace;\n\nprovide a framework for the reporting of sexual harassment cases by\nemployees and a method of resolving such cases;\n\nestablish  a  procedure  for  the  hearing  and  determination  of  matters\nrelated to sexual harassment; and\n\n(d)\n\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nMeaning of sexual harassment\n\nPolicy statement against sexual harassment\n\nEmployer not to allow unfair opportunities to be granted\n\nLiability of employer where unfair opportunities granted\n\nLodging of sexual harassment complaint with the employer\n\nProcedure to be followed by employer where sexual harassment is alleged\n\nDetermination of complaint by employer\n\n10.\n\nLodging of complaint with the Chief Labour Officer\n\n11.\n\nLodging a complaint against certain officials\n\n12.\n\nProcedure where complaints are received by the Chief Labour Officer\n\n13.\n\nPower of Chief Labour Officer to obtain information and documents\n\n14.\n\nDetermination of complaint by the Chief Labour Officer\n\n15.\n\nAppeal from decision of the Chief Labour Officer\n\n\f3\n\n16.\n\nReferral by Chief Labour Officer of matter to the Tribunal\n\n17.\n\nHearing of complaints by the Tribunal\n\n18.\n\nProcedure regarding inquiry by the Tribunal\n\n19.\n\nPowers with respect to evidence\n\n20.\n\nAttendance at enquiry\n\n21.\n\nDetermination of complaint by Tribunal\n\n22.\n\nEnforcement of Tribunal decisions and orders\n\n23.\n\nAppeal from decision of the Tribunal\n\n24.\n\nParticulars of offence not to be communicated\n\n25.\n\nProhibition of publication of proceedings\n\n26.\n\nProhibition of victimization of employees\n\n27.\n\nOffences related to the inquiry\n\n28.\n\nPenalty for making false complaint\n\n29.\n\nImmunity\n\n30.\n\nProsecutions\n\n31.\n\nRegulations\n\n32.\n\nAct to bind the Crown\n\n33.\n\nCommencement\n\n\f4\n\nSCHEDULE\n\nContent of Policy Statement Against Sexual Harassment\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  make  provision  for  the  protection  of  employees  from  sexual\n\nharassment in the workplace.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n(Prevention) Act, 2017.\n\nThis  Act  may  be  cited  as  the  Employment  Sexual  Harassment\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“client” means any person who conducts business with an employer;\n\n“complainant” means the person by whom or on whose behalf a complaint is\n\nlodged;\n\n“complaint” means a grievance referred to an employer, the Chief Labour Officer\n\nor the Tribunal under this Act;\n\n“contract of service” means any contract of service or apprenticeship, whether\n\nwritten or oral and whether expressed or implied;\n\n“employee” means an individual in the service of another person under a contract\n\nof service and includes,\n\n(a)\n\n(b)\n\n(c)\n\nan apprentice;\n\na person on probation;\n\na full or part-time employee; and\n\n(d)\n\na person who is remunerated by way of a commission;\n\n“employer” in relation to an employee means the person by whom the employee\nis employed, and in a case where the employment has ended, the person by\nwhom the employee was employed;\n\n“member” means a member of the Tribunal;\n\n“Minister” means the Minister responsible for Labour;\n\n\f7\n\n“respondent” means a person against whom a complaint has been lodged and\nincludes the employer where the employer is held responsible under this\nAct;\n\n“supervisor” means an employee who by virtue of that person’s employment is\n\nin a position of authority over the complainant;\n\n“Tribunal” means the Employment Rights Tribunal established under section 6\n\nof the Employment Rights Act, 2012 (Act 2012-9);\n\n“workplace” means any location or place where persons work and includes\n\n(a)\n\n(b)\n\nany other location or place where an employee is required to conduct\nthe business of the employer; or\n\nany location or place to which that person is sent by the employer for\nthe  purpose  of  receiving  training  or  attending  a  conference  on  the\nemployer’s behalf.\n\nMeaning of sexual harassment\n\n3.(1)\n\n(a)\n\nFor the purposes of this Act, sexual harassment includes\n# the  use  of  sexually  suggestive  words,  comments,  jokes,  gestures  or\nactions that annoy, alarm or abuse a person;\n\n(b)\n\nthe initiation of uninvited physical contact with a person;\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n# the initiation of unwelcome sexual advances or the requests of sexual\nfavours from a person;\n\n# asking  a  person  intrusive  questions  that  are  of  a  sexual  nature  that\npertain to that person’s private life;\n\n# transmitting sexually offensive writing or material of any kind;\n\nmaking sexually offensive telephone calls to a person; or\n\n(g)\n\nany other sexually suggestive conduct of an offensive nature\n\n# in circumstances where a reasonable person would consider the conduct to be\noffensive.\n\n\f8\n\nNothing in subsection (1) shall be interpreted as precluding a finding of\n\n(2)\nsexual harassment where there is a single incident.\n\nPolicy statement against sexual harassment\n\n4.(1)\n\nEvery employer shall ensure\n\n(a)\n\n(b)\n\n(c)\n\nthat there is a clear written policy statement against sexual harassment\nwithin the workplace for which that employer has responsibility;\n\nthat a statement of that policy is presented to each employee on the\ncommencement of employment with the employer; and\n\nthat  procedures  are  put  in  place  to  assist  every  employee  in\nunderstanding the policy statement.\n\nWithin 6 months of the commencement of this Act, every employer shall\n(2)\nensure that the written policy statement against sexual harassment referred to in\nsubsection (1) is prepared and that the statement is presented to each person who\nis employed by him.\n\nThe policy statement against sexual harassment referred to in subsection\n(3)\n(1) may contain any term that is consistent with this Act and an employer may\nconsult  with  employees  and  their  representatives  in  the  establishment  of  the\nstatement.\n\nThe policy statement against sexual harassment referred to in subsection\n\n(4)\n(1) must contain the terms set out in the Schedule.\n\n(5)\nA person who contravenes subsection (1) or (2) is guilty of an offence and\nis liable on summary conviction to a fine of $5 000 or to imprisonment for a term\nof 12 months or to both.\n\n(6)\n\nThe Minister may by order amend the Schedule.\n\n\f9\n\nEmployer not to allow unfair opportunities to be granted\n\n5.(1)\nAn employer or a supervisor of an employee shall not in any manner\nsuggest to an employee that the prospects or working conditions of that employee\nare contingent upon the employee’s acceptance or toleration of sexual advances.\n\nWhere subsection (1) is contravened, the aggrieved employee may lodge\n(2)\na complaint with the Chief Labour Officer and the Chief Labour Officer may take\nsuch action as he thinks necessary under section 12 to resolve the matter.\n\nLiability of employer where unfair opportunities granted\n\n6.(1)\nresult of\n\n(a)\n\n(b)\n\nWhere an employer grants employment opportunities or benefits as a\n\nan employee’s agreement to grant sexual favours to the employer; or\n\nan  employee’s  agreement  to  grant  sexual  favours  to  a  client  or  an\nemployee’s supervisor,\n\nan aggrieved employee who was denied an employment opportunity or benefit\nmay  lodge  a  complaint  with  the  Chief  Labour  Officer  and  the  Chief  Labour\nOfficer may take such action as he thinks necessary under section 12 to resolve\nthe matter.\n\nAn employer shall only be liable under subsection (1)  for the actions of a\n(2)\nclient or an employee’s supervisor where the arrangement was brought to the\nattention of the employer and the employer failed to take appropriate action.\n\nLodging of sexual harassment complaint with the employer\n\n7.\nWhere an employee alleges that he or she has been sexually harassed\nby another employee or by a client, the first mentioned employee may, within\n3  months  of  the  date  of  the  occurrence  of  the  event  that  constitutes  sexual\nharassment, lodge a complaint in writing with the employer.\n\n\f10\n\nProcedure to be followed by employer where sexual harassment is\nalleged\n\n8.\nemployer shall\n\nWhere a complaint is lodged with the employer under section 7, the\n\n(a)\n\n(b)\n\n(c)\n\n# in the case where the complaint is made against the employee, inform\nhim in writing of the complaint and its details within two workdays;\n\n# in the case where the complaint is made against the client, take such action as he considers appropriate in the circumstances to bring the\nmatter to the attention of the client; and\n\n# commence  investigation  of  the  complaint  within  14  days  of  the complaint being lodged and shall complete the investigation without\ndelay.\n\nDetermination of complaint by employer\n\n9.(1)\nWhere  after  the  investigation  is  conducted  under  section  8  the\nemployer finds that sexual harassment has been committed, the employer shall\n\n(a)\n\n(b)\n\nin  the  case  of  the  employee,  take  such  disciplinary  action  as  is\nappropriate; and\n\nin the case of the client, take such action as he considers appropriate\nin the circumstances to remedy the situation.\n\n(2)\nWhere  after  the  investigation  is  conducted  under  subsection  (1)  the\nemployer finds that sexual harassment has not been committed, the employer\nshall notify the complainant and the respondent in writing of his decision and the\nreason therefor.\n\n\f11\n\nLodging of complaint with the Chief Labour Officer\n\n10.(1)\n\nWhere\n\n(a)\n\n(b)\n\nsexual harassment continues after a complaint is made under section 7;\nor\n\nsexual harassment continues after action is taken by an employer under\nsection 9,\n\nthe aggrieved employee may lodge a complaint in writing with the Chief Labour\nOfficer within 3 months of the date of the occurrence of the event that constitutes\na continuation of sexual harassment.\n\nWhere the complainant is aggrieved by the findings of the employer under\n(2)\nsection 9, the aggrieved employee may lodge a complaint in writing with the\nChief Labour Officer within 3 months of the notification of the decision.\n\nLodging a complaint against certain officials\n\nWhere the allegation of sexual harassment is against the employer or\n11.(1)\nthe  chief  executive  officer  of  an  institution,  the  employee  shall  lodge  the\ncomplaint with the Chief Labour Officer within the time specified in section 7.\n\nWhere a complaint of sexual harassment is to be made against the Chief\n(2)\nLabour  Officer,  the  employee  shall  lodge  the  complaint  in  writing  with  the\nTribunal within 3 months of the date of the occurrence of the event that constitutes\nsexual harassment.\n\nProcedure where complaints are received by the Chief Labour Officer\n\n12.(1)\nemployee pursuant to section 5, 6, 10 or 11(1), the Chief Labour Officer shall\n\nWhere  the  Chief  Labour  Officer  has  received  a  complaint  from  an\n\n(a)\n\nnotify the respondent in writing of the complaint and the nature of the\ncomplaint;\n\n(b)\n\ncarry out investigations in relation to the complaint; and\n\n\f12\n\n(c)\n\nendeavour by mediation to effect a resolution of the matter.\n\n(2)\nThe Chief Labour Officer may, with respect to a complaint that is lodged\nand for the purposes of  mediation, make any enquiries that are thought necessary\nto effect a resolution of the matter.\n\nThe  Chief  Labour  Officer  shall  not  carry  out  investigations  into  a\n(3)\ncomplaint, or if investigations have commenced shall discontinue investigations,\nwhere the Chief Labour Officer is informed by the complainant\n\n(a)\n\n(b)\n\nthat the complainant does not wish the complaint to be investigated; or\n\nthat the investigations that have commenced should be discontinued.\n\nThe Chief Labour Officer may decide not to carry out investigations or\n\n(4)\nmay decide to discontinue any investigations into the complaint where\n\n(a)\n\nin the opinion of the Chief Labour Officer,\n\n(i)\n\nthe complaint is trivial;\n\n(ii)\n\nthe complaint is frivolous or vexatious; or\n\n(iii)\n\nthe complaint is not brought in good faith; or\n\n(b)\n\nthe complaint was not lodged within the period specified in this Act.\n\nWhere the Chief Labour Officer decides not to carry out investigations or\n(5)\ndecides  to  discontinue  an  investigation  in  relation  to  a  complaint,  the  Chief\nLabour Officer shall give notice in writing to the complainant and the respondent\nof that decision and the reason therefor.\n\nWhere the complainant is aggrieved with the decision of the Chief Labour\n(6)\nOfficer  made  pursuant  to  subsection  (4),  that  complainant  may,  within  3\nmonths of the notification of the decision, lodge a complaint in writing with the\nTribunal.\n\nPower of Chief Labour Officer to obtain information and documents\n\n13.(1)\nWhere  the  Chief  Labour  Officer  is  carrying  out  investigations\npursuant to section 12, and the Chief Labour Officer has reason to believe that a\n\n\f13\n\nperson  is  capable  of  furnishing  any  information  that  may  be  relevant  to  the\ninvestigation, the Chief Labour Officer may by notice in writing, served on that\nperson, require that person,\n\n(a)\n\n(b)\n\nto furnish the Chief Labour Officer with the relevant information; or\n\nto produce to the Chief Labour Officer any relevant documents as are\nspecified in the notice.\n\nThe  information  and  documents  referred  to  in  subsection  (1)  shall  be\n\n(2)\nfurnished and produced at a place and time specified in the notice.\n\nWhere a document is produced in accordance with subsection (1), the Chief\n\n(3)\nLabour Officer may\n\n(a)\n\n(b)\n\n(c)\n\ntake possession of the document and make a copy of the document or\ntake a copy of an extract from the document;\n\nretain possession of the document for such period as is necessary for\nthe purposes of the inquiry to which that document relates; or\n\nduring the period when he has possession of the document, permit a\nperson who would be entitled to inspect the document, if it was not in\nthe possession of the Chief Labour Officer, to inspect the document at\nany reasonable time.\n\nDetermination of complaint by the Chief Labour Officer\n\n14.(1)\nWhere a complaint is lodged under section 10 with the Chief Labour\nOfficer,  and  the  Chief  Labour  Officer  makes  a  finding,  he  shall  notify  the\ncomplainant and the respondent in writing of his decision.\n\nWhere the Chief Labour Officer makes a finding that sexual harassment\n\n(2)\nwas committed by the respondent, the Chief Labour Officer\n\n(a)\n\nmay, where the respondent is a co-worker, direct the employer, within\na specified time, to take such disciplinary action as is appropriate in\nthe circumstances;\n\n\f14\n\n(b)\n\n(c)\n\nshall in all cases, direct the employer to take appropriate action, within\na specified time, to ensure that the sexual harassment ceases; and\n\nmay direct the employer to submit a report to him within a specified\ntime on the status of the situation for any period of time.\n\nAppeal from decision of the Chief Labour Officer\n\nWhere a person is aggrieved by a decision of the Chief Labour Officer\n15.\nunder section 14, that person may, within 30 days of the date of the decision,\nappeal to the Tribunal against the decision.\n\nReferral by Chief Labour Officer of matter to the Tribunal\n\n16.\n\nWhere the Chief Labour Officer\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nis of the opinion that the respondent has failed without reasonable cause\nto comply with a direction given to him under section 14;\n\nis of the opinion that a matter referred to him under this Act cannot be\nsettled by mediation;\n\nhas  endeavoured  to  settle  a  matter  by  mediation  but  has  not  been\nsuccessful after 42 days of the lodging of the complaint;\n\nis of the opinion that a matter is of such a nature that an inquiry should\nbe conducted by the Tribunal; or\n\nis of the opinion that due to the seriousness of a matter, it should be\nheard by the Tribunal,\n\nthe Chief Labour Officer shall refer the matter to the Tribunal, and the Tribunal\nmay take such action as it thinks fit in the circumstances, including any action\nspecified in section 21.\n\n\f15\n\nHearing of complaints by the Tribunal\n\n17.(1)\nThe Employment Rights Tribunal shall, in accordance with this Act,\nhear complaints in respect of sexual harassment and any ancillary matters relating\nthereto.\n\nThe procedure for hearing complaints under the Employments Rights Act,\n(2)\n2012 (Act 2012-19) shall apply to complaints brought under this Act, unless this\nAct otherwise provides.\n\nProcedure regarding inquiry by the Tribunal\n\n18.(1)\nany matter referred to it under this Act.\n\nSubject to subsection (3), the Tribunal shall conduct an inquiry into\n\n(2)\n\nThe proceedings of the Tribunal shall be held in camera.\n\nThe  Tribunal  shall  not  conduct  an  inquiry  into  any  matter,  or  shall\n(3)\ndiscontinue  a  matter  that  was  commenced  where  the  complainant  advises  the\nTribunal in writing that the complainant does not wish an inquiry to be held or\ncontinued.\n\nThe Tribunal shall endeavour by such means as it considers reasonable to\n(4)\nresolve a complaint which has been referred to it and may take all reasonable\nsteps to effect a resolution of such complaint.\n\nIn order to effect a resolution of a complaint, the Tribunal may adjourn its\n(5)\nenquiry into any matter at any stage to facilitate negotiation by the parties with\na view to reaching a resolution.\n\nPowers with respect to evidence\n\n19.\n\nIn the course of an inquiry, the Tribunal may\n\n(a)\n\nreceive in evidence the transcript of evidence in any proceedings before\na court or other tribunal and may draw any inferences of fact that it\nconsiders proper;\n\n\f16\n\n(b)\n\n(c)\n\nadopt  any  findings,  decisions  or  judgements  of  a  relevant  court  or\ntribunal that may be applicable to the enquiry; and\n\nreceive  in  evidence  any  reports  of  fact  made  by  the  Chief  Labour\nOfficer.\n\nAttendance at enquiry\n\n20.\n\nThe Tribunal may by notice in writing direct\n\n(a)\n\n(b)\n\n(c)\n\nthe complainant;\n\nthe respondent; or\n\nany other person who in the opinion of the Tribunal may be able to\nprovide information on a complaint,\n\nto attend an inquiry for the purpose of resolving the matter.\n\nDetermination of complaint by Tribunal\n\n21.(1)\n\nWhere the Tribunal has held an inquiry under section 18, it may\n\n(a)\n\n(b)\n\ndismiss the complaint; or\n\nfind in favour of the complainant that the respondent has engaged in\nconduct that amounts to sexual harassment, and that the respondent\nshould not repeat or continue such conduct.\n\nWhere a finding is made under subsection (1)(b), the Tribunal may make\n\n(2)\nthe following declarations:\n\n(a)\n\nthat the respondent should compensate the complainant in an amount\nthat  the  Tribunal  determines;  and  such  compensation  may  include\ncompensation  for  injury  to  feelings  and  punitive  and  exemplary\ndamages;\n\n(b)\n\nthe respondent should pay the costs of the complainant.\n\nWhere the Tribunal finds that the complainant has been dismissed from\n(3)\nemployment by the respondent as a result of a sexual harassment complaint made\n\n\f17\n\nunder this Act, the Tribunal may take such action as it thinks fit in accordance\nwith the Employments Rights Act, 2012 (Act 2012-9).\n\nWhere the Tribunal determines that sexual harassment has been committed\n\n(4)\nby the respondent, the Tribunal may\n\n(a)\n\n(b)\n\ndirect the respondent or the employer to take any action necessary to\nensure that the sexual harassment ceases; and\n\ndirect the employer to submit a report to the Tribunal within such time\nas is specified by the Tribunal setting out what action has been taken\nand the effect of the action.\n\nThe decision of the Tribunal shall be in writing and shall include reasons\n(5)\nfor the decision, a statement of its findings on material questions of fact and a\nreference to the evidence or other material on which the findings are based.\n\nThe Tribunal shall ensure that the decision is served on each party to the\n\n(6)\nproceedings.\n\nEnforcement of Tribunal decisions and orders\n\n22.\nWhere a person fails to comply with any order or direction given by\nthe Tribunal under section 16 or 21 that person shall be liable to be proceeded\nagainst and shall be punished in like manner as if he were found guilty of contempt\nof court.\n\nAppeal from decision of the Tribunal\n\n23.\nAny person aggrieved by a decision made by the Tribunal may, within\n30 days of the notification of the decision, appeal against the decision to a Judge\nin Chambers.\n\nParticulars of offence not to be communicated\n\nWhere a complaint has been received under this Act, a person shall\n24.(1)\nnot, unless the Tribunal otherwise permits, divulge or communicate to any person\nany particulars of that complaint.\n\n\f18\n\n(2)\nAny person who contravenes subsection (1) is guilty of an offence and is\nliable on summary conviction to a fine of $10 000 or to imprisonment for a term\nof 2 years or to both.\n\nProhibition of publication of proceedings\n\n25.(1)\nAct or publish any information relating to proceedings under this Act.\n\nNo person shall publish a report of any proceedings held under this\n\nAny person who contravenes subsection (1) is guilty of an offence and is\n(2)\nliable on summary conviction to a fine of $10 000 or to imprisonment for a term\nof 2 years or to both.\n\nProhibition of victimization of employees\n\n26.(1)\nopportunities and terms and conditions of service of an employee who has\n\nNo employer shall carry out any action which adversely affects the\n\n(a)\n\n(b)\n\n(c)\n\nrejected that employer’s acts of sexual harassment;\n\nlodged a complaint under this Act;\n\ngiven testimony with respect to any investigation conducted or hearing\nheld  under  this  Act  in  connection  with  a  complaint  of  sexual\nharassment; or\n\n(d)\n\nparticipated in an investigation, procedure or hearing under this Act.\n\nNo  person  shall  subject  or  threaten  to  subject  another  person  to  any\n\n(2)\ndetriment on the ground that the other person\n\n(a)\n\n(b)\n\nhas made or proposes to make a complaint under this Act;\n\nhas furnished or proposes to furnish any information or any documents\nto a person exercising or performing any power or function under this\nAct; or\n\n(c)\n\nhas attended or proposes to attend an inquiry under this Act or to appear\nthere as a witness.\n\n\f19\n\n(3)\nA person who contravenes subsection (1) or (2) is guilty of an offence and\nis liable on summary conviction to a fine of $10 000 or to imprisonment for a\nterm of 2 years or to both.\n\nOffences related to the inquiry\n\nAny person who is directed to attend an inquiry for the purposes of\n27.(1)\nsection 20 and who fails without reasonable excuse to do so is guilty of an offence\nand is liable on summary conviction to a fine of $1 000 or to imprisonment for\na term of 6 months or to both.\n\n(2)\n\nAny person who\n\n(a)\n\n(b)\n\nfurnishes to the Chief Labour Officer or the Tribunal any information\nor makes a statement at an inquiry knowing that the information or\nstatement is false or misleading in a material particular;\n\nhinders  or  obstructs  the  Chief  Labour  Officer  or  any  other  labour\nofficer or any member of the Tribunal in the exercise of any of the\npowers conferred upon them by this Act,\n\nis guilty of an offence and is liable on summary conviction to a fine of $5 000 or\nto imprisonment for a term of 12 months or to both.\n\nPenalty for making false complaint\n\n28.\nA person who makes a false complaint of sexual harassment against\nanother person is guilty of an offence and is liable on summary conviction to a\nfine of $10 000 or to imprisonment for a term of 2 years or to both.\n\nImmunity\n\n29.\nNo action shall be brought against the Chief Labour Officer or any\nofficer  who  is  acting  on  the  behalf  of  the  Chief  Labour  Officer  in  respect  of\nanything done in good faith in the execution of the powers and duties conferred\non the Chief Labour Officer under this Act.\n\n\f20\n\nProsecutions\n\n30.\nThe  Chief  Labour  Officer  may,  although  not  an  attorney-at-law,\nprosecute or conduct before a court of summary jurisdiction, any proceedings\nrelating to an offence committed under this Act.\n\nRegulations\n\n31.\nthis Act.\n\nThe Minister may make regulations for the proper administration of\n\nAct to bind the Crown\n\n32.\n\nThis Act binds the Crown.\n\nCommencement\n\n33.\n\nThis Act comes into operation on a date to be fixed by Proclamation.\n\n\f21\n\nSCHEDULE\n\nContent of Policy Statement Against Sexual Harassment\n\n(Section 4(4))\n\nThe  policy  statement  against  sexual  harassment  referred  to  in  section  4(1)  must  contain  the\nfollowing provisions:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\na definition of sexual harassment that is substantially the same as the definition in\nsection 3;\n\na statement to the effect that every employee is entitled to employment free of sexual\nharassment;\n\na statement to the effect that the employer will make every reasonable effort to ensure\nthat no employee is subjected to sexual harassment;\n\na statement to the effect that the employer will take such disciplinary measures as\nthe employer deems appropriate against any person under the employer’s direction\nwho subjects any employee to sexual harassment;\n\na statement explaining how complaints of sexual harassment may be brought to the\nattention of the employer;\n\na statement to the effect that no person shall disclose the name of a complainant or\nthe name of the respondent or the circumstances related to the complaint to any person\nexcept where disclosure is necessary for the purposes of investigating the complaint\nor taking disciplinary measures in relation thereto; and\n\na statement informing employees of the provisions in this Act which gives them a\nright to make a complaint where sexual harassment is committed against them and\nthe relevant authority to whom the complaint must be made.\n\n\f22\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2017.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2017.\n\nPresident\n\n"
}