{
  "bill_id": 232,
  "slug": "criminal-records-rehabilitation-of-offenders-amendment-bill-2017",
  "title": "Criminal Records (Rehabilitation of Offenders) (Amendment) Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/a938a8faac18d53d8ec17c0b323e8fa8.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-12-06",
  "first_reading": "2017-12-13",
  "gazette_date": null,
  "markdown": "Explanatory Memorandum after page 6\n\n2017-07-26\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Criminal Records (Rehabilitation of Offenders)\nAct,  Cap.  127A  to  change  the  rehabilitation  periods  and  provide  for  related\nmatters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nRepeal and replacement of section 18 of Cap. 127A\n\nAmendment of section 19 of Cap. 127A\n\nAmendment of First Schedule to Cap. 127A\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Criminal Records (Rehabilitation of Offenders) Act,\nCap. 127A to change the rehabilitation periods and provide for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nOffenders) (Amendment) Bill, 2017.\n\nThis  Act  may  be  cited  as  the  Criminal  Records  (Rehabilitation  of\n\nRepeal and replacement of section 18 of Cap. 127A\n\nSection 18 of the Criminal Records (Rehabilitation of Offenders)\n2.\nAct, Cap. 127A, in this Act referred to as the principal Act, is deleted and the\nfollowing is substituted:\n\n“Board to inform applicant in writing\n\n18.(1)\nThe Board shall inform, in writing, every person making an\napplication under section 13 or section 19 whether the application is\napproved or rejected.\n\nWhere the Board rejects an application referred to in subsection\n\n(2)\n(1), the Board shall provide written reasons for its decision.”.\n\nAmendment of section 19 of Cap. 127A\n\n3.\nyears” and substituting the words “one year”.\n\nSection 19 of the principal Act is amended by deleting the words “2\n\nAmendment of First Schedule to Cap. 127A\n\n4.\nThe First Schedule to the principal Act is amended by deleting Part\nI of that Schedule and substituting Part I contained in the Schedule to this Act.\n\n\f5\n\nSCHEDULE\n\n“PART I\n\n(Section 4)\n\n(Section 5)\n\nREHABILITATION PERIODS\n\nColumn 1\nSentence\n\nColumn 2\nRehabilitation Period\n\nA sentence of imprisonment for a term\nnot exceeding one year\n\nA sentence of imprisonment for a term\nexceeding one year but not exceeding\n3 years\n\nA sentence of imprisonment for a term\nexceeding 3 years but not exceeding 7\nyears\n\nA non-custodial sentence\n\n3 years\n\n5 years\n\n10 years\n\n1 year\n\n”.\n\n\f6\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2017.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2017.\n\nPresident\n\n\fEXPLANATORY MEMORANDUM\n\nThe  Criminal  Law  (Rehabilitation  of  Offenders)  (Amendment)  Bill,  2017\namends the Criminal Law (Rehabilitation of Offenders) Act, Cap. 127A to make\nprovision for a reduction in the rehabilitation periods, to require the Board to\nprovide  reasons  for  rejecting  an  application  for  expungement  of  a  spent\nconviction and to reduce the period of time within which an applicant may re-\napply,  following  the  rejection  of  an  application  for  expungement  of  a  spent\nconviction.\n\nClause 1:\n\nprovides the short title of the Act.\n\nClause 2:\n\nClause 3:\n\nrepeals  and  replaces  section  18  of  the  principal  Act  to\nexplicitly require the Board to provide reasons for its rejection\nof an application for expungement from the record of a spent\nconviction.\n\namends section 19 of the principal Act to reduce the period of\ntime  within  which  an  applicant  may  re-apply  to  the  Board,\nfollowing  the  rejection  of  an  application  for  expungement\nfrom the record of a spent conviction.\n\nClause 4:\n\namends  Part  I  of  the  First  Schedule  to  the  principal  Act  to\nreduce the rehabilitation periods.\n\ni\n\n"
}