{
  "bill_id": 234,
  "slug": "road-traffic-amendment-bill-2017",
  "title": "Road Traffic (Amendment) Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/9ba85d692572392e080c69e2c5d735d4.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-11-22",
  "first_reading": "2017-11-22",
  "gazette_date": "2017-11-27",
  "markdown": "Explanatory Memorandum After page 40\n\n2017-10-20\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Road Traffic Act, Cap. 295 to make provision for\n\n(a)\n\n(b)\n\n(c)\n\nthe registration of manufacturers of registration number plates;\n\nthe regulation of all terrain vehicles;\n\nbreathalyser testing;\n\n(d)\n\ndisabled parking; and\n\n(e)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 295\n\nAmendment of section 10 of Cap. 295\n\nInsertion of sections 10E and 10F into Cap. 295\n\nAmendment of section 42 of Cap. 295\n\nInsertion of section 43A and 43B into Cap. 295\n\nInsertion of Part IVA into Cap. 295\n\nAmendment of section 61 of Cap. 295\n\nAmendment of section 69 of Cap. 295\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nInsertion of section 69A into Cap. 295\n\n11.\n\nRepeal and replacement of section 74 of Cap. 295\n\n12.\n\nInsertion of section 76A into Cap. 295\n\n13.\n\nInsertion of section 84A into Cap. 295\n\n14.\n\nRepeal and replacement of section 85 of Cap. 295\n\n15.\n\nInsertion of sections 85A to 85I into Cap. 295\n\n\f3\n\n16.\n\nInsertion of section 86A into Cap. 295\n\n17.\n\nInsertion of section 88A into Cap. 295\n\n18.\n\nInsertion of sections 89A and 89B into Cap. 295\n\n19.\n\nAmendment of section 94 of Cap. 295\n\n20.\n\nInsertion of section 106A into Cap. 295\n\n21.\n\nRepeal and replacement of section 119 of Cap. 295\n\n22.\n\nAmendment of section 124 of Cap. 295\n\n23.\n\nAmendment of Second Schedule to Cap. 295\n\n24.\n\nAmendment of Fourth Schedule to Cap. 295\n\n25.\n\nCommencement\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Road Traffic Act, Cap. 295 to make provision for the\nregistration of manufacturers of registration number plates, the regulation of\nall  terrain  vehicles,  breathalyser  testing,  disabled  parking  and  for  related\nmatters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n\nThis Act may be cited as the Road Traffic (Amendment) Act, 2017.\n\nAmendment of section 2 of Cap. 295\n\n2.\nas the principal Act is amended in subsection (1) by\n\nSection 2 of the Road Traffic Act, Cap. 295, in this Act referred to\n\n(a)\n\n(b)\n\ndeleting  the  definitions  of  “all  terrain  vehicle”,  ”driver”,  owner”,\n“trailer” and “vehicle” ; and\n\nsubstituting and inserting the following definitions in their respective\nalphabetical order:\n\n““ all terrain vehicle” means a recreational motorized vehicle that\n\n(a)\n\nis designed to travel on 3 or more low pressure tyres, has a\nseat  designed  to  be  straddled  by  the  operator  and  has\nhandlebars for steering control;\n\n(b)\n\nis primarily designated to travel over unimproved terrain, but\nis capable of travelling on a public road; and\n\n(c)\n\nmay be used for hire as a tour vehicle;\n\n“carriageway” means the part of the highway that is improved, designed\nor primarily used for vehicular traffic, but does not include the\nshoulder of the highway;\n\n“construction  zone”  means  an  area  of  a  public  road  on  which\nconstruction, maintenance or repair work is being carried out;\n\n“disabled  parking  permit”  means  a  parking  permit  issued  by  the\nLicensing Authority pursuant to section 88A for use by a person\nwith a disability or an organisation or corporation engaged in the\ntransportation of persons with disabilities;\n\n\f7\n\n“drive” means\n\n(a)\n\nin  relation  to  a  motor  vehicle,  having  control  over  the\nsteering, movement and propulsion of the motor vehicle; and\n\n(b)\n\nin relation to an animal, having control of the animal;\n\n“driver” means a person driving a motor vehicle, and includes\n\n(a)\n\na  person  in  charge  of  a  motor  vehicle  for  the  purpose  of\ndriving, where the vehicle is stationary on a road;\n\n(b)\n\na person acting as a steersman of a motor vehicle; and\n\n(c)\n\nany person driving a vehicle or animal;\n\n“driving licence” means\n\n(a)\n\n(b)\n\na licence referred to in section 61 authorising the holder to\ndrive  a  motor  vehicle  on  a  road  or  highway,  but  does  not\ninclude a learner’s permit; or\n\na licence or other authorisation granted to a person of another\njurisdiction authorising that person to drive a motor vehicle\non  a  road  or  highway  other  than  solely  for  the  purpose  of\nlearning to drive;\n\n“garage” means a place where motor vehicles are received for\n\n(a)\n\n(b)\n\n(c)\n\nstorage;\n\ninspection;\n\nexamination; or\n\n(d)\n\nrepair,\n\nwhether compensation is paid or not;\n\n“highway” includes a road, a common and public highway, an overpass,\nan underpass, carriageway, median strip, bridge, traffic island and\nany part of which is intended for and used by the general public\n\n\f8\n\nfor the passage of vehicles, animals and pedestrians and includes\nall road reserves, nature strips, footpaths and cycle paths thereof;\n\n“learner’s permit” means a permit issued under section 63;\n\n“median  strip”  means  the  portion  of  a  highway  so  constructed  as  to\nseparate traffic travelling in one direction from traffic travelling\nin the opposite direction or traffic travelling in the same direction\nby a physical barrier, or a raised or depressed, paved or unpaved\nseparation  area  that  is  not  intended  to  allow  the  crossing  of\nvehicular movement;\n\n“owner” means, in the case of a registered vehicle,\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\na person in whose name the vehicle is registered;\n\nthe person in charge or in possession of the motor vehicle\nwhere the registered owner is absent from Barbados;\n\nthe person in possession of the vehicle under a contract for\nhire purchase;\n\nwhere  there  are  several  persons  entitled  to  its  immediate\npossession, the person whose entitlement is paramount,\n\nand for the purposes of Part IV includes a person in possession of\na motor vehicle under a contract for hire;\n\n“parking”  means  the  standing  of  a  vehicle  whether  occupied  or  not,\nexcept when standing temporarily for the purpose of loading or\nunloading passengers or goods;\n\n“registration number plate” means an identification plate which bears\n\nthe registration number of a motor vehicle;\n\n“trailer” means\n\n(a)\n\na  vehicle  not  having  independent  motor  power  that  is\ndesigned to be drawn by a motor vehicle, but does not include\na side-car attached to a motor cycle; or\n\n\f9\n\n(b)\n\na  vehicle  that  is  drawn  by  another  motor  vehicle  on  a\nhighway;\n\n“vehicle” means\n\n(a)\n\n(b)\n\n(c)\n\na carriage, wagon, cart, motor vehicle, bicycle, tricycle, van,\nhandcart,  sledge,  truck,  barrow,  wheelchair  or  any  other\nmachine for the carriage of goods or persons on land;\n\nevery  conveyance  capable  of  being  propelled  or  drawn  on\nwheels or tracks by any means;\n\nwhere  the  context  permits,  an  animal  being  driven  or\nridden;”.\n\nAmendment of section 10 of Cap. 295\n\nSection  10  of  the  principal  Act  is  amended  in  subsection  (4A)  by\n3.\ndeleting the words “authorised by the Licensing Authority” and substituting\nthe words “registered under section 10E”.\n\nInsertion of sections 10E and 10F into Cap. 295\n\n4.\n10D, the following new sections:\n\nThe principal Act is amended by inserting immediately after section\n\n“Registration of manufacturers of registration number\nplates\n\n10E.(1)\n\nSubject to section 10F, no person shall\n\n(a)\n\n(b)\n\nmanufacture  registration  number  plates  unless  he\nregistered under this section; or\n\nis\n\nobtain registration number plates from a manufacturer who\nis not registered under this section.\n\n\f10\n\n(2)\nA  person  who  manufactures  registration  number  plates  is,  on\napplication to the Licensing Authority in such form as the Licensing\nAuthority approves and on payment to the Barbados Revenue Authority\nof such fee as the Minister of Finance by order prescribes, entitled to\nbe registered as a manufacturer of registration number plates.\n\nA person shall, upon making an application under subsection (2),\n\n(3)\nfurnish the Licensing Authority with\n\n(a)\n\n(b)\n\nthe name and address of the person, business or company to\nbe registered;\n\nthe certificate of registration issued under the Registration of\nBusiness  Names  Act,  Cap.  317  or  the  certificate  of\nincorporation issued under the Companies Act, Cap. 308 in\nthe case of a registered business or a company; and\n\n(c)\n\nany  other  relevant  particulars  that  the  Licensing  Authority\nmay require.\n\nThe Licensing Authority shall, on receiving proof of payment of\n(4)\nthe  fee  prescribed  pursuant  to  subsection  (2),  issue  a  certificate  of\nregistration.\n\nA certificate of registration issued in accordance with subsection\n\n(5)\n(4) is valid for a period of one year from the date of issue.\n\nThe Licensing Authority shall keep a record of the manufacturers\n\n(6)\nof registration number plates registered under this Act.\n\nA manufacturer of registration number plates shall not issue a\n(7)\nnumber plate in respect of a motor vehicle to any person unless that\nperson presents the following:\n\n(a)\n\n(b)\n\nan identification card;\n\na valid driving licence;\n\n\f11\n\n(c)\n\na valid registration card evidencing payment of the relevant\ntax in respect of the motor vehicle; and\n\n(d)\n\na valid certificate of insurance in respect of the motor vehicle.\n\n(8)\nA person who contravenes subsection (1) or (7) is guilty of an\noffence and is liable on summary conviction to a fine of $1 000 or to\nimprisonment for a term of 12 months or to both.\n\nTransitional provisions\n\nEvery person who is a manufacturer of registration number\n10F.(1)\nplates at the commencement of the Road Traffic (Amendment) Act,\n2017 shall, within a period of 4 months after the date of commencement,\ncomply with the requirements specified in section 10E.\n\nA person shall be permitted to obtain registration number plates\n(2)\nfrom a manufacturer who is not registered in accordance with section\n10E for a period of 4 months after the date of commencement of the\nRoad Traffic (Amendment) Act, 2017.”.\n\nAmendment of section 42 of Cap. 295\n\n5.\nand substituting the following:\n\nSection 42 of the principal Act is amended by deleting subsection (2)\n\n“(2)\nA  driver  of  a  motor  vehicle  who  does  not  have  with  him  the\ncertificate of insurance at the time he is required to produce it, shall\nproduce it at the police station designated by the member of the Police\nForce or the transport inspector referred to in subsection (1), within 24\nhours of the date on which he was required to produce it.”.\n\n\f12\n\nInsertion of section 43A and 43B into Cap. 295\n\n6.\n43 the following new sections:\n\nThe principal Act is amended by inserting immediately after section\n\n“Written-off vehicles\n\n43A.(1)\nWhere a motor vehicle that is registered under this Act and\ninsured is damaged in an accident, the motor vehicle becomes written-\noff when\n\n(a)\n\nthe cost of repairing the motor vehicle is more than the value\nof the motor vehicle and the owner of the vehicle decides not\nto repair the damage and to\n\n(i)\n\nkeep the motor vehicle; or\n\n(ii)\n\nsell or otherwise dispose of the motor vehicle; and\n\n(b)\n\nthe  insurance  company  with  which  the  motor  vehicle  is\ninsured under a contract of insurance\n\n(i)\n\n(ii)\n\npays  an  amount  determined  under  the  contract  of\ninsurance in relation to the damaged motor vehicle and\nacquires ownership of the motor vehicle; or\n\npays  an  amount  determined  under  the  contract  of\ninsurance in relation to the damaged motor vehicle less\nits value as salvage and does not acquire ownership of\nthe motor vehicle.\n\nWhere a motor vehicle is written-off pursuant to subsection (1),\n(2)\nthe insurance company shall register the particulars of the motor vehicle\nwith the Licensing Authority.\n\n\f13\n\n(3)\nAn insurance company shall, for the purpose of registering the\nparticulars of the motor vehicle pursuant to subsection (2), submit the\nfollowing information to the Licensing Authority:\n\n(a)\n\n(b)\n\n(c)\n\nthe name and address of the owner of the motor vehicle;\n\nthe make and model of the motor vehicle;\n\nthe engine number and chassis number of the motor vehicle;\nand\n\n(d)\n\nthe reason for the write-off.\n\nAn insurance company that fails to comply with the provisions\n(4)\nof  this  section  is  guilty  of  an  offence  and  is  liable  on  summary\nconviction to a fine of $5 000 and in the case of a continuing offence\nto a further fine of $500 for each day or part thereof during which the\noffence continues after which a conviction is first obtained.\n\nNotification of purchase of written-off vehicle\n\nWhere  a  person  purchases  a  motor  vehicle  that  has  been\n43B.\naccepted  by  an  insurance  company  as  a  write-off,  the  insurance\ncompany shall submit to the Licensing Authority the name and address\nof the purchaser no later than 14 days after the date of purchase of the\nmotor vehicle.”.\n\nInsertion of Part IVA into Cap. 295\n\n7.\nthe following new Part:\n\nThe principal Act is amended by inserting immediately after Part IV\n\n\f14\n\n“PART IVA\n\nALL TERRAIN VEHICLES\n\nNo driving of all terrain vehicles on public road or highway\n\n60B.\nvehicle on a public road or highway.\n\nSubject to section 60C, no person shall drive an all terrain\n\nDriving licence\n\n60C.\nor highway shall\n\nA person who drives an all terrain vehicle on a public road\n\n(a)\n\n(b)\n\n(c)\n\nbe the holder of a valid driving licence;\n\nbe over the age of 16 years; and\n\nhave  been  granted  special  permission  by  the  Licensing\nAuthority.\n\nRegistration and insurance\n\n60D.\nEvery owner of an all terrain vehicle shall register and insure\nthe vehicle in accordance with the provisions of sections 5 and 37 of\nthis Act respectively.\n\nProhibitions\n\n60E.\n\nNo person shall operate an all terrain vehicle\n\n(a)\n\n(b)\n\n(c)\n\nwithout due care and attention;\n\nwithout  reasonable  consideration  for  other  persons  on  the\nroad or highway;\n\nat  a  speed  greater  than  is  reasonable  and  safe  in  the\ncircumstances and at a speed greater than 50 kilometres per\nhour;\n\n\f15\n\n(d)\n\nwith a passenger, unless the all terrain vehicle was designed\nby  the  original  manufacturer  of  the  vehicle  for  the\ntransportation of passengers;\n\n(e)\n\nat night without using the prescribed lights;\n\n(f)\n\nfitted  with  seat  belts  installed  by  the  manufacturer  of  the\nvehicle, without using the seat belts in a properly adjusted\nand  securely  fastened  manner  while  the  vehicle  is  in\noperation.\n\nRules of operation\n\n60F.\n\nEvery driver of an all terrain vehicle shall\n\n(a)\n\nwhen approaching an oncoming vehicle, pass the vehicle on\nthe left;\n\n(b)\n\nyield the right of way to vehicles approaching from the right;\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nwhen  overtaking  another  vehicle,  pass  the  vehicle  on  the\nright;\n\nyield the right of way to all pedestrians that are approaching\nso close as to present a hazard;\n\nexcept  when  overtaking  another  vehicle,  maintain  a  safe\nfollowing distance behind any other vehicle;\n\nwhen circumstances warrant, signal his intention to turn by\nusing signal lights, if the vehicle is equipped with them or\nhand signals as described in the Highway Code;\n\non being requested or signalled to do so by a member of the\nPolice  Force,  unit  of  the  Department  of  Emergency\nManagement,  unit  of  the  Defence  Force,  unit  of  the  Fire\nService, unit of the Prison Service sounding a bell, siren or\nflashing a lamp, immediately stop the all terrain vehicle.\n\n\f16\n\nEquipment\n\nThe driver of an all terrain vehicle and every passenger being\n60G.\ncarried on an all terrain vehicle shall wear a helmet and protection for\nthe eyes of the type prescribed by the Minister.\n\nRecords to be kept\n\nEvery person engaged in the business of renting all terrain\n60H.(1)\nvehicles shall keep a record, signed by each person to whom a vehicle\nis rented, containing the following particulars:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe registration number of each vehicle rented;\n\nthe  name,  national  registration  number  or  equivalent\ninformation of the person to whom each vehicle is rented;\n\nthe date and time at which the vehicle is rented;\n\nthe time during which the vehicle is in the possession of the\nperson to whom it is rented; and\n\nany  other  information  which  the  Licensing  Authority  may\nrequire.\n\nA record kept pursuant to subsection (1) shall be made available\n(2)\nto any member of the Police Force in uniform who wishes to inspect it\nin  order  to  ascertain  whether  this  Act  and  the  regulations  are  being\ncomplied with.\n\nOffences\n\n60I.\nEvery person who contravenes any provision in this Part is\nguilty of an offence and is liable on summary conviction to a fine of $1\n000 or to imprisonment for a term of 6 months or to both.”.\n\n\f17\n\nAmendment of section 61 of Cap. 295\n\n8.\ninserting immediately before the words “driving licence” the word “valid”.\n\nSection  61  of  the  principal  Act  is  amended  in  subsection  (1)  by\n\nAmendment of section 69 of Cap. 295\n\n9.\nand substituting the following:\n\nSection 69 of the principal Act is amended by deleting subsection (1)\n\nSubject  to  section  62,  a  driving  licence  shall  not  be  issued  or\n\n“(1)\nendorsed as valid to an applicant who is\n\n(a)\n\nunder the age of 25 years, for the purpose of driving\n\n(i)\n\na public service vehicle that is not a self-driven or hired\ncar;\n\n(ii)\n\na motor tractor; or\n\n(iii)\n\na heavy goods vehicle; or\n\n(b)\n\nunder the age of 18 years for the purpose of driving a self-\ndriven or hired car.”.\n\nInsertion of section 69A into Cap. 295\n\n10.\n69 the following new section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Random alcohol and drug testing for drivers of articulated\nvehicles and public service vehicles\n\n69A.(1)\nA person who applies for and is granted a licence to drive\nan articulated vehicle or a public service vehicle shall, as a condition\n\n\f18\n\nof being granted the licence, be subject to random alcohol and drug\ntesting at the request of the Authority which issued the licence.\n\nA  test  referred  to  in  subsection  (1)  shall  be  carried  out  by  a\n\n(2)\nmedical practitioner.”.\n\nRepeal and replacement of section 74 of Cap. 295\n\n11.\nsubstituted:\n\nSection  74  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Production of driving licence or identification card\n\n74.(1)\nThe driver of a motor vehicle on a public road shall have his\ndriving  licence  or  a  government-issued  identification  card  in  his\npossession and produce it for examination on being required to do so\nby a member of the Police Force or a transport inspector in uniform, so\nthat the member of the Police Force or transport inspector is able to\nascertain\n\n(a)\n\n(b)\n\n(c)\n\nthe name and address of the holder of the driving licence;\n\nthe identity of the driver of the motor vehicle; or\n\nwhether the driver of the motor vehicle is licensed to drive\nthat particular class of motor vehicle.\n\nWhere a driver of a motor vehicle does not produce his driving\n(2)\nlicence but produces an identification card to a member of the Police\nForce or a transport inspector in uniform, that driver shall produce his\ndriving licence at the police station designated by the member of the\nPolice Force or the transport inspector within 24 hours of the date on\nwhich he was required to produce it.\n\n\f19\n\n(3)\nA person who contravenes subsection (1) or (2) is guilty of an\noffence and is liable on summary conviction to a fine of $1 000 or to\nimprisonment for a term of 12 months or to both.”.\n\nInsertion of section 76A into Cap. 295\n\n12.\n76 the following new section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Dishonoured cheques\n\n76A.(1)\nThe  Licensing  Authority  may  refuse  to  issue,  renew  or\nreplace  a  permit,  licence  or  registration  of  a  motor  vehicle  where\npayment made by cheque in respect of the permit, licence or registration\nis dishonoured by the financial institution on which it is drawn.\n\nThe issuer of the cheque referred to in subsection (1) shall be\n(2)\ncharged  an  administrative  fee  of  $50  by  the  Barbados  Revenue\nAuthority for handling the dishonoured cheque.\n\nWhere a cheque is dishonoured, the Licensing Authority shall\n(3)\nnotify the issuer and unless the outstanding payment is made within 7\ndays of the date of notification, the permit, licence or registration will\nbe cancelled.\n\nWhere  the  amount  of  the  outstanding  payment  is  paid  to  the\n(4)\nBarbados  Revenue  Authority  within  the  7  day  period  stipulated  in\nsubsection (3), the permit, licence or registration will be considered to\nbe valid.\n\n(5)\n\nNo person shall be able to\n\n(a)\n\n(b)\n\nrenew a permit or driving licence; or\n\nregister a motor vehicle\n\n\f20\n\nwhere  that  person  owes  the  Barbados  Revenue  Authority  an\noutstanding payment under this section.”.\n\nInsertion of section 84A into Cap. 295\n\n13.\n84 the following new section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Speed limit in construction zones\n\n84A.(1)\nat a speed greater than the speed specified in the regulations.\n\nNo person shall drive a motor vehicle in a construction zone\n\n(2)\nWhere  traffic  control  devices  placed  on  a  road  or  highway  at\neither end of a construction zone facing oncoming traffic indicate the\nmaximum speed permissible in the construction zone, no person shall\ndrive a vehicle in the construction zone at a rate of speed greater than\nthe speed indicated by the traffic control devices.\n\nA person who contravenes subsection (1) or (2) is guilty of an\n(3)\noffence and is liable on summary conviction to a fine of $1 000 or to\nimprisonment for a term of 12 months or to both.\n\nA  person  who  contravenes  subsection  (1)  or  (2)  shall  pay,  in\n(4)\naddition to the fine stated in subsection (3), where it is found that the\nrate of speed at which the motor vehicle was driven is\n\n(a)\n\n(b)\n\nless than 30 kilometres per hour over the maximum posted\nspeed limit, a fine of $50 for each kilometre per hour that the\nmotor vehicle was driven over the maximum posted speed\nlimit;\n\n30 kilometres per hour or more but less than 50 kilometres\nper hour over the maximum posted speed limit, a fine of $70\nfor each kilometre per hour that the motor vehicle was driven\nover the maximum posted speed limit;\n\n\f21\n\n(c)\n\n(d)\n\n50 kilometres per hour or more but less than 60 kilometres\nper hour over the maximum posted speed limit, a fine of $100\nfor each kilometre per hour that the motor vehicle was driven\nover the maximum posted speed limit; or\n\n60 kilometres per hour or more over the maximum posted\nspeed limit,  a fine of $200 for each kilometre per hour that\nthe motor vehicle was driven over the maximum posted speed\nlimit.”.\n\nRepeal and replacement of section 85 of Cap. 295\n\n14.\nsubstituted:\n\nSection  85  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Driving or being in charge of a motor vehicle while under\nthe influence of a drug or alcohol\n\n85.(1)\nNo person shall drive, attempt to drive or be in charge of a\nmotor vehicle on a road or in any other public place while that person\n\n(a)\n\nis under the influence of drink or a drug to such an extent as\nto be incapable of having proper control of the motor vehicle;\nor\n\n(b)\n\nhas consumed alcohol in such a quantity that the proportion\nin his breath or blood exceeds the prescribed limit.\n\nA person who contravenes subsection (1) is guilty of an offence\n\n(2)\nand is liable on summary conviction\n\n(a)\n\n(b)\n\nin  the  case  of  a  first  conviction,  to  a  fine  of  $5  000  or  to\nimprisonment for a term of 2 years, or both ; or\n\nin the case of a second or subsequent conviction, to a fine of\n$10 000 or to imprisonment for a term of 5 years, or both.\n\n\f22\n\nA person convicted of an offence under this section, unless the\n\n(3)\ncourt for any special reason thinks fit to order otherwise, shall\n\n(a)\n\n(b)\n\nin the case of a first conviction, be disqualified from holding\nor obtaining a driving licence from the date of the conviction\nfor a period of 12 months;\n\nin  the  case  of  a  second  conviction,  be  disqualified  from\nholding or obtaining a driving licence from the date of the\nconviction for a period of 5 years; and\n\n(c)\n\nin  the  case  of  a  subsequent  conviction,  be  permanently\ndisqualified from holding or obtaining a driving licence.\n\nWhere there is an appeal against a conviction under this section,\n(4)\na period of disqualification runs from the date of the conviction if the\nappeal  is  dismissed  or  allowed;  but,  if  the  appeal  is  discontinued,  a\nperiod of disqualification runs from the date of the discontinuance of\nthe appeal.\n\nFor the purposes of this section, a person is unfit to drive if his\n\n(5)\nability to drive properly is for the time being impaired. ”.\n\nInsertion of sections 85A to 85I into Cap. 295\n\n15.\n85 the following new sections:\n\nThe principal Act is amended by inserting immediately after section\n\n“Approval of devices by the Minister\n\n85A.\nfor\n\nThe Minister may, by order, approve the devices to be used\n\n(a)\n\nthe purpose of obtaining an indication of alcohol in a person’s\nbreath; and\n\n\f23\n\n(b)\n\nthe quantitative measuring of the proportion of alcohol in a\nperson’s breath.\n\nBreath test\n\n85B.(1)\nreasonable cause to suspect that\n\nWhere  a  member  of  the  Police  Force  in  uniform  has\n\n(a)\n\n(b)\n\n(c)\n\na person driving or in charge of a motor vehicle on a road or\nother public place has alcohol in his breath in excess of the\nprescribed limit;\n\na person has been driving or attempting to drive or has been\nin charge of a motor vehicle on a road or other public place\nwith alcohol in his breath in excess of the prescribed limit\nand the person still has alcohol in his breath; or\n\na person driving or in charge of a motor vehicle on a road or\nother  public  place  committed  a  traffic  offence  while  the\nvehicle was in motion,\n\nthe member of the Police Force may, subject to section 85G, require\nthat person to provide a specimen of breath for a breath test.\n\nThe specimen of breath shall be provided at the place where the\n(2)\nrequirement is made or at the police station nearest to that place, as soon\nas is reasonably practicable after the member of the Police Force makes\nthe requirement.\n\nThe member of the Police Force shall warn every person who is\n(3)\nrequired to provide a specimen in accordance with this section that a\nfailure to do so may render that person liable to prosecution.\n\nA  person  who,  without  reasonable  excuse,  fails  to  provide  a\n(4)\nspecimen of breath when required to do so is guilty of an offence and\nis liable on summary conviction to a fine of $1 000 or to imprisonment\nfor a term of 6 months or to both.\n\n\f24\n\nBreath analysis\n\n85C.(1)\nSubject  to  section  85G,  where  the  result  of  a  breath  test\ncarried out in accordance with section 85B indicates that there may be\npresent in a person’s breath, a proportion of alcohol that is in excess of\nthe  prescribed  limit,  a  member  of  the  Police  Force  in  uniform  may\nrequire that person to provide 2 specimens of breath for analysis.\n\nThe specimens of breath shall be provided the at the place where\n(2)\nthe requirement is made or at the police station nearest to that place, as\nsoon as is reasonably practicable after the member of the Police Force\nmakes the requirement.\n\nWhere 2 specimens of breath are provided for analysis, they shall\n\n(3)\nbe suitable if\n\n(a)\n\n(b)\n\n(c)\n\neach specimen is sufficient to enable the analysis to be carried\nout;\n\neach  specimen  is  provided  in  such  a  way  as  to  enable  the\nobjective of the analysis to be satisfactorily achieved; and\n\nthere is an interval of not less than 2 minutes and not more\nthan 10 minutes between the provision of specimens.\n\nThe  reading  from  the  specimen  which  indicates  the  lower\n(4)\nproportion of alcohol in the person’s breath shall be considered to be\nthe result of the breath analysis.\n\nThe member of the Police Force shall warn every person who is\n(5)\nrequired to provide the specimens in accordance with this section that\na failure to do so may render that person liable to prosecution.\n\nA  person  who,  without  reasonable  excuse,  fails  to  provide  2\n(6)\nspecimens of breath when required to do so is guilty of an offence and\nis liable on summary conviction to a fine of $1 000 or to imprisonment\nfor a term of 6 months or to both.\n\n\f25\n\nDuty to provide written statement\n\n85D.(1)\nA member of the Police Force shall, as soon as is practicable\nafter  completing  a  breath  analysis  in  accordance  with  section  85C,\nprovide the person who provided the specimens of breath with a written\nstatement which shall include the following:\n\n(a)\n\n(b)\n\n(c)\n\nthe date, time and place at which the specimen was taken;\n\nthe proportion of alcohol in the person’s breath as indicated\nby the device referred to in section 85A(a); and\n\nthe proportion of alcohol determined by the analysis to be\npresent in that person’s breath expressed in microgrammes\nof alcohol in one hundred millilitres of breath.\n\nThe statement referred to in subsection (1) shall be signed by the\n\n(2)\nmember of the Police Force.\n\nLaboratory test\n\n85E.(1)\nDuring the course of an investigation to determine whether\na  person  contravened  section  85,  a  member  of  the  Police  Force  in\nuniform may require the person to provide a specimen of blood or urine\nfor a laboratory test if\n\n(a)\n\n(b)\n\na device of the type referred to in section 85A is not available\nor  it  is,  for  any  other  reason,  not  practicable  to  use  such\ndevice; or\n\nthe  member  of  the  Police  Force  has  reasonable  cause  to\nbelieve  that,  for  medical  reasons,  the  person  is  unable  to\nprovide a specimen of breath,\n\nbut he shall not make the requirement where a breath analysis has been\ncarried  out  in  accordance  with  section  85C,  and  the  result  of  that\nanalysis is available.\n\n\f26\n\n(2)\n\nA specimen of blood or urine shall only be taken if\n\n(a)\n\n(b)\n\nthe person providing the specimen consents to the specimen\nbeing taken; and\n\nthe  specimen  is  taken  at  a  medical  clinic,  polyclinic  or\nhospital by a medical practitioner.\n\nThe  question  whether  it  shall  be  a  specimen  of  blood  or  a\n(3)\nspecimen of urine shall be decided by the member of the Police Force\nmaking  the  requirement,  except  where  a  medical  practitioner  has\nexpressed a professional opinion that one type of specimen cannot or\nshould not be taken, in which case the other type of specimen shall be\ntaken.\n\nThe specimen of blood or urine shall be provided as soon as is\n(4)\nreasonably practicable after the member of the Police Force makes the\nrequirement.\n\nThe member of the Police Force shall warn every person who is\n(5)\nrequired to provide a specimen in accordance with this section that a\nfailure to do so may render that person liable to prosecution.\n\nA  person  who,  without  reasonable  excuse,  fails  to  provide  a\n(6)\nspecimen of blood or urine when required to do so is guilty of an offence\nand  is  liable  on  summary  conviction  to  a  fine  of  $1  000  or  to\nimprisonment for a term of 6 months or to both.\n\nAccident resulting in serious injury or death\n\n85F.(1)\nNotwithstanding  section  85E(1),  where  an  accident\ninvolving a motor vehicle on a road or in any other public place results\nin serious injury or death, a member of the Police Force in uniform\nshall, subject to section 85G, require any person driving or in charge of\na motor vehicle involved in the accident to provide a specimen of blood\nor urine for a laboratory test.\n\n\f27\n\n(2)\nThe  member  of  the  Police  Force  shall  determine  whether  a\nspecimen of blood or a specimen of urine is required, except where a\nmedical practitioner has expressed a professional opinion that one type\nof specimen cannot or should not be taken, in which case the other type\nof specimen shall be taken.\n\n(3)\n\nThe specimen of blood or urine shall\n\n(a)\n\n(b)\n\nbe  provided  as  soon  as  is  reasonably  practicable  after  the\nmember of the Police Force makes the requirement; and\n\nbe  taken  at  a  medical  clinic,  polyclinic  or  hospital  by  a\nmedical practitioner.\n\nThe member of the Police Force shall warn every person who is\n(4)\nrequired  to  provide  a  specimen  under  this  section  that  a  failure  to\nprovide the specimen may render that person liable to prosecution.\n\nA  person  who,  without  reasonable  excuse,  fails  to  provide  a\n(5)\nspecimen when required to do so pursuant to this section is guilty of an\noffence and is liable on summary conviction to a fine of $1 000 or to\nimprisonment for a term of 6 months or to both.\n\nProtection for hospital patients\n\n85G.(1)\nA person who is at a hospital as a patient shall not be required\nto provide a specimen of breath for a breath test or a specimen of blood\nor urine for a laboratory test, unless the medical practitioner in charge\nof his case has been notified of the requirement.\n\nWhere  a  medical  practitioner  has  been  notified  in  accordance\n\n(2)\nwith subsection (1), he may\n\n(a)\n\n(b)\n\ncomply with the requirement and the specimen shall be taken\nat the hospital; or\n\nobject to the requirement on the ground that the provision of\na specimen will be detrimental to the health, proper care or\n\n\f28\n\ntreatment of the patient, in which case the specimen shall not\nbe taken.\n\nArrest of persons affected by a drug or alcohol\n\n85H.(1)\nA member of the Police Force may arrest, without a warrant,\na person who is driving or in charge of a motor vehicle on a public road\nor in any other public place where\n\n(a)\n\n(b)\n\nthe  results  of  a  breath  test  indicate  that  the  proportion  of\nalcohol in that person’s breath exceeds the prescribed limit;\nor\n\nthat person failed to provide a specimen of breath for a breath\ntest  when  required  to  do  so  and  the  member  of  the  Police\nForce has reasonable cause to suspect that the person is under\nthe influence of drink or a drug,\n\nbut a member of the Police Force shall not arrest a person who is at a\nhospital as a patient.\n\nWhere a member of the Police Force exercises his power of arrest\n\n(2)\nunder subsection (1)(b), he shall\n\n(a)\n\nconsult  a  medical  practitioner  to  determine  whether  the\nperson’s ability to drive is impaired by reason of drink or a\ndrug as soon as is reasonably practicable after the arrest; and\n\n(b)\n\nact on the advice of the medical practitioner.\n\nInterpretation\n\n85I.\n\nFor the purposes of sections 85 to 85H,\n\n“breath analysis” means the quantitative measuring of the proportion\nof alcohol in a person’s breath carried out by means of a device\napproved by the Minister under section 85A;\n\n\f29\n\n“breath test” means a preliminary test for the purpose of obtaining, by\nmeans of a device approved by the Minister under section 85A, an\nindication of whether the proportion of alcohol in a person’s breath\nexceeds the prescribed limit;\n\n“drug” includes any intoxicant other than alcohol;\n\n“fail” includes refuse;\n\n“laboratory  test”means  the  analysis  of  a  specimen  of  blood  or  urine\ntaken by a medical practitioner for the purpose of indicating\n\n(a)\n\n(b)\n\nthe presence of a drug in a persons’s blood or urine; or\n\nwhether  the  proportion  of  alcohol  in  a  persons’s  blood  or\nurine has exceeded the prescribed limit;\n\n“prescribed limit” means, as the case may require,\n\n(a)\n\n(b)\n\n(c)\n\n35 microgrammes of alcohol in 100 millilitres of breath;\n\n80 milligrammes of alcohol in 100 millilitres of blood; or\n\n107 milligrammes of alcohol in 100 millilitres of urine,\n\nor such other proportion as may be prescribed by regulations made\nby the Minister.”.\n\nInsertion of section 86A into Cap. 295\n\n16.\n86 the following new section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Duty not to litter a road or highway\n\n86A.(1)\nlitter from the motor vehicle onto a road or highway.\n\nNo person shall, while travelling in a motor vehicle, throw\n\n\f30\n\n(2)\nWhere a person referred to in subsection (1) throws litter from a\nmotor vehicle onto a road or highway and it cannot be determined by\na  member  of  the  Police  Force  or  a  transport  inspector  as  to  who  is\nresponsible for throwing the litter from the motor vehicle, the driver of\nthe motor vehicle shall be deemed to be the person who threw the litter\nonto the road or highway.\n\nA person who contravenes subsection (1) is guilty of an offence\n(3)\nand  is  liable  on  summary  conviction  to  a  fine  of  $200  or  to\nimprisonment for a term of 3 months or to both.\n\nFor  the  purpose  of  this  section  “litter”  includes  paper,  plastic\n\n(4)\nitems, glass and metal.”.\n\nInsertion of section 88A into Cap. 295\n\n17.\n88 the following new section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Disabled parking\n\n88A.(1)\nNo driver of a motor vehicle shall stop, stand or park a motor\nvehicle in a parking space that is designated for disabled parking by a\ndisabled parking sign, unless the motor vehicle prominently displays a\nvalid disabled parking permit issued by the Licensing Authority that\nclearly indicates that the motor vehicle is\n\n(a)\n\n(b)\n\nowned and operated by a person with a disability; or\n\nused for the transportation of a person with a disability.\n\nNo driver of a motor vehicle shall stop, stand or park a motor\n\n(2)\nvehicle in a manner which hinders the use of a dropped kerb unless\n\n(a)\n\nthe driver is picking up or setting down a passenger who is a\nperson with a disability; or\n\n\f31\n\n(b)\n\nthe dropped kerb is attached to a residential property and the\ndriver  has  received  the  consent  of  an  occupant  of  that\nproperty.\n\nA person who contravenes subsection (1) or (2) is guilty of an\n\n(3)\noffence and is liable on summary conviction to a fine of $500.\n\n(4)\n\nFor the purposes of this section\n\n“dropped kerb” means the portion of a sidewalk or pavement which has\nbeen  lowered  to  meet  the  level  of  the  road  to  facilitate  the\nmovement  of  a  person  with  a  disability  from  the  sidewalk  or\npavement to the road; and\n\n“person with a disability” means a person whose mobility is limited as\na  result  of  a  permanent  or  temporary  disability  that  makes  it\nimpossible or difficult for the person to walk.”.\n\nInsertion of sections 89A and 89B into Cap. 295\n\n18.\n89 the following new sections:\n\nThe principal Act is amended by inserting immediately after section\n\n“Abandoned vehicles\n\n89A.(1)\n\nNo person shall abandon a vehicle on a road or highway.\n\nA vehicle that is left standing on a road or highway for more than\n\n(2)\n24 hours is abandoned at that location.\n\nA  vehicle  is  not  abandoned  under  subsection  (2)  where  that\n\n(3)\nvehicle is parked in close proximity to a residential property\n\n(a)\n\nto facilitate access to the property by an occupant or visitor;\nand\n\n(b)\n\ndoes not obstruct other drivers, pedestrians or residents.\n\n\f32\n\nRemoval of abandoned vehicle\n\n89B.(1)\nThe Chief Technical Officer or any person authorised by him\nshall take all reasonable steps to remove and where necessary provide\nfor the safe custody of any motor vehicle where the vehicle is\n\n(a)\n\n(b)\n\n(c)\n\nabandoned pursuant to section 89A;\n\nleft  unattended  on  a  road  or  highway  in  a  manner  that\nobstructs the normal movement of traffic for a period of more\nthan one hour;\n\nparked  on  a  road  or  highway  in  a  manner  that  obstructs  a\npolice  officer,  traffic  warden,  transport  inspector  or  fire\nofficer in the course of his duty;\n\n(d)\n\nparked on a road or highway in contravention of this Act;\n\n(e)\n\n(f)\n\nparked  on  a  road,  highway  or  public  property  and  is  not\ndisplaying any registration number plates, a registration card,\nvalid registration number plates or a valid registration card;\n\nparked on a road or highway and is in such a condition that\nin  the  opinion  of  the  Chief  Technical  Officer  the  motor\nvehicle constitutes or presents a potential hazard to persons\nor property.\n\nWhere  a  motor  vehicle  is  removed  from  a  road  or  highway\n(2)\npursuant to subsection (1) and is kept in safe custody by or under the\ndirection of the Chief Technical Officer, the owner of the motor vehicle\nshall pay to the Barbados Revenue Authority\n\n(a)\n\n(b)\n\na fee of $200 for removing the motor vehicle from the road\nor highway; and\n\na fee of $100 per day for securing the motor vehicle in safe\ncustody.\n\n\f33\n\n(3)\nThe owner of a motor vehicle referred to in subsection (2) shall\non  the  payment  of  the  fees  mentioned  in  that  subsection  receive\npossession of the motor vehicle.\n\n(4)\n\nWhere a motor vehicle is kept in safe custody and it\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nis  in  such  a  condition  that  in  the  opinion  of  the  Chief\nTechnical Officer it ought to be disposed of;\n\ndoes  not  bear  a  valid  registration  card  pursuant  to  section\n16(1);\n\ndoes not bear registration number plates as required under\nsection 10; or\n\nhas no distinguishing marks by which the owner can identify\nthat the motor vehicle belongs to him,\n\nthe motor vehicle may be disposed of by the Chief Technical Officer\nafter it has been kept in safe custody for a period of 28 days.\n\nA motor vehicle may be disposed of by or under the direction of\n(5)\nthe Chief Technical Officer after steps have been taken by him to find\nthe  owner  of  the  motor  vehicle  and  the  Chief  Technical  Officer  has\nfailed to find the owner or the owner has failed to comply with a notice\nwhich was\n\n(a)\n\n(b)\n\nserved on him by the Chief Technical Officer; or\n\npublished  in  the  Official  Gazette  or  in  a  daily  newspaper\ncirculated in Barbados,\n\nrequiring him to pay the fees due under subsection (2) and remove the\nmotor vehicle within 21 days of the date of the notice.\n\nWhere,  before  a  motor  vehicle  is  disposed  of  by  the  Chief\n(6)\nTechnical Officer in pursuance of subsection (4), the motor vehicle is\nclaimed by a person who satisfies the Chief Technical Officer that he\n\n\f34\n\nis the owner and pays the sums specified by the Chief Technical Officer\nin respect of\n\n(a)\n\n(b)\n\n(c)\n\nremoval and storage costs;\n\nadvertising costs; and\n\nwhere applicable, any outstanding\n\n(i)\n\nroad taxes in respect of that motor vehicle; and\n\n(ii)\n\ndriving licence fees,\n\nthe  Chief  Technical  Officer  shall  permit  that  person  to  receive\npossession  of  the  motor  vehicle  within  such  period  as  may  be\nspecified.”.\n\nAmendment of section 94 of Cap. 295\n\n19.\nand substituting the following:\n\nSection 94 of the principal Act is amended by deleting subsection (2)\n\n“(2)\nAny  disqualification  imposed  at  the  discretion  of  the  Court\npursuant to subsection (1) shall not be limited to the driving of a motor\nvehicle  of  the  same  class  or  description  as  the  vehicle  in  relation  to\nwhich the offence was committed but shall apply to all of the categories\nof driving licences which that person holds pursuant to sections 68 and\n69.”.\n\nInsertion of section 106A into Cap. 295\n\n20.\n106 the following as section 106A:\n\nThe principal Act is amended by inserting immediately after section\n\n\f35\n\n“Suspension of public service vehicle permit\n\n106A.\nWhere a public service vehicle is driven by a person who is\nnot the owner of the vehicle and that person is convicted of 2 offences\ninvolving the same public service vehicle, the Transport Authority shall\nissue  a  warning  letter  to  the  owner  of  the  public  service  vehicle,\nindicating  that  where  the  person  is  convicted  of  a  third  offence\ninvolving that public service vehicle, the permit issued in respect of the\nvehicle shall be suspended for a period of 6 months.”.\n\nRepeal and replacement of section 119 of Cap. 295\n\n21.\nsubstituted:\n\nSection  119  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Issuance of the Highway Code by the Chief Technical\nOfficer\n\n119.(1)\nThe Chief Technical Officer shall, within a reasonable time\nafter the commencement of this Act, prepare a highway code, in this\nsection referred to as the “Code” containing such directions as appear\nto  him  to  be  proper  for  the  guidance  of  persons  using  the  road  or\nhighway.\n\nThe  Code  may  be  revised  and  published  every  5  years\n\n(2)\ncommencing from the year 2005.\n\nThe Chief Technical Officer shall cause the Code to be printed\n(3)\nand issued to the public at such price as the Cabinet, by order published\nin the Official Gazette, determines.\n\nFailure on the part of any person to observe the Code prepared\n(4)\npursuant to this section does not by itself render that person liable to\nprosecution but may in any proceedings, whether civil or criminal, be\n\n\f36\n\nrelied upon by any party to the proceedings as tending to establish or\nnegative  the  culpability  or  liability  that  is  in  question  in  those\nproceedings.\n\nA  Code  prepared  pursuant  to  subsection  (1)  is  subject  to\n\n(5)\naffirmative resolution.”.\n\nAmendment of section 124 of Cap. 295\n\n22.\n\nThe principal Act is amended in subsection (1)by\n\n(a)\n\ndeleting paragraph (t) and the following is substituted:\n\n“(t)\n\nthe safety, control and regulation of traffic whether on special\noccasions or otherwise, the use of vehicles of any class on\nany  road  and  the  conditions  under  which  vehicles  may  be\nconstructed, maintained and used;”;\n\n(b)\n\ninserting  immediately  after  paragraph  (t)  the  following  new\nparagraphs:\n\n“(u)\n\nthe proportions of alcohol in specimens of breath, blood or\nurine that represent the prescribed limit;\n\n(v)\n\ndisabled parking;\n\n(w)\n\nconstruction zones on a road or highway;\n\n(x)\n\nall terrain vehicles including\n\n(i)\n\nthe examination and regulation of all terrain vehicles;\n\n(ii)\n\nthe specifications of all terrain vehicles;\n\n(iii)\n\n(iv)\n\nthe  safety  equipment  required  for  use  on  all  terrain\nvehicles;\n\nthe  safety  training  required  for  persons  driving  all\nterrain vehicles;\n\n\f37\n\n(v)\n\nthe use of all terrain vehicles on a highway; and\n\n(vi)\n\nthe use of all terrain vehicles in the Scotland District\nArea;\n\nthe removal of abandoned vehicles from a road or highway;\n\nthe better carrying out of the provisions of this Act.”.\n\n(y)\n\n(z)\n\nAmendment of Second Schedule to Cap. 295\n\n23.\n(2) by\n\nThe Second Schedule to the principal Act is amended in paragraph\n\n(a)\n\ninserting  immediately  after  subparagraph  (a),  the  following  new\nsubparagraph:\n\n“(aa)\n\nthe font of the letters and figures must be Helvetica medium\nor bold;”;\n\n(b)\n\ndeleting subparagraph (c) and substituting the following:\n\n“(c)\n\neach letter and figure must be 76.2 millimetres in height;”;\n\n(c)\n\ndeleting subparagraphs (e), (f) and (g) and substituting the following:\n\n“(e)\n\nthe  total  width  of  the  space  occupied  by  a  letter  or  figure,\nexcept  in  the  case  of  the  figure  1,  must  be  at  least  44.45\nmillimetres but no more than 63.5 millimetres;\n\n(f)\n\n(g)\n\nthe space between adjoining letters or figures must be 12.7\nmillimetres;\n\nthere shall be a margin between the nearest part of any letter\nor figure and the top and bottom of the plate of at least 12.7\nmillimetres  and  between  the  nearest  part  of  any  letter  or\n\n\f38\n\nfigure  and  the  sides  of  the  plate  of  at  least  25.4\nmillimetres;”; and\n\n(d)\n\ndeleting subparagraph (i) and substituting the following:\n\n“(i)\n\nin the alternative diagram No. 2, the space between the letter\nand the figure shall be at least 25.4 millimetres but no more\nthan 38.1 millimetres.”.\n\nAmendment of Fourth Schedule to Cap. 295\n\n24.\nPart III and substituting the following:\n\nThe Fourth Schedule to the principal Act is amended by deleting\n\n\f39\n\n“PART III\n\nVehicles owned by the Government of Barbados or a Statutory Board\n\nCOLUMN 1\n\nCOLUMN 2\n\nUSE\n\nLETTER OR SYMBOL\n\n(a)\n\n(b)\n\n(c)\n\nby\n\nVehicle\nthe\nowned\nGovernment  of  Barbados  and\nthe  Governor-\nassigned\nGeneral\n\nto\n\nby\n\nVehicles\nthe\nowned\nGovernment  of  Barbados  and\nassigned\nto  Government\nMinistries and Departments for\nthe business of the Government\n\nby\n\nVehicles\nthe\nowned\nGovernment  of  Barbados  and\nassigned\nthe  Barbados\nDefence Force for the business\nof the Force\n\nto\n\nor GG\n\nMP\n\nD or 1-D to 10-D\n\n(d)\n\nVehicles owned by a Statutory\nBoard and used for the business\nof the Board\n\nML.\n\n”.\n\nCommencement\n\nThe amendments directed to be made to the principal Act by section\n25.\n18 of the Road Traffic (Amendment) Act, 2017 shall come into operation on a\ndate to be fixed by proclamation.\n\n\f40\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2017.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2017.\n\nPresident\n\n\fROAD TRAFFIC (AMENDMENT) ACT, 2017\n\nEXPLANATORY MEMORANDUM\n\nThe Road Traffic Act came into force on 1st June, 1981 to establish, inter\nalia, the duties of owners and drivers of motor vehicles and the standards that\nshould be observed by road users. Following the last amendment to the Act in\n2009,  a  number  of  changes  have  become  necessary.  Such  changes  include\ntechnological  and  social  advancements  such  as  breathalyser  testing  and\ndesignated parking areas for persons with disabilities respectively. It has also\nbecome necessary to provide for the regulation of all terrain vehicles, given the\nrecent increase in the use of those vehicles on the public roads.\n\nClause 1:\n\nClause 2:\n\nClause 3:\n\nClause 4:\n\nThis clause provides the short title of the amending Act. It may\nbe cited as the Road Traffic (Amendment) Act, 2017.\n\nThis  clause  amends  the  interpretation  section  of  the  Road\nTraffic Act, Cap. 295 (the Act), to delete and substitute the\nterms  “all  terrain  vehicles”,  ”driver”,  owner”,  “trailer”  and\n“vehicle”. The clause also amends the interpretation section\nof the Act to define the terms “carriageway”, “construction\nzone”, “disabled parking permit”, “drive”, “driving licence”,\n“garage”,  “highway”,  “learner’s  permit”,  “median  strip”,\n“parking” and “registration number plates”.\n\nThis clause amends section 10 of the Act to make reference\nto the newly inserted section 10E.\n\nThis clause amends the Act by inserting sections 10E and 10F.\nIt provides that manufacturers of registration number plates\nmust  be  registered  with  the  Licensing  Authority  and  what\nsteps must be taken to become registered. It imposes a duty\nupon  persons  to  obtain  registration  number  plates  from\nregistered manufacturers only. It also sets out the duty of a\n\ni\n\n\fRoad Traffic (Amendment) Act, 2017\n\nmanufacturer  to  ensure  that  he  is  presented  with  certain\ndocuments prior to issuing a registration number plate. It also\nprovides the penalty for manufacturing registration number\nplates without being registered, obtaining registration number\nplates from a manufacturer who is not registered and issuing\nnumber  plates  without  sight  of  the  relevant  documents.\nProvision is also made for the transitional period within which\na  manufacturer  of  number  plates  must  register  with  the\nLicensing Authority as well as the transitional period within\nwhich a person may obtain number plates from a manufacturer\nwho is not registered.\n\nThis  clause  amends  section  42  of  the  Act  to  provide  that  a\ndriver who is unable to produce an insurance certificate when\nrequired  to  do  so,  must  produce  the  certificate  at  a  police\nstation  designated  by  the  member  of  the  Police  Force  who\nrequested the certificate.\n\nThis  clause  amends  the  Act  by  inserting  sections  43A  and\n43B. Provision is made for the circumstances under which a\nvehicle  becomes  written-off  and  a  duty  is  imposed  on\ninsurance  companies  to  register  certain  particulars  of  the\nwritten-off vehicle with the Licensing Authority. The clause\nalso  provides  the  penalty  for  failing  to  comply  with  the\nregistration requirements. It also imposes a duty on insurance\ncompanies to submit the name and address of a purchaser of\na written-off vehicle within 14 days of the date of purchase.\n\nThis clause amends the Act by inserting Part IVA which deals\nwith all terrain vehicles. The Part comprises sections 60B to\n60I. These sections prohibit drivers from driving all terrain\nvehicles on public roads or highways unless they hold a valid\ndriving  licence  and  obtained  special  permission  from  the\nLicensing Authority. Section 60D imposes a requirement that\n\nii\n\nClause 5:\n\nClause 6:\n\nClause 7:\n\n\fClause 8:\n\nClause 9:\n\nClause 10:\n\nClause 11:\n\nRoad Traffic (Amendment) Act, 2017\n\nall  terrain  vehicles  be  registered  and  insured.  General\nprohibitions  on  the  operation  of  all  terrain  vehicles  are\nimposed by section 60E and section 60F lists the rules that\nmust be observed by drivers of all terrain vehicles. Sections\n60G,  60H  and  60I  respectively,  make  provision  for  the\nprotective  equipment  to  be  worn  when  travelling  on  an  all\nterrain vehicle, the duty of persons who rent all terrain vehicles\nto keep certain records and the penalty for failing to comply\nwith Part IVA.\n\nThis clause amends section 61 of the Act to make reference\nin subsection (1) to a valid driving licence, where that section\npreviously referred to a driving licence.\n\nThis clause amends section 69 of the Act to increase the age\nfrom  which  a  driving  licence  for  certain  vehicles  may  be\nissued and to specify the age from which a driving licence for\na self-driven or hired car may be granted.\n\nThis clause amends the Act to insert section 69A which makes\nprovision for random alcohol and drug tests to be carried out\non persons who drive articulated vehicles and persons who\ndrive public service vehicles.\n\nThis clause amends the Act by repealing and replacing section\n74. The section imposes a requirement upon drivers of motor\nvehicles  on  public  roads  to  have  a  driving  licence  or  an\nidentification card for presentation to a member of the Police\nForce or a transport inspector, if required to do so. The section\nalso makes provision for the procedure to followed when a\ndriver is unable to produce his driving licence and the penalty\nfor failing to comply with a requirement to produce a driving\nlicence or an identification card.\n\niii\n\n\fClause 12:\n\nClause 13:\n\nClause 14:\n\nClause 15:\n\nRoad Traffic (Amendment) Act, 2017\n\nThis clause amends the Act by inserting section 76A which\nmakes provision for the action to be taken by the Licensing\nAuthority where a payment made by cheque in respect of a\npermit, licence or registration is dishonoured. It also provides\nthat no person who has monies outstanding to the Barbados\nRevenue Authority will be able to renew a permit or driving\nlicence or register a motor vehicle.\n\nThis clause amends the Act by inserting section 84A which\nimposes a prohibition on driving at a speed that is greater than\nthe  speed  limit  in  a  construction  zone  and  provides  the\npenalties for persons who contravene the prohibition.\n\nThis clause amends the Act by repealing and replacing section\n85 and provides for the offence of driving, attempting to drive\nor being in charge of a motor vehicle while under the influence\nof drink or a drug, or having consumed alcohol in excess of\nthe prescribed limit. Provision is also made for more severe\npenalties  for  persons  who  are  guilty  of  offences  under  the\nsection.\n\nThis clause amends the Act by inserting sections 85A to 85I\nwhich  pertain  to  breathalyser  testing  and  related  matters.\nProvision is made for the approval of the relevant breathalyser\nequipment  by  the  Minister,  the  circumstances  under  which\npersons may be required to provide a specimen of breath and\nthe procedure to be followed when a requirement to provide\na specimen of breath is made. In addition, provision is made\nfor the circumstances under which persons may be required\nto provide specimens of blood or urine and the procedure to\nbe  followed  when  persons  are  required  to  provide  such\nspecimens. Provision is also made for the power of members\nof the Police Force to make an arrest, without a warrant, in\nspecified  circumstances  and  protection  of  hospital  patients\n\niv\n\n\fClause 16:\n\nClause 17:\n\nClause 18:\n\nClause 19:\n\nRoad Traffic (Amendment) Act, 2017\n\nfrom  being  arrested  and  from  being  required  to  provide  a\nspecimen,  in  the  absence  of  approval  from  the  medical\npractitioner in charge of their cases.\n\nThis clause amends the Act by inserting sections 86A which\nimposes  a  prohibition  on  littering  on  a  road  or  highway.\nProvision is also made for the penalty where persons fail to\ncomply with the section.\n\nThis clause amends the Act by inserting section 88A which\nprovides  for  disabled  parking.  Provision  is  made  for  the\ncircumstances under which persons will be permitted to park\nin a parking space that is designated for disabled parking. The\nsection also imposes a prohibition on drivers impeding the use\nof a dropped kerb and provides the circumstances under which\na driver may stop, stand or park a vehicle in front of a dropped\nkerb. Provision is also made for the penalty when persons fail\nto comply with the section.\n\nThis clause amends the Act by inserting sections 89A and 89B\nwhich make provision for abandoned vehicles. Section 89A\nimposes a prohibition on abandoning a vehicle on a road or\nhighway and states when a vehicle is considered abandoned.\nSection 89B makes provision for the removal of abandoned\nvehicles by the Chief Technical Officer and the procedure to\nbe followed when such vehicles are removed. Provision is also\nmade for the disposal of abandoned vehicles and the steps to\nbe undertaken by the owners of abandoned vehicles to recover\nthose vehicles.\n\nThis clause amends section 94(2) of the Act to provide that\nwhen  a  court  orders  that  a  person  is  disqualified  from\nobtaining  a  driving  licence,  that  penalty  will  apply  to  all\ncategories of driving licences that the person holds and is no\n\nv\n\n\fClause 20:\n\nClause 21:\n\nClause 22:\n\nClause 23:\n\nClause 24:\n\nClause 25:\n\nRoad Traffic (Amendment) Act, 2017\n\nlonger limited to a vehicle of the same class or description as\nthe vehicle in relation to which the offence was committed.\n\nThis clause amends the Act by inserting section 106A which\nprovides  for  the  issuance  by  the  Transport  Authority,  of\nwarning letters to the owners of public service vehicles. The\nsection provides that the warning letters must notify owners\nof public service vehicles that the permits issued in respect of\nthose vehicles will be suspended for 6 months if a driver of a\npublic service vehicle, having been convicted of 2 offences\ninvolving the same public service vehicle, is convicted of a\nthird offence involving that vehicle.\n\nThis clause amends the Act by repealing and replacing section\n119 which provides for the issuance of a highway code by the\nChief Technical Officer, rather than by the Commissioner of\nPolice. In addition, provision is now made for the time within\nwhich the code must be revised and published.\n\nThis  clause  amends  section  124  of  the  Act  by  inserting\nadditional matters in respect of which the Minister may make\nregulations.\n\nThis clause amends the Second Schedule to the Act by making\nprovision  for  the  font  and  reduction  in  certain  sizing\nrequirements of the letters and figures on registration number\nplates.\n\nThis clause amends Part III of the Fourth Schedule to the Act\nto include a vehicle assigned to the Governor General.\n\nThis clause provides that certain sections in the Act will come\ninto operation on a date to be fixed by proclamation.\n\nvi\n\n"
}