{
  "bill_id": 236,
  "slug": "protection-of-agricultural-products-and-livestock-bill-2017",
  "title": "Protection of Agricultural Products and Livestock Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/5ca1220778f91e8c1858c71bab6e6563.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-11-29",
  "first_reading": "2017-11-29",
  "gazette_date": "2017-11-27",
  "markdown": "OBJECTS AND REASONS\nThis Bill would make provision for the\n(a) regulation of farmers and vendors; and\n(b) prevention and control of praedial larceny.\n2017/09/20\nArrangement of Sections\nPARTI\nPRELIMINARY\nShort title\nInterpretation\nPART II\nADMINISTRATION\nAdministration\nRegisters\nPART III\nPRAEDIAL LARCENY WARDENS\nDefinitions\nAppointment of a praedial larceny warden\nDuties of a praedial larceny warden\nPART IV\nREGISTRATION OF FARMERS\nRegistration of farmers\nPART V\nREGISTRATION OF VENDORS\n9. Registration of vendors\nPART VI\nTRANSACTIONS INVOLVING AGRICULTURAL PRODUCTS OR LIVESTOCK\n10. Certificate of Purchase\n11. Certificate of Transfer of Livestock Ownership\n12. Certificate of Conveyance of Agricultural Products\n13. Certificate of Conveyance of Livestock\n14. Imported agricultural products or livestock\n15. Stolen agricultural products or livestock\nPART VII\nTRIAL, RESTITUTION AND SALE\n16. Trial\n17. Restitution\n18. Sale of livestock and perishable agricultural products\n19. Regulations\n20. Repeal of Cap. 142A\n21, Commencement\nPART VIII\nMISCELLANEOUS\nBARBADOS\nA Bill entitled\nAn Act to provide for the\n(a) regulation of farmers and vendors; and\n(b) prevention and control of praedial larceny.\nENACTED by the Parliament of Barbados as follows:\n6\nPARTI\nPRELIMINARY\nShort title\n1. This Act may be cited as the Protection of Agricultural Products and Livestock Act, 2017.\nInterpretation\n2. In this Act,\n“agricultural products”includes\n(a) vegetables, seeds, bulbs, trees, roots, tubers, fruit, plants or products thereof;\n(b) products of the following industries:\n(i) apiary;\n(ii) aquaculture;\n(iii) dairy;\n(iv) horticulture;\n(v) hydroponics;\n(vi) permaculture; and\n(vii) vermiculture;\n(c) planting material;\n(d) fresh water fish,\nand all products grown in or on land that is produced for the purpose of human consumption or for forage products cultivated for animals,\n7\n“apiary” means products including honey, beeswax, royal jelly, bee pollen, bees, propolis, nucs and queens;\n“aquaculture” means the farming of both fresh water and marine fish, shell fish or plants in water environments, including ponds and tanks;\n“Certificate of Conveyance of Agricultural Products” means the certificate referred to in section 12;\n“Certificate of Purchase” means the certificate referred to in section 10;\n“Certificate of Conveyance of Livestock” means the certificate referred to in section 13;\n“Certificate of Transfer of Livestock Ownership” means the certificate referred to in section 11;\n“Commissioner” has the same meaning assigned to it by the Police Act, Cap. 167;\n“dairy” means any product derived from cows or goats, including milk, butter and cheese;\n“farm” means land or property used for the cultivation of agricultural products or the rearing of livestock;\n“farmer” means a person registered in accordance with this Act to engage in the cultivation of agricultural products or the rearing of livestock for a living;\n“horticulture” means the cultivation of fruits, vegetables, flowers and ornamental plants or shrubs;\n“hydroponics” means the growing of plants without soil, in nutrient solutions with or without the use of an artificial medium to provide mechanical support;\n“livestock” means an animal that is commonly reared for the purpose of human consumption, including poultry;\n8\n“permaculture” means a method of agricultural production that integrates the use of renewable natural resources to create efficient self-sustaining ecosystems;\n“poultry” includes any fowl, chicken, turkey, duck, goose or other bird commonly reared for the purpose of human consumption and the eggs obtained from any such bird;\n“retailer” includes a supermarket, shop or other entity that packages agricultural products for sale or disposal to the public;\n“vermiculture” means the process of using worms to decompose organic food waste turning waste into nutrient-rich material capable of supplying necessary nutrients to help sustain plant growth;\n“vendor” means a person registered in accordance with this Act to sell agricultural products or livestock;\n“vehicle” has the meaning assigned to it by the Road Traffic Act, Cap. 295; and\n“warden” means a member of the Royal Barbados Police Force and includes a person appointed pursuant to section 6.\nPART II\nADMINISTRATION\nAdministration\n3.(1) The Chief Agricultural Officer is responsible for the administration of this Act.\n(2) Notwithstanding subsection (1) the Minister may, in writing, delegate specific powers under this Act to a public officer, or agency as he considers appropriate.\nRegisters\n4.01) The Chief Agricultural Officer shall keep the following registers:\n(a) the Register of Farmers; and\n(b) the Register of Vendors.\n(2) The registers kept in accordance with subsection (1) shall contain such particulars as are prescribed by the Minister.\nPART III\nPRAEDIAL LARCENY WARDENS\nDefinitions\n5. In this Part,\n“Minister” means the Minister responsible for the Police Force; and\n“Police Force” has the meaning assigned to it by section 2 of the Police Act, Cap. 167.\nAppointment of a praedial larceny warden\n6. The Commissioner may, with the approval of the Minister and subject to such conditions as the Minister directs, appoint by instrument in writing, a member of an organization or any other person to be a praedial larceny warden.\nDuties of a praedial larceny warden\n7.1) A praedial larceny warden shall\n(a) inspect the registration of farmers and vendors;\n(b) ensure that a retailer has obtained a Certificate of Purchase in respect of agricultural products;\n10\n(c) detect the commission of any offence under this Act;\n(d) apprehend a person\n(i) found committing an offence under this Act;\n(ii) who is reasonably suspected of committing an offence under this Act; or\n(iii) who may be charged with committing an offence under this Act; and\n(e) perform all of the duties of a praedial larceny warden specified by this Act.\n(2) A praedial larceny warden shall, while in the execution of his duty, wear such uniform as the Commissioner, with the approval of the Minister, directs.\n(3) Where a praedial larceny warden has reasonable grounds to suspect that a person has contravened the provisions of this Act, the warden may\n(a) stop a vehicle and, upon informing the person in charge of the vehicle, may search the vehicle or search any parcel or package of any kind found in the vehicle; and\n(b) seize any agricultural products or livestock which may be found in the vehicle during a search executed by the warden.\n(4) A praedial larceny warden may arrest a person who commits an offence under this Act.\n(5) A person who\n(a) fails to comply with the directions given by a praedial larceny warden while on duty; or\n(b) obstructs a praedial larceny warden in the execution of his duty,\nis guilty of an offence and is liable on summary conviction to a fine of $5000 or to imprisonment for 3 years or to both.\n11\nPART IV\nREGISTRATION OF FARMERS\nRegistration of farmers\n8.(1) A person shall not operate as a farmer unless he has been registered to do so under this Act.\n(2) A person who desires to operate as a farmer under this Act shall apply to the Chief Agricultural Officer in the prescribed form.\n(3) A person who contravenes subsection (1) is guilty of an offence and is liable on summary conviction to a fine of $5 000 or to imprisonment for 3 years or to both.\nPART V\nREGISTRATION OF VENDORS\nRegistration of vendors\n9.01) Subject to subsection (3), a person shall not operate as a vendor unless he has been registered to do so under this Act.\n(2) Subject to subsection (3), a person who desires to operate as a vendor under this Act shall apply to the Chief Agricultural Officer in the prescribed form.\n(3) Subsections (1) and (2) shall not apply to retailers.\n(4) A person who contravenes subsection (1) is guilty of an offence and is liable on summary conviction to a fine of $5 000 or to imprisonment for 3 years or to both.\n12\nPART VI\nTRANSACTIONS INVOLVING AGRICULTURAL PRODUCTS OR LIVESTOCK\nCertificate of Purchase\n10.(1) A person shall not purchase or in any other manner obtain possession or custody of agricultural products unless, at the time of purchase or of obtaining possession or custody of the agricultural product, the person has obtained a Certificate of Purchase from a person who is seeking to sell or dispose of the agricultural products.\n(2) Aperson shall not sell or otherwise dispose of agricultural products unless at the time of sale or disposal the person issues a Certificate of Purchase to the purchaser or any other person obtaining possession or custody of the agricultural products.\n(3) A person who is required to issue a Certificate of Purchase, in accordance with subsections (1) and (2), shall apply to the Chief Agricultural Officer, in the prescribed manner, for a Certificate of Purchase Book which shall be in the prescribed form.\n(4) A Certificate of Purchase shall be produced by the purchaser of agricultural products or any other person obtaining possession or custody of the agricultural products at the request of a warden.\n(5) A person who forges or produces for inspection a false\n(a) Certificate of Purchase; or\n(b) Certificate of Purchase Book,\nis guilty of an offence and is Jiable on summary conviction to a fine of $10 000 or to imprisonment for 5 years or to both.\n13\n(6) Apperson who contravenes subsections (1), (2) or (4) is guilty of an offence and is liable on summary conviction to a fine of $10 000 or to imprisonment for 5 years or to both.\nCertificate of Transfer of Livestock Ownership\n11.01) Where a person desires to sell, barter, give away or in any other manner dispose of livestock, he shall issue a Certificate of Transfer of Livestock Ownership to the person acquiring the livestock.\n(2) The person acquiring livestock in accordance with subsection (1) shall keep the Certificate of Transfer of Livestock Ownership for the duration of the life of the animal or until such time as the livestock is disposed of.\n(3) A person who is required to issue a Certificate of Transfer of Livestock Ownership, in accordance with subsection (1), may apply to the Chief Agricultural Officer, in the prescribed manner, for a Certificate of Transfer of Livestock Ownership Book which shall be in the prescribed form.\n(4) A Certificate of Transfer of Livestock Ownership shall be produced by the person, referred to in subsection (2), at the request of a warden.\n(5) A person who forges or produces for inspection a false\n(a) Certificate of Transfer of Livestock Ownership; or\n(b) Certificate of Transfer of Livestock Ownership Book,\nis guilty of an offence and is liable on summary conviction to a fine of $10 000 or to imprisonment for 5 years or to both.\n(6) Aperson who contravenes subsections (1), (2) or (4) is guilty of an offence and is liable on summary conviction to a fine of $10 000 or to imprisonment for 5 years or to both.\nCertificate of Conveyance of Agricultural Products\n12.(1) A person shall not transport agricultural products by vehicle without a Certificate of Conveyance of Agricultural Products issued by the owner of the\n14\nagricultural products or the authorised agent of the owner of the agricultural products.\n(2) A person who desires to have their agricultural products transported by vehicle shall issue a Certificate of Conveyance of Agricultural Products to the person who is transporting the agricultural products.\n(3) Where an owner of agricultural products is transporting by vehicle or other means of conveyance his own agricultural products he shall be required, if requested to do so by a warden, to produce proof of ownership of the agricultural products being transported.\n(4) A person who is required to issue a Certificate of Conveyance of Agricultural Products, in accordance with subsection (1), may apply to the Chief Agricultural Officer, in the prescribed manner, for a Certificate of Conveyance of Agricultural Products Book which shall be in the prescribed form.\n(5) A Certificate of Conveyance of Agricultural Products shall be produced by a person who is transporting agricultural products at the request of a warden.\n(6) A person who forges or produces for inspection a false\n(a) Certificate of Conveyance of Agricultural Products; or\n(b) Certificate of Conveyance of Agricultural Products Book,\nis guilty of an offence and is hable on summary conviction to a fine of $10 000 or to imprisonment for 5 years or to both.\n(7) A person who contravenes subsections (1), (2) or (5) is guilty of an offence and is liable on summary conviction to a fine of $10 000 or to imprisonment for 5 years or to both.\nCertificate of Conveyance of Livestock\n13.1) A person shall not transport livestock by vehicle without a Certificate of Conveyance of Livestock issued by the owner of the livestock or the authorised agent of the owner of the livestock.\n15\n(2) A person who desires to have their livestock transported by vehicle shall issue a Certificate of Conveyance of Livestock to the person who is transporting the livestock.\n(3) Where an owner of livestock is transporting by vehicle his own livestock he shall be required, if requested to do so by a warden, to produce proof of ownership of the livestock being transported.\n(4) A person who is required to issue a Certificate of Conveyance of Livestock, in accordance with subsection (1), may apply to the Chief Agricultural Officer, in the prescribed manner, for a Certificate of Conveyance of Livestock Book which shall be in the form prescribed.\n(5) A Certificate of Conveyance of Livestock shall be produced by a person who is transporting livestock at the request of a warden.\n(6) A person who forges or produces for inspection a false\n(a) Certificate of Conveyance of Livestock; or\n(b) Certificate of Conveyance of Livestock Book,\nis guilty of an offence and is liable on summary conviction to a fine of $10 000 or to imprisonment for 5 years or to both.\n(7) A person who contravenes subsections (1), (2), (3) or (5) is guilty of an offence and is liable on summary conviction to a fine of $10 000 or to imprisonment for 5 years or to both.\nImported agricultural products or livestock\n14.(1) A person who has imported agricultural products or livestock shall retain\n(a) the receipt for the agricultural products or livestock imported; or\n(b) the bill of lading in respect of the agricultural produce or livestock imported,\nas proof of purchase of the imported agricultural products or livestock.\n16\n(2) The\n(a) receipt for the agricultural products or livestock imported; or\n(b) bill of lading in respect of the agricultural produce or livestock imported,\nshall be produced at the request of a warden.\n(3) Apperson who contravenes subsections (1) or (2) is guilty of an offence and is liable on summary conviction to a fine of $10 000 or to imprisonment for 5 years or to both.\nStolen agricultural products or livestock\n15. A person who is in possession of agricultural products or livestock and fails to\n(a) produce a certificate, receipt, bill of lading as required by this Act;\n(b) give proof of ownership; or\n(c) satisfy a warden that he is in lawful possession of any agricultural products or livestock\nis guilty of an offence and is liable on summary conviction to a fine of $10 000 or to imprisonment for 5 years or to both.\nPART VII\nTRIAL, RESTITUTION AND SALE\nTrial\n16. As soon as may be practical after the arrest of a person for committing an offence under this Act, the person shall be brought before the magistrate in whose jurisdiction the offence was committed together with any agricultural products or livestock seized.\n17\nRestitution\n17. A magistrate may order that any agricultural products or livestock alleged to have been obtained contrary to the provisions of this Act, be delivered to the person who appears to the magistrate to be entitled to the agricultural products or livestock.\nSale of livestock and perishable agricultural products\n18.(1) Notwithstanding sections 16 and 17, where the sale of the agricultural products or livestock seized are likely to perish before the trial of the offence, the agricultural products or livestock shall be delivered to the Chief Agricultural Officer who shall sell the agricultural products or livestock, or where a sale cannot be conducted, the Chief Agricultural Officer shall dispose of the agricultural products or livestock in the manner that he thinks fit.\n(2) The Chief Agricultural Officer shall deliver to the clerk of the magistrate’s court where the offence referred to in subsection (1) is to be tried\n(a) acertificate containing the following information:\n(i) _ the quantity of agricultural products or livestock received by him;\nGi) the quantity of agricultural products or livestock sold;\n(iii) the amount realised by the sale;\n(iv) the date of the sale;\n(v) where the agricultural products or livestock are disposed of otherwise than by sale, the method and date of disposal; and\n(b) the proceeds of the sale less any amount that is applied to satisfy the conduct of the sale.\n(3) A certificate referred to in subsection (2) shall be admissible in evidence as proof of the matters therein stated without proof of the signature of the Chief Agricultural Officer.\n18\n(4) Where a person brought before the magistrate under section 16, pleads guilty to or is convicted of an offence in respect of which the agricultural products or livestock were seized and sold or otherwise disposed of in accordance with subsection (1), the court may\n(a) in the case of a sale, order that compensation be paid, out of and not exceeding the net amount realised by the sale, to the person who appears to the magistrate to be the owner of the agricultural products or livestock;\n(b) ina case where the agricultural products or livestock was otherwise disposed of, order the accused to pay the informant or complainant such compensation not exceeding the net market value of the agricultural products or livestock.\n(5) An order for payment of compensation made under subsection 4(b) shall not be for an amount in excess of $10 000.\n(6) An award of compensation referred to in subsection (4) shall not be a bar to any civil proceedings for damages where the net market value of the agricultural product or livestock is $10 000, but any compensation awarded shall be taken into account for the purpose of awarding damages.\n(7) Where agricultural products or livestock are sold in accordance with subsection (1) and the owner cannot be ascertained, the proceeds of the sale shall be paid into the Consolidated Fund.\nPART VIII\nMISCELLANEOUS\nRegulations\n19. The Minister may make regulations generally for the purpose of giving effect to this Act.\n19\nRepeal of Cap. 142A\n20. The Praedial Larceny Prevention Act, Cap. 142A is repealed.\nCommencement\n21. This Act shall come into operation on a date to be fixed by Proclamation.\nRead three times and passed the House of Assembly this day of , 2017.\nSpeaker\nRead three times and passed the Senate this , 2017.\nday of\nPresident\n"
}