{
  "bill_id": 243,
  "slug": "resolution-guarantee-of-1266-million-in-bonds-issued-by-new-life-investment-company-inc",
  "title": "Resolution Guarantee of 126.6 million in bonds issued by New Life Investment Company Inc.",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/6e0de4ef2275f3aab314f4d1fdde3c42.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2017-12-11",
  "first_reading": "2017-12-13",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\n2017-11-28\n\nPARLIAMENT\n\nWHEREAS by section 3 of the CLICO International Life Insurance Ltd. (Guarantee)\n\nAct, 2015 (Act 2015-25) the Government of Barbados is authorised to give certain guarantees\n\nwhich  would  facilitate  the  preservation  of  investments  made  by  policyholders  of  CLICO\n\nInternational Life Insurance Ltd.;\n\nAND WHEREAS by section 6 of the said Act it is provided that the Government\n\nmay,  by  a  resolution  of  both  Houses  of  Parliament,  guarantee  the  payment  of  principal  and\n\ninterest  due  in  respect  of  bonds  issued  by  New  Life  Investment  Company  Inc.  to  Resolution\n\nLife Assurance  Company  Ltd.  for  an  amount  not  exceeding  $127  million  for  the  purpose\n\nof  satisfying  the  restructured  10  year  ﬁ xed  annuities  of  the  individual  Executive  Flexible\n\nPremium Annuity  policyholders  listed  on  the  Barbados  register  of  CLICO  International  Life\n\nInsurance Ltd.;\n\nAND WHEREAS the Government considers it necessary to issue said guarantee in\n\nrespect of ﬁ xed annuities in the amount of $126.6 million in order to facilitate the preservation of\n\ninvestments made by the policyholders of CLICO International Life Insurance Ltd.;\n\nAND WHEREAS the said sum of $126.6 million is the total estimated value of the\n\nguarantee as determined by the Judicial Manager currently overseeing the management of CLICO\n\nInternational Life Insurance Ltd.;\n\nAND WHEREAS the said sum of $126.6 million is within the authorised limit given\n\nto the Government under section 6(1) of the said Act;\n\n\f2\n\nBE  IT  RESOLVED  therefore  that  Parliament  approves  the  issue  of  a  guarantee  of  the\n\npayment  and  principal  and  interest  due  in  respect  of  $126.6  million  in  bonds  issued  by  New  Life\n\nInvestment  Company  Inc.  to  Resolution  Life Assurance  Company  Ltd.  on  the  terms  and  conditions\n\ncontained  in  the  Agreement,  the  main  provisions  of  which  are  set  out  in  the  Schedule.\n\nAPPROVED by the House of Assembly this                   day of                                                           ,\n\nTwo thousand and seventeen.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                                  ,\n\nTwo thousand and seventeen.\n\nPresident\n\n\f3\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nThe  NewLife  0.25%  10 Year  Preservation  Bond  2027  is  a  10  year Amortising\nBond.\n\nNew Life Investment Company Limited (\"NLICO\")\n\nThe Bond will be guaranteed by the Government of Barbados.\n\nResolution Life Assurance Company Ltd. (ResLife) on behalf of the Individual EFPA\npolicy  holders  on  the  Barbadian  Register  re  CLICO  Life  Insurance  Limited\n(Under Judicial management)\n\nBDS$126,600,000.00.\n\nTo facilitate the preservation of investments made by policyholders of CLICO\nInternational Life Insurance Limited (\"CIL\") through the capitalisation of ResLife.\n\nTen (10) years.\n\nIndependent  trustee  licensed  under  the  Financial  Institutions  Act,\nCap. 324 to be appointed.\n\nPrincipal plus interest shall be repaid by semi-annual instalments over the term\nof ten (10) years.  The principal sum plus interest shall be repaid over the term\nof  the  facility  with  repayments  commencing  6  months  after  the  issue  date.\n\nFacility:\n\nIssuer:\n\nGuarantee:\n\nSubscriber:\n\nAmount:\n\nPurpose:\n\nTerm:\n\nTrustee:\n\nRepayment:\n\nInterest Rate:\n\n(a)  The  rate  of  interest  to  be  applied  to  the  principal  sum  outstanding  shall\n\nbe 0.25% per annum over the term of the facility.\n\n(b)\n\nInterest  shall  be  calculated  on  the  basis  of  the  actual  number  of  days\nelapsed and a 365 day year.\n\n"
}