{
  "bill_id": 244,
  "slug": "telecommunications-amendment-bill-2017",
  "title": "Telecommunications (Amendment) Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/9cd8a1aeb4b232e340bee4215c317535.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-02-07",
  "first_reading": "2018-02-26",
  "gazette_date": "2017-12-04",
  "markdown": "2017-09-13\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Telecommunications Act, Cap. 282B to ensure that\nspecified provisions of the Act are applicable to the rules, regulations and orders\nmade in accordance with the Act.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\nShort title\n\nAmendment to section 72 of Cap. 282B\n\nAmendment to section 75 of Cap 282B\n\nAmendment to section 76 of Cap. 282B\n\nAmendment to section 77 of Cap. 282B\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Telecommunications Act, Cap. 282B.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2017.\n\nThis Act may be cited as the Telecommunications (Amendment) Act,\n\n\f4\n\nAmendment to section 72 of Cap. 282B\n\n2.\nSection 72 of the Telecommunications Act, in this Act referred to as\nthe principal Act, is amended by deleting paragraph (b) of subsection (1) and\nsubstituting the following paragraph:\n\n“(b)\n\nhas  failed  to  comply  with  any  rules,  regulations  or  orders\nmade by the Minister under this Act or any order issued by\nthe  Minister  requiring  a  person  to  comply  with  that\norder, ”.\n\nAmendment to section 75 of Cap 282B\n\n3.\nof subsection (1) and substituting the following paragraph:\n\nSection 75 of the principal Act is amended by deleting paragraph (a)\n\n“(a)\n\ninvestigate  any  complaint  or  conduct  concerning  an\nallegation  of  a  contravention  of  this  Act,  a  licence  issued\nunder this Act or a licence issued  under rules, regulations or\norders made under this Act;”.\n\nAmendment to section 76 of Cap. 282B\n\n4.\nand substituting the following subsection:\n\nSection 76 of the principal Act is amended by deleting subsection (1)\n\n“(1)\nSubject to subsection (2) and subsections (1), (2), (3) and (4) of\nsection 77, an inspector may, on reasonable suspicion that a person is\nengaged in conduct that is contrary to\n\n(a)\n\n(b)\n\nthis Act;\n\nany licence granted under this Act;\n\n\f5\n\n(c)\n\nany licence granted under any rule, regulation or order made\nin accordance with this Act; or\n\n(d)\n\nany registration or authorisation done under this Act,\n\nenter and search any vehicle, ship, vessel, aircraft or premises and may\nin  that  process  seize  any  document  or  extracts  of  any  document,\ntelecommunications  or  radiocommunications  apparatus  from  the\nperson  who  has  the  custody  or  is  in  possession  of  the  document  or\napparatus. ”.\n\nAmendment to section 77 of Cap. 282B\n\n5.\n\nSection 77 of the principal Act is amended by deleting\n\n(a)\n\nsubsection (1) and substituting the following subsection:\n\n“(1)\nWhere a magistrate is satisfied by information on oath that there\nis reasonable ground for suspecting that an offence under this Act or\nrules, regulations or orders made in accordance with this Act has been\ncommitted  or  is  about  to  be  committed,  the  magistrate  may  issue  a\nsearch warrant authorising the inspector named in the warrant, with or\nwithout a member of the Police Force to\n\n(a)\n\n(b)\n\nenter and search the vehicle, ship, vessel, aircraft or premises\nspecified in the information; and\n\nexamine, test or seize any document, extract of a document,\ntelecommunications  or  radiocommunications  apparatus  or\nother item.”; and\n\n(b)\n\nsubsection (3) and substituting the following subsection:\n\n“(3)\n\nA person who\n\n(a)\n\nwilfully  obstructs,  hinders,  molests,  assaults  or  otherwise\ninterferes with an inspector engaged in the performance of\n\n\f6\n\nany duty or the exercise of any power conferred on him under\nthe  Act  or  under  rules,  regulations  or  orders  made  in\naccordance with the Act; or\n\n(b)\n\nknowingly gives false information to an inspector,\n\nis guilty of an offence and is liable on summary conviction to a fine of\n$50, 000 or to imprisonment for a term of 6 months.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2017.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2017.\n\nPresident\n\n"
}