{
  "bill_id": 246,
  "slug": "land-tax-amendment-bill-2017",
  "title": "Land Tax (Amendment) Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/da56a2503decd7ccb93df6c3634a977c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-01-17",
  "first_reading": "2018-01-24",
  "gazette_date": "2018-01-18",
  "markdown": "2017-09-19\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Land Tax Act, Cap. 78A to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nreplace  the  words  “Barbados  Tourism  Authority”  with  the  words\n“Barbados Tourism Product Authority” in order ensure that it is clear\nthat  proprietors  of  villas  and  hotels  registered  with  the  Barbados\nTourism Product Authority should continue to receive the rebate given\nunder the Land Tax Act, Cap. 78A;\n\namend the instances where land would be exempt from the payment of\ntax under the Act;\n\nto provide for waivers of penalties and interest incurred on arrears of\ntax;\n\nmake provision for the Minister to remit outstanding land tax or grant\na refund under the Act by way of an Order; and\n\n(e)\n\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 6C of Cap. 78A\n\nAmendment of section 6D of Cap. 78A\n\nAmendment of section 8 of Cap. 78A\n\nAmendment of section 18 of Cap. 78A\n\nInsertion of section 28B.1 into Cap. 78A\n\nInsertion of section 28D into Cap. 78A\n\nAmendment of section 30 of Cap. 78A\n\nAmendment of section 34 of Cap. 78A\n\n10.\n\nAmendment of section 35 of Cap. 78A\n\n11.\n\nAmendment of section 44 of Cap. 78A\n\n12.\n\nAmendment of Schedules to Cap. 78A\n\n13.\n\nCommencement\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the  Land Tax Act.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Land Tax (Amendment) Act, 2017.\n\n\f4\n\nAmendment of section 6C of Cap. 78A\n\n2.\nAct, is amended by deleting section 6C and substituting the following:\n\nThe Land Tax Act, Cap. 78A, in this Act referred to as the principal\n\n“Tax payable by a hotel\n\n6C.\nA hotel shall pay tax at the rate specified under section 6(1),\nand the actual amount payable shall be calculated on 50 per cent of the\nimproved value of the land; but no such reduction shall be permitted\nunless it is a hotel within the meaning of section 2 of the Barbados\nTourism Product Authority Act (Act 2014-2).”.\n\nAmendment of section 6D of Cap. 78A\n\nSection 6D of the principal Act is amended in subsection (2)(b) by\n3.\ndeleting  paragraph  (iii)  of  the  definition  of  “villa”  and  substituting  the\nfollowing:\n\n“(iii)\n\nis  registered  with  the  Barbados  Tourism  Product\nAuthority; and”.\n\nAmendment of section 8 of Cap. 78A\n\n4.\n\nSection 8 of the principal Act, is amended by\n\n(a)\n\ndeleting paragraph (c) and substituting the following:\n\n“(c)\n\nland used by a church, being a charity within the meaning of\nsection 2 of the Charities Act, Cap. 243, which is primarily\nused for the purpose of public religious worship by churches\nwhich  are  exempt  charities  within  the  meaning  of  the\nCharities Act, Cap. 243; ”;\n\n\f5\n\n(b)\n\ndeleting the full stop at the end of paragraph (h) and substituting a\nsemi-colon; and\n\n(c)\n\ninserting immediately after paragraph (h) the following:\n\n“(i)\n\n(j)\n\nland owned and occupied by a sporting organization specified\nin the First Schedule, which is primarily used for the sporting\nactivities of the sporting organization; and\n\nland owned by the Crown which is leased to and occupied by\na sporting organization specified in the First Schedule, which\nis  primarily  used  for  the  sporting  activities  of  the  sporting\norganization.”.\n\nAmendment of section 18 of Cap. 78A\n\n5.\nand substituting the following:\n\nSection 18 of the principal Act is amended by deleting subsection (2)\n\n“(2)\nThe  provisions  of  the  Second  Schedule  shall  have  effect  in\nrelation  to  the  constitution  of  the  Board  and  otherwise  in  relation\nthereto. ”.\n\nInsertion of section 28B.1 into Cap. 78A\n\n6.\n28B, the following:\n\nThe principal Act is amended by inserting immediately after section\n\n“Waiver of penalties and interest from December, 2014 to\nMarch, 2015\n\nSubject to subsection (2), where at 31st December, 2014, an\n28B.1.(1)\namount payable to the Revenue Commissioner as a penalty or interest\n\n\f6\n\nin  respect  of  arrears  of  tax  is  outstanding,  the  amount  payable  as  a\npenalty or interest is waived.\n\nThe waiver referred to in subsection (1) applies only where the\n\n(2)\narrears of tax are paid in full not later than 15th March, 2015.”.\n\nInsertion of section 28D into Cap. 78A\n\n7.\n28C, the following:\n\nThe principal Act is amended by inserting immediately after section\n\n“Waiver of penalties and interest from June, 2017 to\nNovember, 2017\n\nSubject to subsection (2), where at 1st June, 2017, an amount\n28D.(1)\npayable to the Revenue Commissioner as a penalty or interest in respect\nof  arrears  of  tax  is  outstanding,  the  amount  payable  as  a  penalty  or\ninterest is waived.\n\nThe waiver referred to in subsection (1) applies only where the\n\n(2)\narrears of tax are paid in full not later than 30th November, 2017.”.\n\nAmendment of section 30 of Cap. 78A\n\n8.\nand substituting the following:\n\nSection 30 of the principal Act is amended by deleting subsection (1)\n\n“(1)\nIf any tax due and payable is not paid within 60 days of the tax\ndemand notice, the Commissioner may issue a warrant of distress in the\nForm A set out in the Third Schedule or a form to the like effect to a\nperson  named  therein  to  levy  by  distress  upon  any  goods,  including\nchattel houses, found on the land in respect of which the tax is due and\npayable for any tax in arrears and unpaid.”.\n\n\f7\n\nAmendment of section 34 of Cap. 78A\n\n9.\n\nSection 34 of the principal Act is amended by deleting\n\n(a)\n\nsubsection (4) and substituting the following:\n\n“(4)\nA warrant for sale under subsection (3) may be in the Form B set\nout  in  the  Third  Schedule,  and,  if  the  Commissioner  thinks  fit,  may\ncontain the names of the owners of the respective lands as entered in\nthe land tax roll. ”; and\n\n(b)\n\nsubsection (9) and substituting the following:\n\nThe warrant for sale under subsection (8) may be in the Form C\n\n“(9)\nset out in the Third Schedule. ”.\n\nAmendment of section 35 of Cap. 78A\n\n10.\nand substituting the following:\n\nSection 35 of the principal Act is amended by deleting subsection (4)\n\n“(4)\nFor the purpose of having the proceeds of sale deposited in the\nHigh Court under subsection (3), a formal request in the Form D set out\nin the Third Schedule shall be addressed by the Commissioner to the\nRegistrar of the Supreme Court.”.\n\nAmendment of section 44 of Cap. 78A\n\n11.\nthe following:\n\nThe principal Act is amended by deleting section 44 and substituting\n\n\f8\n\n“Remission and refund of tax and rates\n\n44.\nNotwithstanding  section  8,  the  Minister  may  by  Order,\nwhere he is satisfied on the ground of undue hardship or for any other\nreason that it would be just and equitable to do so, remit or refund the\nwhole or any part of the tax due and payable under this Act including\nany penalties thereon, payable or paid by any person.”.\n\nAmendment of Schedules to Cap. 78A\n\n12.\n\nThe principal Act is amended by\n\n(a)\n\n(b)\n\n(c)\n\nrenumbering the “First Schedule” as the “Second Schedule”;\n\nrenumbering the “Second Schedule” as the “Third Schedule”; and\n\ninserting  as  the  First  Schedule  to  the  principal  Act  the  ‘First\nSchedule’ set out in the Schedule to this Act.\n\nCommencement\n\n13.\nThe amendment directed to be made to section 8 of the principal Act\nby section 4(c) of this Act shall be deemed to have taken effect from the 1st day\nof May, 2011.\n\n\f9\n\nSCHEDULE\n\n“FIRST SCHEDULE\n\n(Section 12(c))\n\n(Section 8(i) and (j))\n\nExempt Sporting Organizations\n\nBarbados Hockey Federation Inc.\n\nBarbados Amateur Swimming Association Inc.\n\nThe Barbados Lawn Tennis Association\n\nThe Barbados Olympic Association Inc.\n\nSt. Catherine’s Social Club\n\nEmpire Cricket Club\n\nCarlton Club\n\nBarbados Football Association\n\nWindward Cricket Club\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nWanderers Cricket Club ”.\n\n\f10\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2017.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2017.\n\nPresident\n\n"
}