{
  "bill_id": 247,
  "slug": "income-tax-amendment-bill-2017",
  "title": "Income Tax (Amendment) Bill 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/12729c7ba79c26b176a7fd94d0806a36.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-02-07",
  "first_reading": "2018-02-07",
  "gazette_date": null,
  "markdown": "2017-12-01\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Income  Tax  Act,  Cap.  73  to  provide  for  the\nwithdrawal of contributions from annuity contracts which have been registered\nas registered retirement plans and for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\nShort title\n\nAmendment of section 24G of Cap. 73\n\nAmendment of section 24H of Cap. 73\n\nInsertion of sections 24J and 24K into Cap. 73\n\nAmendment of section 64 of Cap. 73\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Income Tax Act, Cap. 73 to provide for the withdrawal\nof  contributions  from  annuity  contracts  which  have  been  registered  as\nregistered retirement plans and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n\nThis Act may be cited as the Income Tax (Amendment) Act, 2017.\n\nAmendment of section 24G of Cap. 73\n\nSection 24G of the Income Tax Act, Cap. 73, in this Act referred to\n2.\nas the principal Act, is amended by deleting the marginal note and substituting\nthe following shoulder note:\n\n“Withdrawal of contributions from registered retirement savings\nplan”.\n\nAmendment of section 24H of Cap. 73\n\n3.\nmarginal note and substituting the following shoulder note:\n\nSection  24H  of  the  principal  Act,  is  amended  by  deleting  the\n\n“Conditions  attached  to  withdrawal  of  contributions  from  registered\nretirement savings plan”.\n\nInsertion of sections 24J and 24K into Cap. 73\n\n4.\n24I the following new sections:\n\nThe principal Act is amended by inserting immediately after section\n\n“Withdrawal of contributions from registered retirement\nplan: annuity contract\n\n24J.(1)\nmake one withdrawal of contributions from the plan.\n\nA person who contributes to a registered retirement plan may\n\n\f5\n\n(2)\nWhere  a  person  makes  a  withdrawal  of  contributions  from  a\nregistered retirement plan, the contributions withdrawn are subject to\nwithholding tax.\n\n(3)\nThe  amount  of  tax  to  be  withheld  under  this  section  shall  be\ncalculated  in  accordance  with  regulation  6(5A)  of  the  Income  Tax\nRegulations, 1969 (S.I. 1969 No. 109).\n\nCondition attached to withdrawal of contributions from\nregistered retirement plan: annuity contract\n\nThe withdrawal of contributions referred to in section 24J is\n24K.\nsubject to the condition that the maximum amount that a person may\nwithdraw shall be 15 percent of the value of the contributions made to\nthe registered retirement plan.”.\n\nAmendment of section 64 of Cap. 73\n\n5.\n\nSection 64 of the principal Act is amended\n\n(a)\n\n(b)\n\nin paragraph (d) of subsection (1) by inserting between the words\n“retirement” and plan”, the word “savings”; and\n\nin subsection (1) by inserting immediately after paragraph (d), the\nfollowing new paragraph:\n\n“(d.1)\n\namounts in respect of a registered retirement plan, as\n\n(i)\n\na return of contributions; or\n\n(ii)\n\nbenefits received out of or under that plan; or”.\n\n"
}