{
  "bill_id": 248,
  "slug": "police-amendment-bill-2017",
  "title": "Police (Amendment) Bill, 2017",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/2bb58e4ca6a51d5d5d1eb9cbdbaaeef6.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-01-24",
  "first_reading": "2018-01-24",
  "gazette_date": "2017-12-25",
  "markdown": "5th December, 2017\nOBJECTS AND REASONS\nThis Bill would amend the Police Act, Cap. 167 to increase the statutory powers granted to the Commissioner and the Force to protect the life and property of the citizens of Barbados, to ensure peace and public order under the Act with the use of cordons and curfews, and to provide for related matters.\ntw\nArrangement of Sections\nShort title\nAmendment of section 2 of Cap. 167\nAmendment of section 19 of Cap 167\nInsertion of sections 19A and 19B into Cap. 167\nAmendment of section 62 of Cap. 167\nBARBADOS\nA Bill entitled\nAn Act to amend the Police Act to increase the statutory powers granted to the Commissioner and the Force to protect the life and property of the citizens of Barbados, to ensure peace and public order under the Act with the use of cordons and curfews, and to provide for related matters.\nENACTED by the Parliament of Barbados as follows:\nShort title\n1. This Act may be cited as the Police (Amendment) Act, 2017.\nAmendment of section 2 of Cap. 167\n2. Section 2 of the Police Act, in this Act referred to as the principal Act, is amended inserting the following definitions in their appropriate alphabetical order:\n“ “curfew” means\n(a) the imposition of a requirement that all persons who live in a designated area in Barbados are to enter the premises in which they reside by a specified time and remain indoors for a specified period; and\n(b) the imposition of the closure of a business, and the ending of social gatherings in the designated area by a specified time.\n“offensive weapon” means\n(a) any firearm as defined by section 2 of the Firearms Act, Cap. 179;\n(6) a knife, flick knife, rachet knife, switch blade, cutlass, machete, or any article made or adapted for use for causing injury to a person, or intended by a person having it with him for such use by him or by some other person; and\n(c) any article or device made or adapted for use for causing damage to any property or intended by the person having it with him for such use by him or by some other person;\n“serious violence” means\n(a) an occurrence involving the discharge of a firearm or the use of an offensive weapon which results in\n(i) a disturbance of the peace;\n(ii) serious bodily harm to a person; or\n(iii) the death of a person;\n(b) multiple aggravated burglaries; or\n(c) a concentration of the commission of multiple offences, committed by a group of persons or a person, in an area in Barbados.\n“special investigation period” means the imposition of a curfew for a period of 24 hours for the purposes of investigating an incident of serious violence.”.\nAmendment of section 19 of Cap 167\n3. Section 19 of the principal Act is deleted and the following is substituted:\n“General Duties and powers of the Force\n19.01) A member of the Force has the duty and the power to\n(a) preserve the peace and prevent and detect crime and other contraventions of the law;\n(b) stop and search\n(i) a person where he has a reasonable suspicion that the person has committed an arrestable offence, is committing an arrestable offence or is about to commit an arrestable offence; or\n6\n(ii) a vehicle where he has a reasonable suspicion that the vehicle was used in the commission of an arrestable offence, is being used in the commission of arrestable offence or is about to be used in the commission of an arrestable offence;\n() apprehend and bring before a magistrate persons found committing any offence rendering them liable to arrest without a warrant or whom they may reasonably suspect of having committed any such offence or who may be charged by any person with having committed any such offence;\nCi) charge or cause to be charged before a magistrate and to prosecute a person reasonably suspected of having committed an offence in the following cases\n(i) in all cases of offences where it is in the opinion of a gazetted police officer desirable in the public interest that the prosecution should be undertaken by the Force; and\n(ii) in any other case where an order to that effect is made by the Director of Public Prosecutions or the Commissioner;\n(e) serve and execute at any time, including Sundays, all warrants which they may be directed by a competent authority to serve or execute;\nkeep order in and within the precincts and in the vicinity of all courts during all sittings of such courts;\n(g) repress internal disturbances;\n(i) defend Barbados against external aggression when called out for such purpose under section 5; or\n7\n(j) generally do and perform all the duties appertaining to the office of a constable.\n(2) A member of the Force of the rank of Inspector or above may establish a cordon in any area in Barbados for a period of no more than 8 hours, where that cordon is reasonably required to investigate a motor vehicle accident or an incident of serious violence.\n(3) Where a member of the Force of the rank Inspector or above acts pursuant to subsection (2), it shall be the duty of the members of the Force, under the supervision of that officer, in addition to any other duties or powers granted to them under this Act, to discharge the following duties in respect of the cordon:\n(a) require a person to remain stationary and to refrain from doing any activity within the cordon where a member of the Force has a reasonable suspicion that such activity may compromise or remove evidence within the cordon;\n(b) search any person within the cordon where that member of the Force has a reasonable suspicion that the person has committed, is committing or is about to commit an offence;\n(c) search any motor vehicle within the cordon where that member of the Force has a reasonable suspicion that the person with command or control of the motor vehicle or any passenger therein has committed, is committing or is about to commit an offence;\n(d) require a person to answer any questions with respect to the motor vehicle accident or the incident of serious violence;\n(e) require a person to leave the cordon immediately;\n(f) require a person to immediately remove a motor vehicle from the cordon;\n8\n(g) seize, retain and secure any offensive weapon, an illegal drug or stolen property, found in a search in the cordon, for evidentiary or other purposes pending the determination of any examination, investigation, trial or enquiry; or\n(h) require a person to perform such actions as may be reasonably required to preserve the peace and prevent crime and other contraventions of the law within the cordon.\n(4) | The Inspector or other officer in charge of a cordon referred to in subsection (2) shall ensure that within 3 days after the closure of the cordon that\n(a) he gives the Commissioner a full report of the motor vehicle accident or incident of serious violence and that report shal! include a list of all persons and vehicles searched as well as any articles seized under subsection (3)(g); and\n(b) a person who has been searched or who has had the motor vehicle under his control searched, and who has had any article seized as a result of the search is given a list of what has been seized signed by the officer who conducted the search.\n(5) | The provisions of this section shall be in addition to and not in derogation from the common law powers of a member of the Force and any power given by any other enactment.”.\nInsertion of sections 19A and 19B into Cap. 167\n4, The principal Act is amended by inserting immediately after section 19 the following new sections:\n“Curfew or Special Investigation period\n19A.(1) Where the Commissioner has received information or intelligence with regard to criminal activity in any area in Barbados, and it appears to him that due to the nature or extent of the criminal activity, that there are reasonable grounds to believe that in the interest of public safety, public order or for the purpose of preventing or detecting crime, it is necessary to do so, the Commissioner may act in accordance with the provisions of subsection (2).\n(2) The Commissioner may, with the written approval of the Minister, impose either a curfew, for a period not exceeding 2 days, or a special investigation period, in a designated area in Barbados, in order to preserve and promote peace, public order or public safety and investigate where\n(a) an incident of serious violence has occurred in any area in Barbados; or\n(b) an incident of serious violence may occur in any area in Barbados.\n(3) |The Commissioner shall, where he has obtained written approval under subsection (2), by an instrument in writing\n(a) assign a member of the Force of the rank of Inspector or above, and other subordinate officers to execute the curfew or special investigation period;\n(b) name the designated area where the curfew or special investigation period will be imposed and give a complete description of the designated area;\n(c) give the assigned member of the Force of the rank of Inspector or above, and the assigned subordinate officers the information or intelligence they will need to conduct the curfew or special investigation period; and\n10\n(d) provide such guidance as may be required with respect to the discharge of the powers and duties under section 19B for the purposes of the curfew or special investigation period in the designated area.\nDuties and Powers of the Force during a curfew or special investigation period\n19B.(1) Where the Commissioner acts pursuant to section 19A it shall be the duty of the members of the Force, under the supervision of officer of the rank of Inspector or above, in addition to any other duties or powers granted to them under this Act, to discharge the following duties in respect of the designated area:\nan\n(a) between 05:00 hours and 20:00 hours search any premises in the designated area without warrant where that member of the Force has a reasonable suspicion that an offence has been committed, is being committed or is about to be committed on the premises;\n(A) patrol] the designated area at such times and intervals as may be specified by the Commissioner;\n(c) establish a cordon in the designated area, where required to do so by the Commissioner;\n(d) stop and search any person walking or sitting in the designated area, where that member of the Force has a reasonable suspicion that an offence has been committed, is being committed or about to be committed, and search any item or anything being carried or held by that person for an offensive weapon, any illegal drugs or stolen property;\n(e) stop and search any vehicle in or any vehicle entering or exiting the designated area, its driver or passenger for an offensive weapon, an illegal drug, or stolen property where that member of the Force has a reasonable suspicion that an\n1\noffence has been committed, is being committed or is about to be committed;\nrequire a person to remain stationary and to refrain from doing any activity within the designated area where a member of the Force has a reasonable suspicion that such activity may compromise or remove evidence within the designated area;\n(g) use such force as may be reasonably necessary to detain a person in a designated area in order to carry out a search;\n(h) use such force as may be reasonably necessary to enter any premises in the designated area; or\n) to seize, retain and secure any offensive weapon, an illegal drug or stolen property, found in a search in the cordon or otherwise, for evidentiary or other purposes pending the determination of any examination, investigation, trial or enquiry.\n(2) Where a member of the Force exercises the powers granted under subsection (1),\n(a) he shall ensure that for any search of any premises or vehicle that the owner, occupier or any other individual as well as another member of the Force is in attendance at all stages of the search and is afforded the opportunity to observe and record by written or electronic means anything done in relation to the search; and\n(b) he shall return any article seized under subsection (1), where it is determined that, the article is of no evidentiary value for the purposes of subsection (1)(i).\n12\n(3) The member of the Force of the rank of Inspector or above, in charge of the search under section 19A(3) shall ensure that within 7 days afier the end of the curfew or special investigation period that\n(a) he gives the Commissioner a full report of the incident involving serious violence which shall include a list of all premises, persons and vehicles searched as well as all articles seized; and\n(b) a person who has been searched or who has had the motor vehicle under his control searched, and who has had any article seized as a result of the search is given a list of what has been seized signed by the officer who conducted the search.\n(4) | The provisions of this section shall be in addition to and not in derogation from the common law powers of a member of the Force and any power given by any other enactment.”.\nAmendment of section 62 of Cap. 167\n5. Section 62 of the principal Act is deleted and the following is substituted:\n“Penalty for assaulting, obstructing, etc., members of Force in the execution of their duty\n62.(1) Any person who\n(a) assaults, obstructs or resists; or\n(b) uses any abusive or insulting language to; or\n(c) aids or incites any person to assault, obstruct or resist,\nany member of the Force in the execution of his duty or any person acting in aid of any such member of the Force shall be liable on\n13\nconviction by a court of summary jurisdiction to a fine of $5000 or to imprisonment for a term of 2 years or to both, but if the magistrate is of the opinion that the matter is a fit subject for a prosecution by indictment, he shall commit the offender to stand trial at the High Court sitting for the trial of criminal offences.\n(2) Any person who\n(a) assaults, obstructs or resists; or\n(6) uses any abusive or insulting language to; or\n(c) aids or incites any person to assault, obstruct or resist,\nany member of the Force in the execution of his duty under sections 19(3) or 19B shall be liable on conviction by a court of summary jurisdiction to a fine of $10 000 or to imprisonment for a term of 3 years or to both, but if the magistrate is of the opinion that the matter is a fit subject for a prosecution by indictment, he shall commit the offender to stand trial at the High Court sitting for the trial of criminal offences.”.\nr\n"
}