{
  "bill_id": 254,
  "slug": "resolution-pertaining-to-the-vesting-of-land-at-deacons-in-the-nhc",
  "title": "Resolution Pertaining to the Vesting of land at Deacons in the NHC",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/f9c17fa5764853dca5e51953999d4f3b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-02-07",
  "first_reading": "2018-02-07",
  "gazette_date": null,
  "markdown": "PARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 approve the vesting in the National Housing, Corporation of the parcel of land, the property of the Crown situate at Deacons in the parish of Saint Michael in this Island, more particularly described in the Schedule hereto for housing, development.\nAPPROVED by the House of Assembly this\nday of\nTwo thousand and Eighteen.\nSPEAKER\nAPPROVED by the Senate this\nday of\nTwo thousand and Eighteen.\nPRESIDENT\nSCHEDULE\nALL THAT land situate at Deacons in the parish of Saint Michael in this Island\ncontaining by admeasurement | 25,900.0 square metres (12.59 hectares) or thereabouts (inclusive of 5,340.1 square metres (0.53 hectares) on a road Abutting and Bounding on lands of the Barbados Government (Psychiactric Hospital), on other lands of the Barbados Government (now divided into Lots 1A and 1B), on a public road known as Farm Road, on lands now or formerly of Thelma Riveria, on lands now or formerly of the Grace Bible School, on a public road known as Bird River Road, on lands now or formerly of Alfred Craig, on lands now or formerly of Randolph Ellis, on lands now or formerly of F. Gibson, on lands now or formerly of Janet Griffith, on lands now or formerly of Elmer Walkes, on lands now or formerly of Kenneth Haynes, on lands now or formerly of Owen Webster, on lands now or formerly of Lance Bynoe, on lands now or formerly of the Estate of George Holder, on lands now or formerly of Nathaniel Jordan, on a drain, on other lands of the Barbados Government, on lands now or formerly of the Barbados Investment and Development Corporation, on lands now or formerly of Anthony Vanterpool, on lands now or formerly of Trevor Hope, on other lands of the Barbados Government, on lands now or formerly of Velma Bourne or however else the same may abut and bound as shown and delineated on a Plan certified on the 30\" day of October, 2017 by G. Devere Walcott and recorded in the Lands and Surveys Department on the 3\" day of November, 2017 as Plan No. 1072/2017.\nADDENDUM\nOn the 9\" day of November, 2017, the Cabinet agreed to the vesting of 125,900 square metres (12.59 hectares) of land situate at Deacons in the parish of Saint Michael in the National Housing Corporation for housing development.\nThe said parcel of land, more particularly described in the Schedule, became vested in the Crown by a Conveyance dated the 7\" day of October, 1892 between James Goulboume Williams et al to the Executive Committee of the Island of Barbados, which was recorded on the 7\" day of February, 1893 as Deed No. 95.\nIn accordance with the provision of section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is now sought for the vesting in the National Housing Corporation of the parcel of land more particularly described in the Schedule to this Resolution for housing development.\n"
}