{
  "bill_id": 257,
  "slug": "resolution-re-ferniehurst-housing-estate",
  "title": "Resolution re Ferniehurst Housing Estate",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/27b4b163691ef91f58c201d9803efb1e.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-02-07",
  "first_reading": "2018-02-07",
  "gazette_date": null,
  "markdown": "2018-01-29\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  approve  the  change  of  purpose  for  which\n\nthe  parcel  of  land  situate  at  Ferniehurst  Housing  Estate  in  the  parish  of  Saint  Michael\n\nin  this  Island,  more  particularly  described  in  the  First  Schedule  hereto,  was  acquired\n\nby  the  Crown  under  the  Land  Acquisition  Act,  Cap.  228  from  the  public  purpose  of  the\n\nconstruction of a school, a children's home and a playing ﬁ eld, to that of housing development.\n\nAND  FURTHER  RESOLVED  that  Parliament,  in  accordance  with\n\nsection  5  of  the  Crown  Lands  (Vesting  and  Disposal)  Act,  Cap.  225,  approve  the\n\nvesting  in  the  National  Housing  Corporation  of  the  parcel  of  land,  the  property  of  the\n\nCrown,  situate  at  Ferniehurst  Housing  Estate  in  the  parish  of  Saint  Michael  in  this\n\nIsland,  more  particularly  described  in  the  Second  Schedule  hereto,  for  the  public\n\npurpose of housing development and to facilitate the divestment of the terrace units thereon.\n\nAPPROVED by the House of Assembly this               day of                                                    ,\n\nTwo thousand and Eighteen.\n\nSPEAKER\n\nAPPROVED  by  the  Senate  this                day  of                                                    ,\n\nTwo thousand and Eighteen.\n\nPRESIDENT\n\n\f2\n\nFIRST SCHEDULE\n\nALL  THAT  certain  piece  or  parcel  of  land  formerly  known  as  \"Jones  Land\"\n\n(which comprises part of a larger parcel containing 38,826.6 square metres known as Ferniehurst\n\nHousing Estate described in the Second Schedule hereto) situate at Black Rock in the parish\n\nof Saint Michael in this Island containing by admeasurement 195,370 square feet (18,150.48\n\nsquare metres) or thereabouts in which area is included a road containing by admeasurement\n\n6,780 square feet (629.88 square metres) and Abutting and Bounding on lands of sundry owners,\n\non lands of a placed called \"Ferniehurst\", on lands of the Housing Authority (as it then was and\n\nnow called National Housing Corporation) on a playing ﬁ eld, on lands of sundry owners and on\n\na public road known as Highway No. 1 or however else the same may abut and bound together\n\nwith the dwellinghouse thereon called \"Maryville\".\n\n\f3\n\nSECOND SCHEDULE\n\nALL  THAT  land  situate  at  Ferniehurst  Housing  Estate  in  the  parish  of  Saint\n\nMichael  in  this  Island  containing  by  admeasurement  38,826.6  square  metres  or  thereabouts\n\n(inclusive of 426.7 square metres in road reserve) Abutting and Bounding on lands now or late\n\nof Dr. Karen Jones, on lands now or formerly of Flintstones Inc., on lands now or late of Emily\n\nGrant, on Lot 24 (now or formerly Small Land Tenantry), on a walkway, on Lots 28 and 32 (now\n\nor  formerly  Small  Land  Tenantry),  on  a  walkway,  on  Lot  34  (now  or  formerly  Small  Land\n\nTenantry), on a playing ﬁ eld, on lands now or late of Joseph Cordle et al, on lands now or late of\n\nSandreen Scantlebury, on lands now or late of John Mark Greaves, on lands now or late of Ruth\n\nBoyce, on a road which leads to Goodland, on lands of sundry owners, on a public road known as\n\nDeacons Road which leads to Bayswater in one direction and to Black Rock in the other direction,\n\non lands of sundry owners and on a public road known as Black Rock Road which leads to\n\nUniversity Drive in one direction and to Eagle Hall in the other direction or however else the\n\nsame may abut and bound as shown and delineated on a plan certiﬁ ed on the 28th day of February,\n\n2011 by O'Brian St. E. Worrell, Land Surveyor and recorded in the Lands and Surveys Department\n\non the 4th day of March, 2011 as Plan No. 246/2011 together with the buildings thereon.\n\n\f4\n\nADDENDUM\n\n  On  the  7th  day  of  December,  2017,  the  Cabinet  agreed  to  the  change  of  purpose\n\nfor  which  38,826.6  square  metres  of  land  situate  at  Ferniehurst  Housing  Estate  in  the\n\nparish  of  Saint  Michael  in  this  Island  was  acquired  from  the  public  purpose  of  the\n\nconstruction of a school, a children's home and a playing ﬁ eld to that of housing development.\n\n  The said 38,826.6 square metres of land comprises:\n\n(a)  A parcel of land containing by admeasurement 195,370 square feet or thereabouts\n\nacquired by the Crown under the provisions of the Land Acquisition Act, Cap. 228.\n\nNotice of the acquisition was published in the Ofﬁ cial Gazette on 2nd March, 1972\n\nand recorded in the Annual Volumes of Statutory Instruments as Statutory Instrument\n\nNo. 38 of 1972; and\n\n(b)  A parcel of land containing 5 acres and 26 perches or thereabouts acquired by the\n\nCrown by deed of conveyance dated 8th February, 1929 between Louis Whitfoot\n\nClarke and the Executive Committee of the Island of Barbados and recorded in the\n\nRegistration Ofﬁ ce on 11th May, 1929 as Deed No. 487.\n\n  The vesting of the said 38,826.6 square metres of land in the National Housing Corporation\n\nwill enable the Corporation to have full legal control and authority over the land together with\n\nthe terrace units thereon, as well as the legal authority to dispose of the land and the terrace units.\n\n\f5\n\nADDENDUM\n\n  In accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225,\n\nthe approval of Parliament is now sought for the following:\n\n(i)\n\nthe change of the purpose for which the parcel of land, more particularly described\n\nin the First Schedule to this Resolution, was acquired from the public purpose of\n\nthe construction of a school, a children's home and a playing ﬁ eld to that of housing\n\ndevelopment; and\n\n(ii)  the  vesting  in  the  National  Housing  Corporation  of  the  parcel  of  land,  more\n\nparticularly  described  in  the  Second  Schedule  to  this  Resolution,  for  the  public\n\npurpose of housing development and to facilitate the divestment of the terrace units\n\nthereon.\n\n"
}