{
  "bill_id": 263,
  "slug": "resolution-re-issuing-of-bonds-of-british-american-to-sagicor-life",
  "title": "Resolution re issuing of bonds of British American to Sagicor Life",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/834edf1e0925f991efcafcf72db007ee.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-02-24",
  "first_reading": "2018-02-26",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\nPARLIAMENT\nWHEREAS by section 3 of the British American Insurance Company (Barbados) Ltd. (Preservation of Investments) Act, 2016 (Act 2016-5) the Government of Barbados is authorised, with the approval of both Houses of Parliament, to facilitate the transfer of the life insurance business of British American Insurance Company (Barbados) Ltd. to Sagicor Life Inc.;\nAND WHEREAS by section 4(1) of the said Act it is provided that the Government may, by a resolution of both Houses of Parliament, issue bonds to Sagicor Life Inc. for an amount not exceeding $93.2 million to facilitate the transfer of the life insurance business of British American Insurance Company (Barbados) Ltd. to Sagicor Life Inc.;\nAND WHEREAS the Government considers it necessary to issue said bonds in the amount of $93.2 million in order to facilitate the preservation of investments made by the policyholders of British American Insurance Company (Barbados) Ltd.;\nAND WHEREAS the said sum of $93.2 million is within the authorised limit given to the Government under section 4 of the said Act;\nWN\nBE IT RESOLVED therefore that Parliament approves the issuing of bonds to Sagicor Life Inc. for an amount of $93.2 million on the terms and conditions set out in the Schedule.\nAPPROVED by the House of Assembly this\nday of\n2018\nSpeaker\nAPPROVED by the Senate this\nday of\n2018.\nPresident\n>\nj\nSCHEDULE\nTERMS AND CONDITIONS\nFacility: Bond Issuer: Government of Barbados Recipient: Sagicor Life Inc. Amount: BDS$93.2 million to be issued in 4 series of BDS$23.3 million each. Purpose: To facilitate the transfer of the life and annuity insurance business British American Insurance Company (Barbados) Ltd. to Sagicor Life Inc. Deemed Date of Allotment: February 2018 Issue Price: 100 (par)\nIssuer: Government of Barbados\nAmount: BDS$93.2 million to be issued in 4 series of BDS$23.3 million each.\nDeemed Date of Allotment: February 2018\n100 (par)\nTerms:\na Face Value BDS$23.3M BDS$23.3M BDS$23.3M BDS$23.3M Per Bond 10 years from the | 15 years from the | 20 years from the | 25 years from the deemed date of | deemed date of | deemed date of | deemed date of Yield on maturity 7.15% allotment allotment allotment allotment\nof\nRepayment: Principal to be repaid at maturity.\nInterest: Bond ranking: Protective Clause: Interest shall be calculated on the basis of the actual number of days elapsed and a 365 day year. Bond will rank pari passu with all other debts of the issuer. In order to further safeguard the interest of the Policyholders, the principal amounts, yields and maturities of the Government of Barbados bonds to be issued in accordance with Schedule 6 of the Sale and Purchase Agreement as Final Government of Barbados Support and approved by the Supreme Court of Barbados shall not to be changed and the said bonds shall not be restructured by the Government of Barbados at time.\nany\nADDENDUM\nThis Resolution seeks the approval of Parliament to issue bonds to Sagicor Life Inc. for an amount not exceeding $93.2 million to facilitate the transfer of the life insurance business of British American Insurance Company (Barbados) Ltd. to Sagicor Life Inc.\nThe issue of the said bonds is necessary to facilitate the preservation of the investments made by the policy holders of British American Insurance Company (Barbados) Ltd.\n"
}