{
  "bill_id": 26,
  "slug": "vesting-in-nhc-land-at-walkers-st-andrew",
  "title": "Vesting in NHC Land at Walkers, St. Andrew",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/9a7a962af01e861e3a9c666cb72b5012.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2014-06-04",
  "first_reading": "2014-06-11",
  "gazette_date": "2014-06-02",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament, in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, approve the vesting in the National Housing Corporation of the parcel of land, the property of the Crown situate at Walker Savannah in the parish of Saint Andrew in this Island, more particularly described in the Schedule hereto, for the public purpose of housing development.\nof\nAPPROVED by the House of Assembly this day , Two thousand and fourteen.\nSpeaker\nAPPROVED by the Senate this\nday of\nTwo thousand and fourteen.\nPresident\nSCHEDULE\nALL THAT land situate at Walker Savannah, in the parish of Saint Andrew,\n(formerly called Walkers) and said to contain by estimation 13.63 hectares or thereabouts, (which represents a metric conversion from 34.07 acres) but found by subsequent survey made and certified on the 16% day of September, 1976 (to be part of a larger area containing by admeasurement 41.767 acres divided into lots at Greenland in the parish of Saint Andrew) and to contain by estimation 13.795 hectares which represents a metric conversion from 34.087 acres or thereabouts (inclusive of 0.238 hectares or 0.59 acres in road) and found by recent survey to contain by admeasurement 13.04 hectares, which area represents a metric conversion from 32.22 acres or thereabouts (inclusive of 0.71 hectares or 1.76 acres in drainage reserve) Abutting and Bounding on lands now or formerly of Greenland Plantation, on lands of the Estate of Claudiaus Small, deceased, ona public road which leads to Long Pond in one direction and to Walkers Main Road in the other direction, on lands now or late of Randal Sandiford, on lands now or formerly of the Barbados Government, on a public toad known as Walkers Main Road that leads to the Saint Andrew Parish Church in one direction and to Farley Hill National Park in the other direction and on lands now or formerly of Greenland Plantation and vested in the Barbados Agricultural Development and Marketing Corporation or however else the same may abut and bound, as shown and delineated on a plan certified on the 1% day of April, 2010 by James A. Browne, Land Surveyor and recorded in\nthe Lands and Surveys Department\non the 6\" day of April, 2010 as Plan No. 426/2010.\nios)\nADDENDUM\n\nOn the 5\" day of July, 2012, the Cabinet agreed that the parcel of land situate at Walker Savannah in the parish of Saint Andrew should be vested in the National Housing Corporation for the public purpose of housing development.\nThe parcel of land, more particularly desribed in the Schedule hereto, was acquired by the Crown by private treaty and deed of conveyance dated the 21\" day of June, 2010 between Carrol Claudine Bourne, Administratrix and Personal Representative of the Estate of Ivan Bourne (and the duly qualified Attorney on record for Grace Anita Anfossy, formerly Cumberbatch, and Valerie Angelique Hamblin, Executrices of the Estate of Ivan Bourne) and the Crown, and recorded in the Land Registry on the 19% day of July, 2010 as Deed No. 5142/2010.\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 the approval of Parliament is now sought for the vesting in the National Housing Corporation of the parcel of land, more particularly described in the Schedule to this Resolution, for the public purpose of housing development.\nfone aia)\nmi LES TRG 8 ol Sencd Dec's s 3 s i w ant Thiy oran scperceces cics sone Dy ma gated 7Gtr Gcteper 2005 Scare a a ° FF | 3} yi 3 Se a mY ; ° conor ®Barbadss\nBien of Lang\nat\ncontaining\nsurveyed for\nCertifies\nIs 0% bz\njay ¢. Vs Ssh)\nta Es\n\n2\n&\nHe\nw\n3\ng\ngi 4 me tw\nog gle eee he ey aiafei Va\n%\n3% > _\ny3 fy d w FS NOK\n» ty\ngars ear Bei\n¥ «\nSB\nertes i pea |g SE i ~ as, -* uit lho Aheb s 2: 5 & j nti ig eel | | | Distonces va ‘fn eIVes\nB\ntrae]\n"
}