{
  "bill_id": 272,
  "slug": "public-procurement-bill-2018",
  "title": "Public Procurement Bill, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/2cce24c43cd05912923c3e9aa3e938b0.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2018-02-23",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "Explanatory Memorandum after page 106\n\n2018-02-14\n\nOBJECTS AND REASONS\n\nThis  Bill  would  regulate  public  procurement  and  in  particular  promote\nintegrity,  fairness,  transparency,  value  for  money  and  efficiency  in  public\nprocurement.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nShort title\n\nInterpretation\n\nApplication of Act\n\nPART II\n\nADMINISTRATION\n\nManagement of public procurement\n\nFunctions of Chief Procurement Officer\n\nFunctions of head of procuring entity\n\nTenders committees\n\nEstablishment of Public Procurement Tribunal\n\nPART III\n\nPLANNING AND INITIATION OF PROCUREMENT\n\n9.\n\nPlanning of procurement\n\n\f3\n\n10.\n\nPublication of forthcoming procurement\n\n11.\n\nInitiation of procurement\n\n12.\n\nProcurement to be conducted with certain objectives\n\n13.\n\nEstimation of value of procurement\n\n14.\n\nProcurement of common items\n\n15.\n\nUse of agents\n\nPART IV\n\nMETHODS OF PROCUREMENT\n\n16.\n\nSelection of method of procurement\n\nOpen Tendering and Restricted Tendering\n\n17.\n\nOpen tendering\n\n18.\n\nRestricted tendering\n\n19.\n\nSolicitation documents for tendering\n\n20.\n\nClarification and modification of invitations to tender and solicitation\ndocuments\n\n21.\n\nTender securities\n\n22.\n\nMeetings with suppliers prior to presentation of tenders\n\n23.\n\nDeadline for presenting tenders\n\n24.\n\nPresentation of tenders\n\n\f4\n\n25.\n\nPresentation of separately sealed technical and financial tenders\n\n26.\n\nValidity of tenders, modification and withdrawal of tenders\n\n27.\n\nOpening of tenders\n\n28.\n\nEvaluation committees\n\n29.\n\nEvaluation criteria and procedures\n\n30.\n\nExamination and evaluation of tenders\n\n31.\n\nSeparate opening, examination and evaluation of technical and financial\ntenders\n\n32.\n\nRejection of abnormally low tenders\n\n33.\n\nDetermination of successful tender\n\n34.\n\nSuccessful tender notice and standstill period\n\n35.\n\nSuccessful tender acceptance notice\n\n36.\n\nNegotiations\n\n37.\n\nExecution of procurement contract\n\n38.\n\nNotice of award of procurement contract\n\n39.\n\nManagement of procurement contract\n\n40.\n\nReports on supplier performance\n\n41.\n\nCancellation of procurement\n\n\f5\n\nRequests for Quotations\n\n42.\n\nRequests for quotations\n\n43.\n\nSolicitation documents for requests for quotations\n\n44.\n\nMeetings with suppliers and presentation of quotations\n\n45.\n\nNegotiations on quotations prohibited\n\n46.\n\nEvaluation of quotations, determination of successful quotations,\nprocurement contracts, supplier performance and cancellation of\nprocurement\n\n47.\n\nCriteria for single-source procurement\n\nSingle-Source Procurement\n\n48.\n\nPermission to engage in single-source procurement\n\n49.\n\nSolicitation documents for single-source procurement\n\n50.\n\nEvaluation of single-source submission\n\n51.\n\nNegotiations for single-source procurement\n\n52.\n\nProcurement contracts, supplier performance and cancellation in relation\nto single-source procurement\n\n53.\n\nFramework agreements\n\nFramework Agreements\n\nProcurement of Services of Individual Consultants\n\n54.\n\nProcurement of services of individual consultants\n\n\f6\n\n55.\n\nSolicitation in relation to individual consultants\n\n56.\n\nSolicitation document not required in respect of individual consultants\n\n57.\n\nPresentation of submissions by individual consultants and evaluation of\nsubmissions\n\n58.\n\nNegotiations with individual consultants\n\n59.\n\nProcurement contracts, supplier performance and cancellation in relation\nto services of individual consultants\n\nPART V\n\nGENERAL RULES REGARDING PROCUREMENT\n\n60.\n\nDescription of subject matter of procurement\n\n61.\n\nStandardisation of trade terms and conditions etc.\n\n62.\n\nPublication of notices\n\n63.\n\nCorrections to published information\n\n64.\n\nCommunications\n\nPART VI\n\nREGISTRATION, ELIGIBILITY AND QUALIFICATION\n\n65.\n\nSuppliers Register\n\n66.\n\nSuppliers to be registered\n\n67.\n\nChanges affecting registration\n\n\f7\n\n68.\n\nEligibility of suppliers to participate in public procurement\n\n69.\n\nExclusion of supplier from particular procurement proceedings\n\n70.\n\nRemoval from Suppliers Register\n\n71.\n\nQualifications of suppliers\n\n72.\n\nPre-qualification of suppliers\n\n73.\n\nClarification of pre-qualification notices and documents\n\nPART VII\n\nCHALLENGE PROCEEDINGS\n\n74.\n\nAppeals to Tribunal in respect of registration, exclusion etc.\n\n75.\n\nProcedure for appeal\n\n76.\n\nReconsideration of decision or action by procuring entity or tenders\ncommittee\n\n77.\n\nAppeals to Tribunal in respect of reconsideration proceedings\n\n78.\n\nHearing of appeal\n\n79.\n\nDecisions by Tribunal\n\n80.\n\nCosts\n\n81.\n\nDisclosure in reconsideration and appeal proceedings\n\n82.\n\nRights of participants in reconsideration and appeal proceedings\n\n\f8\n\n83.\n\nEffect of an application for reconsideration or an appeal\n\n84.\n\nCourt proceedings\n\nPART VIII\n\nMISCELLANEOUS\n\n85.\n\nForm of procurement contract\n\n86.\n\nProcurement record and contract management record\n\n87.\n\nPublic procurement manuals, standard documents and instructions\n\n88.\n\nAnnual reports\n\n89.\n\nConfidentiality in procurement proceedings\n\n90.\n\nDisclosure of interest\n\n91.\n\nProtection from suit, victimisation etc.\n\n92.\n\nOfficers engaged in procurement activities\n\n93.\n\nOffences and penalties\n\n94.\n\nRules\n\n95.\n\nRepeal and consequential changes\n\n96.\n\nTransitional provisions\n\n97.\n\nCommencement\n\n\f9\n\nFIRST SCHEDULE\n\nTENDERS COMMITTEES\n\nSECOND SCHEDULE\n\nPUBLIC PROCUREMENT TRIBUNAL\n\nTHIRD SCHEDULE\n\nCONSEQUENTIAL AMENDMENTS\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to regulate public procurement and in particular to promote integrity,\nin  public\n\ntransparency,  value  for  money  and  efficiency\n\nfairness,\nprocurement.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f12\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Public Procurement Act, 2018.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“accounting officer” has the meaning assigned to it by section 2 of the Financial\n\nManagement and Audit Act, Cap. 5;\n\n“coercive practice” means harming or threatening to harm, directly or indirectly,\na person or the property of a person, so as to influence participation or a\ndecision  in  procurement  proceedings  or  affect  the  execution  of  a\nprocurement contract or framework agreement;\n\n“collusive practice” means a scheme or arrangement between 2 or more suppliers,\nwith or without the knowledge of a procuring entity, designed to establish\nsubmissions at prices that are artificial or non-competitive and includes a\nscheme  or  arrangement  for  price-fixing  and  bid-rigging  as  described  in\nsections 33 and 35, respectively, of the  Fair Competition Act, Cap. 326C;\n\n“common item” means a good or service that is regularly required by more than\n\none procuring entity but does not include a drug;\n\n“conflict of interest” means a situation in which the personal interest of a person\nor  that  of  a  close  relative  of  the  person,  might  be  furthered,  directly  or\nindirectly, from the official actions of the person or in which the personal\ninterest of the person or that of a close relative, might prevent the person\nfrom acting impartially and in the public interest;\n\n“contract management record” means the record required to be kept pursuant to\n\nsection 86(1)(b);\n\n\f13\n\n“corrupt practice” means the offering, giving, receiving or soliciting, directly or\nindirectly,  of  anything  of  value  to  influence  the  action  of  an  officer  in\nprocurement proceedings or in the execution of a procurement contract or\nframework agreement;\n\n“day” does not include a Saturday, Sunday or public holiday;\n\n“Director” means the Director of Finance and Economic Affairs;\n\n“drug”  has  the  meaning  assigned  to  it  by  section  2  of  the  Pharmacy  Act,\n\nCap. 372D;\n\n“force majeure” means an event that is beyond the reasonable control of a person\nand which makes the person’s performance of his obligations impossible or\nso  impractical  as  to  be  reasonably  considered  to  be  impossible  in  the\ncircumstances;\n\n“framework  agreement”  means  an  agreement  that  is  executed  with  a\nsupplier  upon  completion  of  the  first  stage  of  a  framework  agreement\nprocedure and sets out the terms under which the supplier will enter into a\nprocurement contract during the period to which the agreement relates;\n\n“framework agreement procedure” means a procedure conducted in two stages\n- a first stage to select a supplier to be a party to a framework agreement and\na second stage to award a procurement contract to a supplier who is a party\nto the agreement;\n\n“fraudulent practice” means the misrepresentation or omission of facts in order\nto influence procurement proceedings or the execution of a procurement\ncontract or framework agreement;\n\n“head of a procuring entity” means, in relation to\n\n(a)\n\n(b)\n\na procuring entity that is a statutory body, the chief executive officer\nor other officer who holds a similar position in the entity;\n\na state-owned company, the chief executive officer or other officer who\nholds a similar position in the company;\n\n\f14\n\n(c)\n\nany other procuring entity, the accounting officer of the entity;\n\n“medical practitioner” has the meaning assigned to it by section 2 of the Medical\n\nProfession Act, 2011 (Act 2011-1);\n\n“officer”,  in  relation  to  a  procuring  entity,  means  a  public  officer  or  other\nemployee, including a temporary employee and a chief executive officer\nand, where the entity is managed or governed by a board or other similar\nbody, the members of the board or other body, as the case may be;\n\n“open  framework  agreement”  means  a  framework  agreement  to  which  any\nsupplier, in addition to the initial parties, may subsequently become a party;\n\n“open tendering” means tendering in response to a solicitation to the public at\n\nlarge;\n\n“pharmacist” has the meaning assigned to it by section 2 of the Pharmacy Act,\n\nCap. 372D;\n\n“pre-qualification document” means a document issued by a procuring entity that\n\nsets out the terms and conditions of pre-qualification proceedings;\n\n“procurement  contract”  means  a  contract  between  a  procuring  entity  and  a\n\nsupplier in respect of a procurement;\n\n“procurement record” means the record required to be kept pursuant to section\n\n86(1)(a);\n\n“procuring entity” means any\n\n(a)\n\nministry,  department,  agency,  organ,  unit  or  other  authority  of\nGovernment;\n\n(b)\n\nstatutory body; or\n\n(c)\n\nstate-owned company,\n\nthat uses public funds for any purpose whatsoever;\n\n\f“public funds” means\n\n15\n\n(a)\n\n(b)\n\nrevenue, including all tolls, taxes, imposts, rates, duties, fees, penalties,\nforfeitures, rents and dues and proceeds of sale and other receipts, from\nwhatever  sources  arising,  over  which  Parliament  has  the  power  of\nappropriation;\n\nmoney  raised  in  circumstances  from  which  it  can  be  reasonably\ninferred that the Crown accepts ultimate liability in the case of default;\nand\n\n(c)\n\nmoney raised in accordance with any enactment for a public purpose;\n\n“public officer” has the meaning assigned to it by section 2 of the Public Service\n\nAct, Cap. 29;\n\n“public-private  partnership”  means  an  arrangement  governed  by  a  long  term\nprocurement  contract  between  a  procuring  entity  and  a  private  party\ninvolving  the  designing,  financing,  building  and  operation  of  an\ninfrastructure project or the provision of a service through the appropriate\nsharing of resources, risks and rewards;\n\n“public procurement” or “procurement” means the acquisition of goods, works\n\nor services by a procuring entity;\n\n“single-source  procurement”  means  procurement  initiated  by  soliciting  one\n\nsupplier;\n\n“solicitation” means an invitation to tender or to submit quotations or proposals;\n\n“solicitation  document”  means  a  document  which  sets  out  the  terms  and\nconditions of a procurement and is issued by a procuring entity to suppliers\nto guide their preparation and presentation of submissions;\n\n“standstill period” means the period commencing with the date of dispatch of a\nsuccessful tender notice pursuant to section 34(1) and ending with such date\nas a procuring entity determines in accordance with section 34(3) and (4);\n\n\f16\n\n“state-owned company” means a company that is wholly owned by the Crown\n\nor in respect of which the Crown owns the majority of the shares;\n\n“statutory body” has the meaning assigned to it by section 2 of the Financial\n\nManagement and Audit Act, Cap. 5;\n\n“submission” means a tender, quotation or proposal submitted by a supplier in\n\nresponse to a solicitation by a procuring entity;\n\n“supplier” means a provider of goods, works or services;\n\n“Suppliers Register” means the register referred to in section 65(1);\n\n“tenders committee” means the General Tenders Committee, the Drug Tenders\nCommittee  or  a  special  tenders  committee  established  by  or  pursuant  to\nsection 7;\n\n“tender security” means a security that a procuring entity requires from a supplier\nto secure the performance of an obligation relating to a matter referred to in\nsection 21(1)(b) but, for the avoidance of doubt, does not include a security\nfor the performance of a procurement contract;\n\n“Tribunal” means the Public Procurement Tribunal established by section 8;\n\n“undue influence” includes any form of pressure brought to bear by an official,\nelected or appointed, who is in a position either to provide a benefit to, or\nexact punishment against, any person involved in procurement activities or\ndecisions.\n\nApplication of Act\n\n3.(1)\nof doubt, public procurement in respect of public-private partnerships.\n\nThis Act applies to public procurement including, for the avoidance\n\n\f17\n\n(2)\nNotwithstanding subsection (1), to the extent that this Act conflicts with\nan  obligation  of  the  Crown  under  or  arising  out  of  a  treaty  or  other  form  of\nagreement between Barbados and\n\n(a)\n\n(b)\n\nanother  State,  including  an  agreement  for  technical  or  other\ncooperation;\n\nany  subdivision  or  local  authority  of  another  State  or  any  other\nauthority of the State; or\n\n(c)\n\nan international financial institution,\n\nthe requirements of the treaty or other agreement shall prevail.\n\nPART II\n\nADMINISTRATION\n\nManagement of public procurement\n\n4.\nmanagement of public procurement.\n\nThe  Chief  Procurement  Officer  shall  be  responsible  for  the\n\nFunctions of Chief Procurement Officer\n\n5.(1)\nOfficer shall\n\nWithout prejudice to the generality of section 4, the Chief Procurement\n\n(a)\n\n(b)\n\n(c)\n\nformulate or recommend for the approval of the Minister, policies and\nrules on public procurement;\n\nformulate or recommend for the approval of the Director, for public\ndissemination,  manuals,  standard  documents  and  guidelines  to\nfacilitate the implementation and operation of this Act;\n\nmonitor  the  operation  and  performance  of  the  public  procurement\nsystem, prepare annual reports on the operation and performance of the\nsystem and recommend changes to the system where desirable;\n\n\f18\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\npromote  and  advise  on  capacity  building  in  the  public  procurement\nsystem and advise on the professional qualifications and competencies\nrequired for officers engaged in procurement proceedings;\n\nmonitor  the  procurement  proceedings  of  procuring  entities  to\ndetermine whether such entities are in compliance with this Act;\n\nadvise the Director and procuring entities on matters relating to public\nprocurement;\n\norganise  and  maintain  systems  for  the  management  and  public\ndissemination  of  data,  statistics  and  other  information  on  public\nprocurement; and\n\nwhether  on  his  own  initiative  or  at  the  request  of  the  Director,\ninvestigate and report to the Director on any procurement proceedings\nthat are suspected to be in violation of this Act.\n\n(2)\nThe Chief Procurement Officer may, in pursuance of his functions and, in\nparticular, in order to determine whether a procuring entity is in compliance with\nthis  Act,  inspect  the  offices,  and  have  access  to  the  records,  books  and  other\ndocuments, of the entity, and require from the entity such information as may be\nnecessary for the purpose.\n\nFunctions of head of procuring entity\n\n6.(1)\nThe head of a procuring entity shall ensure that the entity conducts\npublic procurement in accordance with this Act and performs its functions under\nthis Act in a timely and efficient manner.\n\nWithout  prejudice  to  the  generality  of  subsection  (1),  the  head  of  a\n\n(2)\nprocuring entity shall\n\n(a)\n\nensure that\n\n(i)\n\nan  officer  within  the  entity  is  designated  to  coordinate  the\nprocurement proceedings of the entity;\n\n\f19\n\n(ii)\n\nofficers engaged in procurement proceedings are supervised to\nprevent  embezzlement,  fraud,  carelessness  or  the  waste  of\nresources;\n\n(iii)\n\nappropriately skilled persons are assigned to\n\n(A)\n\nprepare  statements  of  requirements  and  perform  other\nfunctions relevant to procurement proceedings; and\n\n(B)\n\nsit on evaluation committees; and\n\n(iv)\n\nappropriately qualified persons provide technical input into the\nprocurement proceedings; and\n\n(b)\n\nbefore a procurement is initiated, confirm that funds are available to\nconduct the procurement.\n\nThe head of a procuring entity may, in writing, delegate to another officer\n(3)\nof the entity on such conditions as he may determine, any of the duties set out in\nsubsections (1) and (2), but such a delegation does not relieve the head of the\nentity of his responsibility under this Act.\n\nTenders committees\n\n7.(1)\nThere is established a committee, to be known as the General Tenders\nCommittee, which shall, in respect of procurement by means of open tendering\nand restricted tendering\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nreview and, where appropriate, approve pre-qualification documents,\nsolicitation  documents,  notices  and  shortlists  of  suppliers  and  any\namendments thereto prior to their issue;\n\ndetermine whether to grant extensions of deadlines where so requested\nby procuring entities;\n\nconduct and record openings of tenders;\n\nconsider evaluation reports and recommendations by procuring entities\nas to which tenders should be accepted as successful tenders; and\n\n\f20\n\n(e)\n\nconsider recommendations by procuring entities to cancel particular\nprocurement activities.\n\n(2)\nThere is also established a committee, to be known as the Drug Tenders\nCommittee, which shall, notwithstanding subsection (1), discharge the functions\nset out in subsection (1) in respect of the procurement of drugs.\n\nNotwithstanding subsection (1), where the Crown borrows money from an\n(3)\ninternational financial institution and the money is to be expended by the Crown,\nthere  shall  be  established  a  committee,  to  be  known  as  a  special  tenders\ncommittee, which shall discharge the functions set out in subsection (1) in respect\nof procurement arising out of the purpose for which the money is to be expended.\n\nThe  First  Schedule    has  effect  as  to  the  constitution  of  the  tenders\n\n(4)\ncommittees and otherwise in relation thereto.\n\nNotwithstanding  subsections  (1)  to  (4),  the  chairman  of  a  tenders\n(5)\ncommittee may, where this Act so provides, discharge a function of the tenders\ncommittee on behalf of the committee.\n\nEstablishment of Public Procurement Tribunal\n\n8.(1)\nThere is established a body to be known as the Public Procurement\nTribunal which shall hear and determine matters that come before it pursuant to\nthis Act.\n\nThe Tribunal is a body corporate to which section 21 of the Interpretation\n\n(2)\nAct, Cap. 1 applies.\n\nThe Second Schedule has effect as to the constitution of the Tribunal and\n\n(3)\notherwise in relation thereto.\n\n\f21\n\nPART III\n\nPLANNING AND INITIATION OF PROCUREMENT\n\nPlanning of procurement\n\n9.(1)\n\nA procuring entity shall\n\n(a)\n\n(b)\n\nplan its procurement activities in a rational manner;\n\naggregate  its  requirements  for  goods,  works  and  services,  where\npracticable,  to  obtain  value  for  money  and  to  reduce  the  cost  of\nprocurement;\n\n(c)\n\nprepare and submit to the Chief Procurement Officer prior to a financial\nyear\n\n(i)\n\nan annual procurement plan; and\n\n(ii)\n\nan estimation of its requirements for goods, works and services,\n\nfor the year; and\n\n(d)\n\nprepare, where requested to do so by the Chief Procurement Officer,\nan  individual  procurement  plan  for  any  particular  procurement\nidentified by the Chief Procurement Officer.\n\n(2)\nNotwithstanding  subsection  (1)(c),  the  Chief  Procurement  Officer  may\npermit a procuring entity to submit a procurement plan in respect of a period other\nthan a year.\n\nPublication of forthcoming procurement\n\n10.(1)\nprocurement activities it plans to conduct during the year.\n\nA procuring entity shall, prior to a financial year, publish a list of the\n\n(2)\n\nThe list shall\n\n(a)\n\ncontain an indication of the types of goods, works and services likely\nto be required; and\n\n\f22\n\n(b)\n\nbe updated, where necessary, and published every 6 months.\n\nA  procuring  entity  may  publish  advance  notice  of  any  forthcoming\n\n(3)\nprocurement.\n\n(4)\n\nPublication under this section does not\n\n(a)\n\n(b)\n\n(c)\n\nconstitute a solicitation;\n\noblige a procuring entity to issue a solicitation; or\n\nconfer any rights on suppliers.\n\nInitiation of procurement\n\n11.\n\nProcurement shall not be initiated unless\n\n(a)\n\nthe subject matter of the procurement, the quantity of goods, works or\nservices required and the estimated value of the procurement contract\nare documented in the procurement record; and\n\n(b)\n\nthe head of the procuring entity or an officer designated by him for the\npurpose under section 6, authorises the initiation of the procurement.\n\nProcurement to be conducted with certain objectives\n\n12.\n\nProcurement shall be conducted in a manner that\n\n(a)\n\n(b)\n\nensures\nproceedings;\n\nintegrity,\n\nfairness  and\n\ntransparency\n\nin  procurement\n\npromotes fair competition among, participation by, and equal treatment\nof, suppliers;\n\n(c)\n\nmaximizes economy and efficiency; and\n\n(d)\n\npromotes sustainable development.\n\n\f23\n\nEstimation of value of procurement\n\n13.(1)\n\nA procuring entity shall not\n\n(a)\n\n(b)\n\ndivide its procurement activities or value a contract in parts; or\n\nuse any valuation method for estimating the value of a procurement,\n\nso  as  to  limit  competition  among  suppliers  or  otherwise  avoid  its  obligations\nunder this Act.\n\nA procuring entity shall, in estimating the value of a procurement contract,\n(2)\ninclude the estimated maximum total value of the contract or, where a framework\nagreement  is  contemplated,  of  all  procurement  contracts  envisaged  under  the\nagreement  over  its  entire  duration,  taking  into  account  all  forms  of\nremuneration.\n\nProcurement of common items\n\n14.(1)\nProcurement Officer, by\n\nCommon  items  shall  be  procured,  at  the  discretion  of  the  Chief\n\n(a)\n\n(b)\n\nthe Chief Procurement Officer on behalf of procuring entities; or\n\nprocuring entities under arrangements established for the purpose by\nthe Chief Procurement Officer.\n\n(2)\n\nThe Chief Procurement Officer\n\n(a)\n\nshall\n\n(i)\n\nconsult with procuring entities in order to determine\n\n(A)\n\nwhich goods and services are common items; and\n\n(B)\n\nthe estimated need for the items;\n\n(ii)\n\ndistribute  to  procuring  entities  every  6  months,  a  list  of  items\ndesignated as common items;\n\n\f24\n\n(iii)\n\n(iv)\n\ninto  appropriate  contractual  arrangements  for\n\nenter\nprocurement of common items; and\n\nthe\n\nissue regularly updated information to procuring entities on the\ncommon  items  available  and  the  prices,  delivery  times  and\narrangements established for ordering or obtaining the items; and\n\n(b)\n\nmay  utilise  warehouses,  where  appropriate,  for  the  cost-effective\nstorage and distribution of common items.\n\nThe Chief Procurement Officer shall, for the purpose of procurement under\n\n(3)\nsubsection (1)(a), operate a bank account into which shall be paid\n\n(a)\n\n(b)\n\n(c)\n\nmoney provided for the procurement of common items;\n\nmoney by way of repayments made by procuring entities in respect of\nprocurement conducted on their behalf; and\n\nany other money which he may receive in the course of his official\nduties.\n\nThe Chief Procurement Officer shall pay out of the account referred to in\n\n(4)\nsubsection (3), any amounts due in settlement for common items procured.\n\nUse of agents\n\n15.\nThe Chief Procurement Officer, or a procuring entity with the approval\nof  the  Chief  Procurement  Officer,  may  procure  goods  or  services  through  an\nagent, whether local or overseas, where it appears prudent to do so.\n\n\f25\n\nPART IV\n\nMETHODS OF PROCUREMENT\n\nSelection of method of procurement\n\n16.(1)\n\nA procuring entity\n\n(a)\n\nshall,  subject  to  subsection  (2)(a)  and  (b),  conduct  procurement  by\nmeans of open tendering where the estimated or actual value of the\nprocurement contract exceeds\n\n(i)\n\n(ii)\n\n$300  000,  for  the  procurement  of  goods  or  services  or  a\ncombination of goods and services; and\n\n$500 000, for the procurement of works or a combination of works\nand goods, of works and services or of works, goods and services;\nand\n\n(b)\n\nmay conduct procurement by means of open tendering in any other\ncase where it considers it appropriate to do so.\n\n(2)\n\nA procuring entity may\n\n(a)\n\n(b)\n\n(c)\n\nconduct  procurement  by  means  of  restricted  tendering  in  the\ncircumstances set out in section 18(1);\n\nengage in single-source procurement in the circumstances set out in\nsection 47(1); and\n\nconduct procurement by means of a request for quotations where the\nestimated  or  actual  value  of  the  procurement  contract  does  not\nexceed the relevant threshold specified in subsection (1)(a).\n\nA procuring entity may, in conducting procurement, utilise a framework\n\n(3)\nagreement procedure in accordance with section 53.\n\n(4)\nSubject to subsections (1) and (2), a procuring entity shall, in selecting a\nmethod  of  procurement,  select  the  method  that  is  the  most  efficacious  in  the\n\n\f26\n\ncircumstances of the procurement and seek to maximise competition to the extent\npracticable.\n\nThe  Minister  may,  by  Order  subject  to  negative  Resolution,  vary  the\n\n(5)\namounts set out in subsection (1).\n\nOpen Tendering and Restricted Tendering\n\nOpen tendering\n\n17.(1)\nentity shall publish a notice to be called an invitation to tender.\n\nWhere  a  procuring  entity  intends  to  engage  in  open  tendering,  the\n\n(2)\n\nThe invitation to tender shall include\n\n(a)\n\n(b)\n\n(c)\n\nthe principal terms and conditions of the procurement contract;\n\nany key technical, eligibility or qualification requirements;\n\nwhether the entity will convene a meeting of suppliers; and\n\n(d)\n\nthe procedure, place and deadline for presenting tenders.\n\nSubsection (1) does not apply where a procuring entity engages in pre-\n\n(3)\nqualification proceedings.\n\nRestricted tendering\n\n18.(1)\nSubject to subsection (2), a procuring entity may, with the permission\nof the Director, conduct procurement by means of restricted tendering in any of\nthe following circumstances:\n\n(a)\n\nthe  goods,  works  or  services  to  be  procured  are  available  from  10\nsuppliers or less; or\n\n\f27\n\n(b)\n\nthere is an urgent need for the goods, works or services to be procured\nand\n\n(i)\n\nthe  circumstances  giving  rise  to  the  urgency  were  neither\nforeseeable by the entity nor the result of dilatory conduct on the\npart of the entity; and\n\n(ii)\n\nengaging in open tendering would be impractical.\n\nA  procuring  entity  shall  submit  a  request  for  permission  to  engage  in\n(2)\nrestricted  tendering  to  the  Chief  Procurement  Officer  for  submission  to  the\nDirector.\n\nThe entity shall submit with its request, in a case where it seeks to engage\n\n(3)\nin restricted tendering on the ground set out in\n\n(a)\n\n(b)\n\nsubsection (1)(a), a list of the suppliers from whom the entity believes\nthe goods, works or services are available; or\n\nsubsection (1)(b), the list of suppliers from whom the entity intends to\nsolicit tenders.\n\nThe Director may, on the advice of the Chief Procurement Officer, grant\n(4)\npermission to a procuring entity to engage in restricted tendering where any of\nthe circumstances set out in subsection (1) exists.\n\nNotwithstanding subsections (1) and (4), where, after a procuring entity\n(5)\napplies to the Director for permission to engage in restricted tendering on the\nground  set  out  in  subsection  (1)(a),  it  is  discovered  that  the  goods,  works  or\nservices  are  available  from  more  than  10  suppliers,  the  Director  may  grant\npermission to the entity to engage in restricted tendering where he is satisfied,\non the advice of the Chief Procurement Officer, that the entity made reasonable\nefforts  to  discover  the  number  of  suppliers  from  whom  the  goods,  works  or\nservices are available.\n\n\f28\n\nWhere a procuring entity engages in restricted tendering on the ground set\n\n(6)\nout in\n\n(a)\n\nsubsection (1)(a), the entity shall solicit tenders from all suppliers from\nwhom the goods, works or services are available;\n\n(b)\n\nsubsection (1)(b), the entity shall\n\n(i)\n\n(ii)\n\nin a non-discriminatory manner, select suppliers from whom to\nsolicit tenders; and\n\nin order to ensure effective competition, select a sufficient number\nof suppliers.\n\nSolicitation documents for tendering\n\n19.(1)\n\nA procuring entity shall provide a solicitation document\n\n(a)\n\n(b)\n\nto each supplier who responds to its invitation to tender in accordance\nwith the procedures and requirements specified therein;\n\nto  each  supplier  who  pre-qualifies  pursuant  to  pre-qualification\nproceedings  or,  where  the  entity  selects  a  limited  number  of  pre-\nqualified suppliers from whom to solicit tenders, who is among the\nnumber of selected, pre-qualified suppliers; or\n\n(c)\n\nin a case of restricted tendering on the ground set out in\n\n(i)\n\n(ii)\n\nsection 18(1)(a), to each supplier from whom the goods, works or\nservices are available; or\n\nsection 18(1)(b), to each supplier from whom the entity intends to\nsolicit tenders.\n\nThe  entity  shall  prepare  the  solicitation  document  in  the  form  of  the\n(2)\nstandard document, if any, issued or approved by the Director for the purpose\nand include in the document\n\n(a)\n\ninformation on the management of the procurement proceedings and\nthe applicable laws;\n\n\f29\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nthe  eligibility  requirements  of  suppliers  and  an  indication  of  any\ndocumentary evidence required to be submitted as proof of eligibility;\n\na clear statement of the qualification criteria, the procedures to be used\nto  ascertain  the  qualifications  of  suppliers  and  any  documentary\nevidence required to be submitted to demonstrate those qualifications;\n\na description of the subject matter of the procurement in the form of a\nstatement of requirements;\n\ninstructions on the preparation and presentation of tenders, including\nany requirement for the presentation of separately sealed technical and\nfinancial tenders, and the procedure, place and deadline for presenting\ntenders;\n\nwhere a tender security is required, a statement to that effect, and any\nrequirement as to the nature, form, amount and other principal terms\nand conditions of the security and the issuer, with sufficient specificity\nto enable a supplier to be reasonably certain of the type of security that\nthe procuring entity would consider acceptable;\n\n(g)\n\nthe duration of the standstill period or, where no standstill period will\nbe applied, a statement to that effect and the reason for not applying\none;\n\n(h)\n\nthe procedure, place, date and time for the opening of tenders;\n\n(i)\n\nthe criteria and procedure for evaluating tenders including\n\n(i)\n\n(ii)\n\nwhether the successful tender will be ascertained on the basis of\nprice or of price and other criteria;\n\nwhere price and other criteria are to be used in the evaluation, the\nrelative weights of all criteria; and\n\n(iii)\n\nthe manner of application of the criteria in the evaluation;\n\n(j)\n\nany formalities required for a procurement contract to be executed once\na successful tender is accepted;\n\n\f30\n\n(k)\n\n(l)\n\nthe  principal  terms  and  conditions  and  proposed  form  of  the\nprocurement contract; and\n\nnotice of the right to challenge decisions or actions of a procuring entity\nor tenders committee that are allegedly not in compliance with this Act.\n\nThe  entity  may  charge  a  non-refundable  fee  for  the  provision  of  a\n(3)\nsolicitation  document  to  a  supplier  but  the  fee  shall  reflect  only  the  cost  of\nproviding the document to the supplier.\n\nClarification and modification of invitations to tender and solicitation\ndocuments\n\nWhere  a  procuring  entity  receives,  at  least  2  weeks  prior  to  the\n20.(1)\ndeadline for the presentation of tenders, a request from a supplier for clarification\nof  an  invitation  to  tender  or  a  solicitation  document,  the  entity  shall,  without\nidentifying  the  source  of  the  request,  provide  the  clarification  to  all  suppliers\ninvolved in the procurement proceedings, including the supplier who made the\nrequest, at the same time and within sufficient time to enable them to present\ntheir tenders before the deadline for presentation.\n\nWithout prejudice to the generality of subsection (1), a procuring entity\n(2)\nshall provide clarification of a solicitation document to all suppliers to whom the\nentity provided the document.\n\nA procuring entity may, prior to the deadline for presenting tenders, and\n(3)\nwith the approval of the chairman of the relevant tenders committee, whether on\nits own initiative or as a result of a request by a supplier for a clarification, modify\nan invitation to tender or a solicitation document by issuing an addendum.\n\n(4)\n\nThe addendum shall\n\n(a)\n\nin the case of\n\n(i)\n\nan invitation to tender, be published in the same manner and place\nas the invitation to tender; and\n\n\f31\n\n(ii)\n\na  solicitation  document,  be  made  available  to  each  supplier  to\nwhom the entity provided the solicitation document; and\n\n(b)\n\nbe binding on the suppliers.\n\nTender securities\n\n21.(1)\n\nWhere a procuring entity requires a tender security\n\n(a)\n\n(b)\n\nthe requirement shall apply to all suppliers who present tenders; and\n\nany requirement that the entity sets out in the solicitation document in\nrespect of the security that refers directly or indirectly to the conduct\nof a supplier shall relate to\n\n(i)\n\nthe withdrawal or modification of the tender after the deadline for\npresenting tenders; or\n\n(ii)\n\nthe failure to\n\n(A)\n\n(B)\n\n(C)\n\nexecute  a  procurement  contract  where  so  required  by  the\nsolicitation document;\n\nprovide  a  security,  where  so  required  by  the  solicitation\ndocument, for the performance of the procurement contract\nafter the successful tender is accepted; or\n\ncomply with any other condition precedent to executing the\nprocurement  contract,  as  specified  in  the  solicitation\ndocument.\n\nWhere a supplier breaches a requirement set out in a solicitation document\n(2)\nin relation to a matter specified in subsection (1)(b)(i) or (ii), his tender security\nshall be forfeited.\n\n(3)\n\nA procuring entity shall\n\n(a)\n\nmake no claim to the amount of a tender security; and\n\n\f32\n\n(b)\n\npromptly  return  the  security  document  where  any  of  the  following\noccurs:\n\n(i)\n\n(ii)\n\nthe expiry of the tender security;\n\nthe execution of a procurement contract and the provision of a\nsecurity for the performance of the contract, where such a security\nfor performance is required by the solicitation document;\n\n(iii)\n\nthe cancellation of the procurement; or\n\n(iv)\n\nthe  withdrawal  of  the  relevant  tender  prior  to  the  deadline  for\npresenting tenders.\n\nA procuring entity may reject a tender security on the ground that the issuer\n\n(4)\nhas become insolvent or has otherwise ceased to be creditworthy.\n\nMeetings with suppliers prior to presentation of tenders\n\nWhere a procuring entity convenes a meeting of suppliers prior to the\n22.(1)\ndeadline for presenting tenders, the entity shall prepare minutes of the meeting.\n\n(2)\n\nThe minutes shall\n\n(a)\n\n(b)\n\ninclude  any  request,  without  identifying  the  source  of  the  request,\nsubmitted at the meeting for clarification of the solicitation document,\nand the response of the entity to the request; and\n\nbe provided promptly to the suppliers to whom the entity provided the\nsolicitation document to enable the suppliers to take the minutes into\naccount in preparing their tenders.\n\nDeadline for presenting tenders\n\n23.(1)\nA procuring entity shall express a deadline for presenting tenders as\na specific date and time and shall, taking into account the reasonable needs of the\nentity, allow sufficient time for suppliers to prepare and present tenders.\n\n(2)\nWhere  a  procuring  entity  issues  a  clarification  or  modification  of  an\ninvitation  to  tender  or  a  solicitation  document,  the  entity  shall,  prior  to  the\n\n\f33\n\ndeadline  for  presenting  tenders,  request  the  chairman  of  the  relevant  tenders\ncommittee to extend the deadline, where necessary, in order to afford suppliers\nsufficient time to take the clarification or modification into account in preparing\ntheir tenders.\n\nThe chairman of a tenders committee may, in his absolute discretion, prior\n(3)\nto a deadline for presenting tenders, extend the deadline where it is not possible\nfor  one  or  more  suppliers  to  present  tenders  by  the  deadline  because  of  any\ncircumstance beyond their control.\n\nNotice of an extension of a deadline shall, in the case of a clarification or\n\n(4)\nmodification of\n\n(a)\n\n(b)\n\nan invitation to tender, be published in the same manner and place as\nthe invitation to tender; and\n\na solicitation document, be given to each supplier to whom the entity\nprovided the solicitation document.\n\nPresentation of tenders\n\n24.(1)\n\nA tender shall be presented\n\n(a)\n\nin accordance with the procedure, and at the place and by the deadline,\nspecified in the solicitation document;\n\n(b)\n\nin writing, signed and, where in\n\n(i)\n\npaper form, in a sealed envelope; or\n\n(ii)\n\nany  other  form,  according  to  the  requirements  specified  in  the\nsolicitation document, which shall ensure at least a similar degree\nof authenticity, security, integrity and confidentiality.\n\n(2)\n\nThe relevant tenders committee shall\n\n(a)\n\nprovide a secure means by which suppliers may submit tenders and\nprovide each supplier with a receipt showing the date and time when\nhis tender was received;\n\n\f34\n\n(b)\n\npreserve the security, integrity and confidentiality of the tender; and\n\n(c)\n\nensure that the content of the tender is examined only after its opening\nin accordance with section 27.\n\n(3)\nA tender received by a tenders committee after the deadline for presenting\ntenders shall not be opened and shall be returned to the supplier who presented\nit.\n\nNotwithstanding subsection (3), a tender received by a tenders committee\n(4)\nafter  the  deadline  for  presenting  tenders  may  be  accepted  and  opened  in\ncircumstances where it can be ascertained that the presentation of the tender was\ndelayed by force majeure.\n\nPresentation of separately sealed technical and financial tenders\n\nA  procuring  entity  may  request  separately  sealed  technical  and\n25.\nfinancial tenders where the entity needs to consider the financial aspects of the\ntenders separately and only after completion of the examination and evaluation\nof the technical, quality and performance characteristics of the tenders.\n\nValidity of tenders, modification and withdrawal of tenders\n\n26.(1)\ndocument.\n\nTenders shall remain valid for the period specified in the solicitation\n\nA procuring entity may, prior to the expiry of the period of validity, request\n\n(2)\nsuppliers to extend the period for an additional specified period.\n\nA supplier may refuse to extend the period of validity of his tender without\n\n(3)\nforfeiting his tender security, if any.\n\nA supplier who agrees to an extension of the validity of his tender shall\n(4)\nextend the period of validity of any tender security he provided or provide a new\ntender security to cover the extended period of validity of his tender.\n\n\f35\n\n(5)\nA supplier whose tender security is not extended or who does not provide\na new tender security shall be considered to have refused the request to extend\nthe period of validity of his tender.\n\nA supplier may modify or withdraw his tender prior to the deadline for\n\n(6)\npresenting tenders without forfeiting his tender security.\n\nA modification or notice of withdrawal of a tender is effective where it is\n\n(7)\nreceived by the procuring entity prior to the deadline for presenting tenders.\n\nOpening of tenders\n\nTenders  shall  be  opened  at  the  time  and  place  specified  in  the\n27.(1)\nsolicitation  document  and  in  accordance  with  the  procedure  specified  in  that\ndocument.\n\n(2)\n\nA supplier who presents a tender or his representative shall be\n\n(a)\n\n(b)\n\npermitted  by  the  tenders  committee  to  be  present  at  the  opening  of\ntenders; and\n\ndeemed to have been permitted to be present at the opening of tenders\nwhere he is notified of the time and place for the opening of tenders.\n\nThe name and address of each supplier whose tender is opened and the\n\n(3)\ntender price shall be\n\n(a)\n\n(b)\n\nannounced to the persons present at the opening of tenders;\n\ncommunicated, on request, to a supplier who presents a tender but is\nnot present or represented at the opening of tenders; and\n\n(c)\n\nincluded immediately in the procurement record.\n\nNotwithstanding subsections (2) and (3), section 31 shall apply where a\n\n(4)\nprocuring entity requests separately sealed technical and financial tenders.\n\nNotwithstanding  subsection  (3),  tender  prices  need  not  be  announced\n\n(5)\nwhere it is impractical to do so because of the volume of the prices.\n\n\f36\n\n(6)\nWith the exception of late tenders, which shall be returned in accordance\nwith section 24, no tender shall be accepted, rejected or evaluated at the opening\nof tenders.\n\n(7)\nA tenders committee shall note, in a record to be called a record of tender\nopening, any discrepancies or missing documents in respect of a tender, but shall\nnot  otherwise  comment  on  such  discrepancies  or  missing  documents  at  the\nopening of tenders.\n\nEvaluation committees\n\nA procuring entity shall, for each procurement, establish an evaluation\n28.(1)\ncommittee to be responsible for the evaluation of tenders and the preparation of\nan evaluation report.\n\nThe  membership  of  the  committee  shall  depend  on  the  value  and\n(2)\ncomplexity of the procurement but shall in all cases be not less than 3 persons.\n\nA  procuring  entity  may  appoint  an  external,  technical  specialist  or\n(3)\nprocurement agent to conduct the evaluation of tenders and prepare an evaluation\nreport on its behalf.\n\nA  procuring  entity  shall  require  any  person  appointed  pursuant  to\n(4)\nsubsection (1) or (3) to declare whether he has any conflict of interest in respect\nof the procurement being evaluated.\n\nWhere a person declares a conflict of interest, the person shall have no\n(5)\nfurther involvement in the procurement proceedings and shall be immediately\nreplaced by the procuring entity.\n\n(6)\n\nAn evaluation report prepared under this section may include\n\n(a)\n\n(b)\n\n(c)\n\nthe method of assessment;\n\na copy of any relevant notice and the date of issue of the notice;\n\nthe deadline for presentation of tenders;\n\n(d)\n\nthe date of the opening of tenders;\n\n\f(e)\n\nany addendum issued or query received;\n\n37\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\n(k)\n\ncopies of all other relevant documents;\n\ncomments on arithmetic corrections;\n\nany  notification  to  a  supplier  of  an  arithmetic  correction  and  any\nresponse to such a notification;\n\na table showing any corrected prices with relevant comments;\n\na comparison of tenders; and\n\nthe recommendation of the committee or person appointed pursuant to\nsubsection  (3),  including  any  recommendation  to  negotiate  with  a\nsupplier\nthe\nrecommendation.\n\ntogether  with\n\njustification\n\nappropriate\n\nfor\n\nA  procuring  entity  shall  submit  each  evaluation  report  to  the  relevant\n\n(7)\ntenders committee for consideration.\n\nEvaluation criteria and procedures\n\n29.(1)\nworks or services to be procured.\n\nThe criteria to be used to evaluate a tender shall relate to the goods,\n\n(2)\n\nThe evaluation criteria may include\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe price;\n\nthe cost of operating, maintaining and repairing goods or works;\n\nthe  time  for  the  delivery  of  the  goods,  completion  of  the  works  or\nprovision of the services, as the case may be;\n\nthe characteristics of the goods, works or services, such as functional\nand environmental characteristics;\n\nthe terms of payment and of guarantees in respect of the goods, works\nor services; and\n\n\f38\n\n(f)\n\nwhere  relevant,  the  experience,  reliability  and  professional  and\nmanagerial  competence  of  the  supplier  and  of  the  personnel  to  be\ninvolved in providing the goods, works or services.\n\nAll  non-price  evaluation  criteria  shall,  to  the  extent  practicable,  be\n\n(3)\nobjective and quantifiable.\n\nA  procuring  entity  shall,  in  evaluating  tenders  and  determining  the\n(4)\nsuccessful tender, use only the criteria and procedures specified in the solicitation\ndocument and apply the criteria and procedures in the manner specified in that\ndocument.\n\nNo criterion or procedure that has not been set out in accordance with this\n\n(5)\nsection and section 19(2) shall be used in any evaluation under this Act.\n\nExamination and evaluation of tenders\n\nA procuring entity may ask a supplier for clarification of his tender\n30.(1)\nwhere the clarification would assist the entity in the examination and evaluation\nof the tender.\n\n(2)\nA procuring entity shall correct purely arithmetic errors discovered during\nthe  examination  of  a  tender  and  give  prompt  notice  of  the  correction  to  the\nsupplier who presented the tender.\n\nNo change in a matter of substance in the tender, including a change in\n(3)\nprice and a change aimed at making an unresponsive tender responsive, shall be\nsought, offered or permitted.\n\nAny items having a zero price shall be deemed to be included in the price\n(4)\nof other items except in the case of line-item bidding where a zero price shall be\nconsidered a non-offer for the item.\n\nA procuring entity shall regard a tender as responsive where it conforms\n\n(5)\nto all requirements set out in the solicitation document.\n\n\f39\n\nNotwithstanding subsection (5), a procuring entity may regard a tender as\n\n(6)\nresponsive even where it contains\n\n(a)\n\nminor  deviations  that  do  not  materially  alter  or  depart  from  the\ncharacteristics, terms, conditions and other requirements set out in the\nsolicitation document; or\n\n(b)\n\nerrors  or  oversights  that  are  capable  of  being  corrected  without\ntouching on the substance of the tender,\n\nand  any  such  deviations  shall  be  quantified,  to  the  extent  possible,  and\nappropriately taken into account in the evaluation of the tender.\n\nNotwithstanding subsection (6), where a specification states that an item\n(7)\nis critical to the functioning of the entire lot or procurement, the failure of such\ncritical item to be responsive shall be cause for the tender in respect of the entire\nlot or procurement to be regarded as unresponsive.\n\n(8)\n\nA procuring entity shall reject a tender\n\n(a)\n\nwhere the supplier who presented the tender is not qualified or the entity\nis obliged, under this Act, to exclude the supplier from participation in\npublic procurement;\n\n(b)\n\nwhere  the  supplier  who  presented  the  tender  does  not  accept  a\ncorrection of an arithmetic error made pursuant to subsection (2);\n\n(c)\n\nwhere the tender is unresponsive; or\n\n(d)\n\nin the circumstances set out in section 32.\n\n(9)\nThe entity shall evaluate the tenders that have not been rejected in order to\nascertain the successful tender in accordance with the criteria and procedures set\nout in the solicitation document.\n\n(10)\n\nThe successful tender shall be\n\n(a)\n\nwhere price is the only criterion, the tender with the lowest price; or\n\n\f40\n\n(b)\n\nwhere there are price and other criteria, the most advantageous tender\nascertained on the basis of the criteria and procedures, specified in the\nsolicitation document, for evaluating the tenders.\n\n(11)\nWhere  tender  prices  are  expressed  in  two  or  more  currencies,  for  the\npurpose of evaluating and comparing tenders, the tender prices of all tenders shall\nbe converted to the currency specified in the solicitation document according to\nthe rate set out in that document.\n\nA procuring entity may, whether or not it has engaged in pre-qualification\n(12)\nproceedings, require a supplier who presented a tender that is determined to be\na successful tender to demonstrate or reconfirm his qualifications.\n\nThe  criteria  and  procedures  to  be  used  for  the  demonstration  or\n(13)\nreconfirmation of the qualifications of a supplier shall be set out in the solicitation\ndocument.\n\nWhere a procuring entity has engaged in pre-qualification proceedings, the\n(14)\ncriteria for confirming qualifications shall be the same as those used in the pre-\nqualification proceedings.\n\nWhere  a  supplier  who  presented  a  successful  tender  is  requested  to\n(15)\ndemonstrate  or  reconfirm  his  qualifications  but  fails  to  do  so,  the  entity  shall\nreject the tender and shall\n\n(a)\n\nsubject  to  section  35(2),  select  the  next  highest  ranked  tender  from\namong those remaining valid; or\n\n(b)\n\ncancel the procurement.\n\nSeparate opening, examination and evaluation of technical and\nfinancial tenders\n\n31.(1)\nThis section applies, in addition to section 30, where a procuring entity\nintends to consider the financial aspects any of tenders separately and only after\nthe completion of the examination and evaluation of the technical, quality and\nperformance characteristics of the tenders.\n\n\f41\n\n(2)\nA  procuring  entity  shall,  before  it  requests  the  opening  by  the  tenders\ncommittee of the financial tenders, examine and evaluate the technical, quality\nand performance characteristics of tenders in accordance with the criteria and\nprocedures specified in the solicitation document.\n\nThe results of the examination and evaluation of the technical, quality and\n(3)\nperformance characteristics of the tenders shall be immediately included in the\nprocurement record.\n\n(4)\n\nWhere the technical, quality and performance characteristics of a tender\n\n(a)\n\n(b)\n\nmeet or exceed the relevant minimum requirements, the tender shall\nbe regarded as responsive;\n\nfail to meet the relevant minimum requirements, the tender shall be\nregarded as unresponsive and shall be rejected on that ground.\n\n(5)\n\nThe procuring entity shall, in the case of\n\n(a)\n\na responsive tender,\n\n(i)\n\npromptly communicate to the supplier who presented the tender,\nthe score of the technical, quality and performance characteristics\nof his tender; and\n\n(ii)\n\ninvite all such suppliers or their representatives to the opening, by\nthe tenders committee of the financial tenders; and\n\n(b)\n\nan unresponsive tender\n\n(i)\n\npromptly send to the supplier who presented the tender a notice of\nrejection together with the reason for the rejection; and\n\n(ii)\n\nensure that his financial tender is returned unopened.\n\n\f42\n\n(6)\nThe name and address of each supplier whose tender is responsive, the\nscore of the technical, quality and performance characteristics of his tender and\nthe price of his financial tender shall\n\n(a)\n\n(b)\n\nbe  announced  to  the  persons  present  at  the  opening  of  the  financial\ntenders; and\n\ncommunicated, on request, to a supplier who was invited to, but was\nnot present or represented at, the opening of tenders.\n\nThe price of each corresponding financial tender referred to in subsection\n\n(7)\n(6) shall be included in the procurement record.\n\nThe procuring entity shall compare the financial aspects of the responsive\n(8)\ntenders and on that basis identify the successful tender in accordance with the\ncriteria and procedures set out in the solicitation document.\n\nThe successful tender shall be the tender with the best combined evaluation\n\n(9)\nin terms of\n\n(a)\n\n(b)\n\nthe criteria, other than price, specified in the solicitation document; and\n\nthe price.\n\nRejection of abnormally low tenders\n\n32.(1)\nA procuring entity may, subject to subsection (2), reject a tender where\nthe  entity  determines  that  the  price,  in  combination  with  other  constituent\nelements  of  the  tender,  is  abnormally  low  in  relation  to  the  goods,  works  or\nservices to be procured and raises concerns with the entity as to the ability of the\nsupplier who presented the tender to perform the procurement contract.\n\nA procuring entity shall not reject a tender pursuant to subsection (1) unless\n\n(2)\nthe entity\n\n(a)\n\nrequests in writing from the supplier details of the aspect of the tender\nthat gives rise to its concerns as to the ability of the supplier to perform\nthe procurement contract; and\n\n\f43\n\n(b)\n\ntakes account of any information provided by the supplier pursuant to\nthe request and of the information included in the tender but continues,\non the basis of all such information, to hold such concerns.\n\n(3)\nThe decision of a procuring entity to reject the tender of a supplier pursuant\nto  this  section  and  the  reason  for  the  decision  shall  be  communicated  to  the\nsupplier.\n\nDetermination of successful tender\n\nWhere a procuring entity determines that a tender is the successful\n33.(1)\ntender in respect of a procurement, the entity shall submit to the relevant tenders\ncommittee  for  consideration,  the  evaluation  report  on  the  matter  and  a\nrecommendation that the tenders committee treat and accept as the successful\ntender, the tender identified as such by the entity.\n\n(2)\n\nThe tenders committee may\n\n(a)\n\n(b)\n\naccept the recommendation of the procuring entity as to the successful\ntender; or\n\nwhere it does not accept the recommendation, subject to sections 29 to\n32 and taking the evaluation report into account, make its own decision\nas to which tender is the successful tender.\n\nA determination as to the successful tender does not constitute acceptance\n\n(3)\nof the tender.\n\nSuccessful tender notice and standstill period\n\n34.(1)\nWhere the relevant tenders committee determines that a tender should\nbe accepted as a successful tender, the entity shall dispatch to each supplier who\npresented a tender, a notice, to be called a successful tender notice, informing the\nsupplier that the entity intends to accept the successful tender at the end of the\nstandstill period.\n\n\f44\n\n(2)\n\nThe successful tender notice shall include\n\n(a)\n\n(b)\n\nthe  name  and  address  of  the  supplier  who  presented  the  successful\ntender;\n\nthe contract price or, where the successful tender was ascertained on\nthe basis of price and other criteria, the contract price and a summary\nof  the  other  characteristics  of  the  tender  that  made  the  tender  the\nsuccessful tender; and\n\n(c)\n\nthe duration of the standstill period.\n\nThe standstill period shall be at least 10 days from the date of dispatch of\n\n(3)\nthe notice.\n\nWhere the means of dispatch of the notice is not expected to result in the\n(4)\ndelivery of the notice to a supplier in less than 5 days, the procuring entity shall\nextend the standstill period for such additional period as the entity may consider\nappropriate in the circumstances.\n\nNotwithstanding subsection (1), no successful tender notice or standstill\n(5)\nperiod  is  required  where  the  entity  determines  that  urgent  public  interest\nconsiderations require the procurement to proceed without a standstill period.\n\nSuccessful tender acceptance notice\n\n35.(1)\nA procuring entity shall, upon the expiry of the standstill period, or,\nwhere no standstill period is required, as soon as practicable after the successful\ntender is determined, dispatch to the supplier who presented the successful tender,\na notice to be called a successful tender acceptance notice.\n\nNotwithstanding subsection (1), no successful tender acceptance notice or\n(2)\nother communication in any form conveying acceptance of a successful tender\nor the award of a procurement contract shall be issued unless\n\n(a)\n\nthe  relevant  tenders  committee  determines  that  a  particular  tender\nshould be accepted as the successful tender; and\n\n\f(b)\n\nit is confirmed that\n\n45\n\n(i)\n\nthe  procurement\nreconsideration under section 76 or an appeal to the Tribunal;\n\nto  an  application  for\n\nis  not  subject\n\n(ii)\n\nfunding is available for the procurement; and\n\n(iii)\n\nany regulatory approvals required have been granted.\n\nA procuring entity shall not be liable for the provision of goods, works or\n(3)\nservices by a supplier who receives a successful tender acceptance notice or for\nanything  done  by  the  supplier  in  connection  with  such  provision  unless  the\nsupplier, prior to the provision of the goods, works or services or the doing of\nanything in connection with such provision, enters into a procurement contract\nwith the entity in accordance with this Act.\n\nNegotiations\n\nWhere the relevant tenders committee determines that a tender should\n36.(1)\nbe accepted as a successful tender, negotiations may be held with the supplier\nwho presented the tender.\n\nNegotiations shall not relate to the price of the tender except where price\n\n(2)\nwas not a factor in the evaluation.\n\n(3)\n\nNegotiations may relate to\n\n(a)\n\nminor  amendments  to  the  special  conditions  of  the  contract,  the\ndelivery or completion schedule or work plan or the technical details\nof the statement of requirements; or\n\n(b)\n\nthe minor reduction of quantities for budgetary reasons.\n\n(4)\n\nNotwithstanding subsection (3), negotiations shall not be conducted\n\n(a)\n\nto  alter  substantially\ntechnical,  quality  or  performance\ncharacteristics of a tender, including the scope of the responsibilities\nof the supplier;\n\nthe\n\n\f46\n\n(b)\n\n(c)\n\n(d)\n\nto  alter  materially  the  terms  and  conditions  of  the  proposed\nprocurement contract;\n\nsolely  for  the  purpose  of  reducing  prices  or  fee  rates  except  where\nchanges are required to reflect any agreed technical changes; or\n\nto  alter  substantially  anything  that  was  a  deciding  factor  in  the\nevaluation.\n\n(5)\n\nA procuring entity shall\n\n(a)\n\n(b)\n\nprepare minutes of any negotiations held; and\n\nobtain the written agreement of the supplier that the minutes are a true\nand accurate record of the negotiations.\n\nExecution of procurement contract\n\nWhere  a  solicitation  document  requires  a  supplier  whose  tender  is\n37.(1)\naccepted  to  execute  a  procurement  contract  conforming  to  the  terms  and\nconditions of the accepted tender\n\n(a)\n\n(b)\n\nthe  procuring  entity  and  the  supplier  shall  execute  the  procurement\ncontract  within  a  reasonable  period  after  the  successful  tender\nacceptance notice is dispatched to the supplier; and\n\nbetween  the  time  when  a  successful  tender  acceptance  notice  is\ndispatched  to  the  supplier  and  the  execution  of  the  procurement\ncontract, neither the entity nor the supplier shall take any action that is\nlikely to interfere with the execution of the procurement contract or\nwith its performance.\n\n(2)\n\nWhere a supplier whose tender is accepted fails to\n\n(a)\n\n(b)\n\nexecute a procurement contract as required; or\n\nprovide any required security for the performance of the contract,\n\nthe procuring entity may, subject to section 35(2), select the next highest ranked\ntender from among those remaining valid or cancel the procurement.\n\n\f47\n\nNotice of award of procurement contract\n\n38.(1)\nA procuring entity shall, upon the execution of a procurement contract,\npromptly issue a notice of the award of the contract to the suppliers whose tenders\nwere  unsuccessful  and,  upon  request  by  such  a  supplier,  communicate  to  the\nsupplier the grounds for the failure of his tender.\n\nThe notice shall state the name of the supplier to whom the contract was\n\n(2)\nawarded and the contract price.\n\nA procuring entity shall, at least twice yearly, publish a cumulative list of\n\n(3)\nall procurement contracts awarded in the year.\n\nManagement of procurement contract\n\n39.(1)\nprocurement contract awarded.\n\nA procuring entity shall nominate a contract administrator for each\n\n(2)\n\nThe contract administrator shall\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nmonitor  the  performance  of  a  supplier  to  ensure  that  all  delivery  or\nperformance obligations are met and that appropriate action is taken\nby the procuring entity in the event that obligations are not met;\n\nprepare any required amendments to the procurement contract and refer\nthe amendments for the approval of the Solicitor General or another\nlegal officer nominated by the Solicitor General, or, in the case of a\nprocuring entity that is a statutory body or a state-owned company, of\nsuch legal officer as the entity may approve for the purpose;\n\nmanage any handover or acceptance procedures;\n\nrefer any recommendation for the termination of the contract for the\nconsideration  of  the  Solicitor  General  or  another  legal  officer\nnominated by the Solicitor General, or, in the case of a procuring entity\nthat is a statutory body or a state-owned company, of such legal officer\nas the entity may approve for the purpose; and\n\n\f(e)\n\nensure that\n\n48\n\n(i)\n\n(ii)\n\nthe supplier submits all required documentation;\n\nthe procuring entity meets all its payment and other obligations\non time and in accordance with the contract;\n\n(iii)\n\nthere is adequate cost, quality and time control, where required;\n\n(iv)\n\nall tests required in the contract are satisfactorily completed;\n\n(v)\n\n(vi)\n\nperformance under the contract is satisfactorily completed before\nclosing the contract management record; and\n\nthe contract management record is kept in accordance with this\nAct.\n\nReports on supplier performance\n\nA procuring entity shall submit to the Chief Procurement Officer, a\n40.(1)\nreport  on  the  performance  of  each  supplier  with  whom  the  entity  has  a\nprocurement contract.\n\n(2)\n\nThe report shall\n\n(a)\n\n(b)\n\nbe in such form as the Chief Procurement Officer requires; and\n\ninclude\n\n(i)\n\n(ii)\n\n(iii)\n\nthe  final  price  paid  for  the  goods,  works  or  services  and  an\nexplanation of any differences between that price and the original\ncontract price;\n\ninformation on the conformance of the goods, works or services\nwith  the  statement  of  requirements  and  an  explanation  of  any\nconcerns in relation to quality;\n\nthe time taken for completion of performance under the contract\nand an explanation of any differences between that time and the\ndelivery or completion schedule in the contract; and\n\n\f49\n\n(iv)\n\nsuch  other  information  as  the  Chief  Procurement  Officer  may\nrequire; and\n\n(c)\n\nbe  submitted,  in  the  case  of  a  procurement  contract  the  duration  of\nwhich is\n\n(i)\n\nless than a year, at the end of the quarter in which performance\nunder the contract is completed; and\n\n(ii)\n\na year or more, at least annually.\n\nThe Chief Procurement Officer may, in addition to the report referred to\n(3)\nin subsection (1), require such other reports from the entity as may be necessary\nfor the performance of his functions.\n\nNothing in this section prevents a procuring entity from submitting a report\n(4)\nto the Chief Procurement Officer, at any other time, on the performance of a\nsupplier.\n\nCancellation of procurement\n\n41.(1)\n\nA procuring entity may cancel a procurement\n\n(a)\n\n(b)\n\nprior to the acceptance of a successful tender; or\n\nwhere a successful tender is accepted, in the circumstances set out in\nsection 37(2).\n\nA procuring entity shall not cancel a procurement without the approval of\n\n(2)\nthe relevant tenders committee.\n\n(3)\n\nWhere a procuring entity cancels a procurement\n\n(a)\n\n(b)\n\nno tenders shall be opened after the decision to cancel the procurement\nis taken;\n\nany tenders that remain unopened at the time the decision to cancel the\nprocurement is taken shall be returned to the suppliers who presented\nthem; and\n\n\f(c)\n\nthe entity shall promptly\n\n50\n\n(i)\n\n(ii)\n\ncommunicate to any supplier who presented a tender, the decision\nof the entity to cancel the procurement; and\n\nissue a notice of the cancellation of the procurement in the same\nmanner  and  place  as  the  original  information  regarding  the\nprocurement proceedings.\n\nRequests for Quotations\n\nRequests for quotations\n\n42.(1)\nWhere a procuring entity intends to conduct procurement by means\nof  a  request  for  quotations,  the  entity  shall  request  written  quotations  from  a\nshortlist of suppliers.\n\n(2)\n\nThe entity, in developing a shortlist,\n\n(a)\n\n(b)\n\nshall  select  from  the  Suppliers  Register,  as  many  suppliers  as\npracticable but at least 3; and\n\nshall,  in  order  to  ensure  effective  competition  and  fair  and  equal\nopportunities to all suppliers\n\n(i)\n\nimplement a rotation of suppliers on successive shortlists; and\n\n(ii)\n\nnot include\n\n(A)\n\n(B)\n\nsuppliers who are not expected to satisfy fully any eligibility\nor qualification requirements;\n\nwhere there are suppliers that are practically owned by the\nsame person, more than one such supplier.\n\n(3)\n\nA supplier shall not be permitted to\n\n(a)\n\n(b)\n\ngive more than one quotation; or\n\nchange his quotation after the deadline for presenting quotations.\n\n\f51\n\n(4)\nNotwithstanding subsections (1) and (2), where a procuring entity intends\nto conduct procurement by means of a request for quotations, the entity may,\ninstead of requesting quotations from a shortlist of suppliers from the Suppliers\nRegister,  publish  the  request  to  enable  all  interested  suppliers  to  submit\nquotations.\n\nSolicitation documents for requests for quotations\n\n43.(1)\nA procuring entity shall, in order to request quotations, prepare and\nissue a solicitation document in the form of the standard document, if any, issued\nor approved by the Director for the purpose.\n\n(2)\n\nA solicitation document referred to in subsection (1) shall include\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\ninformation on the management of the procurement proceedings and\nthe applicable laws;\n\na description of the subject matter of the procurement in the form of a\nstatement of requirements;\n\ninstructions  on  the  preparation  and  presentation  of  quotations,\nincluding  any  documents  required  to  be  submitted  with  the\nquotation  and  the  procedure,  place  and  deadline  for  presenting\nquotations;\n\na statement as to whether elements, other than the cost of the goods or\nservices, such as any applicable transportation and insurance charges\nor customs duties and taxes, are to be included in the price;\n\n(e)\n\nthe criteria and procedures for evaluating quotations;\n\n(f)\n\n(g)\n\nthe  principal  terms  and  conditions  and  proposed  form  of  the\nprocurement contract; and\n\nnotice of the right to challenge decisions or actions of a procuring entity\nthat are allegedly not in compliance with this Act.\n\nSection 20 applies in respect of solicitation documents referred to in this\n(3)\nsection, with such modifications and adaptations as may be necessary, as that\n\n\f52\n\nsection  applies  in  respect  of  solicitation  documents  referred  to  in  that  section\nexcept that any role to be performed by a tenders committee or a chairman of a\ntenders committee pursuant to that section shall be performed by the procuring\nentity in respect of a request for quotations.\n\nMeetings with suppliers and presentation of quotations\n\nSections 22, 23 and 24 apply to the presentation of quotations and any\n44.(1)\nmeetings  with  suppliers  prior  to  the  presentation  of  quotations,  with  such\nmodifications and adaptations as may be necessary, as those sections apply to the\npresentation of tenders and meetings with suppliers prior to the presentation of\ntenders.\n\n(2)\n\nNotwithstanding subsection (1),\n\n(a)\n\n(b)\n\nno public opening of quotations is required but all quotations shall be\nopened  and  recorded  by  a  procuring  entity  immediately  after  the\ndeadline for presenting quotations; and\n\nany role to be performed by a tenders committee or a chairman of a\ntenders committee pursuant to sections 23 and 24 shall be performed\nby the procuring entity in respect of quotations.\n\nNegotiations on quotations prohibited\n\n45.\nsupplier with respect to a quotation presented by the supplier.\n\nNo  negotiations  shall  take  place  between  a  procuring  entity  and  a\n\nEvaluation of quotations, determination of successful quotations,\nprocurement contracts, supplier performance and cancellation of\nprocurement\n\nSections 28, 29, 30, 32, 35, 37, 38, 39, 40 and 41 apply to procurement\n46.\nby means of a request for quotations, with such modifications and adaptations as\nmay  be  necessary,  as  those  sections  apply  to  procurement  by  means  of  open\ntendering  except  that  any  role  to  be  performed  by  a  tenders  committee  or  a\n\n\f53\n\nchairman of a tenders committee pursuant to those sections shall be performed\nby the procuring entity in respect of quotations.\n\nSingle-Source Procurement\n\nCriteria for single-source procurement\n\n47.(1)\nengage in single-source procurement where\n\nSubject to subsection (2) and section 48(1), a procuring entity may\n\n(a)\n\n(b)\n\nthe goods or services are available only from a particular supplier or a\nparticular  supplier  has  exclusive  rights  in  respect  of  the  goods  or\nservices, so that no reasonable alternative or substitute exists, and the\nuse  of  any  other  method  of  procurement  would  therefore  not  be\npossible;\n\nthe  entity,  having  procured  goods  or  services  from  a  supplier,\ndetermines that additional goods or services must be procured from the\nsupplier  for  reasons  of  standardisation  or  because  of  the  need  for\ncompatibility with existing goods or services, taking into account\n\n(i)\n\n(ii)\n\nthe effectiveness of the original procurement in meeting the needs\nof the entity;\n\nthe limited size of the proposed procurement in relation to the\noriginal procurement;\n\n(iii)\n\nthe reasonableness of the price; and\n\n(iv)\n\nthe unsuitability of alternatives to the goods or services;\n\n(c)\n\nowing to a catastrophic event, there is an extremely urgent need for the\ngoods,  works  or  services  and  engaging  in  any  other  method  of\nprocurement  would  be  impractical  because  of  the  time  involved  in\nusing the method; or\n\n\f54\n\n(d)\n\nthe  entity  determines,  in  the  interest  of  national  security  or  public\nhealth,  that  the  use  of  any  other  method  of  procurement  is  not\nappropriate.\n\n(2)\nWhere a procuring entity engages in single-source procurement for reasons\nof  urgency  in  accordance  with  subsection  (1)(c),  the  entity  shall  limit  the\nprocurement contract to the quantity of goods or services or the extent of works\nrequired to deal with the catastrophic event.\n\nPermission to engage in single-source procurement\n\n48.(1)\nprocurement\n\nA  procuring  entity  shall,  before  engaging\n\nin  single-source\n\n(a)\n\nconfirm, where relevant, that the goods or services are not available\nunder arrangements for the procurement of common items; and\n\n(b)\n\nseek the approval of\n\n(i)\n\n(ii)\n\nthe  Director,  where  the  estimated  value  of  the  procurement\ncontract exceeds the relevant threshold specified in section 16(1)\n(a); or\n\nthe Chief Procurement Officer, where the estimated value of the\nprocurement contract exceeds $50 000 but does not exceed the\nrelevant threshold specified in section 16(1)(a).\n\nA procuring entity shall, in the case set out in subsection (1)(b)(i), submit\n(2)\na  request  for  permission  to  engage  in  single-source  procurement  to  the  Chief\nProcurement Officer for submission to the Director; and the Director may, on the\nadvice of the Chief Procurement Officer, grant permission to the entity to engage\nin single-source procurement where any of the circumstances set out in section\n47(1) exists.\n\nThe Chief Procurement Officer may, in the case set out in subsection (1)(b)\n(3)\n(ii), grant permission to a procuring entity to engage in single-source procurement\nwhere any of the circumstances set out in section 47(1) exists.\n\n\f55\n\nSolicitation documents for single-source procurement\n\n49.(1)\nA procuring entity shall, in order to solicit a proposal or price quotation\npursuant to single-source procurement, prepare and issue a solicitation document\nin the form of the standard document, if any, issued or approved by the Director\nfor the purpose.\n\n(2)\n\nThe solicitation document shall include\n\n(a)\n\n(b)\n\na description of the subject matter of the procurement in the form of a\nstatement of requirements; and\n\nthe  principal  terms  and  conditions  and  proposed  form  of  the\nprocurement contract.\n\nNotwithstanding  subsection  (1),  where  a  procuring  entity  undertakes\n(3)\nsingle-source procurement on the ground set out in section 47(1)(c), the entity\nmay engage in negotiations with a supplier without the issue of a solicitation\ndocument.\n\nEvaluation of single-source submission\n\n50.(1)\nsource procurement, the submission shall be evaluated to determine whether\n\nWhere a procuring entity receives a submission pursuant to single-\n\n(a)\n\nthe submission\n\n(i)\n\n(ii)\n\nmeets  the  requirements  of  the  entity,  including  any  technical\nneeds,  as  defined  by  the  statement  of  requirements,  and  any\nrequirement for urgent delivery or completion;\n\noffers value for money, based on prices previously obtained for\nsimilar procurement contracts or on an analysis of the cost of each\ncomponent, taking into account the circumstances and value of the\nprocurement contract;\n\n\f56\n\n(b)\n\nthe supplier accepts the contractual terms and conditions proposed by\nthe entity or offers other terms and conditions which are acceptable to\nthe entity; and\n\n(c)\n\nnegotiations with the supplier are necessary.\n\nSection  28(1)  to  (5)  apply  to  single-source  procurement,  with  such\n(2)\nmodifications and adaptations as may be necessary, as those provisions apply to\nprocurement by means of open tendering.\n\nNegotiations for single-source procurement\n\nWhere negotiations with a supplier are necessary in relation to single-\n51.(1)\nsource procurement, a procuring entity shall prepare a plan for the negotiations.\n\nThe  plan  shall  specify  the  issues  to  be  negotiated  and  objectives  to  be\n(2)\nachieved  and  shall,  to  the  extent  possible,  quantify  the  objectives  and  set\nmaximum and minimum negotiation parameters.\n\n(3)\n\nA procuring entity shall\n\n(a)\n\n(b)\n\nprepare minutes of any negotiations held; and\n\nobtain the written agreement of the supplier that the minutes are a true\nand accurate record of the negotiations.\n\nA procuring entity shall not commit itself to a proposed agreement arising\n(4)\nout  of  negotiations  unless  the  entity  obtains  the  approval  of  the  person  who,\npursuant to section 48, granted the entity permission to engage in single-source\nprocurement.\n\nProcurement contracts, supplier performance and cancellation in\nrelation to single-source procurement\n\n52.\nSections  37(1),  38(3),  39,  40  and  41  apply  to  single-source\nprocurement, with such modifications and adaptations as may be necessary, as\nthose sections apply to procurement by means of open tendering except that any\nrole  to  be  performed  by  a  tenders  committee  pursuant  to  section  41  shall  be\n\n\f57\n\nperformed by the person who, pursuant to section 48, granted the procuring entity\npermission to engage in single-source procurement.\n\nFramework Agreements\n\nFramework agreements\n\nA  procuring  entity  may  engage  in  procurement  through  such\n53.(1)\nframework  agreements,  whether  open  or  closed  and  whether  in  respect  of\ncommon items or otherwise, as are executed by the Chief Procurement Officer.\n\nThe Chief Procurement Officer shall, upon the execution of a framework\n(2)\nagreement, publish a notice of the agreement, specifying whether the agreement\nis an open framework agreement or a closed framework agreement, the names\nof the suppliers involved and the goods or services to be supplied.\n\nThe  Chief  Procurement  Officer  shall,  at  least  twice  yearly,  publish  a\n\n(3)\ncumulative list of all framework agreements awarded in the year.\n\nProcurement of Services of Individual Consultants\n\nProcurement of services of individual consultants\n\n54.\nNotwithstanding  section  16(1)  and  (2),  where  a  procuring  entity\nintends to procure the services of an individual consultant, the entity shall do so\nin accordance sections 55 to 59.\n\nSolicitation in relation to individual consultants\n\nA  procuring  entity  shall,  in  order  to  procure  the  services  of  an\n55.(1)\nindividual consultant, publish a notice inviting consultants to express interest in\nthe assignment.\n\n(2)\n\nThe notice shall include\n\n(a)\n\n(b)\n\nthe principal terms and conditions of the procurement contract;\n\nany key technical, eligibility or qualification requirements; and\n\n\f58\n\n(c)\n\nthe procedure, place and deadline for expressing interest.\n\nNotwithstanding  subsection  (1),  a  procuring  entity  need  not  publish  a\n\n(3)\nnotice where\n\n(a)\n\nthere is an urgent need for the services to be procured and\n\n(i)\n\nthe  circumstances  giving  rise  to  the  urgency  were  neither\nforeseeable by the entity nor the result of dilatory conduct on the\npart of the entity; and\n\n(ii)\n\npublication would be impractical;\n\n(b)\n\nthe services required are a continuation of services already provided\nby  a  consultant  and  the  entity  determines  that  the  services  must  be\nprocured from the same consultant for reasons of continuity, use of\nexperience acquired or continued professional liability; or\n\n(c)\n\nthe  entity  determines,  in  the  interest  of  national  security  or  public\nhealth, that publication is not appropriate.\n\nA procuring entity may, where it does not publish a notice referred to in\n(4)\nsubsection  (1),  directly  invite  at  least  3  consultants  to  express  interest  in  the\nassignment.\n\nSolicitation document not required in respect of individual consultants\n\n56.(1)\nA procuring entity is not required to prepare a solicitation document\nfor the procurement of the services of an individual consultant but shall make the\nterms of reference for the assignment available to all interested consultants on\nrequest or to all consultants invited to express interest.\n\nTerms  of  reference  shall  clearly  state  the  skills,  qualifications  and\n\n(2)\nexperience required and the basis for evaluation.\n\nNo tender security shall be requested for the procurement of the services\n\n(3)\nof an individual consultant.\n\n\f59\n\nPresentation of submissions by individual consultants and evaluation\nof submissions\n\n57.(1)\nA  submission  from  an  individual  consultant  shall  include  his\ncurriculum vitae and a proposed fee rate which may be requested as separately\nsealed technical and financial submissions, respectively.\n\n(2)\n\nEvaluation of submissions from individual consultants\n\n(a)\n\nshall  be  based  on  the  skills,  qualifications  and  experience  of  the\nconsultants, as stated in the terms of reference;\n\n(b)\n\nmay take into account references;\n\n(c)\n\n(d)\n\nmay include interviews to assess further the skills, qualifications and\nexperience of the consultants; and\n\nshall  rank  consultants  according  to  their  skills,  qualifications  and\nexperience.\n\nSection  28(1)  to  (5)  apply  to  the  procurement  of  the  services  of  an\n(3)\nindividual  consultant,  with  such  modifications  and  adaptations  as  may  be\nnecessary, as those provisions apply to procurement by means of open tendering.\n\nNegotiations with individual consultants\n\nA procuring entity may negotiate fees and the terms and conditions of\n58.\nthe procurement contract with the consultant ranked first in the evaluation and,\nwhere negotiations fail, may negotiate with the consultant ranked next after him.\n\nProcurement contracts, supplier performance and cancellation in\nrelation to services of individual consultants\n\nSections 37, 38, 39, 40 and 41 apply to procurement of the services of\n59.\nindividual  consultants,  with  such  modifications  and  adaptations  as  may  be\nnecessary, as those sections apply to procurement by means of open tendering\nexcept that any role to be performed by a tenders committee pursuant to section\n41 shall be performed by the procuring entity.\n\n\f60\n\nPART V\n\nGENERAL RULES REGARDING PROCUREMENT\n\nDescription of subject matter of procurement\n\nA procuring entity shall set out in the pre-qualification document, if\n60.(1)\nany, and in the solicitation document, a description of the subject matter of the\nprocurement in the form of a statement of requirements.\n\n(2)\n\nThe statement of requirements\n\n(a)\n\nshall\n\n(i)\n\ninclude the minimum requirements that submissions must meet\nin order to be considered responsive and the manner in which the\nminimum requirements are to be applied;\n\n(ii)\n\nset  out  the  relevant  technical,  quality  and  performance\ncharacteristics of the subject matter of the procurement; and\n\n(iii)\n\nto the extent practicable, be objective, functional and generic;\n\n(b)\n\n(c)\n\nmay include specifications, plans, drawings, designs, testing and test\nmethods, packaging, marking, labelling, conformity certification and\nsymbols and terminology; and\n\nshall  not  include  a  requirement  for,  or  reference  to,  a  particular\ntrademark  or  trade  name,  patent,  design  or  type,  specific  origin  or\nproducer unless there is no other sufficiently precise or intelligible way\nof  describing  the  characteristics  of  the  subject  matter  of  the\nprocurement,  and  provided  that  words  such  as  “or  equivalent”  are\nincluded.\n\n\f61\n\nStandardisation of trade terms and conditions etc.\n\n61.\n\nA procuring entity shall, in formulating\n\n(a)\n\n(b)\n\nthe terms and conditions of a procurement and procurement contract\nand other relevant aspects of a pre-qualification document, if any, and\na solicitation document, use standardised trade terms and standardised\nconditions, where available; and\n\nthe description of the subject matter of the procurement to be included\nin  the  pre-qualification  document,  if  any,  and  in  the  solicitation\ndocument,  use  standardised  features,  requirements,  symbols  and\nterminology  relating  to  the  technical,  quality  and  performance\ncharacteristics of the goods, works or services to be procured, where\navailable.\n\nPublication of notices\n\n62.(1)\n\nA notice to be published pursuant to this Act\n\n(a)\n\nshall be published\n\n(i)\n\n(ii)\n\nat least once in one daily newspaper with nationwide circulation\nin Barbados; and\n\non  such  government  websites  as  the  entity  may  consider\nappropriate; and\n\n(b)\n\nmay, notwithstanding a requirement for the notice to be published in a\nparticular manner and place, be also published in such media as the\nentity may consider appropriate.\n\nWhere foreign participation is required for sufficient competition or where\n\n(2)\nso required by an international agreement, the notice shall also be published\n\n(a)\n\n(b)\n\nin media of wide regional or international circulation;\n\non widely read internet sites; or\n\n\f62\n\n(c)\n\nin such publication as may be required by the agreement.\n\n(3)\nWhere  a  procuring  entity  believes  that  it  is  necessary  to  ensure  wide\ncompetition, the entity may, in addition to the publication required by subsections\n(1) and (2), after the date of publication of an invitation to tender, send a copy of\nthe notice directly to\n\n(a)\n\nsuppliers who are registered in the Suppliers Register, past suppliers\nor any other identified, potential suppliers;\n\n(b)\n\nprofessional or industry associations; and\n\n(c)\n\nembassies of Barbados in countries, suppliers from which are likely to\nparticipate or foreign embassies of such countries in Barbados or both.\n\nCorrections to published information\n\nWhere  information  published  by  a  procuring  entity  to  invite  the\n63.\nparticipation of suppliers in pre-qualification or other procurement proceedings\nis discovered to be, or becomes, materially inaccurate for any reason, the entity\nshall correct the information and publish the corrected information in the same\nmanner and place in which the original information was published.\n\nCommunications\n\n64.(1)\nAny  document,  notification,  decision  or  any  other  information\ngenerated in the course of a procurement and communicated, including anything\ncommunicated  in  connection  with  proceedings  for  an  application  for\nreconsideration under section 76 or an appeal to the Tribunal or in the course of\na  meeting  or  forming  part  of  the  procurement  record,  shall  be  in  a  form  that\nprovides a record of the content of the information and that is accessible so as to\nbe usable for subsequent reference.\n\nDirect  solicitation  and  any  communication  of  information  between\n(2)\nsuppliers and a procuring entity referred to in section 26(2) and (3), 30(1) and\n(2) or 71(1)(a) may be made by means that do not provide a record of the content\n\n\f63\n\nof the information on the condition that, immediately thereafter, confirmation of\nthe communication is given to the recipient of the communication in a form that\n\n(a)\n\n(b)\n\nprovides a record of the content of the information; and\n\nis accessible so as to be usable for subsequent reference.\n\n(3)\n\nAll documents and communications shall be in English.\n\nA procuring entity shall, where it first solicits the participation of suppliers\n\n(4)\nin particular procurement proceedings, specify\n\n(a)\n\nthe means to be used to\n\n(i)\n\ncommunicate  information  by  or  on  behalf  of  the  entity  to  a\nsupplier or to the public or by a supplier to the entity or to another\nperson acting on behalf of the entity;\n\n(ii)\n\nsatisfy any requirement for information to be in writing or for a\nsignature; and\n\n(iii)\n\nhold any meeting of suppliers; and\n\n(b)\n\nin relation to any procurement involving information that a procuring\nentity considers to be secret, where the entity considers it necessary,\nany measures and requirements needed to ensure that the information\nis kept confidential.\n\nA procuring entity may use only those means of communication that are\n\n(5)\nin common use by suppliers in the context of the particular procurement.\n\nIn any meeting held with suppliers, a procuring entity shall use only those\n(6)\nmeans that ensure that suppliers can fully and contemporaneously participate in\nthe meeting.\n\nA  procuring  entity  shall  implement  appropriate  measures  to  secure  the\n(7)\nauthenticity, integrity and confidentiality of information concerning procurement\nproceedings.\n\n\f64\n\n(8)\nWhere a procuring entity requires the approval or permission of a tenders\ncommittee,  a  chairman  of  a  tenders  committee,  the  Director,  the  Chief\nProcurement Officer or any other person in order to make a determination or\npursue a course of action, the entity shall not, unless the approval or permission\nis granted, communicate the determination or the decision to pursue the course\nof action to any supplier or to the public at large.\n\n(9)\nIn this section, “direct solicitation” means solicitation addressed directly\nto one supplier or a restricted number of suppliers but does not include solicitation\naddressed  to  a  limited  number  of  suppliers  following  pre-qualification\nproceedings.\n\nPART VI\n\nREGISTRATION, ELIGIBILITY AND QUALIFICATION\n\nSuppliers Register\n\n65.(1)\nto be called the Suppliers Register.\n\nThe Chief Procurement Officer shall establish and maintain a register\n\n(2)\n\nThe Suppliers Register shall\n\n(a)\n\ninclude in respect of every supplier registered pursuant to section 66\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\nthe name, address and other contact information of the supplier;\n\nthe unique registration number assigned to the supplier pursuant\nto section 66(4);\n\nthe date of registration;\n\nany documentary evidence regarding the legal capacity of the\nsupplier to enter into a procurement contract;\n\nany  other  information  available  as  to  the  eligibility  of  the\nsupplier to participate in public procurement;\n\n\f65\n\n(vi)\n\n(vii)\n\na statement as to whether the supplier is registered as a supplier\nof goods, services or works or a combination of the three;\n\nany information available as to the qualifications of the supplier\nto supply the goods, services or works he proposes to supply;\n\n(viii)\n\na record of the current and past procurement contracts of the\nsupplier, if any, and of his performance under the contracts; and\n\n(ix)\n\nsuch other information as the Chief Procurement Officer may\nconsider appropriate; and\n\n(b)\n\nbe reviewed and updated at least once every 6 months.\n\nThe  Chief  Procurement  Officer  shall,  at  least  once  every  6  months,\n\n(3)\npublicise the existence of the Suppliers Register and publish\n\n(a)\n\n(b)\n\n(c)\n\nthe procedure for applying for registration;\n\nthe criteria to be satisfied for entry in the register and the documentary\nevidence to be submitted; and\n\nthe  period  for  which  registration  is  valid  and  any  requirement  for\nupdating an entry in the register or for renewing registration.\n\nThe entry of the name of a supplier in the Suppliers Register shall not be\n(4)\nconstrued  as  an  indication  that  the  supplier  is  suitable  to  participate  in  any\nparticular procurement.\n\nSuppliers to be registered\n\n66.(1)\nsupplier unless the supplier is registered under this section.\n\nA procuring entity shall not enter into a procurement contract with a\n\nA person may, in such form as the Chief Procurement Officer may require,\n\n(2)\napply to the Chief Procurement Officer for registration as a supplier.\n\n\f66\n\nThe  Chief  Procurement  Officer  shall,  within  30  days  of  receipt  of  an\n\n(3)\napplication for registration, notify the supplier in writing of\n\n(a)\n\nthe approval of his application and the inclusion of his name in the\nSuppliers Register; or\n\n(b)\n\nthe rejection of his application and the reason for the rejection.\n\nThe Chief Procurement Officer shall issue a unique registration number to\n\n(4)\nevery supplier who is registered.\n\nRegistration under this section is valid for 3 years and may be renewed,\n(5)\nupon application to the Chief Procurement Officer, for further periods of 3 years.\n\nThe  Chief  Procurement  Officer  shall,  within  20  days  of  receipt  of  an\n\n(6)\napplication for renewal of registration, notify the supplier in writing of\n\n(a)\n\n(b)\n\nthe renewal of his registration; or\n\nthe rejection of his application and the reason for the rejection.\n\nThe Chief Procurement Officer may refuse to register a supplier or to renew\n(7)\nthe  registration  of  a  supplier  where  the  supplier  is  or  becomes  ineligible  to\nparticipate in public procurement.\n\nThe Chief Procurement Officer shall not refuse to register a supplier or to\n(8)\nrenew  the  registration  of  a  supplier  unless  he  gives  the  supplier  a  reasonable\nopportunity to be heard on why registration or renewal of registration should not\nbe refused.\n\nChanges affecting registration\n\n67.(1)\nWhere a material change in the circumstances of a supplier renders\nthe information submitted to the Chief Procurement Officer for the purpose of\nregistration in the Suppliers Register misleading, inaccurate or incomplete, the\nsupplier  shall,  as  soon  as  practicable  and  in  any  event  within  14  days  of  the\nchange, notify the Chief Procurement Officer in writing of the change.\n\n\f67\n\n(2)\nIn subsection (1), “material change” includes a change that would render\na supplier ineligible to participate in public procurement and a change of the name\nunder which, or the address at which, the supplier conducts business.\n\n(3)\n\nThe Chief Procurement Officer shall\n\n(a)\n\n(b)\n\nupon receipt of a notification pursuant to subsection (1); or\n\nwhere he is otherwise satisfied that any information in the Suppliers\nRegister is misleading, inaccurate or incomplete,\n\nmake such alteration to the register as may be necessary to ensure that the register\nis not misleading and that it is accurate and complete.\n\nThe Chief Procurement Officer shall, before making an alteration to the\n(4)\nSuppliers Register pursuant to subsection (3)(b), notify the supplier involved of\nhis intention to make the alteration.\n\nThe Chief Procurement Officer shall promptly notify in writing a supplier\n(5)\nin respect of whom an alteration is made under subsection (3), of the fact of the\nalteration and the nature of it.\n\nEligibility of suppliers to participate in public procurement\n\n68.(1)\n\nA supplier is eligible to participate in public procurement where\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nhe has the legal capacity to enter into a procurement contract;\n\nhe is not insolvent, in receivership, bankrupt or being wound up;\n\nhis affairs are not being administered by a person appointed by a court;\nand\n\nhe is not the subject of legal proceedings for any of the matters referred\nto in paragraph(b)or(c).\n\nA supplier is ineligible to participate in public procurement where he, or\n(2)\nin the case of a supplier that is a body corporate, any of its directors or officers,\n\n\f68\n\nwithin a period of 5 years prior to his application for registration or the initiation\nof procurement proceedings, as the case may be\n\n(a)\n\n(b)\n\n(c)\n\nknowingly or recklessly provided false information in a submission or\nany other document submitted to a procuring entity in connection with\nprocurement proceedings or a procurement contract;\n\ninterfered  with  the  participation  of  other  suppliers  in  public\nprocurement;\n\nengaged  in  misconduct  in  relation  to  procurement  proceedings  or  a\nprocurement contract including\n\n(i)\n\ncorrupt practices;\n\n(ii)\n\nfraudulent practices,\n\n(iii)\n\ncollusive practices;\n\n(iv)\n\ncoercive practices;\n\n(v)\n\nknowingly underpricing submissions; and\n\n(vi)\n\nbreaches of confidentiality;\n\n(d)\n\ndid  not  perform  substantially,  contractual  obligations  under  a\nprocurement  contract,  where  the  non-performance  was  not  due  to\ncircumstances beyond his control;\n\n(e)\n\nrefused  to  furnish  a  security  for  the  performance  of  a  procurement\ncontract in accordance with the terms of the solicitation document;\n\n(f)\n\nwas convicted of an offence under this Act or related to\n\n(i)\n\nobtaining a procurement contract or sub-contract; or\n\n(ii)\n\ndishonesty or professional activities;\n\n(g)\n\n(h)\n\nwas suspended, disbarred or disqualified by any professional body; or\n\nwas suspended or prohibited from participating in procurement by an\ninternational organisation or a foreign government, provided that the\n\n\f69\n\nChief  Procurement  Officer  verified  that  the  proceedings  of  the\ninternational  organisation  or  foreign  government  that  led  to  the\nsuspension or prohibition\n\n(i)\n\n(ii)\n\nwere based on a fair, independent review of the facts of the case;\nand\n\nprovided  the  supplier  with  the  opportunity  to  be  heard  in  his\ndefence and to appeal to an independent body against the original\ndecision.\n\nA foreign supplier shall be permitted to submit, as documentary evidence\n\n(3)\nof eligibility to participate in public procurement\n\n(a)\n\n(b)\n\ncertified copies of equivalent documents from the relevant authority of\nthe  country  in  which  the  supplier  is  incorporated  or  otherwise\norganised; or\n\nan official statement certifying that equivalent documentation is not\nissued in the country in which the supplier is incorporated or otherwise\norganised.\n\nThe Director may, upon the recommendation of the Chief Procurement\n(4)\nOfficer, determine in accordance with this section that a supplier is ineligible to\nparticipate in public procurement but such a decision shall not be made unless\n\n(a)\n\n(b)\n\nthe Chief Procurement Officer conducts a thorough investigation of the\nfacts of the case; and\n\nthe supplier receives reasonable notice, in writing, of the grounds for\nthe decision and the details of the grounds, and is given a reasonable\nopportunity to be heard on the matter.\n\nA decision that a supplier is ineligible to participate in public procurement\n(5)\nand  the  reason  for  the  decision  shall  be  promptly  communicated  to  the\nsupplier.\n\n\f70\n\nExclusion of supplier from particular procurement proceedings\n\n69.(1)\nA procuring entity shall, with the approval of the Director upon the\nrecommendation  of  the  Chief  Procurement  Officer,  exclude  a  supplier  from\nparticipation in procurement proceedings where the supplier\n\n(a)\n\nhas  a  conflict  of  interest  that  is  likely  to  impair  the  integrity  of  the\nprocurement proceedings; or\n\n(b)\n\nis or becomes ineligible to participate in public procurement.\n\nA  supplier  shall  not  be  excluded  from  participation  in  procurement\n\n(2)\nproceedings unless\n\n(a)\n\n(b)\n\nthe Chief Procurement Officer conducts a thorough investigation of the\nfacts of the case; and\n\nthe supplier receives reasonable notice, in writing, of the grounds for\nthe proposed exclusion and the details of the grounds, and is given a\nreasonable opportunity to be heard on why he should not be excluded.\n\nA  decision  to  exclude  a  supplier  from  participation  in  procurement\n(3)\nproceedings and the reason for the exclusion shall be promptly communicated to\nthe supplier.\n\nRemoval from Suppliers Register\n\n70.(1)\nThe  Chief  Procurement  Officer  may  remove  from  the  Suppliers\nRegister, the name of a supplier who becomes ineligible to participate in public\nprocurement.\n\nThe Chief Procurement Officer shall not remove the name of a supplier\n(2)\nfrom the Suppliers Register pursuant to subsection (1) unless he gives the supplier\na reasonable opportunity to be heard on why his name should not be removed\nfrom the register.\n\n\f71\n\n(3)\nThe Chief Procurement Officer shall promptly notify in writing a supplier\nwhose name has been removed from the Suppliers Register of the fact of the\nremoval and the reason for it.\n\nQualifications of suppliers\n\n71.(1)\nincluding through pre-qualification proceedings, require a supplier to\n\nA  procuring  entity  may,  at  any  stage  of  procurement  proceedings,\n\n(a)\n\n(b)\n\nmeet such qualification criteria as the entity considers appropriate in\nthe circumstances; and\n\ndemonstrate  that  he  has  the  capability  and  resources  to  perform  the\nprocurement contract effectively.\n\n(2)\n\nQualification criteria may include\n\n(a)\n\n(b)\n\n(c)\n\nprofessional, technical and environmental qualifications;\n\nprofessional and technical competence;\n\nfinancial resources and equipment and other physical facilities;\n\n(d)\n\nmanagerial capability, reliability and experience; and\n\n(e)\n\na sufficient number of personnel capable of discharging the obligations\nof the supplier under the procurement contract.\n\nA procuring entity may, at any stage of procurement proceedings, verify\n\n(3)\nthe qualifications of a supplier.\n\n(4)\n\nA procuring entity shall\n\n(a)\n\n(b)\n\nimpose  on  or  apply  to  a  supplier,  whether  in  pre-qualification\nproceedings or otherwise, no qualification criterion other than that set\nout  in  the  pre-qualification  notice  or  document,  if  any,  or  in  the\nsolicitation document;\n\nin  determining  whether  to  qualify  a  supplier,  apply  qualification\ncriteria equally to all suppliers and evaluate the qualifications of each\nsupplier in accordance with such criteria;\n\n\f72\n\n(c)\n\nestablish  no  qualification  criterion,  requirement  or  procedure  that\ndiscriminates  against  or  among  suppliers  or  categories  of  suppliers\nunless the criterion is objectively justifiable.\n\nWhere a procuring entity assesses the qualifications of suppliers, the entity\n\n(5)\nshall\n\n(a)\n\npromptly notify each supplier in writing of whether or not he qualified,\nand where the supplier did not qualify, inform the supplier, upon his\nrequest, of the reasons that he did not qualify; and\n\n(b)\n\nsupply to any person upon his request, the names of the suppliers who\nqualified.\n\nPre-qualification of suppliers\n\nA  procuring  entity  may  engage  in  pre-qualification  proceedings  in\n72.(1)\norder  to  identify,  prior  to  solicitation,  suppliers  who  are  qualified  to  present\nsubmissions.\n\nA  procuring  entity  shall,  in  particular,  consider  engaging  in  pre-\n\n(2)\nqualification proceedings where\n\n(a)\n\n(b)\n\n(c)\n\nthe subject matter of the procurement is highly complex or specialised\nor requires detailed design or methodology;\n\nthe  cost  of  preparing  a  detailed  submission  would  discourage\ncompetition; or\n\nthe  evaluation  of  a  submission  would  necessarily  be  particularly\ndetailed and the evaluation of a large number of submissions would\ntherefore require excessive time and resources from the entity.\n\nWhere a procuring entity desires to have suppliers pre-qualify, the entity\n(3)\nshall publish a notice, to be called a pre-qualification notice, inviting suppliers\nto submit applications to pre-qualify.\n\n\f(4)\n\nThe pre-qualification notice shall include\n\n73\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe principal terms and conditions of the procurement contract;\n\nwhether  a  pre-qualification  document  is  to  be  issued  or  whether\napplications to pre-qualify should be submitted to the entity;\n\nwhere no pre-qualification document is to be issued, the qualification\ncriteria and the procedures to be used for ascertaining the qualifications\nof suppliers;\n\nwhether tenders are to be solicited from all pre-qualified suppliers or\nonly from a limited number of suppliers who best meet the qualification\ncriteria;\n\nwhere  tenders  are  to  be  solicited  only  from  a  limited  number  of\nsuppliers, the maximum number of pre-qualified suppliers from whom\ntenders are to be solicited and the manner in which that number is to\nbe selected; and\n\n(f)\n\nthe procedure, place and deadline for submitting applications to pre-\nqualify.\n\n(5)\n\nWhere a pre-qualification document is to be issued, the entity shall\n\n(a)\n\nprepare the document in the form of the standard document, if any,\nissued or approved by the Director for the purpose;\n\n(b)\n\ninclude in the document\n\n(i)\n\n(ii)\n\ninstructions  for  preparing  and  submitting  applications  to  pre-\nqualify; and\n\na  clear  statement  of  the  qualification  criteria  and  of  any\ndocumentary evidence or information required to be submitted to\ndemonstrate,  and  the  procedures  to  be  used  to  ascertain,  the\nqualifications of suppliers; and\n\n(c)\n\nsupply the document to any supplier who requests it.\n\n\f74\n\n(6)\nWhere a procuring entity engages in pre-qualification proceedings, only\nsuppliers that the entity has pre-qualified are entitled to participate further in the\nprocurement proceedings.\n\nClarification of pre-qualification notices and documents\n\nWhere a procuring entity receives, within a reasonable time prior to\n73.(1)\nthe deadline for the submission of applications to pre-qualify, a request from a\nsupplier  for  clarification  of  a  pre-qualification  notice  or  a  pre-qualification\ndocument, the entity shall\n\n(a)\n\n(b)\n\nprovide the clarification to the supplier; and\n\nwithout identifying the source of the request, in the case of\n\n(i)\n\na pre-qualification notice, publish the clarification; or\n\n(ii)\n\na pre-qualification document, communicate the clarification to all\nother suppliers to whom the entity provided the document.\n\nA procuring entity shall provide a clarification referred to in subsection\n(2)\n(1), whether by publication or otherwise, to all suppliers at the same time and\nwithin sufficient time to enable them to present their applications to pre-qualify\nbefore the deadline for submission.\n\nA procuring entity may, prior to the deadline for submitting applications\n(3)\nto pre-qualify, and, where required pursuant to section 7, with the approval of\nthe relevant tenders committee, whether on its own initiative or as a result of a\nrequest for clarification by a supplier, modify a pre-qualification notice or a pre-\nqualification document by issuing an addendum.\n\n(4)\n\nThe addendum shall\n\n(a)\n\nin the case of\n\n(i)\n\na pre-qualification notice, be published promptly; and\n\n\f75\n\n(ii)\n\na pre-qualification document, be communicated promptly to the\nsuppliers  to  whom  the  entity  provided  the  pre-qualification\ndocument; and\n\n(b)\n\nbe binding on the suppliers.\n\nWhere a procuring entity issues a clarification or modification of a pre-\n(5)\nqualification notice or a pre-qualification document, the entity shall, prior to the\ndeadline  for  presenting  applications  to  pre-qualify,  extend,  or  where  required\npursuant  to  section  7,  request  the  relevant  tenders  committee  to  extend  the\ndeadline where necessary in order to afford suppliers sufficient time to take the\nclarification or modification into account in preparing their applications.\n\nThe procuring entity, or where required pursuant to section 7, the relevant\n(6)\ntenders  committee  may,  in  its  absolute  discretion,  prior  to  a  deadline  for\npresenting applications to pre-qualify, extend the deadline where it is not possible\nfor one or more suppliers to present their applications by the deadline because of\nany circumstance beyond their control.\n\n(7)\n\nNotice of an extension of a deadline shall\n\n(a)\n\n(b)\n\nin the case of a pre-qualification notice, be published; and\n\nin the case of a pre-qualification document, be given to all suppliers to\nwhom the entity provided the document.\n\nThe functions of a tenders committee under this section shall be discharged\n\n(8)\nby the chairman of the committee.\n\n\f76\n\nPART VII\n\nCHALLENGE PROCEEDINGS\n\nAppeals to Tribunal in respect of registration, exclusion etc.\n\n74.\nTribunal against a decision\n\nA supplier may, upon payment of the prescribed fee, appeal to the\n\n(a)\n\n(b)\n\n(c)\n\nto refuse to register him or renew his registration;\n\nthat he is ineligible to participate in public procurement;\n\nto exclude him from participation in public procurement; or\n\n(d)\n\nto remove his name from the Suppliers Register.\n\nProcedure for appeal\n\n75.(1)\n\nAn appeal under section 74 shall be\n\n(a)\n\n(b)\n\nin writing; and\n\nsubmitted  within  14  days  of  receipt  by  the  supplier  of  notice  of  a\ndecision referred to in that section.\n\nThe  Tribunal  shall,  within  15  days  of  receipt  of  the  appeal,  determine\n\n(2)\nwhether to entertain or dismiss the appeal.\n\n(3)\n\nThe Tribunal may dismiss an appeal where it determines that the appeal\n\n(a)\n\n(b)\n\nis manifestly without merit; or\n\nwas not submitted by the deadline set out in subsection (1)(b),\n\nand a dismissal constitutes a decision on the appeal.\n\n\f77\n\nReconsideration of decision or action by procuring entity or tenders\ncommittee\n\n76.(1)\nA supplier who participates in procurement proceedings and alleges\nthat he has suffered or is likely to suffer loss or injury because a decision or action\nof a procuring entity or tenders committee in relation to the proceedings does not\ncomply with this Act may, upon payment of such fee as may be prescribed, apply\nto the entity or committee to reconsider the decision or action.\n\n(2)\n\nAn application for reconsideration shall\n\n(a)\n\n(b)\n\nbe in writing;\n\ninclude particulars of the decision or action that the supplier alleges\ndoes not comply with this Act; and\n\n(c)\n\nwhere the application relates to\n\n(i)\n\n(ii)\n\nthe terms of solicitation or pre-qualification or a decision or action\ntaken in pre-qualification proceedings, be submitted prior to the\ndeadline for presenting submissions; or\n\nany other decision or action taken in the procurement proceedings,\nbe  submitted  within  the  standstill  period,  if  any,  or,  where  no\nstandstill period is applied, prior to the execution of\n\n(A)\n\nthe procurement contract; or\n\n(B)\n\nthe framework agreement, where a framework agreement is\ninvolved.\n\n(3)\n\nA procuring entity or tenders committee shall\n\n(a)\n\nwithin 5 days of receipt of an application for reconsideration\n\n(i)\n\npublish a notice of the application; and\n\n(ii)\n\nnotify  all  participants  in  the  procurement  proceedings  of  the\nsubmission of the application and its substance; and\n\n\f(b)\n\nwithin 10 days of publication of the notice\n\n78\n\n(i)\n\ndetermine  whether  to  entertain  or  dismiss  the  application  and,\nwhere  it  determines  to  entertain  the  application,  whether  to\nsuspend  the  procurement  proceedings  to  which  the  application\nrelates; and\n\n(ii)\n\nnotify the applicant and all other participants in the procurement\nproceedings of its decision to entertain or dismiss the application\nand where the application is\n\n(A)\n\nto be entertained, of whether the procurement proceedings\nare suspended and if so, the duration of the suspension or, if\nnot,  the  reason  for  the  decision  not  to  suspend  the\nproceedings; or\n\n(B)\n\ndismissed, the reason for the dismissal.\n\nA procuring entity or tenders committee may dismiss an application for\n\n(4)\nreconsideration where it determines that the application\n\n(a)\n\n(b)\n\nis manifestly without merit; or\n\nwas not submitted by the deadline set out in subsection (2)(c),\n\nand a dismissal constitutes a decision on the application.\n\nWhere a procuring entity or tenders committee determines to entertain an\n\n(5)\napplication for reconsideration, the entity or committee\n\n(a)\n\nmay overturn, correct, vary or uphold any decision or action it took in\nthe procurement proceedings to which the application relates or the\nentity may cancel the procurement; and\n\n(b)\n\nshall,  within  20  days  of  publication  of  the  notice  referred  to  in\nsubsection (3)(a),\n\n(i)\n\nissue its decision on the application; and\n\n\f79\n\n(ii)\n\ncommunicate its decision to the applicant, all other participants in\nthe proceedings for reconsideration and all other participants in\nthe procurement proceedings.\n\nA  procuring  entity  or  tenders  committee  shall  give  its  decision  and  the\n\n(6)\nreason for it, and state any action taken pursuant to it, in writing.\n\nAppeals to Tribunal in respect of reconsideration proceedings\n\n77.(1)\nA supplier who applies to a procuring entity or tenders committee for\nreconsideration of a decision or action may, upon payment of the prescribed fee,\nappeal to the Tribunal where\n\n(a)\n\nthe entity or committee does not\n\n(i)\n\n(ii)\n\ngive notice to him in accordance with section 76(3)(b)(ii) and (6);\nor\n\ncommunicate its decision to him in accordance with section 76(5)\nand (6); or\n\n(b)\n\nhe is dissatisfied with the decision of the entity or committee in respect\nof his application.\n\n(2)\n\nAn appeal to the Tribunal shall\n\n(a)\n\n(b)\n\nbe in writing; and\n\nwhere\n\n(i)\n\nit relates to a failure of a procuring entity or tenders committee to\n\n(A)\n\n(B)\n\ngive notice to a supplier in accordance with section 76(3)(b)\n(ii) and (6); or\n\ncommunicate its decision to a supplier in accordance with\nsection 76(5) and (6),\n\nbe submitted within 14 days after the notice should have been given or\nthe  decision  should  have  been  communicated  to  the  supplier  in\naccordance with section 76; or\n\n\f80\n\n(ii)\n\nit is against a decision of a procuring entity or tenders committee\nin  respect  of  an  application  for  reconsideration,  be  submitted\nwithin 14 days of the communication to the supplier of the decision\nof the entity or committee.\n\n(3)\n\nWhere a supplier appeals to the Tribunal\n\n(a)\n\n(b)\n\nthe authority of the procuring entity or tenders committee to entertain\nhis application ceases; and\n\nthe entity or committee shall, upon receipt from the Tribunal of notice\nof  the  appeal,  promptly  provide  the  Tribunal  with  all  documents\nrelating to the procurement proceedings.\n\n(4)\n\nThe Tribunal shall\n\n(a)\n\nwithin 5 days of receipt of an appeal, publish a notice of the appeal;\nand\n\n(b)\n\nwithin 10 days of publication of the notice,\n\n(i)\n\nunless it decides that urgent public interest considerations require\nthe procurement proceedings to continue, order the suspension of\nthe  proceedings  where  and  for  as  long  as  it  determines  that  a\nsuspension is necessary to protect the interests of the appellant;\nand\n\n(ii)\n\nnotify  the  procuring  entity,  the  tenders  committee  and  all\nparticipants in the procurement proceedings to which the appeal\nrelates of the appeal and its substance and its decision\n\n(A)\n\n(B)\n\nto  suspend  the  proceedings  and  the  duration  of  the\nsuspension; or\n\nnot  to  suspend  the  proceedings  and  the  reason  for  its\ndecision.\n\nThe Tribunal may order that any suspension imposed under subsection (4)\n\n(5)\nbe extended or lifted.\n\n\f81\n\nThe Tribunal may dismiss an appeal and order that any suspension imposed\n\n(6)\nbe lifted where it determines that the appeal\n\n(a)\n\n(b)\n\nis manifestly without merit; or\n\nwas not submitted by the deadline set out in subsection (2)(b),\n\nand a dismissal constitutes a decision on the appeal.\n\nThe Tribunal shall within 20 days of publication of the notice referred to\n\n(7)\nin subsection (4)(a)\n\n(a)\n\n(b)\n\nissue its decision on the appeal; and\n\ncommunicate  its  decision  to  the  appellant,  the  procuring  entity,  the\ntenders  committee  and  all  other  participants  in  the  procurement\nproceedings.\n\nHearing of appeal\n\nAn  appeal  to  the  Tribunal  shall  be  heard  and  determined  by  the\n78.(1)\nchairman and not less than 2 members of the Tribunal selected by the chairman,\nand the chairman and the members so selected shall have all the powers of the\nTribunal in relation to the appeal.\n\nIn the event of a difference of opinion among members sitting together,\n\n(2)\nthe opinion of the majority shall prevail.\n\nThe  Tribunal  may,  if  it  thinks  fit,  receive  oral  or  written  evidence,  and\n(3)\nunder  oath  or  otherwise,  but  it  is  not  bound  by  the  rules  of  evidence  in  the\nEvidence Act, Cap. 121 and it may take into account opinion evidence and such\nfacts as it considers relevant and material.\n\nThe Tribunal shall allow every party to an appeal to appear in person or\n(4)\nby representative, and, where the Tribunal receives oral evidence, to examine\nand cross-examine witnesses.\n\nNotwithstanding subsection (4), the Tribunal may proceed in the absence\n\n(5)\nof a party who has been given reasonable notice in writing to attend.\n\n\f82\n\n(6)\n\nThe Tribunal shall, subject to section 81, receive evidence in public.\n\n(7)\nThe Tribunal may issue summonses, make orders and give directions to\nsuch persons and in such manner as it thinks fit for the purpose of summoning\nwitnesses, requiring the disclosure of documents or other evidence and requiring\nparties  or  witnesses  to  answer  questions  and,  generally,  for  conducting  its\nproceedings in a proper and orderly manner.\n\nThe Tribunal may report to the High Court the conduct of any person who\n(8)\ndisobeys any subpoena, order or direction properly issued under subsection (7),\nor says or does any other thing that would, if the Tribunal were a superior court\nof law, be contempt of court.\n\nWhere a report is made under subsection (8), the High Court shall hear the\n(9)\ncomplaint and any defence, and may punish the person concerned in the same\nmanner as if the person were guilty of contempt of the High Court.\n\nDecisions by Tribunal\n\nIn taking its decision on an appeal that it has entertained, the Tribunal\n79.(1)\nmay review the whole case in respect of law and fact, and the exercise of any\ndiscretion, and shall determine the case in accordance with its own judgment.\n\n(2)\n\nWithout prejudice to the generality of subsection (1), the Tribunal may\n\n(a)\n\n(b)\n\n(c)\n\nconfirm a lawful decision;\n\nrevise an unlawful decision or substitute its own decision for such a\ndecision;\n\noverturn, wholly or in part, an unlawful act or decision, other than a\ndecision  that  results  in  the  execution  of  a  procurement  contract  or\nframework agreement;\n\n(d)\n\nprohibit any individual or entity from acting or deciding unlawfully or\nfrom following an unlawful procedure;\n\n\f83\n\n(e)\n\nrequire  any  individual  or  entity  that  has  acted  or  proceeded  in  an\nunlawful manner or that has reached an unlawful decision, to act or\nproceed in a lawful manner or reach a lawful decision;\n\n(f)\n\norder that procurement proceedings be terminated; or\n\n(g)\n\ndismiss the appeal.\n\nThe Tribunal shall give reasons for any decision it makes on a matter before\n(3)\nit, including a decision to dismiss a matter, and shall state the decision and the\nreasons for it, in writing.\n\nNothing  in  this  Part  shall  permit  the  Tribunal  to  interfere  with  a\n\n(4)\nprocurement contract or framework agreement that has been executed.\n\n(5)\n\nDecisions of the Tribunal shall be made available for public inspection.\n\nCosts\n\n80.\nsums in respect of the reasonable costs incurred in\n\nThe Tribunal shall not award costs to any party to an appeal other than\n\n(a)\n\nthe  preparation  of  the  submission  relating  to  an  application  for\nreconsideration or the appeal; and\n\n(b)\n\nthe obtaining of an expert report,\n\nand any such award shall be at the discretion of the Tribunal.\n\nDisclosure in reconsideration and appeal proceedings\n\n81.\n79 and no public hearing shall be held under those sections where\n\nNo information shall be disclosed in proceedings under sections 74 to\n\n(a)\n\nthe Tribunal is of the opinion that evidence may be disclosed relating\nto financial or other personal circumstances of any person and that the\nbalance of advantage is in favour of preventing the disclosure of the\nevidence in public, having regard both to the public interest and the\ninterest of the person concerned; or\n\n\f84\n\n(b)\n\nto do so would prejudice national security, impede law enforcement,\nprejudice the legitimate, commercial interests of a supplier or impede\nfair competition.\n\nRights of participants in reconsideration and appeal proceedings\n\nA supplier who is a party in procurement proceedings to which an\n82.(1)\napplication for reconsideration of a decision or action by a procuring entity or\ntenders  committee  or  an  appeal  relates  and  the  procuring  entity,  the  tenders\ncommittee and any other governmental authority the interests of which are, or\nare likely to be, affected by the application or appeal have the right to\n\n(a)\n\n(b)\n\n(c)\n\nparticipate in the proceedings under sections 74 to 79;\n\nbe present and represented at all hearings during the proceedings;\n\nbe heard;\n\n(d)\n\npresent evidence, including from witnesses;\n\n(e)\n\nrequest, subject to section 81, that any hearing should take place in\npublic; and\n\n(f)\n\nobtain, subject to section 81, access to the record of the proceedings.\n\nA supplier who fails to participate in proceedings for a reconsideration or\n(2)\nan appeal referred to in subsection (1) is barred from subsequently challenging\nthe  decisions  or  actions  that  are  the  subject  matter  of  the  application  for\nreconsideration or the appeal.\n\nEffect of an application for reconsideration or an appeal\n\n83.(1)\nA  procuring  entity  shall  not  take  any  step  that  would  result  in  the\nexecution of a procurement contract or framework agreement where the entity\nreceives,  in  respect  of  a  decision  or  action  taken  in  procurement  proceedings\nrelated to the contract or agreement\n\n(a)\n\nan application for reconsideration within the time limits prescribed in\nsection 76;\n\n\f85\n\n(b)\n\nnotice, from a tenders committee, of an application for reconsideration\nsubmitted to the committee within the time limits prescribed in section\n76; or\n\n(c)\n\nnotice of an appeal before the Tribunal under section 77.\n\nThe prohibition referred to in subsection (1) shall expire on the fifteenth\n(2)\nday after the decision of the procuring entity, tenders committee or Tribunal on\nthe  application  for  reconsideration  or  the  appeal,  as  the  case  may  be,  is\ncommunicated to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe applicant or appellant, as the case may be;\n\nthe procuring entity, where applicable;\n\nall  other  participants  in  the  proceedings  for  reconsideration  or  all\nparties to the appeal, as the case may be; and\n\nall  other  participants  in  the  procurement  proceedings  to  which  the\napplication or appeal relates.\n\nA procuring entity may, at any time, apply to the Tribunal to authorise the\n(3)\nentity to enter into a procurement contract or framework agreement on the ground\nthat urgent public interest considerations so justify.\n\nThe decision of the Tribunal and the reason for the decision shall promptly\n(4)\nbe communicated to the persons referred to in paragraphs (a) to (d) of subsection\n(2).\n\nCourt proceedings\n\n84.(1)\nthe Tribunal to the Court of Appeal.\n\nA party to an appeal to the Tribunal may appeal from the decision of\n\n(2)\n\nIn disposing of an appeal under this section, the Court of Appeal may\n\n(a)\n\n(b)\n\nconfirm or vacate the determination;\n\nmake an order referring the determination back to the Tribunal for re-\ndetermination in accordance with the directions of the court; or\n\n\f(c)\n\nmake such other orders as it considers necessary.\n\n86\n\nPART VIII\n\nMISCELLANEOUS\n\nForm of procurement contract\n\n85.(1)\nagreement drawn up in a form approved by the Solicitor General.\n\nA procurement contract shall, subject to subsection (2), be a written\n\nWhere the estimated value of the procurement contract is less than $50\n\n(2)\n000, the contract may be a purchase order in a form approved by the Director.\n\nAll contract documents shall be in the form, and include the terms and\n(3)\nconditions,  included  or  indicated  in  the  solicitation  document,  subject  to  any\nchanges  resulting  from  the  acceptance  of  the  successful  submission  or  from\nnegotiations.\n\n(4)\n\nWhere\n\n(a)\n\n(b)\n\nthe  value  of  a  contract  exceeds  the  relevant  threshold  specified\nin section 16(1)(a); or\n\nthe contract includes terms and conditions other than those provided\nin the standard form approved by the Solicitor General,\n\nthe procuring entity shall, prior to executing the contract, ensure that the contract\nis approved by the Solicitor General or another legal officer nominated by the\nSolicitor General, or, in the case of a procuring entity that is a statutory body or\na state-owned company, by such legal officer as the entity may approve for the\npurpose.\n\n\f87\n\nProcurement record and contract management record\n\n86.(1)\nA procuring entity shall maintain for a period of no less than 7 years\nfrom  the  date  of  completion  of  performance  under  a  procurement  contract,  a\nrecord of\n\n(a)\n\n(b)\n\nthe procurement proceedings; and\n\nthe management of the procurement contract.\n\n(2)\n\nA procurement record shall include\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nany request to initiate the procurement proceedings and the consistency\nof the request with a procurement plan;\n\nwhere a procuring entity uses a method of procurement other than open\ntendering, a statement of the reasons and circumstances relied upon to\njustify the use of such other method and evidence of any permission\ngranted for the use of the method;\n\na copy of any notice published;\n\nany list of suppliers or organisations to whom an invitation to tender\nor other similar notice was sent directly;\n\n(e)\n\nany shortlist of suppliers or list of pre-qualified suppliers used;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\na copy of any pre-qualification or solicitation document issued and any\namendment to, or clarification of, such document;\n\na record of the submissions received;\n\na record of any opening of tenders;\n\ncopies  of  all  submissions  evaluated  and  any  clarification  requested\nfrom a supplier and the response received;\n\nany evaluation report prepared, including in respect of applications for\npre-qualification;\n\n(k)\n\nminutes of any meeting held with suppliers;\n\n\f88\n\n(l)\n\na copy of the successful tender notice, or, where no standstill period\nwas applied and no successful tender notice issued, a statement of the\nreasons  and  circumstances  relied  upon  by  the  procuring  entity  in\ndeciding, in accordance with section 34(5), not to apply a standstill\nperiod;\n\n(m)\n\nany successful tender acceptance notice;\n\n(n)\n\n(o)\n\n(p)\n\n(q)\n\n(r)\n\nany submissions to, and decisions of, a tenders committee;\n\nany decision of a procuring entity to reject a submission as abnormally\nlow and the reason for the decision and, in particular, the concerns that\nled the entity to reject the submission and its reasons for holding such\nconcerns, and all communications with the supplier in relation to the\nsubmission;\n\nany decision to cancel the procurement and the reason for the decision;\n\nany decision to exclude a supplier from the procurement proceedings\nand the reason for the decision; and\n\nin the case of an application for reconsideration or an appeal under Part\nVII, a copy of the application for reconsideration or appeal, as the case\nmay be, and of all decisions taken in the relevant proceedings and the\nreasons for the decisions.\n\n(3)\n\nA contract management record shall include\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe successful tender acceptance notice;\n\na  copy  of  the  executed  contract  document  and  any  agreed  contract\namendments;\n\nany variations issued under the contract or call-off orders issued under\na framework agreement;\n\nall post-contract documentation relating to the fulfilment of contractual\nobligations including copies of guarantees;\n\n\f89\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\nminutes of any meetings related to the management of the contract,\nincluding contract progress or review meetings;\n\nall  documentation  evidencing  deliveries  of  goods  or  completion\ncertificates in relation to contracts for works or services;\n\ncopies of test reports relating to any tests performed on the goods and\nworks;\n\ncopies of all invoices including supporting documentation and details\nof the actual payment authorised;\n\ndetails of any claims made or penalties imposed by the procuring entity\nin accordance with the contract; and\n\n(j)\n\nall correspondence between the procuring entity and the supplier.\n\nProcurement records and contract management records shall be accurately\n\n(4)\nmaintained and kept up to date and may be in electronic form.\n\nWhere  procurement  and  contract  management  records  are  in  electronic\n(5)\nform, the procuring entity shall establish and maintain measures to safeguard the\nintegrity and the reliability of the records.\n\nPublic procurement manuals, standard documents and instructions\n\n87.\nThe Director may issue public procurement instructions and manuals\nto  provide  guidance  on,  and  standard  documents  and  forms  for  the\nimplementation of, this Act.\n\nAnnual reports\n\n88.(1)\nThe Chief Procurement Officer shall, at the end of a financial year,\nprepare  a  report  on  the  operation  and  performance  of  the  public  procurement\nsystem for the year.\n\n\f(2)\n\nThe report shall include\n\n90\n\n(a)\n\na figure representing the total value of contracts awarded by procuring\nentities and another figure representing the cost of the total value of\nprocurement contract variances for the year;\n\n(b)\n\nthe number of unfulfilled contracts awarded;\n\n(c)\n\na summary of the procurement activities of each procuring entity that\nsets out\n\n(i)\n\n(ii)\n\nthe number of procurement contracts awarded;\n\nthe number of procurement contracts varied and the reason for\nthe variance;\n\n(iii)\n\nthe quantum of the variances;\n\n(iv)\n\n(v)\n\nthe number of unfulfilled procurement contracts and the quantum\nof cost incurred thereby;\n\nwith respect to procurement for a project, a brief description of\nthe project and the name of the supplier to whom the contract was\nawarded and the value, scope of works and expected deliverables\nof the project; and\n\n(vi)\n\nany lessons learnt as a consequence of the management of the\nprocurement contracts;\n\ndetails of changes implemented to ensure that current best practice for\npublic procurement is observed;\n\nthe names of any procuring entities that have failed to comply with this\nAct;\n\nan assessment of the overall operation and performance of the public\nprocurement system;\n\na summary of any issues to be resolved; and\n\nany recommendations requiring action on the part of a procuring entity.\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n\f91\n\n(3)\nThe  report  need  not  include  details  of  contracts  valued  at  less  than  the\nrelevant threshold specified in section 16(1)(a) other than the total number and\nvalue.\n\n(4)\nThe Minister shall cause a report prepared pursuant to subsection (1) to be\nlaid in Parliament within 4 months of the end of the financial year to which the\nreport relates.\n\nConfidentiality in procurement proceedings\n\nA procuring entity shall not, unless in accordance with an order of the\n89.(1)\ncourt,  disclose  any  information  related  to  its  procurement  proceedings  or\nsuppliers  where  to  do  so  would  prejudice  national  security,  impede  law\nenforcement,  prejudice  the  legitimate,  commercial  interests  of  suppliers  or\nimpede fair competition.\n\nA  procuring  entity  shall,  unless  it  is  required  to  provide  or  publish\n(2)\ninformation in accordance with this Act or any rules made under this Act, treat\napplications  to  pre-qualify  and  submissions  in  such  a  manner  as  to  avoid  the\ndisclosure of their contents to competing suppliers or to any other person not\nauthorised to have access to the information.\n\nSubject  to  subsection  (1),  in  procurement  involving  information  that  a\n\n(3)\nprocuring entity considers to be secret, a procuring entity may\n\n(a)\n\n(b)\n\nimpose on suppliers requirements aimed at protecting the information;\nand\n\nrequire suppliers to ensure that their sub-contractors comply with such\nrequirements.\n\nA  procuring  entity  shall,  subject  to  any  other  law  to  the  contrary,  keep\n(4)\nconfidential  the  commercial  and  proprietary  information  that  comes  into  its\npossession in relation to procurement proceedings.\n\n\f92\n\nDisclosure of interest\n\n90.(1)\nWhere  an  officer  or  a  member  of  a  tenders  committee  or  of  the\nTribunal is interested in any matter requiring the consideration and decision of\nthe officer, committee or Tribunal, or is interested in any party to any such matter,\nthe person so interested shall\n\n(a)\n\n(b)\n\ndisclose such interest as soon as practicable after he becomes aware of\nthe matter; and\n\nabsent himself from, and refrain from participation in, the deliberations\nor decision-making process in relation to the matter.\n\nA disclosure of interest shall be recorded in the minutes of the meeting at\n(2)\nwhich it is made or to which it relates or in the record of the hearing of the Tribunal\nto which it relates.\n\nSubsections (1) and (2) apply, with such modifications and adaptations as\n(3)\nmay be necessary, to advisers and technical specialists who provide advice to a\ntenders committee or the Tribunal and to staff who provide secretarial services\nto a tenders committee or the Tribunal.\n\nProtection from suit, victimisation etc.\n\n91.(1)\nNo  action  shall  be  instituted  against  a  member  of  the  Tribunal  in\nrespect of the discharge or purported discharge, in good faith, of his functions\nunder this Act.\n\nNotwithstanding any other law, a person shall not be discharged, demoted,\n(2)\nsuspended,\nfinancially  prejudiced  or  otherwise\ndiscriminated against or victimised for making a report under section 92(1)(d).\n\nthreatened,  harassed,\n\nA person who is discharged, demoted, suspended, threatened, harassed,\n(3)\nfinancially  prejudiced  or  otherwise  discriminated  against  or  victimised  for\nmaking a report under section 92(1)(d) shall, where applicable, be reinstated in\nhis original office with no loss of benefit and without prejudice to any other legal\nrecourse available to him.\n\n\f93\n\n(4)\nA person who discharges, demotes, suspends, threatens, harasses or in any\nmanner discriminates against or victimises a person or acts so as to prejudice the\nlivelihood of a person as a consequence of his making a report under section\n92(1)(d) is guilty of an offence and is liable on summary conviction to a fine of\n$100  000  or  to  imprisonment  for  3  years  or  to  both  such  fine  and\nimprisonment.\n\nOfficers engaged in procurement activities\n\n92.(1)\nentity shall\n\nAn officer who is engaged in the procurement activities of a procuring\n\n(a)\n\nhave regard to the objectives specified in section 12 in relation to public\nprocurement and otherwise comply with this Act;\n\n(b)\n\nexercise any functions that he has in relation to public procurement\n\n(i)\n\n(ii)\n\ndiligently  and  with  the  degree  of  care  and  efficiency  that  a\nreasonable person would exercise in the circumstances; and\n\nimpartially  to  ensure  that  suppliers  have  fair  and  competitive\naccess to opportunities in public procurement;\n\nkeep confidential any information relating to public procurement that\ncomes  into  his  possession  including  any  proprietary  information  of\nsuppliers; and\n\ndisclose  to  the  Chief  Procurement  Officer  any  information  in  his\npossession concerning any act of impropriety or illegality in respect of\nsuch activities or any breach of this Act.\n\n(c)\n\n(d)\n\nAn  officer  who  is  engaged  in  the  procurement  activities  of  a  procuring\n\n(2)\nentity shall not participate as a supplier in such activities.\n\nWhere the Chief Procurement Officer or the Tribunal has reasonable cause\n(3)\nto believe that there has been misconduct or a breach of this Act by an officer,\nthe Chief Procurement Officer or Tribunal shall refer the matter to the appropriate\nauthority for further investigation.\n\n\f94\n\nOffences and penalties\n\n93.(1)\n\nA person who\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nwithout  reasonable  excuse,  fails  or  refuses  to  give  information,  or\nproduce any books, documents or records required under section 5(2)\nor section 78(7);\n\nwithout reasonable excuse, refuses to answer a summons as required\nunder section 78(7);\n\nknowingly  gives  false  or  misleading  information  or  evidence  in\npurported compliance with a request or summons under section 5(2)\nor section 78(7);\n\nassaults,  resists  or  obstructs  the  Chief  Procurement  Officer  or  staff\ndesignated by him, in the exercise of their powers to access or require\nrelevant information in accordance with section 5(2); or\n\ncontrary to this Act, interferes, with or exerts undue influence on, the\nDirector or the Chief Procurement Officer or any officer appointed to\nassist the Director or the Chief Procurement Officer or on a procuring\nentity in the performance of the functions assigned to the person or\nentity or in the exercise of the powers granted under this Act,\n\nis guilty of an offence and is liable on conviction on indictment to a fine of $170\n000 or to imprisonment for 7 years or to both such fine and imprisonment.\n\nNotwithstanding subsection (1), a person who fails or refuses to answer\n(2)\nany question or make any statement that may incriminate him is not guilty of an\noffence under that subsection.\n\nRules\n\n94.\n\nThe Minister may make Rules for giving effect to this Act.\n\n\f95\n\nRepeal and consequential changes\n\n95.(1)\n(S.I. 1971 No. 47) are repealed.\n\nThe  Financial  Management  and  Audit  (Supplies)  Rules,  1971\n\nThe enactment set out in first column of the Third Schedule is amended to\n\n(2)\nthe extent set out opposite thereto in the second column.\n\nTransitional provisions\n\n96.\nThis  Act  does  not  apply  to  procurement  initiated  before  the\ncommencement of this Act and such procurement shall be conducted and dealt\nwith as if this Act had not commenced.\n\nCommencement\n\n97.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  day  to  be  fixed  by\n\n\f96\n\nFIRST SCHEDULE\n\nTENDERS COMMITTEES\n\nPart I\n\nGeneral Tenders Committee\n\n(Section 7(4))\n\nComposition of General Tenders Committee\n\n1.(1)\n\nThe General Tenders Committee shall comprise ex officio\n\n(a)\n\n(b)\n\n(c)\n\nthe Chief Procurement Officer;\n\nthe Solicitor General;\n\nthe Permanent Secretary in the Ministry responsible for Finance;\n\n(d)\n\nthe Chief Technical Officer in the Ministry responsible for Works;\n\n(e)\n\nthe Senior Mechanical Engineer in the Ministry responsible for Works;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nthe Director of the Department of Commerce and Consumer Affairs;\n\nthe Director of the Data Processing Department;\n\nthe Manager of the Public Investment Unit;\n\nthe Chief Executive Officer of Barbados Investment and Development\nCorporation; and\n\nthe  Chief  Executive  Officer  of  Barbados  National  Oil  Company\nLimited.\n\nA  person  listed  in  paragraph  (1)(b),  (c),  (d),  (f),  (g),  (h),  (i)  or  (j)  may\n\n(2)\nnominate a senior officer to be a member of the committee in his place.\n\n\f97\n\nChairman and Deputy Chairman\n\n2.(1)\nTenders Committee.\n\nThe Chief Procurement Officer shall be the Chairman of the General\n\n(2)\nThe committee shall, at its first meeting in a financial year, elect one of its\nmembers,  other  than  the  Solicitor  General  or  his  nominee,  to  be  the  Deputy\nChairman of the committee.\n\nWhere the Chairman is absent from a meeting of the committee, the Deputy\n\n(3)\nChairman shall preside over the meeting.\n\nQuorum\n\n3.\nincluding the Chairman or the Deputy Chairman.\n\nThe  quorum  of  the  General  Tenders  Committee  is  6  members\n\nSecretary\n\n4.\nthe secretary of the General Tenders Committee.\n\nThe Chief Procurement Officer shall designate a public officer to be\n\nPart II\n\nSpecial Tenders Committee\n\nComposition of special tenders committee\n\n1.\n\nA special tenders committee shall comprise\n\n(a)\n\n(b)\n\nthe members of the General Tenders Committee; and\n\nsuch other persons, not exceeding 5, as the Director may appoint with\nthe  approval  of  the  Minister,  having  regard  to  the  procurement\nconcerned and the obligations of the Crown under the agreement for\nthe loan to which the procurement relates.\n\n\f98\n\nChairman and Deputy Chairman of special tenders committee\n\n2.(1)\nChairman of a special tenders committee.\n\nThe  Chairman  of  the  General  Tenders  Committee  shall  be  the\n\nThe  Deputy  Chairman  of  the  General  Tenders  Committee  shall  be  the\n\n(2)\nDeputy Chairman of a special tenders committee.\n\nWhere the Chairman is absent from a meeting of the committee, the Deputy\n\n(3)\nChairman shall preside over the meeting.\n\nQuorum\n\n3.\nmembers including the Chairman or the Deputy Chairman.\n\nThe  quorum  of  a  special  tenders  committee  is  two-thirds  of  its\n\nTerm of office\n\nA  member  of  a  special  tenders  committee  shall  hold  office  for  the\n4.\nduration of the procurement proceedings in respect of which the committee was\nestablished.\n\nSecretary\n\n5.\nthe secretary of a special tenders committee.\n\nThe Chief Procurement Officer shall designate a public officer to be\n\nPart III\n\nDrug Tenders Committee\n\nComposition\n\n1.\n\nThe Drug Tenders Committee shall comprise\n\n(a)\n\nex officio\n\n(i)\n\nthe Director of the Drug Service;\n\n\f99\n\n(ii)\n\nthe Chief Procurement Officer or his nominee;\n\n(iii)\n\n(iv)\n\nthe  Assistant  Director  of  the  Drug  Service  charged  with\nresponsibility for Supply and Inventory;\n\nthe  Director  of  Medical  Services  of  the  Queen  Elizabeth\nHospital;\n\n(v)\n\nthe Hospital Pharmacist of the Queen Elizabeth Hospital;\n\n(vi)\n\nthe Chairman of the Drug Formulary Committee established by\nsection 5 of the Drug Service Act, Cap. 40A or a member of that\ncommittee nominated by him; and\n\n(b)\n\n(c)\n\n(vii)\n\nthe Solicitor General or a legal officer nominated by the Solicitor\nGeneral;\n\na pharmacist in actual private practice and not employed in the Public\nService, nominated by the Barbados Pharmaceutical Society; and\n\na medical practitioner in actual private practice and not employed in\nthe Public Service, nominated by the most representative association\nof medical practitioners.\n\nChairman and Deputy Chairman of Drug Tenders Committee\n\n2.(1)\nTenders Committee and shall preside at meetings of the committee.\n\nThe Director of the Drug Service shall be the Chairman of the Drug\n\nThe Assistant Director of the Drug Service charged with responsibility for\n(2)\nSupply and Inventory shall be the Deputy Chairman of the committee and shall\npreside at any meeting from which the Chairman is absent.\n\nQuorum\n\n3.\nthe Chairman or Deputy Chairman.\n\nThe quorum of the Drug Tenders Committee is 6 members including\n\n\f100\n\nTerm of office\n\n4.\nmember, shall hold office for 3 years and is eligible for re-appointment.\n\nA member of the Drug Tenders Committee, other than an ex officio\n\nSecretary\n\n5.\nthe secretary of the Drug Tenders Committee.\n\nThe Director of the Drug Service shall designate a public officer to be\n\nPart IV\n\nGeneral Provisions\n\nMeetings of tenders committees\n\n1.(1)\ndischarge of its functions under this Act.\n\nA tenders committee shall meet as often as is necessary for the proper\n\nThe Chairman, in consultation with the secretary of the committee, shall\n(2)\ndetermine the times and places for meetings and convene meetings accordingly.\n\nA  decision  of  a  tenders  committee  shall  be  by  a  majority  of  votes,  and\n\n(3)\nwhere there is an equality of votes, the Chairman shall have a casting vote.\n\nUrgent decisions\n\n2.(1)\nA tenders committee may make a decision on an urgent matter by the\ncirculation of the relevant papers among the members of the committee and the\nexpression, in writing, of the views of the majority of the members.\n\nNotwithstanding sub-paragraph (1), a member is entitled to require that a\n(2)\ndecision be deferred until the matter is considered at a meeting of the committee.\n\n\f101\n\nObservers and advisers\n\n3.(1)\n\nA tenders committee may\n\n(a)\n\n(b)\n\npermit observers to attend a meeting of the committee; and\n\nco-opt advisers to assist the committee in the discharge of its functions.\n\nObservers and advisers shall not vote and advisers shall only attend the\n\n(2)\npart of the meeting on which their advice is required.\n\nMinutes\n\n4.(1)\nmeetings.\n\nA  tenders  committee  shall  keep  minutes  of  the  proceedings  of  its\n\n(2)\n\nThe minutes shall include\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe names of the members present at the meeting;\n\nthe names of any advisers or observers attending the meeting;\n\nany disclosure of interest;\n\nthe key issues discussed in relation to evaluation reports, including any\nadvice given or disagreement among the members; and\n\nwhere the recommendation of a procuring entity is rejected, the reason\nfor the rejection.\n\nMinutes  and  decisions  of  the  committee  shall  be  made  available  and\n(3)\ndistributed within 7 days of the meeting of the committee to which they relate.\n\nMinutes shall be distributed to all members of the committee and decisions\n\n(4)\nshall be transmitted to the relevant procuring entity.\n\n\f102\n\nSECOND SCHEDULE\n\nPUBLIC PROCUREMENT TRIBUNAL\n\n(Section 8)\n\nComposition\n\n1.(1)\nthe Minister as follows:\n\nThe Tribunal shall comprise 5 persons of high integrity appointed by\n\n(a)\n\nan attorney-at-law of at least 10 years’ standing or a person who has\nheld high judicial office, who shall be the Chairman of the Tribunal;\nand\n\n(b)\n\n4 other persons each with 5 years’ experience, at a senior level, in public\nprocurement or a related field.\n\nIn selecting persons to be members of the Tribunal, the Minister shall seek\n(2)\nto establish a balance of relevant knowledge and experience among members to\nensure that the Tribunal has both\n\n(a)\n\n(b)\n\nknowledge  of  any  applicable  public  procurement  laws,  rules,\nproceedings and practices; and\n\na range of technical knowledge relating to various types of procurement\ncontracts.\n\nMembers are entitled to such remuneration and allowances as the Minister\n\n(3)\ndetermines.\n\nTerm of office\n\n2.\noffice for not more than 5 years but is eligible for re-appointment.\n\nSubject to paragraphs 4 and 5, a member of the Tribunal shall hold\n\n\f103\n\nTemporary absence\n\n3.\nact, the Minister may appoint a suitable person to act in the member's place.\n\nWhere a member of the Tribunal is temporarily absent or unable to\n\nResignation\n\nA member of the Tribunal, other than the Chairman, may resign his\n4.(1)\noffice by instrument in writing addressed to the Chairman, who shall forthwith\ncause the same to be forwarded to the Minister.\n\nThe Chairman may resign his office by instrument in writing addressed to\n\n(2)\nthe Minister.\n\nA person shall cease to be a member of the Tribunal upon the date of receipt\n(3)\nof the instrument by the Chairman under sub-paragraph (1) or the Minister under\nsub-paragraph  (2),  unless  another  date  for  his  resignation  is  specified  in  the\ninstrument.\n\nRemoval\n\n5.\nthe member\n\nThe Minister may remove a member of the Tribunal from office where\n\n(a)\n\n(b)\n\nfails to disclose a conflict of interest in relation to a matter before the\nTribunal;\n\nfails, without reasonable excuse, to attend 3 consecutive meetings of\nthe Tribunal;\n\n(c)\n\nhas become bankrupt or has made an arrangement with his creditors;\n\n(d)\n\nis incapacitated by physical or mental illness;\n\n(e)\n\nengages  in  misconduct  or  has  a  conflict  of  interest  as  a  result  of\nengaging in paid employment that conflicts with the functions of the\nTribunal; or\n\n(f)\n\nis otherwise unable or unfit to discharge the functions of a member.\n\n\f104\n\nPublication of appointments etc.\n\nThe names of all of the members of the Tribunal as first constituted\n6.\nand every change in the membership of the Tribunal shall be published in the\nOfficial Gazette.\n\nSeal\n\n7.(1)\n\nThe seal of the Tribunal\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nshall be kept in the custody of the Chairman or such other member as\nthe members may approve;\n\nmay be affixed to documents or instruments pursuant to a resolution\nof the Tribunal;\n\nshall be affixed in the presence of the Chairman and the Secretary to\nthe Tribunal; and\n\nshall be authenticated by the signature of the Secretary to the Tribunal\nand the signature of the Chairman.\n\nAll documents other than those required by law to be under seal may be\n\n(2)\nsigned under the hand of the Chairman or the Secretary.\n\nSpecialists\n\n8.\nThe Tribunal may engage specialists in technical disciplines to assist\nin its work where so required and may, in particular, where it determines it to be\nnecessary in any case, consult any person having experience in any relevant field\nto assist it in dealing with a matter.\n\nTribunal may regulate procedure\n\n9.\n\nSubject to this Act, the Tribunal may regulate its own procedure.\n\n\f105\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosTHIRD SCHEDULE(Section 95)CONSEQUENTIAL AMENDMENTS  Column 1 Enactments Financial Management and Audit  (Financial) Rules, 2011. Column 2Amendments1. In rule 2, delete the definitions of \"Special  Tenders Committee\" and \"Tenders Committee\".2. In rules 80(7), 161(2)(a), 162(2), 195(1) and (2)  and 230, delete the words \"Chief Supply Ofﬁ cer\"  and substitute the words \"Chief Procurement Ofﬁ cer\".3. Delete rules 204, 205, 218 to 227 and 231 to  239.4. Delete the Second and Third Schedules.\f106\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n\fPUBLIC PROCUREMENT BILL, 2018\n\nEXPLANATORY MEMORANDUM\n\nThis  Bill  would  regulate  public  procurement  and  in  particular  promote\nintegrity,  fairness,  transparency,  value  for  money  and  efficiency  in  public\nprocurement.\n\nPART I - PRELIMINARY\n\nClause 1:\n\nprovides the short title.\n\nClause 2:\n\ndefines certain terms used in the Bill.\n\nClause 3:\n\nexplains the scope of the Bill.\n\nPART II - ADMINISTRATION\n\nClause 4:\n\nprovides for the Chief Procurement Officer to be responsible\nfor the management of public procurement.\n\nClause 5:\n\nsets out the functions of the Chief Procurement Officer.\n\nClause 6:\n\nsets out the functions of heads of procuring entities.\n\nClause 7:\n\nClause 8:\n\nestablishes several tenders committees, the composition and\nprocedure of which is set out in the First Schedule.\n\nestablishes the Public Procurement Tribunal, the composition\nof which is set out in the Second Schedule.\n\nPART III - PLANNING AND INITIATION OF PROCUREMENT\n\nClause 9:\n\nrequires  that  procuring  entities  have  annual  procurement\nplans.\n\ni\n\n\fPublic Procurement Bill, 2018\n\nClause 10:\n\nprovides for procuring entities to publish advance notice of\nforthcoming procurement.\n\nClause 11:\n\naddresses the initiation of procurement.\n\nClause 12:\n\nClause 13:\n\nprovides  for  procurement  to  be  conducted  with  certain\nobjectives in mind.\n\nsets  out  rules  for  estimating  the  value  of  procurement\ncontracts.\n\nClause 14:\n\nprovides for the procurement of common items.\n\nClause 15:\n\nallows for the use of agents in procurement.\n\nPART IV - METHODS OF PROCUREMENT\n\nClause 16:\n\nexplains the circumstances in which the various methods of\nprocurement may be used.\n\nClause 17:\n\nClause 18:\n\nClause 19:\n\nClause 20:\n\nOpen Tendering and Restricted Tendering\n\nprovides  that  open  tendering  must  generally  be  used  for\nprocurement above certain thresholds.\n\nallows  for  restricted  tendering  to  be  used  in  limited\ncircumstances.\n\nsets out the requirements for solicitation documents to be used\nin tendering.\n\nprovides  for  clarification  and  modification  of  invitations  to\ntender and solicitation documents.\n\nClause 21:\n\nspeaks to the use of tender securities.\n\nii\n\n\fPublic Procurement Bill, 2018\n\nClause 22:\n\nprovides for meetings with suppliers to be held prior to the\npresentation of tenders.\n\nClause 23:\n\naddresses deadlines for presenting tenders.\n\nClause 24:\n\nsets out the requirements for the presentation of tenders.\n\nClause 25:\n\nClause 26:\n\nprovides  for  the  presentation  of  separately  sealed  technical\nand financial tenders.\n\naddresses the validity of tenders and their modification and\nwithdrawal.\n\nClause 27:\n\nprovides for the opening of tenders.\n\nClause 28:\n\nClause 29:\n\nrequires  the  establishment  of  evaluation  committees  to\nevaluate tenders.\n\ngoverns  evaluation  criteria  and  procedures  to  be  used  in\nevaluating tenders.\n\nClause 30:\n\nprovides for the examination and evaluation of tenders.\n\nClause 31:\n\naddresses the separate opening, examination and evaluation\nof technical and financial tenders.\n\nClause 32:\n\nprovides for the treatment of abnormally low tenders.\n\nClause 33:\n\nprovides for the determination of the successful tender.\n\nClause 34:\n\nClause 35:\n\nrequires the issue of a successful tender notice to suppliers and\nprovides for standstill periods.\n\nrequires that a successful tender acceptance notice be issued\nto a successful supplier.\n\niii\n\n\fPublic Procurement Bill, 2018\n\nClause 36:\n\nClause 37:\n\nClause 38:\n\ndefines  the  scope  of  negotiations  that  may  be  held  with  a\nsuccessful supplier.\n\nrequires  the  execution  of  a  procurement  contract  before\nperformance is commenced.\n\nrequires a procuring entity to publish notice of the award of a\nprocurement contract.\n\nClause 39:\n\nprovides for the management of procurement contracts.\n\nClause 40:\n\nrequires the preparation of reports on suppliers’ performance.\n\nClause 41:\n\nspeaks to when procurement may be cancelled.\n\nRequests for Quotations\n\nClause 42:\n\nprovides for the use of requests for quotations.\n\nClause 43:\n\nClause 44:\n\nsets out the requirements for solicitation documents to be used\nin requests for quotations.\n\nprovides for meetings with suppliers to be held prior to the\npresentation of quotations.\n\nClause 45:\n\nprohibits negotiations on quotations.\n\nClause 46:\n\nClause 47:\n\nprovides for certain provisions related to open tendering, such\nas  the  provisions  on  evaluation  and  the  determination  of  a\nsuccessful supplier, to apply, with such modifications as may\nbe necessary, to quotations.\n\nSingle-Source Procurement\n\nto\n\nspeaks\nprocurement may be used.\n\nthe  circumstances\n\nin  which  single-source\n\niv\n\n\fPublic Procurement Bill, 2018\n\nClause 48:\n\nClause 49:\n\nrequires  procuring  entities  to  seek  permission  to  engage  in\nsingle-source procurement.\n\nsets out the requirements for solicitation documents to be used\nfor single-source procurement.\n\nClause 50:\n\nspeaks to the evaluation of single-source submissions.\n\nClause 51:\n\nallows for negotiations in single-source procurement.\n\nClause 52:\n\nprovides  for  certain  provisions  related  to  open  tendering  to\napply, with such modifications as may be necessary, to single-\nsource procurement.\n\nFramework Agreements\n\nClause 53:\n\nspeaks to the use of framework agreements.\n\nProcurement of Services of Individual Consultants\n\nClause 54:\n\ngoverns  the  procurement  of  the  services  of  individual\nconsultants.\n\nClause 55:\n\nprovides for solicitation in relation to individual consultants.\n\nClause 56:\n\nClause 57:\n\nstipulates  that  solicitation  documents  are  not  required  in\nrespect of individual consultants.\n\nprovides  for  the  presentation  of  submissions  by  individual\nconsultants and the evaluation of such submissions.\n\nClause 58:\n\ngoverns negotiations with individual consultants.\n\nClause 59:\n\nprovides  for  certain  provisions  related  to  open  tendering  to\napply,  with  such  modifications  as  may  be  necessary,  to\nprocurement of the services of individual consultants.\n\nv\n\n\fPublic Procurement Bill, 2018\n\nPART V - GENERAL RULES REGARDING PROCUREMENT\n\nClause 60:\n\nClause 61:\n\nsets  out  rules  for  describing  the  subject  matter  of  the\nprocurement.\n\nprovides for standard trade terms and conditions to be used in\nprocurement.\n\nClause 62:\n\ngoverns the publication of notices.\n\nClause 63:\n\nprovides for corrections to published information.\n\nClause 64:\n\nestablishes\nproceedings.\n\nrules\n\nfor  communication\n\nin  procurement\n\nPART VI - REGISTRATION, ELIGIBILITY AND QUALIFICATION\n\nClause 65:\n\nprovides for the establishment of the Suppliers Register.\n\nClause 66:\n\nrequires suppliers to be registered.\n\nClause 67:\n\nClause 68:\n\nClause 69:\n\nClause 70:\n\nrequires a supplier to notify the Chief Procurement Officer of\nany  change  in  his  circumstances  that  may  affect  his\nregistration.\n\nspeaks to the eligibility of suppliers to participate in public\nprocurement.\n\nempowers  procuring  entities  to  exclude  suppliers  from\nparticular procurement proceedings in certain cases.\n\ndescribes the circumstances in which a supplier’s name may\nbe removed from the Suppliers Register.\n\nClause 71:\n\nspeaks to the qualifications of suppliers.\n\nClause 72:\n\nprovides for the pre-qualification of suppliers.\n\nvi\n\n\fPublic Procurement Bill, 2018\n\nClause 73:\n\nprovides  for  clarification  of  pre-qualification  notices  and\ndocuments.\n\nPART VII - CHALLENGE PROCEEDINGS\n\nClause 74:\n\nprovides  for  appeals  to  the  Tribunal  against  decisions\nregarding,  among  other  things,  registration  and  exclusion\nfrom participation in procurement.\n\nClause 75:\n\nsets out the procedure for appeals.\n\nClause 76:\n\nClause 77:\n\nenables suppliers to apply for reconsideration of decisions or\nactions by procuring entities or tenders committees.\n\nto\nprovides  for  appeals\nreconsideration proceedings.\n\nthe  Tribunal\n\nin  respect  of\n\nClause 78:\n\ngoverns the hearing of appeals by the Tribunal.\n\nClause 79:\n\ngoverns decisions by the Tribunal.\n\nClause 80:\n\nspeaks to how the Tribunal may deal with costs.\n\nClause 81:\n\nClause 82:\n\nClause 83:\n\nClause 84:\n\nprohibits  certain  types  of  disclosure  in  reconsideration  and\nappeal proceedings.\n\nsets out the rights of participants in reconsideration and appeal\nproceedings.\n\nspeaks to the effect of an application for reconsideration or an\nappeal.\n\nprovides for an appeal to the Court of Appeal from a decision\nof the Tribunal.\n\nvii\n\n\fPublic Procurement Bill, 2018\n\nPART VIII - MISCELLANEOUS\n\nClause 85:\n\nspeaks to the form of a procurement contract.\n\nClause 86:\n\nClause 87:\n\nClause 88:\n\nprovides  for  the  establishment  of  procurement  records  and\ncontract management records.\n\nempowers the Director to issue public procurement manuals,\nstandard documents and instructions.\n\nmandates  the  Chief  Procurement  Officer  to  prepare  annual\nreports on the procurement system.\n\nClause 89:\n\nprovides for confidentiality in procurement proceedings.\n\nClause 90:\n\nprovides  for  officers  engaged  in  procurement  activities  to\ndisclose any interest in such activities.\n\nClause 91:\n\nprotects persons from certain types of conduct.\n\nClause 92:\n\nimposes  certain  duties  on  officers  engaged  in  procurement\nactivities.\n\nClause 93:\n\nmakes certain conduct an offence.\n\nClause 94:\n\nempowers the Minister to make Rules.\n\nClause 95:\n\nClause 96:\n\nClause 97:\n\nrepeals  the  Financial  Management  and  Audit  (Supplies)\nRules,  1971  (S.I.  1971  No.  47)  and  provides  for  certain\nconsequential  changes  to  the  Financial  Management  and\nAudit (Financial) Rules, 2011 (S.I. 2011 No. 54).\n\nmakes transitional provision for procurement initiated before\nthe commencement of the legislation.\n\nprovides for the legislation to commence on a date to be fixed\nby Proclamation.\n\nviii\n\n"
}