{
  "bill_id": 275,
  "slug": "resolution-re-13925-mil-re-ansa-merchant-bank-ltd-and-consolidated-finance",
  "title": "Resolution re 13.925 mil re ANSA Merchant Bank Ltd and Consolidated Finance",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/cfcda4530fab07b2c8304dff5d09b7f1.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-02-28",
  "first_reading": "2018-02-28",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\n2018-02-22\n\nPARLIAMENT\n\nWHEREAS  by  virtue  of  section  3(1)  of  the  External  Loan  Act,  Cap  94D,  the\n\nGovernment of Barbados is authorised to borrow money outside of Barbados for such purposes\n\nand in such sums as are approved by resolution of  Parliament;\n\nAND WHEREAS by virtue of section 3(2) of the said Act, all borrowings thereunder\n\nshall be effected and secured by issue and sale of securities;\n\nAND WHEREAS by virtue of section 5(2) of the said Act, the principal of and the\n\ninterest on securities and any sinking fund payment required to be made under section 6(1) of the\n\nAct are hereby charged on and shall be payable out of the Consolidated Fund;\n\nAND WHEREAS the Government of Barbados deems it necessary to borrow up to\n\n$13.925 million in the currency of the United States of America on the international capital markets\n\nby the issue of securities arranged by ANSA Merchant Bank Limited with Consolidated Finance\n\nCompany Limited as Co-Arranger, on the terms and conditions set out in the Schedule to this Resolution;\n\nAND WHEREAS the borrowing is for the purpose of reﬁ nancing the existing debt\n\nobligations of the Government of Barbados;\n\n\f2\n\n  BE IT RESOLVED therefore that Parliament\n\n(a)   approve the borrowing of the said sum up to $13.925 million in the currency of\n\nthe United States of America on the international capital markets by the issue\n\nof securities arranged by ANSA Merchant Bank  Limited with Consolidated\n\nFinance Company Limited as Co-Arranger for the purpose herein mentioned;\n\nand\n\n(b)  approve the establishment of a sinking fund for the redemption of each issue\n\nof securities made under the said Act and for the moneys necessary to maintain\n\nand service that fund.\n\nAPPROVED  by  the  House  of  Assembly  this                                      day  of\n\n                                                , 2018.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                                  ,\n\n2018.\n\nPresident\n\n\f3\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nGovernment of Barbados\n\nFixed Rate Non-Callable Bonds\n\nIssuer:\n\nIssue:\n\nBond Issue Amount:\n\nUp to US$13.925 million\n\nArranger:\n\nCo-Arranger:\n\nUse of Proceeds:\n\nCurrency:\n\nCoupon:\n\nANSA Merchant Bank Limited\n\nConsolidated Finance Company Limited\n\nTo  refinance  the  existing  debt  obligations  of  the  Government  of\nBarbados.\n\nUnited States Dollars\n\nSeries 1A-Fixed at 7.95% p.a.\n\nTerm of Maturity:\n\n6 years from the ﬁ rst disbursement date of Series 1A.\n\nBasis:\n\nIssue Price:\n\n30/360 day basis\n\nSeries 1A-98.93%\n\nPrincipal and Interest Repayment:\n\n(1)\n\nInterest Payments on Series 1A to be paid on a semi-annual basis in\narrears commencing 6 months after the issue date.\n\n(2)\n\nPrincipal  to  be  repaid  in  12  equal  semi-annual  instalments\ncommencing 6 months following disbursement.\n\nFacility:\n\nRefers to the issuance of the bonds.\n\nConditions Precedent:\n\nThe  execution  of  this  transaction  will  be  subject  to  the  fulﬁ lment  of  the\nconditions precedent which are set out as follows:\n\n(1)   Absence  of  any  material  adverse  change  in  the  ﬁ nancial,  political,\neconomic or other conditions in Barbados and Trinidad and Tobago\nthat  in  the  sole  opinion  of  the Arranger,  may  affect  the  successful\ndisbursement and syndication of the Facility between the date of the\nproposal and the closing date.\n\n\fConditions Precedent: - (Concl'd)\n\nOther Conditions:\n\n# 4\n\n(2)   The  successful  negotiation,  preparation  and  execution  of  a  ﬁ nal\ndeﬁ nitive  agreement  with  respect  to  the  Facility,  such  arrangement\nbeing  satisfactory  to  the Arranger  at  their  sole  discretion  and  the\nsatisfaction  of  all  conditions  contained  therein.  The  Arranger\nwill  be  bound  to  arrange  the  Facility  on  the  terms  and  conditions\nreferred to in this Schedule only after the execution of the ﬁ nal Facility\nArrangements and to the extent of the successful syndication of the\nFacility.\n\n(3)   The non-occurrence of material changes in the ﬁ nancial condition or\nprospects of the Issuer prior to the closing date that may be expected in\nthe sole opinion of the Arranger to an adverse impact on the marketing\nof the Facility.\n\n(4)\n\nPresentation,  execution,  delivery  and  perfection  of  all  transaction\ndocumentation  prior  to  ﬁ nal  disbursement  in  a  form  and  substance\nsatisfactory  to  the  Arranger  and  their  counsel,  incorporating\nsubstantially the terms and conditions referred to above.\n\n(5)   Exchange  Control Authority  approval  to  remit  payments  in  United\n\nStates dollars.\n\n(6)   Approval of the Arranger’s Credit and Investment Committee.\n\n(7)\n\nSubmission of ﬁ nancial information as may be required by the Arranger.\nAll ﬁ nancial information to be assessed and deemed satisfactory in the\nsole opinion of the Arranger.\n\n(8)   The Facility must be pre-sold prior to disbursement.\n\n(9)\n\nSatisfaction of all legislative requirements.\n\n(10)   Financial Service Commission or Inspector of Financial Institutions\n\napproval where required.\n\n(11)   Any other conditions as are standard for Facilities of this nature and\n\nas recommended by the Arranger’s Legal Counsel.\n\nShould  there  be  a  deterioration  in  the  credit  rating  of  the  Government  of\nBarbados prior to execution, the interest rate may be adjusted to reﬂ ect the\nchange in credit rating or outlook in the minimum increments of 0.25% p.a.\nper change or outlook.\n\n\f5\n\nCovenants  and Other Conditions:\n\nStandard, general covenants as are usual in a Facility of this size and nature\nto be included in the Trust Deed.\n\nArrangement fee:\n\nSixty basis points (0.60%) of the face value of the bonds payable upon initial\ndisbursement of Series 1A.\n\nFees:\n\nTaxes:\n\nThe fees for the Trustee, Registrar, Paying Agent and Legal Services are to\nbe negotiated and capped for the account of the Issuer.\n\n(1)  All  payments  of  principal,  interest  and  all  other  amounts  shall  be\nmade in United States Dollars and will be paid without withholding or\ndeductions for or on account of any taxes imposed by any Government\nincluding the Government of Barbados.\n\n(2)   Where any taxes are payable by investors or lenders, the Issuer will\nincrease the amount due such that the amount paid, after deduction\nfor such taxes or withholding, will equal the amount that would have\nbeen paid had there been no such taxes.\n\nGoverning Law:\n\nBarbados\n\n\f6\n\nADDENDUM\n\nThe  Resolution  seeks  the  approval  of  Parliament  for  the  borrowing  of  the  said  sum\n\nup  to  $13.925  million  in  the  currency  of  the  United  States  of America  on  the  international\n\ncapital  markets  by  the  issue  of  securities  arranged  by ANSA  Merchant  Bank  Limited  with\n\nConsolidated Finance Company Limited as Co-Arranger for the purpose of reﬁ nancing the existing\n\ndebt obligations of the Government of Barbados.\n\n"
}