{
  "bill_id": 27,
  "slug": "electronic-transactions-amendment-act-2014",
  "title": "Electronic Transactions (Amendment) Act 2014",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/abebbcf80e26815632d4b130d9906644.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2014-06-11",
  "first_reading": "2014-06-18",
  "second_reading": "2014-06-11",
  "gazette_date": "2014-04-21",
  "passed_date": "2014-06-18",
  "markdown": "2014-03-17\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Electronic Transactions Act, Cap. 308B to make\n\nprovision for the improvement of the administration of the Act.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 2 of Cap. 308B\n\nAmendment of Cap. 308B\n\nAmendment of Cap. 308B\n\nAmendment of section 16 of Cap. 308B\n\nAmendment of Cap. 308B\n\nAmendment of Cap. 308B\n\nAmendment of section 20 of Cap. 308B\n\nAmendment of section 24 of Cap. 308B\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Electronic Transactions Act to make provision for the\n\nimprovement of the administration of the Act.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nAct, 2014.\n\nThis Act may be cited as the Electronic Transactions (Amendment)\n\nAmendment of section 2 of Cap. 308B\n\n2.\nas the principal Act, is amended by\n\nSection 2 of the Electronic Transactions Act, in this Act referred to\n\n(a)\n\ndeleting  the  definitions  of  “accredited  certificate”,  “authorized\ncertification service provider” and “certification service provider”;\nand\n\n(b)\n\ninserting,  in  the  appropriate  alphabetical  order,  the  following\ndefinitions:\n\n“ “accredited certificate” means an electronic record that\n\n(a)\n\n(b)\n\n(c)\n\nassociates a signature verification device to a person;\n\nconfirms the identity of that person; and\n\nis issued by a certification service provider;\n\n“certification service provider” means a person who\n\n(a)\n\nissues identity certificates for the purposes of electronic signatures or\nprovides other services to the public related to electronic signatures\nand associates a signature verification device to a person; and\n\n(b)\n\nis  licensed  in  accordance  with  section  18  to  provide  accredited\ncertificates;\n\n“encryption”  means  the  scrambling  of  a  wire  communication,  electronic\ncommunications  or  electronically  stored  information  using  mathematical\nformulae or algorithms in order to preserve the confidentiality, integrity or\nauthenticity  of  such  communication  or  information  and  to  prevent\nunauthorised recipients from altering such communication or information;\n\n\f5\n\n“Supervisor” means the Supervisor of Certification Authorities appointed by the\n\nMinister under section 18A;”.\n\nAmendment of Cap. 308B\n\n3.\nThe  principal  Act  is  amended  by  deleting  the  words  “authorized\ncertification  service  provider”  wherever  they  may  appear  in  the  Act  and\nsubstituting the words “certification service provider”.\n\nAmendment of Cap. 308B\n\n4.\n12, the following new section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Mistakes in partly automated transactions\n\n12A.\nautomated source of information has no legal effect where\n\nAn electronic transaction between an individual and another person’s\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe individual makes a material error in the electronic information or\nan electronic document used in the transaction;\n\nthe automated source of information does not give the individual an\nopportunity to prevent or correct the error;\n\non becoming aware of the error, the individual promptly notifies the\nother person; and\n\nin a case where consideration is received as a result of the error, the\nindividual\n\n(i)\n\n(ii)\n\nreturns or destroys the consideration in accordance with the other\nperson’s instructions; or\n\nwhere there are no instructions from the other person, deals with\nthe  consideration  in  a  reasonable  manner  and  does  not  benefit\nmaterially by receiving the consideration.”.\n\n\f6\n\nAmendment of section 16 of Cap. 308B\n\n5.\n(b) and substituting the following:\n\nSection 16 of the principal Act is amended by deleting subsection (2)\n\n“(b)\n\nwhere  the  addressee  has  not  designated  an  information  processing\nsystem, receipt occurs when an electronic record of an information-\nprocessing system of the addressee is entered or is otherwise retrieved\nby or comes to the attention of the addressee.”\n\nAmendment of Cap. 308B\n\n6.\n16, the following new section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Consumer protection\n\n16A.(1)\nA  person  who  uses  electronic  communications  to  sell  goods  or\nservices to consumers shall provide accurate, clear and accessible information\nabout that person with respect to the following matters:\n\n(a)\n\n(b)\n\nthe legal name, principal mailing address and a telephone number or\nan electronic means of contact;\n\na prompt, easy and effective means of communicating with consumers;\nand\n\n(c)\n\nsufficient and accurate information to facilitate service of legal process.\n\nA person who uses electronic communications to sell goods or services to\n\n(2)\nconsumers shall provide\n\n(a)\n\naccurate and accessible information describing the goods or services\noffered  in  a  manner  that  enables  consumers  to  make  an  informed\ndecision about the proposed transaction; and\n\n\f7\n\n(b)\n\ninformation  about  the  terms,  conditions  and  costs  associated  with  a\ntransaction including\n\n(i)\n\nthe terms, conditions and methods of payments; and\n\n(ii)\n\nthe details of and conditions related to withdrawals, termination,\nreturn, exchange, cancellation and refund policy information.”.\n\nAmendment of Cap. 308B\n\n7.\nthe following new sections as sections 18 and 18A:\n\nThe principal Act is amended by deleting section 18 and substituting\n\n“Licence to operate as a certification service provider\n\n18.(1)\napply to the Minister for a licence for the purpose in the prescribed manner.\n\nA person who seeks to operate as a certification service provider shall\n\n(2)\nA person who operates as a certification service provider without a licence\nto do so, is guilty of an offence and is liable on indictment to a fine of $20 000\nor to a term of imprisonment of 12 months or to both.\n\nSupervision of certification authorities\n\nThe Minister shall appoint a Supervisor of Certification Authorities\n18A.(1)\nfor the purposes of this Act and, in particular for the purposes of advising the\nMinister  on  issues  related  to  licensing  and  for  monitoring  and  overseeing  the\nactivities of certification authorities.\n\nThe Supervisor shall maintain a publicly accessible database containing a\n(2)\ncertification authority disclosure record for each licensed certification authority\nwhich shall contain all the particulars required under the regulations made under\nthis Act.\n\nIn the application of the provisions of this Act to certificates issued by the\n(3)\nSupervisor and digital signatures verified by reference to those certificates, the\nSupervisor shall be deemed to be a licensed certification authority.”.\n\n\f8\n\nAmendment of section 20 of Cap. 308B\n\nSection 20(3) of the principal Act is amended in paragraph (b) by\n8.\ndeleting the word “damages” appearing in the penultimate line thereof and\nsubstituting the word “damage”.\n\nAmendment of section 24 of Cap. 308B\n\nSection 24(2) of the principal Act is amended by deleting the word\n9.\n“may” appearing in the second line thereof and substituting the word “shall”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2014.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2014.\n\nPresident\n\n"
}