{
  "bill_id": 283,
  "slug": "barbados-revenue-authority-amendment-bill-2018",
  "title": "Barbados Revenue Authority (Amendment) Bill, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/326880842327375871316c32f623942d.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-06-20",
  "first_reading": "2018-06-27",
  "gazette_date": "2018-06-20",
  "markdown": "Explanatory Memorandum after page 9\n\n2018-06-08\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Barbados Revenue Authority Act (Act 2014-1) to\nrepeal the system for the issuance of tax clearance certificates and for related\nmatters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of section 2 of Act 2014-1\n\nRepeal of section 8A of Act 2014-1\n\nAmendment to certain enactments\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Barbados Revenue Authority Act (Act 2014-1) to repeal\nthe system for the issuance of tax clearance certificates and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment) Act, 2018.\n\nThis  Act  may  be  cited  as  the  Barbados  Revenue  Authority\n\nAmendment of section 2 of Act 2014-1\n\nSection 2 of the Barbados Revenue Authority Act, in this Act referred\n2.\nto as the principal Act, is amended by deleting the definition “tax clearance\ncertificate”.\n\nRepeal of section 8A of Act 2014-1\n\n3.\n\nSection 8A of the principal Act is deleted.\n\nAmendment to certain enactments\n\n4.\namended in the manner set out opposite thereto in the second column.\n\nThe  enactments  set  out  in  the  first  column  of  the  Schedule  are\n\n\f5\n\nColumn 1Enactments1.Land Tax Act,  Cap. 782.Liquor Licences Act, Cap. 182Column 2Amendments1.In section 41, delete  subsection (1) and  substitute thefollowing:“(1)Subject to subsection (1A), the Registrarshall not stamp as duly stamped or as notchargeable with any duty under the  Stamp DutyAct, Cap. 91 any conveyance of land or any lease ofland for a period exceeding 3 years unless there isproduced to him(a)a valid certificate issued by theRevenue Commissioner(i)certifying that all tax due on theland has been paid or that no taxis due on the  land;(ii)bearing the date of its issue; and(iii)stating a period from the date ofits issue for which it shall bevalid; and(b)a copy of the notification of change ofpossession given to the Commissionerunder section 31 of the Land ValuationAct, Cap. 229A bearing a stampdenoting that the Commissioner is inreceipt of the original notification.”.2.In section 30, delete subsections (2), (3) and (4) andsubstitute the following:“(2)Subject to subsection (4), no applicationfor the renewal of a licence of the class specified inparagraph (b), (d), (e), (g) or (h) of section 4(1)shall be granted unless the applicant furnishes tothe licensing authority certificates from theRevenue Commissioner and the Director of NationalInsurance stating that all liabilities for the paymentof income tax, land tax, value added tax andnational insurance contributions in respect of thebusiness or trade to which the application for therenewal of the licence relates have been discharged.SCHEDULECONSEQUENTIAL AMENDMENTS(Section 4)\f6\n\nColumn 1Enactments2.Liquor Licences Act, Cap. 182(Concl’d)3.Property Transfer Tax Act, Cap. 84AColumn 2Amendments(3)The Revenue Commissioner or theDirector of National Insurance shall issue acertificate referred to in subsection (2) if he issatisfied that all liabilities for the payment of tax ornational insurance contributions, as the case maybe, have been discharged.(4)Where an applicant for the renewal of aliquor licence  is not the fee simple owner of premiseson which is located the business or trade to whichthe application for renewal relates, the requirementcontained in subsection (2) for a certificate from theRevenue Commissioner with respect to the paymentof land tax, shall not apply to such an applicant.”.3.In section 13,(a)delete sub-paragraph (iii) of  subsection (1)and substitute the following:“(iii)subject to subsections (2) and(3) and in respect of a transferwhere the transferor is a personto whom section 48(3) of theValue Added Tax Act, Cap. 87applies, there is presented to theRegistrar a certificate issued bythe Revenue Commissionerstating that(A)no input tax has beenpreviously allowed undersection 46(2) of the ValueAdded  Tax Act, Cap. 87; or(B)input tax previouslyallowed under section 46(2)of the Value Added Tax Act,Cap. 87 has been  repaid tothe Revenue Commissionerin accordance with section48(4) of the  Value AddedTax Act, Cap. 87, orsecurity satisfactory to theRevenue Commissioner hasbeen given for the paymentthereof.”.Schedule (Cont’d)\f7\n\nColumn 2Amendments(b)delete subsection (3) and substitute thefollowing:“(3)Where the declaration referredto in subsection (2) states that no inputtax has been allowed, a certificate of theRevenue Commissioner referred to insub-paragraph (iii) of subsection (1) isnot required to be presented to theRegistrar in accordance with that sub-paragraph.”.4.In section 13A, delete subsection (2) and substitute thefollowing:“(2)The  stamp of the Registrar on adocument or instrument of transfer denoting theissue by the Revenue Commissioner of a certificateunder sub-paragraph (iii)(B) of section 13(1) shalloperate to release the land from the charge undersubsection (1).”.Column 1Enactments3.Property Transfer Tax Act, Cap. 84A(Concl’d)Schedule (Concl’d)\f8\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n\fEXPLANATORY MEMORANDUM\n\nClause 1:\n\nstates the short title by which the Act may be cited.\n\nClause 2:\n\ndeletes the term “tax clearance certificate”.\n\nClause 3:\n\nClause 4:\n\ndeletes  section  8A  which  provided  for  the  issuance  of  tax\nclearance certificates by the Revenue Commissioner.\n\nsets out the consequential amendments to the Land Tax Act,\nCap. 78A, the Liquor Licences Act, Cap. 182 and the Property\nTransfer  Tax  Act,  Cap.  84A  to  delete  references  to  tax\nclearance  certificates  and  to  provide  for  the  specific\ncircumstances in which discrete certificates are required.\n\ni\n\n"
}