{
  "bill_id": 287,
  "slug": "airport-service-charge-amendment-bill-2018",
  "title": "Airport Service Charge (Amendment) Bill, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/8a41484699fcb867b192fa05621c0cb2.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-07-25",
  "first_reading": "2018-07-30",
  "gazette_date": "2018-07-30",
  "markdown": "2018-07-19\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Airport Service Charge Act, Cap. 59 to provide for\n\nan increase of the airport service charge.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\nShort title\n\nAmendment of section 2 of Cap. 59\n\nAmendment of section 3 of Cap. 59\n\nRepeal and replacement of section 4 of Cap. 59\n\nAmendment of section 6 of Cap. 59\n\nCommencement\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Airport Service Charge Act, Cap. 59 to provide for an\n\nincrease of the airport service charge.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nAct, 2018.\n\nThis Act may be cited as the Airport Service Charge (Amendment)\n\nAmendment of section 2 of Cap. 59\n\n2.\nas the principal Act, is amended by\n\nSection 2 of the Airport Service Charge Act, in this Act referred to\n\n(a)\n\n(b)\n\ndeleting the definition of the word “Airport service charge” and the\nword “traveller”;\n\ninserting  the  following  definitions  in  the  appropriate  alphabetical\norder:\n\n“ “airport service charge” or “charge” means the charge imposed by\n\nsection 3;\n\n“Community” means the Caribbean Community established by Article\n2  of  the  Revised  Treaty  of  Chaguaramas  and  includes  the\nCARICOM  Single  Market  and  Economy  signed  at  Nassau,  the\nBahamas on 5th July, 2001;”; and\n\n(c)\n\ndeleting  the  semi-colon  appearing  after  the  definition  of  the  word\n“immigration officer” and substituting a full stop.\n\nAmendment of section 3 of Cap. 59\n\n3.\nand the following is substituted:\n\nSection 3 of the principal Act is amended by deleting subsection (1)\n\nThere shall be imposed a charge to be known as the airport service\n\n“(1)\ncharge and where a person travels from the Airport to a place\n\n(a)\n\nwithin the Community, he shall pay the airport service charge\nof $70; or\n\n\f5\n\n(b)\n\noutside of the Community, he shall pay the airport service\ncharge of $140.”.\n\nRepeal and replacement of section 4 of Cap. 59\n\n4.\nsubstituted:\n\nSection  4  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Duty of carrier\n\n4.(1)\nA carrier transporting from Barbados to a place within the\nCommunity or outside of the Community, a person on whom the airport\nservice charge is payable, shall collect the charge from that person and\npay it over to the Collector after deducting for his own use a commission\nof 2.5 per cent of the amount of the charge.\n\n(2)\nA carrier failing to collect the airport service charge as required\nby  subsection  (1)  shall,  notwithstanding  that  failure,  pay  to  the\nCollector the amount of the charge required to be paid in accordance\nwith subsection (1).\n\nThe amount which a carrier is required to pay to the Collector\n(3)\npursuant to this section shall be due and payable without further demand\nimmediately  before  the  departure  from  the  Airport  of  the  aircraft\ntransporting the person in respect of whom that amount is payable or\nwithin such period after the departure of the aircraft and in such manner\nand subject to such conditions as may be prescribed either generally or\nin any particular case.\n\nA carrier shall, in relation to the airport service charge, keep such\n(4)\nrecords and furnish such returns in such form and to such persons as\nmay be prescribed.\n\nA claim to entitlement to an exemption from the airport service\n(5)\ncharge pursuant to subsection (2) of section 3 which cannot be resolved\n\n\f6\n\nby the carrier shall be referred to an immigration officer and the decision\nof the immigration officer thereon shall, subject to section 8, be final.\n\nFor the purpose of deciding a claim pursuant to subsection (5),\n\n(6)\nan immigration officer may make such enquiries as he thinks fit.”.\n\nAmendment of section 6 of Cap. 59\n\n5.\ndeleting the word “travellers” and substituting the word “persons”.\n\nSection  6  of  the  principal  Act  is  amended  in  paragraph  (b)  by\n\nCommencement\n\n6.\n\nThis Act shall come into operation on the 1st day of October, 2018.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n"
}