{
  "bill_id": 289,
  "slug": "central-bank-of-barbados-amendment-act-2018",
  "title": "Central Bank of Barbados (Amendment) Act, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/8b9d23d8e55419b594fcb5661b9a743f.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-07-27",
  "first_reading": "2018-07-30",
  "gazette_date": "2018-07-27",
  "markdown": "2018-07-24\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Central Bank of Barbados Act, Cap. 323C to limit\nthe  power  of  the  Central  Bank  to  purchase  securities  or  other  forms  of\nGovernment  indebtedness  issued  or  guaranteed  by  the  Government,  its\ninstitutions, agencies and statutory boards.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nAmendment of section 46 of Cap. 323C\n\nCommencement\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Central Bank of Barbados Act, Cap. 323C.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\nAct, 2018.\n\nThis Act may be cited as the Central Bank of Barbados (Amendment)\n\n\f4\n\nAmendment of section 46 of Cap. 323C\n\n2.\ndeleting section 46 and substituting the following:\n\nThe  Central  Bank  of  Barbados  Act,  Cap.  323C  is  amended  by\n\n“Limit on indebtedness\n\n46.\nThe Bank may in any financial year purchase or otherwise\nacquire, on a primary issue, notes, bills, securities and other evidences\nof  indebtedness  issued  or  guaranteed  by  the  Government,  its\ninstitutions, agencies and statutory boards up to a nominal value of ten\nper  cent  of  the  estimated  expenditure  of  the  Government  in  that\nfinancial year, or such other percentage as the House of Assembly may\nfrom time to time by resolution approve.”.\n\nCommencement\n\n3.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f5\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n"
}