{
  "bill_id": 294,
  "slug": "sanitation-service-authority-amendment-bill-2018",
  "title": "Sanitation Service Authority (Amendment) Bill, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/adf3ee9100b10966885f9d029cc64be9.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2018-08-14",
  "first_reading": "2018-08-14",
  "gazette_date": null,
  "markdown": "2018-07-24\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Sanitation Service Authority Act, Cap. 382 to make\nprovision for the receipt of monies from the Barbados Water Authority in respect\nof a garbage and sewage contribution levy.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nAmendment of Section 4 of Cap. 382\n\nInsertion of Part II A into Cap. 382\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Sanitation Service Authority Act, Cap. 382 to make\nprovision  for  the  receipt  of  monies  from  the  Barbados  Water  Authority  in\nrespect of a garbage and sewage contribution levy.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment) Act, 2018.\n\nThis  Act  may  be  cited  as  the  Sanitation  Service  Authority\n\nAmendment of Section 4 of Cap. 382\n\n2.\nAct referred to as the principal Act, is amended in subsection (1)\n\nSection 4 of the Sanitation Service Authority Act, Cap. 382 in this\n\n(a)\n\nby deleting the full stop appearing at the end of paragraph (e) and\ninserting a semi-colon; and\n\n(b)\n\nby inserting immediately after paragraph (e), the following:\n\n“(f)\n\nto receive, administer and account for monies collected by\nthe Barbados Water Authority, being a portion of the garbage\nand  sewage  contribution  levy  paid  to  that  Authority  in\naccordance with Part VA of the Barbados Water Authority\nAct, Cap. 274A.”.\n\nInsertion of Part II A into Cap. 382\n\n3.\nII, the following:\n\nThe principal Act is amended by inserting immediately after Part\n\n“PART II A\n\nFUNDS OF THE AUTHORITY\n\n10A.(1)\n\nThe funds of the Authority shall consist of such amounts\n\n(a)\n\n(b)\n\nas may be voted for the purpose by Parliament;\n\nas accrue from the operations of the Authority;\n\n\f5\n\n(c)\n\n(d)\n\nas  may  be  paid  to  the  Authority  by  the  Barbados  Water\nAuthority  as  the  Authority’s  portion  of  the  garbage  and\nsewage  contribution  levy  as  stated  in  Part  VA  of  the\nBarbados Water Authority Act, Cap. 274A;\n\nas the Authority borrows or as become available from sources\napproved  by  the  Minister  other  than  those  referred  to  in\nparagraphs (a), (b) and (c).\n\nSubject  to  subsection  (3)  the  Authority  may  borrow  amounts\n(2)\nrequired by it for meeting any of the obligations or performing any of\nthe functions of the Authority.\n\nThe power conferred on the Authority by subsection (2) may only\n\n(3)\nbe exercised with the approval of the Minister, who shall stipulate\n\n(a)\n\n(b)\n\nthe amount and source of the loan; and\n\nthe terms and conditions on which the loan may be effected\n\nand the approval may either be general or limited to a particular\nloan.\n\nGuarantee\n\n10B.\nThe Crown may by resolution of both Houses of Parliament,\nguarantee in such manner and on such terms and conditions as it so\ndetermines  the  payment  of  any  amount  borrowed  by  the  Authority,\ntogether with the interest payable on the amount.\n\nApplication of funds\n\n10C.\nadministration of this Act.”.\n\nThe  funds  of  the  Authority  are  to  be  applied  towards  the\n\n\f6\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n"
}