{
  "bill_id": 295,
  "slug": "law-revision-and-law-reform-act-2018",
  "title": "Law Revision and Law Reform Act, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/60bb341be2fd808c6809234b545a990b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-10-10",
  "first_reading": "2019-01-23",
  "gazette_date": "2019-01-23",
  "markdown": "Explanatory Memorandum after pages 25\n\nCertified Draft 2017-12-01\n\nOBJECTS AND REASONS\n\nThis Bill would\n\n(a)\n\nrepeal and replace the Law Revision Act to\n\n(i)\n\n(ii)\n\nmodernize the system of revising, consolidating and editing the\nLaws of Barbados;\n\nmake  provision  for  the  Laws  of  Barbados  to  be  in  electronic\nformat and authorise such changes to be made as are necessary\nto facilitate that format;\n\n(iii)\n\nprovide for the preparation and publication of a revised edition\nof the Laws of Barbados whenever the need arises;\n\n(b)\n\nmake provision for the review and reform of the laws by a Law Reform\nCommission; and\n\n(c)\n\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\nPART II\n\nLAW REVISION\n\nShort title\n\nInterpretation\n\nAppointment of a Law Revision Commissioner\n\nResponsibilities of the Law Revision Commissioner\n\nPreparation of electronic databases\n\nPowers exercisable by the Law Revision Commissioner in maintaining the\nCumulative Edition\n\nGeneral powers exercisable by the Law Revision Commissioner\n\nRectification of errors in laws\n\nRectification of errors in laws before consolidation\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nNo power to make alterations of substance\n\n11.\n\nBill to be drafted to correct errors of substance\n\n\f3\n\n12.\n\nRevision of fees and fines\n\n13.\n\nPowers of Law Revision Commissioner to omit provisions\n\n14.\n\nSaving of omitted laws\n\n15.\n\nBringing into force and validity of revised edition\n\n16.\n\nPublication and printing of the Laws of Barbados\n\n17.\n\nCertification of copies of laws\n\n18.\n\nValidity of the Laws of Barbados\n\n19.\n\nConstruction of references where laws are repealed and replaced\n\n20.\n\nRetention of revised edition for the purposes of record\n\n21.\n\nAnnual retention of hard copies of amended and repealed laws for the\npurposes of record\n\n22.\n\nCopies of updated laws to be distributed\n\n23.\n\nRequest to remake subsidiary legislation\n\n24.\n\nRectification of omissions from the Laws of Barbados\n\n25.\n\nAssistance with law revision\n\n26.\n\nAssistance with a revised edition\n\n27.\n\nLaw revision reports\n\n28.\n\nDistribution and sale of the Laws of Barbados\n\n\f4\n\nPART III\n\nLAW REFORM\n\n29.\n\nLaw Reform Commission\n\n30.\n\nStaff to assist the Law Reform Commission\n\n31.\n\nFunctions and powers of the Law Reform Commission\n\n32.\n\nConsultation of persons and appointment of specialised committees\n\n33.\n\nLaw reform programme\n\n34.\n\nSubmission of report by Law Reform Commission\n\nPART IV\n\nGENERAL\n\n35.\n\nExpenses\n\n36.\n\nTransitional\n\n37.\n\nRepeal of Cap. 2\n\n38.\n\nCommencement\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to make new provision for law revision and law reform and provide\n\nfor related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n2018.\n\nThis  Act  may  be  cited  as  the  Law  Revision  and  Law  Reform  Act,\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“consolidation” means the incorporation of amendments to an enactment into the\n\nprincipal enactment by the Law Revision Commissioner;\n\n“Cumulative Edition” means the revised edition as consolidated and revised from\ntime to time by the Law Revision Commissioner in accordance with section\n4(b);\n\n“database”  means  the  relevant  database  of  the  Laws  of  Barbados  established\n\nunder section 5;\n\n“existing Cumulative Edition” means\n\n(a)\n\n(b)\n\nin  the  case  of  statutes,  the  1971  revised  edition  of  the  statutes  of\nBarbados; and\n\nin the case of subsidiary legislation, the 1978 revised edition of the\nsubsidiary legislation of Barbados\n\nas  revised  and  in  force  under  the  former  Act  immediately  before  the\ncommencement of this Act;\n\n“law” means an enactment;\n\n“Laws of Barbados” means the Acts and subsidiary legislation of Barbados as\n\nrevised and consolidated by the Law Revision Commissioner;\n\n\f7\n\n“Law Reform Commission” means the Commission established under section\n\n29;\n\n“Law Reform Commissioner” means a Commissioner appointed under section\n\n29;\n\n“Law Revision Commissioner” means the person appointed under section 3;\n\n“revised edition” means any edition of the revised Laws of Barbados prepared\n\nunder section 4(a).\n\nPART II\n\nLAW REVISION\n\nAppointment of a Law Revision Commissioner\n\n3.(1)\n\nThere shall be a Law Revision Commissioner who\n\n(a)\n\n(b)\n\nshall be an attorney-at-law of not less than 10 years standing; and\n\nshall have not less than 7 years experience as a legislative drafter.\n\nThe post of Law Revision Commissioner shall be established in accordance\n\n(2)\nwith the Public Service Act, Cap. 29.\n\nThe Law Revision Commissioner shall be assisted by such staff, appointed\n(3)\nin accordance with subsection (4), as is required for the purpose of carrying out\nthe functions of the Commissioner under this Act.\n\nThe offices of the staff required for the purposes of subsection (3) shall be\n\n(4)\nestablished in accordance with the Public Service Act, Cap. 29.\n\nResponsibilities of the Law Revision Commissioner\n\n4.\n\nThe Law Revision Commissioner shall\n\n(a)\n\nbe responsible for preparing and publishing a revised edition of the\nLaws of Barbados where a revised edition is required;\n\n\f8\n\n(b)\n\nbe responsible for maintaining the Cumulative Edition by revising and\nconsolidating  the  laws  at  any  interval  which  the  Commissioner\nconsiders to be appropriate;\n\n(c)\n\nbe  responsible  for  updating  the  databases  established  pursuant  to\nsection 5(2); and\n\n(d)\n\nperform such other duties as are provided for in this Act.\n\nPreparation of electronic databases\n\n5.(1)\nthe following electronic databases:\n\nThe Law Revision Commissioner shall be responsible for establishing\n\n(a)\n\n(b)\n\n(c)\n\na database of the existing Cumulative Edition;\n\na database of any revised edition prepared after the commencement of\nthis Act;\n\na  database  of  annual  laws  commencing  from  any  period  as  is\nappropriate;\n\n(d)\n\na database of omitted laws; and\n\n(e)\n\na  database  of  repealed  laws  commencing  from  any  period  as  is\nappropriate.\n\nThe Law Revision Commissioner shall maintain and update the databases\n\n(2)\nreferred to in subsection (1).\n\nThe  Law  Revision  Commissioner  may  publish  the  revised  edition,  the\n(3)\nCumulative Edition or any of the databases prepared under subsection (1) on the\nInternet or in any other electronic format.\n\nThe Law Revision Commissioner shall be responsible for the protection\n(4)\nof the databases and shall put such measures in place as are necessary for the\nprotection of the databases.\n\n\f9\n\nPowers exercisable by the Law Revision Commissioner in maintaining\nthe Cumulative Edition\n\n6.(1)\n4(b), the Law Revision Commissioner may\n\nFor the purposes of maintaining the Cumulative Edition under section\n\n(a)\n\nestablish  such  tables,  indices  and  lists  as  the  Commissioner  thinks\nappropriate;\n\n(b)\n\nmake such modifications as the Commissioner sees fit to\n\n(i)\n\nthe table of contents;\n\n(ii)\n\nthe chronological table of Acts;\n\n(iii)\n\nany other existing table; or\n\n(iv)\n\nany index;\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nreorganize  the  Cumulative  Edition  in  any  sequence  or  group  as  the\nCommissioner sees fit;\n\nalter any sequence or group in which the Cumulative Edition has been\narranged, including the removal of any law from a sequence or group;\n\nassign new chapter numbers to the laws in the Cumulative Edition as\nconsidered appropriate by the Commissioner; or\n\ntransfer any law contained in any Volume or Title of the Cumulative\nEdition to any other Volume or Title to which, in the opinion of the\nCommissioner, it more properly belongs.\n\nFor  the  purposes  of  printed  copies  of  the  Cumulative  Edition,  the  Law\n(2)\nRevision Commissioner shall prepare appropriate instructions with regard to the\nlaws which are to be removed or inserted in the Edition.\n\nThe Law Revision Commissioner shall annotate the Laws of Barbados by\n(3)\nmeans  of  historical  or  explanatory  notes  or  in  any  other  manner  that  the\nCommissioner considers appropriate for the purpose of indicating to users that a\nprovision in a law has been consolidated or revised.\n\n\f10\n\nGeneral powers exercisable by the Law Revision Commissioner\n\nSubject to section 8, the Law Revision Commissioner shall have the\n7.\nfollowing powers for the purposes of preparing a revised edition or maintaining\nthe Cumulative Edition:\n\n(a)\n\n(b)\n\nto consolidate the laws by incorporating into any law the amendments\nmade to it by any other law;\n\nto consolidate into one law any two or more laws in pari materia, or\nto divide into two or more laws, any law the provisions of which are\nnot in pari materia, and\n\n(i)\n\nmaking  such  alterations  as  in  the  opinion  of  the  Law  Revision\nCommissioner are necessary in the consolidated or, as the case\nmay be, the separated laws; and\n\n(ii)\n\nassigning  to  any  altered  or  separated  law  referred  to  in  sub-\nparagraph (i), such date as he thinks proper;\n\n(c)\n\nto alter the order of sections in any law and, where he thinks it necessary\nto do so, to renumber the sections of any law;\n\n(d)\n\nto alter the form or arrangement of any section of any law\n\n(i)\n\nby combining it in whole or in part with another section or other\nsections;\n\n(ii)\n\nby dividing it into two or more subsections; or\n\n(iii)\n\nby transposing words;\n\n(e)\n\n(f)\n\nto  divide  any  law,  whether  consolidated  or  not,  into  parts  or  other\ndivisions and to give to each such part or division a suitable heading;\n\nto transfer any provision contained in any law from that law to any\nother law to which, in the opinion of the Law Revision Commissioner,\nit more properly belongs;\n\n\f11\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\n(k)\n\n(l)\n\nto add a short title or citation to any law which, in the opinion of the\nLaw  Revision  Commissioner,  requires  it  and,  if  in  his  opinion  it  is\nnecessary, to alter the long title, short title or citation of any law;\n\nto clarify the language of any provision of any law appearing to the\nLaw Revision Commissioner to require such clarification;\n\nto shorten and simplify the phraseology of any enactment;\n\nto make such changes in any law as are required to reconcile seemingly\ninconsistent enactments;\n\nto frame and insert in any law, definitions of words and phrases used\ntherein and to substitute for definitions of words or phrases used in any\nlaw,  such  other  definitions  as  appear  to  the  Law  Revision\nCommissioner to be more appropriate;\n\nto  correct  grammatical,  typographical  and  other  like  mistakes  and\nomissions in the existing copies of laws and for that purpose, to make\nverbal additions, omissions or alterations not affecting the meaning of\nany law;\n\n(m)\n\nto supply or alter marginal notes or shoulder notes, as the case may be,\nand tables showing the arrangement of sections;\n\n(n)\n\n(o)\n\n(p)\n\n(q)\n\n(r)\n\nto correct cross-references in any law;\n\nto correct the punctuation in any law;\n\nto provide footnotes, explanatory notes or any other notes by way of\namplification;\n\nto make formal alterations as to names, localities, offices, titles and\notherwise as are necessary to bring the laws into conformity with the\ncircumstances of Barbados;\n\nto make such formal alterations to any law as are necessary for the\npurpose of securing uniformity of expression or style in the Laws of\nBarbados;\n\n\f12\n\n(s)\n\n(t)\n\nto rectify any error appearing in any law subject to the provisions of\nthis Act;\n\nto make adaptations or alterations to any law as appears to the Law\nRevision Commissioner to be necessary or proper as a consequence of\n\n(i)\n\nany change in the Constitution;\n\n(ii)\n\nany changes to Her Majesty’s dominions; or\n\n(iii)\n\nany  change  to  any  member  of  the  Commonwealth  or  in  the\ncomposition of the Commonwealth;\n\n(u)\n\nto do all such things relating to form and method as appears to the Law\nRevision Commissioner to be necessary for the perfecting of the Laws\nof Barbados.\n\nRectification of errors in laws\n\n8.(1)\nof the Law Revision Commissioner, and\n\nSubject to section 10, where any error in a law comes to the attention\n\n(a)\n\n(b)\n\nthe  Commissioner  is  of  the  view  that  the  error  is  a  minor  one,  the\nCommissioner shall forthwith rectify the error;\n\nthe Commissioner is of the view that the error is of significance, the\nCommissioner shall forthwith advise the Attorney-General of the error\nand  the  Attorney-General  shall  by  order,  to  be  known  as  a  Law\nRevision  Order,  rectify  the  error  by  setting  out  the  required\namendments to the law.\n\nAn order made under subsection (1)(b) may have retrospective effect as\n\n(2)\nfrom the date specified in the order.\n\nWhere  an  order  is  made  under  subsection  (1)(b),  the  Law  Revision\n(3)\nCommissioner shall make an appropriate note in the law to indicate that a change\nhas been made to the law.\n\n\f13\n\nRectification of errors in laws before consolidation\n\n9.(1)\nof the Law Revision Commissioner before that law is consolidated, and\n\nSubject to section 10, where any error in a law comes to the attention\n\n(a)\n\n(b)\n\nthe  Commissioner  is  of  the  view  that  the  error  is  a  minor  one,  the\nCommissioner shall rectify the error; or\n\nthe Commissioner is of the view that the error is of significance, the\nCommissioner may by notice to be known as a Law Revision Notice,\nrectify the error by setting out the required amendments to the law.\n\nA notice given under subsection (1) may have retrospective effect as from\n\n(2)\nthe date specified in the notice.\n\nWhere  a  notice  is  given  under  subsection  (1)(b),  the  Law  Revision\n(3)\nCommissioner shall, after consolidating the law, make an appropriate note in the\nlaw to indicate that a change was made to the law by a Law Revision Notice.\n\nNo power to make alterations of substance\n\n10.\nNothing in this Act shall empower the Law Revision Commissioner\nto make any alteration or amendment in the substance or otherwise affecting the\nmeaning of any law or provision of any law.\n\nBill to be drafted to correct errors of substance\n\n11.(1)\nNotwithstanding section 10, where in any case it appears necessary to\nthe  Law  Revision  Commissioner  to  alter  the  substance  of  any  law,  the\nCommissioner shall draft a Bill setting out the alterations and amendments.\n\nEvery Bill drafted pursuant to subsection (1) shall, if the Attorney-General\n\n(2)\napproves, be submitted to Parliament.\n\nRevision of fees and fines\n\nWhere  a  fee  or  a  fine  is  prescribed  in  an  enactment,  and  the  Law\n12.(1)\nRevision Commissioner is of the view that the fee or fine requires revising due\n\n\f14\n\nto the passage of time, the Commissioner shall advise the relevant ministry in\nwriting that the fee or fine, as the case may be, should be revised.\n\nWhere the Law Revision Commissioner advises the ministry pursuant to\n(2)\nsubsection (1), the ministry shall, as soon as possible, take the appropriate action\nto increase the fee or fine.\n\nPowers of Law Revision Commissioner to omit provisions\n\n13.(1)\nIn  the  preparation  of  a  revised  edition  and  for  the  purposes  of\nmaintaining the Cumulative Edition, the Law Revision Commissioner may omit\n\n(a)\n\n(b)\n\n(c)\n\nall laws or provisions of laws which have been repealed expressly or\nby necessary implication or which have expired or have become spent;\n\nany repealing provision in any law, and all tables or lists of repealed\nlaws,  whether  contained  in  schedules  or  otherwise  where  an\nappropriate explanatory note is provided;\n\nall preambles or parts of preambles and long titles to laws where such\nomission can, in the opinion of the Law Revision Commissioner, be\nconveniently made;\n\n(d)\n\nall words of enactment in any law or provision of any law;\n\n(e)\n\n(f)\n\n(g)\n\nany law prescribing the date when any law or a provision of a law is to\ncome into force where an appropriate explanatory note is provided;\n\nany  Appropriation  Act  or  any  law  that  in  the  opinion  of  the  Law\nRevision  Commissioner,  will  within  one  year  of  its  having  been\nbrought into force, have expired or become spent;\n\nany law which in the opinion of the Law Revision Commissioner is of\nlimited application and can conveniently be placed in the database of\nomitted laws.\n\nSection 29(1) of the Interpretation Act, Cap. 1 shall apply to expired or\n(2)\nspent laws omitted under subsection (1)(a) as if the law omitted or the provisions\nof the law omitted had been repealed.\n\n\f15\n\nWhere any law is omitted in its entirety under this section, the law shall be\n\n(3)\nplaced in the database of omitted laws.\n\nSaving of omitted laws\n\n14.\nNo law omitted from the Laws of Barbados under the authority of this\nAct or otherwise, shall be deemed to be without force and validity by reason only\nof its having been so omitted.\n\nBringing into force and validity of revised edition\n\n15.(1)\nthinks fit, shall come into operation on a day to be fixed by Proclamation.\n\nA revised edition or such part or parts thereof as the Attorney-General\n\nSubject to sections 14 and 18, the revised edition shall be for all purposes,\n(2)\nthe  sole  and  proper  statement  of  the  laws  enacted  or  brought  into  force  in\nBarbados prior to such day as is fixed by Proclamation under subsection (1).\n\nPublication and printing of the Laws of Barbados\n\n16.(1)\nthinks expedient for the publication and printing of the Laws of Barbados.\n\nThe Law Revision Commissioner shall make such arrangements as he\n\n(2)\n\nEvery page of the Laws of Barbados referred to in subsection (1),\n\n(a)\n\nwhen printed,\n\n(i)\n\nshall bear a statement indicating that it was printed by the authority\nof the Government of Barbados; and\n\n(ii)\n\nshall contain a footer with the words “Laws of Barbados”;\n\n(b)\n\nwhen in electronic format, shall bear a statement indicating that it is an\nofficial  version  of  the  law,  produced  by  the  authority  of  the\nGovernment of Barbados.\n\nParagraph (b) of subsection (2) does not apply to any unofficial publication\n\n(3)\nof the Laws of Barbados on the Internet.\n\n\f16\n\nCertification of copies of laws\n\n17.(1)\nIf  for  any  purpose  a  copy  of  any  law  contained  in  the  Cumulative\nEdition is required to be certified, the Law Revision Commissioner shall insert\nin a copy of that law, a certificate duly authenticated by him to the effect that\nsuch copy is a true copy of that law as contained in the Cumulative Edition.\n\n(2)\n\nAny person who\n\n(a)\n\n(b)\n\nprints or by electronic means produces; or\n\ntenders in evidence,\n\na copy of any law or a provision of any law which falsely purports to have been\nprinted or produced under the authority of the Government of Barbados is guilty\nof  an  offence  and  is  liable  on  summary  conviction  to  a  fine  of  $10,000  or  to\nimprisonment for a term of 5 years or to both.\n\nValidity of the Laws of Barbados\n\n18.(1)\nstatement of the laws and shall be in all courts.\n\nThe Laws of Barbados shall be for all purposes, the sole and proper\n\nThe Laws of Barbados shall not be held to operate as new laws, but shall\n(2)\nbe  construed  and  have  effect  as  a  consolidation  and  as  declaratory  of  the\nenactments that have been revised and published therein.\n\n(3)\n\nThe Laws of Barbados shall be judicially noticed.\n\nConstruction of references where laws are repealed and replaced\n\n19.\nWithout  prejudice  to  anything  contained  in  the  Interpretation  Act,\nCap. 1, a reference in any enactment to a provision of any law which by virtue\nof this Act has been embodied in the Laws of Barbados shall, in so far as it is\napplicable, be deemed to extend and apply to the corresponding provision of the\nLaws of Barbados.\n\n\f17\n\nRetention of revised edition for the purposes of record\n\n20.(1)\n\nThe Law Revision Commissioner\n\n(a)\n\n(b)\n\nshall cause 8 copies of any revised edition to be bound in volumes in\na permanent form;\n\nshall  certify  every  volume  of  each  copy  produced  under  paragraph\n(a)  to  contain  a  true  copy  of  the  revised  edition  prepared  by  the\nCommissioner; and\n\n(c)\n\nshall  deliver  a  copy  of  the  revised  edition  to  each  of  the  following\nauthorities:\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\nthe Governor-General;\n\nthe Clerk of Parliament;\n\nthe Attorney-General;\n\nthe Law Revision Commissioner;\n\nthe Registrar of the Supreme Court;\n\n(vi)\n\nthe Librarian in charge of the National Library Service;\n\n(vii)\n\nthe Law Librarian of the University of the West Indies;\n\n(viii)\n\nthe Chief Archivist.\n\nThe authorities mentioned in subsection (1) shall retain the copies of the\n\n(2)\nrevised edition for the purpose of record.\n\nIf  for  any  purpose  a  copy  of  any  law  contained  in  the  revised  edition\n(3)\nreferred to in subsection (1) is required to be certified, the Clerk of Parliament\nor the Law Revision Commissioner shall insert in a copy of that law, a certificate\nduly authenticated by that particular official to the effect that such copy is a true\ncopy of that law as contained in that revised edition.\n\n\f18\n\n(4)\n\nAny person who\n\n(a)\n\nprints or by electronic means produces; or\n\n(b)\n\ntenders in evidence,\n\na copy of any law or a provision of any law which falsely purports to have been\ncertified pursuant to this section is guilty of an offence and is liable on summary\nconviction to a fine of $10,000 or to imprisonment for a term of 5 years or to\nboth.\n\nAnnual retention of hard copies of amended and repealed laws for the\npurposes of record\n\nEvery  year  or  at  such  other  interval  as  the  Law  Revision\n21.(1)\nCommissioner  thinks  fit,  all  laws  which  are  repealed  or  which  have  been\nconsolidated or revised by the Commissioner shall be printed and bound in a\npermanent manner in one or more volumes.\n\nA copy of each volume referred to in subsection (1) shall be retained by\n(2)\nthe Law Revision Commissioner and a copy submitted to each of the following\nauthorities for the purposes of record:\n\n(a)\n\n(b)\n\n(c)\n\nthe Clerk of Parliament;\n\nthe Registrar of the Supreme Court;\n\nthe Chief Archivist;\n\n(d)\n\nthe Librarian in charge of the National Library Service;\n\n(e)\n\nthe Law Librarian of the University of the West Indies.\n\nThe  copy  retained  by  the  Law  Revision  Commissioner  and  every  copy\n(3)\nsubmitted to the authorities under subsection (2), shall be certified by the Law\nRevision Commissioner to contain a true copy of the laws which were removed\nfrom the Cumulative Edition.\n\nIf for any purpose a copy of any law contained in the publication referred\n(4)\nto  under  subsection  (1)  is  required  to  be  certified,  the  Law  Revision\n\n\f19\n\nCommissioner shall insert in a copy of that law, a certificate duly authenticated\nby him to the effect that such copy is a true copy of that law as formerly contained\nin the Cumulative Edition.\n\nCopies of updated laws to be distributed\n\nEvery  year,  or  at  such  other  interval  as  the  Law  Revision\n22.(1)\nCommissioner may think fit, all laws which have been consolidated or revised\nby the Commissioner shall be submitted to the following authorities:\n\n(a)\n\n(b)\n\n(c)\n\nthe Clerk of Parliament;\n\nthe Registrar of the Supreme Court;\n\nthe Director of the National Library Service;\n\n(d)\n\nthe Law Librarian of the University of the West Indies; and\n\n(e)\n\nthe Chief Archivist.\n\nIt shall be the duty of the Law Revision Commissioner and each of the\n(2)\nauthorities referred to in subsection (1) to update on an annual basis for the benefit\nof users, a printed set of the laws of the Cumulative Edition by replacing the laws\nwhich  have  been  consolidated  or  revised  by  the  Commissioner  with  the  laws\nsubmitted under subsection (1).\n\nEvery year, or at such other interval as the Law Revision Commissioner\n(3)\nmay think fit, the Law Revision Commissioner shall ensure that a copy of the\nCumulative Edition is updated for the use of the Governor-General, the Attorney-\nGeneral and the Law Revision Commissioner.\n\nRequest to remake subsidiary legislation\n\n23.(1)\nWhere an Act is repealed and replaced but the subsidiary legislation\nmade  under  the  former  Act  continues  in  force  and  the  Law  Revision\nCommissioner is of the opinion that the subsidiary legislation is substantially in\nconflict with the new Act, the Law Revision Commissioner may in writing advise\n\n\f20\n\nthe relevant ministry that the subsidiary legislation be revoked and subsidiary\nlegislation be made under the current Act.\n\nWhere the Law Revision Commissioner advises the ministry pursuant to\n(2)\nsubsection (1), the ministry shall, as soon as possible, take the appropriate action\nto remove the conflict.\n\nRectification of omissions from the Laws of Barbados\n\n24.(1)\nWhere an omission from the Laws of Barbados comes to the attention\nof the Law Revision Commissioner, the Commissioner shall rectify the omission\nin such manner as he determines to be appropriate.\n\nWhere the Law Revision Commissioner believes that the rectification of\n(2)\nan  omission  should  be  made  by  order,  the  Commissioner  shall  advise  the\nAttorney-General of the omission and the Attorney-General shall by order rectify\nthe omission.\n\nAn order under subsection (2) may be made to have retrospective effect\n(3)\nand may contain such consequential, supplementary or ancillary provisions as\nappear  to  the  Attorney-General  to  be  necessary  or  expedient  in  the\ncircumstances.\n\n(4)\n\nAn order made under subsection (2) shall be laid in Parliament.\n\nIn  this  section,  \"omission\"  means  any  omission  from  the  Laws  of\n\n(5)\nBarbados otherwise than in accordance with this Act.\n\nAssistance with law revision\n\n25.(1)\nFor the purposes of revising any law or any branch of the law pursuant\nto this Act, the Law Revision Commissioner may consult any person who has\nspecialized  knowledge  in  any  branch  of  the  law  or  a  technical  expert  in  any\nparticular field.\n\nThe  Attorney-General  may  authorise  the  payment  of  compensation  and\n\n(2)\nexpenses to persons consulted under subsection (1).\n\n\f21\n\nAssistance with a revised edition\n\n26.(1)\nThe  Attorney-General  may,  on  the  advice  of  the  Law  Revision\nCommissioner,  appoint  suitably  qualified  persons  to  assist  the  Law  Revision\nCommissioner with the preparation of a revised edition.\n\nThe  Attorney-General  may  authorise  the  payment  of  compensation  and\n\n(2)\nexpenses to persons appointed under subsection (1).\n\nLaw revision reports\n\nThe Law Revision Commissioner shall, in respect of every calendar\n27.(1)\nyear,  submit  to  the  Attorney-General,  a  report  on  any  aspect  of  the\nCommissioner’s work under this Act.\n\nThe Attorney-General may cause the report referred to in subsection (1) to\n\n(2)\nbe laid before Parliament with any comments he thinks fit.\n\nDistribution and sale of the Laws of Barbados\n\n28.(1)\nto the Laws of Barbados whether printed or in electronic format\n\nCopies of a revised edition, the Cumulative Edition and any updates\n\n(a)\n\n(b)\n\nshall  be  distributed  among  such  persons,  officers,  departments  and\ninstitutions as the Attorney-General, after consultation with the Law\nRevision Commissioner, may direct;\n\nshall  be  made  available  for  sale  to  the  public  and  may  include  an\nelectronic subscription service at such price as the Attorney-General\nafter  consultation  with  the  Law  Revision  Commissioner  shall\ndetermine.\n\nThe  sums  collected  under  subsection  (1)(b)  shall  be  paid  into  the\n\n(2)\nConsolidated Fund.\n\n\f22\n\nPART III\n\nLAW REFORM\n\nLaw Reform Commission\n\n29.(1)\npromoting the reform of the law.\n\nThere  shall  be  a  Law  Reform  Commission  for  the  purpose  of\n\nThe Attorney-General shall by instrument, appoint a Chairman and such\n(2)\nother persons as appear to him to be suitably qualified pursuant to subsection (3)\nto be Law Reform Commissioners.\n\nA person appointed to be a Law Reform Commissioner under subsection\n(3)\n(2) shall be a person who holds or has held judicial office or a person who is an\nexperienced legal practitioner or an experienced teacher of law in a university.\n\nA  Law  Reform  Commissioner  shall  be  appointed  for  such  period,  not\n(4)\nexceeding 5 years, and on such terms and conditions, including compensation,\nas may be determined by the Attorney-General at the time of his appointment.\n\nA  Law  Reform  Commissioner  may  at  any  time  resign  his  office  and  a\n\n(5)\nperson who ceases to be a Commissioner shall be eligible for re-appointment.\n\nWhere  a  Law  Reform  Commissioner  is  unable  to  fully  perform  his\n(6)\nfunctions,  the  Attorney-General  may  appoint  another  person  to  be  a\nCommissioner in his stead.\n\nThe appointment of a Judge as a member of the Commission does not affect\n(7)\nthe Judge’s tenure of the judicial office and for all purposes, the Judge’s service\nas a member shall be taken to be service as a Judge.\n\nStaff to assist the Law Reform Commission\n\n30.(1)\nThe  Law  Reform  Commission  shall  be  provided  with  such  staff,\nappointed in accordance with subsection (2), as is required for the purpose of\ncarrying out the functions of the Commission under this Act.\n\n\f23\n\nThe offices of the staff required for the purposes of subsection (1) shall be\n\n(2)\nestablished in accordance with the Public Service Act, Cap. 29.\n\nFunctions and powers of the Law Reform Commission\n\n31.(1)\nreview for the purpose of developing, modernizing and simplifying the law.\n\nThe Law Reform Commission shall systematically keep the law under\n\n(2)\n\nThe Law Reform Commission shall have the following powers:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nto receive and consider any suggestions or formal proposals for the\nreform of the law which may be made to the Commission;\n\nto  prepare  and  submit  to  the  Attorney-General  from  time  to  time,\nprogrammes for the examination of different branches of the law with\na  view  to  reform,  including  recommendations  as  to  whether  such\nexamination should be carried out by the Commission or some other\nbody;\n\nto  undertake  pursuant  to  any  recommendations  approved  by  the\nAttorney-General, the examination of particular branches of the law\nand the formulation of proposals for reform;\n\nto  provide  at  the  instance  of  the  Attorney-General,  advice  and\ninformation  to  Ministries  and  Departments  of  the  Government  and\nother  authorities  which  are  concerned  with  proposals  for  the\namendment or reform of any branch of the law;\n\nto obtain such information as to the laws and legal systems of other\ncountries  as  appears  to  the  Commission  likely  to  facilitate  the\nperformance of any of its functions.\n\nIn the exercise of the functions prescribed under this Act, the Law Reform\n(3)\nCommissioners shall be subject to the general direction of the Attorney-General.\n\n\f24\n\nConsultation of persons and appointment of specialised committees\n\n32.(1)\nCommission may from time to time\n\nIn performing any of its functions under section 31, the Law Reform\n\n(a)\n\n(b)\n\nconsult any person who has specialised knowledge in any branch of\nthe law or technical expertise in any particular field; or\n\nappoint committees to provide advice and information, and to consider\nand report on any matter referred to the Commission.\n\nIn appointing persons as members of a committee under subsection (1)\n(2)\n(b), the Law Reform Commission shall not restrict consideration to members of\nthe legal profession.\n\nThe  Attorney-General  may  authorise  the  payment  of  compensation  and\n\n(3)\nexpenses to persons consulted or appointed under this section.\n\nLaw reform programme\n\nThe Chairman of the Law Reform Commission shall prepare at the\n33.\nbeginning of each year, a programme for Law Reform for that year and submit\nit to the Attorney-General no later than 31st January of that year.\n\nSubmission of report by Law Reform Commission\n\nThe  Law  Reform  Commission  shall,  in  respect  of  every  calendar\n34.(1)\nyear, submit a report of its proceedings in respect of law reform to the Attorney-\nGeneral.\n\nThe Attorney-General shall cause the report referred to in subsection (1)\n\n(2)\nto be laid before Parliament with any comments he thinks fit.\n\nThe  report  referred  to  in  subsection  (1)  shall  be  published  by  the  Law\n\n(3)\nReform Commission after consultation with the Attorney-General.\n\n\f25\n\nPART IV\n\nGENERAL\n\nExpenses\n\nThe expenses incurred under this Act for the purpose of the revision\n35.\nand the reform of the law  and generally in respect of the administration of this\nAct,  shall  be  paid  out  of  such  moneys  as  may  be  voted  for  that  purpose  by\nParliament.\n\nTransitional\n\n36.\nCap. 2 shall cease on the commencement of this Act.\n\nAny appointments made under section 13 of the Law Revision Act,\n\nRepeal of Cap. 2\n\n37.\n\nThe Law Revision Act , Cap. 2 is repealed.\n\nCommencement\n\n38.\n\nThis Act shall commence on a date to be fixed by Proclamation.\n\n\fLAW REVISION AND LAW REFORM BILL, 2018\n\nEXPLANATORY MEMORANDUM\n\nSUMMARY\n\nThe  Purpose  of  this  Bill  is  to  repeal  and  replace  the  Law  Revision  Act  to\nmodernize the system of revising, consolidating and editing the Laws. This is\nnecessary to make the system compatible with the technological environment in\nwhich the Laws are now being produced and managed. The changes will also\nincrease flexibility and bring improvements in relation to the speed and efficiency\nof the system. The Bill would also facilitate the publication of the Laws on the\nInternet or in an electronic format such as a CD.\n\nIn addition, the Bill makes provision for the establishment of an official Law\nReform Commission. Such a Commission would make it possible for the Laws\nto  be  reviewed  and  reformed  on  a  systematic  basis  for  the  first  time.  The\nCommission will be required to prepare a law reform programme on an annual\nbasis  and  provide  law  reform  reports  of  their  research  findings  and\nrecommendations for submission to Parliament and for the use of the public.\n\nPART I\nPRELIMINARY\n\nClause 1:\n\nThis clause provides for the short title.\n\nClause 2:\n\nThis clause provides definitions for the terms used in the Bill.\n\nPART II\nLAW REVISION COMMISSIONER\n\nClause 3:\n\nThe provisions of this clause will bring major administrative\nimprovements to the system by providing for the appointment\nof a public officer who is an experienced legislative drafter to\n\ni\n\n\fLaw Revision and Law Reform Bill, 2018\n\nrevise and update the Cumulative Edition on a full-time basis.\nThis is necessary since consolidation as well as the revision\nof the Laws is conducted on a continuous basis rather than a\nperiodic  basis.  The  Act  therefore  removes  the  conflict  and\nresulting  procedural\nfrom\nappointing  the  full-time  Law  Revision  Commissioner  on  a\nperiodic basis. These provisions will also ensure that there is\ncontinuity  and  retention  of  the  institutional  knowledge  and\nexpertise in this specialized field.\n\nirregularities  which  arose\n\nIn  particular,  paragraph\n\nThis clause details the duties and responsibilities of the Law\nRevision  Commissioner.\n(b)\ncontinues  to  provide  for  the  conduct  of  Barbados’  highly\nacclaimed continuous system of law revision as distinct from\na periodic system of law revision. It requires a full-time Law\nRevision Commissioner to revise and consolidate the Laws\nby the use of modern methodologies. These provisions will\nfacilitate the replacement of the slow manual methods by new\nand efficient technological methods which will allow for the\nupdating of the laws soon after enactment.\n\nThis clause makes provision for the Laws to be in electronic\nformat for the purposes of publication to the Internet or the\nproduction  of  a  CD.  This  will  enable  the  Laws  to  be  more\nwidely  accessed  by  attorneys-at-law,  the  judiciary  and  the\npublic, thereby strengthening the rule of law.\n\nThis clause specifies the powers which are exercisable by the\nLRC for the purposes of maintaining the Cumulative Edition.\n\nThis  clause  gives  the  Law  Revision  Commissioner  wide\npowers to edit and revise the Laws and also to correct mistakes\nand to clarify the Laws where necessary.\n\nii\n\nClause 4:\n\nClause 5:\n\nClause 6:\n\nClause 7:\n\n\fClause 8:\n\nClause 9:\n\nClause 10:\n\nClause 11:\n\nClause 12:\n\nClause 13:\n\nLaw Revision and Law Reform Bill, 2018\n\nThis  clause  inter  alia  makes  provision  for  errors  in  the\nCumulative  Edition  to  be  rectified.  Where  errors  of\nsignificance are to be corrected, the correction must now be\nmade by order for the purposes of record and transparency.\n\nThis clause provides a formal procedure for the correction of\nerrors in new laws, similar to the correction of errors in the\nCumulative  Edition.  Where  errors  of  significance  are  to  be\ncorrected, the correction must be done by way of notice for\nthe purposes of record and transparency.\n\nThis clause retains the rule that in revising the law, the Law\nRevision Commissioner must not change the substance of the\nlaw.\n\nThis  clause  corrects  a  deficiency  in  the  existing  law  by\npermitting  a  Bill  to  be  drafted  by  the  Law  Revision\nCommissioner where substantive changes are required to the\nlaw. Under the existing law, such errors in the law generally\ngo unaddressed.\n\nThis clause requires the Law Revision Commissioner to notify\nthe relevant ministry where any fees or fines require updating\ndue to the passage of time.\n\nThis  clause  retains  the  power  of  the  Law  Revision\nCommissioner to omit any law or provisions of any law from\nthe  revised  edition  or  the  Cumulative  Edition  where  they\nconsider it appropriate. However, the exercise of this power\nwould be less necessary in the new electronic environment.\n\nClause 14:\n\nThis  clause  makes  it  clear  that  the  laws  omitted  from  the\nrevised edition or Cumulative Edition still remain in force and\nare binding.\n\niii\n\n\fClause 15:\n\nClause 16:\n\nClause 17:\n\nClause 18:\n\nClause 19:\n\nClause 20:\n\nClause 21:\n\nClause 22:\n\nClause 23:\n\nLaw Revision and Law Reform Bill, 2018\n\nThis clause inter alia makes provision for the revised edition\nto be brought into force by Proclamation.\n\nThis clause provides for the publication and printing of the\nLaws, including a new revised edition of the Laws.\n\nThis clause provides for the Law Revision Commissioner to\nprovide certified copies of laws where necessary.\n\nThis clause provides for the validity of the Laws of Barbados\nas revised by the Law Revision Commissioner for use by the\ncourts and for all official purposes.\n\nThis clause is retained to make it clear that where a law has\nbeen  repealed  and  replaced,  references  to  the  provision\nthroughout  the  law  must  be  treated  as  references  to  the\ncorresponding provision.\n\nThis clause makes provision for the official archiving of the\nLaws as documents of record.\n\nThis clause makes new provision on an annual basis for the\nofficial archiving as documents of record of the repealed laws\nwhich are removed from the Cumulative Edition as well as\nlaws which are consolidated or revised.\n\nThis clause requires certain officials to maintain a set of Laws\nin a current state for the use of the judiciary, legal practitioners\nand the public.\n\nThis clause requires the Law Revision Commissioner to notify\nthe relevant ministry where subsidiary legislation which was\nmade under an Act which has been repealed is substantially\ninconsistent with the new Act and needs to be remade.\n\niv\n\n\fClause 24:\n\nClause 25:\n\nClause 26:\n\nClause 27:\n\nClause 28:\n\nClause 29:\n\nLaw Revision and Law Reform Bill, 2018\n\nThis clause makes provision for the method by which the Law\nRevision  Commissioner  must  rectify  omissions  mistakenly\nomitted from the Cumulative Edition.\n\nThis  clause  allows  for  the  appointment  of  committees  of\nexperts to assist the Law Revision Commissioner in revising\nwhere necessary any important aspect or branch of the law.\n\nThis  clause  allows  for  the  appointment  of  persons  to  give\ntechnical assistance to the Law Revision Commissioner where\nit is necessary to produce a new revised edition of the Laws.\n\nThis  clause  makes  provision  for\nthe  Law  Revision\nCommissioner  to  submit  annual  reports  to  the  Attorney-\nGeneral  and  to  Parliament  to  give  pertinent  information  on\nany aspect of the Commissioner’s work.\n\nThis clause makes provision for the sale of the Laws both in\nprinted  form  as  well  as  electronically.  Revenue  from  such\nsales is to be placed in the Consolidated Fund.\n\nPART III\nLAW REFORM\n\nThis clause makes provision for the formal establishment of\na law reform commission to promote law reform and to advise\non  law  reform  measures  on  a  systematic  basis.  The\nCommission will be required produce an annual Law reform\nprogramme and to submit Law reform reports to the Attorney-\nGeneral  from  time  to  time.  These  reports  may  also  be\npublished for the benefit of the public.\n\nClause 30:\n\nThis clause makes provision for the appointment of staff to\nassist the Commission in carrying out its mandate.\n\nv\n\n\fClause 31:\n\nClause 32:\n\nClause 33:\n\nClause 34:\n\nClause 35:\n\nClause 36:\n\nLaw Revision and Law Reform Bill, 2018\n\nThis  clause  prescribes  the  functions  of  the  Law  Reform\nCommission. These functions include the preparation of an\nannual law reform programme and the publication of annual\nreports on the status of law reform matters being undertaken.\n\nThis  clause  provides  for  the  appointment  of  persons  or\ncommittees to give technical assistance to the Commission for\nthe purpose of reforming any branch of the law.\n\nThis  clause  provides  for  the  Law  Reform  Commission  to\nprepare an annual law reform programme.\n\nThis  clause  provides  for  the  Law  Reform  Commission  to\nsubmit reports to the Attorney-General and to Parliament to\ngive  information  on  research  findings  and  law  reform\nprogrammes. The reports must also be subsequently published\nfor the benefit of the public.\n\nPART IV\nGENERAL\n\nThis  clause  makes  provision  for  expenses  relating  to  law\nrevision and law reform to be taken from the Consolidation\nFund.\n\nFor the avoidance of conflict, this clause makes provision for\nany  instrument  of  appointment  issued  by  the  Governor-\nGeneral  in  relation  to  the  appointment  of  a  Law  Revision\nCommissioner under s. 13 of the existing Act to cease on the\ncommencement of the new Act.\n\nClause 37:\n\nThis  clause  provides  for  the  repeal  of  the  existing  Law\nRevision Act, Cap. 2.\n\nvi\n\n\fLaw Revision and Law Reform Bill, 2018\n\nClause 38:\n\nThis  clause  provides  for  the  commencement  of  the  Act  by\nProclamation  so  as  to  allow  for  the  relevant  administrative\nmeasures to be completed before the commencement of the\nAct.  These  measures  include  the  appointment  of  a  Law\nRevision  Commissioner  and  the  establishment  of  a  Law\nReform Section.\n\nvii\n\n"
}