{
  "bill_id": 297,
  "slug": "resolution-re-public-service-teachers-order-2018",
  "title": "Resolution re Public Service (Teachers) Order, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/14caae1d28379db843334b5b4ab997ff.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-08-15",
  "first_reading": "2018-08-15",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\nPARLIAMENT\n\nRESOLVED that the Public Service (Teachers) Order, 2018 made by\n\nthe Minister responsible for the Civil Service on the                  day of August,\n\n2018  under  sections  13(1)  and  14(3)  of  the  Public  Service  Act,  Cap.  29  be\n\napproved.\n\nRESOLVED  that Her  Excellency the Governor-General be asked to\n\nassent and take the necessary steps given to effect this Resolution.\n\nAPPROVED  by  the  House  of  Assembly   this                           day\n\nof                               , 2018.\n\nSpeaker\n\nAPPROVED by the Senate this                day of                             ,\n\n2018.\n\nPresident\n\n\f2\n\nADDENDUM\n\nThe  Public  Service  (Teachers)  Order,  2018  has  been  laid  in\n\nParliament.\n\nThe  Order  provides  for  the  revision  of  salaries  paid  to  Teachers  in\n\nNursery, Primary and Secondary Schools.  The revision provides for an increase of\n\n# 5% with effect from 1st April 2018.\n\n\f2018-07-31\n\nS.I. 2018 No.\n\nPublic Service Act\n\nCAP. 29\n\nPUBLIC SERVICE (TEACHERS) ORDER, 2018\n\nThe Minister, in exercise of the powers conferred on her by section 13(1)\n\nand 14(3) of the Public Service Act, makes the following Order:\n\n1.\n2018.\n\nThis  Order  may  be  cited  as  the  Public  Service  (Teachers)  Order,\n\n2.\n\nIn this Order,\n\n“assisted  private  school”  has  the  meaning  assigned  to  it  by  section  2  of  the\n\nEducation Act, Cap. 41;\n\n“graduate” means a person who holds\n\n(a)\n\n(b)\n\na  degree  awarded  by  a  university  within  the  Commonwealth  that  is\nrecognised by the Minister for the purpose of awarding degrees; or\n\na qualification that is approved by the Minister as being equivalent to\na degree;\n\n“guidance counsellor” means a member of staff charged with the responsibility\nfor organising the programme of guidance and counselling in a school;\n\n“head of department” means a member of staff who has been assigned the duties\nof  Head  of  Department  as  prescribed  by  regulation  22  of  the  Education\nRegulations, 1982 (S.I. 1982 No. 43);\n\n“Minister” means the Minister responsible for Education;\n\n\f2\n\n“public school” has the meaning assigned to it by section 2 of the Education\n\nAct, Cap. 41;\n\n“qualified teacher” means a person who holds a diploma or certificate of training\n\nrecognised by the Minister;\n\n“secondary school” means a secondary school other than those contained in the\n\nThird Schedule to the Education Act;\n\n“senior teacher” means a person appointed to the post of senior teacher before\n7th May, 1990 or a member of staff who has been assigned the duties of\nSenior  Teacher  as  prescribed  by  the  Education  Regulations,  1982\n(S.I. 1982 No. 43);\n\n“teacher (special grade)” means a teacher who\n\n(a)\n\nis employed in full-time or part-time teaching amounting to more than\nhalf  the  total  periods  on  the  timetable  of  a  particular  subject  or  a\nparticular combination of subjects approved by the Minister; and\n\n(b)\n\npossesses such qualifications in relation to the subject he teaches as the\nMinister approves;\n\nthe symbol “(Q.B.)” means “Qualification Bar”;\n\nthe symbol “-” means “to”.\n\n3.\nThe offices set out in the first column of Schedule A are the offices\nestablished in the public service for teachers and the number of offices relating\nthereto is specified in the second column.\n\n4.\n\nSubject to this Order,\n\n(a)\n\n(b)\n\na teacher is entitled to the emoluments specified in Schedule B;\n\na qualified teacher is entitled to the emoluments specified in Schedule\nC; but a qualified teacher who\n\n(i)\n\nhas completed a course of at least one academic year in a special\nsubject approved by the Minister; or\n\n\f3\n\n(ii)\n\nhas other specialist qualifications approved by the Minister,\n\nis entitled to 2 additional increments in the salary scale specified in Schedule\nC up to the limit of the maximum specified for that scale;\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\na  qualified  teacher  who  has  completed  a  2-year  course  in  a  special\nsubject  approved  by  the  Minister  is  entitled  to  the  emoluments\nspecified in Schedule E that are payable to senior teachers;\n\na person who is appointed a teacher subsequent to 7th May, 1990 is\nentitled, if that person is a qualified teacher or a teacher (special grade)\nwho  becomes  a  graduate,  to  2  increments  in  the  scale  specified  in\nSchedule I;\n\na  teacher  (special  grade)  is  entitled  to  the  emoluments  specified  in\nSchedule D;\n\na senior teacher who is appointed prior to 7th May, 1990 is entitled to\nthe emoluments applicable to the grade of senior teacher specified in\nSchedule E; but such a senior teacher who\n\n(i)\n\nhas completed a course of at least one academic year in a special\nsubject approved by the Minister; or\n\n(ii)\n\nhas other specialist qualifications approved by the Minister,\n\nis entitled to 2 additional increments in the salary scale specified in Schedule\nE up to the limit of the maximum specified for the scale;\n\n(g)\n\nwhere a senior teacher or a member of staff has been assigned and is\nperforming the duties of senior teacher, the emoluments payable to that\nteacher or member of staff, in accordance with the scale of salary set\nout in the appropriate Schedule, may be increased by such amount as\nthe Minister responsible for the Civil Service determines;\n\n(h)\n\nthe housemistress of the Government Industrial School is entitled to\nthe emoluments specified in Schedule K;\n\n\f4\n\n(i)\n\n(j)\n\n(k)\n\nthe principal of the School for the Deaf is entitled to the emoluments\nspecified in Schedule F;\n\na principal and deputy principal of a secondary school are entitled to\nthe emoluments specified in Schedule G applicable to their grade; and\n\nwhere a member of the teaching staff or the guidance counsellor of a\nsecondary school has been assigned and is performing the duties of\nhead  of  department,  the  emoluments  payable  to  that  person  in\naccordance with the scale of salary set out in the appropriate Schedule\nmay be increased by such amount as the Minister responsible for the\nCivil Service determines; and\n\n(l)\n\na  guidance  counsellor  is  entitled  to  the  emoluments  specified  in\nSchedule J.\n\nWith  effect  from  1st  April,  1999,  a  principal  of  a  nursery,  senior,\n5.\nprimary or composite school is entitled to the emoluments specified in Schedule\nH.\n\n6.(1)\nThe offices set out in the first column of Schedule L are the offices\nestablished in the public service for graduate teachers, teachers (special grade),\nqualified teachers and teachers referred to in sub-paragraph (2) and the number\nof offices relating thereto are specified in the third column of Schedule L.\n\nA  graduate  teacher,  a  teacher  (special  grade),  a  qualified  teacher  or  a\n(2)\nteacher, the offices of which are specified in the first column of Schedule L, who\nsatisfied the requirements of section 13(7) of the Act, but was not appointed with\neffect from the 31st day of December, 2007 shall be\n\n(a)\n\n(b)\n\ndeemed to have been appointed on the 31st day of December, 2007; and\n\nentitled to receive the annual emoluments denoted by the Code Number\nspecified in the second column of Schedule L.\n\n7.(1)\nSubject to sub-paragraph (2), where a salary scale set out in any of the\nSchedules contains a qualification bar, no member of the teaching staff of an\n\n\f5\n\nassisted private school or a public school may, after reaching the point in the scale\nwhere the qualification bar applies, receive any further increment in that scale\nunless that member obtains a qualification specified in sub-paragraph (2).\n\nFor the purposes of sub-paragraph (1), the qualification that a member of\n(2)\nthe teaching staff of an assisted private school or public school is required to\nobtain is\n\n(a)\n\n(b)\n\na doctorate or other advanced degree obtained by examination; or\n\na diploma or certificate of training approved by the Minister.\n\n8.\nNotwithstanding this Order, a graduate who is appointed to or holds\nan office established by this Order may, with the approval of the Minister and\nsubject to paragraph 9, be paid in substitution for the emoluments to which that\ngraduate is entitled under paragraph 4 or 5, as the case may be, the emoluments\nspecified in Schedule I.\n\n9.(1)\nSubject  to  sub-paragraphs  (2)  and  (3),  a  graduate  who  before\ngraduation has had continuous teaching service in an assisted private school or\na public school is, after graduation, entitled to such emoluments in the appropriate\nsalary  scale  as  will  cause  that  graduate  to  receive  one  increment  for  every  2\ncomplete years of that service.\n\nFor the purposes of sub-paragraph (1), no account is to be taken of any\n\n(2)\ntime spent on study leave during that service.\n\nThe entitlement referred to in sub-paragraph (1) does not apply to persons\n\n(3)\nappointed to the teaching service subsequent to 7th May, 1990.\n\nA  graduate  is  entitled  to  additional  increments  in  the  salary  scale  that\n\n(4)\napplies to that graduate on the following basis:\n\n(a)\n\ntwo increments, if the graduate has a degree with first or second class\nhonours  awarded  by  a  university  within  the  Commonwealth  that  is\nrecognised by the Minister for the purpose of awarding degrees;\n\n\f6\n\n(b)\n\n(c)\n\ntwo increments, if the graduate does not have the degree specified in\nclause (a) but possesses another qualification that is approved by the\nMinister as being equivalent to that degree;\n\ntwo  increments,  if  the  graduate  does  not  have  a  degree  specified  in\nclause (a) or the equivalent qualification referred to in clause (b) but\nhas  a  Diploma  in  Education  awarded  by  a  university  within  the\nCommonwealth  or  another  qualification  that  is  approved  by  the\nMinister as being equivalent thereto;\n\n(d)\n\nfour increments, if the graduate possesses any qualification mentioned\nin clause (a) or (b) together with any qualification mentioned in clause\n(c).\n\n10.(1)\nThis  Order  does  not  apply  to  any  person  who  on  the  date  of  its\npublication in the Official Gazette is, in addition to being the holder of an office\nestablished by this Order, also the holder of an office established by the Public\nService (Teachers) Order, 2008 (S.I. 2008 No. 114) if that person gives notice\nin  writing  within  3  months  of  the  date,  or  within  such  further  period  as  the\nPermanent Secretary, Ministry of the Civil Service in any special case allows,\nthat he wishes to be exempted from the provisions of this Order.\n\nWhere  a  person  gives  notice  under  sub-paragraph  (1),  that  person  is\n(2)\nentitled, during the time he continues in the office he held at the date of his giving\nthe notice, to those rights and is subject to the terms, conditions and liabilities he\nenjoyed or to which he was subject before the commencement of this Order.\n\n11.\nrevoked.\n\nThe  Public  Service  (Teachers)  Order,  2016    (S.I.  2016  No.  95)  is\n\n\f7\n\n SCHEDULE  A(Paragraph 3) ESTABLISHED OFFICES NUMBER OF  OFFICES22222115625861639151SECONDARY SCHOOLSPrincipalsDeputy PrincipalsSenior TeachersGraduate TeachersQualiﬁ ed TeachersTeachers (Special Grade)TeachersGuidance CounsellorsNURSERY, PRIMARY, SCHOOL FOR THE DEAF AND CENTRE FOR PRE-VOCATIONAL TRAININGPrincipalsGraduate TeachersQualiﬁ ed TeachersTeachers (Special Grade)TeachersGOVERNMENT INDUSTRIAL SCHOOLSSenior TeachersGraduate TeachersQualiﬁ ed TeachersTeachers (Special Grade)TeachersHousemistress}}}\f8\n\n SCHEDULE  B(Paragraph 4(a)) Ofﬁ ce Scale Annual Emoluments    $ $26,229.0427,141.1528,053.2728,965.3829,877.4930,789.6131,701.7232,637.5233,573.3334,509.1335,444.9336,380.7337,428.80935.801,048.07 Teacher Note: The (*) indicates the point at which an increment is granted.Z36-Z35-Z34-Z33-Z32-Z31-Z30-Z29-Z28-Z27-Z26-Z25-Z24-**\f9\n\nQualiﬁ ed Teacher39 524.9440 573.0041 621.0742 669.1443 717.2144 765.2845 981.8147 198.3448 756.5850 314.8251 873.0653 431.3054 989.5556 547.7958 106.031 216.531 558.24Z22-Z21-Z20-Z19-Z18-Z17-Z16-Z15-Z14-Z13-Z12-Z11-Z10-Z9-Z8-**SCHEDULE  C(Paragraph 4(b)) Ofﬁ ce Scale Annual Emoluments    $ $Note:  The (*) indicates the point at which an increment is granted.\f10\n\n Teacher (Special Grade)39 524.9440 573.0041 621.0742 669.1443 717.2144 765.2845 981.8147 198.3448 756.5850 314.8251 873.0653 431.3054 989.5556 547.7958 106.0359 664.2861 515.2263 366.161 216.531 558.241 850.94Note:  The (*) indicates the point at which an increment is granted.Z22-Z21-Z20-Z19-Z18-Z17-Z16-Z15-Z14-Z13-Z12-Z11-Z10-Z9-Z8-Z7-Z6-Z5-SCHEDULE D(Paragraph 4(e)) Ofﬁ ce Scale Annual Emoluments    $ $***\f11\n\nSCHEDULE E(Paragraph 4(c), (f)) Ofﬁ ce Scale Annual Emoluments     $ Senior Teacher54 989.5556 547.7958 106.03Z10-Z9-Z8-\f12\n\n SCHEDULE F(Paragraph 4(i)) Ofﬁ ce Scale Annual Emoluments     $Principal,School for the Deaf92 591.60S6-\f13\n\nSCHEDULE G(Paragraph 4(j))PART I Ofﬁ ce  Scale Annual Emoluments     $Principal,Secondary School114 569.78S4-PART II Ofﬁ ce  Scale Annual Emoluments        $ Deputy Principal,Secondary School92 591.60S6-\f14\n\n SCHEDULE H(Paragraph 5) Ofﬁ ce   Scale Annual Emoluments        $ Principal,Nursery, Primary, Composite School92 591.60S6-\f15\n\nGraduate TeacherZ15-Z14-Z13-Z12-Z11-Z10-Z9-Z8-Z7-Z6-Z5-Z4-Z3-Z2-Note:  The (*) indicates the point at which an increment is granted.47 198.3448 756.5850 314.8251 873.0653 431.3054 989.5556 547.7958 106.0359 664.2861 515.2263 366.1665 217.1067 068.0369 502.101 558.241 850.942 434.07SCHEDULE I(Paragraph 4(d)) Ofﬁ ce  Scale Annual Emoluments    $  $***\f16\n\n SCHEDULE J(Paragraph 4(l)) Ofﬁ ce  Scale Annual Emoluments    $  $Z22-Z21-Z20-Z19-Z18-Z17- Z16-Z15- Z14-Z13- Z12-Z11-Z10-Z9-Z8-Z7-Z6-Z5-Z4-Z3-Z2-Guidance Counsellor39 524.9440 573.0041 621.0742 669.1443 717.2144 765.2845 981.8147 198.3448 756.5850 314.8251 873.0653 431.3054 989.5556 547.7958 106.0359 664.2861 515.2263 366.1665 217.1067 068.0369 502.101 216.531 558.241 850.942 434.07****Note:  The (*) indicates the point at which an increment is granted.\f17\n\n SCHEDULE K(Paragraph 4(h)) Ofﬁ ce   Scale Annual Emoluments        $ Housemistress,Government Industrial School74 577.00S9\f18\n\n SCHEDULE  L(Paragraph 6)}FIRST COLUMNOfﬁ ceSECONDARY SCHOOLSGraduate TeacherTeacher (Special Grade)Qualiﬁ ed TeacherTeacherNURSERY, PRIMARY, SCHOOL FOR THEDEAF   AND  CENTRE   FOR   PRE-VOCATIONALTRAININGGraduate TeacherTeacher (Special Grade)Qualiﬁ ed TeacherTeacherTHIRDCOLUMNNumber ofOfﬁ ces1152SECONDCOLUMNCode NumberZ15-7(Q.B.)Z6-2Z22-7(Q.B.)Z6-5Z22-8Z36-24Z15-7(Q.B.)Z6-2Z22-7(Q.B.)Z6-5Z22-8Z36-24}\f19\n\nMade by the Minister this              day of                     , 2018.\n\nMinister Responsible for the Public Service\n\n"
}