{
  "bill_id": 298,
  "slug": "resolution-re-public-service-parttime-officers-order-2018",
  "title": "Resolution re Public Service (Part-Time Officers) Order, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/4cf176aaec03aaa728dafceb1a66b58c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-08-15",
  "first_reading": "2018-08-15",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\nPARLIAMENT\n\nRESOLVED that the Public Service (Part-time Officers) Order, 2018\n\nmade  by  the  Minister  responsible  for  the  Civil  Service  on  the                          day  of\n\nAugust, 2018 under sections 13(1) and 14(3) of the Public Service Act, Cap. 29 be\n\napproved.\n\nRESOLVED  that Her  Excellency the Governor-General be asked to\n\nassent and take the necessary steps given to effect this Resolution.\n\nAPPROVED  by\n\nthe  House  of  Assembly\n\nthis\n\n  day\n\nof                                     , 2018.\n\nSpeaker\n\nAPPROVED by the Senate this               day of                             ,\n\n2018.\n\nPresident\n\n\f2\n\nADDENDUM\n\nThe Public Service (Part-time Officers) Order, 2018 has been laid in\n\nParliament.\n\n2.\n\nThe Order provides for an increase in the salaries of part-time officers\n\n# of 5% with effect from 1st April, 2018.\n\n\f2018/07/31\n\nS.I. 2018 No.\n\nPublic Service Act\n\nCAP. 29\n\nPUBLIC SERVICE (PART-TIME OFFICERS) ORDER, 2018\n\nThe Minister, in exercise of the powers conferred on her by section 13(1)\n\nof the Public Service Act, makes the following Order:\n\n1.\nOfficers)Order, 2018.\n\nThis  Order  may  be  cited  as  the  Public  Service  (Part-Time\n\n2.\nestablished offices.\n\nThe  offices  specified  in  the  first  column  of  the  Schedule  are\n\n3.\nSchedule the emoluments set out in the second column of the Schedule.\n\nThere are attached to the offices specified in the first column of the\n\n4.\nbe payable on 1st April, 2018.\n\nThe emoluments set out in the second column of the Schedule shall\n\n5.(1)\nSubject to sub-paragraph (2), the Governor-General may appoint to\nthe offices specified in the first column of the Schedule such part-time officers\nas he considers necessary.\n\nThe number of part-time officers appointed under sub-paragraph (1) may\n(2)\nnot  at  any  time  exceed  the  number  specified  in  the  third  column  of  the\nSchedule.\n\n6.\nWhere  the  emoluments  of  an  established  office  referred  to  in  this\nOrder are on a scale divided into segments by the symbol “.”, an officer holding\n\n\f2\n\nany such office is not entitled to the emoluments of the scale beyond the point at\nwhich the symbol appears except on such conditions as the Governor-General\ndetermines in relation to offices of that class.\n\n7.\n(S.I. 2008 No. 115) is revoked.\n\nThe  Public\n\nService\n\n(Part-Time  Officers)  Order,\n\n2008\n\n\f3\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosSCHEDULE(Paragraph 2, 3 and 5)ANNUAL EMOLUMENTSFirst ColumnPOLICEMedical Ofﬁ cer, District \"A\"Medical Ofﬁ cerPRISONSMedical Ofﬁ cerChaplainVisiting Dental SurgeonGOVERNMENT INDUSTRIAL SCHOOLSMedical Ofﬁ cerChaplainMINISTRY OF HEALTH(a) Mental Hospital Chaplain(b) Health Centres and Polyclinics *DentistOpthalmic SurgeonFIRE SERVICEMedical Ofﬁ cerSecond Column$42,668.2618,539.6435,451.6123,728.4418,540.2725,325.7412,939.8212,939.8211,394.0518,949.8928,058.6841,620.4420,156.5918,539.64Third ColumnNumberof Ofﬁ ces15111111511*The levels of emoluments are based on hours of work and qualiﬁ cations.\f4\n\nMade by the Minister this              day of                     , 2018.\n\nMinister Responsible for the Public Service\n\n"
}