{
  "bill_id": 299,
  "slug": "resolution-re-senate-and-house-of-assembly-remuneration-and-allowances-of-members-order-2018",
  "title": "Resolution re Senate and House of Assembly (Remuneration and Allowances of Members) Order, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/a7cb146c45f3da031b8acba8190bc01c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-08-15",
  "first_reading": "2018-08-15",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  approve  the  Senate  and  House  of  Assembly\n\n(Remuneration  and  Allowances  of  Members)  Order,  2018  made  by  the  Minister\n\nresponsible for Finance on the                     day of                                       , 2018 under\n\nsection  8  of  the  Senate  and  House  of  Assembly  (Remuneration  and  Allowances  of\n\nMembers) Act, Cap. 13A.\n\nRESOLVED  that  Her  Excellency  the  Governor-General  be  asked  to  assent  and\n\ntake the necessary steps to give effect to this Resolution.\n\nAPPROVED by the House of Assembly this              day of                            ,\n\n2018.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this              day  of                                       , 2018.\n\nPresident\n\n\f2\n\nADDENDUM\n\nThe  Senate  and  House  of  Assembly  (Remuneration  and  Allowances  of\n\nMembers) Order, 2018 has been laid in Parliament.\n\nThe  Order  provides  for  an  increase  in  the  salary  of  the  President  of  the\n\nSenate, the Deputy President and the other Senators, with effect from 1st April, 2018.\n\nThe Order also makes provision for the increase, with effect from 1st April,\n\n2018 the salaries paid to the Speaker, Deputy Speaker, Chairman of Committees, Leader\n\nof the Opposition and other members of the House of Assembly.\n\n\f2018/07/31\n\nS.I. 2018 No.\n\nSenate and House of Assembly (Remuneration and Allowances of Members) Act\n\nCAP. 13A\n\nSENATE AND HOUSE OF ASSEMBLY\n(REMUNERATION AND ALLOWANCES OF MEMBERS)\nORDER, 2018\n\nThe Minister, in exercise of the powers conferred on her by section 8 of the\n\nSenate and House of Assembly (Remuneration and Allowances of Members)\nAct, makes the following Order:\n\n1.\n(Remuneration and Allowances of Members) Order, 2018.\n\nThis  Order  may  be  cited  as  the  Senate  and  House  of  Assembly\n\n2.\nThe Schedule to the Senate and House of Assembly (Remuneration\nand  Allowances  of  Members)  Act  is  deleted  and  the  Schedule  set  out  in  the\nSchedule to this Order is substituted.\n\n\f2\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosSCHEDULE(Paragraph 2)\"SCHEDULE(Sections 3 and 8)PART IREMUNERATION AND ALLOWANCES OFMEMBERS OF THE SENATEDesignation of Members of the SenatePresidentDeputy PresidentOther SenatorsSalaryFrom 1st April, 2018$82,446.59EmolumentsDuty Allowance$22,182.1222,182.1217,748.84 Column 1 Column 2\f3\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosSchedule - (Concl'd)PART IIREMUNERATION AND ALLOWANCES OFMEMBERS OF THE HOUSE OF ASSEMBLYDesignation of Members of theHouse of AssemblySpeakerDeputy SpeakerChairman of CommitteesLeader of the OppositionOther MembersSalaryFrom 1st April, 2018$135,478.1082,446.59101,622.91135,478.1063,040.82Emoluments  Duty Allowance$ 20,493.00 14,708.28 14,708.28 14,708.28 14,708.28         \". Column 1 Column 2EntertainmentAllowances$18,337.4416,578.3613,202.4018,337.4413,202.40\f4\n\nMade by the Minister this              day of                     , 2018.\n\nMinister Responsible for Finance\n\n"
}