{
  "bill_id": 304,
  "slug": "criminal-procedure-amendment-act-2018",
  "title": "Criminal Procedure (Amendment) Act, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/2e60e4bbd8924941c7a5aa8a5ae6d59a.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-09-19",
  "first_reading": "2018-11-07",
  "gazette_date": "2018-08-27",
  "markdown": "Explanatory Memorandum after page 5\n\n2018/08/08\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Criminal Procedure Act, Cap. 127 to\n\n(a)\n\nmake provision for a person who is to be arraigned upon indictment\nfor  the  offence  for  murder  to  undergo  a  psychiatric  evaluation  to\ndetermine whether that person is fit to plead; and\n\n(b)\n\nallow  judges  to  intervene  where  the  defences  of  diminished\nresponsibility or insanity ought to be raised in respect of the accused.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nInsertion of section 6A into Cap. 127\n\nInsertion of section 7A into Cap. 127\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Criminal Procedure Act, Cap. 127.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2018.\n\nThis Act may be cited as the Criminal Procedure (Amendment) Act,\n\n\f4\n\nInsertion of section 6A into Cap. 127\n\nThe Criminal Procedure Act, Cap. 127, in this Act referred to as the\n2.\nprincipal Act, is amended by inserting immediately after section 6 the following\nsection:\n\n“Psychiatric evaluation\n\n6A.(1)\nThe High Court shall order a person who is to be arraigned\nupon  indictment  for  the  offence  of  murder  to  undergo  a  psychiatric\nevaluation  the  results  of  which  shall  be  used  to  assist  the  Court  in\ndetermining whether that person is fit to plead.\n\nWhere a person has been found to be unfit to plead, the High\n(2)\nCourt may order that person to be admitted to a mental hospital for a\nperiod not exceeding 8 weeks.\n\nA person admitted to a mental hospital under subsection (2) may\n(3)\nbe discharged only after the approval of the High Court and the High\nCourt may specify conditions of his discharge.\n\nThe High Court in specifying the conditions of the discharge of\n(4)\na  person  under  subsection  (3),  shall  order  that  that  person  undergo\nfurther psychiatric evaluations at intervals to be determined by the High\nCourt in order to assist the Court in determining whether that person is\nfit to plead.\n\nWhere a person is found to be fit to plead under subsections (1)\n(5)\nand (4), he shall enter the plea in the manner specified in section 7.”.\n\nInsertion of section 7A into Cap. 127\n\n3.\n7, the following section:\n\nThe principal Act is amended by inserting immediately after section\n\n\f5\n\n“Intervention of the judge\n\n7A.(1)\nWhere  a  judge  determines  from  the  circumstances  of  the\ncase  before  him  that  the  defences  of  diminished  responsibility  or\ninsanity should be raised in relation to an accused, the judge shall order\nthat the accused undergo a psychiatric evaluation to determine whether\nthe mental status of the accused person would support the submission\nof arguments for diminished responsibility or insanity in relation to that\naccused person.\n\n(2)\nWhere  the  results  of  the  psychiatric  evaluation  referred  to  in\nsubsection (1) indicate that the defences of diminished responsibility\nor insanity should be raised in respect of the accused, the judge shall\nensure that the defences are raised in relation to the accused.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n\fCRIMINAL PROCEDURE (AMENDMENT) BILL, 2018\n\nEXPLANATORY MEMORANDUM\n\nThe  Criminal  Procedure  (Amendment)  Bill,  2018  will  amend  the  Criminal\n\nProcedure Act, Cap. 127 to\n\n(a)\n\nmake provision for a person who is to be arraigned upon indictment\nfor  the  offence  of  murder  to  undergo  a  psychiatric  evaluation  to\ndetermine whether that person to fit to plead; and\n\n(b)\n\nallow  judges  to  intervene  where  the  defences  of  insanity  and\ndiminished responsibility should be raised in relation to an accused.\n\nClause 1:\n\nClause 2:\n\nClause 3:\n\nClause  1  states  that  the  Act  may  be  cited  as  the  Criminal\nProcedure (Amendment) Act, 2018.\n\nClause 2 inserts into the Criminal Procedure Act, Cap. 127 a\nnew section 6A which makes provision for a person who is to\nbe arraigned upon indictment for the offence for murder to\nundergo  a  psychiatric  evaluation  to  determine  whether  that\nperson is fit to plead.\n\nClause 3 inserts into the Criminal Procedure Act, Cap. 127\ninserts a new section 7A to allow judges to intervene where\nthe defences of insanity and diminished responsibility should\nbe raised in relation to an accused.\n\ni\n\n"
}