{
  "bill_id": 307,
  "slug": "offences-against-the-person-amendment-act-2018",
  "title": "Offences Against the Person (Amendment) Act, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/194e20f4c24596f073bf72414faae7d5.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-11-06",
  "first_reading": "2018-08-10",
  "gazette_date": "2018-11-07",
  "markdown": "Explanatory Memorandum after page 7\n\n2018-08-08\n\nOBJECTS AND REASONS\n\nThis Bill would make provision for the repeal of the mandatory imposition of\nthe penalty of death for the offence of murder under section 2 of the Offences\nAgainst the Person Act, Cap. 141 and other matters related thereto.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nAmendment of section 2 of Cap. 141\n\nInsertion of section 2A into Cap. 141\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Offences Against the Person Act, Cap. 141.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n(Amendment) Act, 2018.\n\nThis  Act  may  be  cited  as  the  Offences  Against  the  Person\n\n\f4\n\nAmendment of section 2 of Cap. 141\n\n2.\nThe Offences Against the Person Act , Cap. 141, in this Act referred\nto as the principal Act, is amended by deleting section 2 and substituting the\nfollowing:\n\n“Punishment for murder\n\n2.(1)\non conviction on indictment to\n\nA person who commits the offence of murder may be liable\n\n(a)\n\n(b)\n\nsuffer death; or\n\nimprisonment for life.\n\nA  Court  may  sentence  a  person  convicted  of  murder  to  death\n\n(2)\nwhere\n\n(a)\n\nthe  murder  was  committed  with  a  high  level  of  brutality,\ncruelty, depravity, or callousness;\n\n(b)\n\nthe murder involved calculated or lengthy planning;\n\n(c)\n\n(d)\n\n(e)\n\nthe deceased was a Judge, a Magistrate, the Director of Public\nProsecutions or a legal officer in the Department of Public\nProsecutions and the office of the deceased was a factor in\nthe commission of the offence;\n\nthe  deceased  was  a  member  of  the  Royal  Barbados  Police\nForce, a member of the Barbados Defence Force, a member\nof the Special Constabulary or a prison officer and the office\nof the deceased was a factor in the commission of the offence;\n\nthe deceased was a member of a group of persons who have\na common characteristic such as race, nationality, ethnicity\nor  religion  and  this  was  a  factor  in  the  commission  of  the\noffence;\n\n\f5\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\nthe  deceased  was  a  witness  or  a  juror  in  a  pending  or\nconcluded trial and this was a factor in the commission of the\noffence;\n\nthe deceased was particularly vulnerable because of his age,\nhealth or disability or because of any other factor;\n\nthe person convicted was convicted of 2 or more offences of\nmurder, whether or not arising from the same circumstances;\nor\n\nin the opinion of the Court, there are any other exceptional\ncircumstances which must be taken into account and which\njustify the imposition of a sentence of death.\n\nWhere the Court sentences a person to death and the sentence of\n(3)\ndeath is not executed within a period of 5 years from the date of the\nsentence, the sentence shall be commuted by order of the Court, to a\nsentence of imprisonment that the Court shall specify having regard to\nthe guidelines set out in sections 39 and 41 of the Penal System Reform\nAct, Cap. 139.\n\nWhere  the  Court  sentences  a  person  convicted  of  murder\n(4)\nspecifically to imprisonment for life, the Court shall specify a minimum\nterm  of  imprisonment  to  be  served  by  the  convicted  person  before\nbecoming eligible for the grant of a release order.\n\nIn determining the appropriate minimum term of imprisonment\n(5)\npursuant subsection (4), the Court shall have regard to the guidelines\nset  out  in  sections  39  and  41  of  the  Penal  System  Reform  Act,\nCap. 139.\n\nWhere the Court, in sentencing a person convicted of murder,\n(6)\ndoes not impose the sentence of imprisonment for life, the Court shall\nimpose a term of imprisonment having regard to the guidelines set out\nin sections 39 and 41 of the Penal System Reform Act, Cap. Cap. 139.\n\n\f6\n\nIn this section the term \"release order\" has the meaning assigned\n\n(7)\nto it by section 2 of the Prisons Act, Cap. 168.”.\n\nInsertion of section 2A into Cap. 141\n\n3.\n2, the following section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Review of existing sentences for the offence of murder\n\n2A.(1)\nA  person  who,  prior  to  the  commencement  of  the\namendments  contained\nthe  Person\n(Amendment) Act, 2018, (Act 2018- ), was convicted of murder and\nsentenced to death and\n\nthe  Offences  Against\n\nin\n\n(a)\n\nwhose sentence was not commuted under section 78 of the\nConstitution shall have\n\n(i)\n\nhis sentence set aside by the Chief Justice; and\n\n(ii)\n\na  new  sentence  imposed  by  the  Chief  Justice  in\naccordance with section 2; and\n\n(b)\n\nwhose  sentence  was  commuted  under  section  78  of  the\nConstitution shall have\n\n(i)\n\n(ii)\n\nhis sentence and the instrument by which the sentence\nwas commuted, set aside; and\n\na  new  sentence  imposed  by  the  Chief  Justice  in\naccordance with section 2.\n\nNotwithstanding subsection (1), the sentence of death shall not\n(2)\nbe  imposed  on  a  person  whose  sentence  is  reviewed  pursuant  to\nsubsection (1).\n\n\f7\n\n(3)\nThe  Chief  Justice  shall,  in  imposing  a  new  sentence  under\nsubsection (1), take into consideration the guidelines set out in sections\n39 and 41 of the Penal System Reform Act, Cap. 139.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n\fOFFENCES AGAINST THE PERSON (AMENDMENT) BILL, 2018\n\nEXPLANATORY MEMORANDUM\n\nThe  Offences  Against  the  Person  (Amendment)  Bill,  2018  would  make\nprovision for the repeal of the mandatory imposition of the penalty of death for\nthe offence of murder under section 2 of the Offences Against the Person Act,\nCap. 141 and other matters related thereto.\n\nClause 1:\n\nClause 2:\n\nClause 1 of the Bill states that the Act may be cited as the\nOffences Against the Person (Amendment) Act, 2018.\n\nClause 2 of the Bill deletes section 2 of the Offences Against\nthe Person Act, Cap. 141 and substitutes it with a new section\n2. The proposed section 2 provides as follows:\n\nSection 2 of the Bill seeks to abolish the mandatory imposition of the\ndeath  penalty  by  expanding  the  sentencing  options  available  to  the\nCourt for the offence of murder pursuant to the decision in the case of\nSeverin and Nervais v The Queen [2018] CCJ 19 (AJ).\n\nThe Cabinet has made it clear that the death penalty should be retained\nas a punishment for the offence of murder. Accordingly section 2(1)\n(a) of the Bill makes provision for retention of the death penalty as a\npunishment for the offence of murder.\n\nSection  2(1)(b)  provides  that  a  person  convicted  on  indictment  for\nmurder may also be liable to a sentence of imprisonment for life. The\nlanguage  employed  in  terms  of  making  a  person  convicted  on\nindictment  for  murder  liable  to  imprisonment  for  life  should  be\ninterpreted in accordance with section 22(5) of the Interpretation Act,\nCap 1. This means that the sentence of imprisonment for life is to be\ninterpreted  as  the  maximum  sentence  of  imprisonment  that  can  be\nimposed by a Court on a person convicted of the offence of murder. In\nother  words,  the  Court  may,  in  its  discretion,  impose  a  sentence  of\n\ni\n\n\fOffences Against the Person\n(Amendment) Bill, 2018\n\nimprisonment  of  zero  years  to  imprisonment  for  life  but  the  Court\ncannot impose a term exceeding a term of imprisonment for life. The\nsaid  wording  allows  a  Court  to  tailor  the  punishment  to  take  into\naccount the particular characteristics of the crime and the participation\nand degree of culpability of the defendant.\n\nSection 2(2) sets out the circumstances in which the Court may impose\nthe death penalty on a person convicted of the offence of murder.\n\nSection 2(3) takes into consideration the decision in Pratt v. Morgan\n[1993] 4 All E.R. 769. Thus, section 2(3) requires that where the Court\nsentences a person to death, that sentence must be executed within a\nfive  year  period  or  risk  being  in  breach  of  section  15  of  the\nConstitution  which  seeks  to  protect  a  person  from  being  subject  to\ntorture  or  to  inhuman  or  degrading  punishment  or  other  treatment.\nWhere the sentence is not executed before the expiration of the said\ntime, the sentence must be commuted to a punishment to be determined\nby the Court having regard to the guidelines set out in sections 39 and\n41 of the Penal System Reform Act, Cap. 139.\n\nSection 2(4) enables the Court to impose a sentence of imprisonment\nfor life on a person convicted of the offence of murder. The Caribbean\nCourt of Justice has indicated in the case of August & Alwin Gabb v.\nThe Queen [2018] CCJ 7 (AJ) that a sentence for imprisonment for life\nshould not prohibit the possibility for parole. If the provision does so\nit is unconstitutional. Considering the aforementioned, the proposed\nsection 2(3) provides for the imposition of a sentence of imprisonment\nfor life on a person convicted of the offence of murder with the Court\nbeing empowered to set a minimum period of imprisonment before the\nperson convicted of the offence of murder can become eligible for the\ngrant of a release order. Provision has been made in the Prisons Act,\nCap.  168  for  the  establishment  of  an  entity  to  be  known  as  the\n“Prisoners  Release  Board”  which  is  given  the  appropriate  judicial\npowers to grant release orders.\n\nii\n\n\fOffences Against the Person\n(Amendment) Bill, 2018\n\nSection 2(5) states that where the Court is determining the minimum\nperiod of imprisonment in relation to the imposition of the sentence of\nimprisonment for life, the Court shall take into account the guidelines\nset  out  in  sections  39  and  41  of  the  Penal  System  Reform  Act,\nCap. 139.\n\nBearing  in  mind  that  the  language  in  section  2(1)(b)  expresses  the\nmaximum sentence of imprisonment that can be imposed on a person\nconvicted for murder, section 2(6) provides that where the Court, in\nsentencing a person convicted of murder, does not impose the sentence\nof imprisonment for life, the Court shall impose a term of imprisonment\nwhich takes into account the guidelines set out in sections 39 and 41\nof the Penal System Reform Act, Cap. 139.\n\nSection 2(7) provides that the term “release order” should be assigned\nthe meaning accorded to it by section 2 of the Prisons Act, Cap. 168.\n\nClause 3:\n\nClause 3 of the Bill inserts a new section 2A into the Offences\nAgainst the Persons Act, Cap. 141 in order to address the re-\nsentencing  of  certain  persons.  The  explanation  of  the\nsubsections in the new section 2A is set out as follows:\n\nSection  2A  (1)  (a)  seeks  to  address  persons  who  have  already  been\nsentenced under the current Offences Against the Persons Act, Cap.\n141. The persons who were sentenced already must be re-sentenced\nbecause the original sentences have been deemed to be unconstitutional\nby the Inter-American Court of Human Rights in Case 12.645: Tyrone\nDacosta Cadagon v. Barbados.\n\nSection 2A (1)(b) seeks to address persons who have been pardoned\nby the Governor-General pursuant to section 78 of the Constitution.\nThe persons who were pardoned must have their punishments reviewed\nbecause  their  sentence  was  commuted  in  response  to  the  fact  that\nBarbados did not have discretion to impose a punishment other than\n\niii\n\n\fOffences Against the Person\n(Amendment) Bill, 2018\n\nthe  death  penalty.  The  aforementioned  constitutes  an  abuse  of  the\nprerogative of mercy set out in section 78 of the Constitution.\n\nSection 2A (2) makes it clear that in reviewing the sentences of persons\nspecified in subsection (1) of section 2A, the sentence of death cannot\nbe imposed.\n\nSection  2A(3)  states  that  the  guidelines  that  should  inform  the  re-\nsentencing of persons pursuant to subsection (1) are those guidelines\nset  out  in  sections  39  and  41  of  the  Penal  System  Reform  Act,\nCap. 139.\n\niv\n\n"
}