{
  "bill_id": 308,
  "slug": "penal-system-reform-amendment-act-2018",
  "title": "Penal System Reform (Amendment) Act, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/e6d273013e42740c76c8000ceb84b034.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-09-19",
  "first_reading": "2018-11-07",
  "gazette_date": "2018-08-27",
  "markdown": "Explanatory Memorandum after page 6\n\n2018-08-08\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Penal System Reform Act, Cap. 139 to improve\n\n(a)\n\nthe guidelines applicable to the mitigation of an offender’s sentence;\nand\n\n(b)\n\nthe general judicial sentencing guidelines.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nAmendment of section 39 of Cap. 139\n\nAmendment of section 41 of Cap. 139\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Penal System Reform Act, Cap. 139.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2018.\n\nThis Act may be cited as the Penal System Reform (Amendment) Act,\n\n\f4\n\nAmendment of section 39 of Cap. 139\n\nSection 39 of the Penal System Reform Act, Cap. 139, in this Act\n2.\nreferred  to  as  the  principal  Act,  is  amended  by  deleting  subsection  (1)  and\nsubstituting the following:\n\n“Consideration of mitigating factors\n\n39.(1)\nNothing  in  this  Act  prevents  a  court  from  mitigating  an\noffender’s  sentence  by  taking  into  account  such  matters  as,  in  the\nopinion  of  the  court,  are  relevant  considerations  with  respect  to  the\nmitigation of a sentence, including\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe age of the offender;\n\nthe particular circumstances of the offender such as his social\nor economic circumstances;\n\nwhether the offender pleaded guilty and the point at which\nthe guilty plea was made;\n\nthe circumstances or facts of the offence and the degree of\nthe offender’s involvement in the offence;\n\nany  attempt  by  the  offender  to  make  reparation  for  the\noffence.”.\n\nAmendment of section 41 of Cap. 139\n\n3.\nsubstituting the following:\n\nThe  principal  Act  is  amended  by  repealing  section  41  and\n\n\f5\n\n“Judicial sentencing guidelines\n\n41.(1)\nWithout prejudice to sections 33 to 40, a court in sentencing\nan  offender  convicted  by  the  court  shall  observe  the  sentencing\nguidelines in subsection (2).\n\nIn sentencing an offender, the court shall take into account the\n\n(2)\nfollowing guidelines:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nthe gravity of the offence and the need to hold the offender\naccountable  for  the  harm  done  to  the  victim  and  the\ncommunity by the commission of the offence;\n\nany written representation made by a spouse or relative of the\ndeceased, in respect of murder or manslaughter and in any\nother case any written representation from the victim;\n\nensuring  that  the  gravity  of  the  sentence  is  commensurate\nwith the nature of the offence committed by the offender;\n\nthe need to deter the offender and others from committing\nsimilar offences;\n\nthe manner in which the offender executed the offence and\nthe  nature  and  duration  of  the  relationship  between  the\noffender and the victim;\n\nthe degree of culpability of the offender and the maximum\npenalty prescribed for the offence;\n\nany attempt on the part of the offender to make reparation to\nthe victim or the victim’s family;\n\nthe need for the rehabilitation of the offender, and the need\nto promote a sense of responsibility on the part of the offender\nfor the harm done to the victim;\n\n\f6\n\n(i)\n\n(j)\n\nthe need for consistency in sentencing in respect of similar\noffences; and\n\nthe possibility of providing restitution for the harm done by\nthe offender.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n\fPENAL SYSTEM REFORM (AMENDMENT) BILL, 2018\n\nEXPLANATORY MEMORANDUM\n\nThe Penal System Reform (Amendment) Bill, 2018 would amend the Penal\n\nSystem Reform Act, Cap. 139 to improve\n\n(a)\n\nthe guidelines applicable to the mitigation of an offender’s sentence;\nand\n\n(b)\n\nthe judicial sentencing guidelines in general.\n\nThe sentencing guidelines set out in sections 39 and 41 of the Penal System\nReform  Act,  Cap.  139  applied  to  offences  the  sentencing  for  which  was\ndiscretionary. The new Offences Against the Person (Amendment) Bill, 2018 will\nchange the status of the sentence for the offence of murder from one that is fixed\nby a mandatory sentence to one that is discretionary in nature. Thus the sentence\nimposed  for  murder  can  be  tailored  to  fit  the  circumstances  of  the  case  and\nindividuality  of  the  offender.  As  a  consequence  of  the  aforementioned\namendment, it was determined that it was necessary to amend sections 39 and 41\nof the Penal System Reform Act, Cap. 139 to ensure that they apply appropriately\nto the offence of murder.\n\nClause 1:\n\nClause 2:\n\nClause 3:\n\nClause 1 states that the Act should be cited as the Penal System\nReform (Amendment) Act, 2018.\n\nClause 2 repeals and replaces section 39 of the Penal System\nReform Act, Cap. 139 to provide for the improvement of the\nguidelines  applicable  to  the  mitigation  of  an  offender’s\nsentence.\n\nClause 2 repeals and replaces section 41 of the Penal System\nReform Act, Cap. 139 to provide for the improvement of the\ngeneral judicial sentencing guidelines.\n\ni\n\n"
}