{
  "bill_id": 310,
  "slug": "road-traffic-amendment-bill-2018",
  "title": "Road Traffic (Amendment) Bill, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/2132178d0b229703a77a02c5492990f1.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-08-29",
  "first_reading": "2018-08-29",
  "gazette_date": "2018-09-10",
  "markdown": "2018-10-26\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Road  Traffic  Act,  Cap.  295  to  provide  for  the\nabolition of the payment of road tax, to provide for the payment of registration\nfees for motor vehicles and to provide for related matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 Cap. 295\n\nAmendment of Cap. 295\n\nInsertion of Part IA and sections 4A and 4B into Cap. 295\n\nAmendment of section 5 of Cap. 295\n\nAmendment of section 5A of Cap. 295\n\nInsertion of sections 5B and 5C into Cap. 295\n\nAmendment of section 6 of Cap. 295\n\nAmendment of section 7 of Cap. 295\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nAmendment of section 10 of Cap. 295\n\n11.\n\nAmendment of section 10A of Cap. 295\n\n12.\n\nAmendment of section 10B of Cap. 295\n\n13.\n\nAmendment of section 10D of Cap. 295\n\n14.\n\nAmendment of section 11 of Cap. 295\n\n15.\n\nAmendment of section 12A of Cap. 295\n\n\f3\n\n16.\n\nAmendment of Part III of Cap. 295\n\n17.\n\nAmendment of section 15 of Cap. 295\n\n18.\n\nInsertion of section 15C into Cap. 295\n\n19.\n\nAmendment of section 16 of Cap. 295\n\n20.\n\nInsertion of section 16A into Cap. 295\n\n21.\n\nAmendment of section 18 of Cap. 295\n\n22.\n\nAmendment of section 19 of Cap. 295\n\n23.\n\nAmendment of section 20 of Cap. 295\n\n24.\n\nAmendment of section 21 of Cap. 295\n\n25.\n\nAmendment of section 23 of Cap. 295\n\n26.\n\nAmendment of section 24 of Cap. 295\n\n27.\n\nAmendment of section 25 of Cap. 295\n\n28.\n\nAmendment of section 27 of Cap. 295\n\n29.\n\nAmendment of section 29 of Cap. 295\n\n30.\n\nAmendment of section 30 of Cap. 295\n\n31.\n\nAmendment of section 34 of Cap. 295\n\n32.\n\nAmendment of section 37 of Cap. 295\n\n33.\n\nRepeal of sections 17, 22, and 41 of Cap. 295\n\n\f4\n\n34.\n\nAmendment of the First Schedule to Cap. 295\n\n35.\n\nAmendment of the Second Schedule to Cap. 295\n\n36.\n\nAmendment of the Fourth Schedule to Cap. 295\n\n37.\n\nAmendments of certain enactments\n\n38.\n\nCommencement\n\nFIRST SCHEDULE\n\nSECOND SCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Road Traffic Act, Cap. 295 to provide for the abolition\nof the payment of road tax, to provide for the payment of registration fees for\nmotor vehicles and to provide for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n\nThis Act may be cited as the Road Traffic (Amendment) Act, 2018.\n\nAmendment of section 2 Cap. 295\n\n2.\nthe principal Act, is amended in subsection (1)\n\nSection 2 of the Road Traffic Act Cap. 295, in this Act referred to as\n\n(a)\n\nby inserting the following definitions in the appropriate alphabetical\norder:\n\n“ “articulated vehicle” means a motor vehicle drawing a trailer that is\nso attached to the motor vehicle by partial superimposition thereon\nthat a substantial part of the weight of the trailer is borne by the\nmotor vehicle;\n\n“commercial vehicle” means a motor vehicle or trailer that is used for\n\nhire, reward or in a business enterprise;\n\n“private motor vehicle” means a motor vehicle that is used exclusively\nfor private purposes and not used for hire, reward or in a business\nenterprise;”;\n\n(b)\n\n(c)\n\n(d)\n\nby deleting the words “11 to 24” in the definition of “minibus” and\nsubstituting the words “11 to 57”;\n\nby  deleting  the  number  “15”  in  the  definition  of  “route  taxi”  and\nsubstituting the number “20”;\n\nby deleting the definition of “registration number” and substituting\nthe following:\n\n\f7\n\n“ “registration number” means the number assigned by the Licensing\nAuthority to an owner of a motor vehicle or bicycle and includes\na letter which indicates\n\n(a)\n\nthe parish in which the motor vehicle or bicycle is registered;\nor\n\n(b)\n\nthe trade for which the motor vehicle is used,\n\nrespectively;”; and\n\n(e)\n\nby deleting the definition of “road licence”.\n\nAmendment of Cap. 295\n\n3.\nwherever they appear and substituting the words “registration number”.\n\nThe principal Act is amended by deleting the words “road licence”\n\nInsertion of Part IA and sections 4A and 4B into Cap. 295\n\n4.\nsections immediately after section 4:\n\nThe principal Act is amended by inserting the following Part and\n\n“PART IA\n\nROAD TAX\n\nAbolition of payment of road tax\n\nNo owner of a motor vehicle shall be required to pay road\n4A.(1)\ntax on or after 1st July, 2018 in respect of the use of a motor vehicle or\nthe keeping of a motor vehicle for use on a road.\n\nNotwithstanding  subsection  (1),  any  road  tax  owed  to  the\n(2)\nLicensing Authority by an owner of a motor vehicle prior to 1st July,\n2018  may  be  recoverable  by  the  Crown  in  summary  proceedings  or\nprocess on the complaint of the Licensing Authority.\n\n\f8\n\nWhere an owner of a motor vehicle owes the Licensing Authority\n\n(3)\nroad tax in respect of the\n\n(a)\n\n(b)\n\nuse of a motor vehicle; or\n\nkeeping of a motor vehicle for use on a road,\n\nprior to 1st July, 2018, the Licensing Authority may refuse to register\nthe motor vehicle under section 5 until the road tax is paid.\n\nWaiver of road tax\n\nNotwithstanding sections 4A(2) and 4A(3), where a person\n4B.(1)\nregisters  a  motor  vehicle  with  the  Licensing  Authority  between  the\nperiod 11th June, 2018 and 1st July, 2018, 75 per cent of the amount\npayable to the Licensing Authority as road tax in respect of the motor\nvehicle shall be waived.\n\nWhere  an  owner  of  a  motor  vehicle  who  registered  a  motor\n(2)\nvehicle between the period 11th June, 2018 and 1st July, 2018 paid to\nthe  Licensing  Authority  the  full  amount  payable  as  road  tax  for  the\nmotor vehicle, he may apply in writing to the Minister of Finance for a\nrefund of 75 per cent of the road tax paid.\n\nWhere  the  Minister  of  Finance  receives  notification  in\n(3)\naccordance with subsection (2) and is satisfied that the owner of the\nvehicle paid the full amount payable as road tax for the motor vehicle,\nthe Minister shall grant the owner a refund of 75 per cent of the road\ntax paid.”.\n\nAmendment of section 5 of Cap. 295\n\n5.\nthe following:\n\nThe principal Act is amended by deleting section 5 and substituting\n\n\f9\n\n“Registration of motor vehicles\n\n5.(1)\nunless it is registered in accordance with this section.\n\nNo person shall use or keep a motor vehicle for use on a road\n\n(2)\nEvery new owner of a motor vehicle shall at the time of the initial\nregistration of that motor vehicle pay to the Licensing Authority such\nfee  for  the  initial  registration  as  the  Minister  of  Finance  by  order\nprescribes.\n\nEvery new owner of a commercial vehicle shall at the time of the\n(3)\ninitial registration of that motor vehicle pay to the Licensing Authority\nsuch fee for the initial registration as the Minister of Finance by order\nprescribes.\n\nEvery owner of a motor vehicle shall annually register the motor\n(4)\nvehicle with the Licensing Authority on the anniversary date on which\nthe vehicle was first registered.\n\nEvery owner of a commercial vehicle shall on the anniversary\n(5)\ndate  of  the  initial  registration  of  the  vehicle  pay  to  the  Licensing\nAuthority the annual registration fee for that vehicle as the Minister of\nFinance by order prescribes.\n\nSubject to subsections (2), (3) and (5), the Licensing Authority\n(6)\nshall not register a motor vehicle until the fees payable in respect of the\nmotor vehicle are paid.\n\nOn the initial registration of a motor vehicle, the owner of the\n\n(7)\nmotor vehicle shall submit the following to the Licensing Authority:\n\n(a)\n\nan application to register the motor vehicle in such form as\nthe Licensing Authority approves; and\n\n(b)\n\nthe particulars specified in the First Schedule.\n\n\f10\n\n(8)\nSubject to subsection (7), where the Licensing Authority does\nnot approve the application, the Licensing Authority shall not register\nthe motor vehicle.\n\n(9)\nA person who knowingly submits false information in respect of\nan application to register a motor vehicle is guilty of an offence and is\nliable on summary conviction to a fine of $5000 or to imprisonment for\na term of 12 months or to both.\n\nWhere a motor vehicle is registered pursuant to this section and\n(10)\nthe Licensing Authority subsequently obtains evidence that a person\nsubmitted  false  information  on  the  application  to  register  the  motor\nvehicle, the Licensing Authority may deregister the motor vehicle.\n\nThe  Licensing  Authority  shall  enter  any  particulars  received\n\n(11)\npursuant to subsection (7) in a register established for that purpose.\n\nWhere  the  Licensing  Authority  registers  a  motor  vehicle,  the\n(12)\nowner of the motor vehicle shall be assigned a registration number for\nhis use.\n\nEvery  registration  number  assigned  pursuant  to  subsection\n\n(13)\n(12) is valid for a period of one year from the date so assigned.\n\nNotwithstanding subsection (13), the Licensing Authority may\n(14)\nre-assign a registration number to another person where the person to\nwhom it was first issued fails to\n\n(a)\n\n(b)\n\nregister the motor vehicle in accordance with this section; or\n\nindicate that the registration number should be retained for\nhis use.”.\n\nAmendment of section 5A of Cap. 295\n\n6.\nthe following:\n\nThe principal Act is amended by deleting section 5A and substituting\n\n\f11\n\n“Production of evidence of insurance\n\n5A.(1)\nWhere a person desires to register a motor vehicle pursuant\nto section 5, he shall produce to the Licensing Authority the following\ninformation:\n\n(a)\n\na valid policy of insurance or such security in respect of third-\nparty risks as required by this Act in relation to the user of\nthe motor vehicle; and\n\n(b)\n\nevidence  that  the  motor  vehicle  is  not  a  motor  vehicle  to\nwhich section 37(4) applies.\n\nThe  Licensing  Authority  shall  not  register  a  motor  vehicle  or\n(2)\nissue a registration number in respect of that motor vehicle where the\nperson who applies to register the motor vehicle fails to comply with\nsubsection (1).\n\n(3)\n\nThe Licensing Authority shall\n\n(a)\n\n(b)\n\nkeep  a  record  of  the  information  received  pursuant  to\nsubsection (1); and\n\ncause the record to be available at all times to any member\nof the Police Force.”\n\nInsertion of sections 5B and 5C into Cap. 295\n\n7.\n5A the following:\n\nThe principal Act is amended by inserting immediately after section\n\n“Penalty for non-payment of registration fee\n\n5B.(1)\nAn owner of a motor vehicle who keeps it or allows it to be\nkept for use without paying the registration fee that is payable pursuant\n\n\f12\n\nto section 5 is guilty of an offence and is liable on summary conviction\nto a fine of $5 000 or to imprisonment for 12 months or to both.\n\nWhere  a  person  is  found  guilty  of  an  offence  pursuant  to\n(2)\nsubsection (1), the Licensing Authority may recover the registration fee\npursuant to section 25.\n\nA  motor  vehicle  shall  be  deemed  to  be  kept  for  use  until  the\n\n(3)\ncontrary is proved.\n\nRegistration of bicycles\n\n5C.(1)\nit is registered in accordance with this section.\n\nNo person shall use or keep a bicycle for use on a road unless\n\nAn  owner  of  a  bicycle  is,  on  application  to  the  Licensing\n(2)\nAuthority  in  such  form  as  the  Licensing  Authority  approves  and  on\npayment  to  the  Licensing  Authority  of  such  fee  as  the  Minister  by\nFinance by order prescribes, entitled to have that bicycle registered in\nthe parish in which it is usually kept.\n\nA person shall, upon making an application for registration of a\n(3)\nbicycle, furnish the Licensing Authority with his name and address and\nsuch other information as the Licensing Authority may require, and the\nLicensing Authority shall enter those particulars in a register kept by it\nfor that purpose.\n\nThe Licensing Authority shall, upon receiving the fee referred to\n(4)\nin subsection (2), assign to the owner of the bicycle for his use, a special\nnumber, to be known as the registration number, and this number shall\nbe placed on a number plate which shall be affixed in a conspicuous\nmanner in the rear of the bicycle.”.\n\n\f13\n\nAmendment of section 6 of Cap. 295\n\n8.\ndeleting the word “taxation” and substituting the word “licensing”.\n\nSection  6  of  the  principal  Act  is  amended  in  subsection  (3)  by\n\nAmendment of section 7 of Cap. 295\n\n9.\n\nSection 7 of the principal Act is amended\n\n(a)\n\n(b)\n\nin  subsection  (3)  by  inserting  the  words  “Part  I  of”  immediately\nbefore the words “the Second Schedule”; and\n\nin  subsection  (5)  by  deleting  the  words  “paragraph  (b)  of  section\n16(1)” and substituting the words “section 16(1)”.\n\nAmendment of section 10 of Cap. 295\n\n10.\n\nSection 10 of the principal Act is amended in\n\n(a)\n\n(b)\n\nsubsection (4) by inserting the words “Part I of” immediately before\nthe words “the Second Schedule”; and\n\nparagraph (a) of section 10(5) by deleting the words “public service\nvehicle” and substituting the words “commercial vehicle”.\n\nAmendment of section 10A of Cap. 295\n\n11.\n“Part I of” immediately before the words “the Second Schedule”.\n\nSection 10A of the principal Act is amended by inserting the words\n\nAmendment of section 10B of Cap. 295\n\n12.\n“Part I of” immediately before the words “the Second Schedule”.\n\nSection 10B of the principal Act is amended by inserting the words\n\nAmendment of section 10D of Cap. 295\n\n13.\nsubstituting the following:\n\nThe  principal  Act  is  amended  by  deleting  section  10D  and\n\n\f14\n\n“Registration number plates for commercial vehicles other\nthan limousines\n\n10D.\nNotwithstanding section 10, the registration number plates\nto be affixed to commercial vehicles other than limousines shall be in\naccordance  with  Part  I  of  the  Second  Schedule  except  that  the\nbackground  of  the  registration  number  plates  shall  be  white  and  the\nletters and figures thereon blue.”.\n\nAmendment of section 11 of Cap. 295\n\n14.\n\nSection 11 of the principal Act is amended\n\n(a)\n\nin subsection (1) by deleting the words “Notwithstanding sections 5\nand 10,” and substituting the words “Notwithstanding sections 5, 5B\nand 10,”; and\n\n(b)\n\nin  subsection  (2)  by  inserting  the  words  “Part  I  of”  immediately\nbefore the words “the Second Schedule”.\n\nAmendment of section 12A of Cap. 295\n\n15.\nSection  12A  of  the  principal  Act  is  amended  in  subsection  (7)  by\ninserting  the  words  “Part  I  of”  immediately  before  the  words  “the  Second\nSchedule”.\n\nAmendment of Part III of Cap. 295\n\n16.\nThe  principal  Act  is  amended  by  deleting  the  words  immediately\nfollowing the heading “PART III” and substituting the words “Licensing and\nFees”.\n\nAmendment of section 15 of Cap. 295\n\n17.\nthe following:\n\nThe principal Act is amended by deleting section 15 and substituting\n\n\f15\n\n“Investigation of vehicle\n\n15.(1)\nAuthority in writing that\n\nWhere an owner of a motor vehicle informs the Licensing\n\n(a)\n\nthe motor vehicle was not used, kept for use or allowed to be\nkept for use for a period of not less than 3 months; and\n\n(b)\n\nhe is desirous of using the motor vehicle at a future date,\n\nthe Licensing Authority shall send a transport inspector to investigate\nthe condition of the motor vehicle.\n\nWhere the Licensing Authority sends a transport inspector to do\n(2)\nan  investigation  pursuant  to  subsection  (1),  the  owner  of  the  motor\nvehicle shall pay to the Licensing Authority, prior to the investigation,\nsuch  fee  for  the  investigation  as  the  Minister  of  Finance  by  order\nprescribes. ”.\n\nInsertion of section 15C into Cap. 295\n\n18.\nnumerical order the following section:\n\nThe  principal  Act  is  amended  by  inserting  in  the  appropriate\n\n“Registration identifier\n\n15C.\nWhere  the  Licensing  Authority  registers  a  motor  vehicle\npursuant to section 5, the Licensing Authority shall issue to the owner\nof the vehicle either a\n\n(a)\n\n(b)\n\nregistration card; or\n\nregistration sticker and a registration card.”.\n\n\f16\n\nAmendment of section 16 of Cap. 295\n\n19.\nthe following:\n\nThe principal Act is amended by deleting section 16 and substituting\n\n“Registration card\n\n16.(1)\nThe  Licensing  Authority  shall,  in  respect  of  every  motor\nvehicle that is registered pursuant to section 5, issue to the owner of the\nmotor  vehicle  a  registration  card  which  specifies  the  following\ninformation:\n\n(a)\n\n(b)\n\n(c)\n\nthe name of the owner of the motor vehicle;\n\nthe registration number of the motor vehicle;\n\nthe  appropriate  letter  contained  in  Part  I  of  the  Fourth\nSchedule representing the parish in which the motor vehicle\nis registered or the appropriate letter and use for which the\nmotor vehicle is kept as set out in Part II and Part III of the\nFourth Schedule; and\n\n(d)\n\nthe duration for which the registration card is valid.\n\nWhere a person uses a motor vehicle on a road, he shall have in\n(2)\nhis possession the registration card issued for the motor vehicle and\nshall produce it for examination on being required to do so by a member\nof  the  Police  Force  or  a  transport  inspector  in  uniform,  so  that  the\nmember of the Police Force or the transport inspector is able to ascertain\nthe owner of the motor vehicle.\n\nSubject  to  subsection  (2),  where  a  person  fails  to  produce  the\n(3)\nregistration  card,  he  shall  produce  the  registration  card  at  a  police\nstation designated by the member of the Police Force or the transport\ninspector  within  24  hours  of  the  date  on  which  he  was  required  to\nproduce it.\n\n\f17\n\n(4)\nA person who contravenes subsection (2) or (3) is guilty of an\noffence and is liable on summary conviction to a fine of $5 000 or to\nimprisonment for a term of 12 months or to both.”\n\nInsertion of section 16A into Cap. 295\n\n20.\n16 the following:\n\nThe principal Act is amended by inserting immediately after section\n\n“Registration sticker\n\n16A.(1)\nshall be designed in accordance with Part II of the Second Schedule.\n\nA registration sticker issued in accordance with section 15C\n\n(2)\nWhere an owner of a motor vehicle is issued a registration sticker\npursuant to section 15C, he shall cause the registration sticker to be\naffixed to the top right hand corner of the rear registration number plate\nof the motor vehicle.\n\nA person shall not on a road, use a motor vehicle that does not\n(3)\nhave a valid registration sticker affixed on a rear registration number\nplate in accordance with subsection (2).\n\nA person who contravenes subsection (2) or (3) is guilty of an\n(4)\noffence and is liable on summary conviction to a fine of $5 000 or to\nimprisonment for a term of 12 months or to both.”.\n\nAmendment of section 18 of Cap. 295\n\n21.\nthe following:\n\nThe principal Act is amended by deleting section 18 and substituting\n\n\f18\n\n“Change of ownership of motor vehicle\n\n18.(1)\nWhere the ownership of a motor vehicle, in respect of which\na valid registration number exists, is transferred to another person, the\ntransferor of the motor vehicle shall\n\n(a)\n\nnotify the Licensing Authority in writing of the\n\n(i)\n\ntransfer of ownership;\n\n(ii)\n\nname and address of the new owner of the motor vehicle;\nand\n\n(b)\n\nreturn the registration card to the Licensing Authority.\n\nThe new owner of the motor vehicle referred to in subsection (1)\n\n(2)\nshall upon the transfer of the vehicle\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nnotify  the  Licensing  Authority  in  writing  of  the  change  of\nownership;\n\nstate in the notice the name and address of the person from\nwhom the motor vehicle was obtained;\n\nproduce  to  the  Licensing  Authority  a  valid  insurance\ncertificate or security in respect of the motor vehicle;\n\nsubmit to the Licensing Authority any evidence that it may\nrequire  to  establish  the  validity  of  the  change  of  the\nownership; and\n\n(e)\n\npay  the  registration  fee  for  the  motor  vehicle  pursuant  to\nsection 5.\n\nWhere  the  Licensing  Authority  receives  notice  pursuant  to\n(3)\nsubsections (1) and (2) and is satisfied as to the validity of the change\nof  ownership  of  the  motor  vehicle,  section  5  shall  apply  with  such\nmodifications and adaptations as may be necessary.\n\n\f19\n\n(4)\nA registration number is not to be treated as being transferred to\na new owner of a motor vehicle and the new owner is not entitled to\nuse such motor vehicle in accordance with the terms and conditions of\nthat registration number.\n\n(5)\n\nAny person who\n\n(a)\n\nis required by this Act to submit information in connection\nwith a change of registration of any motor vehicle and fails\nto do so; or\n\n(b)\n\nknowingly submits false information in respect of the change\nof registration of a motor vehicle,\n\nis guilty of an offence and is liable on summary conviction to a fine of\n$5000 or to imprisonment for a term of 12 months or to both.”.\n\nAmendment of section 19 of Cap. 295\n\n22.\nthe following:\n\nThe principal Act is amended by deleting section 19 and substituting\n\n“Exemption from payment of registration fee by person\nstaying temporarily in Barbados\n\n19.(1)\nNotwithstanding  anything  contained  in  this  Act,  where  a\nperson visits Barbados for a period not exceeding 6 months and brings\na motor vehicle into Barbados for his own use during such visit, he may\napply in writing to the Licensing Authority for a registration number to\nbe assigned to the motor vehicle.\n\nWhere a person makes an application for a registration number\n(2)\npursuant to subsection (1), he shall submit the following information\nwith the application:\n\n(a)\n\na bill of laden for the motor vehicle;\n\n\f20\n\n(b)\n\nevidence  of  a  valid  insurance  policy  or  such  security  in\nrespect of third-party risks issued by an insurer for the motor\nvehicle; and\n\n(c)\n\nevidence that the person holds a valid road licence for the\nmotor vehicle.\n\nWhere the Licensing Authority approves an application received\n(3)\npursuant to subsection (1), the Licensing Authority may issue to the\napplicant  a  registration  number  for  the  motor  vehicle  for  a  period\ncovered by the road licence referred to in subsection 2(c).\n\nWhere  the  Licensing  Authority  issues  an  applicant  with  a\n(4)\nregistration number pursuant to subsection (3), the registration number\nshall not be issued for a period greater than 90 days.\n\nWhere the Licensing Authority issues a person with a registration\n(5)\nnumber for a motor vehicle pursuant to this section, section 16 shall\napply to this section with such adaptations and modifications as may\nbe necessary.\n\nThis section does not operate in favour of a visitor to Barbados\n(6)\nif  the  country  in  which  the  visitor’s  road  licence  is  issued  does  not\naccord reciprocal treatment in respect of a registration number issued\nin Barbados.\n\nFor  the  purposes  of  this  section,  reference  to  the  term  “road\n(7)\nlicence” means a registered identification number that an authorised\nentity in a country other than Barbados assigns to a motor vehicle on\nregistration of that motor vehicle in that country.”.\n\nAmendment of section 20 of Cap. 295\n\n23.\n\nSection 20 of the principal Act is amended\n\n(a)\n\nby deleting the shoulder note and substituting the following:\n\n\f21\n\n“Exemption from registration fee for motor vehicles used for\nagricultural purposes and the use on the road of such\nvehicles”; and\n\n(b)\n\nin subsection (1) by deleting the word “taxation” and substituting the\nwords “registration fees”.\n\nAmendment of section 21 of Cap. 295\n\n24.\n\nSection 21 of the principal Act is amended by deleting the\n\n(a)\n\nshoulder note and substituting the following:\n\n“Exemption of other vehicles from the payment of\nregistration fee”; and\n\n(b)\n\nwords “No tax is” in subsection (1) and substituting the words “No\nregistration fee is”.\n\nAmendment of section 23 of Cap. 295\n\n25.\nthe following:\n\nThe principal Act is amended by deleting section 23 and substituting\n\n“Penalty on driver for refusal to disclose name of owner of\nvehicle\n\n23.(1)\nA person who uses a motor vehicle in respect of which a fee\nis payable under this Act shall, on being required by a person authorised\nby the Licensing Authority or by a member of the Police Force, give\nthe name and address of the owner of that vehicle.\n\n\f22\n\n(2)\nA person who contravenes subsection (1) is guilty of an offence\nand  is  liable  on  summary  conviction  to  a  fine  of  $5000  or  to\nimprisonment for a term of 12 months or to both.”.\n\nAmendment of section 24 of Cap. 295\n\n26.\n\nSection 24 of the principal Act is amended by deleting the\n\n(a)\n\nword  “tax”  wherever  it  appears  and  substituting  the  words\n“registration fee”; and\n\n(b)\n\nwords “and taxes” in subsection (6).\n\nAmendment of section 25 of Cap. 295\n\n27.\nthe following:\n\nThe principal Act is amended by deleting section 25 and substituting\n\n“Recovery of fees\n\n25.\nA  fee  imposed  pursuant  to  this  Act  is  recoverable  in\nsummary  proceedings  or  process  on  the  complaint  of  the  Licensing\nAuthority.”.\n\nAmendment of section 27 of Cap. 295\n\n28.\nand substituting the following:\n\nSection 27 of the principal Act is amended by deleting subsection (1)\n\n“(1)\nAll payments of fees made to the Licensing Authority in respect\nof a motor vehicle shall, where such fees are computed on the weight\nof the vehicle while it is unladen, be accompanied by a certificate, in\nthe  form  set  out  in  the  Third  Schedule,  of  the  weight  of  the  vehicle\nunladen issued by an official weigher. ”.\n\n\f23\n\nAmendment of section 29 of Cap. 295\n\n29.\nin subsection (4) and substituting the word “fee”.\n\nSection 29 of the principal Act is amended by deleting the word “tax”\n\nAmendment of section 30 of Cap. 295\n\n30.\nin subsection (4) and substituting the word “fee”.\n\nSection 30 of the principal Act is amended by deleting the word “tax”\n\nAmendment of section 34 of Cap. 295\n\n31.\nthe following:\n\nThe principal Act is amended by deleting section 34 and substituting\n\n“Production, alteration and use of registration card or\nregistration sticker\n\n34.(1)\nregistration sticker\n\nNo  person  shall  manufacture  a  registration  card  or  a\n\n(a)\n\n(b)\n\nother than the Licensing Authority; or\n\nthe  Licensing  Authority\na  person  authorised  by\nmanufacture the registration card or registration sticker.\n\nto\n\n(2)\n\nNo person shall\n\n(a)\n\n(b)\n\nmake a fraudulent imitation of; or\n\nfraudulently alter or use,\n\na registration card or a registration sticker.\n\nNo person shall fraudulently lend to another person a registration\n(3)\ncard or a registration sticker issued to him in accordance with this Act.\n\n\f24\n\n(4)\nA person who contravenes this section is guilty of an offence and\nis liable on summary conviction to a fine of $5 000 or to imprisonment\nfor a term of 12 months or to both. ”.\n\nAmendment of section 37 of Cap. 295\n\nSection  37  of  the  principal  Act  is  amended  in  subsection  (2)  by\n32.\ndeleting the words “$1000 or to imprisonment for a term of 6 months, or both”\nin subsection (1) and substituting the words “$5 000 or to imprisonment for a\nterm of 12 months or to both”.\n\nRepeal of sections 17, 22, and 41 of Cap. 295\n\n33.\n\nSections 17, 22, and 41 of the principal Act are repealed.\n\nAmendment of the First Schedule to Cap. 295\n\n34.\nset out in the First Schedule to this Act is substituted.\n\nThe First Schedule to the principal Act is deleted and the Schedule\n\nAmendment of the Second Schedule to Cap. 295\n\n35.\n\nThe Second Schedule to the principal Act is amended by\n\n(a)\n\ndeleting the heading “Registration Number Plates” and substituting\nthe following:\n\n“PART I\n\nREGISTRATION NUMBER PLATES”;\n\n(b)\n\ninserting immediately after paragraph 4, the following:\n\n\f25\n\n“PART II\n\nREGISTRATION STICKERS\n\n1.\n\nA registration sticker shall\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nmeasure 1.75 inches in length and 1 inch in height;\n\nhave a colour as determined by the Licensing Authority;\n\ncontain the first 3 letters of the month and the last 2 digits\nof the year in which the registration sticker expires; and\n\ncontain  a  serial  number  issued  by  the  Licensing\nAuthority.”.\n\nAmendment of the Fourth Schedule to Cap. 295\n\n36.\nPart II and substituting the following:\n\nThe Fourth Schedule to the principal Act is amended by deleting\n\n“PART II\n\nCommercial Vehicles\n\nColumn 1\n\nUSE\n\nColumn 2\n\nLETTER\n\nTaxi\n\nMaxi-taxi\n\nRoute-taxi\n\nSelf-driven or Hired Car, Hired\nMotorcycle and Hired All\nTerrain Vehicle\n\nZ\n\nZM\n\nZR\n\nH\n\n\f26\n\nColumn 1\n\nUSE\n\nColumn 2\n\nLETTER\n\nLimousine\n\nMinibus\n\nMotor Omnibus\n\nTour Coach\n\nMinibus:\n\nHL\n\nB\n\nBM\n\nBT\n\n*B\n\n(i) Operated by a church\n     registered as a charity\n\n(ii) Operated by a school\n      approved by the Ministry of\n      Education\n\n(iii) Operated by an organisation\n       registered as a charity\n\n(iv) Operated by a hotel or a\n       company\n\nMotor Vehicle with 2 or 3 axles,\nArticulated Vehicle, Tractor and\nTrailer\n\nC\n\n”.\n\nAmendments of certain enactments\n\nThe enactments set out in the first column of the Second Schedule\n37.\nto this Act are amended in the manner set out opposite thereto in the second\ncolumn.\n\n\f27\n\nCommencement\n\n38.\nThe amendments directed to be made to the principal Act by section\n16A and Part II of the Second Schedule shall come into operation on a date to\nbe fixed by proclamation.\n\n\f28\n\n L.R.O. 1998Particulars of Motor Vehicle•  Full name, number and address of owner of motor vehicle:Description,Make and Seating CapacityClassiﬁ cationof the Motor Vehicle(e.g. Private MotorVehicle orCommercialVehicle)The category of the Private MotorVehicle orCommercialVehicle(e.g. Car, MotorCycle,Taxi, All Terrain Vehicle)Weight UnladenDate ofRegistration(dd/mm/yr)Name ofInsurer andduration of Insurance PolicyThe parish the Private Motor Vehicle is tobe used or keptMaximumGross WeightRegistration NumberFIRST SCHEDULE(Section 34)\"FIRST SCHEDULE(Section 5(7)(b))\".\f29\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosSECOND SCHEDULE(Section 37)Column 1Enactments1. Road Trafﬁ c Regulations, 1984 (S.I. 1984 No. 141)2.  Road Traffic (Bicycle  Registration Fee) Order,    2009 (S.I. 2009 No. 147)3.  Road Trafﬁ c (Motor Vehicle Insurance) Regulations, 1985 (S.I. 1985 No. 98)Column 2AmendmentsIn regulation 2 delete the definition \"articulatedvehicle\".In paragraph 2 delete the words \"5A(2)\" andsubstitute the words \"5C(2)\". 1. In regulation 4 insert immediately following paragraph (1) the following: \"(1A) The insurer shall state on thepolicy whether the vehicle is insured as a commercial vehicle or a privatemotor vehicle.\". 2. In regulation 10, delete(a) paragraph (1) and substitute the following: \"(1) Subject to this regulation, at the time of the registration of a motorvehicle under section 5 of the Act, it shall be deemed sufﬁ cient to be in compliance with section 5A of the Act if at such time there is produced to the Licensing Authority a certificate of insurance or a certiﬁ cate of security issued in accordance with regulation4 indicating that on the date when the registration takes effect there will be in force a policy or security in relation \f30\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosColumn 2Amendmentsto the use of the motor vehicle by theapplicant or by other personsauthorized by him.\";(b) the number \"41\" in paragraph (2) and substitute the words \"5A\"; and (c) the words \"or the date on which the tax is due\" in paragraph (2)(a). 3. Delete Form A of the Schedule and substitute the following:\"Form A(Regulations 4 and 6)THE ROAD TRAFFIC ACT, CAP. 295CERTIFICATE OF INSURANCE (I) or (WE) HEREBY CERTIFY thata policy of Insurance covering theliabilities required to be covered bythe Road Traffic Act, Cap. 295 hasbeen issued as follows:  1. Name of Policy holder 2. Policy No. Column 1Enactments3. Road Trafﬁ c (Motor Vehicle Insurance) Regulations, 1985 (S.I. 1985 No. 98)- (Cont'd)Second Schedule - (Cont'd)\f31\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosColumn 2Amendments 3. Date of commencement of  insurance 4. Date of expiry 5. Vehicle(s) covered and the  category of vehicle(s) covered:(a)                                      ;(b)                                      ;(c)                                      ...............................................................In paragraph 2 delete the words \"15(3)\" andsubstitute the words \"15(2)\".Column 1Enactments3. Road Trafﬁ c (Motor Vehicle Insurance) Regulations, 1985 (S.I. 1985 No. 98)- (Concl'd)4. Road Traffic (Vehicle Investigation Fee) Order,  2009 (S.I. 2009 No. 142)Second Schedule - (Concl'd)Authorised Insurer\"."
}