{
  "bill_id": 313,
  "slug": "resolution-re-vesting-of-land-in-nhc-at-cluffs-saint-lucy",
  "title": "Resolution re vesting of Land  in NHC at Cluffs  Saint Lucy",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/30ac097dabc8267d69095335309d407f.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-11-20",
  "first_reading": "2018-12-12",
  "gazette_date": null,
  "markdown": "PARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 approve the vesting in the National Housing Corporation of the parcel of land, the property of the Crown, situate at Cluffs in the parish of Saint Lucy in this Island and more particularly described in the Schedule hereto for the \"Sites and Service Project\".\nAPPROVED by the House of Assembly this day of thousand and Eighteen.\nTwo thousand and Eighteen.\nSPEAKER\nAPPROVED by the Senate this\nday of\nTwo thousand and Eighteen.\nPRESIDENT\n;\nSCHEDULE\nALL THAT land the property of the Crown situate at Cluffs in the parish of Saint Lucy in this Island containing by admeasurement 8,265.1 square metres or thereabouts Abutting and Bounding on lands now or late of Winifred Worrell on lands now or late of John Phillips on lands now or late of Troy Barker on lands now or late of Michael Clarke on the Lots 8, 7 and 6 on a right-of-way on the Lots 5, 3, 4, 2 and 1 situate in Cluffs Tenantry and on a verge which is part of a public road leading to Roaches in one direction and to St. Swithins in the other direction or however else the same may abut and bound as shown and delineated on a Plan certified on the 14\" day of July, 2017 by Anderson R. Alleyne, Land Surveyor and recorded in the Lands and Surveys Department on the 14\" day of July, 2017 as Plan No. 678/2017.\nADDENDUM\nOn the 234 day of November, 2017, the Cabinet agreed to the vesting of 8,265.1 square metres of land situate at Cluffs in the parish of Saint Lucy in this Island in the National Housing Corporation for the Sites and Services Project.\nThe parcel of land described in the Schedule is part of a larger parcel of land containing by admeasurement 1.965 hectares acquired by the Crown in accordance with section 5 of the Land Acquisition Act, Cap. 225 as published in the Official Gazette on the 28\" day of March, 1991 as 8.1. 1991 No. 28 for the public purpose of housing development.\nA portion of the said 1.965 hectares of land was previously sub-divided into eighteen (18) Lots and sold to the tenants under the Tenantries Freehold Purchase Act, Cap. 239B.\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is now sought for the vesting in the National Housing Corporation of the parcel of land more particularly described in the Schedule to the Resolution.\n\nLANDS AND SURVEYS DEPARTMENT\nAppendix |\nParish of: St. .ucy\nSurvey Drder Mo: 20/2007 Correspondenen Mo 0407/1708\na 122 M069 wv HN N4.55 ney SEER\nCults eco. ty\nCradle ad eit * sf we Wor eet f Cd rer f \\ %, f Y i ry Xe E99 FB? Ba PS Ye it 90 747 Wn 2 ay x 7 3 4.06 oN .] - A tra. bent flores & seplacnd 4. yy % / é ve \\ \\ VoN* . Clulfs fenaniry Oy EN ka \\ co wed beat CaN 73 Be ee emplaced Bt AN Ny lal? sr BAG \\y. Z Sys AO gee a ‘ LE — 4 e ae HGS eo , E22 620.20 m’ NON ve AEP ote * ia :) 90. 716.70 m, , Pot G = 5. “a lol 3 ae Fe a: i Michael ¥ ss 2 \\ - Vahl ae nee Pa Xe Dy on 8 Lol 5 y \\° \\, Clulis Tenantry ge oe \\ io, Lot 6 \\ 20-7 oe a Clorce V\\ Una\" g cs \\ We a xg . \\\" 4 tot 7 . \\ 7% x no wot 8 Var a8? 8 weer Poy Yes Note A Serotes -ouses “het ore ey Burbabog , Sighs sai ro: m ofecoee OF LAND SCALE 1.800 ! Distonces are ‘a metres\n\\\nencccerning\nie\nPLAN\nal\ncontaining\nCuffs, Si, uty\n_ond.. 265.7 se.rr. {green}\nJ} } j |\nDistonces are ‘a metres Beorings ore feferred to Grid Kona derived trom 3. L. 8. control M20 & 69S.\n© denotes won found un.ess otherwise stoles\ndenotes tron put o\nsarceyed for\nMinisley of Housing, Lanes anh Rural Development\nJ\nfa denoles thane’ enh olherarr Gules\nse denotes, tl wr > put\n© denotes computed point\nceriified\n14th July,\n2017\nLond Tox g- port of 04.02.02.010\nee\n\nFor Leads and Surveys Dept ony\n’\n;\n!\n|\n|\n1\n:\n'\ni !\n"
}