{
  "bill_id": 319,
  "slug": "dematerialisation-of-government-securities-bill-2018",
  "title": "Dematerialisation of Government  Securities Bill, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/1b0a4d4a3dddd2819a0c2eb6a7392cdc.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-10-24",
  "first_reading": "2018-10-24",
  "gazette_date": null,
  "markdown": "2018-10-22\n\nOBJECTS AND REASONS\n\nThis  Bill  would  make  provision  for  the  dematerialisation  of  Government\n\nsecurities and other matters related thereto.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPreliminary\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nApplication\n\nPART II\n\nAdministration\n\nAppointment of Registrar\n\nRegister\n\nRegister is prima facie evidence\n\nPART III\n\nDematerialisation of Government Securities\n\nDematerialisation\n\nNotice respecting conversion of Government securities\n\nConversion and transfer of Government securities\n\n\f3\n\nPART IV\n\nMiscellaneous\n\n10.\n\nImmunity of officers of the Bank\n\n11.\n\nRegulations\n\n12.\n\nMinister may amend Schedule\n\nSCHEDULE\n\nSPECIFIED ACTS\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the dematerialisation of Government securities and\n\nother matters related thereto.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPreliminary\n\nShort title\n\n1.\nSecurities Act, 2018.\n\nThis  Act  may  be  cited  as  the  Dematerialisation  of  Government\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Bank” means the Central Bank of Barbados established by the Central Bank of\n\nBarbados Act, Cap. 323C;\n\n“dematerialised”  in  relation  to  a  Government  security  means  that  the  prima\nfacie  evidence  of  the  existence  of  legal  title  or  any  trade  or  transaction\nrespecting the ownership of a Government security is established by an entry\nin the Register in an electronic form made in accordance with this Act;\n\n“dematerialisation” means the issuance, registration, recording and transfer of a\n\nGovernment security in electronic form;\n\n“electronically transferred” means the transfer of ownership of a Government\nsecurity by electronic, digital, magnetic, wireless, optical, electromagnetic\n or other similar capabilities;\n\n“Government security”means\n\n(a)\n\na savings bond, debenture, treasury bill, tax certificate or treasury note\nissued by the Government in accordance with an Act specified in the\nSchedule; and\n\n(b)\n\nsuch  other  security  as  may  be  issued  by  or  guaranteed  by  the\nGovernment from time to time;\n\n“licensed central securities depository”  means a self-regulatory organisation;\n\n\f7\n\n“Register” means a register kept in accordance with section 5;\n\n“Registrar” means a person or body designated as the Registrar in accordance\n\nwith section 4;\n\n“securities account”  means  an  account to which a financial asset is or may be\ncredited  in  accordance  with  an  agreement  under  which  the  person\nmaintaining the account undertakes to treat the person for whom the account\nis maintained as entitled to exercise the rights that comprise the financial\nasset;\n\n“self-regulatory  organisation”  means  a  person  who  is  approved  to  carry  on\nbusiness as a central securities depository in accordance with the Securities\nAct, Cap. 318A.\n\nApplication\n\n3.\nthe commencement of this Act.\n\nThis Act shall apply to a Government security issued before or after\n\nPART II\n\nAdministration\n\nAppointment of Registrar\n\n4.(1)\nGovernment securities.\n\nFor the purpose of this Act, the Bank is appointed the Registrar of\n\nNotwithstanding subsection (1), the Minister may, by order, designate a\n\n(2)\nlicensed central securities depository or other person or body as the Registrar.\n\nRegister\n\n5.(1)\nFor the purposes of this Act, the Registrar shall cause to be kept a\nregister to be known as the Register of Dematerialised Government Securities.\n\n\f(2)\n\nThe Registrar shall enter in the Register a record of\n\n8\n\n(a)\n\n(b)\n\n(c)\n\nthe  name  and  address  of  a  person  who  holds  dematerialised\nGovernment securities at any given time;\n\nthe principal value of dematerialised Government securities held by\nthe person referred to in paragraph (a);\n\nthe  interest  to  be  paid  in  respect  of  dematerialised  Government\nsecurities;\n\n(d)\n\nthe rights accruing from dematerialised Government securities;\n\n(e)\n\nthe rights of third parties to dematerialised Government securities; and\n\n(f)\n\nany other particulars as may be prescribed for inclusion in the Register\nor  that  are  required  for  the  proper  administration  of  a  system  of\ndematerialised Government securities.\n\nRegister is prima facie evidence\n\n6.(1)\ntitle to any Government security entered therein.\n\nThe Register shall be prima facie evidence that a person holds the legal\n\nA  copy  of  an  extract  from  the  Register  which  is  duly  certified  by  the\n\n(2)\nRegistrar shall be admissible in evidence in any court.\n\nPART III\n\nDematerialisation of Government Securities\n\nDematerialisation\n\n7.(1)\n\nUpon the commencement of this Act,\n\n(a)\n\nevery Government security shall be issued as a dematerialised security;\nand\n\n\f9\n\n(b)\n\nthe  legal  title  to  any  Government  security  issued  after  the\ncommencement  of  this  Act  shall  be  acquired,  evidenced  and\nelectronically transferred without an instrument in writing.\n\n(2)\nPayment  of  interest  on  a  dematerialised  Government  security  may  be\neffected  by  electronic  means  and  in  accordance  with  the  provisions  of  any\nregulation made hereunder.\n\nNotice respecting conversion of Government securities\n\n8.\nOfficial Gazette and in a daily newspaper circulated in Barbados, shall\n\nThe Registrar, by notice published on at least 2 occasions both in the\n\n(a)\n\n(b)\n\n(c)\n\ninform the public of the termination of the issuing of certificates of\nownership  of  Government  securities,  the  commencement  of  an\nelectronic  registration  of  Government  securities  and  the  holding  of\ninformation  relating  to  Government  securities  in  the  form  of  an\nelectronic record;\n\nspecify  the  date  upon  which  the  conversion  of  the  records\nof  Government securities into an electronic format shall commence\nand end;\n\ninform the public that from the date of commencement of this Act all\nGovernment securities shall be issued as dematerialised Government\nsecurities;\n\n(d)\n\nnotify the public that all Government securities in a paper form shall\nbe required to be converted to dematerialised Government securities;\n\n(e)\n\ndescribe the procedure to be followed to effect the dematerialisation;\n\n(f)\n\ndirect  all  holders  of  Government  securities  to  surrender  their\ncertificates of ownership of the Government securities to the Registrar\nfor the purpose of the conversion of the Government securities into\ndematerialised Government securities.\n\n\f10\n\nConversion and transfer of Government securities\n\n9.(1)\nsurrendered to the Registrar pursuant to section 8, the Registrar shall\n\nWhere  a  certificate  of  ownership  of  a  Government  security  is\n\n(a)\n\n(b)\n\nconvert the Government security to which the certificate refers into a\ndematerialised Government security; and\n\ncredit the principal value of the dematerialised Government security to\nthe securities account of the respective holder of the security.\n\n(2)\n\nWhere\n\n(a)\n\n(b)\n\na notice is published in accordance with section 8; and\n\nthe period stipulated in the notice in respect of the conversion of the\nrecord  of  a  Government  security  into  a  dematerialised  format\nexpires,\n\nownership  of  a  Government  security  which  is  not  dematerialised  before  the\nexpiration  of  the  period  stipulated  in  the  notice  shall  only  be  transferred  or\nredeemed where the security is converted to a dematerialised format.\n\nPART IV\n\nMiscellaneous\n\nImmunity of officers of the Bank\n\n10.\nAn officer of the Bank or any person appointed under section 4(2)\nshall not be liable in respect of any thing done or omitted to be done in good faith\nin the discharge or in connection with the discharge of the functions conferred\non him in respect of the dematerialisation of Government securities.\n\n\f11\n\nRegulations\n\n11.\nmatters:\n\n(a)\n\n(b)\n\nThe  Minister  may  make  regulations  in  relation  to  the  following\n\nthe keeping of the Register;\n\nthe  issue,  administration,  registration,  transfer,  redemption  and  the\nholding of dematerialised Government securities and the payment of\ninterest on dematerialised Government securities;\n\n(c)\n\nthird party rights to dematerialised Government securities; and\n\n(d)\n\nany other matter required to be prescribed in accordance with this Act.\n\nMinister may amend Schedule\n\n12.(1)\n\nThe Minister may by order amend the Schedule.\n\nAn  order  made  pursuant  to  subsection  (1)  shall  be  subject  to  negative\n\n(2)\nresolution.\n\n\f12\n\nSCHEDULE\n\nSPECIFIED ACTS\n\n(Sections 2 and 12(1))\n\n1.\n\n2.\n\n3.\n\nLocal Loans Act, Cap. 98\n\nSavings Bonds Act, Cap. 104A\n\nTreasury Bills and Tax Certificates, Cap. 106\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n"
}