{
  "bill_id": 320,
  "slug": "savings-bonds-amendment-bill-2018",
  "title": "Savings Bonds (Amendment) Bill  2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b035627271ed63137f9ae786ffcdf4c1.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-10-24",
  "first_reading": "2018-10-24",
  "gazette_date": null,
  "markdown": "2018-10-22\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Savings Bonds Act, Cap. 104A to make provision\n\nfor the issuance of savings bonds in a dematerialised format.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 2 of Cap. 104A\n\nAmendment of section 4 of Cap. 104A\n\nAmendment of section 5 of Cap. 104A\n\nRepeal of section 8 of Cap. 104A\n\nAmendment of section 9 of Cap. 104A\n\nAmendment of section 10 of Cap. 104A\n\nAmendment of section 12 of Cap. 104A\n\nCommencement\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Savings Bonds Act, Cap. 104A to make provision for\n\nthe issuance of savings bonds in a dematerialised format.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Savings Bonds (Amendment) Act, 2018.\n\n\f4\n\nAmendment of section 2 of Cap. 104A\n\n2.\nprincipal Act, is amended by\n\nSection 2 of the Savings Bonds Act, in this Act referred to as the\n\n(a)\n\n(b)\n\ndeleting the full stop after the definition of the term “Governor” and\nsubstituting a semicolon; and\n\ninserting  in  the  appropriate  alphabetical  order  the  following\ndefinitions:\n\n“ “dematerialised” has the meaning assigned to it in section 2 of the\nDematerialisation  of  Government  Securities  Act,  2018  (Act\n2018- );\n\n“Register”  means  the  Register  of  Dematerialised  Government\nSecurities  kept\nthe\nDematerialisation  of  Government  Securities  Act,  2018  (Act\n2018-  ).”.\n\nin  accordance  with  section  5  of\n\nAmendment of section 4 of Cap. 104A\n\n3.\nthe following:\n\nThe principal Act is amended by deleting section 4 and substituting\n\n“Form of Bonds\n\n4.\nBonds  shall  be  issued  in  a  dematerialised  format  and  in\naccordance with the Dematerialisation of Government Securities Act,\n2018 (Act 2018- ) .”.\n\n\f5\n\nAmendment of section 5 of Cap. 104A\n\n4.\nthe following:\n\nThe principal Act is amended by deleting section 5 and substituting\n\n“Register of Dematerialised Government Securities\n\n5.\nRegister. ”\n\nAll  Bonds  issued  under  this  Act  shall  be  recorded  in  the\n\nRepeal of section 8 of Cap. 104A\n\n5.\n\nSection 8 of the principal Act is repealed.\n\nAmendment of section 9 of Cap. 104A\n\n6.\nthe following:\n\nThe principal Act is amended by deleting section 9 and substituting\n\n“Cancellation of Bond on payment thereof\n\n9.(1)\ndisclosed by the Register, the value of the Bond shall be paid.\n\nUpon  verification  of  ownership  and  value  of  a  Bond  as\n\nUpon  payment  of  the  value  of  a  Bond  in  accordance  with\n\n(2)\nsubsection (1), the Bond shall be cancelled. ”.\n\nAmendment of section 10 of Cap. 104A\n\n7.\nthe following:\n\nThe principal Act is amended by deleting section 10 and substituting\n\n\f6\n\n“Effect of the death of holder of Bond\n\n10.\nbeing satisfied as to the\n\nThe Governor shall, upon application made to him and upon\n\n(a)\n\n(b)\n\ndeath of the holder of a Bond; and\n\nthe grant of legal representation to the applicant,\n\ntransfer the Bond in the name of the person entitled to the Bond under\nthe will or intestacy of the holder and make the appropriate alteration\nin the Register; and, from the date of the transfer and the alteration, the\nperson  entitled  under  the  will  or  intestacy  of  the  holder  is  for  all\npurposes the holder of the Bond.”.\n\nAmendment of section 12 of Cap. 104A\n\n8.\nthe following :\n\nThe principal Act is amended by deleting section 12 and substituting\n\n“Offences\n\n12.\n\nA person who, with intent to defraud,\n\n(a)\n\nforges, alters, hinders or delays any issue or assignment of a\nBond; or\n\n(b)\n\nalters any record evidencing ownership of a Bond,\n\nis  guilty  of  an  offence  and  is  liable  on  conviction  on  indictment  to\nimprisonment for a term of 10 years.”.\n\nCommencement\n\n9.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f7\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n"
}