{
  "bill_id": 321,
  "slug": "treasury-bills-and-tax-certificates-amendment-bill-2018",
  "title": "Treasury Bills and Tax  Certificates (Amendment) Bill 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/49ab11cbe75c5019a9d8710faf08e053.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-10-24",
  "first_reading": "2018-10-24",
  "gazette_date": null,
  "markdown": "2018-10-22\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Treasury Bills and Tax Certificates Act, Cap. 106\nto make provision for the issuance of treasury bills and treasury tax certificates\nin a dematerialised format.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\nShort title\n\nInsertion of section 1A into Cap. 106\n\nAmendment of section 3 of Cap. 106\n\nRepeal of sections 5, 6, 7 and 11 of Cap. 106\n\nAmendment of section 10 of Cap. 106\n\nAmendment of section 13 of Cap. 106\n\nAmendment of section 15 of Cap. 106\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Treasury Bills and Tax Certificates Act, Cap. 106 to\nmake provision for the issuance of treasury bills and treasury tax certificates\nin a dematerialised format.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment) Act, 2018.\n\nThis  Act  may  be  cited  as  the  Treasury  Bills  and  Tax  Certificates\n\nInsertion of section 1A into Cap. 106\n\nThe Treasury Bills and Tax Certificates Act, in this Act referred to\n2.\nas the principal Act, is amended by inserting immediately after section 1 the\nfollowing:\n\n“Interpretation\n\n1A.\n\nIn this Act,\n\n“dematerialised” has the same meaning assigned to it in section 2 of the\nDematerialisation  of  Government  Securities  Act,  2018  (Act\n2018- ).”.\n\nAmendment of section 3 of Cap. 106\n\n3.\nthe following:\n\nThe principal Act is amended by deleting section 3 and substituting\n\n“Form of instruments\n\n3.(1)\n\nTreasury bills and tax certificates shall be issued\n\n(a)\n\nin  a  dematerialised  format  and  in  accordance  with  the\nDematerialisation of Government Securities Act, 2018 (Act\n2018- ); and\n\n(b)\n\non such a date as the Minister specifies.\n\n\f5\n\n(2)\n\nThe date specified by the Minister may not be later than\n\n(a)\n\n(b)\n\n(c)\n\nin the case of a treasury bill, one year from the date of issue;\n\nin the case of a tax reserve certificate, 2 years from the date\nof issue; or\n\nin the case of a tax refund certificate, 5 years from the date\nof issue.”.\n\nRepeal of sections 5, 6, 7 and 11 of Cap. 106\n\n4.\n\nSections 5, 6, 7 and 11 of the principal Act are repealed.\n\nAmendment of section 10 of Cap. 106\n\n5.\nthe following:\n\nThe principal Act is amended by deleting section 10 and substituting\n\n“Encashment of treasury bill or tax certificate\n\n10.\neffected by an electronic transfer.”.\n\nThe payment of a treasury bill or a tax certificate may be\n\nAmendment of section 13 of Cap. 106\n\n6.\nthe following:\n\nThe principal Act is amended by deleting section 13 and substituting\n\n“Transfer of instruments\n\n13.(1)\nthe holder and in the manner described in subsection (2).\n\nA tax certificate is not transferable except on the death of\n\n\f6\n\nThe  issuer  may,  upon  application  made  to  him  and  on  being\n\n(2)\nsatisfied as to\n\n(a)\n\n(b)\n\nthe death of the holder of a treasury bill or tax certificate; and\n\nthe grant of legal representation to the applicant,\n\ntransfer the bill or certificate in the name of the person entitled thereto\nunder the will or intestacy of the holder and make appropriate alteration\nto the register; and, from the date of the transfer and alteration the person\nentitled under the will or intestacy of the holder is the holder for all\npurposes of the bill or certificate. ”.\n\nAmendment of section 15 of Cap. 106\n\n7.\nthe following:\n\nThe principal Act is amended by deleting section 15 and substituting\n\n“Offences\n\n15.\n\nA person who, with intent to defraud,\n\n(a)\n\n(b)\n\nforges, alters, hinders or delays any issue or assignment of\nany treasury bill or tax certificate; or\n\nalters any record evidencing ownership of a treasury bill or a\ntax certificate,\n\nis guilty of an offence and is liable on conviction on indictment to a fine\nof $50 000 or to imprisonment for a term of 14 years or to both.”.\n\n\f7\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n"
}