{
  "bill_id": 325,
  "slug": "supplementary-estimates-no5-20182019-1766800",
  "title": "Supplementary Estimates No.5 2018-2019 $1,766,800",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/d139581cc274d6efa2e9ce6126b3c82b.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2018-11-20",
  "first_reading": "2018-11-20",
  "gazette_date": null,
  "markdown": "|\n|\n|\nHOUSE OF ASSEMBLY\nResolved that the sum of ONE MILLION, SEVEN HUNDRED AND SIXTY — SIX THOUSAND, EIGHT HUNDRED DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2018-2019 as shown in the Supplementary Estimates No.5 2018-2019 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2018 — 2019 No.5\nCoordination Services Account Code:101 — Statutory Personal ie} Emoluments Account Code:102 — Other Personal Emoluments 0 Account Code:103 — Employers Contributions 0 Account Code:206 — Travel 0 Account Code:207 — Utilities 0 Account Code:210 — Supplies and Materials 0 Account Code:211 — Maintenance of Property 0 Account Code:212 — Operating Expenses 11,000 HEAD Code Provision in Number Approved Estimates 2018 - 2019 Other Expenditure HEAD: 46 MINISTRY OF MARIRIME AFFAIRS AND THE BLUE ECONOMY Program: 040 Direction and Policy Services Subprogram: 7158 General Management and 460407158\nProvision in Supplementary Supplementary Provision Estimates Required No. 1-4\nOther Other Expenditure Expenditure\n479,884\n135,621\n56,745\n2500\n5000\n19,050\n17,800\n314,500\nAccount Code:226 — Professional Services Account Code:230 — Contingencies Account Code:317 — Subscriptions Account Code:751 — Property and Plant Account Code:752 — Machinery and Equipment Account Code:753 — Furniture and Fixtures 100,000 5000 2,100 150,000 444,500 34,100\n0\nADDENDUM\nHead 46: Ministry of Maritime Affairs and the Blue Economy\nProgramme 040: Direction and Policy Formulation Services\nSub-Programme 7158: General Management and Co-ordination Services\nSupplementary provision to cover the cost of Statutory Personal Emoluments under the Ministry.\nHEAD 46 Ministry of Maritime Affairs and the Blue Economy\nProgramme 040 Direction and Policy Formulation Services\nSub-Programme 7158 General Management and Coordination Services\nAccount Code 101\nStatutory Personal Emoluments\n$479,884\nSupplementary provision to cover the cost of Other Personal Emoluments under the Ministry.\nHEAD 46 Ministry of Maritime Affairs and the Blue Economy\nProgramme 040 Direction and Policy Formulation Services\nSub-Programme 7158 General Management and Coordination Services\nAccount Code 102\nOther Personal Emoluments\n$135,621\nSupplementary provision to cover the cost of National Insurance Contributions under the Ministry.\nHEAD 46 Ministry of Maritime Affairs and the Blue Economy Programme 040 Direction and Policy Formulation Services Sub-Programme 7158 General Management and Coordination Services Account Code 103 National Insurance Contributions $56,745\nSupplementary provision to cover the cost of Travel by officers at the Ministry. HEAD 46 Ministry of Maritime Affairs and the Blue Economy Programme 040 Direction and Policy Formulation Services Sub-Programme 7158 General Management and Coordination Services Account Code 206 Travel $2,500\nSupplementary provision to cover the cost of Utilities at the Ministry. HEAD 46 Ministry of Maritime Affairs and the Blue Economy Programme 040 Direction and Policy Formulation Services Sub-Programme 7158 General Management and Coordination Services Account Code 207 Utilities $5,000\nSupplementary provision to cover the cost of Supplies and Materials for the Ministry.\nHEAD 46\nMinistry of Maritime Affairs and the Blue Economy\nProgramme 040\nDirection and Policy Formulation Services\nSub-Programme 7158 General Management and Coordination Services\nAccount Code 210\nSupplies and Materials\n$19,050\nSupplementary provision to cover the cost of Maintenance of Property at the Ministry.\nHEAD 46 Ministry of Maritime Affairs and the Blue Economy Programme 040 Direction and Policy Formulation Services Sub-Programme 7158 General Management and Coordination Services Account Code 211 Maintenance of Property $17,800\nSupplementary provision to cover the cost of Operating Expenses under the Ministry.\nHEAD 46 Ministry of Maritime Affairs and the Blue Economy Programme 040 Direction and Policy Formulation Services Sub-Programme 7158 General Management and Coordination Services Account Code 212 Operating Expenses $314,500\nSupplementary provision to cover the cost of Professional Services to the Ministry.\nHEAD 46 Ministry of Maritime Affairs and the Blue Economy Programme 040 Direction and Policy Formulation Services Sub-Programme 7158 General Management and Coordination Services Account Code 226 Professional Services $100,000\nSupplementary provision to cover the cost of Contingencies in the Ministry. HEAD 46 Ministry of Maritime Affairs and the Blue Economy Programme 040 Direction and Policy Formulation Services Sub-Programme 7158 General Management and Coordination Services Account Code 230 Contingencies $5,000\nSupplementary provision to cover the cost of Subscriptions by the Ministry. HEAD 46 Ministry of Maritime Affairs and the Blue Economy Programme 040 Direction and Policy Formulation Services Sub-Programme 7158 General Management and Coordination Services Account Code 317 Subscriptions $2,100\nSupplementary provision to cover the cost of Property and Plant at the Ministry. HEAD 46 Ministry of Maritime Affairs and the Blue Economy Programme 040 Direction and Policy Formulation Services Sub-Programme 7158 General Management and Coordination Services Account Code 751 Property and Plant $150,000\nSupplementary provision to cover the cost of Machinery and Equipment for the Ministry.\nHEAD 46\nMinistry of Maritime Affairs and the Blue Economy\nProgramme 040 Direction and Policy Formulation Services\nSub-Programme 7158 General Management and Coordination Services\nAccount Code 752\nMachinery and Equipment\n$444,500\nSupplementary provision to cover the cost of Furniture and Fixtures for the Ministry.\nHEAD 46 Ministry of Maritime Affairs and the Blue Economy Programme 040 Direction and Policy Formulation Services Sub-Programme 7158 General Management and Coordination Services Account Code 753 Furniture and Fixtures $34,100\nTOTAL\n$1,766,800.00\n"
}