{
  "bill_id": 328,
  "slug": "fuel-tax-bill-2018",
  "title": "Fuel Tax Bill, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/234d82c45098f05fb625fd5ac6072866.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-11-28",
  "first_reading": "2018-12-12",
  "gazette_date": "2018-11-26",
  "markdown": "Explanatory Memorandum after pages 7\n\n2018-10-31\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the imposition of a tax to be known as a “fuel tax”\n\nand for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nImposition of tax\n\nPayment of tax\n\nPenalty and interest\n\nInspections\n\nWaiver or refund of tax\n\nConsolidated Fund\n\nRegulations\n\n10.\n\nValidation\n\n11.\n\nAct to bind the Crown\n\n12.\n\nCommencement\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the imposition of a tax to be known as a “fuel tax”\n\nand for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Fuel Tax Act, 2018.\n\n\f4\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Comptroller” means the Comptroller of Customs;\n\n“importer” means a person who imports petroleum products into Barbados for\n\nresale;\n\n“petroleum products” means the products described in the Schedule;\n\n“tax” means the tax imposed by section 3.\n\nImposition of tax\n\n3.(1)\ntax to be known as a “fuel tax”.\n\nSubject to this Act, there shall be charged on petroleum products, a\n\nThe  tax  referred  to  in  subsection  (1)  shall  be  charged  at  the  point  of\n\n(2)\nimportation of the petroleum products at the rates specified in the Schedule.\n\n(3)\n\n(4)\n\nThe Minister may, by order, amend the Schedule.\n\nAn order made under subsection (3) is subject to negative resolution.\n\nPayment of tax\n\n4.\nwarehouse, pay to the Comptroller the tax specified in section 3.\n\nEvery importer shall, upon the removal of petroleum products from a\n\nPenalty and interest\n\n5.(1)\nAn importer who fails to pay the tax in accordance with section 4 shall\npay to the Comptroller, in addition to the tax, a penalty equal to 10 per cent of\nthe amount that was not paid.\n\nAn  importer  shall  pay  to  the  Comptroller,  in  addition  to  the  penalty\n(2)\nimposed under subsection (1), interest at the rate of one per cent per month on\nthe amount that was not paid.\n\n\f5\n\nInspections\n\n6.(1)\nAn officer of the Customs and Excise Department duly authorised by\nthe Comptroller shall, at least once every month, enter any warehouse used for\nthe storage of petroleum products and undertake an inspection and audit of the\nwarehouse to verify\n\n(a)\n\n(b)\n\nthe inventory of petroleum products in the warehouse; and\n\nthe removal of petroleum products from the warehouse.\n\nA person who impedes, prevents or obstructs an officer of the Customs and\n(2)\nExcise Department in the execution of his duties under this Act is guilty of an\noffence and is liable on summary conviction to a fine of $20 000.\n\nWaiver or refund of tax\n\nThe Minister may, where he is satisfied that it is just and equitable to\n7.\ndo so, waive or refund, in whole or in part, any tax, penalty or interest payable\nunder this Act.\n\nConsolidated Fund\n\n8.\nConsolidated Fund.\n\nThe  tax  collected  pursuant  to  this  Act  shall  be  paid  into  the\n\nRegulations\n\n9.\neffect to this Act.\n\nThe Minister may make regulations generally for the purpose of giving\n\nValidation\n\nNotwithstanding sections 3(2) and 5 of the Provisional Collection of\n10.\nTaxes Act, Cap. 85, all tax purportedly paid to and collected by the Comptroller\nwith effect from 1st July, 2018 shall be deemed to have been lawfully and validly\npaid and collected.\n\n\f6\n\nAct to bind the Crown\n\n11.\n\nThis Act binds the Crown.\n\nCommencement\n\n12.\nof July, 2018.\n\nThis Act shall be deemed to have come into operation on the 1st day\n\n\f7\n\nSCHEDULE\n\n(Sections 2 and 3)\n\nDESCRIPTION OF GOODS\n\nRATE OF TAX\n\nTARIFF\nHEADING\nNO.\n\n2710.11.30\n\nMotor Spirit (gasoline)\n\n2710.19.20\n\nIlluminating kerosene\n\n$0.40 per litre\n\n$0.05 per litre\n\n27.19.40.100\n\nDiesel oil for use as fuel for road motor vehicles $0.40 per litre\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n\fFUEL TAX BILL, 2018\n\nEXPLANATORY MEMORANDUM\n\nClause 1:\n\nstates the short title by which the Act may be cited.\n\nClause 2:\n\ndefines certain terms used in the Act.\n\nClause 3:\n\nprovides for the imposition of the fuel tax, the rates at which\nthe tax will be charged and the method by which the rates may\nbe amended.\n\nClause 4:\n\nprovides for the payment of the tax by the importer.\n\nClause 5:\n\nClause 6:\n\nClause 7:\n\nClause 8:\n\nClause 9:\n\nprovides for the penalty and interest to be charged for failing\nto pay the tax.\n\nprovides for inspection of a warehouse by an officer of the\nCustoms and Excise Department.\n\nvests in the Minister the power to waive or refund any tax,\npenalty or interest payable under the Act.\n\nprovides  for  the  payment  of  the  tax  into  the  Consolidated\nFund.\n\nvests in the Minister the power to make regulations under the\nAct.\n\nClause 10:\n\nvalidates  the  purported  payment  and  collection  of  the  tax\npursuant to the Budgetary Proposals 2018.\n\nClause 11:\n\nprovides that the Act is binding on the Crown.\n\nClause 12:\n\nstates the date from which the Act takes effect.\n\ni\n\n"
}