{
  "bill_id": 32,
  "slug": "guarantee-barbados-agricultural-management-company",
  "title": "Guarantee Barbados Agricultural Management Company",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b1bbeb7f13975fe283ea77fb4f5a0786.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2014-06-11",
  "first_reading": "2014-06-11",
  "second_reading": "2014-06-10",
  "gazette_date": null,
  "passed_date": "2014-06-11",
  "markdown": "   L.R.O. 1998\n\nRESOLUTION NO.\n\nPARLIAMENT\n\nWHEREAS by paragraph (a) of section 3(1) of the Guarantee of Loans\n\n(Companies) Act, Cap. 96 the Government may, with the approval of Parliament\n\nand in such manner and on such terms and subject to such conditions as may be\n\nagreed between it and a lending agency, guarantee the borrowing of such sums by\n\na  company  from  a  lending  agency  as  is  authorised  by  the  Government;\n\nAND WHEREAS the Barbados Agricultural Management Company Ltd.,\n\na company incorporated under the Companies Act, Cap. 308 is controlled by\n\nthe Government within the meaning of section 2 of the Guarantee of Loans\n\n(Companies) Act;\n\nAND WHEREAS the Barbados Agricultural Management Company Ltd.\n\nis seeking a loan of BDS $41.0 million from FirstCaribbean International Bank\n\n(Barbados) Limited (\"FirstCaribbean\") on the terms and conditions set out in the\n\nSchedule hereto, for the purpose of converting the overdraft facility to a term\n\nfacility;\n\nTHE LAWS OF BARBADOS\nPrinted by the Government Printer, Bay Street, St. Michael\nby the authority of the Government of Barbados\n\n\f2\n\nAND WHEREAS by virtue of section 4 of the Guarantee of Loans\n\n(Companies) Act, the aggregate amount of all borrowings by companies that are\n\nguaranteed by the Government shall not exceed $1 000 000 000 without taking\n\ninto account any amount in respect of interest, commission and any other\n\nexpenses secured by the guarantees; and the Minister of Finance has certified that\n\nthe aggregate amount of all borrowings by the Government and any further\n\nborrowings do not exceed the limit;\n\nBE  IT  RESOLVED  that  Parliament  approve  the  guarantee  by  the\n\nMinister of Finance of the payment of the principal sum of BDS $41.0 million\n\nand  interest  thereon  to  be  borrowed  by  the  Barbados  Agricultural\n\nManagement Company Ltd. from FirstCaribbean International Bank (Barbados)\n\nLimited (\"FirstCaribbean\") on the terms and conditions set out in the Schedule\n\nhereto.\n\n\f   L.R.O. 1998\n\n3\n\nAPPROVED  by  the  House  of  Assembly  this                      day\n\nof\n\n           , 2014.\n\nSpeaker\n\nAPPROVED by the Senate this          day of\n\n          ,\n\n2014.\n\nPresident\n\nTHE LAWS OF BARBADOS\nPrinted by the Government Printer, Bay Street, St. Michael\nby the authority of the Government of Barbados\n\n\f4\n\nSCHEDULE\n\nBorrower:\n\nLender:\n\nAmount:\n\nCurrency:\n\nPurpose:\n\nTERMS AND CONDITIONS\n\nBarbados Agricultural  Management  Company  Ltd.\n\nFirstCaribbean  International  Bank  (Barbados)\nLimited (\"FirstCaribbean\").\n\n$41.0 million.\n\nBarbados dollars.\n\nTo  convert  the  overdraft  facility  to  a  term  facility.\nThe  borrowings  supported  the  general  working\ncapital  requirements,  including  the  cultivation  of\nsugar cane and the maintenance of sugar factories.\n\nTenor:\n\nThree (3) years.\n\nInterest Rate:\n\nA  margin  of  2.50  percent  (2.50%)  below\nFirstCaribbean  Prime  Rate,  currently  8.05  per  cent\n(8.05%).  The current effective rate is 5.55 per cent\n(5.55%).\n\nWithout prejudice to any other rights the Lender may\nhave in the event of a downgrade of the Government\nof Barbados local currency debt by any international\nor regional credit rating agency, the Interest Rate shall\nbe increased by 25bps for every sub-grade downgrade\nwithin  the  investment  grade  band  or  decreased  by\n25bps  for  each  and  every  sub-grade  upgrade  level\nprovided  that  the  rate  is  not  lower  than  the  Interest\nRate established at financial close.\n\n\f   L.R.O. 1998\n\n5\n\nTERMS AND CONDITIONS  (Concl'd)\n\nRepayment:\n\nSecurity:\n\nSixty (60) regular blended quarterly payments of\n$1,011,364.91  each.    Amounts  paid  cannot  be\nre-drawn.\n\nThe facility is subject to a three (3) year term.\n\nRepayment  is  based  on  a  fifteen  (15)  year\namortization.\n\nFull  and  unconditional  guarantee  from  the\nGovernment of Barbados in a form and substance\nthat is acceptable to the Lender.\n\nFees:\n\nA  fee  of  $20,500.00  will  be  payable  up-front.\n\nLate reporting:\n\nIn  the  event  that  financial  information  is  not\nprovided    as  agreed,  the  interest  rate  on  the\napproved  facility  will    be  increased  by  1  percent\n(1%)  to  reflect  the  increased  risk  involved  in\nlending without the benefit of up to date financial\ninformation.\n\nGoverning Law:\n\nLaws  of  Barbados.\n\nTHE LAWS OF BARBADOS\nPrinted by the Government Printer, Bay Street, St. Michael\nby the authority of the Government of Barbados\n\n\f6\n\nADDENDUM\n\nThis Resolution seeks the approval of Parliament of a guarantee\n\nby    the  Government  of  Barbados  under  the  Guarantee  of  Loans\n\n(Companies)  Act,  Cap.  96  in  respect  of  a  loan  in  the  amount  of\n\nBDS  $41.0  million  and  the  interest  thereon  to  be  borrowed  by  the\n\nBarbados Agricultural Management Company Ltd. from FirstCaribbean\n\nInternational Bank (Barbados) Limited (\"First Caribbean\").\n\nThe loan is to convert the overdraft facility to a term facility.\n\n"
}