{
  "bill_id": 330,
  "slug": "immigration-amendment-bill-2018",
  "title": "Immigration (Amendment) Bill,  2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3eb29bc802452c3a30899bde812a1b4b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-12-14",
  "first_reading": "2018-12-19",
  "gazette_date": "2018-12-17",
  "markdown": "2018-12-10\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Immigration Act, Cap. 190 to revise the provisions\nof  the  Act  with  respect  to  the  submission  and  receipt  of  advance  passenger\ninformation and to provide for other related matters.\n\n\f2\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 190\n\nAmendment of section 12A of Cap. 190\n\nInsertion of sections 12B and 12C into Cap. 190\n\nAmendment of the Fourth Schedule to Cap. 190\n\nRepeal and replacement of the Fifth Schedule to Cap. 190\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Immigration Act, Cap. 190 to revise the provisions of\nthe  Act  with  respect  to  the  submission  and  receipt  of  advance  passenger\ninformation and to provide for other related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n\nThis Act may be cited as the Immigration (Amendment) Act, 2018.\n\nAmendment of section 2 of Cap. 190\n\nSection 2 of the Immigration Act, Cap. 190, in this Act referred to\n2.\nas the principal Act, is amended by inserting in the appropriate alphabetical\norder the following definitions:\n\n“    “airline  designator”  means  a  code  assigned  to  an  airline  by  the\nInternational Air Transport Association or the International Civil\nAviation Organisation;\n\n“CARICOM”  means  the  Caribbean  Community  established  by  the\n\nTreaty;\n\n“code  share  information”  means  an  arrangement  between  2  or  more\n\nairlines to publish and market a flight under\n\n(a)\n\n(b)\n\na flight number; and\n\nan airline designator,\n\nof the airlines as part of the timetable or schedule of the airlines;\n\n“IMPACS”  means  the  CARICOM  Implementing  Agency  for  Crime\nand  Security  established  under  the  Agreement  Establishing  the\nCARICOM  Implementation  Agency  for  Crime  and  Security,\n2006;\n\n“intelligence  agency”    means  a  law  enforcement  agency  which  is\nestablished  to  share  information  and  intelligence  and  to\ncollaborate and cooperate with any other law enforcement agency\non matters of mutual interest;\n\n\f5\n\n“JRCC”  means  the  Joint  Regional  Communication  Centre,  a  sub-\nagency  of  IMPACS,  which  receives  advance  passenger\ninformation;\n\n“participating  country”  means  any  country  which  enters  into  an\n\nagreement with JRCC to share advance passenger information;\n\n“PNR” means passenger name record;\n\n“split or divided PNR information”  means the division of PNR where\none or more passenger is moved from an existing reservation on\na vessel and is given a new reservation on a vessel;\n\n“watch list” means a list which is compiled by an intelligence agency\nand is used to watch or track the activities of criminals, criminal\ndeportees and other persons of interest;”.\n\nAmendment of section 12A of Cap. 190\n\n3.\n\nSection 12A of the principal Act is amended by\n\n(a)\n\ndeleting subsection (2) and substituting the following:\n\n“(2)\nThe master of a vessel to which this section applies shall, at such\ntimes  as  is  stated  in  subsections  (3)  and  (4),  provide  the  Chief\nImmigration Officer and the Chief Operations Officer of JRCC with\n\n(a)\n\nthe advance passenger information data set out in the Fourth\nSchedule  in  respect  of  each  person  on  board  the  vessel\nincluding every member of the crew who is arriving in and\ndeparting from Barbados; and\n\n(b)\n\nsuch other information as may be prescribed,\n\nin an electronic format or in a form approved by the Chief Immigration\nOfficer and the Chief Operations Officer respectively.”;\n\n\f6\n\n(b)\n\ndeleting paragraphs (a) and (b) of subsection (3) and substituting the\nfollowing:\n\n“(a)\n\na commercial aircraft, no later than 40 minutes prior to the\ndeparture from the last port of call;\n\n(b)\n\na  private  aircraft,  no  later  than  40  minutes  prior  to  the\ndeparture from the last port of call;”; and\n\n(c)\n\ndeleting subsection (4) and substituting the following:\n\nWhere a vessel has left or is expected to leave Barbados, the data\n“(4)\nreferred  to  in  subsection  (2)(a)  shall  be  provided  no  later  than  40\nminutes prior to the departure from Barbados.”\n\nInsertion of sections 12B and 12C into Cap. 190\n\n4.\n12A the following as section 12B and section 12C:\n\nThe principal Act is amended by inserting immediately after section\n\n“JRCC to share advance passenger information with\nintelligence agencies\n\n12B.\nWhere  advance  passenger  information  is  provided  to  the\nChief Operations Officer of JRCC pursuant to section 12A, the Chief\nOperations  Officer  shall  share  that  information  with  intelligence\nagencies.\n\nUse of advance passenger information by JRCC\n\nWhere  the  Chief  Operations  Officer  of  JRCC  receives\n12C.(1)\nadvance passenger information pursuant to section 12A, JRCC shall\nuse the advance passenger information to conduct screening of persons\nwho are on board a vessel, which enters, departs from or travels within\nthe domestic space.\n\n\f7\n\n(2)\nJRCC shall use the advance passenger information referred to in\nsubsection (1) to conduct screening of persons against a watch list for\nthe  purposes  of  assisting  participating  countries  or  intelligence\nagencies  in  the  furtherance  of  national,  regional  and  international\nsecurity.\n\nWhere  JRCC  conducts  screening  of  persons  pursuant  to\n(3)\nsubsection (2) and  as a result of the screening suspects that a person\non board a vessel is\n\n(a)\n\n(b)\n\n(c)\n\na criminal;\n\na criminal deportee;\n\ninvolved in criminal activity; or\n\n(d)\n\na person of interest to an intelligence agency,\n\nJRCC  shall  share  the  information  with  law  enforcement  agencies  of\nparticipating countries and with intelligence agencies.”.\n\nAmendment of the Fourth Schedule to Cap. 190\n\n5.\nimmediately after paragraph B the following:\n\nThe Fourth Schedule to the principal Act is amended by inserting\n\n# “ C. Passenger Name Record Data as Available in a Vessel’s\n\n     Reservation System\n\n1.   PNR Locator\n  PNR locator.\n\n2.   Date of Reservation or Issue of Ticket\n\n  Date of reservation or issue of ticket for passenger.\n\n3.   Date(s) of Intended Travel\n\n  Date(s) of intended travel for passenger.\n\n\f8\n\n4.   Surname and Given Name(s)\n\n  Family name and given name(s) of passenger.\n\n5.   Address and Contact Information\n\n  Address and contact information of passenger including\n\n  telephone number(s) and e-mail address.\n\n6.   Information on Form of Payment for Ticket\n\n  Information on form of payment for ticket of passenger\n\n  including billing address.\n\n7.   Travel Itinerary\n\n  Complete travel itinerary of passenger.\n\n8.   Frequent Flyer Information\n\n  Frequent flyer information of passenger.\n\n9.   Travel Agency or Travel Agent\n      Travel agency or travel agent used to reserve ticket of\n       passenger.\n\n10. Travel Status of Passenger\n\n  Travel status of passenger including confirmations, check-in\n  status and no show status.\n\n11. Split or divided PNR Information\n  Split or divided PNR information.\n\n12. Ticketing Information\n\n  Ticketing information for passenger including ticket number,\n\n  date of issuance of ticket, one way tickets and automated ticket\n\n  fare quotations.\n\n\f9\n\n13. Seat Information\n\n  Seat number and any other seat information for passenger.\n\n14. Baggage Information\n\n  All baggage information for passenger.\n\n15. Code Share Information\n\n  Where applicable, code share information for passenger.\n\n16. Number and Names of Other Persons\n\n  Number and name(s) of person(s) travelling with passenger.\n\n17. General Remarks\n\n  General remarks including all available information on\n\n  unaccompanied minors under 18 years such as the name and\n\n  gender of the minor, language spoken by the minor, name and\n\n  contact details of guardian on departure and relationship to the\n\n  minor, name and contact details of guardian on arrival and\n\n  relationship to the minor and the departure and arrival agent.\n\n18. Any Advance Passenger Information\n\n  Any advance passenger information data collected for passenger.\n\n19. Historical Changes to the PNR\n\n  Any historical changes to the PNR listed at 1 to 18.\n\n”.\n\nRepeal and replacement of the Fifth Schedule to Cap. 190\n\n6.\nSchedule as set out in the Schedule to this Act is substituted.\n\nThe  Fifth  Schedule  to  the  principal  Act  is  deleted  and  the  Fifth\n\n\f10\n\nSCHEDULE\n\n“FIFTH SCHEDULE\n\nDomestic Space\n\n(Section 6)\n\n(Section 2)\n\n1. Anguilla\n\n2. Antigua and Barbuda\n\n3. Bahamas\n\n4. Barbados\n\n5. Belize\n\n6. Bermuda\n\n7. British Virgin Islands\n\n8. Cayman Islands\n\n9. Dominica\n\n10. Grenada\n\n11. Guyana\n\n12. Haiti\n\n13. Jamaica\n\n14. Montserrat\n\n15. St. Kitts and Nevis\n\n16. St. Lucia\n\n17. St. Vincent and the Grenadines\n\n18. Suriname\n\n19. Trinidad and Tobago\n\n20. Turks and Caicos Islands\n\n”.\n\n"
}