{
  "bill_id": 331,
  "slug": "business-companies-economic-substance-bill-2018",
  "title": "Business Companies (Economic  Substance) Bill, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/e4a6b02d699839ff2678c57d0f73c5fe.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-12-14",
  "first_reading": "2018-12-19",
  "gazette_date": "2018-12-17",
  "markdown": "2018-12-11\n\nOBJECTS AND REASONS\n\nThis Bill would provide\n\n(a)\n\n(b)\n\nfor the imposition of an economic substance test on companies carrying\non business in Barbados;\n\nfor the determination of whether the test is met by assessing the extent\nof  relevant  activities  carried  out  by  such  companies  and  taking\nappropriate enforcement action; and\n\n(c)\n\nfor related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nFinance and leasing business\n\nRelevant activity\n\nCore income-generating activities\n\nRequirement to meet economic substance test\n\nAssessment of whether economic substance test is met\n\nRequirement to provide information\n\nExchange of information to competent authority\n\n10.\n\nPenalty where the economic substance test is not met\n\n11.\n\nPenalty for failure to provide information or for inaccurate information\n\n12.\n\nImposition of penalty for failure to provide information or for inaccurate\ninformation\n\n13.\n\nRight of appeal against penalty\n\n14.\n\nCommission of Appeal and procedure on appeal against penalty\n\n\f3\n\n15.\n\nEnforcement of penalty\n\n16.\n\nConfidentiality\n\n17.\n\nPower to enter business premises and examine business documents\n\n18.\n\nObstructing an authorised person\n\n19.\n\nRegulations\n\n20.\n\nCommencement\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  provide  for  the  imposition  of  an  economic  substance  test  on\n\ncompanies carrying on business in Barbados and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\nSubstance) Act, 2018.\n\nThis  Act  may  be  cited  as  the  Business  Companies  (Economic\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“authorised person” means the Director of International Business or any person\n\nauthorised by the Director to perform functions under section 17;\n\n“banking business” has the meaning assigned to it by the Financial Institutions\n\nAct, Cap. 324A;\n\n“business premises” means premises used in connection with the carrying on of\n\na business, trade, profession or vocation;\n\n“company” includes a society and any other entities except where the context\n\notherwise requires;\n\n“competent authority”, in respect of a country other than Barbados, means the\nauthority designated in or for the purposes of an approved obligation owed\nby Barbados to another country;\n\n“core income-generating activities” means activities set out in section 5;\n\n“deposit-taking  business”  has  the  meaning  assigned  to  it  by  the  Financial\n\nInstitutions Act, Cap. 324A;\n\n“Director” means the Director of International Business;\n\n“distribution and service centre business” means the business of\n\n(a)\n\npurchasing from a foreign related party\n\n(i)\n\ncomponent parts or materials for goods; or\n\n(ii)\n\ngoods ready for sale; and\n\nreselling such component parts, materials or goods;\n\n\f7\n\n(b)\n\nproviding  services  to  a  foreign  related  party  in  connection  with  the\nbusiness,\n\nbut  does  not  include  any  activity  included  in  any  other  relevant  activity\nexcept holding company business;\n\n“finance and leasing business” has the meaning assigned to it by the Insurance\n\nAct, Cap. 310;\n\n“fiscal period” has the meaning assigned to it by the Income Tax Act, Cap. 73;\n\n“foreign related party” means a person connected with a resident company, such\n\nperson not being resident or regarded as resident in Barbados;\n\n“headquarters business” means the business of providing any of the following\nservices to one or more foreign related parties of the resident company:\n\n(a)\n\n(b)\n\n(c)\n\nthe provision of senior management;\n\nthe assumption or control of material risk for activities carried out by,\nor assets owned by, any of those related parties;\n\nthe provision of substantive advice in connection with the assumption\nor control of risk referred to in paragraph (b),\n\nbut does not include anything falling within the definition of financing and\nleasing business, intellectual property holding business, insurance business,\nor banking business;\n\n“high risk intellectual property company” means a company which carries on an\n\nintellectual property holding business and\n\n(a)\n\nthe company\n\n(i)\n\ndid not create the intellectual property in an intellectual property\nasset which it holds for the purposes of its business;\n\n(ii)\n\nacquired the intellectual property asset\n\n(A)\n\nfrom a related party; or\n\n\f8\n\n(B)\n\nin consideration for funding research and development by\nanother  person  situate  in  a  country  or  territory  other  than\nBarbados; and\n\n(iii)\n\nlicenses  the  intellectual  property  asset  to  one  or  more  related\nparties  or  otherwise  generates  income  from  the  asset  in\nconsequence of activities (such as facilitating sale agreements)\nperformed by foreign related parties; or\n\n(b)\n\nthe company does not carry out research and development, branding\nor  distribution  as  part  of  its  core-income  generating  activities  in\nBarbados;\n\n“holding  company”  has  the  meaning  assigned  to  it  by  the  Companies  Act,\n\nCap. 308;\n\n“income” in respect of an intellectual property asset, includes\n\n(a)\n\n(b)\n\n(c)\n\nroyalties;\n\nincome from a franchise agreement; and\n\nincome from licensing the intangible asset;\n\n“insurance  business”  has  the  meaning  assigned  to  it  by  the  Insurance  Act,\n\nCap. 310;\n\n“intellectual  property  holding  business”  means  the  business  of  holding\n\nintellectual property assets;\n\n“intellectual property asset” means\n\n(a)\n\nany intellectual property right in intangible assets, including but not\nlimited to copyright, patents, trade marks, brand, and technical know-\nhow,  from  which  identifiable  income  accrues  to  the  business  (such\nincome being separately identifiable from any income generated from\nany tangible asset in which the right subsists); and\n\n(b)\n\nincludes income for the sale of an intellectual property asset;\n\n\f9\n\n“Minister” means the Minister responsible for International Business;\n\n“related party” in relation to a resident company has the meaning assigned to it\n\nby the Financial Institutions Act, Cap. 324A;\n\n“relevant activity” has the meaning assigned by section 4;\n\n“resident company” means a company whose business is centrally managed and\n\ncontrolled from Barbados;\n\n“service provider” has the meaning assigned to it by the Corporate and Trust\n\nService Providers Act, 2015 (Act 2015-12);\n\n“ship” has the meaning assigned to it by the Shipping Act, Cap. 296;\n\n“shipping business” means any of the following activities involving the operation\nof a ship anywhere in the world, other than solely within the territorial waters\nof Barbados,\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe business of transporting, by sea, persons, animals, goods or mail;\n\nthe renting or chartering of ships for the purpose described in paragraph\n(a);\n\nthe sale of travel tickets or equivalent, and ancillary services connected\nwith the operation of a ship;\n\nthe use, maintenance or rental of containers, including trailers and other\nvehicles  or  equipment  for  the  transport  of  containers,  used  for  the\ntransport of anything by sea; and\n\n(e)\n\nthe management of the crew of a ship;\n\n“societies” means a society with restricted liability organised under the Societies\n\nWith Restricted Liability Act, Cap. 318B.\n\nFinance and leasing business\n\n3.(1)\n\nFor the purposes of finance and leasing business\n\n(a)\n\nconsideration may include consideration by way of interest;\n\n\f10\n\n(b)\n\nthe  provision  of  credit  may  be  by  way  of  instalments  for  which  a\nseparate charge is made and disclosed to the customer in connection\nwith\n\n(i)\n\n(ii)\n\nthe supply of goods by hire purchase;\n\nleasing, other than any lease granting an exclusive right to occupy\nland; or\n\n(iii)\n\nconditional sale or credit sale.\n\nWhere an advance or credit repayable by a customer to a person is assigned\n(2)\nto another person, that other person is deemed to be providing the credit facility\nfor the purposes of this section.\n\nThis  section  does  not  apply  to  banking  business,  fund  management\n\n(3)\nbusiness or insurance business.\n\nRelevant activity\n\n4.\n\nFor the purpose of this Act any of the following is a relevant activity:\n\n(a)\n\n(b)\n\n(c)\n\nbanking business;\n\ninsurance business;\n\nfund management business;\n\n(d)\n\nfinance and leasing business;\n\n(e)\n\nheadquarters business;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nshipping business;\n\nholding company business;\n\nintellectual property holding business;\n\ndistribution and service centre business; and\n\nsuch  other  activities  as  the  Minister  may  by  order  prescribe  to  be\nrelevant activities.\n\n\f11\n\nCore income-generating activities\n\n5.\nactivities being carried on from within Barbados\n\nCore  income-generating  activities,  include  the  following  relevant\n\n(a)\n\nin respect of banking business\n\n(i)\n\nraising funds, and managing risk, including credit risk, currency\nrisk and interest risk;\n\n(ii)\n\ntaking hedging positions;\n\n(iii)\n\nproviding loans, credit or other financial services to customers;\n\n(iv)\n\nmanaging capital and preparing reports and returns to the Central\nBank of Barbados;\n\n(b)\n\nin respect of insurance business,\n\n(i)\n\npredicting and calculating risk;\n\n(ii)\n\ninsuring  or  re-insuring  against  risk  and  providing  insurance\nbusiness services to clients;\n\n(c)\n\nin respect of fund management business,\n\n(i)\n\ntaking decisions on the holding and selling of investments;\n\n(ii)\n\ncalculating risk and reserves;\n\n(iii)\n\n(iv)\n\ntaking decisions on currency or interest fluctuations and hedging\npositions;\n\npreparing reports and returns for submission to investors and to\nthe Director;\n\n(d)\n\nin respect of finance and leasing business,\n\n(i)\n\n(ii)\n\nagreeing funding terms;\n\nidentifying  and  acquiring  assets  to  be  leased  (in  the  case  of\nleasing);\n\n\f12\n\n(iii)\n\nsetting the terms and duration of any financing or leasing;\n\n(iv)\n\nmonitoring and revising any agreements;\n\n(v)\n\nmanaging any risks;\n\n(e)\n\nin respect of headquarters business;\n\n(i)\n\ntaking relevant management decisions;\n\n(ii)\n\nincurring expenditures on behalf of group entities;\n\n(iii)\n\nco-ordinating group activities;\n\n(f)\n\nin respect of shipping business;\n\n(i)\n\nmanaging  crew  (including  hiring,  paying  and  overseeing  crew\nmembers);\n\n(ii)\n\noverhauling and maintaining ships;\n\n(iii)\n\noverseeing and tracking deliveries;\n\n(iv)\n\ndetermining  what  goods  to  order  and  when  to  deliver  them,\norganising and overseeing voyages;\n\n(g)\n\nin respect of holding company business, all activities related to that\nbusiness;\n\n(h)\n\nin respect of intellectual property holding business,\n\n(i)\n\n(ii)\n\n(iii)\n\ntaking  strategic  decisions,  managing  and  bearing  the  principal\nrisks related to development and subsequent exploitation of the\nintangible asset generating income;\n\ntaking the strategic decisions, managing and bearing the principal\nrisks  relating  to  acquisition  by  third  parties  and  subsequent\nexploitation and protection of the intangible assets;\n\ncarrying on the underlying trading activities through which the\nintangible  assets  are  exploited  leading  to  the  generation  of\nrevenue from third parties;\n\n\f13\n\n(iv)\n\nresearch and development, branding or distribution;\n\n(i)\n\nin respect of distribution and service centre business\n\n(i)\n\ntransporting and storing goods, components and materials\n\n(ii)\n\nmanaging stocks;\n\n(iii)\n\ntaking orders;\n\n(iv)\n\nproviding consulting or other administrative services.\n\nRequirement to meet economic substance test\n\n6.(1)\nrelation to any relevant activity carried on by it.\n\nA  resident  company  must  satisfy  the  economic  substance  test  in\n\nA  resident  company  meets  the  economic  substance  test  in  relation  to  a\n\n(2)\nrelevant activity carried on by the company where\n\n(a)\n\nthe  company  is  directed,  managed  and  controlled  in  Barbados  in\nrelation to that activity;\n\n(b)\n\nhaving regard to the level of relevant activity carried on in Barbados\n\n(i)\n\nthere  is  an  adequate  number  of  employees  in  relation  to  that\nactivity who are physically present in Barbados, whether or not\nemployed  by  the  resident  company  or  by  another  entity  and\nwhether on temporary or long-term contracts;\n\n(ii)\n\nthere is adequate expenditure incurred in Barbados; and\n\n(iii)\n\nthere are adequate physical assets in Barbados;\n\n(c)\n\n(d)\n\nthe  company  conducts  its  core-income  generating  activities  in\nBarbados; and\n\nin the case of Barbados core-income generating activity carried out for\nthe relevant company by another entity, it is able to monitor and control\nthe carrying out of that activity by the other entity.\n\n\f(3)\n\nThe test in subsection (2)(a) is satisfied where\n\n14\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe  company's  board  of  directors  meets  in  Barbados  at  an  adequate\nfrequency having regard to the amount of decision-making required at\nthat level;\n\nat such board meetings described in paragraph (a), there is a quorum\nof directors physically present in Barbados;\n\nthe minutes of such board meetings described in paragraph (a) record\nthe making of strategic decisions of the company at the meeting;\n\nthe  directors  of  the·  company  have  the  necessary  knowledge  and\nexpertise to discharge the duties of the board; and\n\nthe minutes of all board meetings and the records of the company are\nkept in Barbados.\n\nThe Director may issue guidance on how the economic substance test may\n(4)\nbe met, including without affecting the foregoing, any expression used in this\nsection for the purpose of that test, including the meaning of \"adequate\".\n\nRegard must be had to any guidance under subsection (4) concerning the\n\n(5)\ninterpretation of any expression.\n\nGuidance issued under subsection (4) must be published by the Director\n\n(6)\nin the Official Gazette and in a daily newspaper that is circulated in Barbados.\n\nAssessment of whether economic substance test is met\n\n7.(1)\nThe Director may determine that a resident company has not met the\neconomic substance test during any financial year of the company commencing\non or after lst January 2019.\n\nA determination referred to in subsection (1) must be made no later than\n(2)\n18 months after the end of the financial year to which the determination relates.\n\nSubsections (1) and (2) do not apply where the Director is unable to make\n(3)\na  determination  within  the  18  months  period  by  reason  of  any  deliberate\n\n\f15\n\nmisrepresentation or negligent or fraudulent action by the resident company or\nby any other person.\n\nIn relation to a high risk intellectual property company, for the purposes\n(4)\nof subsection (1), the Director must determine that the economic substance test\nwas  not  met  during  a  financial  year  unless  the  company  provides  sufficient\ninformation to satisfy the Director that the test was met.\n\nRequirement to provide information\n\nA  resident  company  must  provide  any  information  reasonably\n8.(1)\nrequired by the Director in order to assist the him in making a determination under\nsection 7.\n\nThe  Director  may  serve  notice  on  any  person  requiring  that  person  to\n(2)\nprovide within the period specified in the notice and at such place as is specified\nin the notice, such documents and information as the Director requires for the\npurpose of facilitating him in the exercise ofhis functions under this Act.\n\nExchange of information to competent authority\n\n9.(1)\nSubject to subsection (2), where the Director determines under section\n7 that a resident company has not met the economic substance test for a financial\nyear, the Director must, in accordance with any law or international agreement\nrelating  to  exchange  of  information,  forward  the  information  provided  under\nsection 8 relating to that company for that year to\n\n(a)\n\nthe competent authority of the country in which resides\n\n(i)\n\na holding company;\n\n(ii)\n\nthe ultimate holding company of the resident company; and\n\n(iii)\n\nan ultimate beneficial owner; and\n\n(b)\n\nwhere  the  resident  company  is  incorporated  outside  Barbados,  the\ncompetent authority of the country or territory in which the resident\ncompany is incorporated.\n\n\f16\n\n(2)\nIn  respect  of  a  high  risk  intellectual  property  company,  regardless  of\nwhether or not the Director has made a determination under section 7 in respect\nof it, the Director must, in accordance with any law or international agreement\nrelating  to  exchange  of  information,  forward  the  information  provided  to  the\nDirector under section 8 in respect of that company for each financial year of the\ncompany commencing on or after 1st January 2019 to\n\n(a)\n\nthe competent authority of the country in which resides\n\n(i)\n\na holding company;\n\n(ii)\n\nthe ultimate holding company of the resident company; and\n\n(iii)\n\nan ultimate beneficial owner; and\n\n(b)\n\nwhere  the  high  risk  intellectual  property  company  is  incorporated\noutside Barbados, the competent authority of the country or territory\nin which the company is incorporated.\n\nPenalty where the economic substance test is not met\n\nWhere  the  Director  determines  under  section  7  that  a  resident\n10.(1)\ncompany has failed to meet the economic substance test for a financial year, the\nDirector must within 21 days of the date of that determination issue a notice to\nthe company notifying it\n\n(a)\n\nthat he has determined that the resident company does not meet the\neconomic substance test for that year;\n\n(b)\n\nof the reasons for that determination;\n\n(c)\n\n(d)\n\n(e)\n\nof the amount of penalty imposed on the company under subsection\n(2);\n\nof the date from which the penalty under subsection (2) is due, being\nnot less than 28 days after the issue of the notice;\n\nof what action he considers should be taken by the company to meet\nthe economic substance test; and\n\n\f17\n\n(f)\n\nof the company's right of appeal under section 13.\n\n(2)\nFor  the  purpose  of  this  section,  the  Director  may  impose  a  penalty  not\nexceeding $300 000 payable within 30 days of the date of notice of the imposition\nof the penalty.\n\nWhere, for the financial year following a financial year in which a notice\n(3)\nwas issued under subsection (1), hereinafter called the “further financial year\",\nthe Director determines that the resident company has failed to meet the economic\nsubstance test, he must issue a further notice to the resident company notifying\nit\n\n(a)\n\nthat the Director has determined that the resident company has not met\nthe economic substance test for the further financial year;\n\n(b)\n\nof the reasons for the determination;\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nof the amount of penalty imposed on the company under subsection\n(2) in addition to the penalty previously imposed under subsection (1);\n\nof the date from which the penalty under subsection (4) is due, being\nnot less than 30 days after the issue of the notice;\n\nthat the Director may within 2 days make a report to the Minister under\nsubsection (4);\n\nof what action the Director considers should be taken by the company\nto meet the economic substance test; and\n\n(g)\n\nof the company's right of appeal under section 13.\n\nFollowing  the  issue  of  a  notice  under  subsection  (3),  the  Director  may\n(4)\nprovide the Minister with a report of the matters referred to in that notice together\nwith  any  additional  information,  whether  or  not  such  additional  information\nwas provided to the Director under section 8.\n\n\f18\n\nPenalty for failure to provide information or for inaccurate\ninformation\n\n11.(1)\nperson fails to provide the information required under section 8.\n\nA  person  is  liable  to  a  penalty  not  exceeding  $150,000  where  that\n\n(2)\n\nA person is liable to a penalty not exceeding $150,000 where\n\n(a)\n\n(b)\n\nin complying with a requirement under section 8 that person provides\ninaccurate information; and\n\ncondition  A  or  B  set  out  in  subsections  (3)  and  (4),  respectively  is\nmet.\n\nCondition A is that the person knows of the inaccuracy at the time when\n\n(3)\ninformation is provided but does not inform the Director at that time.\n\n(4)\n\nCondition B is that the person\n\n(a)\n\ndiscovers  the  inaccuracy  after  the  information  was  provided  to  the\nDirector; and\n\n(b)\n\nfails to take reasonable steps to inform the Director.\n\n(5)\n\nA person is not liable to a penalty under this section where\n\n(a)\n\n(b)\n\nthat person satisfies the Director; or\n\non an appeal under section 13, satisfies the Minister\n\nthat there is a reasonable excuse for the failure.\n\nWhere  a  person  had  a  reasonable  excuse  for  failure  to  provide\n(6)\ninformation  but  the  excuse  is  no  longer  valid  that  person  may  be  allowed  to\nprovide the information within a reasonable time after the excuse become invalid\nwithout the imposition of a penalty.\n\nA penalty for failure to provide accurate information may only be imposed\n(7)\nwithin 12 months commencing on the date on which the inaccuracy first came to\nthe attention of the Director.\n\n\f19\n\nImposition of penalty for failure to provide information or for\ninaccurate information\n\n12.(1)\nmay determine the amount of penalty and impose it on that person.\n\nWhere a person is liable to a penalty under section 11 the Director\n\n(2)\n\nWhere the Director imposes a penalty, he must notify the person\n\n(a)\n\n(b)\n\n(c)\n\nof the reasons for imposing the penalty;\n\nof the amount of penalty imposed on that person;\n\nthe date on which the penalty is due, being not less than 28 days after\nthe issue of the notice; and\n\n(d)\n\nof the person's right of appeal under section 13.\n\nA penalty under this section may only be imposed within the period of 6\n(3)\nyears commencing on the date on which the person became liable to the penalty.\n\nRight of appeal against penalty\n\n13.\n\nA person upon whom a penalty is imposed by the Director may\n\n(a)\n\n(b)\n\nappeal on the ground that liability to that penalty does not arise; or\n\nappeal against the amount of the penalty.\n\nCommission of Appeal and procedure on appeal against penalty\n\n14.(1)\n\nNotice of an appeal under section 13 must be forwarded to the Minister\n\n(a)\n\n(b)\n\nin writing; and\n\nwithin 30 days commencing on the date on which notification to the\nperson under section 10 or 12 was given.\n\n(2)\n\nThe notice under subsection (1) must state the ground of appeal.\n\nOn an appeal under section 13(a), the Minister may confirm or cancel the\n\n(3)\npenalty.\n\n\f20\n\n(4)\n\nOn an appeal under section 13(b), the Minister may\n\n(a)\n\n(b)\n\nconfirm the penalty; or\n\nsubstitute a lesser amount for the penalty which the Director imposed.\n\nEnforcement of penalty\n\n15.(1)\nmentioned in subsection (2).\n\nA penalty under this Act must be paid within 30 days after the date\n\n(2)\n\nThe date referred to in subsection (1) is the later of\n\n(a)\n\n(b)\n\nthe date from which the penalty is due under section 10(1)(d), 10(3)\n(d) or 12(2)(c); or\n\nwhere notice of appeal under section 13 is given, the date on which the\nappeal is finally determined or withdrawn.\n\nA penalty under this Act may be enforced as if it were a debt due to the\n\n(3)\nCrown recoverable in civil proceedings.\n\nConfidentiality\n\n16.(1)\nThe  Director’s  power  to  disclose  information  under  section  9  has\neffect  despite  any  obligation  as  to  confidentiality  or  other  restriction  on  the\ndisclosure of information imposed by statute, contract or otherwise.\n\n(2)\n\nDisclosure of information under this Act does not breach\n\n(a)\n\n(b)\n\nany  obligation  of  confidentiality  in  relation  to  the  information  so\ndisclosed; or\n\nany other restriction on the access to or disclosure of the information\nso accessed.\n\nPower to enter business premises and examine business documents\n\n17.(1)\ndocument that is located on business premises.\n\nAn authorised person may examine and take copies of any business\n\n\f21\n\nThe power under subsection (1) may be exercised only for the purpose of\n\n(2)\ninvestigating any issue relating to compliance with any provision of this Act.\n\nAn authorised person may at any reasonable time enter business premises\n\n(3)\nfor the purpose of exercising the power under subsection (1).\n\nAn authorised person may by notice require any person to produce any\n(4)\nspecified  business  document  at  the  business  premises  where  the  business\ndocument is located for the purpose of enabling the authorised person to exercise\nthe power under subsection (1) in relation to that document.\n\nObstructing an authorised person\n\n18.(1)\n\nA person who, without reasonable excuse,\n\n(a)\n\n(b)\n\nobstructs  an  authorised  person  in  the  exercise  of  his  powers  under\nsection 17; or\n\nfails to provide such reasonable assistance as the authorised person may\nrequire in the exercise of his powers under section 17 is guilty of an\noffence.\n\nA  person  who  intentionally  alters,  suppresses  or  destroys  any  business\n\n(2)\ndocument specified in a notice under section 8(2) is guilty of an offence.\n\nA person guilty of an offence under subsection (1) is liable on summary\n\n(3)\nconviction to a fine of $5 000 or to imprisonment for 6 months, or to both.\n\nA person guilty of an offence under subsection (2) is liable on summary\n\n(4)\nconviction to a fine of $10 000 or imprisonment for 2 years or to both.\n\nRegulations\n\n19.\nThe Minister may make such regulations as may be necessary to give\neffect to this Act and for prescribing anything that is required by this Act to be\nprescribed.\n\n\f22\n\nCommencement\n\n20.\n\nThis Act shall come into operation on the 1st day of January 2019.\n\n"
}