{
  "bill_id": 333,
  "slug": "corporate-and-trust-service-providers-amendment-bill-2018",
  "title": "Corporate and Trust Service  Providers (Amendment) Bill, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/1a799186eaaab3c364487c58964d8029.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-12-14",
  "first_reading": "2018-12-11",
  "gazette_date": "2018-12-19",
  "markdown": "2018-12-11\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Corporate and Trust Service Providers Act, 2015\n(Act  2015-12)  in  order  to  delete  therefrom  references  therein  to  international\nbusiness  companies,  international  societies  with  restricted  liability  and\ninternational trusts and for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\nShort title\n\nAmendment of section 2 of Act 2015-12\n\nAmendment of Act 2015–12\n\nAmendment of section 38 of Act 2015-12\n\nAmendment of First Schedule to Act 2015-12\n\nCommencement\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  amend  the  Corporate  and  Trust  Service  Providers  Act,  2015\n\n(Act 2015-12).\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment) Act, 2018.\n\nThis Act may be cited as the Corporate and Trust Service Providers\n\nAmendment of section 2 of Act 2015-12\n\n2.\nin this Act referred to as the principal Act, is amended\n\nSection 2 of the Corporate and Trust Service Providers Act, 2015,\n\n(a)\n\nby deleting the following definitions appearing therein:\n\n(i)\n\n“foreign sales corporation”;\n\n(ii)\n\n“international business company”;\n\n(iii)\n\n“international society”; and\n\n(iv)\n\n“international trust”;\n\n(b)\n\nby deleting the words, “but does not include an international society”\nappearing  in  the  penultimate  and  last  lines  of  the  definition  of\n“society”; and\n\n(c)\n\nby  inserting  therein  in  its  appropriate  alphabetical  order  the\nfollowing new definition:\n\n“  “trust”  has  the  meaning  assigned  to  it  by  section  3  of  the  Trusts\n\n(Miscellaneous Provisions) Act, 2018 (Act 2018- ).”.\n\nAmendment of Act 2015–12\n\n3.\nimmediately after section 19:\n\nThe principal Act is amended by inserting the following new section\n\n\f5\n\n“19A.(1)\nWhere a change to client, as outlined below, is intended, a\nservice provider shall give the Director written notice of the change at\nleast one month prior to the intended date of change.\n\n(2)\nWhere the Director receives notice of a change, the Director may\nrequire  the  service  provider  to  furnish  additional  information  or\ndocuments in respect of the change.\n\nFor the purpose of this section, “change” means in the case of a\n(3)\nclient holding a valid foreign currency permit, that is with respect to a\ncompany, a change in respect of:\n\n(a)\n\n(b)\n\n(c)\n\nname or address of its registered office;\n\nthe articles;\n\nthe ownership of the majority of the shares;\n\n(d)\n\nthe beneficial ownership of the majority of the shares;\n\n(e)\n\nthe directors or officers\n\nof the company.\n\n(4)\n\nWith respect to a society, a change in respect of:\n\n(a)\n\n(b)\n\n(c)\n\nname or address of its registered office;\n\nthe articles;\n\nthe ownership of the majority of the quotas\n\n(d)\n\nthe beneficial ownership of the majority of the quotas\n\n(e)\n\nthe managers or officers\n\nof the society.”.\n\n\f6\n\nAmendment of section 38 of Act 2015-12\n\nSection 38 of the principal Act is amended by deleting paragraph (a)\n4.\nand (b) thereof and substituting therefor the words, “the Financial Institutions\nAct, Cap. 324A”.\n\nAmendment of First Schedule to Act 2015-12\n\n5.\nparagraph 1 and substituting the following:\n\nThe  First  Schedule  to  the  principal  Act  is  amended  by  deleting\n\n“1.\nof this Act\n\nThe following entities are specified entities for the purposes\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\na foundation;\n\na foreign sales corporation;\n\nall entities holding a valid foreign currency permit; and\n\nany other entity which has obtained specific permission from\nthe  Exchange  Control  Authority\nin  foreign\ncurrency.”.\n\nto  deal\n\nCommencement\n\n6.\n\nThis Act shall come into operation on the 1st day of January 2019.\n\n\f7\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n"
}