{
  "bill_id": 338,
  "slug": "societies-with-restricted-liabillity-amendment-bill-2018",
  "title": "Societies With Restricted Liabillity (Amendment) Bill, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/0c94d0ded093199509500d2e99acb382.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-12-14",
  "first_reading": "2018-12-19",
  "gazette_date": "2018-12-17",
  "markdown": "2018-12-11\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Societies With Restricted Liability Act, Cap. 318B\n\n(a)\n\n(b)\n\nby repealing Part VII; and\n\nwould provide for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 2 of Cap. 318B\n\nAmendment of section 6 of Cap. 318B\n\nAmendment of section 35 of Cap. 318B\n\nRepeal of Part VII of Cap. 318B\n\nSaving of rights and benefits\n\nSaving of obligations and penalties\n\nInterpretation\n\nAmendment of Cap 318B\n\n10.\n\nCommencement\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Societies With Restricted Liability Act, Cap. 318B.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n(Amendment) Act, 2018.\n\nThis  Act  may  be  cited  as  the  Societies  With  Restricted  Liability\n\n\f4\n\nAmendment of section 2 of Cap. 318B\n\n2.\nin this Act referred to as the principal Act, is amended\n\nSection 2 of the Societies With Restricted Liability Act, Cap. 318B,\n\n(a)\n\n(b)\n\nby deleting paragraph (b) thereof; and\n\nby deleting the words, “, and includes an international society with\nrestricted  liability  organised  under  Part  VII”,  appearing  in  the\ndefinition of “society”.\n\nAmendment of section 6 of Cap. 318B\n\nSection 6 of the principal Act is amended by deleting the words, “and\n3.\nin the case of an international society, the name and address of its agent in\nBarbados”,  appearing  in  the  first,  second  and  third  lines  of  paragraph  (d)\nthereof.\n\nAmendment of section 35 of Cap. 318B\n\nSection 35 of the principal Act is amended by deleting the words,\n4.\n“or,  in  the  case  of  an  international  society,  the  registered  agent  of  the\ninternational society,” appearing in the second and third lines of paragraph\n(c) thereof.\n\nRepeal of Part VII of Cap. 318B\n\n5.\n\nPart VII of the principal Act is repealed.\n\n\f5\n\nSaving of rights and benefits\n\n6.(1)\nNotwithstanding  the  repeal  effected  by  section  5  of  this  Act,  the\nrights and benefits conferred upon international societies under the former\nPart VII are saved or shall cease as is hereinafter provided:\n\n(a)\n\n(b)\n\n(c)\n\nan international society that does not hold intellectual property assets\nbut holds a valid licence issued prior to 17th October 2017 shall be\nentitled to receive its benefits until 30th June 2021;\n\nan international society that does not hold intellectual property assets\nbut holds a valid licence issued on or after 17th October 2017 shall\ncease to be entitled to any benefits after 31st December 2018;\n\nwithout  affecting  paragraphs  (a)  and  (b),  an  international  society\nthat holds a valid licence issued on or before 30th June 2018 and also\nholds intellectual property assets acquired before 17th October 2017\nbut before 1st July, 2018 where\n\n(i)\n\n(ii)\n\nthe intellectual property assets were already benefitting from a\nback-end regime; or\n\nthe intellectual property assets were acquired from an unrelated\nparty,\n\nshall be entitled to receive those benefits in respect of those intellectual\nproperty assets until 30th June 2021;\n\n(d)\n\nan international society that holds a valid licence issued on or before\n30th June 2018 and also holds intellectual property assets acquired\nafter 17th October 2017 from a related party shall cease to be entitled\nto any benefits in respect of those intellectual property assets after\n31st December 2018.\n\nWith effect from the income year commencing on or after January 1,\n(2)\n2019 and for every subsequent income year the rate of tax for taxable income\nin excess of $30 000 000 shall be 1 per cent.\n\n\f6\n\nSaving of obligations and penalties\n\nNotwithstanding the repeal effected by section 5, any obligation or\n7.\npenalty incurred by an international society during the period of operation of\nthe  former  Part  VII  shall  not  be  affected;  and  any  investigation,  legal\nproceeding  or  remedy  in  respect  thereof  may  be  instituted,  continued  or\nenforced and such penalty imposed as if that Part had not been repealed.\n\nInterpretation\n\n8.\n\nFor the purposes of sections 6 and 7\n\n“Act” means the Societies With Restricted Liability Act, Cap. 318B;\n\n“back-end regime” means a preferential, no tax or low tax regime that applies\nto  the  income  earned  from  the  exploitation  of  the  intellectual  property\nassets;\n\n“former Part VII” means Part VII of the Societies With Restricted Liability\n\nAct, Cap. 318B repealed by section 5 of this Act;\n\n“intellectual  property  assets”  means  assets  generating  income  defined  as\n\n“royalties” in the Income Tax Act, Cap. 73;\n\n“international society” means an international society under the former Part\n\nVII.\n\nAmendment of Cap 318B\n\nThe  Societies  With  Restricted  Liability  Act,  Cap.  318B,  in  this\n9.\nsection and the succeeding sections referred to as the principal Act is amended\nby inserting therein the following as the new Part VII:\n\n\f7\n\n“PART VII\n\nAMENDED ARTICLES AND GRANT OF FOREIGN CURRENCY\nPERMIT\n\nService provider\n\nA society referred to in subsection (1) of section 40, shall\n39.\nappoint a service provider in accordance with the Corporate and Trust\nService Providers Act, 2015 (Act 2015-12).\n\nForeign currency permit\n\nA society that earns one hundred per cent of its income in\n40.(1)\nforeign currency is entitled to apply for the grant of a foreign currency\npermit or for the renewal of a foreign currency permit as applicable.\n\nApplication  for,  the  grant  and  renewal  of  a  foreign  currency\n(2)\npermit  shall  be  as  prescribed  in  the  Foreign  Currency  Permits  Act,\n2018 (Act 2018- ).\n\nFiling of audited financial statement\n\n41.(1)\ncurrency permit.\n\nEvery society shall apply for the grant or renewal of a foreign\n\nA society applying on the first occasion for a grant of a foreign\n(2)\ncurrency permit shall file a declaration in the form set out in the Second\nSchedule to the Foreign Currency Permits Act (Act 2018- ).\n\nA society applying for a renewal of foreign currency permit shall\n(3)\nprepare its audited financial statement in accordance with section 25 of\nthis  Act  and  shall  file  the  financial  statement  with  the  Barbados\nRevenue Authority.\n\n\f8\n\n(4)\nThe society referred to in (3) shall then file a declaration in the\nform set out in the Second Schedule to the Foreign Currency Permits\nAct, 2018 (Act 2018- ).\n\nTransitional\n\nNotwithstanding  the  repeal  of  the  former  Part  VII,  the\n42.\narticles of a society organised thereunder and carrying on business in\naccordance therewith immediately before the commencement of this\nAct shall be deemed to have been amended to comply with section 5\nand  shall  continue  after  the  commencement  of  this  Act  as  a  society\norganised under section 5.\n\nInterpretation\n\n43.\n\nIn this Act,\n\n“Barbados  Revenue  Authority”  means\n\nthe  Barbados  Revenue\nAuthority  established  by  section  2  of  the  Barbados  Revenue\nAuthority Act, 2014 (Act 2014-1);\n\n“foreign  currency”  has  the  meaning  assigned  to  it  by  the  Foreign\n\nCurrency Permits Act, 2018 (Act 2018- );\n\n“foreign currency permit” has the meaning assigned to it by the Foreign\n\nCurrency Permits Act, 2018 (Act 2018-   ).”.\n\nCommencement\n\n10.\n\nThis Act shall come into operation on the 1st day of January 2019.\n\n\f9\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n"
}