{
  "bill_id": 339,
  "slug": "stamp-duty-amendment-bill-2018",
  "title": "Stamp Duty (Amendment) Bill,  2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3447406b48b421a28ddff8bb6756bf18.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-12-14",
  "first_reading": "2018-12-19",
  "gazette_date": "2018-12-17",
  "markdown": "2018-12-11\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Stamp Duty Act, Cap. 91, in order to revise the\n\nstamp duty eligible on certain transactions and for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of Cap. 91\n\nSavings of rights and benefits\n\nCommencement\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Stamp Duty Act, Cap. 91.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Stamp Duty (Amendment) Act, 2018.\n\n\f4\n\nAmendment of Cap. 91\n\n2.\n\nThe Schedule to the Stamp Duty Act is amended\n\n(a)\n\nin the item “BILLS OF EXCHANGE OR PROMISSORY NOTES”,\ndelete paragraph (d) and insert the following:\n\n“(d)\n\nBills  drawn  by  or  payable  to  persons  holding  a  foreign\ncurrency  permit  under  the  Foreign  Currency  Permits  Act,\n2018 (Act 2018- ).”;\n\n(b)\n\nby deleting the item “EXEMPT INSURANCE DOCUMENTS”\n\n(c)\n\n(d)\n\nby  deleting  the  item,  “INTERNATIONAL  SOCIETIES  WITH\nRESTRICTED LIABILITY”;\n\nby deleting the item “INTERNATIONAL FINANCIAL SERVICES\nDOCUMENTATION”;\n\n(e)\n\nby deleting the item “INTERNATIONAL TRUSTS”;\n\n(f)\n\n(g)\n\n(h)\n\nby deleting the item “INTERNATIONAL BUSINESS COMPANIES\nDOCUMENTS”;\n\nby  deleting  the  item  “QUALIFYING  INSURANCE  COMPANIES\nDOCUMENTS”;\n\nin  the  item  “GENERAL  EXEMPTIONS  FROM  ALL  STAMP\nDUTIES” insert the following:\n\n“The holder of a foreign currency permit under the Foreign Currency\nPermits Act, 2018 (Act 2018- ), is exempt from ad valorem stamp duty\nexcept in respect of real property situate in Barbados, but shall pay a\nfixed rate as specified in this Schedule.”.\n\n\f5\n\nSavings of rights and benefits\n\n3.(1)\nany company or society conferred by this Act shall cease on June 30, 2021;\n\nNotwithstanding section 2, the rights and benefits conferred upon\n\n(2)\nNotwithstanding  section  2  any  obligation  or  penalty  incurred  by  a\ncompany  or  society  during  the  period  of  operation  of  the  Act  shall  not  be\naffected and any investigation, legal proceedings or remedy in respect thereof\nmay be instituted, continued or enforced and such penalty imposed as if the\nprovision had not been deleted.\n\nCommencement\n\n4.\n\nThis Act shall come into operation on the 1st day of January 2019.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n"
}