{
  "bill_id": 33,
  "slug": "vesting-in-nhc-land-at-flat-rock-st-george",
  "title": "Vesting in NHC land at Flat Rock, St. George",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/e868e6dd52bb97ccfbcfe09bdadb6946.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2014-05-14",
  "first_reading": "2014-06-11",
  "second_reading": "2014-05-13",
  "gazette_date": "2014-06-11",
  "passed_date": "2014-06-11",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 approve the vesting, in the National Housing Corporation, of the parcel of land the property of the Crown situate at Flat Rock, in the parish of Saint George in this Island, formerly the site of a public bath, and more particularly described in the Schedule hereto, for housing development.\nAPPROVED by the House of Assembly this\nday\nof\n, Two thousand and fourteen.\nSpeaker\nAPPROVED by the Senate this\nday of\n5\nTwo thousand and fourteen.\nPresident\nSCHEDULE\nALL THAT land, the property of the Crown, situate at Flat Rock in the parish of St. George in this Island containing by admeasurement 464.5 square metres or thereabouts inclusive of 23.1 square meters of road reserve abutting and bounding on lands now or late of L.C. Moore on three sides and on a public road 4.8 metres wide leading to Rowans in one direction and to Mayfield in the other direction or however else the same may abut and bound as shown and delineated on a Plan certified on the 4\" day of June, 1991 by James A. Browne, Land Surveyor and recorded in the Lands and Surveys Department on the 6\" day of June, 1991 as Plan No. 554/91.\nwe\nADDENDUM\nOn the 22\" day of November, 2012 the Cabinet agreed to the vesting of 464.5 square metres of Crown land situate at Flat Rock in the parish of St. George in the National Housing Corporation.\nThe said land more particularly described in the Schedule hereto was acquired on the 16\" day of August, 1971 in accordance with section 5 of the Land Acquisition Act, Cap. 228 as evidenced by Statutory Instrument No. 140 of 1971.\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is now sought for the vesting in the National Housing Corporation of the parcel of land more particularly described in the Schedule to this Resolution.\n\"\nSURVEY ORDER NO. 25/86 CORRES DENCE NO.0301/ 108 IE’ BOOK NO. JAS. 05\nLANDS AND SURVEYS DEPARTMENT\n~~\nriLE NO.\n\nPARISH OF ST. GEORGE\nLOCATION FLAT ROCK\n8 541.793 2 71 255.063 é N x Ri) / Or [s} +S & xX Formerly Ja f Sf “On a . | be C. Moore\nBarbados PLAN OF LAND at containing surveyed for Certified FLAT ROCK , ST. GEORGE Land 441, 4m? Road Res. 23. 1m? TOTAL 4664, 5m2 bordered green and brown THE MINISTRY OF HOUSING ANO at june 1991\nLANOS\nSCALE 1: 500\nDistances are in metres. Bearings are referred to Grid Narth derived from $6 and M2A\nFor Lands and Surveys Dept. only\nTae\n7\n"
}