{
  "bill_id": 340,
  "slug": "trusts-miscellaneous-provisions-bill-2018",
  "title": "Trusts (Miscellaneous Provisions)  Bill, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/bf984c72f8b0b19bf2cce978f39d5c49.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-12-14",
  "first_reading": "2018-12-19",
  "gazette_date": "2018-12-17",
  "markdown": "2018-12-11\n\nOBJECTS AND REASONS\n\nThis Bill would repeal the International Trusts Act, Cap. 245, make provision\n\nfor the creation of certain miscellaneous trusts and for related matters.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nINTERPRETATION\n\n1.\n\nShort title\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nDefinitions\n\nTrust described\n\nPART II\n\nCreation of Trusts\n\nCreation of trusts\n\nPresumption against avoidance of trust\n\nDuration of trust and accumulation of income\n\nProper law of trust\n\nPART III\n\nPurpose Trusts\n\nInterpretation\n\nCreation of purpose trusts\n\n10.\n\nProtector not to be trustee\n\n\f3\n\n11.\n\nAppointment of protector by court\n\n12.\n\nCustody of copy of instrument\n\n13.\n\nExtension of cy-près\n\nPART IV\n\nEFFECT OF FOREIGN LAW\n\n14.\n\nCapacity of settlor\n\n15.\n\nLaw of Barbados\n\n16.\n\nEffect of section 15\n\n17.\n\nVarying or setting aside trust\n\nPART V\n\nFraudulent Disposition\n\n18.\n\nInterpretation\n\n19.\n\nFraudulent disposition voidable\n\n20.\n\nCertain rights\n\n21.\n\nExtent of avoidance of relevant dispositions\n\n22.\n\nAct not to validate certain dispositions\n\n23.\n\nProperty Act\n\n24.\n\nNo interest to defraud\n\n\f4\n\nPART VI\n\nProtector of Trust\n\n25.\n\nAppointment of protector\n\nPART VII\n\nMiscellaneous\n\n26.\n\nLanguage of trust\n\n27.\n\nConfidentiality\n\n28.\n\nDisclosure for purposes of Act\n\n29.\n\nApplication of other law\n\n30.\n\nPenalties\n\n31.\n\nFees and forms\n\n32.\n\nRegulations\n\n33.\n\nRepeal of Cap. 245\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the creation and regulation of certain trusts and for\n\nrelated matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n2018.\n\nThis Act may be cited as the Trusts (Miscellaneous Provisions) Act,\n\nPART I\n\nINTERPRETATION\n\nDefinitions\n\n2.(1)\n\nIn this Act,\n\n“beneficiary” includes\n\n(a)\n\n(b)\n\na  bank  licensed  to  carry  on  a  financial  service  under  the  Financial\nInstitutions Act, Cap. 324A; and\n\na  charity  within  the  meaning  of  section  2  of  the  Charities  Act,\nCap. 243.\n\n“court” means the High Court;\n\n“Director” means the Director of International Business;\n\n“Minister” means the Minister responsible for International Business;\n\n“trustee”  means  a  person  who  holds  a  valid  licence  under  the  Financial\nInstitutions Act, Cap. 324A, or the Corporate and Trust Service Providers\nAct (Act 2015-12).\n\nFor  the  purposes  of  this  Act,  the  following  are  residents  of  Barbados,\n\n(2)\nnamely:\n\n(a)\n\nan individual resident in Barbados for the purposes of the Income Tax\nAct, Cap. 73; and\n\n\f7\n\n(b)\n\nany Company or Society whose central management and control are\nexercised in Barbados.\n\nTrust described\n\n3.(1)\nIn this Act the expression \"trust\" means the legal relationship created\nwhen assets have been placed under the control of a trustee for the benefit of a\nbeneficiary or for a specified purpose.\n\n(2)\n\nA trust has the following characteristics\n\n(a)\n\n(b)\n\n(c)\n\nthe assets of the trust constitute a separate fund and are not part of the\ntrustee's own estate;\n\ntitle to the assets of the trust is held in the name of the trustee or in the\nname of another person on behalf of the trustee;\n\nthe trustee has the power and the duty to manage, employ or dispose\nof the assets of the trust in accordance with the terms thereof and the\nspecial duties imposed upon him by law;\n\n(d)\n\nthe trustee is accountable to the beneficiary for the management and\nadministration of the assets of the trust.\n\nPART II\n\nCreation of Trusts\n\nCreation of trusts\n\n4.\n\nA trust shall only be created by instrument in writing.\n\nPresumption against avoidance of trust\n\n5.\nA trust that does not contain a power of revocation is irrevocable by\nthe settlor or his legal personal representative notwithstanding that the trust is\nvoluntary.\n\n\f8\n\nDuration of trust and accumulation of income\n\n6.(1)\nSubject  to  subsection  (2),  a  trust  terminates  on  the  one  hundredth\nanniversary after the date of its creation, if not sooner terminated in accordance\nwith the terms of the trust instrument.\n\nSubsection  (1)  does  not  apply  to  a  purpose  trust  or  a  trust  established\n(2)\nexclusively for charitable purposes, such a trust may continue in force without\nany limit as to time.\n\nThe rule of law known as the \"rule against perpetuities\" does not apply to\n\n(3)\na trust.\n\nThe terms of a trust may direct or authorise the accumulation of all or part\n(4)\nof the income of the trust for a period not exceeding 100 years from the date of\nthe creation of the trust.\n\nProper law of trust\n\n7.(1)\nof\n\n(a)\n\n(b)\n\n(c)\n\nSubject to subsections (2) and (3), the proper law of a trust is the law\n\nthe jurisdiction expressed by the terms of the trust as the proper law,\nor if not so expressed;\n\nthe jurisdiction intended by the settlor to be the proper law, or if not so\nexpressed or intended; or\n\nthe jurisdiction with which the trust at the time it was created had the\nclosest connection.\n\nWhere  the  proper  law  of  a  trust  is  changed  from  the  law  of  another\n(2)\njurisdiction  to  the  law  of  Barbados,  the  change  is  valid  and  effective  if  it  is\nrecognised by the law of the other jurisdiction.\n\nWhere the terms of a trust provide for the proper law of the trust to be\n(3)\nchanged from the law of Barbados to the law of another jurisdiction the change\n\n\f9\n\nis valid and effective only if the new proper law recognises the validity of the\ntrust and the respective interests of the beneficiaries.\n\nIn  ascertaining  the  law  with  which  a  trust  has  its  closest  connection,\n\n(4)\nreference shall be had in particular to\n\n(a)\n\n(b)\n\n(c)\n\nthe place of residence or business of the trustee;\n\nthe place of administration of the trust designated by the settlor;\n\nthe situs of the assets of the trust; and\n\n(d)\n\nthe purposes of the trust and the places where they are to be fulfilled.\n\n(5)\n\nThe terms of a trust may provide\n\n(a)\n\nfor the severable aspects of the trust, particularly the administration of\nthe trust, to be governed by a different law from the proper law of the\ntrust; and\n\n(b)\n\nfor the law governing a severable aspect of the trust to be changed from\nthe law of Barbados to the law of another jurisdiction and vice versa.\n\nA change in the proper law of a trust shall not affect the legality or validity\n\n(6)\nof or render any person liable for anything done before the change.\n\nSubject to subsection (5)(a), the proper law of the trust shall govern the\n\n(7)\nvalidity of the trust, its construction, its effects and its administration.\n\nWhen the proper law of a trust or the law governing the severable aspects\n(8)\nof a trust is changed from the law of Barbados to the law of another jurisdiction\n(herein called the \"new law\") no provision of the new law of Barbados operates\nto render the trust void, invalid or unlawful or to render void, invalid or unlawful\nany function conferred on the trustee under the new law.\n\nWhere the proper law of a trust or the law governing the severable aspects\n(9)\nof a trust is changed from the law of another jurisdiction (herein called the \"old\nlaw\") to the law of Barbados no provision of the old law operates to render the\ntrust void, invalid or unlawful or to render void, invalid or unlawful any function\nconferred on the trustee under the law of Barbados.\n\n\f10\n\nPART III\n\nPurpose Trusts\n\nInterpretation\n\n8.\n\nIn this Part, \"purpose trust\" means\n\n(a)\n\n(b)\n\na trust, other than a trust that is for the benefit of particular persons,\nwhether or not immediately ascertainable; or\n\na trust that is for the benefit of some aggregate of persons ascertained\nby reference to some personal relationship.\n\nCreation of purpose trusts\n\n9.\nvalid trust may be created for a non-charitable purpose, if\n\nNotwithstanding any law to the contrary but subject to this section, a\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe purpose is specific, reasonable and capable of fulfillment;\n\nthe purpose is not immoral, unlawful or contrary to public policy;\n\nthe  terms  of  the  trust  provide  for  the  appointment  of  a  protector  to\nenforce  the  trust  and  for  the  appointment  of  a  successor  to  such  a\nprotector; and\n\nthe terms of the trust specify the event upon the occurrence of which\nthe trust terminates and provides for the disposition of surplus assets\nof the trust upon its termination.\n\nProtector not to be trustee\n\n10.\nthereof.\n\nThe protector of a non-charitable purpose trust may not be a trustee\n\n\f11\n\nAppointment of protector by court\n\n11.(1)\n\nWhere a trustee of a trust has reason to believe that\n\n(a)\n\nthe protector of that trust is dead, is unwilling, refuses or is unfit to act\nor is incapable of acting;\n\n(b)\n\nthere is no other protector of the trust;\n\n(c)\n\nno one has been appointed as successor to the protector referred to in\nparagraph (a) in accordance with the terms of the trust,\n\nthe trustee shall as soon as practicable, apply to the court for the appointment of\na protector of the trust.\n\nThe order of the court under subsection (1) is conclusive of the appointment\n(2)\nof the protector to enforce the trust and the appointment takes effect from the\ndate of the order.\n\nA trustee who fails to comply with subsection (1) is guilty of an offence\n\n(3)\nand liable on summary conviction to a fine of $10 000.\n\nIn addition to the fine specified in subsection (3) the court may order the\n(4)\ntrustee referred to in that subsection to cease to be a trustee of non-charitable\npurpose trusts for 2 years.\n\nIt is a defence to a charge under subsection (3) to prove that the trustee\n(5)\ntook all reasonable steps and exercised due diligence to comply with subsection\n(1).\n\nCustody of copy of instrument\n\n12.(1)\n\nA trustee of a trust created under section 9 shall keep in Barbados\n\n(a)\n\na  copy  of  the  instrument  creating  the  trust  and  copies  of  any  other\ninstrument amending or supplementing the instrument;\n\n(b)\n\na register in which the following information is set out:\n\n(i)\n\nthe name of the settlor;\n\n\f12\n\n(ii)\n\na summary of the purposes of the trust;\n\n(iii)\n\nthe name of the protector of the trust; and\n\n(iv)\n\nsuch  documents  as  are  necessary  to  show  the  true  financial\nposition of the trust.\n\nNotwithstanding any other provision of this Act, a trustee of a trust shall\n(2)\nfile  with  the  Director,  upon  payment  of  the  prescribed  fee,  the  information\nreferred to in subsection (1)(b)(i), (ii) and (iii), and the Director shall issue to the\ntrustee a certificate of registration in the prescribed form.\n\nThe  information  referred  to  in  subsection  (2)  is  confidential  and  not\n\n(3)\navailable to the public.\n\nA trustee of a trust may, upon payment of the prescribed fee, apply to the\n(4)\nDirector for a certified copy of the certificate of registration issued in respect of\nthe trust.\n\nThe instrument, register and documents referred to in subsection (1) are\n(5)\nconfidential  and  not  available  to  the  public,  but  the  trustee  shall  allow  the\nprotector or a person authorised by the protector to inspect the instrument, register\nand documents.\n\n(6)\n\nWhere a trustee of a trust created under section 9\n\n(a)\n\n(b)\n\n(c)\n\nfails to comply with subsection (1) or (5);\n\nrefuses to allow a person referred to in subsection (5) to inspect the\ninstrument, register or documents referred to in that subsection; or\n\nin any deed, register or document referred to in subsection (5) makes,\nor authorises the making of, any statement that he knows to be false or\ndoes not believe to be true,\n\nhe is guilty of an offence and liable on summary conviction to a fine of $10 000,\nand in addition to such fine the court may order the trustee to cease to be a trustee\nof non-charitable purpose trusts for 2 years.\n\n\f13\n\nExtension of cy-près\n\n13.(1)\nWhere a trust is created for a non-charitable purpose, the terms of the\ntrust may provide that the doctrine of cy-près is, mutatis mutandis, applicable\nthereto.\n\nFor  the  purpose  of  subsection  (1),  where  a  purpose  that  is  reasonably\n(2)\nsimilar to the original purpose cannot be found, a purpose that is not contrary to\nthe  spirit  and  meaning  of  the  settlement  may  be  substituted  for  the  original\npurpose.\n\nPART IV\n\nEFFECT OF FOREIGN LAW\n\nCapacity of settlor\n\n14.\n\nA person may create\n\n(a)\n\n(b)\n\n(c)\n\nan inter vivos trust if the trust property is movable and the person has\nthe  capacity  to  create  a  trust  of  movable  property  under  the  law  of\nBarbados;\n\na testamentary trust, if the trust property is movable and the person has\nthe capacity to create a trust of movable property under the law of his\ndomicile;\n\na trust of immovable property if he has the capacity to create a trust of\nimmovable  property  under  the  law  of  the  jurisdiction  in  which  the\nimmovable property is situate.\n\nLaw of Barbados\n\n15.\n\nAny question arising with regard to\n\n(a)\n\na trust that is governed by the law of Barbados; or\n\n\f14\n\n(b)\n\nany disposition of property upon the trust thereof,\n\nis to be determined according to the law of Barbados without reference to the law\nof any other jurisdiction with which the trust or disposition may be connected.\n\nEffect of section 15\n\n16.(1)\n\nSection 15\n\n(a)\n\ndoes not validate any disposition of property that is\n\n(i)\n\nnot owned by the settlor;\n\n(ii)\n\nnot the subject of a power in that behalf vested in the settlor;\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\ntakes  effect  subject  to  any  express  contrary  term  of  the  trust  or\ndisposition;\n\ndoes  not,  with  regard  to  the  capacity  of  a  corporation,  affect  the\nrecognition of the laws of its place of incorporation;\n\ndoes not affect the recognition of foreign laws prescribing generally,\nwithout reference to the existence or terms of the trust, the formalities\nfor the disposition of property;\n\ndoes not validate any trust or disposition of immovable property situate\nin a jurisdiction, other than Barbados, being a trust or disposition that\nis invalid under the law of that jurisdiction;\n\n(f)\n\ndoes not validate any testamentary trust or disposition that is invalid\nunder the law of the testator's domicile.\n\nThe recognition of any foreign law in determining whether the settlor is\n(2)\nthe owner of property referred to in this Part or the holder of a power so referred\nto before the time of disposition or at the time of disposition is not affected by\nthis Part.\n\n\f15\n\nVarying or setting aside trust\n\nWhere a trust is validly created under the law of Barbados the court\n17.\nshall not vary it or set it aside pursuant to the law of another jurisdiction in respect\nof\n\n(a)\n\n(b)\n\nthe personal and proprietary effects of marriage;\n\nsuccession  rights,  testate  and  intestate,  especially  the  legal  right  of\nsurviving spouses and the shares of relatives;\n\n(c)\n\nthe protection of creditors in matters of bankruptcy,\n\nunless there are corresponding laws in Barbados.\n\nPART V\n\nFraudulent Disposition\n\nInterpretation\n\n18.\n\nIn this Part\n\n(a)\n\n(b)\n\n\"creditor\" means a person to whom an obligation is owed;\n\n\"intent to defraud\" means an intention of a transferor wilfully to defeat\nan obligation owed to a creditor;\n\n(c)\n\n\"obligation\"\n\n(i)\n\nmeans an obligation or liability that existed on or before the date\nof a relevant disposition and of which the transferor had notice;\nand\n\n(ii)\n\nincludes  a  liability  contingent  upon  an  obligation  or  liability\nreferred to in sub-paragraph (i);\n\n(d)\n\n\"relevant disposition\" means a disposition to which section 19 applies;\n\n\f16\n\n(e)\n\n\"transferor\" means the person who as owner of property or as the holder\nof  a  power  in  that  behalf  directly  or  indirectly  makes  a  relevant\ndisposition or causes it to be made; and\n\n(f)\n\n\"transferee\" means the person to whom a relevant disposition is made\nand includes any successor in title.\n\nFraudulent disposition voidable\n\n19.(1)\nto defraud shall be voidable at the instance of a creditor thereby prejudiced.\n\nSubject to this Act, every disposition of property made with an intent\n\nThe burden of establishing an intent to defraud for the purposes of this Act\n\n(2)\nshall be upon the creditor seeking to set aside the disposition.\n\nNo action or proceedings shall be commenced pursuant to this Act later\n\n(3)\nthan 3 years after the date of the relevant disposition.\n\nCertain rights\n\n20.\n\nIn the event that any disposition is set aside pursuant to this Act, then\n\n(a)\n\nif the court is satisfied that the transferee has not acted in bad faith\n\n(i)\n\n(ii)\n\nthe  transferee  shall  have  a  first  and  paramount  charge  over  the\nproperty, the subject of the disposition, of an amount equal to the\nentire costs properly incurred by the transferee in the defence of\nthe action or proceedings to set aside (and not merely such costs\nas might otherwise be allowed by the court; and\n\nthe relevant disposition shall be set aside subject to the proper fees,\ncosts,  pre-existing  rights,  claims  and  interests  of  the  transferee\n(and of any predecessor transferee who has not acted in bad faith);\nand\n\n(b)\n\nif the court is satisfied that a beneficiary of a trust has not acted in bad\nfaith the disposition shall only be set aside subject to the right of such\nbeneficiary to retain any distribution made consequent upon the prior\n\n\f17\n\nexercise of a trust, power or discretion vested in the trustee of such\ntrust, or any other person, and otherwise properly exercised.\n\nExtent of avoidance of relevant dispositions\n\n21.\nA disposition shall be set aside pursuant to this Act only to the extent\nnecessary to satisfy the obligation to a creditor at whose instance the disposition\nhas been set aside together with such costs as the court may allow.\n\nAct not to validate certain dispositions\n\nNothing in this Act shall validate any disposition of property which is\n22.\nneither owned by the transferor nor the subject of a power in that behalf vested\nin the transferor, and this Act does not affect the recognition of foreign laws in\ndetermining whether the transferor is the owner of such property or the holder of\nsuch a power.\n\nProperty Act\n\n23.\n\nSection 193 of the Property Act, Cap. 236 does not apply to trusts.\n\nNo interest to defraud\n\n24.\ntrustee thereof does not per se constitute an intent to defraud.\n\nThe fact that a settlor of a trust is a beneficiary under the trusts or a\n\nPART VI\n\nProtector of Trust\n\nAppointment of protector\n\n25.(1)\nThe terms of a trust may provide for the appointment of a protector of\nthe trust whether called protector, guardian, advisor or by whatever name called.\n\n\f18\n\nThe following or any of them may, inter alia, be conferred on the protector\n\n(2)\nby the terms of the trust\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe power to appoint and remove trustees;\n\nthe power to change the proper law of the trust;\n\nthe right to receive notice in advance of specified actions of the trustees;\n\nthe  right  to  receive  information  relating  to  or  forming  part  of  the\naccounts of the trust.\n\nNothing in subsection (2) shall be construed as conferring the status of\n\n(3)\ntrustee on a protector.\n\nSubject to the terms of the trust, where there is more than one protector of\n(4)\na trust any function conferred on the protectors may be exercised by a majority\nof the protectors who agree thereto.\n\nA protector who dissents from a decision of the majority may require his\n\n(5)\ndissent to be recorded in writing.\n\nPART VII\n\nMiscellaneous\n\nLanguage of trust\n\n26.\ndeed must be accompanied by a certified English translation.\n\nWhere the deed creating a trust is in a language other than English the\n\nConfidentiality\n\n27.(1)\nWithout affecting section 12(5) but subject to the terms of the trust\nand to the order of the court, no trustee or other person shall disclose to any other\nperson not legally entitled to any information or documents respecting the trust\n\n(a)\n\nthe name of the settlor or any beneficiary;\n\n\f19\n\n(b)\n\n(c)\n\nthe  trustees'  deliberations  as  to  the  manner  in  which  a  power  or\ndiscretion was exercised or a duty conferred by the terms of the trust\nor by law was performed;\n\nthe reason for the exercise of the power or discretion or the performance\nof the duty or any evidence upon which such reason might have been\nbased;\n\n(d)\n\nany information relating to or forming part of the accounts of a trust;\n\n(e)\n\nany other matter or thing respecting a trust.\n\nNotwithstanding subsection (1) but subject to the terms of the trust, the\n(2)\ntrustee shall, at the written request of a beneficiary, disclose any document or\ninformation  relating  to  or  forming  part  of  the  accounts  of  the  trust  to  that\nbeneficiary.\n\nNotwithstanding any other law but subject to subsection (4), the court may,\n(3)\nin  any  civil  or  criminal  proceedings,  allow  the  disclosure  of  information  or\ndocument  referred  to  in  subsection  (1)  on  the  application  of  a  party  to  the\nproceedings in such circumstances as the court thinks fit.\n\nFor the purposes of subsection (3), in making an order under that subsection\n(4)\nthe court shall, inter alia, have regard to the importance of the information or\ndocument to the outcome of the proceedings.\n\nDisclosure for purposes of Act\n\n28.\nNotwithstanding sections 12 and 27, information in respect of a trust\nmay  be  disclosed  where  the  information  is  lawfully  required  to  be  disclosed\npursuant to any other enactment.\n\nApplication of other law\n\n29.(1)\nof this Act, the following apply to trusts:\n\nExcept in so far as they are inconsistent with the express provisions\n\n(a)\n\nthe rules of equity and of common law applicable to trusts; and\n\n\f20\n\n(b)\n\nthe Trustees Act, Cap. 250, except section 3 thereof and the Schedule\nto that Act, and the Charities Act, Cap. 243.\n\nThe Public Trustee is prohibited from being a trustee for the purposes of\n\n(2)\nthis Act.\n\nPenalties\n\n30.(1)\nother document\n\nA person who makes or assists in making a report, return, notice or\n\n(a)\n\nthat is required by this Act or the regulations to be sent to the Registrar\nof Companies or to any other person; and\n\n(b)\n\nthat\n\n(i)\n\ncontains an untrue statement of a material fact; or\n\n(ii)\n\nomits to state a material fact required in the report, return, notice\nor other document or makes a statement containing information\nthat is misleading in light of the circumstances in which it was\nmade,\n\nis guilty of an offence and is liable on summary conviction to a fine of $25 000\nor to imprisonment for a term of 12 months or to both.\n\nA person is not guilty of an offence under subsection (1) if the making of\n(2)\nthe untrue statement or the omission of the material fact was unknown to him\nand with the exercise of reasonable diligence could not have been known to him.\n\nWhere an offence under subsection (1) is committed by a body corporate\n(3)\nand a director or trustee of that body corporate knowingly authorised, permitted\nor acquiesced in the commission of the offence, that body corporate, director, or\ntrustee is liable on summary conviction to a fine of $25 000 or to imprisonment\nfor a term of 12 months or to both.\n\n\f21\n\nFees and forms\n\n31.\n\nThe Minister may by order prescribe\n\n(a)\n\n(b)\n\nthe fees to be paid; and\n\nthe forms to be used,\n\nunder this Act.\n\nRegulations\n\n32.\n\nThe Minister may make regulations to give effect to this Act.\n\nRepeal of Cap. 245\n\nThe  International  Trusts  Act,  Cap.  245  is  hereby  repealed  and  an\n33.\ninternational  trust  that  was  created  under  that  Act  on  the  day  immediately\npreceding January 1, 2019 shall from that date, be deemed to have been created\nunder this Act and the provisions of this Act shall apply thereto accordingly.\n\n\f22\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n"
}