{
  "bill_id": 343,
  "slug": "immigration-amendment-no-bill-2018",
  "title": "Immigration (Amendment) (No. ) Bill, 2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/7fac4c24f329d5a73a07870d9d593987.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-12-19",
  "first_reading": "2018-12-17",
  "gazette_date": "2018-12-19",
  "markdown": "Draft I: 2018-12-11\nOBJECTS AND REASONS\nThis Bill would amend the Immigration Act, Cap. 190 to revise the list of prohibited persons who are denied entry into Barbados.\nArrangement of Sections\nShort title\nAmendment of section 7 of Cap. 190\nAmendment of section 7A of Cap. 190\nAmendment of section 8 of Cap. 190\nRepeal and replacement of First Schedule to Cap. 190\nSCHEDULE\nBARBADOS\nA Bill entitled\nAn Act to amend the /mmigration Act, Cap. 190 to revise the list of prohibited persons who are denied entry into Barbados.\nENACTED by the Parliament of Barbados as follows:\nShort title\n1. This Act may be cited as the Jmmigration (Amendment) (No. ) Act, 2018.\nAmendment of section 7 of Cap. 190\n2. Section 7 of the Immigration Act, Cap. 190, in this Act referred to as the principal Act, is amended by deleting subsection (4) and substituting the following:\n“(4) The Minister, if he has reasonable grounds for believing that a permanent resident is a person mentioned in paragraph 3, 4, 5, 6, 7, 8 or 9 of the First Schedule, may declare in writing under his hand that that person has lost the status of permanent resident from such time is as specified in the declaration.”.\nAmendment of section 7A of Cap. 190\n3. Subsection (1) of section 7A of the principal Act is amended by deleting the words “9 and 10” in paragraph (b) and substituting the words “10 and 11”.\nAmendment of section 8 of Cap. 190\n4. Section 8 of the principal Act is amended by deleting subsection (2) and substituting the following:\n“(2) The Minister may, in writing under his hand or the hand of a person designated by him, exempt from the operation of subsection (1)\n(a) aperson described in paragraph | or 2 of the First Schedule whose entry into Barbados to seek treatment and care at a hospital or other place or institution for that treatment and care is approved by the Minister responsible for Health;\n5\n(b) aperson described in paragraph 1 of the First Schedule if the Minister is satisfied that that person is a member of a family already lawfully in Barbados and another member of that family gives up security satisfactory to the Minister against that person becoming a charge on public funds;\n(c) aperson described in paragraph 4 of the First Schedule;\n(d) a person described in paragraph 7 of the First Schedule in respect of whom the Minister is satisfied that\n(i) that person has ceased to be a member of or associated with an organisation, group or body so described; and\n(ii) the entry of that person would not be detrimental to the security of Barbados;\n(e) a person in lawful custody passing through Barbados in transit to another country.”.\nRepeal and replacement of First Schedule to Cap. 190\n5. The First Schedule to the principal Act is deleted and the First Schedule as set out in the Schedule to this Act is substituted.\n6\nSCHEDULE\n(Section 4)\n“FIRST SCHEDULE\n(Section 7(4), 7ZA(I)(b), 8)\nProhibited Persons\n1. Persons who are likely to become charges on public funds.\n2. Persons who are suffering from communicable diseases within the meaning of any regulations relating to such diseases made under the Health Services Act, Cap. 44.\n3. Persons\n(a) who are prostitutes;\n(b) who organise prostitution;\n(co) whose conduct offends public morality; or\n(d) who sexually assaults minors.\nPersons who\n(a) are or have been at any time engaged or reasonably suspected of being likely to engage in the unlawful giving or using, the offering or exposing for sale, or the buying of, or the trading or trafficking in, any drug; or\n(b) have been convicted of an offence under any enactment relating to dangerous or narcotic drugs.\n5. Persons who\n(a) have been convicted of or admit to having committed a criminal offence, which, if committed in Barbados, is punishable with imprisonment for a term of 5 years or longer;\n(6) knowingly or for profit or aid, encourage or procure other persons who are not citizens of Barbados to enter Barbados illegally;\n(c) are stowaways or seek to enter Barbados illegally.\n6. Persons who are or have been at any time before or after 2™ February, 1976 advocates of\n(a) the overthrow by force or violence of the Government of Barbados or any other country or of all forms or law;\n(b) the abolition of organised government;\n(c) the assassination of any person or the unlawful destruction of property.\n7. Persons who are or have been members of or affiliated to any organisation which entertains or teaches any doctrine or practice specified in sub-paragraphs (a) to (c) of paragraph 6.\n8. Persons who have been convicted of the offence of terrorism or in respect of whom there are reasonable grounds for believing they have financed or facilitated acts of terrorism.\n9. Persons in respect of whom there are reasonable grounds for believing that they are likely to engage in espionage, sabotage or other subversive activity directed against or detrimental to the security of Barbados.\n10.\nPersons against whom deportation orders have been made.\n11. Persons seeking to enter Barbados who are not in possession of a passport.”.\n"
}