{
  "bill_id": 344,
  "slug": "customs-amendment-bill-2018",
  "title": "Customs (Amendment) Bill  2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/bd938a06139d44adb0a910f832133279.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-12-15",
  "first_reading": "2018-12-19",
  "gazette_date": "2018-12-17",
  "markdown": "C i)\n2018-12-06\nOBJECTS AND REASONS\nThis Bill would amend the Customs Act, Cap. 66 to revise the provisions of the Act with respect to the submission and receipt of advance passenger information and to provide for other related matters.\nArrangement of Sections\nShort title\nAmendment of section 2 of Cap. 66\nAmendment of section 34 of Cap. 66\nRepeal and replacement of section 34A of Cap. 66\nInsertion of sections 34A.1 and 34A.2 into Cap. 66\nAmendment of the First Schedule to Cap. 66\nRepeal and replacement of the Second Schedule to Cap. 66\nSCHEDULE\nBARBADOS\nA Bill entitled\nAn Act to amend the Customs Act, Cap. 66 to revise the provisions of the Act with respect to the submission and receipt of advance passenger information and to provide for other related matters.\nENACTED by the Parliament of Barbados as follows:\nShort title\n1. This Act may be cited as the Customs (Amendment) Act, 2018.\nAmendment of section 2 of Cap. 66\n2. Section 2 of the Customs Act, Cap. 66, in this Act referred to as the principal Act, is amended by inserting in the appropriate alphabetical order the following definitions:\n“ “airline designator” means a code assigned to an airline by the International Air Transport Association or the International Civil Aviation Organisation;\n“advance passenger information” means the information in respect of a passenger, crew member or other person transported in an aircraft or a ship;\n“CARICOM” means the Caribbean Community established by the Treaty;\n“code share information” means an arrangement between 2 or more airlines to publish and market a flight under\n(a) a flight number; and\n(b) an airline designator,\nof the airlines as part of the timetable or schedule of the airlines;\n“IMPACS” means the CARICOM Implementing Agency for Crime and Security established under the Agreement Establishing the CARICOM Implementation Agency for Crime and Security, 2006;\n“intelligence agency” means a law enforcement agency which is established to share information and intelligence and to\n5\ncollaborate and cooperate with any other law enforcement agency on matters of mutual interest;\n“JRCC” means the Joint Regional Communication Centre which is a sub-agency of IMPACS which receives advance passenger information data and advance cargo information data;\n“participating country” means any country which enters into an agreement with JRCC to share advance passenger information data or advance cargo information data;\n“PNR” means passenger name record;\n“split or divided PNR information” means the division of PNR where one or more passenger is moved from an existing reservation on an aircraft or a ship and is given a new reservation on an aircraft ora ship;\n“Treaty” means the Revised Treaty of Chaguaramas Establishing the Caribbean Community, including the CARICOM Single Market and Economy, that was signed in the Bahamas on 5\" July, 2001;\n“watch list” means a list which is compiled by an intelligence agency and which is used to watch or track the activities of criminals, criminal deportees and other persons of interest;”.\nAmendment of section 34 of Cap. 66\n3. Section 34 of the principal Act is amended by\n(a) inserting immediately after subsection (3) the following:\n“(3A) The master of every ship and the commander of every aircraft or the agent of the master or commander of the ship or aircraft, respectively, shall, at such time as is provided in subsection (4), provide the Chief Operations Officer of JRRCwith the data set out in Part | of\n6\nthe First Schedule in an electronic format or in the form of a report that is approved by the Chief Operations Officer.”; and\n(b) deleting subsection (4) and substituting the following:\n“(4) Where a ship or an aircraft is expected to arrive in Barbados, the data referred to in subsections (3) and (3A) shall be provided in the case of\n(a) a commercial aircraft, no later than 40 minutes prior to the departure from the last port of call;\n(b) a private aircraft, no later than 40 minutes prior to the departure from the last port of call;\n(c) aship arriving from outside the domestic space, no later than 24 hours prior to arrival; and\n(ad) aship arriving from a destination within the domestic space, no later than one hour prior to arrival.”.\nRepeal and replacement of section 34A of Cap. 66\n4. The principal Act is amended by deleting section 344A and substituting the following:\n“JRCC to share advance passenger information with intelligence agencies\n34A. Where data is provided to the Chief Operations Officer of JRCC pursuant to section 34(3A), the Chief Operations Officer shall share that information with intelligence agencies.”.\nInsertion of sections 34A.1 and 34A.2 into Cap. 66\n5. The principal Act is amended by inserting immediately after section 34A the following as section 34A.1 and section 34A.2:\n“Use of advance passenger information by JRCC\n34A.1.(1) Where the Chief Operations Officer of JRCC receives data pursuant to section 34(3A), JRCC shall use the advance passenger information to conduct screening of persons who are on board a ship or an aircraft, which enters, departs from or travels within the domestic space.\n(2) JRCC shall use the advance passenger information referred to in subsection (1) to conduct screening of persons against a watch list for the purposes of assisting participating countries or intelligence agencies in the furtherance of national, regional and international security.\n(3) Where JRCC conducts screening of persons pursuant to subsection (2) and as a result of the screening suspects that a person on board a ship or an aircraft is\n(a) acriminal;\n(b) acriminal deportee;\n(c) involved in criminal activity; or\n(d) aperson of interest to an intelligence agency,\nJRCC shall share the information with law enforcement agencies of participating countries and with intelligence agencies.\nWaiver\n34A.2.(1) The Minister may by order\n(a) waive any requirements of subsection (2), (3) or (3A) of section 34;\n(b) modify any of the data referred to in the First Schedule; or\n(c) waive or modify any of the requirements of subsection (4) of section 34 with regard to the time required for the submission of data.\n(2) An order made under subsection (1) is subject to negative resolution.”.\nAmendment of the First Schedule to Cap. 66\n6. The First Schedule to the principal Act is amended by\n(a) deleting the words “34A(1)(b)” wherever they appear and substituting the words “34A.2(1)(b)”; and\n(b) inserting immediately after paragraph B of Part I the following:\n“ C. Passenger Name Record Data as Available in a Ships’s or an Aircraft’s Reservation System\n|. PNR Locator\nPNR locator.\n2. Date of Reservation or Issue of Ticket Date of reservation or issue of ticket for passenger.\n3. Date(s) of Intended Travel\nDate(s) of intended travel for passenger.\n9\n. Surname and Given Name(s)\nFamily name and given name(s) of passenger.\n. Address and Contact Information\nAddress and contact information of passenger including\ntelephone number(s) and e-mail address.\n. Information on Form of Payment for Ticket\nInformation on form of payment for ticket of passenger\nincluding billing address.\n. Travel Itinerary\nComplete travel itinerary of passenger.\n. Frequent Flyer Information\nFrequent flyer information of passenger.\n. Travel Agency or Travel Agent\nTravel agency or travel agent used to reserve ticket of passenger.\n. Travel Status of Passenger\nTravel status of passenger including confirmations, check-in\nstatus and no show status.\n. Split or divided PNR Information\nSplit or divided PNR information.\n. Ticketing Information\nTicketing information for passenger including ticket number,\ndate of issuance of ticket, one way tickets and automated ticket\nfare quotations.\n13. Seat Information\nSeat number and any other seat information for passenger.\n14. Baggage Information\nAll baggage information for passenger.\n15. Code Share Information\nWhere applicable, code share information for passenger.\n16. Number and Names of Other Persons\nNumber and name(s) of person(s) travelling with passenger.\n17. General Remarks\nGeneral remarks including all available information on\nunaccompanied minors under 18 years such as the name and gender of the minor, language spoken by the minor, name and contact details of guardian on departure and relationship to the minor, name and contact details of guardian on arrival and relationship to the minor and the departure and arrival agent.\n18. Any Advance Passenger Information\nAny advance passenger information data collected for passenger.\n19. Historical Changes to the PNR\nAny historical changes to the PNR listed at | to 18.\nRepeal and replacement of the Second Schedule to Cap. 66\n7. The Second Schedule to the principal Act is deleted and the Second Schedule as set out in the Schedule to this Act is substituted.\nUl\nSCHEDULE\n(Section 7)\n“SECOND SCHEDULE\n(Section 2)\nDomestic Space\n. Anguilla is) Antigua and Barbuda . Bahamas . Barbados . Belize 3 4 5 6, Bermuda 7. British Virgin Islands 8. Cayman Islands 9. Dominica 10. Grenada 11. Guyana 12. Haiti 13, Jamaica 14. Montserrat 15. St. Kitts and Nevis 16. St. Lucia 17. St. Vincent and the Grenadines 18. Suriname 19. Trinidad and Tobago 20. Turks and Caicos Islands *\n"
}