{
  "bill_id": 345,
  "slug": "intepretation-amendment-bill-2018",
  "title": "Intepretation (Amendment) Bill  2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3431d966914c3af296fbed155ce18396.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-03-05",
  "first_reading": "2019-03-06",
  "gazette_date": "2019-03-06",
  "markdown": "Second Draft 2018-11-29\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Interpretation Act, Cap. 1 to make new provision\nfor the gazetting of enactments, legal notices and general information of interest\nto the public.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of section 2 of Cap. 1\n\nAmendment of section 43 of Cap. 1\n\nInsertion of section 50A in Cap. 1\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Interpretation Act, Cap. 1.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Interpretation (Amendment) Act, 2018.\n\n\f4\n\nAmendment of section 2 of Cap. 1\n\nSection 2 of the Interpretation Act, Cap. 1 in this Act referred to as\n2.\nthe  principal  Act,  is  amended  by  inserting  the  following  definitions  in  the\nappropriate alphabetical order:\n\n“ “printing” includes reproduction by electronic, digital or any other\n\nmeans;\n\n“publication” includes publication by electronic means;”.\n\nAmendment of section 43 of Cap. 1\n\n3.\n\nSection 43 of the principal Act is amended by\n\n(a)\n\ndeleting  the  definition  of  “Gazette”  or  “Official  Gazette”  and\nsubstituting the following:\n\n“  “Gazette” or “Official Gazette” means the Official Gazette published\nby order of the Government, whether printed or in electronic form\nand includes supplements thereto and any Gazette Extraordinary\nso published;”;\n\n(b)\n\ndeleting the definition of “Government Printer” and substituting the\nfollowing:\n\n“  “Government  Printer”  means  any  person  authorised  to  print\n\nenactments and other documents of the Government;”.\n\nInsertion of section 50A in Cap. 1\n\n4.\nimmediately after section 50:\n\nThe  principal  Act  is  amended  by  inserting  the  following  section\n\n\f5\n\n“Publication of the Official Gazette\n\n50A.(1)\nany form and manner as the Minister determines.\n\nThe Official Gazette may be published by any means and in\n\nThe Official Gazette may be published in such parts or divisions\n\n(2)\nas the Minister thinks fit.”.\n\n"
}