{
  "bill_id": 346,
  "slug": "insurance-amendment-bill-2018",
  "title": "Insurance (Amendment) Bill  2018",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/4c85521e1da1453701ea78aecfa4de2c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2018-12-15",
  "first_reading": "2018-12-19",
  "gazette_date": "2018-12-17",
  "markdown": "2012-12-14\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Insurance Act, Cap. 310 to make provision for new\n\nclasses of insurance licensees and for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 2 to Cap. 310\n\nAmendment to section 3 of Cap. 310\n\nAmendment of Cap. 310\n\nAmendment to section 9 of Cap. 310\n\nAmendment to section 13 of Cap. 310\n\nAmendment to section 13A of Cap. 310\n\nAmendment to section 22 of Cap. 310\n\nAmendment to Cap. 310\n\n10.\n\nAmendment to section 23 of Cap. 310\n\n11.\n\nAmendment to section 33 of Cap. 310\n\n12.\n\nAmendment to section 39 of Cap. 310\n\n13.\n\nAmendment of Cap. 310\n\n14.\n\nAmendment of Cap. 310\n\n15.\n\nAmendment of Cap. 310\n\n\f16.\n\nAmendment of Cap. 310\n\n17.\n\nAmendment of Cap. 310\n\n18.\n\nAmendment of Cap. 310\n\n19.\n\nContinuation of licensee\n\n20.\n\nSavings\n\n21.\n\nRepeal\n\n22.\n\nCommencement\n\n3\n\nSCHEDULE\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Insurance Act, Cap. 310.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Insurance (Amendment) Act, 2018.\n\n\f6\n\nAmendment of section 2 to Cap. 310\n\n2.\nAct, is amended\n\nSection 2 of the Insurance Act, in this Act referred to as the principal\n\n(a)\n\nby  deleting  the  definition  of  “principal  representative”  and\nsubstituting the following:\n\n“\n\n“principal representative” means a licensee’s management company or\nsuch individual as the Commission approves for the purpose of\nmanaging the business of a licensee or the representative notified\nto the Commission as such in accordance with the Act;”;\n\n(b)\n\n(c)\n\n(d)\n\nby deleting the word “Supervisor” wherever it appears in the Act and\nsubstituting therefor the word “Commission”;\n\nby deleting the definition of “qualifying insurance company”;\n\nby  inserting  the  following  new  definitions  in  their  appropriate\nalphabetical order:\n\n“  “Commission” means the Financial Services Commission established\nby the Financial Services Commission Act (Act 2010-21);\n\n“holding company” means a body corporate that satisfies the following\n\nrequirements:\n\n(a)\n\nit is incorporated under the Companies Act, Cap. 308 and its\nsole object is to own shares in a company whose objects and\nactivities  are  the  transaction  of  insurance  business  under\nClass 1 or Class 2;\n\n(b)\n\nat least one of its directors is a resident citizen of Barbados;\n\n(c)\n\nit is registered with the Commission;\n\n\f7\n\n“insurance business” means the business of effecting and carrying out\n\ncontracts\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthat  provide  for  the  protection  of  persons  against  loss  or\nliability  in  respect  of  risk  to  which  such  persons  may  be\nexposed;\n\nby virtue of which the company assumes the obligation to pay\na sum of money or other thing of value upon the happening\nof an event;\n\nthat provide for re-insurance; and\n\nrelating to pensions and other business directly connected to\ninsurance business;\n\n“licensee”  means  an  entity  licensed  to  carry  on  business  within  a\n\nspecified class under this Act;\n\n“management  services”\n\nthe  provision  of  accounting,\nadministrative,  brokerage  and  underwriting  services,  and  the\nprocessing of claims for insurance business;\n\nincludes\n\n“manager” means a person who, not being an employee of a licensee,\n\nprovides management services to one or more licensees;\n\n“premium income” means the net premium earned after deducting any\n\npremiums paid by the licensee for re-insurance;\n\n“securities” has the meaning assigned to it by section 2 of the Securities\n\nAct, Cap. 318A;”.\n\nAmendment to section 3 of Cap. 310\n\n3.\n\nSection 3 of the principal Act is amended in subsection (1) by\n\n(a)\n\ndeleting the word “or” appearing in paragraph (i) thereof; and\n\n\f8\n\n(b)\n\ninserting  therein  the  following  new  paragraphs  immediately  after\nparagraph (i):\n\n“(i.1)\n\nfinancial insurance business;\n\n(i.2)\n\nworkmen’s compensation insurance business; and\n\n(i.3)\n\npublic liability insurance business; or”.\n\nAmendment of Cap. 310\n\n4.\nsection immediately after section 3:\n\nThe principal Act is amended by inserting therein the following new\n\n“Classes of licensee\n\n3A.(1)\nfollows:\n\n(a)\n\n(b)\n\n(c)\n\nThere  shall  be  three  classes  of  licensee  under  this  Act  as\n\nClass 1 licensee which shall be an insurance company which\nunderwrites related party business;\n\nClass 2 licensee which shall include an insurance company\nwhich underwrites risks of third parties;\n\nlicensee  which  shall\n\nClass  3\ninsurance\nintermediary,  an  insurance  management  company  and  an\ninsurance holding company\n\ninclude  an\n\nAll categories specified in subsection (1) shall pay the licence fee\n\n(2)\nas prescribed.\n\nNotwithstanding subsection (1), the Commission may place any\n\n(3)\napplicant into any of the classes set out in that subsection.\n\nThe  Commission  may  in  the  grant  of  licences,  issue  such\n\n(4)\nconditions as it may deem fit.”.\n\n\f9\n\nAmendment to section 9 of Cap. 310\n\n5.\n\nSection 9 of the principal Act is amended\n\n(a)\n\n(b)\n\n(c)\n\nin subsection (1) by deleting paragraph (f) thereof;\n\ndeleting the word “and” appearing at the end of paragraph (e) and\ninserting a full-stop;\n\nby  inserting  the  following  new  subsections  immediately  after\nsubsection (1):\n\n“(1A)\nParagraphs (a) to (e) of subsection (1) shall apply to an insurer\nwhich  carries  on  insurance  business  of  insuring  risks  located  within\nBarbados,  and  in  respect  of  which  premiums  originate  from  within\nBarbados.\n\nParagraph (f) of subsection (1) shall apply to an insurer which\n(1B)\ncarries  on  insurance  business  of  insuring  risks  located  outside\nBarbados,  and  in  respect  of  which  premiums  originate  outside\nBarbados.”;\n\n(d)\n\nby  inserting  the  following  new  subsection  immediately  after\nsubsection (2):\n\n“(2A)\nSubsection  (2)  shall  apply  to  an  insurer  which  carries  on\ninsurance business of insuring risks located outside Barbados, and in\nrespect of which premiums originate outside Barbados.”.\n\nAmendment to section 13 of Cap. 310\n\n6.\nSection  13  of  the  principal  Act  is  amended  by  deleting  the  words\n“class or classes of insurance business for which it is registered” appearing in\nthe third line thereof and substituting the words “the Class of licence granted\nunder section 3A”.\n\n\f10\n\nAmendment to section 13A of Cap. 310\n\n7.\n\nSection 13A of the principal Act is deleted.\n\nAmendment to section 22 of Cap. 310\n\n8.\n\nSection 22 of the principal Act is amended\n\n(a)\n\nin  subsection  (1)  by  deleting  the  opening  words  thereof  and\nsubstituting the following:\n\n“No insurer carrying on the insurance business of insuring risks located\nwithin  Barbados  and  in  respect  of  which  premiums  originate  from\nBarbados.”; and\n\n(b)\n\nin subsection (2) by deleting the words “Any person” appearing in\nthe first line thereof and substituting the words “A licensee who holds\na Class 2 licence”.\n\nAmendment to Cap. 310\n\n9.\n\nSection 22A is deleted and the following substituted:\n\n“22A.\nAn insurer carrying on the insurance business of insuring\nrisks located outside of Barbados, and in respect of which premiums\noriginate outside of Barbados shall comply with the requirements as the\nCommission may determine.”.\n\nAmendment to section 23 of Cap. 310\n\n10.\nnew subsection immediately after subsection (4):\n\nSection 23 of the principal Act is amended by inserting the following\n\n\f11\n\n“(5)\nThis  section  shall  apply  only  to  an  insurer  which  carries  on\ninsurance  business  of  ensuring  risks  located  within  Barbados  and  in\nrespect of which premiums originate within Barbados.”.\n\nAmendment to section 33 of Cap. 310\n\n11.\n“Minister” and inserting the words “the Commission”.\n\nSection  33  of  the  principal  Act  is  amended  by  deleting  the  words\n\nAmendment to section 39 of Cap. 310\n\n12.\nnew subsection immediately after subsection (12):\n\nSection 39 of the principal Act is amended by adding the following\n\nThis  section  shall  only  apply  to  an  insurer  which  carries  on\n“(13)\ninsurance business of insuring risks located within Barbados, and in\nrespect  of  which  premiums  originate  within  Barbados  where  that\ninsurer  issues  policies  of  insurance  to  a  citizen  or  resident  of\nBarbados.”.\n\nAmendment of Cap. 310\n\n13.\nimmediately after section 49:\n\nThe principal Act is amended by inserting the following new section\n\n“Non-application of certain sections to class\n\n49A.\nshall not apply to Class 1 licensees.”.\n\nSections 22, 23, 25-34, 39(2), 46-49, 58, 100-147, 148-187\n\n\f12\n\nAmendment of Cap. 310\n\n14.\ntherein immediately after Part II:\n\nThe principal Act is amended by inserting the following new Part\n\n“PART IIA\n\nSPECIAL REQUIREMENTS FOR THE INSURANCE OF RISKS\nORIGINATING OUTSIDE BARBADOS\n\nConditions of Licence\n\nIn  issuing  a  licence  under  this  Act,  the  Commission  may\n70A.(1)\nspecify the class or classes of insurance business in which the licensee\nmay engage.\n\nNotwithstanding  section  8  of  the  Aliens  Act,  Cap.  185,  the\n(2)\nMinister may attach such conditions to the issue of a licence relating to\nthe real property investments and holdings of a licensee as the Minister\nthinks fit.\n\nIt is a condition of a licence under this Part that the licensee shall\n\n(3)\nnot, without the prior approval in writing of the Minister,\n\n(a)\n\n(b)\n\nenter into a merger or consolidation;\n\ntransfer, otherwise than in the ordinary course of its business\nincluding a transfer by way of re-insurance, the whole or any\npart of its assets or liabilities;\n\n(c)\n\ncharge the whole or any part of its assets;\n\n(d)\n\nchange its name from that set out in the licence;\n\n(e)\n\nengage  in  a  class  of  insurance  business  other  than  that\nspecified in its licence;\n\n(f)\n\nalter its articles of incorporation.\n\n\f13\n\n(4)\nIt shall not be a condition of a licence issued under this Part that\nthe licensee commences business within a specific period of time; and\na  licensee  shall  not  be  struck  off  the  register  of  companies  or  incur\npenalty  or  sanction  for  not  commencing  business  within  a  specified\nperiod of time, notwithstanding any other enactment to the contrary.\n\nSubsection  (3)(b)  does  not  apply  where  the  licensee  has  filed\n(5)\ndocuments specifying procedures which in the opinion of the Minister\nare satisfactory for effecting the full discharge of any liabilities that may\narise under the laws of Barbados in relation to the licensee.\n\nSubsection (3)(c) does not apply where the charge is by way of\n(6)\nletters of credit issued to secure the insurance of reinsurance obligations\nof the licensee.\n\nManagement services\n\nNotwithstanding  any  other  enactment  and  subject  to\n70B.(1)\nsubsection (2), no person other than a management company may offer\nor  provide  management  services  to  a  licensee  conducting  insurance\nbusiness from within Barbados.\n\nSubsection (1) shall not apply to a company that has satisfied the\n\n(2)\nCommission that\n\n(a)\n\n(b)\n\nit is resident in Barbados; and\n\nthe majority of its directors are resident in Barbados.\n\nRequirements for management company\n\n70C.\nthe following requirements:\n\nA management company is a body corporate that satisfies\n\n(a)\n\nits main object and activity are the provision of management\nservices other than banking business as defined by section 2\nor Part IIIB of the Financial Institutions Act, Cap. 324A or\nto licensees under this Act; or\n\n\f14\n\n(b)\n\nit is registered with the Commission in compliance with this\nAct.\n\nRegistration as management company\n\n70D.(1)\nA  company  that  wishes  to  register  as  a  management\ncompany under this Act may apply to the Commission to be registered\nsetting  out  the  management  services  that  it  proposes  to  offer  to  a\nlicensee  under  this  Act,  and  providing  a  copy  of  its  articles  of\nincorporation and such other information as may be prescribed.\n\nAn application under subsection (1) must be accompanied by the\n\n(2)\nprescribed application fee.\n\nIn considering an application under this section, the Commission\n\n(3)\nshall take into account\n\n(a)\n\nthe  ability  of  the  company  to  provide  the  proposed\nmanagement services; and\n\n(b)\n\nthe character and reputation of the company.\n\nWhen the Commission is satisfied that a company is registrable\n(4)\nunder this section, he shall, upon payment of the prescribed fee, but\nsubject to subsection (5), issue to the company a license containing the\nname  and  business  address  of  the  company  and  the  date  of  its\nregistration as a management company.\n\nWhere  in  considering  the  registration  of  a  company  the\n(5)\nCommission is of opinion that there are circumstances requiring that\nthe  company's  registration  should  be  subject  to  conditions,  he  may\nattach any of those conditions to the registration as are specified in the\ncertificate as the circumstances require.\n\nSubject to the payment of the annual prescribed fee, a license\n\n(6)\nremains valid until revoked or suspended by the Commission.\n\n\f15\n\n(7)\nThe  Commission  may  suspend  or  revoke  the  registration  of  a\nmanagement  company  in  such  circumstances  as  are  prescribed  by\nparagraphs (a), (b) and (c) of section 70I(1) and sections 70H and 70I\napply  with  such  adaptations  as  are  necessary  to  the  certificate  of\nregistration as they apply to a licence under this Act.\n\nDuty of Managers\n\n70E.\nA manager shall maintain an accurate list of all licensees for\nwhich he acts as manager and shall, if requested in writing at any time\nto do so by the Commission, provide the Commission with a copy of\nthat list.\n\nHolding Companies\n\n70F.\ncorporate that satisfies the following requirements:\n\nFor the purposes of this Act, a holding company is a body\n\n(a)\n\nit is incorporated under the Companies Act, Cap. 308 and its\nsole object is to own shares in a company whose objects and\nactivities are the transaction of insurance business; and\n\n(b)\n\nit  is  registered  with  the  Commission  in  compliance  with\nsection 70H.\n\nResident citizens consent to director\n\n70G.\nA resident citizen who has consented to his appointment as\na  director  of  a  holding  company  must,  before  the  registration  of  the\narticles  of  incorporation  of  the  company,  file  with  the  Registrar  of\nCompanies a consent signed by him to act as a director.\n\nProcedures for registration of a holding company\n\nA  company  that  wishes  to  register  as  a  holding  company\n70H.(1)\nunder  this  Part  may  apply  to  the  Minister  for  approval  to  be  so\nregistered.\n\n\f16\n\n(2)\nAn  application  under  this  section  must  be  accompanied  by  a\ncertified copy of the articles of incorporation of the company under the\nCompanies Act, Cap. 308 and the prescribed application fee.\n\n(3)\n\nIn considering the application, the Minister shall\n\n(a)\n\nensure that the sole object of the company is to own shares\nin a company whose objects and activities are the transaction\nof insurance business from within Barbados;\n\n(b)\n\ntake  into  account  the  character  and  reputation  of  the\ncompany.\n\nWhere  the  Minister  is  satisfied  that  a  company  is  registrable\n(4)\nunder this section, he shall, subject to subsections (5) and (6), approve\nthe registration of the company.\n\nOn receipt of the Minister's approval under subsection (4), the\n(5)\nCommission  shall,  upon  payment  of  the  prescribed  fee,  issue  to  the\ncompany a certificate of registration containing the name and business\naddress  of  the  company  and  the  date  of  its  registration  as  a  holding\ncompany.\n\nNotwithstanding  anything  contained  in  this  section,  where  the\n(6)\nCommission is of the opinion that there are circumstances requiring the\ncompany's registration to be subject to conditions, he may, in addition\nto requiring the company to submit one copy of its financial statements\nin a form that complies with generally accepted accounting principles\nand such other information as may be prescribed, specify such other\nconditions in the certificate of registration as the circumstances require.\n\nSubject  to  the  payment  of  an  annual  registration  fee,  the\n(7)\ncertificate of registration remains valid until revoked or suspended by\nthe Minister.\n\n\f17\n\nThe Minister may suspend or revoke a certificate of registration\n\n(8)\nwhere a holding company\n\n(a)\n\n(b)\n\nfails to comply with a condition specified in that certificate;\nor\n\nis in breach of any duty or obligation imposed upon it by or\nunder this Part and sections 70H and 70I apply, with such\nadaptations as are necessary, to the certificate of registration\nas they apply to a licence under this Part.\n\nRevocation or suspension of licence\n\n70I.(1)\nPart\n\n(a)\n\n(b)\n\nThe Minister may revoke a licence if the licensee under this\n\nfails to comply with a condition of its licence;\n\nis in breach of any duty or obligation imposed upon it by this\nPart or commits an offence under this Part; or\n\n(c)\n\nceases to carry on business under its licence.\n\nThe Minister may by notice in writing addressed to the licensee\n(2)\ndirect the licensee to remedy any breach of this Act within the time\nspecified in the notice.\n\nWhere the licensee fails to comply with the Minister's directions,\n(3)\nthe  Minister  may  suspend  the  licence  for  a  period  not  exceeding  90\ndays, and his decision thereon is final.\n\nWhere the Minister intends to revoke or suspend a licence under\n(4)\nthis section, it is his duty to give the licensee notice of his intention to\ndo so and reasonable opportunity to show cause why the licence should\nnot be revoked or suspended, as the case may be.\n\nIt is the duty of the Minister to give the licensee notice of the\n\n(5)\nsuspension or revocation of the licence.\n\n\f18\n\nAppeal against revocation of licence\n\n70J.(1)\nA person who is aggrieved by the revocation of a licence by\nthe Minister may within 30 days of the giving of the notice of revocation\nunder section 12 appeal against that revocation to a Judge in Chambers,\nwhose decision thereon is final.\n\nThe Minister may, pending the determination of an appeal under\n(2)\nsubsection (1), suspend the operation of the revocation of the licence\nin relation to the existing business of the licensee.\n\nWhere the Minister revokes a licence and there is no appeal or\n(3)\nwhere there is an appeal that is disallowed, the notice of revocation must\nbe published in the Official Gazette and in a daily newspaper published\nand circulated in Barbados.”.\n\nAmendment of Cap. 310\n\n15.\ninto Part V immediately before section 100:\n\nThe principal Act is amended by inserting the following new section\n\n“99A.\nThis  Part  V  shall  apply  only  to  an  insurer  carrying  on\nbusiness of insuring risks located within Barbados, and in respect of\nwhich premiums originate from Barbados.”.\n\nAmendment of Cap. 310\n\n16.\ninto Part VI immediately before section 148:\n\nThe principal Act is amended by inserting the following new section\n\n\f19\n\n“147A.\nThis  Part  VI  shall  apply  only  to  insurers  licensees  which\ncarry  on  general  insurance  business  with  a  citizen  or  resident  of\nBarbados.”.\n\nAmendment of Cap. 310\n\n17.\ninto Part VII immediately before section 158:\n\nThe principal Act is amended by inserting the following new section\n\n“157A.\nThis  Part  VII  shall  apply  only  to  an  insurer  carrying  on\ninsurance business of insuring risks located within Barbados, and in\nrespect of which premiums originate from Barbados.”.\n\nAmendment of Cap. 310\n\n18.\n\nThe principal Act is amended by deleting the Fourth Schedule.\n\nContinuation of licensee\n\nA  company  that  held  a  license  under  the  Exempt  Insurance  Act,\n19.\nCap. 308A now repealed by this Act on the day immediately preceding the 1st\nday  of  January  2019  under  that  Act  shall,  from  that  date,  be  deemed  to  be\nlicensed  under  this  Act  and  the  provisions  of  this  Act  shall  apply  to  that\ncompany accordingly.\n\nSavings\n\n20.\nNotwithstanding  the  repeal  effected  by  section  21,  the  rights  and\nbenefits  conferred  upon  licensees  under  the  Exempt  Insurance  Act,\nCap. 308A are saved or shall cease as is hereafter provided:\n\n(a)\n\na licensee holding a valid licence issued prior to 17th October 2017\nshall be entitled to receive its benefits until 30th June 2021;\n\n\f20\n\n(b)\n\na licensee holding a valid licence issued on or after 17th October 2017\nshall cease to be entitled to any benefits after 31st December 2018.\n\nRepeal\n\n21.\nto the extent set out in the second column thereof.\n\nThe enactment set out in the first column of the Schedule is repealed\n\nCommencement\n\n22.\n\nThis Act shall come into operation on the 1st day of January, 2019.\n\n\f21\n\nSCHEDULE\n\n(Section 21)\n\nColumn 1\n\nColumn 2\n\nExempt Insurance Act, Cap. 308A\n\nThe whole Act\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2018.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2018.\n\nPresident\n\n"
}