{
  "bill_id": 34,
  "slug": "lease-to-bamc-limited-groves-plantation-st-george",
  "title": "Lease to BAMC Limited Groves Plantation, St George",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/9347f4e8971eb5543a08dad38527f04b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2014-12-17",
  "first_reading": "2014-12-17",
  "second_reading": "2014-12-16",
  "gazette_date": null,
  "passed_date": "2014-12-17",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 approve the lease to the Barbados Agricultural Management Company Limited of the parcel of land, together with the buildings thereon, the property of the Crown situate at Groves Plantation, Groves in the parish of Saint George in this Island, more particularly described in the First Schedule hereto on the terms and conditions set out in the Second Schedule hereto to provide accommodation for the Agronomy Research and Variety Testing Unit.\nAPPROVED by the House of Assembly this day of , [wo thousand and fourteen.\nSpeaker\nAPPROVED by the Senate this day\nof\nTwo thousand and fourteen.\nPresident\n;\nFIRST SCHEDULE\nALL THAT LAND situate at Groves in the parish of Saint George in this\nIsland being Lot G containing by admeasurement 6,617 square metres or thereabouts. Abutting and Bounding on lands now or formerly of the Groves Agricultural Station on Lot A, also being lands now or formerly of the Groves Agricultural Station, on other lands now or formerly of the Groves Agricultural Station and on aroad leading to a public road which leads to Highway 3B in one direction and to Market Hill in the other direction or however else the same may abut and bound as shown and delineated on a Plan certified on the 26\" day of June, 1996 by Andrew P. Weekes, Land Surveyor and recorded in the Lands and Surveys Department on the 2\" day of August, 1996 as Plan No. 636/96.\nSECOND SCHEDULE\nTERMS AND CONDITIONS\nThe lease shall be for a period of fifteen (15) years with an option to renew fora further term.\nThe initial rent shall be at arate at $1 000.00 per annum, and shall be subject to review at the end of every five (5) year period within the term.\nWw\nThe lessee shall be responsible for the payment of insurance premiums, repairs and maintenance of the buildings, the payment of land taxes, utilities and other outgoings arising out of the use of the property.\nThe lessee shall bear the cost of the development of the site and shall comply with the Town and Country Planning requirements and other statutory requirements.\nLes)\nADDENDUM\nThe Cabinet at its meeting held on the 25th day of August, 2011 ratified its decision taken by round-robin on the 23rd August , 2011 to grant anew lease of the 6,617 square metres of land at Groves Plantation in the parish of Saint George to the Barbados Agricultural Management Company Limited.\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 the approval of Parliament is being sought for the lease to the Barbados Agricultural Management Company Limited of the parcel of land togehter with the buildings thereon, more particularly described in the First Scedule to this Resoloution, for the purpose of providing accomodation for the Agronomy Research and Variety Testing Unit on the Terms and Conditions set out in the Second Scedule to the Resolution.\nGRID NORTH LAMDS AND. - SURVEYS ~ ~ “lands ° << aes a“ ; we Me LOT WT PAVED «AREA woe oT ir pt Agricultural [s ae G. GEPARTMENT Porisn of : Si. Geerga Lecallty : Groves\nPLAN OF LAND: bderdered areen\nat\nGROVES, ST.GEORGE\ncontaining\n6617\nsurvayad fer DIVISICN OF HOUSING\nFor Lands and Surveys Gest orly\n"
}