{
  "bill_id": 360,
  "slug": "employment-rights-amendment-bill-2019",
  "title": "Employment Rights (Amendment) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b0146b074b9101ed37e387806823fa88.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-01-16",
  "first_reading": "2019-01-30",
  "gazette_date": "2019-01-30",
  "markdown": "2018-12-13\n\nOBJECTS AND REASONS\n\nThis Bill would  amend the Employment  Rights Act,  2012  (Act 2012-9)  to\nprovide for the requirement of an oath or affirmation of office to be taken by a\nperson who is appointed to the Employment Rights Tribunal.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nInsertion of section 6A into Act 2012–9\n\nAmendment of Second Schedule to Act 2012–9\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Employment Rights Act, 2012 (Act 2012-9) to provide\nfor the requirement of an oath or affirmation of office to be taken by a person\nwho is appointed to the Employment Rights Tribunal.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n2019.\n\nThis Act may be cited as the Employment Rights  (Amendment) Act,\n\nInsertion of section 6A into Act 2012–9\nThe Employment Rights Tribunal Act, 2012 (Act 2012-9) in this Act\n2.\nreferred to  as the principal  Act,  is amended by  inserting immediately  after\nsection 6 the following  new section:\n\n“Oath or Affirmation to be taken by Tribunal members\n6A.\nEvery person who is appointed a member of the Tribunal\nshall not enter upon his duties as a member of the Tribunal before he\nsubscribes  an  Oath  or  Affirmation  of  office  before  the  Governor\nGeneral as set out the Second Schedule.”.\n\nAmendment of Second Schedule to Act 2012–9\n3.\nimmediately after paragraph  8 the following:\n\nThe Second Schedule to the principal Act is amended by inserting\n\n“9.\n\nOATH AND AFFIRMATION\n\nOath of Office\n\nI,\n, do solemnly and sincerely swear that\nI will faithfully and impartially fulfil the duties as a member of\nthe Employment Rights Tribunal to the best of my ability in\naccordance with the provisions of the Employment Rights Act,\n2012 (Act 2012-9), so help me God.\n\n\f5\n\nAffirmation of Office\n\n, do solemnly, sincerely and truly declare\nI,\nand affirm that I will faithfully and impartially fulfil the duties\nas a member of the Employment Rights Tribunal to the best of\nmy ability in accordance with the provisions of the Employment\nRights Act, 2012 (Act 2012-9).\n\n”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\n, 2019.\n\nday of\n\nPresident\n\n"
}