{
  "bill_id": 362,
  "slug": "immigration-amendment-bill-2019",
  "title": "Immigration (Amendment) Bill 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/6c2f181ad8651ab44af1888ad83a9724.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-01-30",
  "first_reading": "2019-02-06",
  "gazette_date": "2019-02-06",
  "markdown": "2019-01-23\nOBJECTS AND REASONS\nThis Bill would amend the /mmigration Act, Cap. 190 to make provision for automated passport control kiosks.\nArrangement of Sections\nShort title\nAmendment of section 2 of Cap. 190\nAmendment of section 11 of Cap. 190\nAmendment of section 31 of Cap. 190\nBARBADOS\nA Bill entitled\nAn Act to amend the /mmigration Act to make provision for automated. passport control kiosks.\nENACTED by the Parliament of Barbados as follows:\nShort title\n1. This Act may be cited as the Immigration (Amendment) Act, 2019.\nAmendment of section 2 of Cap. 190\n2. Section 2 of the Immigration Act, Cap. 190, in this Act referred te as the principal Act, is amended by inserting the following definitions in the appropriate alphabetical order:\n“ “automated passport control kiosk” or “ kiosk” means a self-service machine designed to streamline the entry of persons into Barbados, which scans and authenticates passport data and facial biometric data, generates a series of questions to confirm biographic and flight information and prints a receipt to be submitted to an immigration officer;\n“entry receipt” means a receipt printed by an automated passport control kiosk for submission to an immigration officer, which bears\n(a) the letters “PG” indicating that passage been granted; or\n(b) the letter “X” indicating that further inspection is required;\n“facial biometric data” means a photographic image of the face of a person which is used for the purpose of identification;\n“passport data” means information in a passport including the passport number, expiration date of the passport, family and given names, nationality, date of birth, gender and other particulars which establish the identity of the person to whom the passport is issued;”.\nAmendment of section 11 of Cap. 190\n3. Section 11 of the principal Act is amended\n(a) by inserting immediately after subsection (1) the following new subsection:\n5\n“(1A) Notwithstanding subsection (1) and subject to such regulations as may be prescribed, a person who arrives in, seeks to enter or enters Barbados may proceed to an automated passport control kiosk prior to appearing before an immigration officer to be examined. ”; and\n(b) in subsection (2)\n(i) by deleting the words “subsection (1)” in the opening words and substituting the words “subsections (1) and (1A)”; and\n(ii) by inserting immediately after paragraph (b) the following new paragraph:\n“(b.1)where that person proceeded to an automated passport control kiosk prior to appearing before an officer, produce to that officer an entry receipt;”.\nAmendment of section 31 of Cap. 190\n4, Section 31 of the principal Act is amended in subsection (1) by inserting immediately after paragraph (c), the following new paragraph:\n“(c.L)prescribing the operation of automated passport control kiosks;”.\nRead three times and passed the House of Assembly this day of » 2019.\nSpeaker\nRead three times and passed the Senate this , 2019.\nPresident\nday of\n"
}