{
  "bill_id": 363,
  "slug": "supreme-court-of-judicature-amendment-bill-2019",
  "title": "Supreme Court of Judicature  (Amendment) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/4d148fc8afe894d46bc1e06af078a10e.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-02-06",
  "first_reading": "2019-02-06",
  "gazette_date": "2019-02-06",
  "markdown": "Explanatory Memorandum after page 13\n\n5th February, 2019 REV 2\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Supreme Court of Judicature Act, Cap. 117A to\n\nmake provision\n\n(a)\n\n(b)\n\n(c)\n\nto increase the number of judges in the High Court;\n\nfor the establishment of a Judicial Appointments Committee;\n\nfor the establishment of a commercial division of the High Court; and\n\n(d)\n\nfor related matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 4 of Cap. 117A\n\nAmendment of section 15 of Cap. 117A\n\nAmendment of section 16 of Cap. 117A\n\nInsertion of section 93A into Cap. 117A\n\nAmendment of the First Schedule to Cap. 117A\n\nInsertion of a Fourth Schedule into Cap. 117A\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\nFIRST SCHEDULE\n\nSECOND SCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Supreme Court of Judicature Act to\n\n(a)\n\n(b)\n\n(c)\n\nincrease the number of judges in the High Court;\n\nestablish a Judicial Appointments Committee;\n\nestablish a commercial division of the High Court; and\n\n(d)\n\nmake provision for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment) Act, 2019.\n\nThis  Act  may  be  cited  as  the  Supreme  Court  of  Judicature\n\nAmendment of section 4 of Cap. 117A\n\nSection 4 of the Supreme Court of Judicature Act, Cap. 117A, in this\n2.\nAct referred to as the principal Act, is amended by deleting subsection (1) and\nsubstituting the following:\n\n“(1)\n\nThe High Court consists of\n\n(a)\n\n(b)\n\nthe Chief Justice, ex officio; and\n\nnot  more  than  13  judges  to  be  styled  “Judges  of  the  High\nCourt”. ”.\n\nAmendment of section 15 of Cap. 117A\n\n3.\nand substituting the following :\n\nSection 15 of the principal Act is amended by deleting subsection (1)\n\n“Divisions of the High Court\n\n15.(1)\n\nThere shall be four divisions of the High Court, namely\n\n(a)\n\n(b)\n\n(c)\n\na Civil Division;\n\na Criminal Division;\n\na Commercial Division; and\n\n(d)\n\na Family Division.”.\n\n\f5\n\nAmendment of section 16 of Cap. 117A\n\n4.\nand substituting the following :\n\nSection 16 of the principal Act is amended by deleting subsection (1)\n\n“Jurisdiction of the Commercial and Family Division\n\n16.(1)\nAll causes and matters involving the exercise of the High\nCourt’s jurisdiction in proceedings specified in the First Schedule are\nassigned  where  specified  therein  to  the  Family  Division  or  the\nCommercial Division, as the case may be. ”.\n\nInsertion of section 93A into Cap. 117A\n\n5.\nimmediately after section 93:\n\nThe principal Act is amended by inserting the following new section\n\n“Judicial Appointments Committee\n\n93A.(1)\nThere  is  hereby  established  a  Judicial  Appointments\nCommittee which shall be responsible for making recommendations to\nthe Prime Minister, in respect of the persons to be appointed to any\nvacancy to the Supreme Court of Judicature, for the purposes of section\n81 of the Constitution .\n\n(2)\nThe Fourth Schedule applies with respect to the appointment and\nconstitution of the Judicial Appointments Committee and otherwise in\nrelation thereto.\n\nSubject  to  the  provisions  of  the  Fourth  Schedule,  the  Judicial\n(3)\nAppointments Committee shall meet as often as the business of that\nCommittee requires.\n\n\f6\n\n(4)\n\nThe Judicial Appointments Committee shall\n\n(a)\n\n(b)\n\nprepare a report on all matters relating to the business of that\nCommittee during the tenure of the Committee, as well as\nany problems connected therewith; and\n\nsubmit that report to the Prime Minister no later than the 31st\nMarch of the year following the calendar year in respect of\nwhich the report is prepared.\n\nThe Prime Minister shall forthwith table the report of the Judicial\n\n(5)\nAppointments Committee in Parliament. ”.\n\nAmendment of the First Schedule to Cap. 117A\n\nThe  principal  Act  is  amended  by  deleting  the  First  Schedule  and\n6.\nsubstituting therefor the First Schedule, as set out in the First Schedule to this\nAct.\n\nInsertion of a Fourth Schedule into Cap. 117A\n\nThe  principal  Act  is  amended  by  inserting  immediately  after  the\n7.\nThird Schedule the Fourth Schedule, as set out in the Second Schedule to this\nAct.\n\n\f7\n\nFIRST SCHEDULE\n\n“FIRST SCHEDULE\n\n(Section 6)\n\n(Section 16)\n\nPART I\n\nBUSINESS ASSIGNED TO THE FAMILY DIVISION\n\n1. Proceedings connected with any matrimonial cause or matter in respect of\nwhich the High Court exercises jurisdiction.\n\n2. Proceedings for a declaration in respect of\n\n(a) the validity of a marriage or of the dissolution or annulment of a marriage by\ndecree, and related matters;\n\n(b) the paternity of a child.\n\n3. Proceedings in relation to the wardship of minors.\n\n4. Proceedings under the Minors Act, Cap. 215, and otherwise in relation to the\nguardianship of minors, except proceedings for appointment of a guardian of a\nminor’s estate alone.\n\n5. Proceedings under section 26(3) of the Marriage Act, Cap. 218A.\n\n6. Proceedings in which a parent or guardian of a minor applies for a writ of\nhabeas corpus ad subjiciendum relative to the custody, care or control of the\nminor.\n\n7. Proceedings relating to the adoption of minors.\n\n8. Proceedings relating to\n\n(a)the enforcement of maintenance orders made overseas for periodical payments\nto a spouse or dependant;\n\n(b)persons under disability.\n\n\f8\n\nPART II\n\nBUSINESS ASSIGNED TO THE COMMERCIAL DIVISION\n\n1. Proceedings connected to business documents or contracts.\n\n2. Proceedings connected to the export or import of goods.\n\n3. Proceedings connected to the carriage of goods by land, sea, air or pipeline.\n\n4. Proceedings connected to the exploration of oil, gas reserves or other natural\nresources.\n\n5. Proceedings connected to insurance or re-insurance.\n\n6. Proceedings connected to banking or financial services.\n\n7. Proceedings connected to the operation of financial markets or stock exchanges.\n\n8. Proceedings connected to the purchase or sale of commodities.\n9. Proceedings connected to admiralty.\n\n10. Proceedings connected to business agency.\n\n11. Proceedings connected to arbitration.\n\n12. Proceedings connected to bankruptcy and insolvency.\n\n13. Proceedings connected to intellectual property.\n\n”.\n\n\f9\n\nSECOND SCHEDULE\n\n“FOURTH SCHEDULE\n\n(Section 7)\n\n(Section 93A(2))\n\nCONSTITUTION AND APPOINTMENT OF THE JUDICIAL\nAPPOINTMENTS COMMITTEE AND RELATED MATTERS\n\nComposition and membership of the Judicial Appointments\nCommittee\n\n1.\n\nThe Judicial Appointments Committee shall consist of\n\n(a)\n\n(b)\n\n(c)\n\nThe Chief Justice, ex officio;\n\nat least one person who is a former Justice of a court referred\nto in section 79C (a) of the Constitution;\n\nat least one person who is a former Chief Justice or a former\nJustice of Appeal;\n\n(d)\n\na former Judge of the High Court;\n\n(e)\n\na member of civil society;\n\n(f)\n\nan attorney -at- law with at least 10 years standing, who is\nmember  of  the  Barbados  Bar  Association,  as  established\npursuant to the Barbados Bar Association, Cap. 363.\n\nFunctioning of the Judicial Appointments Committee\n\n2.\nThe  Judicial  Appointments  Committee  shall  only  be\nrequired where the Prime Minister determines that a vacancy, which\nshall be filled, has occurred in the Supreme Court of Judicature.\n\n\f10\n\nAppointment of the Judicial Appointments Committee\n\n3.(1)\nIn any circumstance where a vacancy occurs in the Supreme\nCourt of Judicature, the Prime Minister shall by an instrument in writing\nappoint members to the Judicial Appointments Committee, other than\nthe person specified in paragraph 1(a).\n\n(2)\n\n(3)\n\nThe Prime Minister shall also appoint a member to be chairman.\n\nThe Prime Minister shall\n\n(a)\n\n(b)\n\nnotify the members of the Judicial Appointments Committee\nof the details of the vacancy to be filled; and\n\nadvise the Judicial Appointments Committee of the period of\ntime  assigned  to  that  Committee  to  advertise  the  vacancy,\nreview  the  applicants,  interview  applicants  and  make\nrecommendations  for  the  purposes  of  section  81  of  the\nConstitution.\n\nA  notice  of  the  appointment  of  a  member  to  the  Judicial\n\n(4)\nAppointments Committee shall be published in the Official Gazette.\n\nTenure of office\n\n4.\nSubject  to  the  right  to  resign  his  office  and  to  that  of  the\nPrime  Minister  to  revoke  his  appointment  at  any  time,  a  person\nappointed under paragraph 3 shall hold office for the period of time\nspecified in the instrument of appointment.\n\nChairman\n\n5.\nIn the case of the absence of the chairman, or his inability to\nact as such, the senior judge shall exercise the functions of the chairman.\n\n\f11\n\nSecretary\n\n6.\nsecretary for that Committee from among its members.\n\nThe  Judicial  Appointments  Committee  shall  elect  a\n\nPowers of the Judicial Appointments Committee\n\nFor the purposes of making recommendations as required by\n7.(1)\nsection 93A, the Judicial Appointments Committee shall advertise the\nvacancy to be filled in the Supreme Court of Judicature\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nin the Official Gazette;\n\nin at least one newspaper in circulation in Barbados on two\noccasions, at an interval which is at least 1 week apart;\n\nby an instrument in writing to the Barbados Bar Association;\nand\n\nby such other electronic means as the Committee determines,\nwhich  will  ensure  wide  circulation  to  suitable  applicants\nacross the Commonwealth.\n\nThe Judicial Appointments Committee shall interview suitable\n(2)\napplicants and make such recommendations for the purposes of section\n93A, as the Judicial Appointments Committee considers suitable.\n\nThe  Judicial  Appointments  Committee  shall  notify  each\n\n(3)\napplicant of the result of the interview by an instrument in writing.\n\nProcedure, meetings and decisions\n\n8.(1)\nthe chairman\n\nDuring the tenure of the Judicial Appointments Committee,\n\n(a)\n\nmay  at  any  time  call  a  special  meeting  of  the  Judicial\nAppointments Committee; or\n\n\f12\n\n(b)\n\nshall call a meeting of the Judicial Appointments Committee\nif required so to do by the Prime Minister.\n\nThe chairman and 3 other members of the Judicial Appointments\n\n(2)\nCommittee shall form a quorum.\n\nA  decision  of  the  Judicial  Appointments  Committee  shall  be\n\n(3)\ndecided by a majority vote.\n\nIn the case where the voting is equal, the chairman shall have a\n\n(4)\nsecond or casting vote.\n\nSubject to this Schedule, the Judicial Appointments Committee\n\n(5)\nmay regulate its own procedure.\n\nThe Prime Minister shall determine the remuneration and\n9.\nallowances  to  be  paid  to  the  members  of  Judicial  Appointments\nCommittee.”.\n\n\f13\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n\fSUPREME COURT OF JUDICATURE (AMENDMENT) BILL, 2019\n\nEXPLANATORY MEMORANDUM\n\nThe Supreme Court of Judicature (Amendment) Bill, 2019 amends the Supreme\nCourt of Judicature Act to increase the number of Judges in the High Court, and\nto make provision for the establishment of a Judicial Appointments Committee.\nThis will add to the previous procedure for selecting judges, in that vacancies\nwill  now  be  advertised,  so  that  all  interested  parties  can  apply  and  have  the\nopportunity  to  be  selected  for  an  interview  and  the  possibility  of  being\nrecommended for the vacancy. This amendment will also provide for the creation\nof a Commercial Division.\n\nClause 1:\n\nprovides the short title for the citation of the amending Act.\n\nClause 2:\n\namends section 4 to increase number of Judges of the High\nCourt from eight to thirteen, to better enable the High Court\nto perform its functions in the administration of justice.\n\nClause 3:\n\namends section 15 to provide for a Commercial Division.\n\nClause 4:\n\nClause 5:\n\namends section 16 to provide for the causes and matters which\nwill be the purview of the Commercial Division.\n\ninserts section 93A into the Act. This section establishes the\nJudicial  Appointments  Committee.  This  Committee  will  be\ncalled into action by the Prime Minster where it is determined\nthat there is vacancy in the Supreme Court of Judicature which\nmust be filled. The Committee will be given a period of tenure\nduring  which  it  will  advertise  the  vacancy,  interview\napplicants and make recommendations of applicants who may\nbe considered for the vacancy.\n\nClause 6:\n\namends the First Schedule in the Act to provide details of the\nmatters assigned to the Commercial Division.\n\ni\n\n\fSupreme Court of Judicature\n(Amendment) Bill, 2019\n\nClause 7:\n\ninserts a Fourth Schedule into the Act that provides details for\nthe  appointments  and  composition\nJudicial\nAppointments  Committee,  and  makes  provision  for  the\noperation of the Committee.\n\nthe\n\nto\n\nii\n\n"
}