{
  "bill_id": 364,
  "slug": "representation-of-the-people-amendment-bill-2020",
  "title": "Representation of the People  (Amendment) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/00f6010ab2c42c465277803ca9f6d193.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-07-29",
  "first_reading": "2020-08-05",
  "gazette_date": "2019-02-05",
  "markdown": "24th January,2019\nOBJECTS AND REASONS\nThis Bill would amend the Representation of the People Act, Cap 12 in order to make\n(a) better provision for the use of technology in the electoral process;\n(b) better provision for the distribution of vital information by the Commission through the use of electronic technology; and\n(c) provision for related matters.\nArrangement of Sections\nShort title\nAmendment of section 2 of Cap. 12\nInsertion of section 3 into Cap. 12\nAmendment of section 9 of Cap. 12\nAmendment of section 13 of Cap. 12\nAmendment of section 14 of Cap. 12\nAmendment of section 17 of Cap. 12\nAmendment of section 71 of Cap. 12\nBARBADOS\nA Bill entitled\nAn Act to amend the Representation of the People Act.\nENACTED by the Parliament of Barbados as follows:\nShort title\n1. This Act may be cited as the Representation of the People (Amendment) Act, 2019.\nAmendment of section 2 of Cap. 12\n2. Section 2 of the Representation of the People Act, Cap. 12, in this Act referred to as the principal Act, is amended by inserting the following definition in the appropriate alphabetical order\nse ce electronic technology” means an electronic system having electrical, digital, magnetic, wireless, optical, electromagnetic or similar capabilities which is used for the creating, generating, sending, receiving, storing, displaying, or otherwise processing of data and information;”.\nInsertion of section 3 into Cap. 12\n3. The principal Act is amended by inserting the following new section as section 3:\n“General duties of the Commission\n3.(1) The Electoral and Boundaries Commission shall\n(a) be responsible for the general implementation and application of this Act, and shall ensure that this Act and the Electoral Offences and Controversies Act, Cap. 3 are properly administered to ensure free and fair elections in Barbados; and\n(b) establish and implement such procedures, processes and practices for the efficient implementation of this Act, and where required the Commission may use electronic technology for the discharge of its functions under this Act or under any other enactment giving powers to the Electoral and Boundaries Commission,\n5\n(2) Where the Commission transmits any list, register or any other document by means of electronic technology for use by the public or for use by a person that list, register or any other document shall be transmitted in a format which the public can read and search electronically but not in a format which readily allows a person to type in or edit the list, register or any other document.”.\nAmendment of section 9 of Cap. 12\n4. The principal Act is amended by deleting section 9 and substituting the following:\n“Right to remain registered\n9.(1) A person registered pursuant to this Part shall remain registered unless and until his name is deleted from the register because\n(a) he has died;\n(b) an objection to his registration has been allowed;\n(c) not being a foreign service elector, he has been absent from Barbados for a period exceeding 5 years; or\n(ad) hehas become disqualified for registration as an elector under this Act or any other enactment imposing disqualifications for registration as an elector.\n(2) For the purposes of deleting from the register the names of persons referred to in paragraph (a) or (c) of subsection (1), the Commission shall first publish once in the Official Gazette and twice at intervals of not less than 7 days apart by way of electronic technology, a notice of its intention to consider the deletion of those names.\n6\n(3) The notice to which subsection (2) refers shall\n(a) request information as to why any name listed in the notice shall not be deleted; and\n(b) request that the information to which paragraph (a) refers be submitted to the Commission by the date specified in the notice.\n(4) The date specified in the notice to which subsection (3) refers shall not be less than 4 weeks from the date of publication of the first notice.\n(5) When the date for submission of the information requested pursuant to subsection (3) has expired, the Commission may, in the absence of evidence justifying the retention of any name listed in the notice, delete that name from the register.\n(6) Where the Commission deletes from the register the name of a person pursuant to subsection (5), it shall forthwith publish the names that have been deleted in the Official Gazette and transmit online by way ofelectronic technology the names that have been deleted and once thereafter within a week of the first publication or transmission repeat the publication or the transmission of those names. ”.\nAmendment of section 13 of Cap. 12\n5. Section 13 of the principal Act is amended by inserting immediately after subsection (4) the following new subsection :\n“(5) A person to whom subsection (2)(5) applies shall notify the Commission of his change of address by the 31 * day of December in the preceding year for that person to be included in the register of electors prepared under subsection (1) or under section 14.”.\nAmendment of section 14 of Cap. 12\n6. The principal Act is amended by deleting section 14 and substituting the following:\n“Register of electors and revised register of electors\n14. The Commission shall cause to be prepared, published and made available by way of electronic technology for each constituency\n(a) aregister of electors in accordance with section 13;\n(b) arevised register of electors in accordance with section 18; and\n(c) a register for elections for foreign service electors and a revised register of foreign service electors entitled to vote at any election.”.\nAmendment of section 17 of Cap. 12\n7. Section 17 of the principal Act is amended by deleting subsection (2) and substituting the following:\n“(2) The revised register shall be a list of electors and of foreign service electors for each constituency which shall consist of all persons\n(a) whose names appear on the register for another constituency who have notified the Chief Registering Officer of a change of address in accordance with the section 13(5) and who appear to be ordinarily resident in the constituency;\n(b) whose names appear in the register for the constituency who have effected a change of address within the constituency and\n8\nhave notified the Chief Registering Officer in accordance with the regulations;\n(c) who have reached the age of 18 years and who\n(i) qualify as an elector;\n(ii) have never been registered as an elector; and\n(iii) appear to the Chief Registering Officer to be otherwise qualified; and\n(d) who have otherwise become qualified persons. ”.\nAmendment of section 71 of Cap. 12\n8. Section 71 of the principal Act is deleted and the following is substituted:\n“Mutilating, altering notices, lists or registers\n71.1) Any person who wilfully mutilates, tears down, destroys or obscures any list or notice published in accordance with this Act or who makes any alteration in any copy ofa list or notice so published is guilty of an offence and is liable on summary conviction to a fine of $250, or to imprisonment for 6 months or to both.\n(2) Any person\n(a) who being a member of the public alters, changes, or modifies any list, register or document which is published or transmitted by means of electronic technology for use by the public is guilty of an offence and is liable on summary conviction to a fine of $250, or to imprisonment for 6 months or to both; or\n9\n(b) obtains a copy of a list, register, document or part thereof, and who alters, changes, or modifies any list, register or document which is published or transmitted by means of electronic technology for the use of that person is guilty of an offence and is liable on summary conviction to a fine of $250, or to imprisonment for 6 months or to both.”.\n"
}