{
  "bill_id": 367,
  "slug": "value-added-tax-amendment-no-bill-2019",
  "title": "Value Added Tax (Amendment) (No.  ) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/082fe9e6e59597dba152214dd049c37a.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-06-05",
  "first_reading": "2019-06-21",
  "gazette_date": "2019-07-01",
  "markdown": "2019-01-04\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Value Added Tax Act, Cap. 87 to provide, among\nother things, for a write-off of certain outstanding tax and of penalties and interest\nincurred in respect of arrears of tax.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\nShort title\n\nInsertion of sections 60D and 60E into Cap. 87\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Value Added Tax Act, Cap. 87 to provide, among other\nthings, for a write-off of certain outstanding tax and of penalties and interest\nincurred in respect of arrears of tax.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n2019.\n\nThis  Act  may  be  cited  as  the  Value  Added  Tax  (Amendment)  Act,\n\nInsertion of sections 60D and 60E into Cap. 87\n\n2.\nsection 60C, the following sections:\n\nThe Value Added Tax Act, Cap. 87 is amended by inserting after\n\n“Write-off of taxes, penalties and interest for the years 1996\nto 2000\n\nWhere an amount payable to the Revenue Commissioner as\n60D.\ntax or as a penalty or interest in respect of arrears of tax for the years\n1996 to 2000 is outstanding, the amount is written off.\n\nWaiver of penalties and interest for the years 2001 to 2017\n\n60E.(1)\nSubject to subsection (2), where an amount payable to the\nRevenue Commissioner as a penalty or interest in respect of arrears of\ntax for the years 2001 to 2017 is outstanding, the amount is waived.\n\nThe waiver referred to in subsection (1) applies only where, in\n(2)\nthe period from 1st July, 2018 to 31st December, 2018, the person by\nwhom the penalty or interest is payable\n\n(a)\n\n(b)\n\nsettles the arrears; or\n\nenters  into  an  agreement  with  the  Barbados  Revenue\nAuthority to settle the arrears and remains compliant with the\nconditions of the agreement.”.\n\n"
}