{
  "bill_id": 368,
  "slug": "shipping-incentives-amendment-bill-2019",
  "title": "Shipping (Incentives) (Amendment)  Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3cffd481209d8fc115b97eec24592c7c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-10-09",
  "first_reading": "2019-10-09",
  "gazette_date": "2019-03-11",
  "markdown": "2019-01-04\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Shipping (Incentives) Act, Cap. 90A to reduce the\n\n(a)\n\n(b)\n\nnumber  of  years  for  carrying  forward  losses  for  the  purpose  of  the\nassessment of income tax from 9 years to 7 years; and\n\nrate  applicable  to  the  deductions  that  can  be  claimed  in  respect  of\nincome tax from 150 per cent to 100 per cent.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\nShort title\n\nAmendment of section 5 of Cap. 90A\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Shipping (Incentives) Act, Cap. 90A.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2019.\n\nThis Act may be cited as the Shipping (Incentives)(Amendment) Act,\n\n\f4\n\nAmendment of section 5 of Cap. 90A\n\n2.\ndeleting\n\nSection 5 of the Shipping (Incentives) Act, Cap. 90A is amended by\n\n(a)\n\nsubsection (3) and substituting the following:\n\n“(3)\nAn  approved  shipping  company  that  is  granted  income  tax\nconcessions under this Act may, for the purpose of the assessment of\nincome tax, carry forward, in respect of the first 7 years of assessment\nafter the expiration of the concession period, losses that were incurred\nduring the concession period and were not written off.”; and\n\n(b)\n\nsubsection (4) and substituting the following:\n\nWhere  an  approved  shipping  company  has  in  an  income  year\n“(4)\nincurred  expenditure  for  any  of  the  purposes  specified  in  the  First\nSchedule, then, in calculating the assessable income of the approved\nshipping  company  for  that  income  year,  there  shall  be  deducted  an\namount equal to 100 per cent of the expenditure incurred.”.\n\n\f5\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}