{
  "bill_id": 375,
  "slug": "value-added-tax-amendment-no-bill-2019",
  "title": "Value Added Tax (Amendment) (No.    ) Bill 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/cd1364275cbe0137d722d804710a4f8c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-03-05",
  "first_reading": "2019-03-06",
  "gazette_date": "2019-03-06",
  "markdown": "Fourth Draft 2019-02-18\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Value Added Tax Act, Cap. 87 to make provision\n\nfor\n\n(a)\n\n(b)\n\n(c)\n\nthe  collection  of  value  added  tax  on  goods  and  services  purchased\nonline from a vendor outside Barbados where the goods and services\nare for consumption in Barbados;\n\nthe  collection  and  transmission  of  value  added  tax  on  goods  and\nservices purchased online from local vendors by persons in Barbados\nwhere the goods and services are for consumption in Barbados and the\ntransaction is processed outside Barbados;\n\nthe  collection  and  transmission  of  value  added  tax  on  goods  and\nservices  purchased  online  from  local  vendors  by  persons  outside\nBarbados  where  the  goods  and  services  are  for  consumption  in\nBarbados; and\n\n(d)\n\nfor related purposes.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\nShort title\n\nAmendment of section 2 of Cap. 87\n\nInsertion of Part IIIA into Cap. 87\n\nInsertion of Part IVA into Cap. 87\n\nAmendment of section 103 of Cap. 87\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Value Added Tax Act, Cap. 87 to make provision in\ncertain  cases  for  the  electronic  collection  of  value  added  tax  on  goods  and\nservices purchased online where the goods and services are for consumption\nin Barbados and to provide for related purposes.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nAct, 2019.\n\nThis Act may be cited as the Value Added Tax (Amendment) (No. )\n\nAmendment of section 2 of Cap. 87\n\nSection 2 of the Value Added Tax Act, Cap. 87 in this Act referred\n2.\nto as the principal Act, is amended by inserting the following definitions in the\nappropriate alphabetical order:\n\n“  “consumption  in  Barbados”  in  relation  to  goods  and  services\npurchased  online  means  the  consumption  or  utilisation  of  the\ngoods or the service in Barbados and includes the performance of\nthe service in Barbados;\n\n“online” in relation to the purchase of goods and services means the\npurchase of goods or services by electronic means on the Internet\nusing payment facilities provided by a financial institution or a\npayment processor or using any similar means of payment;\n\n“payment processor” means any business or platform which facilitates\npayment for e-commerce transactions on the Internet and includes\na third party processor and a special payment provider;\n\n“tax collecting agent” means a person with whom the Government of\nBarbados enters an agreement for the collection of tax on goods\nor services purchased online;”.\n\nInsertion of Part IIIA into Cap. 87\n\n3.\nimmediately after Part III:\n\nThe principal Act is amended by inserting the following new Part\n\n\f5\n\n“PART IIIA\n\nRULES RESPECTING TAX ON SUPPLIES SOLD ONLINE BY\nREGISTRANTS\n\nPayment of tax in respect of certain online purchases by\npersons in Barbados\n\nWhere goods or services are sold online by a registrant to a\n28A.\nperson in Barbados and the supplies are for consumption in Barbados,\nthe  tax  on  those  supplies  is  payable  at  the  time  of  purchase  if  the\npayment for the transaction is processed by a payment processor outside\nBarbados.\n\nPayment of tax in respect of online purchases by persons\noutside Barbados\n\nWhere goods or services are sold online by a registrant to a\n28B.\nperson  outside  Barbados  and  the  supplies  are  for  consumption  in\nBarbados, the tax on those supplies is payable at the time of purchase.\n\nRule respecting the quotation of prices for goods and services\non the Internet\n\nNotwithstanding section 7(4), where a registrant to whom\n28C.\nthis Part applies, quotes a price for goods and services on the Internet,\nthe price shall state the amount of tax payable separately.\n\nInvoice to be issued in respect of e-commerce transactions\nbetween purchasers and registrants\n\n28D.(1)\nWhere tax is collected on goods or services in accordance\nwith sections 28A and 28B, an electronic invoice shall be issued to the\npurchaser  at  the  time  of  payment  and  the  invoice  shall  indicate  the\namount of the tax paid.\n\n\f6\n\n(2)\nNotwithstanding section 9 (1), where goods or services of a value\nthat is $20 or less are sold by a registrant to a person under this Part,\nthe tax is payable on those goods and services and an electronic invoice\nshall be issued under subsection (1) indicating the amount of the tax so\npaid.\n\nCertain provisions in Part IVA to apply to this Part\n\n28E.\nThe  provisions  of  sections  32E  to  32H  in  Part  IVA  shall\napply mutatis mutandis to e-commerce transactions to which this Part\napplies.”.\n\nInsertion of Part IVA into Cap. 87\n\n4.\nimmediately after Part IV:\n\nThe principal Act is amended by inserting the following new Part\n\n“PART IVA\n\nCOLLECTION OF TAX ON IMPORTED GOODS AND SERVICES\nPURCHASED ONLINE\n\nInterpretation\n\n32A.\n\nFor the purposes of this Part,\n\n“foreign vendor” means a person outside Barbados who sells goods or\nservices  online  for  delivery  to  a  person  in  Barbados  or  for\nconsumption or use by a person in Barbados and includes persons\nselling on platforms such as Amazon and Ebay;\n\n“imports”  means  goods  and  services  purchased  online  from  a  place\noutside  Barbados  for  consumption  in  Barbados  and  cognate\nexpressions shall be construed accordingly;\n\n\f7\n\nCollection of tax on online purchases outside Barbados\n\n32B.(1)\nWhere goods or services are purchased online from a vendor\noutside Barbados for consumption in Barbados, the tax on the supply\nof those goods and services is payable at the time of purchase.\n\nWhere tax is collected on goods or services in accordance with\n(2)\nsubsection (1), an electronic invoice shall be issued to the purchaser by\nthe foreign vendor at the time of payment and the invoice shall indicate\nthe amount of the tax paid.\n\nNotwithstanding section 9 (1), where goods or services of a value\n(3)\nthat is $20 or less are sold to a person under this Part, the tax is payable\non those goods and services and an electronic invoice shall be issued\nunder subsection (2) indicating the amount of the tax so paid.\n\nWhere tax is paid online for goods or services in accordance with\n(4)\nsubsection (1), no tax is payable on the delivery of the goods or service\nwhere the invoice issued under subsection (2) is produced as evidence\nof payment.\n\nWhere the tax is not fully paid in accordance with section 31, the\n(5)\nimporter is liable to pay the balance of the tax on the delivery of the\ngoods or service.\n\nSubsection (1) applies with effect from such day as the Minister\n\n(6)\nmay by order appoint.\n\nPayment of tax where exemptions apply\n\n32C.(1)\nNotwithstanding  any  enactment  granting  a  person  an\nexemption from the payment of the tax, the tax is payable on goods and\nservices purchased by such persons in the manner mentioned in section\n32B(1).\n\nA person who pays tax pursuant to subsection (1) shall be entitled\n\n(2)\nto a refund.\n\n\f8\n\n(3)\nThe Revenue Commissioner shall put appropriate measures in\nplace to ensure that a refund is made without delay to any person who\nis entitled to a refund under subsection (2).\n\nRefunds\n\n32D.\nVII where\n\nA person shall be entitled to a refund in accordance with Part\n\n(a)\n\n(b)\n\nthe person pays an amount under this Part as tax that is not\npayable under this Act; or\n\nthe tax collected on any goods or services supplied to that\nperson  under  this  Part  exceeds  the  amount  that  is  payable\nunder this Act.\n\nCollection of tax under this Part\n\nThe  Government  of  Barbados  may  enter  into  such\n32E.(1)\nagreements  or  issue  such  licences  as  the  Minister  thinks  necessary\nauthorising the collection of tax under this Part by any person.\n\n(2)\nWhere the Government of Barbados enters an agreement under\nsubsection  (1),  the  tax  collected  shall  be  transmitted  to  the\nGovernment\n\n(a)\n\n(b)\n\nin such manner and currency and within such time; and\n\non such terms and conditions,\n\nas the Barbados Revenue Authority with the approval of the Minister\nprescribes.\n\nThe Barbados Revenue Authority shall make such arrangements\n(3)\nas  it  thinks  fit,  in  keeping  with  international  standards  and  best\npractices, for the audit of the revenue collectible under this Part.\n\n\f9\n\n(4)\nFor the purposes of collecting the tax under this Part, the officers\nof the Barbados Revenue Authority may exercise any power given to\nan officer in section 76.\n\n(5)\nThe  provisions  of  the  following  Divisions  shall  apply  mutatis\nmutandis to this Part in relation to the collection and recovery of taxes\nas if the person collecting the tax, including a vendor outside Barbados\nor a tax collecting agent was a registrant under this Act:\n\n(a)\n\n(b)\n\n(c)\n\nDivision IV, relating to assessments and determinations;\n\nDivision V relating to objections and appeals;\n\nDivision VI relating to the collection of the tax;\n\n(d)\n\nDivision VII relating to penalties and offences.\n\nCompliance by foreign vendors\n\nWhere  a  foreign  vendor  or  payment  processor  fails  to\n32F.(1)\ntransmit the tax in accordance with section 32D, the Barbados Revenue\nAuthority may, in writing, direct any internet service provider to block,\nwithin a specified time, that foreign vendor or payment processor from\nentering the internet jurisdiction of Barbados or the Barbados internet\nmarket.\n\nWhere  a  foreign  vendor  or  payment  processor  objects  to  any\n(2)\naction taken under subsection (1), the foreign vendor may, within 14\ndays, notify the internet service provider of the objection in writing.\n\nWhere an objection is received by an internet service provider\n(3)\nunder subsection (2), the internet service provider shall, without delay,\nnotify the Barbados Revenue Authority of the objection.\n\nThe Barbados Revenue Authority shall, within 14 days, notify\n(4)\nthe  internet  service  provider  of  the  decision  taken  in  respect  of  the\nobjection and the internet service provider shall without delay, notify\nthe foreign vendor or payment processor of the decision.\n\n\f10\n\n(5)\n\nFor the purposes of this section,\n\n(a)\n\n“block” means the blocking of the IP and URL of the foreign\nvendor or payment processor;\n\n(b)\n\n“IP” means Internet Protocol;\n\n(c)\n\n“URL” means Uniform Resource Locator.\n\nDuty of internet service providers\n\n32G.(1)\nRevenue Authority for the purposes of\n\nInternet service providers shall cooperate with the Barbados\n\n(a)\n\n(b)\n\n(c)\n\nthe collection of taxes under this Part;\n\nthe provision of any information requested by the Barbados\nRevenue  Authority  within  such  time  as  the  Barbados\nRevenue Authority may by notice request; and\n\ntaking such action as is reasonably required for the recovery\nof taxes as the Barbados Revenue Authority may request in\nwriting within the time specified.\n\nConfidentiality\n\n32H.(1)\nThe  provisions  of  section  74  relating  to  confidential\ninformation which is obtained in the administration of this Act, apply\nto internet service providers and to a tax collecting agent as they apply\nto officers of the Barbados Revenue Authority.\n\nA  tax  collecting  agent  shall  institute  reasonable  measures  in\n(2)\nkeeping  with  international  standards  and  best  practices  for  the\nprotection of the data collected under this Part. ”.\n\n\f11\n\nAmendment of section 103 of Cap. 87\n\n5.\n\nSection 103 of the principal Act is amended by\n\n(a)\n\n(b)\n\n(c)\n\nrenumbering paragraph (f) as paragraph (h);\n\ndeleting the word “and” at the end of paragraph (e); and\n\ninserting the following paragraphs after paragraph (e):\n\n“(f)\n\nprescribing  forms  relating  to  applications,  licences,  the\ncollection, reporting and transmission of tax and generally in\nrelation to the administration of Part IIIA and Part IVA;\n\n(g)\n\nproviding  for  the  collection  and  management  of  tax  under\nPart IIIA and Part IVA; and”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}