{
  "bill_id": 377,
  "slug": "income-tax-amendment-bill-2019",
  "title": "Income Tax (Amendment) Bill,  2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/4a13a75239eccc1a49a6473a5ead960b.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2019-03-08",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "2018-12-18\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Income Tax Act, Cap. 73.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 2 of Cap. 73\n\nAmendment to section 9 of Cap. 73\n\nAmendment to Cap. 73\n\nAmendment to section 23 of Cap. 73.\n\nAmendment to section 43 of Cap. 73\n\nAmendment to section 43A of Cap. 73\n\nAmendment to section 44 of Cap. 73\n\nAmendment of Cap. 73\n\n10.\n\nAmendment of section 46E of Cap. 73\n\n11.\n\nAmendment of Cap. 73\n\n12.\n\nAmendment to section 65 of Cap. 73\n\n13.\n\nAmendment of Cap. 73\n\n14.\n\nAmendment to section 83A of Cap. 73\n\n15.\n\nAmendment to section 85 of Cap. 73\n\n\f3\n\n16.\n\nAmendment of Cap. 73\n\n17.\n\nCommencement\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Income Tax Act, Cap. 73.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Income Tax (Amendment) Act, 2019.\n\n\f6\n\nAmendment of section 2 of Cap. 73\n\nSection 2 of the Income Tax Act, Cap. 73, in this Act referred to as\n2.\nthe principal Act, is amended by inserting in the appropriate alphabetical order\nthe following definitions:\n\n“  “foreign currency earning permit” means a permit that is issued to an\nentity by the Director of International Business under the Foreign\nCurrency Permits Act, 2018 (Act 2018-44);\n\n“specified foreign currency earning entity” means\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\na company incorporated under the Companies Act, Cap. 308;\n\na  society  with  restricted  liability  organized  under  the\nSocieties with Restricted Liability Act, Cap. 318B;\n\na trust formed under the Trusts (Miscellaneous Provisions)\nAct, 2018 (Act 2018-49);\n\na foreign currency earning bank licensed under the Financial\nInstitutions Act, Cap. 324A; or\n\nan  insurance  company  licensed  under  the  Insurance  Act,\nCap. 310,\n\nin  respect  of  which  a  foreign  currency  earning  permit  is\ngranted.”.\n\nAmendment to section 9 of Cap. 73\n\n3.\n\nSection 9 of the principal Act is amended\n\n(a)\n\nin  subsection  (1)  by  adding  the  following  paragraph  immediately\nafter paragraph (m) as paragraph (m.1):\n\n\f7\n\n“(m.1)\n\na prescribed percentage of the salary, fees and any other\nemoluments that are earned by an employee or a contractor\nof a specified foreign currency earning entity;”;and\n\n(b)\n\ninserting immediately after subsection (3), the following subsections\nas subsection (4), subsection (5) and subsection (6):\n\n“(4)\nNotwithstanding  the  Exchange  Control  Act,  Cap.  71,  the\nprescribed percentage of the salary, fees or other emoluments referred\nto in subsection (1)(m.1) may be\n\n(a)\n\npaid in foreign currency into a trust account without being\nliable to income tax in Barbados as to the amount paid or any\ninterest earned thereon; and\n\n(b)\n\npaid  in  some  other  prescribed  manner  in  foreign  currency\nwithout being liable to income tax in Barbados.\n\n(5)\n\nWhere the Minister responsible for Finance is satisfied that\n\n(a)\n\na  company  or  a  society  requires  the  services  of  specially\nqualified persons in order to carry out its business effectively\nfrom within Barbados; and\n\n(b)\n\nthe company or society is unable to acquire those services in\nBarbados,\n\nthe Minister may grant a tax concession in respect of the income tax\npayable for those specially qualified persons who are resident outside\nof Barbados.\n\nThe benefits referred to in subsections (4) and (5) shall be for a\n(6)\nperiod of 3 years and this period may be extended as the Minister of\nFinance deems fit.”.\n\n\f8\n\nAmendment to Cap. 73\n\n4.\nThe principal Act is amended by deleting sections 12, 12A, 12B, 12B.\n1, 12C, 12C.1, 12E, 12E.1, 12E.2, 12E.3, 12E.4, 12E.5, 12E.6, 12E.7, 12E.8,\n12F, 12G, 12H, 13A, 13B, 13B.1, 13C, 14A, 14A.1 and 14B.\n\nAmendment to section 23 of Cap. 73.\n\n5.\n(a)(ii) and substituting the following:\n\nSection 23 of the principal Act is amended by deleting subsection (2)\n\n“(ii)\n\n50 per cent of the assessable income of that person for\nthat  next  succeeding  income  year  with  effect  from\nincome year 2019.”.\n\nAmendment to section 43 of Cap. 73\n\n6.\nnew subsections immediately after subsection (5):\n\nSection 43 of the principal Act is amended by inserting the following\n\nWith effect from income year 2019, the tax payable by a company\n\n“(6)\nupon its taxable income is as follows:\n\n(a)\n\n(b)\n\n(c)\n\n5.5 per cent on all taxable income up to $1 000 000;\n\n3 per cent on all taxable income exceeding $1 000 000 but\nnot exceeding $20 000 000 ;\n\n2.5 per cent on all taxable income exceeding $20 000 000 but\nnot exceeding $30 000 000;\n\n(d)\n\n1 per cent on all taxable income exceeding $30 000 000.\n\n\f9\n\nNotwithstanding  subsection  (6),  the  tax  payable  by  insurance\n\n(7)\ncompanies\n\n(a)\n\nthat  were  classified  as  qualifying  insurance  companies\nlicensed under the Insurance Act, Cap. 310, and carrying on\ngeneral  insurance  business  before  the  17th  day  of  October,\n2017; and\n\n(b)\n\nthat were entitled to apply for the foreign currency allowance,\n\nshall be 2 per cent of taxable income for every income year commencing\nfrom income year 2019 and ending on the 30th day of June, 2021.”.\n\nAmendment to section 43A of Cap. 73\n\n7.\nfollowing new subsection immediately after subsection (3):\n\nSection  43A  of  the  principal  Act  is  amended  by  inserting  the\n\n“(3A)\nNotwithstanding section 43 with effect from income year 2019\nand every subsequent income year the rate of tax on the taxable income\nfor general and life insurance business is as follows\n\n(a)\n\n(b)\n\n(c)\n\na Class 1 licensee under the Insurance Act, Cap. 310 shall be\n0 per cent;\n\na Class 2 licensee under the Insurance Act, Cap. 310 shall be\n2 per cent;\n\na Class 3 licensee under the Insurance Act, Cap. 310 shall be\n2 per cent.”.\n\nAmendment to section 44 of Cap. 73\n\n8.\nnew subsection immediately after subsection (1):\n\nSection 44 of the principal Act is amended by inserting the following\n\n\f10\n\nNotwithstanding  subsection  (1),  the  tax  payable  by  insurance\n\n“(1A)\ncompanies as defined in section 19, that were\n\n(a)\n\nclassified as qualifying insurance companies licensed under\nthe Insurance Act, Cap. 310 and carrying on life insurance\nbusiness before the 17th day of October, 2017; and\n\n(b)\n\nentitled to apply for the foreign currency allowance,\n\nshall be 0.35 per cent of every complete dollar of taxable income for\nevery income year commencing from income year 2019 and ending on\nthe 30th day of June, 2021.”.\n\nAmendment of Cap. 73\n\n9.\n\nThe principal Act is amended by deleting section 46D.\n\nAmendment of section 46E of Cap. 73\n\nSection 46E of the principal Act is amended by deleting the words\n10.\n\"person\"  and  “persons”  appearing  in  the  second  line  and  substituting  the\nwords “individual” and “individuals”.\n\nAmendment of Cap. 73\n\n11.\n\nThe principal Act is amended by deleting section 46F.\n\nAmendment to section 65 of Cap. 73\n\n12.\n\nSection 65 of the principal Act is amended\n\n(a)\n\n(b)\n\n(c)\n\nby deleting subsections (2) and (3);\n\nin subsection (4) by deleting the words “15 per cent” appearing in the\nsecond line thereof and substituting the words “5 per cent”; and\n\nin subsection (5) by deleting the words “10 per cent” and substitute the\nwords “5 percent”.\n\n\f11\n\nAmendment of Cap. 73\n\n13.\n\nThe principal Act is amended by deleting section 65B.\n\nAmendment to section 83A of Cap. 73\n\n14.\n\nSection 83A of the principal Act is amended\n\n(a)\n\n(b)\n\nby deleting subsection (3);\n\nby adding the following new subsection immediately after subsection\n(3):\n\nThe total credit for foreign tax to be allowed to a person in respect\n“(4)\nof any income year under any agreement to which this Part applies shall\nnot reduce the total tax payable by the person on his own behalf for that\nincome year to less than 1 per cent.”.\n\nAmendment to section 85 of Cap. 73\n\n15.\nnew subsection immediately after subsection (7):\n\nSection 85 of the principal Act is amended by inserting the following\n\n“(8)\nFor  the  purposes  of  this  Act,  a  trust  shall  be  deemed  to  be\ndomiciled  in  Barbados  if  it  satisfies  any  three  of  the  following  four\ncriteria\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe settlor is resident in Barbados;\n\nthe beneficiaries are resident in Barbados;\n\nthe proper law of the trust is located in Barbados;\n\nthe  assets  of  the  trust  consist  of  property  situated  in\nBarbados.”.\n\n\f12\n\nAmendment of Cap. 73\n\nThe principal Act is amended by deleting the First Schedule, Parts\n16.\nII,  III,  IV  and  V  of  the  Second  Schedule,  the  Third  Schedule,  the  Fourth\nSchedule and the Fifth Schedule.\n\nCommencement\n\n17.\nof January, 2019.\n\nThis Act shall be deemed to have come into operation on the 1st day\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}