{
  "bill_id": 380,
  "slug": "companies-amendment-bill-2019",
  "title": "Companies (Amendment) Bill,  2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/c8384f9d29b022ce1dd7aa81e07e1112.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-04-10",
  "first_reading": "2019-05-15",
  "gazette_date": "2019-04-09",
  "markdown": "2019-03-22\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Companies Act, Cap. 308.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 308\n\nRepeal and replacement of section 15A of Cap. 308\n\nAmendment of section 66 of Cap. 308\n\nAmendment of section 170 of Cap. 308\n\nAmendment of section 448 of Cap. 308\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Companies Act, Cap. 308\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Companies (Amendment) Act, 2019.\n\n\f4\n\nAmendment of section 2 of Cap. 308\n\nSection 2 of the Companies Act, Cap. 308, in this Act referred to as\n2.\nthe  principal  Act,  is  amended  by  inserting  the  following  definition  in  the\nappropriate alphabetical order:\n\n“    “prominent  public  office”means  any  of  the  following  offices  in\nBarbados and includes a corresponding office in a foreign state:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nthe head of state;\n\nany judicial office;\n\na Permanent Secretary, deputy Permanent Secretary, a Head\nof Department or deputy Head of Department;\n\na  Minister,  a  member  of  the  House  of  Assembly  or  a\nSenator;\n\na chief executive officer, deputy chief executive officer or a\nmember  of  the  Board  of  a  statutory  board,  a  statutory\ncorporation or a state owned enterprise;\n\na senior military officer;\n\na member of the executive of a political party;\n\na  chief  executive  officer,  deputy  chief  executive  officer,\ndirector,  deputy  director  or  a  member  of  the  Board  of  an\ninternational organization;\n\n(i)\n\nany  other  office,  by  whatever  name  called,  similar  to  the\noffices mentioned in paragraphs (a) to (h);”.\n\nRepeal and replacement of section 15A of Cap. 308\n\n3.\nsubstituted:\n\nSection  15A  of  the  principal  Act  is  deleted  and  the  following  is\n\n\f5\n\n“Annual return\n\n15A.(1)\ncompany to which section 343 applies, shall\n\nSubject to this section, every company except an external\n\n(a)\n\n(b)\n\nfile  with  the  Registrar  an  annual  return  in  the  manner  and\nform prescribed; and\n\nat the time of filing under paragraph (a) pay the prescribed\nfee.\n\nA company that is in default in complying with the requirements\n(2)\nof  subsection  (1)  or  (2)  is  liable  to  a  penalty  of  $10  payable  to  the\nRegistrar for every day during which the default continues but shall not\nexceed  $3  000  and  every  director  and  officer  of  the  company  who\nknowingly and wilfully authorises or permits the default is also liable\nto that penalty.\n\nPursuant to section 412, the Registrar may strike off the register\n(3)\na  company  that  neglects  or  refuses  to  file  an  annual  return  required\nunder this section.\n\nThe Registrar may issue guidelines or administrative directions\n(4)\nfor the efficient administration of this section including directions in\nrespect of the submission of the annual return in electronic format.\n\n(5)\n\nA company where incorporated\n\n(a)\n\n(b)\n\nbetween 1st January and 30th June in any year shall file its\nannual return no later than 30th June;\n\nbetween 1st July and 31st December in any year shall file its\nannual return no later than 31st December\n\nin every succeeding year after incorporation.\n\nA director or an authorised officer of a company shall certify in\n(6)\nan annual return filed under subsection (1), that information related to\n\n\f6\n\nshareholders and beneficial ownership is maintained at the registered\noffice of the company.\n\n(7)\n\nSubsection (1) does not apply to\n\n(a)\n\n(b)\n\n(c)\n\nexempt insurance companies;\n\ninternational business companies;\n\ninternational societies with restricted liability;\n\n(d)\n\ninternational financial service entities;\n\n(e)\n\nprivate trust companies;\n\n(f)\n\n(g)\n\n(h)\n\nforeign sales corporations;\n\nan entity that holds a valid foreign currency permit; and\n\nany other entity as the Minister may by order designate.”.\n\nAmendment of section 66 of Cap. 308\n\n4.\nand substituting the following:\n\nSection 66 of the principal Act is amended by deleting subsection (1)\n\n“(1)\nAt the time of sending articles of incorporation of a company to\nthe Registrar, the incorporators must send him, in the prescribed form,\na notice of the names of\n\n(a)\n\n(b)\n\nthe directors of the company; and\n\nthe name of any director who holds or has held a prominent\npublic office whether in Barbados or elsewhere.”.\n\n\f7\n\nAmendment of section 170 of Cap. 308\n\n5.\n\nSection 170 of the principal Act is amended\n\n(a)\n\nin subsection (1) by inserting the words “up to date” in the opening\nwords after the words “registered office”;\n\n(b)\n\nin subsection (2)\n\n(i)\n\nby inserting in paragraph (a), after the word “shareholder”, the\nwords  “and  whether  the  person  holds  or  has  held  a  prominent\npublic office whether in Barbados or elsewhere”; and\n\n(ii)\n\nby deleting paragraph (d) and substituting the following:\n\n“(d)\n\nan up to date and accurate record of the basic and beneficial\nownership information of the company whether incorporated\nor registered in Barbados.\n\nand the register of shareholders shall be maintained for a period\nof not less than 5 year.”; and\n\n(c)\n\nby deleting subsection (5).\n\nAmendment of section 448 of Cap. 308\n\n6.\n(e) and substituting the following:\n\nSection 448 of the principal Act is amended by deleting paragraph\n\n“(e)\n\n“beneficial owner”means the individual who ultimately owns\na  body  corporate  or  who  exercises  the  ultimate  effective\ncontrol over the body corporate;\n\n(e.1)\n\n“beneficial  ownership”  means  the  ultimate  ownership  or\ncontrol  exercised  by  a  beneficial  owner  over  a  body\ncorporate  in  circumstances  where  ownership  or  control  is\n\n\f8\n\nexercised  through  a  chain  of  ownership  or  by  means  of\ncontrol, other than direct control;\n\n(e.2)\n\n“beneficial interest” includes ownership through a trustee, a\nlegal representative, an agent or any other intermediary;”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}