{
  "bill_id": 381,
  "slug": "charities-amendment-bill-2019",
  "title": "Charities (Amendment) Bill,  2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/be64e1e4f3e514aa2eeb1ac76c654c11.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-05-14",
  "first_reading": "2019-05-15",
  "gazette_date": null,
  "markdown": "2019-03-22\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Charities Act, Cap. 243 in order to make better\n\nprovision for the registration of charities.\n\n\f2\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 243\n\nAmendment of section 5 of Cap. 243\n\nAmendment of section 9 of Cap. 243\n\nRepeal and replacement of Second Schedule of Cap. 243\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Charities Act, Cap. 243.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Charities (Amendment) Act, 2019.\n\n\f4\n\nAmendment of section 2 of Cap. 243\n\nSection 2 of the Charities Act, Cap. 243 in this Act referred to as the\n2.\nprincipal  Act,  is  amended  by  inserting  the  following  definition  in  the\nappropriate alphabetical order:\n\n“    “prominent  public  office”means  any  of  the  following  offices  in\nBarbados and includes a corresponding office in a foreign state:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nthe head of state;\n\nany judicial office;\n\na Permanent Secretary, deputy Permanent Secretary, a Head\nof Department or deputy Head of Department;\n\na  Minister,  a  member  of  the  House  of  Assembly  or  a\nSenator;\n\na chief executive officer, deputy chief executive officer or a\nmember  of  the  Board  of  a  statutory  board,  a  statutory\ncorporation or a state owned enterprise;\n\na senior military officer;\n\na member of the executive of a political party;\n\na  chief  executive  officer,  deputy  chief  executive  officer,\ndirector,  deputy  director  or  a  member  of  the  Board  of  an\ninternational organization;\n\n(i)\n\nany  other  office,  by  whatever  name  called,  similar  to  the\noffices mentioned in paragraphs (a) to (h);”.\n\nAmendment of section 5 of Cap. 243\n\n3.\nafter subsection (7) the following:\n\nSection 5 of the principal Act, is amended by inserting immediately\n\n\f5\n\nEvery application for a charity to be registered shall be in the\n\n“(7A)\nForm 1 prescribed in the Second Schedule.”.\n\nAmendment of section 9 of Cap. 243\n\n4.\nand substituting the following:\n\nSection 9 of the principal Act is amended by deleting subsection (3)\n\nEvery  application  respecting  trustees  of  a  charity  to  be\n“(3)\nincorporated as a Board shall be in the Form 2 prescribed in the Second\nSchedule and shall be signed by the majority of the trustees.”.\n\nRepeal and replacement of Second Schedule of Cap. 243\n\n5.\nset out in the Schedule to this Act substituted.\n\nThe Second Schedule to the principal Act is deleted and the Schedule\n\n\f6\n\nSCHEDULE\n\n(Section 4)\n\n L.R.O. 1998\"SECOND SCHEDULE(Section 5, 9)FORMSAPPLICATION FORREGISTRATION OF A CHARITYFORM 1 We the undersigned being the Charity Trustees of the Charity called the  HEREBY APPLY to have the said charity registered under the abovementioned Act. The following are particulars of the charity: 1. Date of establishment: 2. Precise Objects: 3. Address of Administrative Centre:Day/Month/Year\f7\n\n L.R.O. 1998 4. Full names, addresses and occupations or descriptions of the trustees:(a)(b)(c)AddressOccupation or description of trusteeFull name of trusteeAddressOccupation or description of trusteeFull name of trusteeAddressOccupation or description of trusteeFull name of trusteeSecond Schedule (Cont'd)\f8\n\n L.R.O. 1998 5. Full name, address and occupation or description of the Secretary: 6. Full name, address and occupation or description of the Treasurer: 7. Name and address of the bank or banks at which the account of the charity is kept:(a)(b)AddressOccupation or description of SecretaryFull name of SecretaryAddressOccupation or description of TreasurerFull name of TreasurerAddressName of BankAddressName of BankSecond Schedule (Cont'd)\f9\n\n L.R.O. 1998 8. Name, address and qualiﬁ cation or other description of the auditor of the accounts: 9. List of properties owned by the charity:(a)(b)(c)(d)(e)AddressQualiﬁ cation or description of AuditorFull name of AuditorSecond Schedule (Cont'd)\f10\n\n L.R.O. 1998 10. Please give details of any applicant, trustee, ofﬁ cer or beneﬁ ciary who holds or has held(a) a prominent public ofﬁ ce, for example, a Head of State, any Judicial Offi  cer, a Permanent Secretary, a Minister or a Chief Executive Offi  cer or director of a state owned enterprise; or(b) a prominent public ofﬁ ce in an international organisation, for example, director, deputy director, member of the board or an equivalent function.Signature of ApplicantName of ApplicantSignature of ApplicantName of ApplicantSecond Schedule (Cont'd)\f11\n\n L.R.O. 1998APPLICATION FOR INCORPORATION AS A BOARD FORM 21. We, being trustees for hereby apply to be incorporated as a Board under the provisions of the Charities Act, Cap. 243.2. We desire the name of the Board to be3. The registered ofﬁ ce of the Board is to be at.4. This application is made with the authority of .5. The said society is registered as a charity but not itself incorporated.6. The particulars of registration are(State an address with sufﬁ cient particularity for service byhand and service by post of documents thereat)(State name of society for which the trustees act andmode of authorisation by the society. If there is no suchsociety this should be stated)Second Schedule (Cont'd)\f12\n\n L.R.O. 1998 7. Please give details of any applicant, trustee, ofﬁ cer or beneﬁ ciary who holds or has held(a) a prominent public ofﬁ ce, for example, a Head of State, any Judicial Offi  cer, a Permanent Secretary, a Minister or a Chief Executive Offi  cer or director of a state owned enterprise; or(b) a prominent public ofﬁ ce in an international organisation, for example, director, deputy director, member of the board or an equivalent function.Signature of ApplicantName of ApplicantSignature of ApplicantName of ApplicantSecond Schedule (Concl'd)Dated this day of , 20 .\".\f13\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}