{
  "bill_id": 382,
  "slug": "control-of-disposable-plastics-bill-as-amended-2019",
  "title": "Control of Disposable Plastics  Bill (as amended), 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/17ed69c9c85837c22c57a029b0c75a56.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-03-26",
  "first_reading": "2019-03-27",
  "gazette_date": "2019-03-27",
  "markdown": "Rev 2019-03-25\n\nOBJECTS AND REASONS\n\nThis Bill would\n\n(a)\n\nprovide for the prohibition on the importation, manufacture and retail\nof certain types of disposable plastics;\n\n(b)\n\nauthorise the use of certain types of disposable plastics; and\n\n(c)\n\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nDefinitions\n\nApplication\n\nProhibition\n\nProhibition on importation or manufacture of petro-based plastic bags\n\nExemption for certain plastic bags, plastic wraps or disposable polystyrene\ncontainers\n\nLicence for the importation\n\nStandards issued by Barbados National Standards Institute\n\nOffence of misrepresentation\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nCommittee\n\n11.\n\nSchedules\n\n12.\n\nRegulations\n\n13.\n\nCommencement\n\n\f3\n\nFIRST SCHEDULE\n\nLIST OF EXEMPTED PLASTIC BAGS AND DISPOSABLE\nPOLYSTYRENE CONTAINERS\n\nSECOND SCHEDULE\n\nAPPLICATION FOR A LICENCE TO IMPORT ENVIRONMENTALLY\nFRIENDLY PRODUCTS\n\nTHIRD SCHEDULE\n\nLICENCE FEE\n\nFOURTH SCHEDULE\n\nLICENCE\n\nFIFTH SCHEDULE\n\nCONSTITUTION AND PROCEDURE\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to make provision for a prohibition on the importation, manufacture,\nretail  of  certain  disposable  plastics,  authorise  the  use  of  certain  types  of\ndisposable plastics and provide for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n2019.\n\nThis  Act  may  be  cited  as  the  Control  of  Disposable  Plastics  Act,\n\nDefinitions\n\n2.\n\nFor the purposes of this Act,\n\n“exempted plastic bag” means a plastic bag listed in the First Schedule;\n\n“environmentally sustainable” means a material that is made from a biological\n\nbased resource and that is compostable in a facility or garden;\n\n“Minister”  means  the  Minister  responsible  for  Maritime  Affairs  and  the  Blue\n\nEconomy;\n\n“plastic” means a synthetic material that is made of a range of polymers;\n\n“petro-based plastic bag”  means a bag made of a petroleum based resin;\n\n“single use plastic containers” means any of the following disposable containers\n\nmade of plastic or polystyrene:\n\n(a)\n\n(b)\n\n(c)\n\ncups;\n\nfood containers;\n\negg trays;\n\n(d)\n\nplates; or\n\n(e)\n\npolystyrene containers used in the culinary retail industry;\n\n“single use plastic cutlery” means petroleum based plastic cutlery of a disposable\nnature  and  includes  beverage  stirrers  and  straws  composed  of  petroleum\nbased resins.\n\n\f7\n\nApplication\n\n3.\ncontainer referred to in the Returnable Containers Act, Cap. 395A.\n\nThe  provisions  of  this  Act  shall  not  apply  to  any  plastic  beverage\n\nProhibition\n\n4.(1)\n\nWith effect from the 1st day of April, 2019 no person shall import\n\n(a)\n\n(b)\n\nsingle use plastic containers;\n\nsingle use plastic cutlery.\n\nWith effect from the 1st day of July, 2019 no person shall distribute, offer\n\n(2)\nfor sale, sell or use\n\n(a)\n\n(b)\n\nsingle use plastic containers;\n\nsingle use plastic cutlery.\n\nA person who contravenes subsection (1) or (2) is guilty of an offence and\n(3)\nis liable on summary conviction to a fine of $50 000 or to imprisonment for a\nterm of one year or to both and in the case of a continuing offence, to a further\nfine of $1 000 for each day or part thereof, during which the offence continues\nafter which a conviction is first obtained.\n\nProhibition on importation or manufacture of petro-based plastic\nbags\n\n5.\nperson shall import or manufacture any petro-based plastic bag.\n\nSubject to section 6, with effect from the 1st day of January, 2020 no\n\nExemption for certain plastic bags, plastic wraps or disposable\npolystyrene containers\n\n6.\nA person may manufacture, import, distribute, offer for sale, sell or\nuse any petro-based plastic bag, plastic wrap or polystyrene container which is\nrequired for a purpose specified in the First Schedule.\n\n\f8\n\nLicence for the importation\n\nWith effect from the 1st of July, 2019 no person shall import, sell or\n7.(1)\nuse any single use plastic container or any single use plastic cutlery that is labelled\nor marketed as “environmentally sustainable” unless that person has first applied\nfor and obtained a licence under this Act.\n\nAn application for a licence made pursuant to subsection (1) shall be in the\n(2)\nform set out in the Second Schedule and shall be accompanied by the licence fee\nset out in the Third Schedule.\n\nThe Minister may, on receipt of an application made pursuant to subsection\n(3)\n(1) and after consultation with the Barbados National Standards Institute, grant\na  licence  for  the  importation  of  any  single  use  plastic  container  or single  use\nplastic cutlery referred to in subsection (1).\n\nA licence granted pursuant to subsection (3) shall be in the form set out in\n\n(4)\nthe Fourth Schedule and is not transferable.\n\nAny person who contravenes subsection (1) is guilty of an offence and is\n(5)\nliable on summary conviction to a fine of $50 000 or to imprisonment for a term\nof one year or to both and in the case of a continuing offence, to a further fine of\n$1 000 for each day or part thereof, during which the offence continues after\nwhich a conviction is first obtained.\n\nStandards issued by Barbados National Standards Institute\n\n8.\nThe Barbados National Standards Institute shall issue standards that\ngovern  the  importation  of  single  use  plastic  containers  or  single  use  plastic\ncutlery that are “environmentally sustainable”.\n\nOffence of misrepresentation\n\nA  person  who  makes  a  false  or  misleading  claim  or  statement  and\n9.(1)\nrepresents that the single use plastic containers or single use plastic cutlery that\n\n\f9\n\nare imported or offered for sale by him are “environmentally sustainable” is guilty\nof an offence.\n\nA manufacturer, wholesaler or retailer who makes a false or misleading\n(2)\nclaim or statement and represents that the single use plastic containers or single\nuse plastic cutlery imported, offered for sale, manufactured or distributed by him\nare “environmentally sustainable” is guilty of an offence.\n\nA  person  who  contravenes  subsection  (1)  or  (2)  is  liable  on  summary\n(3)\nconviction to a fine of $50 000 or to imprisonment for a term of one year or to\nboth, and in the case of a continuing offence to a further fine of $1 000 for each\nday or part thereof during which the offence continues after which a conviction\nis first obtained.\n\nCommittee\n\n10.(1)\n\nThere is established a Committee to\n\n(a)\n\n(b)\n\naddress,  monitor  and  develop  plastic  pollution  prevention\nprogrammes; and\n\nformulate  and  implement  strategies  and  programmes  to  educate  the\npublic on the pollution created by plastics.\n\nThe Fifth Schedule has effect with respect to the constitution and procedure\n\n(2)\nof the Committee.\n\nSchedules\n\n11.\n\nThe Minister may, by order, amend the Schedules.\n\nRegulations\n\n12.\n\nThe Minister may make regulations\n\n(a)\n\nfor the conservation, management and protection of the environment\nfrom pollution by plastics;\n\n(b)\n\nfor prescribing any required fees and forms; or\n\n\f10\n\n(c)\n\nfor giving effect to the purposes and provisions of this Act.\n\nCommencement\n\n13.\n\nThis Act shall come into force on the 1st day of April, 2019.\n\n\f11\n\nFIRST SCHEDULE\n\nLIST OF EXEMPTED PLASTIC BAGS AND DISPOSABLE\nPOLYSTYRENE CONTAINERS\n\n(Sections 2, 6)\n\nAny item that is\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\na plastic bag designed for, packaged and retailed specifically for the disposal of waste\nfrom households, public places, business places, offices or industrial plants;\n\na  plastic  bag  or  disposable  polystyrene  container  or  item  for  pharmaceutical\ndispensing or any other medical use;\n\na plastic bag or plastic wrap designed for storage of agricultural products;\n\na plastic bag manufactured for export;\n\na plastic bag or plastic wrap used for perishables or the preservation of food;\n\na plastic straw attached to a small tetra pak box;\n\na tray made of polystyrene used for the packaging of fresh meat.\n\n\f12\n\nSECOND SCHEDULE(Section 7(2)) Control of Disposable Plastics Act, 2019(Act 2019-    )APPLICATION FOR IMPORT LICENCE1 Full name of Applicant:2. Business address of Applicant:3. Occupation:4. Product description:5. Composition of product:6. Date of application:N.B.:  It is an offence under this Act to give particulars that are not correct.Signature of Applicant\f13\n\nTHIRD SCHEDULE(Section 7(2)) LICENCE FEEFee for the import licence $25.00 \f14\n\nFOURTH SCHEDULE(Section 7(4))Control of Disposable Plastics Act, 2019(Act 2019-    )LICENCELicence Number:This licence is granted to           of                    for the purpose of importing single use plastic containers or single use plastic cutlery labelled ormarketed as “environmentally sustainable”. This  licence expires on                                day of                                  , 20      . Dated this       day of        , 20      .Minister Responsible for Maritime Affairs and the Blue EconomyName of ApplicantBusiness Address\f15\n\nFIFTH SCHEDULE\n\nCONSTITUTION AND PROCEDURE\n\n(Section 10)\n\n1.(1)\nby the Minister by an instrument in writing.\n\nThe Committee shall consist of no more than 8 members appointed\n\nEach  member  of  the  Committee  shall  have  technical  knowledge  and\n(2)\nexperience in relation to environmental protection issues or be a member of civil\nsociety who demonstrates a special interest in protecting the environment.\n\n2.\nhave tenure of no more than 3 years.\n\nA  member  of  the  Committee  appointed  under  paragraph  1(1)  shall\n\nThe names of all the members of the Committee as first constituted\n3.\nand every change in the membership shall be published in the Official Gazette.\n\n4.\nexcept with the approval of the Cabinet.\n\nNo remuneration shall be payable to the members of the Committee\n\n5.\nthe Minister.\n\nA member of the Committee may resign by a letter in writing sent to\n\n6.\n\nThe Committee shall regulate its own proceedings.\n\n7.\nnecessary or expedient for the transaction of its business.\n\nThe  Committee  shall  meet  at  such  times  and  places  as  may  be\n\n8.\nkept by the Secretary of the Committee.\n\nMinutes in the proper form of each meeting of the Committee shall be\n\n\f16\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n\fCONTROL OF DISPOSABLE PLASTICS BILL, 2019\n\nEXPLANATORY MEMORANDUM\n\nThe  Control  of  Disposable  Plastics  Bill,  2019  would  make  provision  for  a\nprohibition on the importation, manufacture, retail of certain disposable plastics\nand authorise the use of certain types of disposable plastics in Barbados.\n\nClause 1:\n\nprovides for the short title.\n\nClause 2:\n\ndefines the terms used in the legislation.\n\nClause 3:\n\nprovides for the limitation on the application of the Act.\n\nClause 4:\n\ndetails the prohibitions and the effective dates.\n\nClause 5:\n\nClause 6:\n\nClause 7:\n\nClause 8:\n\nprovides for the prohibition on the importation or manufacture\nof petro-based plastic bags.\n\nprovides  for  the  exemption  for  certain  plastic  bags,  plastic\nwraps or disposable plastics listed in the First Schedule.\n\nprovides for the requirement of a licence to import, sell or use\nany single use plastic container or single use plastic cutlery\nlabelled or marketed as environmentally sustainable. It also\nprovides for the procedure for obtaining a licence under the\nAct.  The  licence  fee  payable  which  is  set  out  in  the  Third\nSchedule.\n\nprovides for the Barbados National Standards Institute to be\nthe  agency  issuing  the  standards  for  any  single  use  plastic\ncontainer  or  single  use  plastic  cutlery  to  be  imported  in\nBarbados.\n\ni\n\n\fCONTROL OF DISPOSABLE\nPLASTICS BILL, 2019\n\nClause 9:\n\nClause 10:\n\nprovides for the offence of misrepresentation in relation to any\nmisleading  claim  or  statement  made  about  any  single  use\nplastic container and single use cutlery imported or offered\nfor sale as environmentally sustainable.\n\nthe  establishment  of  a  Committee,\n\nprovides  for\nthe\nconstitution  and  procedure  of  which  is  set  out  in  the  Fifth\nSchedule.\n\nClause 11:\n\nprovides for the Minister to amend the Schedules.\n\nClause 12:\n\nempowers the Minister to make regulations.\n\nClause 13:\n\nprovides for the commencement of the legislation.\n\nii\n\n"
}