{
  "bill_id": 383,
  "slug": "money-laundering-and-financing-of-terrorism-amendment-prevention-and-control-bill-2019",
  "title": "Money Laundering and Financing of  Terrorism (Amendment) (Prevention and Control) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/76d216101b38142805709f2ac3fd5264.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-05-14",
  "first_reading": "2019-05-08",
  "gazette_date": null,
  "markdown": "2019-03-18\nOBJECTS AND REASONS\nThis Bill would amend the Money Laundering and Financing of Terrorism (Prevention and Control) Act, 2011 (Act 2011-23).\nArrangement of Sections\n1. Short title\n2. Amendment of section 2 of Act 2011-23\n3. Amendment of section 5 of Act 2011-23\n4. Amendment of section 23 of Act 2011-23\n5. | Amendment of section 29 of Act 2011-23\n6. Amendment of section 30 of Act 2011-23\n7. Amendment of section 32 of Act 2011-23\n8. Amendment of section 43 of Act 2011-23\n9. Amendment of section 48 of Act 2011-23\n10, Amendment of Third Schedule of Act 2011-23\nBARBADOS\nA Bill entitled\nAn Act to amend the Money Laundering and Financing of Terrorism (Prevention and Control) Act, 2011 (Act 2011-23).\nENACTED by the Parliament of Barbados as follows:\nShort title\n1. This Act may be cited as the Money Laundering and Financing of Terrorism (Prevention and Control) (Amendment) Act, 2019.\nAmendment of section 2 of Act 2011-23\n2. Section 2 of the Money Laundering and Financing of Terrorism (Prevention and Control) Act, 2011 (Act 2011-23), in this Act referred to as the principal Act, is amended\n(a) by inserting in the correct alphabetical order, the following definition:\n“ “criminal conduct” means conduct which constitutes an offence in Barbados or would constitute an offence if it occurred in Barbados;”;\n(b) by deleting the definition of property and inserting the following definition:\n46 46 property” means\n(a) assets of every kind, whether situated in Barbados or elsewhere and whether real or personal, tangible or intangible and includes money; and\n(b) legal documents or instruments in any form, including electronic or digital, evidencing title to or interest in assets referred to in paragraph (a) such as bank credits, travellers’ cheques, bank cheques, money orders, shares, securities, bonds, drafts and letters of credit;”\n5\n(c) in the definition of “financial institution”\n(i) in paragraph (a), by\n(A) deleting sub-paragraph (i) and substituting the following:\n“(i)a trustee within the meaning of the Trusts (Miscellaneous Provisions) Act, 2018 (Act 2018-49);”; and\n(B) deleting sub-paragraphs (ii) and (vii); and\n(ii) by deleting paragraph (c); and\n(d) in the definition of “identification record”, by deleting the words “Registrar of Co-operatives” and substituting the words “Financial Services Commission”; and\n(e) by deleting the definition of “unlawful activity”.\nAmendment of section 5 of Act 2011-23\n3. Section 5(2) of the principal Act is amended by deleting the words “unlawful activity” wherever they appear and substituting the words “criminal conduct”.\nAmendment of section 23 of Act 2011-23\n4. Section 23(1) of the principal Act is amended by inserting after the word “report”, the word “promptly”.\nAmendment of section 29 of Act 2011-23\n5. Section 29(1) of the principal Act is deleted and the following is substituted:\n6\n“(1) Subject to section 48, the Director\n(a) may spontaneously provide financial intelligence or any other information to any public authority for the purposes of this Act; and\n(b) without prejudice to paragraph (a),\n(i) may provide to a public authority, for the purposes of this Act, any report or information received by, or on behalf of, or disclosed to the Director under this Act; and\n(ii) shall, upon receipt of a request for financial intelligence or any other information from the Royal Barbados Police Force, the Barbados Revenue Authority, the Customs and Excise Department or the Immigration Department, forward the financial intelligence or other information to the requesting authority.\n(1A) Where the Director forwards financial intelligence or any other information under subsection (1), the Director may impose conditions on the use of the financial intelligence or other information by the authority; and the authority shall agree in writing to the conditions.”.\nAmendment of section 30 of Act 2011-23\n6. Section 30 of the principal Act is amended\n(a) in the shoulder note, by deleting the word “investigations” and substituting the word “enquiries”;\n(b) in subsection (2)\n(i) by deleting the word “investigations” in paragraph (a) and substituting the word “enquiries”; and\n(ii) by deleting the word “investigation” in paragraph (b) and substituting the word “enquiry”; and\n(c) in subsection (3)\n(i) by deleting the word “believe” and substituting the word “suspect”; and\n(ii) by deleting the word “investigation” wherever it appears in paragraphs (a) and (b) and substituting the word “enquiry”.\nAmendment of section 32 of Act 2011-23\n7. Section 32 of the principal Act is amended by\n(a) deleting the word “believe” and substituting the word “suspect”; and\n(b) deleting the words “criminal activity” and substituting the words “criminal conduct”.\nAmendment of section 43 of Act 2011-23\n8. Section 43 of the principal Act is amended by inserting after the word “investigation” wherever it appears, the words “or enquiry”.\nAmendment of section 48 of Act 2011-23\n9. Section 48 of the principal Act is amended in paragraph (b){i) of subsection (5) by inserting after the word “investigation”, the words “or enquiry in respect”.\nAmendment of Third Schedule of Act 2011-23\n10. The Third Schedule to the principal Act is amended\n(a) in Partl,\n(i) by deleting paragraph (b);\n(ii) by deleting paragraph (c) and substituting the following:\n8\n“(c) a trust within the meaning of the Trusts (Miscellaneous Provisions) Act, 2018 (Act 2018-49), the Trusts (Miscellaneous Provisions) Act, 2018 (Act 2018-49);”;\n(iii) by deleting paragraph (d);\n” (iv) in paragraph (e), by deleting the word “registered” and substituting the word “licensed”;\n(v) in paragraph (g), by deleting the words “including an international society,”; and\n(vi) by deleting paragraph (j); and\n7) in Part I,\n(i) by deleting paragraph (5);\n(ii) by deleting paragraph (c) and substituting the following:\n“(c) a person licensed under the Jnsurance Act, Cap. 310, the Financial Services Commission;”;\n(iti) in paragraph (d), by deleting the words “Securities Commission” and substituting the words “Financial Services Commission”;\n(iv) in paragraph (e), by deleting the words “other than an . international society, ”;\n(v) by deleting paragraph (f) and substituting the following:\n“() a financial institution, including a trustee within the meaning of the Trusts (Miscellaneous Provisions) Act, 2018 (Act 2018-49), that is licensed under the Financial Institutions Act, Cap. 324A, the Minister responsible for the licensee;”;\n9\n(vi) by deleting paragraph (g);\n(vii) in paragraph (i), by deleting the words “Registrar of Co- operative Societies” and substituting the words “Financial Services Commission”; and\n(viii) by deleting paragraph (k) and substituting the following:\na service provider, including a trustee within the meaning of the Trusts (Miscellaneous Provisions) Act, 2018 (Act 2018-49), that is licensed under the Corporate and Trust Service Providers Act, 2015 (Act 2015-12), the Director of International Business;”.\n“(k)\nRead three times and passed the House of Assembly this day of , 2019.\nSpeaker\nRead three times and passed the Senate this day of , 2019.\nPresident\ni\nea\n“Fr = he\n1\nyf tage ne ae - tos 8 ie mee =.\na\n=\na\n9\n=\noral\n"
}