{
  "bill_id": 384,
  "slug": "corporate-and-trust-service-providers-amendment-bill-2019",
  "title": "Corporate and Trust Service  Providers (Amendment) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/91711814c821c6541e8e615877d18ead.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-05-14",
  "first_reading": "2019-05-15",
  "gazette_date": null,
  "markdown": "2019-02-20\nOBJECTS AND REASONS\nThis Bill would amend the Corporate and Trust Service Providers Act, 2015 (Act 2015-12).\nArrangement of Sections\nShort title\nAmendment of section 28 of Act 2015-12\nRepeal of section 35 of Act 2015-12\n4, Commencement\nBARBADOS\nA Bill entitled\nAn Act to amend the Corporate and Trust Service Providers Act, 2015 (Act 2015-12)\nENACTED by the Parliament of Barbados as follows:\nShort title\n1. This Act may be cited as the Corporate and Trust Service Providers (Amendment) Act, 2019.\nAmendment of section 28 of Act 2015-12\n2. Section 28 of the Corporate and Trust Service Providers Act, 2015 (Act 2015-12), in this Act referred to as the principal Act is amended in subsection (1)(a) by deleting sub-paragraph (iii) and substituting the following:\n“(iii) fails to comply with a request of, or a guideline issued by, the Director,”.\nRepeal of section 35 of Act 2015-12\n3. Section 35 of the principal Act is repealed and the following substituted:\n“Director may issue guidelines\n35.(1) The Director may issue guidelines on any matter he considers necessary\n(a) to ensure that licensees comply with their obligations under this Act;\n(b) toensure the accuracy of advertisements published by service providers;\n(c) respecting agreements with their clients;\n(d) respecting the segregation of their accounts from clients accounts; :\n5\n(e) to avoid conflicts of interest with the clients of service providers;\n() respecting the management of complaints;\n(g) respecting procedures to avoid disruption of business and to manage any such disruption when it occurs; and\n(h) generally to provide for the conduct of licensees.\n(2) The guidelines made under this section\n(a) may be amended, varied or revoked by the Director; and\n(6) shall be published in the Gazette.”.\nCommencement\n4.\nThis Act shall come into operation [\nj\n"
}