{
  "bill_id": 386,
  "slug": "resolution-re-government-issue-to-sagicor-life-inc",
  "title": "Resolution re Government  issue  to Sagicor Life Inc.",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/aa5528abcd54ae68c73031c14f47a381.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-03-26",
  "first_reading": "2019-03-29",
  "gazette_date": "2019-03-29",
  "markdown": "RESOLUTION NO.\n\n# 2018-03-19\n\nPARLIAMENT\n\nWHEREAS by section 3 of the British American Insurance  Company (Barbados)\n\nLtd.  (Preservation  of Investments)  Act,  2016  (Act  2016-5),  the  Government  of Barbados  is\n\nauthorised  with  the  approval  of both  Houses  of Parliament,  to  provide  financial  assistance  to\n\nSagicor Life  Inc.  in order to  facilitate  the preservation of the pension plans of 72  employees of\n\nBritish American Insurance Company (Barbados) Ltd.;\n\nAND WHEREAS by section 6(1) of the said Act it is provided that the Government\n\nof Barbados  shall,  by  a  resolution  of both  Houses  of Parliament,  issue  6  promissory  notes\n\nof varying  maturities  from  5  to  30  years,  not  exceeding  in  aggregate  the  sum  of $8.5  million\n\nto Sagicor Life Inc.;\n\nAND WHEREAS the Government considers it necessary to  issue said promissory\n\nnotes  in the amount of $8.5  million in order to  assist  Sagicor Life Inc.  with the preservation of\n\nthe pension plans of 72 employees of the British American Insurance Company (Barbados) Ltd.;\n\nAND  WHEREAS  the  said  sum  of $8.5  million  is  within  the  authorised\n\nlimit given to the Government under section 6(1) ofthe said Act;\n\nBE IT RESOLVED therefore that Parliament approves the issuing of 6 promissory\n\nnotes  to  Sagicor  Life  Inc.  for  an  amount  of $8.5  million  on  the  terms  and  conditions  set\n\nout in the Schedule.\n\n\f2\n\n# APPROVED by the House of Assembly this\n\nday of\n\n,2019.\n\nSpeaker\n\nAPPROVED by the Senate this\n\nday of\n\n,2019.\n\nPresident\n\n\f3\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nPromissory Notes\n\nGovernment of Barbados\n\nSagicor Life Inc.\n\nBDS$8.5 million to be issued in 6 series of varying amounts.\n\nTo assist Sagicor Life Inc. with the preservation of the pension plans of72 employees\nof British American Insurance Company (Barbados) Ltd.\n\nFacility:\n\nIssuer:\n\nRecipient:\n\nAmount:\n\nPurpose:\n\nDeemed Date of Allotment:\n\nFebruary 2018\n\nIssue Price:\n\n100 (par)\n\nTerms:\n\nSeries\n\n1\n\n2\n\n3\n\n# 4\n\n5\n\n6\n\nFace Value\nPer Note\n\nBDS $0.625\nmillion\n\nBDS $3  million  BDS $3  million  BDS $0.625\n\nmillion\n\nBDS $0.625\nmillion\n\nBDS $0.625\nmillion\n\nInterest  payment  Semi-annually\n\nSemi-annually\n\nSemi-annually\n\nSemi-annually\n\nSemi-annually\n\nSemi-annually\n\nInterest rate (p.a)  7.5%\n\n7.5%\n\n7.5%\n\n7.5%\n\n7.5%\n\n7.5%\n\nMaturity Date\n\n5 years from the\ndeemed date of\nallotment\n\n10 years from the  15 years from the  20 years from the  25 years from the  30 years from the\ndeemed date of  deemed date of\ndeemed  date  of  deemed date of  deemed date of\nallotment\nallotment\n\nallotment\n\nallotment\n\nallotment\n\nYield on Maturity  7.5%\n\n7.5%\n\n7.5%\n\n7.5%\n\n7.5%\n\n7.5%\n\nRepayment:\n\nInterest:\n\nPrincipal to be repaid at maturity.\n\nInterest shall be calculated on the basis of the actual number of days elapsed and a\n365 day year.\n\nPromissory Notes:\n\nThe promissory notes will rank pari passu with all other debts of the issuer.\n\nProtective Clause:\n\nIn order to further safeguard the interest of the Policyholders, the principal amounts,\nyields  and  maturities  of  the  Government  of  Barbados  bonds  to  be  issued  in\naccordance  with  Schedule  6  of  the  Sales  and  Purchase  Agreement  as  Final\nGovernment of Barbados Support and approved by the Supreme Court of Barbados\nshall  not  be  changed  and  the  said  bonds  shall  not  be  restructured  by  the\nGovernment of Barbados at any time.\n\n\f4\n\nADDENDUM\n\nThis  Resolution  seeks  the  approval  of Parliament  to  issue  6  promissory  notes  of varying\n\nmaturities from  5 to  30 years, not exceeding in aggregate the sum of$8.5 million to Sagicor Life Inc.\n\nThe issue of the said promissory notes is necessary in order to assist Sagicor Life Inc. with\n\nthe  preservation  of the  pension  plans  of 72  employees  of the  British American  Insurance  Company\n\n(Barbados) Ltd.\n\n"
}