{
  "bill_id": 388,
  "slug": "the-bail-amendment-bill-2019",
  "title": "The Bail (Amendment) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/6156e6e81474bc03c1ce4008ff8dbf70.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-04-02",
  "first_reading": "2019-04-03",
  "gazette_date": null,
  "markdown": "Second Draft 2019-04-01\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Bail Act, Cap. 122A to restrict the grant of bail\n\nwhere a person is charged with certain serious offences.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nAmendment of section 5 of Cap. 122A\n\nInsertion of new section 5A in Cap. 122A\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Bail Act, Cap. 122A.\n\nWHEREAS it is provided inter alia in section 49 of the Constitution that\nParliament may by an Act of Parliament passed by both Houses, alter Chapter\nIII of the Constitution if the Act is supported by the votes of not less than two-\nthirds of all the members of each House:\n\n\f4\n\nAND WHEREAS section 49(6) of the Constitution provides inter alia\nthat no Act of Parliament shall be construed as altering the Constitution unless it\nis stated in the Act that it is an Act for that purpose:\n\nAND  WHEREAS  it  is  necessary  in  the  public  interest  and  for  the\npurposes of maintaining law and order that section 13(3) of the Constitution be\naltered to such extent necessary to give effect to this Act:\n\nENACTED by the Parliament of Barbados in accordance with the provisions\n\nof section 49 of the Constitution as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Bail (Amendment) Act 2019.\n\nAmendment of section 5 of Cap. 122A\n\n2.\nis amended\n\nSection 5 of the Bail Act, in this Act referred to as the principal Act,\n\n(a)\n\nin  subsection  (1)  by  deleting  paragraph  (b)  and  substituting  the\nfollowing:\n\n“(b)\n\nthe  court  is  satisfied  that  the  defendant  should  be  kept  in\ncustody\n\n(i)\n\nfor his own protection;\n\n(ii)\n\nfor the protection of the community; or\n\n(iii)\n\nif he is a child or young person, for his own welfare;”;\n\n(b)\n\nin subsection (2) by\n\n(i)\n\n(ii)\n\ndeleting the word “and” at the end of paragraph (d);\n\ndeleting  the  full-stop  at  the  end  of  paragraph  (e)  and\nsubstituting the words “; and”;\n\n\f5\n\n(iii)\n\ninserting the following paragraph after paragraph (e):\n\n“(f)\n\nthe  need  to  maintain  confidence  in  the  administration  of\njustice  taking  into  consideration  the  matters  mentioned  in\nparagraphs (a), (b) and (c) of this subsection.”; and\n\n(c)\n\ndeleting subsection (4).\n\nInsertion of new section 5A in Cap. 122A\n\n3.\nafter section 5:\n\nThe principal Act is amended by inserting the following new section\n\n“Bail in the case of persons charged with serious offences\n\n5A.(1)\n\nSubject to subsection (2), a person charged with\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nmurder;\n\ntreason;\n\nhigh treason; or\n\nan  offence  under  the  Firearms  Act,  Cap.  179,  which  is\npunishable with imprisonment for 10 years or more\n\nshall not be granted bail unless a period of 24 months has expired\nafter that person was charged.\n\nNotwithstanding subsection (1), bail may be granted by the High\n\n(2)\nCourt where\n\n(a)\n\n(b)\n\nany  person  is  charged  with  murder  in  circumstances\nconnected with the discharge of that person’s official duties;\n\nthe  court  is  of  the  view  that  the  strength  of  the  evidence\nsuggests that the accused did not commit the offence with\nwhich he is charged; or\n\n\f6\n\n(c)\n\nthe  court  is  satisfied  on  the  evidence  presented  that  the\naccused would be able to rely on the defence of self defence.\n\n(3)\nAn  application  for  bail  by  a  person  who  is  charged  with  an\noffence mentioned in subsection (1) shall be heard by the Chief Justice\nor a Judge of the High Court assigned by the Chief Justice.\n\nNo  application  for  bail  by  a  person  who  is  charged  with  an\n(4)\noffence mentioned in subsection (1) shall be heard by the High Court\nunless\n\n(a)\n\n(b)\n\na period of 72 hours has expired after the application for bail\nis made to the Court; and\n\nthe Court is satisfied that notice of the application was served\non the prosecution.\n\n(5)\n\nWhere\n\n(a)\n\n(b)\n\nbail  is  granted  by  the  High  Court  to  a  person  in  the\ncircumstances mentioned in subsection (2); or\n\nbail is granted by the High Court to a defendant after bail is\nwithheld for the period mentioned in subsection (1),\n\nthe Chief Justice or Judge, as the case may be, shall at the time of\nmaking the decision,\n\n(i)\n\ngive reasons in writing for his decision; and\n\n(ii)\n\ngive  a  copy  of  the  reasons  for  the  decision  to  the\ndefendant and the prosecution.\n\nWhere bail is granted by the High Court to a defendant in the\n(6)\ncircumstances mentioned in subsection (5)(a) or (b), there shall be a\nright of appeal by the prosecution to the Court of Appeal against the\ndecision of the Court.\n\n\f7\n\n(7)\nAn appeal to the Court of Appeal under subsection (6) shall be\nheard by the Chief Justice or by a Justice of Appeal assigned by the\nChief Justice as is appropriate in the particular circumstances.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n\fEXPLANATORY MEMORANDUM\n\n_______________________________________________________________________\n\nBail (Amendment) Bill, 2019\n________________________________________________________________________\n\nThe Preamble\nThe  Preamble  would  provide  the  necessary  background  and  context  which  makes  it\n\nnecessary for section 13 (3) of the Constitution to be amended.\n\nClause 2\n\nParagraph  (a)  is  not  a  substantive  provision.  It  will  correct  a  numbering  error\nsince the provisions are sub-paragraphs but are wrongly numbered as paragraphs.\nThe correction will allow for the provisions to be correctly cited.\n\nParagraph  (b)  provides  a  new  ground  which  the  Court  must  consider  in\nexercising its discretion to grant or withhold bail.\n\nClause 3\nClause  3  provides  for  the  insertion  of  a  new  section  which  restricts  the  grant  of  bail  to\npersons charged with serious offences.\n\nSubclause (1)\nThis provision prohibits the grant of bail to persons who are charged with any\nof the offences specified in subsection (1) of the new section 5A until after the\nexpiration of 24 months following the bringing of charges.\n\nSubclause (2)\nThis provision provides an exception in the case where a person is charged with\n\nthe offence of murder if the offence is committed when the person was carrying\n\nout his official duties. The provision is widely drafted to prevent an injustice to\n\n\fany person, including a security guard or a watchman who kills a person when\n\ncarrying out his lawful duties.\n\nSubclause (3)\nThis provision provides for bail applications for serious offences to be heard by\n\nthe Chief Justice or by a Judge assigned by Chief Justice.\n\nSubclause (4)\nThis  provision  modifies  the  practice  and  procedure  relating  to  bail  so  as  to\n\nfacilitate appeals by the prosecution.\n\nSubclause (5)\nThis  provision  requires  the  court  to  give  reasons  for  bail  decisions  so  as  to\nfacilitate appeals by the prosecution.\n\nSubclause (6)\nThis provision gives the Prosecution (and not the accused) a new right of appeal\nto the Court of Appeal.\n\n# 2\n\n"
}