{
  "bill_id": 393,
  "slug": "tourism-levy-2019-dated-january-15-2019",
  "title": "Tourism Levy 2019 dated January 15, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3ed76c849d028857e8d36506b683cc91.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2019-04-23",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "2019-07-09\n\nOBJECTS AND REASONS\n\nThis Bill would provide for\n\n(a)\n\n(b)\n\n(c)\n\na  room  rate  levy  to  be  charged  on  the  provision  of  tourist\naccommodation or a villa;\n\na product development levy to be charged on the services specified in\nparagraph 1 of the Fourth Schedule to the Value Added Tax Act, Cap.\n87;\n\na  shared  economy  levy  to  be  charged  on  the  provision  of  tourist\naccommodation  or  a  villa  owned  or  operated  by  persons  who  earn\nincome from the tourism sector in Barbados, but who are either not\nregistered or given exempt status under the Value Added Tax Act, Cap.\n87;\n\n(d)\n\nthe validation of the imposition and collection of the room rate levy,\nproduct  development  levy  and  shared  economy  levy  from  the\nimposition of each levy until the commencement of this Act; and\n\n(e)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nApplication and Administration\n\nRegistration and listing of tourist accommodation\n\nImposition of room rate levy\n\nNotification of room rate levy\n\nImposition of product development levy\n\nNotification of product development levy\n\nImposition of shared economy levy\n\n10.\n\nNotification of shared economy levy\n\n11.\n\nPayment of levies\n\n12.\n\nConsolidated fund\n\n13.\n\nRefund for overpayment\n\n14.\n\nWaivers and refunds\n\n15.\n\nKeeping of accounts and records\n\n\f3\n\n16.\n\nAudit\n\n17.\n\nCopies of documents\n\n18.\n\nNotice of assessment of levy\n\n19.\n\nNotice of assessment result\n\n20.\n\nObjections\n\n21.\n\nAppeal to Tribunal\n\n22.\n\nAppeal to the High Court\n\n23.\n\nRecovery of the levy\n\n24.\n\nObstruction of officers\n\n25.\n\nAmendment of enactments in the Fifth Schedule and Sixth Schedule\n\n26.\n\nValidation\n\n27.\n\nCommencement\n\n\f4\n\nFIRST SCHEDULE\n\nClassification of Hotels\n\nSECOND SCHEDULE\n\nRate of Room Levy\n\nTHIRD SCHEDULE\n\nProduct Development Levy\n\nFOURTH SCHEDULE\n\nShared Economy Levy\n\nFIFTH SCHEDULE\n\nEnactments to be Amended\n\nSIXTH SCHEDULE\n\nAmendment of the Value Added Tax Act, Cap. 87\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for\n\n(a)\n\n(b)\n\na  room  rate  levy  to  be  charged  on  the  provision  of  tourist\naccommodation or a villa;\n\na product development levy to be charged on the services specified in\nparagraph 1 of the Fourth Schedule to the Value Added Tax Act, Cap.\n87;\n\n\f6\n\n(c)\n\na  shared  economy  levy  to  be  charged  on  the  provision  of  tourist\naccommodation  or  a  villa  owned  or  operated  by  persons  who  earn\nincome from the tourism sector in Barbados, but who are either not\nregistered or given exempt status under the Value Added Tax Act, Cap.\n87;\n\n(d)\n\nthe validation of the imposition and collection of the room rate levy,\nproduct  development  levy  and  shared  economy  levy  from  the\nimposition of the levy until the commencement of this Act; and\n\n(e)\n\nrelated matters.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Tourism Levy Act, 2019.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“ “A” class hotel” means a hotel with extensive facilities, furnishings and décor\ndesigned to provide a high level of comfort, rest and relaxation, which offers\na higher standard of amenities and services than a “B” class hotel, with at\nleast the minimum requirements as specified in the First Schedule;\n\n“apartment” means a complete unit which provides short-term accommodation\nto tourists for reward, having either one or more studio bedrooms or separate\nbedrooms, a living room, a kitchen or kitchenette, a dining area, with at least\none bathroom in the unit for the exclusive use of the occupant of the unit;\nand where the occupants of the unit share the grounds, other recreational\nfacilities and other common buildings with the occupants of other units;;\n\n“accommodation  period”  means  the  time  to  be  spent  in  the  tourist\n\naccommodation or villa;\n\n\f7\n\n“ “B” class hotel” means a hotel with modest facilities, furnishings and décor,\nwhich  offers  basic  amenities  and  services  with  at  least  the  minimum\nrequirements as specified in the First Schedule;\n\n“Barbados  Revenue  Appeals  Tribunal”  or  “Tribunal”  means  the  tribunal\nestablished  by  section  24  of  the  Barbados  Revenue  Authority  Act,  2014\n(Act 2014-1);\n\n“Barbados  Revenue  Authority”  or  “Authority”  means  the  Barbados  Revenue\nAuthority established under section 3 of the Barbados Revenue Authority\nAct, 2014 (Act 2014-1);\n\n“direct tourism service” means any of the goods or services listed in paragraph\n\n1 of the Fourth Schedule to the Value Added Tax Act, Cap. 87;\n\n“guest” means a visitor to Barbados or a citizens of Barbados;\n\n“guest house” means any premises in which\n\n(a)\n\n(b)\n\n(c)\n\nsleeping accommodation is provided in 3 or more bedrooms;\n\na charge is made for the accommodation provided; and\n\nmeals are served to residents;\n\n“hotel” means\n\n(a)\n\n(b)\n\nany building containing not less than 10 bedrooms each of which is\nvalued at not less than $175 000; or\n\nany  group  of  buildings,  whether  cottages,  bungalows  or  otherwise,\nsituate within the same precincts, served by a common maid service\nand together containing not less than 10 bedrooms each of which is\nvalued at not less than $175 000,\n\nwhich is available for the accommodation of guests for reward at anytime\nin a calender year;\n\n“levy” means the room rate levy, product development levy or shared economy\n\nlevy;\n\n\f8\n\n““Luxury class hotel” means an upscale hotel with superior facilities, furnishings\nand  décor  designed  to  provide  an  exceptional  level  of  comfort,  rest  and\nrelaxation,  at  a  higher  standard  than  an  “A”  class  hotel  with  at  least  the\nminimum requirements as specified in the First Schedule;\n\n“officer” means a person who is employed by the Authority and authorised or\nassigned to assist the Authority in the administration and enforcement of\nthis Act;\n\n“payment  period”  means  the  taxable  period  specified  under  section  44  of  the\nValue Added Tax Act, Cap. 87 or such other period as may be specified by\nthe Authority;\n\n“product development levy” means the levy charged in accordance with section\n\n7;\n\n“Revenue Commissioner” means the Revenue Commissioner appointed under\nsection 7 of the Barbados Revenue Authority Act, 2014 (Act 2014-1);\n\n“room rate levy” means the levy charged in accordance with section 5;\n\n“shared economy levy” means a levy charged in accordance with section 9;\n\n“tourist accommodation ” means an apartment, hotel, guest house, and vacation\n\nrental property which is\n\n(a)\n\n(b)\n\nregistered with the Barbados Tourism Product Authority; and\n\nis rented by guests for reward\n\n(i)\n\nsystematically or periodically in a calendar year; or\n\n(ii)\n\nfor a specified period in a calender year;\n\n“vacation rental property” means any property that is valued at less than $3 000\n000,  is  systematically  or  periodically  rented  by  guests  during  a  calender\nyear,  is  registered  with  the  Barbados  Tourism  Product  Authority,  and  in\nwhich\n\n(a)\n\na charge is made for the accommodation provided;\n\n\f9\n\n(b)\n\nsleeping accommodation is provided in one or more bedrooms;\n\n(c)\n\nthe grounds and any common areas or recreational facilities are for the\nuse of the occupants of a single booking;\n\n(d)\n\nhousekeeping services are provided at least once every week; and\n\n(e)\n\nthe property is managed by an individual, a company or a real estate\nagent;\n\n“villa” means a house that\n\n(a)\n\n(b)\n\nhas at least 3 bedrooms and is valued at not less than $ 3 000 000;\n\nis managed by a company or real estate agent, and employs no less than\n3 persons;\n\n(c)\n\nis registered with the Barbados Tourism Product Authority; and\n\n(d)\n\nis rented by guests for reward for at least 6 months in every year.\n\nApplication and Administration\n\n3.(1)\n\nThis Act shall apply to a person who\n\n(a)\n\n(b)\n\n(c)\n\nprovides or supplies any tourist accommodation;\n\nrents a villa to a visitor or a citizen of Barbados; or\n\nprovides or supplies a direct tourism service to a visitor or a citizen of\nBarbados.\n\nthe\nThe  Barbados  Revenue  Authority  shall  be  responsible  for\n(2)\nadministration of this Act, and for the assessment, collection and recovery of the\nroom rate levy, product development levy and shared economy levy.\n\nRegistration and listing of tourist accommodation\n\n4.(1)\n\nAny person who provides\n\n(a)\n\ntourist  accommodation  shall  register  with  the  Barbados  Tourism\nProduct Authority;\n\n\f10\n\n(b)\n\n(c)\n\na villa for reward to a visitor or a citizen of Barbados shall register with\nthe Barbados Tourism Product Authority; and\n\na  direct  tourism  service  shall  register  with  the  Barbados  Revenue\nAuthority.\n\nThe  Barbados  Tourism  Product  Authority  shall  submit  to  the  Revenue\n(2)\nCommissioner before the 1st day of July, 2018 a list of persons who own or operate\ntourist accommodation, or a villa and shall thereafter submit an updated list of\nsuch persons every month .\n\nThe Barbados Tourism Product Authority shall ensure that the list prepared\n(3)\nfor the purposes of subsection (2) classifies each hotel listed as either a “B” class\nhotel,  an  “A”  class  hotel  or  a  luxury  class  hotel  in  accordance  with  the  First\nSchedule.\n\nImposition of room rate levy\n\n5.(1)\naccommodation or a villa in the manner specified in the Second Schedule.\n\nA  room  rate  levy  shall  be  imposed  on  the  rental  of  tourist\n\n(2)\nA person who provides tourist accommodation or rents a villa shall charge\nthe room rate levy on the tourist accommodation or villa provided by that person\nto  a  visitor  or  a  citizen  of  Barbados  in  the  manner  specified  in  the  Second\nSchedule.\n\nIn circumstances where the tourist accommodation or a villa is paid for\n(3)\nonline through the internet the person providing that tourist accommodation or\nvilla online shall charge the room rate levy on that tourist accommodation or villa\nand where provision is not made for the collection or payment of the room rate\nlevy  online  it  shall  be  collected  by  the  person  providing  the  tourist\naccommodation or villa by the end of the accommodation period.\n\nFrom the 1st day of April, 2019 the room rate levy shall not be applied to\n\n(4)\na villa.\n\n\f11\n\n(5)\nA  person  who  receives  payment  of  the  room  rate  levy  pursuant  to\nsubsection (2) and who fails to submit the sums collected to the Authority is guilty\nof an offence and is liable on summary conviction to a fine of $10 000.\n\nNotification of room rate levy\n\nA  person  who  provides  tourist  accommodation  or  rents  a  villa  for\n6.(1)\nreward  to  a  visitor  or  a  citizen  of  Barbados  and  who  advertises  that  tourist\naccommodation  or  villa  online  or  otherwise  shall  ensure  that  any  such\nadvertisement includes a notification of the requirement to pay the room rate levy.\n\nA person who provides for the booking and purchase of any stay at a tourist\n(2)\naccommodation or a villa, offered by a person online shall ensure that any person\nwho seeks to make a payment online to use the tourist accommodation or villa\nis notified of the room rate levy, where the room rate levy is\n\n(a)\n\n(b)\n\nincluded in the sums which will be collected when the online payment\nis made; or\n\nnot included with the online payment, that it will be collected when the\nperson comes to use the tourist accommodation for the accommodation\nperiod.\n\nA person who contravenes subsection (1) or subsection (2) is guilty of an\n\n(3)\noffence and is liable on summary conviction to a fine of $5 000.\n\nImposition of product development levy\n\n7.(1)\ndirect tourism service in the manner specified in the Third Schedule.\n\nA product development levy shall be imposed on the provision of a\n\n(2)\n\nA person who\n\n(a)\n\nhas a licence from the Barbados Tourism Product Authority, and who\nis registered with the Barbados Hotel and Tourism Association Inc. or\nthe Small Hotels of Barbados Inc.;\n\n\f12\n\n(b)\n\nis  subject  to  the  Fourth  Schedule  of  the  Value  Added  Tax  Act,\nCap. 87; and\n\n(c)\n\nprovides a direct tourism service;\n\nshall   charge the product development levy on the provision of a direct tourism\nservice to a visitor or a citizen of Barbados in the manner specified in the Third\nSchedule.\n\nIn circumstances where the direct tourism service is paid for online through\n(3)\nthe internet the person providing that direct tourism service online shall charge\nthe product development levy on that direct tourism service and where provision\nis not made for the collection or payment of that product development levy online\nit shall be collected from the visitor or the citizen of Barbados at the time that the\ndirect tourism service is used by the visitor or citizen of Barbados.\n\nA person who receives payment of the product development levy pursuant\n(4)\nto subsection (1) and who fails to submit the sums collected to the Authority is\nguilty of an offence and is liable on summary conviction to a fine of $10 000.\n\nNotification of product development levy\n\n8.(1)\nA person who provides a direct tourism service and who advertises\nthat  direct  tourism  service  online  or  otherwise  shall  ensure  that  any  such\nadvertisement  includes  a  notification  of  the  requirement  to  pay  the  product\ndevelopment levy.\n\nA person who provides for the booking and purchase of any direct tourism\n(2)\nservice offered by that person online shall ensure that any person who seeks to\nmake  payment  to  use  a  direct  tourism  service  is  notified  of  the  product\ndevelopment levy, where the product development levy is\n\n(a)\n\n(b)\n\nincluded in the sums which will be collected when the online payment\nis made; or\n\nnot included with the online payment, that it will be collected when the\nperson comes to use the direct tourism service.\n\n\f13\n\nA person who contravenes subsection (1) or subsection (2) is guilty of an\n\n(3)\noffence and is liable on summary conviction to a fine of $5 000.\n\nImposition of shared economy levy\n\n9.(1)\n\nA person who\n\n(a)\n\nis not registered under the Value Added Tax Act, Cap. 87 or who is\nexempt pursuant to section 10 of the Value Added Tax Act, Cap. 87 and\nspecified as such in the Second Schedule to that Act;\n\n(b)\n\nsupplies tourist accommodation or rents a villa; and\n\n(c)\n\nis registered with the Barbados Tourism Product Authority\n\nshall be required to charge a shared economy levy on the supply of that tourist\naccommodation or villa.\n\nThe shared economy levy, required by subsection (1), shall be imposed on\n(2)\ntourist accommodation or villa in the manner specified in the Fourth Schedule.\n\nIn  circumstances  where  the  tourist  accommodation  or  villa  is  paid  for\n(3)\nonline  through  the  internet  the  person  providing  that  tourist  accommodation\nonline shall charge the shared economy levy on that tourist accommodation or\nvilla and where provision is not made for the collection or payment of that shared\neconomy  levy  online  it  shall  be  collected  from  the  visitor  or  the  citizen  of\nBarbados by the end of the accommodation period.\n\nA person who receives payment of the shared economy levy pursuant to\n(4)\nsubsections (1) and (2) and who fails to submit the sums collected to the Authority\nis guilty of an offence and is liable on summary conviction to a fine of $10 000.\n\nNotification of shared economy levy\n\n10.(1)\nA person who provides tourist accommodation or rents a villa to which\nsection  9  applies  and  who  advertises  that  tourist  accommodation  online  or\notherwise shall ensure that any such advertisement includes a notification of the\nrequirement to pay the shared economy levy.\n\n\f14\n\n(2)\nA  person  who  provides  for  the  booking  and  purchase  of  any  tourist\naccommodation or villa offered by a person online shall ensure that any person\nwho seeks to make a payment online to use that tourist accommodation or villa\nis notified of the shared economy levy, where the shared economy levy is\n\n(a)\n\n(b)\n\nincluded in the sums which will be collected when the online payment\nis made; or\n\nnot included with the online payment, that it will be collected when the\nperson  comes  to  use  the  tourist  accommodation  or  villa  for  the\naccommodation period.\n\nA person who contravenes subsection (1) or subsection (2) is guilty of an\n\n(3)\noffence and is liable on summary conviction to a fine of $5 000.\n\nPayment of levies\n\nThe Revenue Commissioner shall notify a person who provides tourist\n11.(1)\naccommodation or a direct tourism service, or rents a villa to a visitor or citizen\nof Barbados of his payment period and where that person is also registered under\nthe Value Added Tax Act, Cap. 87, the payment period shall be the same as the\ntaxable period of that person.\n\nA person, referred to in subsection (1), shall within 21 days after the end\n\n(2)\nof each payment period,\n\n(a)\n\nfile with the Barbados Revenue Authority, in such a form or manner\nas the Revenue Commissioner determines and notifies by an instrument\nin writing\n\n(i)\n\n(ii)\n\na return for the payment period;\n\na statement of the number of rentals or services which occurred\nin  the  period,  and  the  revenue  obtained  from  the  rentals  or\nservices; and\n\n(iii)\n\nsuch  additional  information  as  the  Revenue  Commissioner\nrequires; and\n\n\f15\n\n(b)\n\npay to the Barbados Revenue Authority the levy payable by that person\nfor the payment period.\n\n(3)\nA  person  who  files  a  return  after  the  payment  period  referred  to  in\nsubsection (2) shall pay a penalty of $100 to the Barbados Revenue Authority.\n\nA person who fails to pay the amount of the levy payable by that person\n\n(4)\nwithin one month of the period referred to in subsection (2) shall pay\n\n(a)\n\n(b)\n\na penalty of 10 per cent of the amount of the levy that is payable; and\n\nsimple interest at the rate of one per cent per month calculated for each\nmonth or part of a month during which any amount of the levy and\npenalty remains unpaid.\n\nConsolidated fund\n\n12.\nthe Consolidated Fund.\n\nAll monies collected as a levy pursuant to this Act shall be paid into\n\nRefund for overpayment\n\n13.(1)\nIn circumstances where a person has paid an amount as a levy and that\namount exceeds the amount that was payable by that person under this Act, the\nRevenue Commissioner shall refund to that person the sum which is equal to the\namount of the excess, where that person applies for a refund within 2 years after\nthe amount was paid.\n\nThe  refund  payable  under  subsection  (1)  shall  be  paid  from  the\n\n(2)\nConsolidated Fund.\n\nWaivers and refunds\n\n14.\nThe  Minister  may  by  order,  where  he  thinks  it  equitable  to  do  so,\nwaive,  exempt,  remit  or  refund,  in  whole  or  in  part,  the  amount  of  any  levy\npayable or paid by any person under this Act.\n\n\f16\n\nKeeping of accounts and records\n\n15.(1)\nA  person  who  provides  tourist  accommodation,  a  direct  tourism\nservice or rents a villa shall keep records, information and accounts so as to enable\nthe Revenue Commissioner to determine the amount of the levy which is payable\nby that person for any payment period.\n\nWhere  a  person  fails  to  keep  records,  information  and  accounts  for  the\n(2)\npurposes of this Act, the Revenue Commissioner may require that person to keep\nsuch records, information and accounts as the Authority determines.\n\nA person shall retain the records, information and accounts referred to in\n(3)\nsubsections (1) and (2) until the expiration of 5 years after the end of the year to\nwhich the records, information and accounts relate or for such shorter period as\nthe Revenue Commissioner may determine.\n\nA person who fails to keep records, information and accounts in accordance\n(4)\nwith this section is guilty of an offence and is liable on summary conviction to a\nfine of $5 000.\n\nAudit\n\n16.(1)\nAn officer may at any reasonable time audit or examine the records\nof a person who provides tourist accommodation, a direct tourism service or rents\na villa for the purposes of assessing\n\n(a)\n\n(b)\n\n(c)\n\nthe amount paid by that person as a levy;\n\nany amount to be refunded to that person; or\n\nwhether  the  records  of  the  tourist  accommodation,  direct  tourism\nservice or villa are being kept in the manner required by the Revenue\nCommissioner pursuant to section 15.\n\n\f17\n\nFor the purposes of subsection (1), an officer may, at any reasonable time,\n\n(2)\nenter any premises or place to which this Act applies and\n\n(a)\n\ninspect or examine the records, information and books of account kept\nby  a  person  who  provides  tourist  accommodation,  a  direct  tourism\nservice or rents a villa, or any employee or agent of that person any\nother document, item or matter that may be relevant in determining\n\n(i)\n\nthe amount of the levy or other amounts payable or remittable\nunder this Act or any other obligation under this Act; or\n\n(iii)\n\nthe amount of a refund due to the owner under this Act;\n\n(b)\n\nrequire  the  person  who  provides  tourist  accommodation,  a  direct\ntourism service or rents a villa or any employee or agent of that person\nto  give  him  all  reasonable  assistance  with  his  inspection,  audit  or\nexamination  and  to  answer  all  questions  relating  to  the  person\nresponsible for the payment of the levy under this Act either orally or\nin writing.\n\nWhere,  during  the  course  of  an  audit  or  examination  referred  to  in\n(3)\nsubsection (1), it appears to the officer referred to in that subsection that there\nhas been a violation of this Act, the officer may seize and take away any records,\ninformation or books of account which may afford evidence of the violation.\n\nThe  Revenue  Commissioner  may,  for  any  purpose  related  to  the\n(4)\nadministration  of  this  Act,  by  registered  letter  or  by  an  instrument  in  writing\nserved personally, require any person\n\n(a)\n\n(b)\n\nto provide any information in the form of a return or otherwise; and\n\nto produce any record, information or books of account, within such\ntime as the Revenue Commissioner specifies.\n\nCopies of documents\n\nWhere  any  document,  information  or  book  of  account  has  been\n17.\nproduced, seized, inspected or examined by an officer under this Act, the officer\n\n\f18\n\nmay make copies and a document purporting to be certified by the officer to be\na copy made pursuant to this section is admissible in evidence and has the same\nprobative value as the original document.\n\nNotice of assessment of levy\n\n18.\n\nIn circumstances where,\n\n(a)\n\na person has failed to submit the sums collected  in accordance with\nsections 5, 7 or 9;\n\n(b)\n\na person has failed to file a return in accordance with section 11; or\n\n(c)\n\nthe Revenue Commissioner is satisfied that a true account of the levy\npayable has not been given in a return\n\nthe Revenue Commissioner shall notify the person by an instrument in writing\nthat an assessment will be done, and that instrument in writing shall state what\nis  being  assessed,  the  reason  for  the  assessment,  detail  when  and  how  the\nassessment will be done, and invite the person to submit in writing by a stated\ndate any representation or information which the person has which can explain\nthe concern raised by the Revenue Commissioner.\n\nNotice of assessment result\n\n19.\nThe  Revenue  Commissioner  shall  notify  the  person  referred  to  in\nsection 18, by an instrument in writing, of the result of the assessment, and state\nwhat action the person is required to take and by what date.\n\nObjections\n\n20.(1)\n\nSubject to this section, a person who\n\n(a)\n\n(b)\n\nhaving been assessed, disagrees with the assessment; or\n\nhaving made an application for a refund of the levy, disagrees with the\nRevenue Commissioner's determination respecting the application\n\n\f19\n\nmay object to the assessment or determination by filing an instrument in writing\nwith the Revenue Commissioner within 21 days after the date of the notice of\nassessment or notice of determination, as the case may be, or such longer period\nas the Revenue Commissioner allows.\n\nA notice of objection shall be in writing and shall state the precise grounds\n\n(2)\nfor the objection.\n\nThe Revenue Commissioner shall give a person who has objected to an\n(3)\nassessment or determination an opportunity to support his objection by a written\nor oral submission to the Revenue Commissioner.\n\nThe Revenue Commissioner shall, after receiving a notice of objection in\n(4)\nrespect  of  an  assessment  or  determination  and  after  giving  the  person  who\nobjected an opportunity to support his objection,\n\n(a)\n\n(b)\n\nreview the assessment or determination and either confirm it or make\na reassessment or redetermination, as the case may require; and\n\ndeliver to the person who objected, a notice of confirmation, a notice\nof reassessment or a notice of redetermination, as the case may require.\n\nWhere  a  person  has  filed  a  notice  of  objection  under  this  Act  and  the\n(5)\nRevenue  Commissioner  has  not,  within  6  months  thereafter,  delivered  to  the\nperson  a  notice  of  confirmation,  reassessment  or  redetermination,  that  person\nmay appeal to the Tribunal in respect of the objection.\n\nWhere  the  Revenue  Commissioner  delivers  to  a  person,  a  notice  of\n(6)\nconfirmation, reassessment or redetermination respecting an objection after the\nexpiration of the period of 6 months referred to in subsection (5), the person may\nappeal to the Tribunal within 30 days after the delivery of the notice.\n\nAppeal to Tribunal\n\n21.(1)\nA  person  who  objects  to  an  assessment  or  determination  and  who\nreceives a notice of confirmation, reassessment or redetermination, may appeal\nthe decision of the Revenue Commissioner to the Barbados Revenue Appeals\n\n\f20\n\nTribunal,  within  30  days  after  the  day  on  which  the  notice  of  confirmation,\nreassessment or redetermination, as the case may be, was delivered to him.\n\nAn appeal under this section shall be instituted by filing a notice of appeal\n(2)\nwith the Tribunal together with such copies thereof as the Tribunal may require,\nand such notice shall, as far as possible, state the precise grounds of appeal.\n\nWhere the Tribunal is satisfied that there is good reason for the failure of\n(3)\na  person  to  object  or  appeal  within  the  time  specified  in  subsection  (1)  the\nTribunal may allow the person objecting such further time as the Tribunal thinks\nfit.\n\nAppeal to the High Court\n\n22.(1)\nof the Tribunal to the High Court on a point of law.\n\nAny party to an appeal to the Tribunal may appeal from the decision\n\nIn disposing of an appeal under this section in respect of an assessment or\n\n(2)\ndetermination, the High Court may\n\n(a)\n\n(b)\n\nconfirm or set aside the assessment or determination;\n\nmake an order referring the assessment or determination back to the\nRevenue  Commissioner  for  reassessment  or  redetermination  in\naccordance with the directions of the Court; or\n\n(c)\n\nmake such other order as it thinks fit.\n\nRecovery of the levy\n\n23.\nAny  levy  payable  under  this  Act  and  any  other  amount  payable  as\npenalty and interest is a debt due to the Crown and is recoverable as such in civil\nproceedings in the magistrate’s court, notwithstanding that the amount involved\nexceeds the normal monetary limit on the jurisdiction of a magistrate’s court.\n\nObstruction of officers\n\n24.\nA person who threatens, assaults or obstructs an officer acting in the\nexecution  of  his  duty  under  this  Act  is  guilty  of  an  offence  and  is  liable  on\n\n\f21\n\nsummary conviction to a fine of $10 000 or to imprisonment for 2 years or to\nboth.\n\nAmendment of enactments in the Fifth Schedule and Sixth Schedule\n\n25.(1)\namended in the manner specified in the second column thereof.\n\nThe enactments specified in the first column of the Fifth Schedule are\n\nThe  enactment  specified  in  the  first  column  of  the  Sixth  Schedule  is\n\n(2)\namended in the manner specified in the second column thereof.\n\nValidation\n\nAll decisions made, all acts done and all levies paid to and collected\n26.(1)\nby  the  Barbados  Revenue  Authority  from  the  1st  day  of  July,  2018  until  the\ncommencement of this Act shall be deemed to have been lawfully and validly\nmade, done, paid, and collected.\n\nSubsection (1) shall not prohibit the Barbados Revenue Authority or the\n(2)\nMinister from taking any action as may be required pursuant to section 13 or\nsection 14.\n\nCommencement\n\n27.(1)\nSections  1  to  8,  11  to  24,  section  25,  section  26  and  the  First\nSchedule, the second column of the Second Schedule and the first column of the\nThird Schedule of this Act shall be deemed to have come into force on the 1st day\nof July, 2018.\n\nSection 9, section 10 and the first column of the Fourth Schedule shall be\n\n(2)\ndeemed to have come into force on the 1st day of August, 2018.\n\nThe  third  column  of  the  Second  Schedule,  second  column  of  the  Third\n(3)\nSchedule and the second column of the Fourth Schedule shall be deemed to come\ninto effect on the 1st day of April, 2019.\n\nThe amendment specified in the Sixth Schedule shall take effect 1st day of\n\n(4)\nJanuary, 2020.\n\n\f22\n\nFIRST SCHEDULE\n\nClassification of Hotels\n\n(Section 2, 4 and 27(1))\n\nCategory of Hotel\n\nMinimum requirement for this Category of\nHotel\n\nLuxury Hotel\n\n1. 24 hour reception facility .\n\n2. Property is clean and is maintained- rooms\nand varied hotel areas are identified by signage.\n\n3. The structure and features, furniture, fittings\nof the hotel’s exterior are aesthetically\nappealing and of a high standard, and are\ndesigned to give a greater or higher level of\ncomfort, and relaxation.\n\n4. En-suite bathrooms in each room with a daily\nsupply of high quality absorbent towels and\nhigh quality toiletries (hot tub or jacuzzi in en-\nsuite master bathrooms).\n\n5. Complimentary wireless internet access in\nall public areas and guest rooms.\n\n6. Multiple restaurants with table d'hôte and à\nla carte menus with extensive food choices,\neach with a hostess to greet and seat guests upon\narrival- three course meals available (with\nhealthy, vegan and vegetarian options).\n\n7. Continental breakfast and cooked breakfast\nwith options.\n\n8. 24-hour full room service with meals served\non decorated dining tables.\n\n9. Multiple bars with cocktails available-\nextensive wine menus in the restaurants.\n\n\f23\n\n10. Housekeeping services offered daily.\n\n11. Iron and iron board in all guest rooms.\n\n12. Air-conditioned rooms or rooms with\nfan(s).\n\n13. Welcome beverage and canapes and\ncomplimentary pack as a part of the arrival\npackage.\n\n14. Business centre available.\n\n15. Provision of do not disturb sign.\n\n16. Staff fluent in a foreign language(s).\n\n17. Porter services offered.\n\n18. Spacious fitness facilities and spa available\nas well as beauty and hair salon.\n\n19. Convenience store and multiple shops\noffering male and female duty-free clothing,\njewellery and personal amenities for sale.\n\n20. International in-room direct dial phones.\n\n21. Complimentary airport/ seaport transport\nservice using luxury vehicles available on\nrequest.\n\n22. Butler service should at least be available\nto some rooms on request.\n\n23. Rooms offer spacious accommodation\nfacilities with turndown service with\naccompaniments.\n\n24. Room furnishings, fittings and fixtures\nprovide excessive comfort, rest and relaxation.\n\n25. Excellent sound proofing in rooms.\n\n26. Provide safety deposit facilities in the room.\n\n27. Provide manned security services on site.\n\n\f24\n\n28. Requisite licences and certificates from the\nMinistry of Health.\n\n29. Fire Certificate from the Barbados Fire\nService.\n\n30. Tax clearance certificates from the\nBarbados Revenue Authority and the National\nInsurance Department.\n\n“A” Class Hotel\n\n1. 24 hour reception facility.\n\n2. Property is clean and is maintained- rooms\nand varied hotel areas are identified by signage.\n\n3. Furniture, fixtures, fittings and general décor\nare designed to give a great or high level of\ncomfort, and relaxation — may have some\nsound proofing.\n\n4. En-suite bathrooms in each room with daily\nsupply of clean towels and toiletries.\n\n5. Complimentary wireless internet access in\nguest rooms and in at least two public areas.\n\n6. Restaurant serving at least 3 meal options\nwith table d’hôte and à la carte menus ( with\nhealthy, vegan and vegetarian options).\nRestaurant has a hostess to greet and seat guests\nupon arrival.\n\n7. Continental breakfast and cooked breakfast\nwith options.\n\n8. Minimum room service with hot or cold\ndrinks with sandwiches or light snacks.\n\n9. Housekeeping offered daily.\n\n10. Iron and iron board in all guest rooms.\n\n11. Air-conditioned rooms or rooms with\nfan(s).\n\n\f25\n\n12. Welcome beverage and complimentary\npack as part of arrival package.\n\n13. Business centre available.\n\n14. Provision of do not disturb sign.\n\n15. Staff fluent in a foreign language.\n\n16. Porter services offered.\n\n17. Fitness facilities available.\n\n18. A dedicated sundry area or shop.\n\n19. International in-room direct dial phones.\n\n20. Provide safety deposit facilities in the room.\n\n21. Provide manned security services on site.\n\n22. Requisite licences and certificates from the\nMinistry of Health.\n\n23. Fire Certificate from the Barbados Fire\nService.\n\n24. Tax clearance certificates from the\nBarbados Revenue Authority and the National\nInsurance Department.\n\n“B” Class Hotel\n\n1. Staffed reception facilities.\n\n2. The property is clean and is maintained-\nrooms and varied hotel areas are identified by\nsignage.\n\n3. Furnishings, fittings and fixtures are such to\nprovide basic comfort in rooms.\n\n4. En-suite bathrooms in each room with daily\nsupply of clean towels and toiletries.\n\n5. Complimentary internet access in at least one\npublic area.\n\n\f26\n\n6. A restaurant serving at least 3 meal options\nwith legible table d'hôte or à la carte menus.\n\n7. At least continental or cooked breakfast\nprovided.\n\n8. Housekeeping offered daily.\n\n9. Iron and iron board.\n\n10. Air-conditioned rooms or rooms with\nfan(s).\n\n11. Provide safety deposit facilities.\n\n12. Provide security services on site.\n\n13. Requisite licences and certificates from the\nMinistry of Health.\n\n14. Fire Certificate from the Barbados Fire\nService.\n\n15. Tax clearance certificates from the\nBarbados Revenue Authority and the National\nInsurance Department.\n\n\f27\n\nSECOND SCHEDULE\n\n(Sections 5, 27 (1) and 27(3))\n\nRate of Room Levy\n\nRoom Classification\n\nAmount of Room Rate Levy\neffective 1st July 2018 to 30th\nMarch, 2019\n\nAmount of Room Rate Levy\neffective 1st April, 2019\n\nApartment\n\n$5.00 per bedroom per night\n\n$8.75 per bedroom per night\n\nGuest House\n\n$5.00 per bedroom per night\n\n$8.75 per bedroom per night\n\nHotel\nLuxury class\n“A” class\n“B” class\n\nVacation rental properties\n\nVilla\n\n$20.00 per bedroom per night\n$11.00 per bedroom per night\n$5.00 per bedroom per night\n\n$35.00 per bedroom per night\n$19.25 per bedroom per night\n$8.75 per bedroom per night\n\n2.5% of the rate charged per\nbedroom per night, and where\nthis amount exceeds $20.00 per\nnight, the rate to be charged\nshall be $20.00 per bedroom\nper night.\n\n3.75% of the rate charged per\nbedroom per night, and where\nthis amount exceeds $35.00 per\nnight, the rate to be charged\nshall be $35.00 per bedroom\nper night.\n\n2.5% of the rate charged per\nbedroom per night, and where\nthis amount exceeds $20.00 per\nnight, the rate to be charged\nshall be $20.00 per bedroom\nper night.\n\nThe Room Rate Levy shall no\nlonger be applied to a villa from\nthis date. The shared economy\nlevy shall be applied.\n\n\f28\n\nTHIRD SCHEDULE\n\nProduct Development Levy\n\n(Sections 7 and 27(3) )\n\nAmount of Product Development Levy\neffective 1st July 2018 to 30th March, 2019\n\nAmount of Product Development Levy\neffective 1st April, 2019\n\n2.5 %  of the cost of the direct tourism service 3.75 % of the cost of the direct tourism service\n\n\f29\n\nFOURTH SCHEDULE\n\nShared Economy Levy\n\n(Sections 9 and 27(3) )\n\nAmount of Shared Economy Levy effective\n1st August 2018 to 30th March, 2019\n\nAmount of Shared Economy Levy effective\n1st April, 2019\n\n10 % of the cost of the rental or lease of the\ntourist accommodation or villa whether that\ncharge is a rate which is charged per night or per\nbedroom or a rate for the period of use.\n\n10 % of the cost of the rental or lease of the\ntourist accommodation or villa whether that\ncharge is a rate which is charged per night or per\nbedroom or a rate for the period of use.\n\n\f30\n\nFIFTH SCHEDULE\n\nEnactments to be Amended\n\n(Section 25(1) )\n\nENACTMENT\n\nAMENDMENT\n\nBarbados Revenue Authority Act, 2014\n\nLand Tax Act, Cap. 78A\n\nIn section 15 by inserting the following new\nsubsection after subsection (3):\n“ (4) All revenue paid, collected or received\npursuant to section 4 shall be paid into the\nConsolidated Fund.”.\n\nIn the First Schedule by inserting the following\nnew paragraph after paragraph 10:\n“ 11.Tourism Levy Act, 2019 ”.\n\nIn section 6D delete subsection (2)(b) and\nsubstitute the following:\n\n“\n\n(b)\n\n“villa” means a house that\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\nhas at least three bedrooms\nand is valued at not less than\n$3 000 000;\n\nestate\n\nis managed by a company or\nand\nreal\nemploys  no  less  than  3\npersons;\n\nagent\n\nis\nthe\nregistered  with\nBarbados  Tourism  Product\nAuthority; and\n\nis  rented  by  guests  for\nreward for at least 6 months\nin every year.”.\n\n\fTourism Development Act, Cap. 341\n\n31\n\nIn section 2 delete the definition of the words\n“hotel” and “villa” and substitute the following:\n\n“ “hotel” means\n\n(a)\n\n(b)\n\nany  building  containing  not  less\nthan 10 bedrooms each of which is\nvalued at not less than $175 000; or\n\nany  group  of  buildings,  whether\ncottages, bungalows or otherwise,\nsituate  within  the  same  precincts,\nserved by a common maid service\nand  together  containing  not  less\nthan 10 bedrooms each of which is\nvalued at not less than $175 000,\n\nwhich is available for the\naccommodation of guests for reward at\nanytime a calender year;”.\n\n“villa” means a house that\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nhas  at  least  3  bedrooms  and  is\nvalued at not less than $ 3 000 000;\n\nis managed by a company or real\nestate  agent,  and  employs  no  less\nthan 3 persons;\n\nis  registered  with  the  Barbados\nTourism Product Authority; and\n\nis rented by guests for reward for at\nleast 6 months in every year.”.\n\nValue Added Tax Act, Cap. 87\n\nIn section 7 of the Act repeal subsection (3B).\n\nIn the Second Schedule  by inserting the\nfollowing new paragraph after paragraph 15:\n“ 16. From the 1st day of April, 2019 a supply\nor rental of accommodation in a villa.”.\n\nIn the Fourth Schedule by deleting paragraph 7\nand substituting the following:\n\n\f32\n\n“\n\nFrom  the  1st  day  of  April,  2019,\n7.\ngoods imported for the purposes of a tourism\nproduct, other than a villa, or a tourism project,\nother than a villa, approved under the Tourism\nDevelopment Act, Cap. 341\n\n(a)\n\n(b)\n\nin respect of which relief from tax\nmay  be  claimed  pursuant  to  the\nprovisions of that Act;\n\nof\n\nthat\n\npurpose\n\nthe\nfor\nthe\ntourism\nrefurbishment  of\nproduct  or  tourism  project  and\nwhere the goods are contained in a\nlist  of  goods  approved  by  the\nMinister for such purposes.”.\n\n\f33\n\nSIXTH SCHEDULE\n\nAmendment of the Value Added Tax Act, Cap. 87\n\n(Sections 25(2) and 27(4) )\n\nENACTMENT\n\nAMENDMENT\n\nValue Added Tax Act, Cap. 87\n\nIn section 7(11)(b) deleting the words “7.5%”\nand inserting the words “10 %”\n\n"
}