{
  "bill_id": 394,
  "slug": "debt-holder-approval-of-debt-restructuring-amendment-bill-2019",
  "title": "Debt Holder (Approval of Debt  Restructuring) (Amendment) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/f8330e9578edd3ba1d1fb59ab0b72832.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2019-05-07",
  "first_reading": "2019-05-07",
  "gazette_date": "2019-05-15",
  "markdown": "2019-04-12\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Debt  Holder  (Approval  of  Debt  Restructuring)\n\nAct, (Act 2018-24)\n\n(a)\n\n(b)\n\n(c)\n\nto provide for instruments issued to the Central Bank of Barbados;\n\nto provide for more equitable treatment for estate and legacy  accounts\nand individuals who hold debt issued by state owned enterprises;\n\nto authorise the Government of Barbados to prepay all or part of the\nprincipal and interest accrued on a specified debt instrument; and\n\n(d)\n\nfor related matters.\n\n\f2\n\n1.\n\n2.\n\n3.\n\n4.\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Act 2018-24\n\nInsertion of section 7 into Act 2018-24\n\nRepeal and replacement of the Second Schedule of Act 2018-24\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Debt Holder (Approval of Debt Restructuring) Act,\n\n(Act 2018-24)\n\n(a)\n\n(b)\n\nto  make  provision  for  instruments  issued  to  the  Central  Bank  of\nBarbados;\n\nto provide for more equitable treatment for estate and legacy  accounts\nand individuals who hold debt issued by state owned enterprises;\n\n\f4\n\n(c)\n\nto authorise the Government of Barbados to prepay all or part of the\nprincipal and interest accrued on a specified debt instrument; and\n\n(d)\n\nfor related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\nRestructuring) (Amendment) Act, 2019.\n\nThis  Act  may  be  cited  as  the  Debt  Holder  (Approval  of  Debt\n\nAmendment of section 2 of Act 2018-24\n\nSection 2 of the Debt Holder (Approval of Debt Restructuring) Act,\n2.\n2018 (Act 2018-24), in this Act referred to as the principal Act, is amended by\ninserting in the appropriate alphabetical order the following definitions:\n\n“ “BDS” means Barbados dollars;\n\n“Central  Bank  of  Barbados”  means  the  Central  Bank  of  Barbados\nestablished  by  section  3  of  the  Central  Bank  of  Barbados  Act,\nCap. 323C;”.\n\nInsertion of section 7 into Act 2018-24\n\n3.\n6 the following section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Prepayment of principal\n\n7.\nwritten notice to the instrument holder, prepay\n\nThe  Government  may,  with  not  less  than  15  days  prior\n\n(a)\n\npart of; or\n\n\f5\n\n(b)\n\nall of,\n\nthe  principal  and  accrued  but  unpaid  interest  up  to  the  date  of  such\nprepayment on a specified debt instrument.”.\n\nRepeal and replacement of the Second Schedule of Act 2018-24\n\n4.\nsubstituting the Schedule as set out in the Schedule to this Act.\n\nThe principal Act is amended by deleting the Second Schedule and\n\n\f6\n\n L.R.O. 1998SCHEDULE(Section 4)\"SECOND SCEHDULE(Section 2)Part IDebt Restructuring Proposals for IndividualsIntroductionOn 7 September, 2018 the Government of Barbados (GoB) announced the launch of an exchangeoffer open to holders of Barbados dollar-denominated debt issued by the GoB and certainstate-owned enterprises (SOEs), as part of its Comprehensive Debt Restructuring. Therestructuring is a central pillar of the economic reform and rehabilitation programme that isbeing supported by the International Monetary Fund through a four-year Extended Fund Facility.This document sets out the terms of the exchange offer that apply to Individuals holdingTreasury Bills, Treasury Notes and Debentures issued by the GoB. Savings Bonds areexcluded from this exchange offer as they do not fall within the scope of the ComprehensiveDebt Restructuring.All holders of Treasury Bills, Treasury Notes, Debentures, Loans and Bonds owed by the GoBand Loans and Bonds owed by SOEs and other entities that receive transfers from the GoB’sbudget (\"Affected Debt\") will receive letters during the course of the week commencing10 September, 2018 providing further details of the exchange offer, as well as instructions forparticipating in the exchange offer. The relevant acceptance forms must be submitted byholders of the Affected Debt no later than 5:00 pm, on Monday 29 October, 2018.It is expected that the new debt instruments (\"Exchange Instruments\") will be issued toparticipating holders by the end of October, 2018.\f7\n\n L.R.O. 1998PensionersDeﬁ nition: All individuals who are 60 years and above AND are receivingof \"Pensioners\" pension beneﬁ ts as of 1 September, 2018Affected Debt: Holdings in ALL outstanding series of Treasury Bills, Treasury Notes and Debentures issued by the GoB and Bonds issued by Eligible SOEsExchange Affected Debt to be exchanged for:Instrument: • Up to BDS $50,000.00 in cash • Up to BDS $200,000.00 in Series F Bonds • 11 Series B amortising strips issued by the GoB with maturities of  5, 6, 7, 8, 9, 10, 11,12, 13, 14, and 15 years; combined face value  of strips will equal that of Affected Debt exchanged, plus  accrued interest (see below)Accrued Interest: Capitalised through to 30 September, 2018 and added to principalInterest Rate: Series B: • 1.0% per annum for ﬁ rst 3 years • 2.5% per annum for year 4 • 3.75% to maturity Series F: NonePrincipal Series B:Repayment: The principal of each strip will be repaid in 4 equal quarterly instalments commencing one year prior to the maturity date of that strip Series F: Principal will be repaid in 42 equal monthly instalments of principal and interest after a six-month grace periodSchedule - (Cont'd)\f8\n\n L.R.O. 1998Interest Payment: Series B: Quarterly Series B:Allocation of 5-Year: 7.49% 11-Year: 9.37%Aggregate 6-Year: 7.78% 12-Year: 9.72%Principal Amount 7-Year: 8.07% 13-Year: 10.10%Amongst Strips: 8-Year: 8.38% 14-Year: 10.48% 9-Year: 8.70% 15-Year: 10.88% 10-Year: 9.03%Individuals other than PensionersDeﬁ nition: 1) All individuals who are NOT of a pensionable age, andof \"Individuals  other than 2) Individuals who are 60 years and above but are NOT receivingPensioners\"  pension beneﬁ ts as of 1 September, 2018Affected Debt: Holdings in ALL outstanding series of Treasury Bills, Notes and Debentures issued by the GoB and Bonds issued by Eligible SOEsExchange Instrument: Affected Debt to be exchanged for 11 Series B amortising strips issued by the GoB with maturities of 5, 6, 7, 8, 9, 10, 11, 12, 13, 14 and 15 years; combined face value of strips will equal that of Affected Debt exchanged, plus accrued interest (see below)Accrued Interest: Capitalised through to 30 September, 2018 and added to principal Interest Rate: • 1.0% per annum for ﬁ rst 3 years  • 2.5% per annum for year 4  • 3.75% to maturityInterest Payment: QuarterlyPrincipal The principal of each strip will be repaid in 4 equal quarterlyRepayment: instalments commencing one year prior to the maturity date of that stripSchedule - (Cont'd)\f9\n\n L.R.O. 1998Allocation of 5-Year: 7.49% 11-Year: 9.37%Aggregate 6-Year: 7.78% 12-Year: 9.72%Principal Amount 7-Year: 8.07% 13-Year: 10.10%Amongst Strips: 8-Year: 8.38% 14-Year: 10.48% 9-Year: 8.70% 15-Year: 10.88% 10-Year: 9.03%Natural Disaster ClauseThe Exchange Instruments to be issued to individuals as part of the GoB’s exchange offer willinclude a clause that would offer both creditors and the GoB some protection againstfuture debt distress caused by a major natural disaster.This \"natural disaster\" clause would allow for the capitalisation of interest and the deferral of scheduled amortisations falling due over a two-year period following the occurrence ofa major natural disaster. The trigger for a natural disaster \"event\" would be a payout to theGoB above a predetermined threshold by the Caribbean Catastrophe Risk InsuranceFacility (CCRIF), under the GoB’s catastrophe insurance policy.Full details will be provided in the offer letters to holders of the Affected Debt.Schedule - (Cont'd)\f10\n\n L.R.O. 1998Part IIDebt Restructuring Proposals for InstitutionsIntroductionOn 7 September, 2018 the Government of Barbados (GoB) announced the launch of anexchange offer open to holders of Barbados dollar-denominated debt issued by the GoB and certain state-owned enterprises (SOEs), as part of its Comprehensive Debt Restructuring. The restructuring is a central pillar of the economic reform and rehabilitation programme that isbeing supported by the International Monetary Fund through a four-year Extended Fund Facility.This document summarises the terms of the exchange offer that apply to Institutions holdingTreasury Bills, Treasury Notes, Debentures, Loans and Bonds issued or owed by the GoBas well as Loans and Bonds issued or owed by SOEs and entities that receive transfersfrom the GoB’s budget (\"Eligible SOEs\").All holders of Treasury Bills, Treasury Notes, Debentures, Loans and Bonds owed by the GoB and Loans and Bonds owed by Eligible SOEs (\"Affected Debt\") will receive lettersduring the course of the week commencing 10 September, 2018 providing further details of the exchange offer, as well as instructions for participating in the exchange offer. Therelevant acceptance forms must be submitted by holders of the Affected Debt no later than 5:00 pm, on Monday 29 October, 2018. It is expected that the new debt instruments(\"Exchange Instruments\") will be issued to participating holders by the end of October, 2018.Description of Exchange InstrumentsLiquidity Reserve Fund Treasury BillsStructure: 90-day Treasury Bill issued by the GoBInterest Rate: • 0.5% per annum for ﬁ rst 10 years  • Market rates thereafterNatural Disaster Clause: NoSchedule - (Cont'd)\f11\n\n L.R.O. 1998Schedule - (Cont'd)Monetary Policy Treasury BillsStructure: 90-day Treasury Bill issued by the GoB Perpetual RollingInterest Rate: • 3.5% per annumNatural Disaster Clause: NoSeries BStructure: 11 Series B amortising strips issued by the GoB with maturities of 5, 6, 7, 8, 9, 10, 11, 12, 13, 14 and 15 yearsInterest Rate: • 1.0% per annum for ﬁ rst 3 years  • 2.5% per annum for year 4  • 3.75% to maturityInterest Payment: QuarterlyPrincipal Repayment: The principal of each strip will be repaid in 4 equal quarterly instalments commencing one year prior to the maturity date of that stripAllocation of 5-Year: 7.49% 11-Year: 9.37%Aggregate 6-Year: 7.78% 12-Year: 9.72%Principal Amount 7-Year: 8.07% 13-Year: 10.10%Amongst Strips: 8-Year: 8.38% 14-Year: 10.48% 9-Year: 8.70% 15-Year: 10.88% 10-Year: 9.03%Natural Disaster Clause: Yes\f12\n\n L.R.O. 1998Schedule - (Cont'd)Series CStructure: 11 Series C amortising strips issued by the GoB with maturities of 5, 6, 7, 8, 9, 10, 11, 12, 13, 14 and 15 yearsInterest Rate: • 1.0% per annum for ﬁ rst 3 years  • 2.5% per annum for year 4  • 3.75% to maturityInterest Payment: QuarterlyPrincipal Repayment: The principal of each strip will be repaid in 4 equal quarterly instalments commencing one year prior to the maturity date of that stripAllocation of 5-Year: 7.49% 11-Year: 9.37%Aggregate 6-Year: 7.78% 12-Year: 9.72%Principal Amount 7-Year: 8.07% 13-Year: 10.10%Amongst Strips: 8-Year: 8.38% 14-Year: 10.48% 9-Year: 8.70% 15-Year: 10.88% 10-Year: 9.03%Natural Disaster Clause: NoSeries DStructure: 20 Series D amortising strips issued by the GoB with maturities in each of years 16-35Interest Rate: • 1.5% per annum for ﬁ rst 5 years  • 4.25% per annum for years 6-10  • 6.0% per annum for years 11-15  • 7.5% per annum until maturity\f13\n\n L.R.O. 1998Schedule - (Cont'd)Interest Payment: QuarterlyPrincipal Repayment: The principal of each strip will be repaid in 4 equal quarterly instalments commencing one year prior to the maturity date of that stripPrincipal AllocationPer Strip: 5% of aggregate principal per stripNatural Disaster Clause: YesSeries EFinal Maturity: 30 September, 2043Face Value Reduction: 37.5%Interest Rate: • Issuance through year 3 4%• Years 4-Maturity 8% Interest Payment: Monthly, beginning 30 November, 2018Interest Accrual Begins: 30 September, 2018Principal Repayment: Principal will be repaid in monthly level instalments of principal and interest which will begin on 31 October, 2023 after a 5 year grace period on principalNatural Disaster Clause: Yes\f14\n\n L.R.O. 1998Schedule - (Cont'd)Series FFinal Maturity: 30 September, 2022Interest: NonePrincipal Repayment: Principal will be repaid in 42 equal monthly instalments of principal and interest after a six-month grace periodNatural Disaster Clause: YesSeries GFinal Maturity: Existing Instruments to be exchanged for 35 Series G amortising strips with maturities of 16-50 yearsInterest Rate: • Issuance through year 15 4.0%• Years 16-20 6.0%• Years 21-25 7.5%• Years 26-Maturity 8.0%Interest Capitalization: 100% for ﬁ rst 5 yearsInterest Payment: Quarterly, with ﬁ rst cash payment on 31 October, 2023 Principal Repayment: Each of the 35 strips will be repaid in 4 equal quarterly instalments in the ﬁ nal year prior to maturity commencing 31 October, 2033 with the exception of the ﬁ nal strip, which will be repaid in 3 instalments, with a ﬁ nal payment on 31 July, 2068 Allocation ofAggregatePrincipal AmountAmongst Strips: Equal amountsNatural Disaster Clause: Yes\f15\n\n L.R.O. 1998Schedule - (Cont'd)Series HTerm to Maturity: 5 years 10 years 15 years 20 years 25 yearsAllocation of Aggregate Principal Amount: Each Bond will be issued in the aggregate amount of BDS $82,880,000.00Interest Payment: Quarterly, beginning December, 2018Principal Repayment: Bullet Structure Perpetual RollingInterest Rate: • 5 year Bond 6.0%• 10 year Bond 6.625%• 15 year Bond 7.0%• 20 year Bond 7.75%• 25 year Bond 8.0%Natural Disaster Clause: YesNatural Disaster ClauseThe Exchange Instruments to be issued to institutions as part of the GoB’s exchange offer as Series B, D, E, F, G and H instruments will include a clause that would offer both creditors and the GoB some protection against future debt distress caused by a major natural disaster. This \"natural disaster\" clause would allow for the capitalisation of interest and the deferral ofscheduled amortisations falling due over a two-year period following the occurrence of amajor natural disaster. The trigger for a natural disaster \"event\" would be a payout to theGoB above a predetermined threshold by the Caribbean Catastrophe Risk Insurance Facility(CCRIF), under the GoB’s catastrophe insurance policy.Full details will be provided in the offer letters to holders of the Affected Debt.\f16\n\n L.R.O. 1998Schedule - (Cont'd)EligibilityBanksLiquidity Reserve 15% of Treasury Bills, Treasury Notes and Debentures held as partFund Treasury Bills: of banks' reserve requirements as of 30 September, 2018Series B: 85% of Treasury Bills, Treasury Notes and Debentures held as part of banks' reserve requirements as of 30 September, 2018Series D: All other Loans and Bonds owed by the GoB and Eligible SOEsPast Due and Past due and accrued interest through to 30 September, 2018 to beAccrued Interest: capitalised and added to principal (purchase price of Treasury Bills will be basis for calculation of accrued interest)Non-Eligible SOEs: Government guarantees to be liftedCentral Bank of BarbadosMonetary Policy BDS $207,220,000.00 of Treasury Bills held to facilitate monetaryTreasury Bills: policySeries H: BDS $414,440,000.00 of Treasury Notes and DebenturesNon-Eligible SOEs: Government guarantees to be liftedLife InsurersSeries B: 15% of Treasury Notes and DebenturesSeries D: 85% of Treasury Notes and Debentures and all other Loans and Bonds owed by the GoB and Eligible SOEsPast Due and Past due and accrued interest through to 30 September, 2018 to beAccrued Interest: capitalised and added to principalNon-Eligible SOEs: Government guarantees to be lifted\f17\n\n L.R.O. 1998Schedule - (Cont'd)General InsurersSeries C: 100% of Treasury Bills, Treasury Notes, and DebenturesSeries D: All other Loans and Bonds owed by the GoB and Eligible SOEsPast Due and Past due and accrued interest through to 30 September, 2018 to beAccrued Interest: capitalised and added to principalNon-Eligible SOEs: Government guarantees to be liftedOther Institutions: Group 1Deﬁ nition: Charities, churches, co-operatives, credit unions, trust companiesof \"Other Institutions\" and estates and legaciesSeries B: All Treasury Bills, Treasury Notes, Debentures and Bonds issued by Eligible SOEsPast Due and Past due and accrued interest through to 30 September, 2018 to beAccrued Interest: capitalised and added to principalOther Institutions: Group 2Deﬁ nition: All institutions that are not banks, life or general insurers or classiﬁ edof \"Other Institutions\" under Other Institutions Group 1Series B: All Treasury BillsSeries D: All Treasury Notes, Debentures, Loans and Bonds owed by the GoB and Eligible SOEsPast Due and Past due and accrued interest through to 30 September, 2018 to beAccrued Interest: capitalised and added to principal \f18\n\n L.R.O. 1998Schedule - (Concl'd)EligibilityNational Insurance Scheme (Series E), Eligible Arrears Holders (Series F) and Sagicor Group(Series G)SOE Classiﬁ cationEligible SOEs Barbados Conference Services Limited Barbados Water Authority Barbados Tourism Authority Barbados Transport Board Barbados Industrial Development Corporation Queen Elizabeth Hospital Southern Meats Caribbean Broadcasting Corporation New Life Investment Corporation National Housing Corporation University of West IndiesNOTE: Bullet Bond issued by Needham’s Point (Non-Eligible SOEs) maturing in 2021 to bere-proﬁ led on bespoke terms or exchanged for Series D instruments if no bespoke solutionis agreed with creditors by expiry of the exchange offer\".\f19\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}