{
  "bill_id": 397,
  "slug": "resolution-re-lease-of-crown-lands-at-upton-ch-ch-to-maria-holder-memorial-trust",
  "title": "Resolution re Lease of Crown Lands at Upton Ch Ch. to Maria Holder Memorial Trust",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/429f94c1e0792f2dd800166752fd0e23.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-05-08",
  "first_reading": "2019-05-31",
  "gazette_date": null,
  "markdown": "PARLIAMENT\n\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands\n\n(Vesting and Disposal) Act, Cap. 225 approve the lease to The Maria Holder Memorial Trust,\n\nhereinafter referred to as the Trust, of the parcel of land the property of the Crown situate at\n\nUpton in the parish of Christ Church, more particularly described in the First Schedule to this\n\nResolution on the terms and conditions set out in the Second Schedule to this Resolution for the\n\npurpose of constructing a skatepark for public use.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and nineteen.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and nineteen.\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL  THAT  land  situate  at  Upton  in  the  parish  of  Christ  Church  in  this\n\nIsland  containing  by  admeasurement  9,111.1  square  metres  or  thereabouts Abutting  and\n\nBounding  on  a  drain  on  a  public  road  on  a  lands  of  the  Barbados  Government  (Barbados\n\nHockey Federation Inc.) on a drain or however else the same may abut and bound as shown and\n\ndelineated on a Plan certiﬁ ed on the 27th day of March, 2019 by Samuel N. Taylor, Land Surveyor\n\nand recorded in the Lands and Surveys Department on the 28th day of March, 2019 as Plan No.\n\n368/2019.\n\n\f3\n\nSECOND SCHEDULE\n\nTERMS AND CONDITIONS:\n\nThe 9,111.1 square metres of Crown land shall be leased to the Trust on the following terms\n\nand conditions:\n\n(i)\n\nthe lease to be for a term of twenty (20) years with an option to renew for a\n\nfurther twenty (20) years;\n\n(ii)\n\nthe rent shall be a one-time payment of two hundred dollars ($200.00) plus\n\nValue Added Tax (VAT), payable in advance;\n\n(iii)\n\nthe rent shall be subject to review at the end of the ﬁ rst term;\n\n(iv)\n\nthe premises are being leased for the purpose of construction of a skatepark;\n\n(v)\n\nthe land together with all improvements shall be leased back to Crown;\n\n(vi)\n\nthe lessee shall be responsible for the costs of development of the site;\n\n(vii)\n\nthe lessee shall comply withe requirements of all planning, building, safety and\n\nhealth and related legislation throughout the term;\n\n(viii)\n\nthe lessee shall indemnify the Crown from all actions arising from its use of\n\nthe premises;\n\n(ix)\n\nthe lessee shall not assign, mortgage, demise, underlet or otherwise part with\n\npossession of any part of the demised premises without the landlord's consent;\n\n\f4\n\nSECOND SCHEDULE\n\nTERMS AND CONDITIONS:- (Cont'd)\n\n(x)\n\nthe lessee reserves the right to surrender its lease with improvements thereon at any\n\ntime by giving eight (8) months' notice;\n\n(xi)\n\nthe lease shall terminate on the transfer of the ownership of the skatepark to Crown;\n\n(xii)\n\nthe premises shall revert to the Crown for nil consideration at the end of the lease or\n\nits sooner determination;\n\n(xiii)\n\nthe lessee shall not use, permit or suffer the demised premise or any part thereof to\n\nbe used for any purpose other than a skatepark.\n\nThe leaseback of the 9,111.1 square metres of land with the constructed and developed skatepark\n\nfrom the Trust to the Crown shall be on the following terms and conditions:\n\n(i)\n\nthe lease to be for a term of twenty (20) years less one day with an option to renew\n\nfor a further twenty (20) years less one day;\n\n(ii)\n\nthe rent shall be ﬁ fteen hundred dollars ($1,500.00) plus Value Added Tax (VAT),\n\npayable in advance;\n\n(iii)\n\nthe Crown as lessee shall be responsible for keeping the demised premises insured\n\nunder a comprehensive policy in the joint names of the Crown and the Trust;\n\n(iv)\n\n(v)\n\nthe lessee shall keep the interior and exterior of the premises, inclusive of drains,\nsanitary and water apparatus, gates, fences etc. in good and tenantable repair;\n\nthe  Trust  to  be  responsible  for  the  repair  of  any  latent  defect  in  structure  of  the\npremises or repairs arising therefrom;\n\n\f5\n\nSECOND SCHEDULE\n\nTERMS AND CONDITIONS:- (Concl'd)\n\n(vi)\n\nthe lessee shall not carry out any additions or extensions to the premises without the approval\n\nof the lessor;\n\n(vii)\n\nthe  lessee  shall  use  the  premises  as  a  skatepark  and  for  ancillary  sporting  purposes,  unless\n\nwritten consent by the lessor is given to do otherwise;\n\n(viii)\n\nthe lessee shall not assign, sublet, or further lease any part of the demised premises;\n\n(ix)\n\nthe Crown as lessee shall permit, the Trust as lessor or its authorised Agent, with two (2) days'\n\nwritten notice, to inspect the premises, and thereafter give the lessee in writing a list of any\n\nrepairs, maintenance and replacements to be done and require said lessee to execute said repairs\n\nwithin twenty-one (21) days.  If unable to do so, the Lessor will execute such repairs and costs\n\nthereof will be treated as a debt to the lesssor as additional rent and is to be settled within two\n\n(2) months of the date of the lessor's invoice for the work undertaken;\n\n(x)\n\nthe lessee through the occupying agent shall be responsible for maintaining Public Liability\n\nInsurance of not less than two million dollars ($2,000,000.00), subject to an annual review by\n\nthe lessor's brokers and indemnify the lessor in the event of any liability;\n\n(xi)\n\nthe Crown through the occupying agency to be responsible for all outgoings arising from the\n\nuse of the site a skatepark;\n\n(xii)\n\nthe Crown is bound to give eight (8) months' notice should it wish to terminate the lease before\nits expiry date;\n\n(xiii)\n\nthe Crown, through the occupying agency shall be responsible for the maintenance and upkeep\nof the premises.\n\n\f6\n\nADDENDUM\n\nOn  the  4th  day  of April,  2019  the  Cabinet  agreed  to  the  lease  of  the  parcel  of  land\n\ndescribed in the First Schedule to this Resolution , situate at Upton, in the parish of Christ Church\n\nin this Island for a skatepark on the terms and conditions speciﬁ ed in the Second Schedule to\n\nthis Resolution.\n\nThe development of the skatepark will be ﬁ nanced by The Maria Holder Memorial Trust.\n\nThe Trust will also construct, lease, maintain and transfer the skatepark to the Crown at the end\n\nof the lease period.\n\nIn  accordance  with  section  5  of  the  Crown  Lands  (Vesting  and  Disposal)  Act,\n\nCap. 225, the approval of Parliament is now sought for the lease to The Maria Holder Trust of\n\nparcel of land described in the First Schedule for a term of twenty (20) years on the terms and\n\nconditions speciﬁ ed in the Second Schedule to this Resolution.\n\n"
}