{
  "bill_id": 398,
  "slug": "resolution-re-compulsory-acquisition-by-the-crown-of-land-at-lower-bay-street-st-michael",
  "title": "Resolution re  Compulsory  Acquisition by the Crown of land at Lower Bay Street, St Michael",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/4db7f9bc8f61dd434bb6a6e55779515f.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-05-14",
  "first_reading": "2019-05-15",
  "gazette_date": null,
  "markdown": "                                                                                                                                2019-05-10\n\nPARLIAMENT\n\nRESOLVED  that  Parliament,  in  accordance  with  section  5  of  the  Land\n\nAcquisition  Act,  Cap.  228  approve  the  compulsory  acquisition  by  the  Crown  of  the  parcel  of\n\nland situate at Lower Bay Street in the parish of Saint Michael in this Island more particularly\n\ndescribed  in  the  Schedule  hereto  for  the  public  purpose,  namely  tourism  development.\n\nAPPROVED by the House of Assembly this            day of                               , Two\n\nThousand and Nineteen.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                          , Two\n\nThousand and Nineteen.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  the  property  of  Tiny  Tots  Limited  situate  at  Bay  Street  in  the\n\nparish of Saint Michael in this Island containing by admeasurement 7328.3 square metres (inclusive\n\nof 158.4 square metres in road and 3831.3 square metres in beach) Abutting and Bounding on\n\nlands  now  or  formerly  of  Vision  Developments  Inc.  on  the  sea  on  lands  now  or  formerly  of\n\nM. G. Tucker and Co. Ltd., and on a public road known as Bay Street leading to Chamberlain\n\nBridge in one direction and to Wellington Street in the other direction or however else the same\n\nmay  abut  and  bound  together  with  the  buildings  thereon,  as  shown  and  delineated  on  a  Plan\n\ncertiﬁ ed  on  the  10th  day  of  May,  2019  by Anderson  R. Alleyne,  Land  Surveyor    and  recorded\n\nin  the  Lands  and  Surveys  Department  on  the  10th  day  of  May,  2019  as  Plan  No.  575/2019.\n\n\f3\n\nADDENDUM\n\nThe  Cabinet  at  its  meeting  held  on  the  14th  day  of  February,  2019  agreed  to\n\nthe  acquisition  of  a  parcel  of  land  measuring  approximately  7328.3  square  metres,  situate\n\nat  Lower  Bay  Street  in  the  parish  of  Saint  Michael  in  this  Island  and  more  particularly\n\ndescribed  in  the  Schedule  to  this  Resolution  for  the  public  purpose  of  tourism  development.\n\nIn  accordance  with  the  provisions  of  section  5  of  the  Land  Acquisition  Act,\n\nCap.  228,  the  approval  of  the  Parliament  is  now  sought  for  the  compulsory  acquisition  of  the\n\nparcel of land described in the Schedule to this Resolution in order that the public purpose set out\n\nin the Resolution may be effected and that the Crown may acquire an indefeasible title to the said parcel\n\nof land.\n\n"
}