{
  "bill_id": 399,
  "slug": "resolution-re-vesting-in-barbados-tourism-investment-inc-lands-at-bay-street-st-michael",
  "title": "Resolution re Vesting in Barbados  Tourism Investment Inc. lands at  Bay Street, St Michael",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/39c228f2ce16c2b5116bb21c63da1389.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-05-14",
  "first_reading": "2019-05-31",
  "gazette_date": null,
  "markdown": "                                                                                                                                2019-05-10\n\nPARLIAMENT\n\nRESOLVED  that  Parliament,  in  accordance  with  section  5  of  the  Crown\n\nLands  (Vesting  and  Disposal)  Act,  Cap.  225  approve  the  vesting  in  the  Barbados\n\nTourism  Investment  Inc.  of  the  parcels  of  land,  the  property  of  the  Crown,  situate\n\nin  Bay  Street  in  the  parish  of  Saint  Michael  in  this  Island  more  particularly  described\n\nin the Schedules hereto for the public purpose of Tourism development.\n\nAPPROVED by the House of Assembly this            day of                               , Two\n\nThousand and Nineteen.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                          , Two\n\nThousand and Nineteen.\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL THAT land the property of the Crown situate at Bay Street in the parish of Saint\n\nMichael in this Island containing by admeasurement 69.0 square metres or thereabouts (being the\n\narea in public drain) Abutting and Bounding on lands now or formerly of the Barbados Tourism\n\nInvestment Inc. on lands now or formerly of the Barbados Government on lands now or formerly\n\nof  Vision  Developments  Inc.  and  on  a  public  road  known  as  Bay  Street  leading  to  Probyn\n\nStreet  in  one  direction  and  to  Wellington  Street  in  the  other  direction  or  however  else\n\nthe  same  may  abut  and  bound  as  shown  and  delineated  on  a  Plan  certified  on  the  13th\n\nday  of  November,  2017  by  Camille  Belgrave,  Land  Surveyor  and  recorded  in  the  Lands\n\nand  Surveys  Department  on  the  15th  day  of  November,  2017  as  Plan  No.  1104/2017.\n\n\f3\n\nSECOND SCHEDULE\n\nALL THAT land the property of the Crown situate at Bay Street in the parish of\n\nSaint  Michael  in  this  Island  containing  by  admeasurement  509.5  square  metres  or  thereabouts\n\n(inclusive of 22.8 square metres in pavement) Abutting and Bounding on lands now or formerly\n\nof the Wesleyan Missionary Trust Association (Bethel Methodist Church) on a pavement which\n\nforms part of the public road known as Bay Street leading to Wellington Street in one direction\n\nand  to  Probyn  Street  in  the  other  direction  or  however  else  the  same  may  abut  and  bound  as\n\nshown and delineated on a Plan certiﬁ ed on the 9th day of September, 2015 by Camille Belgrave,\n\nLand  Surveyor  and  recorded  in  the  Lands  and  Surveys  Department  on  the  22nd  day  of\n\nSeptember, 2015 as Plan No. 890/2015.\n\n\f4\n\nADDENDUM\n\nThe Cabinet at its meeting held on the 11th day of May, 2017 agreed to the vesting of\n\ntwo  (2)  parcels  of  land  the  property  of  the  Crown  containing  by  admeasurement  69.0  square\n\nmetres  and  509.5  square  metres  or  thereabouts  (inclusive  of  22.8  square  metres  in\n\npavement)  situate  at  Bay  Street  in  the  parish  of  Saint  Michael  in  this  Island  being\n\nan  amalgamated  area  of  578.5  square  metres  or  thereabouts  situate  at  Bay  Street  in\n\nthe  parish  of  Saint  Michael  in  this  Island  in  the  Barbados  Tourism  Investment  Inc.\n\nThe  parcels  of  land  more  particularly  described  in  the  Schedules  to  this\n\nResolution were acquired by the Crown by a deed of conveyance dated the 20th day of January,\n\n1999  and  recorded  in  the  Land  Registry  of  Barbados  on  the  24th  day  of  September,  1999\n\nas Deed No. 5820/1999.\n\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and\n\nDisposal) Act, Cap. 225, the approval of Parliament is now sought for the vesting in the Barbados\n\nTourism  Investment  Inc.  of  the  parcels  of  land  more  particularly  described  in  the\n\nSchedules to this Resolution.\n\n"
}