{
  "bill_id": 400,
  "slug": "public-service-retrenched-workers-bill-2019",
  "title": "Public Service (Retrenched  Workers) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/d7fe2f59dd876417ccd4ef9c3c98dd04.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-05-15",
  "first_reading": "2019-05-15",
  "gazette_date": null,
  "markdown": "2019-05-14\n\nOBJECTS AND REASONS\n\nThis Bill would make provision for the payment of gratuity and pension to 84\npublic  officers  who  were  employed  in  the  Ministry  of  Transport,  Works  and\nMaintenance  and  who  were  retrenched  from  the  Public  Service  on  the  19th\nOctober, 2018.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nGratuity and Pension\n\nMinister may make order\n\nOfficers not entitled to other retiring allowances or benefits\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to authorise the payment of gratuity and pension to 84 public officers\nwho were employed in the Ministry of Transport, Works and Maintenance and\nwho were retrenched from the Public Service on the 19th October, 2018.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n2019.\n\nThis Act may be cited as the Public Service (Retrenched Workers) Act,\n\nGratuity and Pension\n\nThe Accountant General is hereby authorised and required to make\n2.(1)\npayment of gratuity and pension out of the Consolidated Fund in respect of the\nPublic  Service  of  84  public  officers  who  were  employed  in  the  Ministry  of\nTransport, Works and Maintenance and who were retrenched on the 19th October,\n2018.\n\nThe reduced pensions due to the persons referred to in subsection (1) shall\n(2)\nbe  payable  upon  they  attaining  the  age  of  60  years  in  accordance  with  the\nprovisions of the Pensions Act, Cap. 25.\n\nMinister may make order\n\nThe Minister may by order specify the public officers referred to in\n3.\nsection  2(1)  and  the  gratuity  to  be  paid  in  respect  of  each  public  officer  so\nspecified.\n\nOfficers not entitled to other retiring allowances or benefits\n\nThe payments authorised and required to be made under section 2 and\n4.\nstated in an order made pursuant to section 3 shall be in full satisfaction of the\nliability of the Crown for the payment of retiring allowances and benefits under\nthe  Pensions  Act,  Cap.  25,  or  any  other  enactment  under  which  any  person\nmentioned in the order was entitled to be paid for his public service.\n\n\f5\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}