{
  "bill_id": 403,
  "slug": "customs-amendment-no-2-bill-2019",
  "title": "Customs (Amendment) (No. 2) Bill,  2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/85cc4214e5bd048db9127e88619ab754.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-06-05",
  "first_reading": "2019-05-31",
  "gazette_date": "2019-06-24",
  "markdown": "2019-06-04\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Customs Act, Cap. 66 to strengthen Barbados Anti-\n\nMoney Laundering and Financing of Terrorism regime.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 66\n\nInsertion of new section 4A into Cap. 66\n\nInsertion of new sections 209A and 209B into Cap. 66\n\nRepeal and replacement of section 242 of Cap. 66\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Customs Act, Cap. 66.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2019.\n\nThis  Act  may  be  cited  as  the  Customs  (Amendment)  (No.  2)  Act,\n\n\f4\n\nAmendment of section 2 of Cap. 66\n\n2.\nprincipal Act is amended\n\nSection 2 of the Customs Act, Cap. 66 in this Act referred to as the\n\n(a)\n\nby inserting in alphabetical order, the following:\n\n“  “bearer negotiable instruments”  includes\n\n(a)\n\n(b)\n\n(c)\n\nmonetary  instruments  in  bearer  form  such  as  traveller’s\ncheques;\n\nnegotiable instruments (such as cheques, promissory notes\nand money orders) that are either in bearer form, endorsed\nwithout restriction, made out to a fictitious payee or otherwise\nin such form that title thereto passes upon delivery;\n\nincomplete instruments (such as cheques, promissory notes\nand money orders) signed, but with the payee’s name omitted\nor with the date or other vital information missing;”; and\n\n(b)\n\nby deleting the definition of “goods” and substituting the following:\n\n“    “goods”    includes  any  tangible  and  personal  property  such  as\nlivestock, stores, baggage, documents in physical and electronic\nform,  currency,  mail,  bearer  negotiable  instruments,  packets\nimported  by  post,  prohibited  or  restricted  goods,  aircraft  and\nvessels.”.\n\nInsertion of new section 4A into Cap. 66\n\n3.\n4 the following new section:\n\nThe principal Act is amended by inserting immediately after section\n\n\f5\n\n“Confidentiality\n\n4A.(1)\nEvery person having an official duty under this Act or being\nemployed in the administration of this Act shall regard as secret and\nconfidential all documents and information relating\n\n(a)\n\nto the valuation or assessment of customs duties in respect of\nimported goods; or\n\n(b)\n\nto the mitigation of a penalty.\n\nA  person  exercising  power  under  this  Act  or  in  relation  to  an\n(2)\nassigned  matter  shall  not  communicate  to  any  unauthorised  person,\neither directly or indirectly, any information or document obtained\n\n(a)\n\n(b)\n\nin the exercise of any power under this Act; or\n\nin relation to an assigned matter.\n\nA  person  exercising  power  under  this  Act  or  in  relation  to  an\n(3)\nassigned  matter  who,  having  possession  of  or  control  over  any\ninformation or document obtained as described in subsection (2),\n\n(a)\n\n(b)\n\ncommunicates  such  information  or  anything  contained  in\nsuch document to an unauthorised person; or\n\npermits  an  unauthorised  person  to  have  access  to  the\ndocument or information\n\nis guilty of an offence and is liable on summary conviction to a fine of\n$10 000.\n\nNothing contained in subsection (3) prevents the disclosure of\n(4)\nany document or information where that disclosure is authorised by the\nComptroller in accordance with subsection (5).\n\nThe Comptroller may disclose or authorise the disclosure of any\n(5)\ninformation  or  document  pursuant  to  any  law,  treaty,  agreement  or\n\n\f6\n\narrangement concluded by the Crown for the purpose of administering\nany customs enactment.\n\nThe information or document that may be disclosed pursuant to\n\n(6)\nsubsection (5) includes information about\n\n(a)\n\n(b)\n\n(c)\n\nthe  movement  of  any  vessel,  aircraft  or  vehicle  and  the\npassenger and crew lists in respect of that vessel, aircraft or\nvehicle;\n\npast travel movements, general history and modus operandi\nof specified people;\n\ncurrency  and  documents  relating  to  relevant  financial\ntransactions including money laundering or other unlawful\nconduct or activities related to terrorism;\n\n(d)\n\nintelligence analysis, assessments and reports; and\n\n(e)\n\nthe  details  of  persons  who  are  known  or  suspected  to  be\ninvolved in unlawful conduct.”.\n\nInsertion of new sections 209A and 209B into Cap. 66\n\n4.\n209 the following new sections:\n\nThe principal Act is amended by inserting immediately after section\n\n“Retention of documents and goods obtained during a search\n\n209A.(1)\nWhere  a  proper  officer  carries  out  any  lawful  search,\ninspection,  audit  or  examination  under  this  Act,  and  has  reasonable\ncause to suspect that documents or goods coming into his possession\nduring the search, inspection, audit or examination\n\n(a)\n\nare evidence of the commission of an offence under this Act;\n\n\f7\n\n(b)\n\n(c)\n\n(d)\n\nare  intended  to  be  used  for  the  purpose  of  committing  an\noffence under this Act;\n\nare property obtained through unlawful conduct; or\n\nare  intended  to  be  used  for  money  laundering  or  other\nunlawful conduct or activities related to terrorism,\n\nthe officer may, subject to subsection (4), take possession of and retain\nthe documents or goods.\n\nWhere  a  proper  officer  takes  possession  of  a  document  under\n(2)\nsubsection (1), he shall, at the request of the person otherwise entitled\nto  the  document,  provide  that  person  with  a  copy  of  the  document\ncertified under the seal of the Customs and Excise Department as a true\ncopy.\n\nNotwithstanding any other law, a copy certified in accordance\n(3)\nwith subsection (2) is admissible in evidence in a court as if the copy\nwere the original document.\n\nWhere a proper officer takes possession of and retains documents\n\n(4)\nor goods under this section\n\n(a)\n\nas a result of an offence being committed in respect of the\ndocuments or goods, the court may order, either at the hearing\nor on a subsequent application, that the documents or goods\n\n(i)\n\n(ii)\n\nbe delivered to the person appearing to the court to be\nentitled to them; or\n\nbe otherwise disposed of in such manner and under such\nconditions as the court thinks fit; and\n\n(b)\n\nthe proper officer may at any time, unless an order has been\nmade under paragraph (a)\n\n(i)\n\nreturn the documents or goods to the person from whom\nthey were taken; or\n\n\f8\n\n(ii)\n\napply to a magistrate for an order as to their disposal, and\non  any  such  application  the  magistrate  may  issue  an\norder that a court may issue under paragraph (a).\n\n(5)\nWhere proceedings for an offence relating to the documents or\ngoods retained under this section are not brought within a period of 6\nmonths after the date on which the proper officer took possession of the\ndocuments or goods, a person claiming to be entitled to the documents\nor goods may, after the expiration of that period, apply to a magistrate\nfor  an  order  that  they  be  delivered  to  that  person,  and  on  any  such\napplication the magistrate may\n\n(a)\n\n(b)\n\nrefuse to issue the order; or\n\nmake an order that a court may make under subsection (4)\n(a).\n\nDetention of goods\n\n209B.(1)\ngoods where\n\nA customs officer may, without warrant, seize and detain\n\n(a)\n\nthe goods are in Barbados and he is satisfied that they either\n\n(i)\n\nare being or are intended to be, exported from Barbados;\nor\n\n(ii)\n\nare being, or have been imported into Barbados;\n\n(b)\n\nthe goods came to his attention, or into his possession during\na search, inspection, audit or examination under this Act or\nany Act that relates to the reporting of imports or exports of\ncurrency; and\n\n(c)\n\nhe  has  reasonable  grounds  to  suspect  that  the  goods  were\nobtained in contravention of any law.\n\nReasonable force may be used by a customs officer where it is\n\n(2)\nnecessary to seize and detain goods under this section.\n\n\f9\n\n(3)\nWhere the person from whom the goods have been seized and\ndetained is identified but is not present when the seizure and detention\noccurs, the Comptroller shall notify that person of the detention and\nseizure and issue a receipt.\n\nGoods detained under this section shall be taken to a place of\n\n(4)\nsecurity as directed by the customs officer.”.\n\nRepeal and replacement of section 242 of Cap. 66\n\n5.\nsubstituted:\n\nSection  242  of  the  principal  Act  is  deleted  and  the  following\n\n“Comptroller may prescribe forms\n\n242.(1)\nSubject  to  this  Act,  the  Comptroller  may  prescribe  forms\nrequired  to  be  used  for  the  purposes  of  implementing  any  customs\nenactment and any forms so prescribed shall be published in the Official\nGazette one month before the forms are required to be used.\n\n(2)\n\nEvery importer and exporter shall use the appropriate forms.\n\n(3)\nEvery document submitted to the Comptroller or a proper officer\nfor the purposes of any customs enactment shall be in such form and\nshall contain the particulars as may be prescribed by the Comptroller.\n\n(4)\n\nUnless otherwise required by the Comptroller\n\n(a)\n\n(b)\n\na document submitted under this section may be in electronic\nform; and\n\nthe document referred to in paragraph (a) shall serve as a legal\ndocument.\n\nThe Electronic Transactions Act, 2014 (Act 2014-8) shall apply\n\n(5)\nmutatis mutandis.”.\n\n\f10\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}