{
  "bill_id": 404,
  "slug": "antiterrorism-amendment-act-2019-final",
  "title": "Anti-Terrorism (Amendment) Act,  2019 (Final)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/eaecfe49041779edec74dc00727a3773.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-06-05",
  "first_reading": "2019-05-21",
  "gazette_date": "2019-05-24",
  "markdown": "2019-06-04\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Anti-Terrorism  Act,  Cap.  158  and  alter  the\nConstitution to the extent necessary to give effect to certain provisions of that\nAct.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nRepeal and replacement of long title of Cap. 158\n\nRepeal and replacement of section 1 of Cap. 158\n\nAmendment of section 2 of Cap. 158\n\nAmendment of section 3 of Cap. 158\n\nAmendment of section 3A of Cap. 158\n\nRepeal and replacement of section 4 of Cap. 158\n\nRepeal and replacement of Part IV of Cap. 158\n\nInsertion of section 12A into Cap. 158\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nRepeal and replacement of section 15 of Cap. 158\n\n11.\n\nInsertion of new Schedule into Cap. 158\n\n12.\n\nConsequential amendments\n\n\f3\n\nFIRST SCHEDULE\n\nStates and Related State Actors\n\nSECOND SCHEDULE\n\nConsequential Amendments\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Anti-Terrorism Act and to alter the Constitution to the\n\nextent necessary to give effect to certain provisions of that Act.\n\nENACTED by the Parliament of Barbados in accordance with section 49 of\n\nthe Constitution as follows:\n\n\f6\n\nShort title\n\n1.\n\nThis Act may be cited as the Anti-Terrorism (Amendment) Act, 2019.\n\nRepeal and replacement of long title of Cap. 158\n\n2.\nreferred to as the principal Act, is deleted and the following substituted:\n\nThe  long  title  to  the  Anti-Terrorism  Act,  Cap.  158,  in  this  Act\n\n“An Act to\n\n(a)\n\n(b)\n\nimplement  the  United  Nations  Convention  respecting  the\nSuppression  of  the  Financing  of  Terrorism  and  United\nNations Security Council Resolutions relating to terrorism,\nand  provide  generally  for  preventing  and  combatting\nterrorism and its financing;\n\nimplement  United  Nations  Security  Council  Resolutions\nrelating to the prevention, suppression and disruption of the\nproliferation of weapons of mass destruction and its financing\nand  provide  generally  for  preventing,  suppressing  and\ndisrupting the proliferation of weapons of mass destruction\nand its financing; and\n\n(c)\n\nalter section 16 of the Constitution to any extent necessary\nfor such implementation,\n\nand provide for related matters.”.\n\nRepeal and replacement of section 1 of Cap. 158\n\n3.\nsubstituted:\n\nSection  1  of  the  principal  Act  is  repealed  and  the  following\n\n\f7\n\n“Short title\n\n1.\nProliferation of Weapons of Mass Destruction Act.”.\n\nThis Act may be cited as the Anti-Terrorism and Counter-\n\nAmendment of section 2 of Cap. 158\n\n4.\n\nSection 2 of the principal Act is amended\n\n(a)\n\nby inserting in alphabetical order, the following definitions:\n\n“ “counter-proliferation order” means an order of the Court declaring\n\na person to be a listed person;\n\n“financial institution” has the meaning assigned to it by section 2 of the\nMoney Laundering and Financing of Terrorism (Prevention and\nControl) Act, 2011 (Act 2011-23);\n\n“financial  services”  includes  the  services  described  in  the  First\nSchedule to the Money Laundering and Financing of Terrorism\n(Prevention and Control) Act, 2011 (Act 2011-23);\n\n“listed person” has the meaning assigned to it by section 10A;\n\n“non-financial  business  entity  or  professional”  has  the  meaning\nassigned to it by section 2 of the Money Laundering and Financing\nof Terrorism (Prevention and Control) Act, 2011 (Act 2011-23);\n\n“property” includes funds, whether situated in Barbados or elsewhere,\nand  any  legal  or  equitable  interest,  whether  full  or  partial,  in\nproperty;\n\n“related State actor” has the meaning assigned to it by section 10A;\n\n“restraining order” has the meaning assigned to it by section 2 of the\nInstrumentalities  of  Crime  Act,  2019\n\nProceeds  and\n(Act 2019-17);\n\n\f8\n\n“vessel”  has  the  meaning  assigned  to  it  by  section  46  of  the\n\nInterpretation Act, Cap. 1.”;\n\n(b)\n\n(c)\n\nin  the  definition  of  “funds”,  by  deleting  the  word  “as”  and\nsubstituting the word “including”; and\n\nin the definition of “terrorist designation order” by deleting the full-\nstop and substituting a semi-colon.\n\nAmendment of section 3 of Cap. 158\n\n5.\n\nSection 3 of the principal Act is amended\n\n(a)\n\nin subsection (1)\n\n(i)\n\nby inserting after the word “indictment”, the words “is liable to\nimprisonment for life.”; and\n\n(ii)\n\nby deleting paragraphs (c) and (d); and\n\n(b)\n\nby deleting subsection (3).\n\nAmendment of section 3A of Cap. 158\n\n6.\n“25” and substituting the word “30”.\n\nSection 3A(1) of the principal Act is amended by deleting the word\n\nRepeal and replacement of section 4 of Cap. 158\n\n7.\nsubstituted:\n\nSection  4  of  the  principal  Act  is  repealed  and  the  following\n\n“Providing or collecting funds for the purpose of terrorism\n\n4.(1)\nA person who in or outside Barbados directly or indirectly,\nunlawfully and wilfully, provides or collects funds or provides financial\nservices or makes such services available to persons, in any case, with\n\n\f9\n\nthe  intention  that  the  funds  or  services  are  to  be  used,  or  with  the\nknowledge that the funds or services are to be used, in full or in part\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nin order to carry out an act described in section 3(1);\n\nfor the travel of an individual to a State other than his State\nof  nationality  or  residence  for  the  purpose  of  committing,\nplanning, preparing for, or participating in, an act described\nin  section  3(1)  or  of  providing  or  receiving  training  in\ncommitting, planning, preparing for, or participating in such\nan act;\n\nby a person in respect of whom a terrorist designation order\nor counter-proliferation order is in force; or\n\nby a related State actor in association with any act, plot, threat\nor programme connected with the proliferation of weapons\nof mass destruction,\n\nis  guilty  of  an  offence  and  is  liable  on  conviction  on  indictment  to\nimprisonment for a term of 30 years.\n\nFor an act to constitute an offence under subsection (1), it is not\n(2)\nnecessary to prove that the funds or the financial services were actually\nused to carry out the offence.\n\n(3)\n\nA person who\n\n(a)\n\n(b)\n\naids,  abets,  counsels,  procures,  incites  or  solicits  the\ncommission of an offence; or\n\nconspires with another or others to commit an offence under\nsubsection  (1),  is  liable  on  conviction  on  indictment  to  be\npunished as a principal offender under that subsection.\n\nFor  the  avoidance  of  doubt,  a  person  does  not  contravene\n(4)\nsubsection (1)(c) or (d) where he acts in accordance with a restraining\norder.”.\n\n\f10\n\nRepeal and replacement of Part IV of Cap. 158\n\n8.\n\nPart IV of the principal Act is repealed and the following substituted:\n\n“PART IV\n\nDESIGNATION OF PERSONS AS TERRORISTS AND\nTERRORIST ENTITIES\n\nDesignation of terrorists and terrorist entities\n\nThe Director of Public Prosecutions may apply to a judge in\n8.(1)\nChambers for an order designating a person as a terrorist or terrorist\nentity, as the case may be, where\n\n(a)\n\n(b)\n\n(c)\n\nthe  person  is  included  in  a  list  of  individuals  and  entities\ndesignated by, or under the authority of, the United Nations\nSecurity Council as terrorists or terrorist entities;\n\nthe Director of Public Prosecutions has reasonable grounds\nto believe that the person has committed or participated in the\ncommission of an offence referred to in section 3, 3A or 4;\nor\n\na request to designate a person as a terrorist or terrorist entity\nis transmitted to Barbados from another country, is supported\nby reasonable grounds for the designation and is accepted by\nBarbados.\n\n(2)\n\nAn application for a terrorist designation order shall be\n\n(a)\n\n(b)\n\nmade without delay and without notice; and\n\nsupported  by  affidavit  deposing  to  the  matters  set  out  in\nsubsection (1)(a) or (b), as the case may be.\n\n\f11\n\n(3)\nWhere the Director of Public Prosecutions applies for a terrorist\ndesignation order, he shall at the same time apply to the judge for a\nrestraining order to\n\n(a)\n\nfreeze any\n\n(i)\n\n(ii)\n\n(iii)\n\nproperty  of  the  person  against  whom  the  terrorist\ndesignation order is made;\n\nproperty that is wholly or jointly owned or controlled,\ndirectly or indirectly, by the person against whom the\nterrorist designation order is made;\n\nproperty  that  is  derived  or  generated  from  other\nproperty owned or controlled, directly or indirectly, by\nthe person against whom the terrorist designation order\nis made;\n\n(iv)\n\nproperty  of  a  person  acting  on  behalf  of,  or  at  the\ndirection  of,  the  person  against  whom  the  terrorist\ndesignation order is made,\n\nwhere such property is situated in Barbados; and\n\n(b)\n\nprohibit  the  person  against  whom  the  terrorist  designation\norder  is  made,  directly  or  indirectly,  from  possessing,\ncontrolling or having access to any property.\n\n(4)\n\nThe judge shall without delay\n\n(a)\n\n(b)\n\nmake the terrorist designation order against the person where\nhe is satisfied of the circumstances set out in subsection (1)\n(a) or (b) in relation to the person; and\n\nwhere  he  makes  the  terrorist  designation  order,  make,  in\naccordance with the Proceeds and Instrumentalities of Crime\nAct,  2019  (Act  2019-17),  a  restraining  order,  where  the\nrequirements for the making of the restraining order under\nthat Act are satisfied.\n\n\f12\n\n(5)\nA person against whom a terrorist designation order is made may,\nwithin 60 days of the making of the order, appeal to the Court of Appeal\nagainst the decision of the judge and shall give the Director of Public\nProsecutions at least 14 days’ notice of the application.\n\nThe Director of Public Prosecutions may, within 30 days of the\n(6)\ndecision of a judge not to make a terrorist designation order against a\nperson, appeal to the Court of Appeal against the decision and shall give\nsuch notice to the person as the court may require.\n\n(7)\n\nThe Court of Appeal shall, upon an appeal under this section\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nhear any evidence or other information that may be presented\nby the Director of Public Prosecutions and may, at the request\nof the Director of Public Prosecutions, hear all or part of that\nevidence  or  information  in  the  absence  of  the  person\nconcerned  or  any  attorney-at-law  representing  the  person,\nwhere the court is of the opinion that the disclosure of the\nevidence  or  information  would  be  prejudicial  to  national\nsecurity or endanger the safety of any person;\n\nprovide the person concerned with a statement summarizing\nthe evidence or information available to the court in order to\nreasonably inform the person of the reasons for the making\nof  the  terrorist  designation  order,  without  disclosing  any\nevidence or information the disclosure of which would, in the\nopinion  of  the  court,  be  prejudicial  to  national  security  or\nendanger the safety of any person;\n\nprovide the person concerned with a reasonable opportunity\nto be heard; and\n\ndirect  the  judge  to  make,  confirm,  vary  or  set  aside  the\nterrorist designation order, as the court considers appropriate.\n\nNotwithstanding anything to the contrary in the Evidence Act,\n(8)\nCap. 121, evidence shall not be excluded on the ground that it is hearsay,\n\n\f13\n\nof whatever degree, in proceedings for a terrorist designation order or\non an appeal under this section.\n\nReview of terrorist designation orders\n\n9.(1)\nThe Director of Public Prosecutions shall every 6 months\nreview every terrorist designation order made under section 8 in order\nto  determine  whether  the  circumstances  referred  to  in  section  8(l)\ncontinue to exist in respect of the person against whom the order was\nmade.\n\nWhere pursuant to a review referred to in subsection (1) or from\n(2)\ninformation the Director of Public Prosecutions otherwise receives, he\ndetermines that the circumstances which led to a terrorist designation\norder being made against a person have changed or no longer exist, the\nDirector of Public Prosecutions shall, in a timely manner, apply to a\njudge  in  Chambers  for  the  variation  or  setting  aside,  as  may  be\nappropriate, of\n\n(a)\n\n(b)\n\nthe terrorist designation order; and\n\nany  restraining  order  made  in  relation  to  the  terrorist\ndesignation order,\n\nand the judge may make such further orders as he thinks fit.\n\n(3)\nWithout prejudice to the generality of subsection (2), the judge\nshall, where he is satisfied that the circumstances which led to a terrorist\ndesignation order being made against a person no longer exist, set aside\nthe terrorist designation order and the restraining order.\n\nPublication of terrorism designation orders etc.\n\nThe  Director  of  Public  Prosecutions  shall,  where  a  judge\n10.(1)\nmakes, confirms, varies or sets aside a terrorism designation order or a\nrelated restraining order, cause notice of the decision to be published\n\n(a)\n\nelectronically immediately; and\n\n\f14\n\n(b)\n\nin  the  Official  Gazette  and  at  least  2  daily  newspapers  in\ncirculation in Barbados, as soon as possible.\n\n(2)\nA  notice  referred  to  in  subsection  (1)  shall  contain  sufficient\nparticulars to enable any person, including any financial institution and\nnon-financial business entity or professional, who may be affected by\nthe decision to be reliably and adequately informed of the decision.\n\nPART IVA\n\nCOUNTER-PROLIFERATION MEASURES\n\nInterpretation of certain terms in Part IVA\n\n10A.(1)\n\nFor the purposes of this Part,\n\n“listed person” means an individual, entity or vessel included in a list\nestablished  by,  or  under  the  authority  of,  the  United  Nations\nSecurity Council as a list of individuals, entities or vessels against\nwhich measures for the prevention, suppression and disruption of\nthe proliferation of weapons of mass destruction and its financing\nare required to be taken;\n\n“related State actor” means an individual, entity or government which\n\n(a)\n\n(b)\n\nis  connected  with  a  State  listed  in  Column  1  of  the  Third\nSchedule;\n\nhas been identified by or under the authority of the United\nNations  Security  Council  as  an  individual,  entity  or\ngovernment  against  which  measures  for  the  prevention,\nsuppression and disruption of the proliferation of weapons of\nmass destruction and its financing are required to be taken;\nand\n\n(c)\n\nis listed in Column 2 of the Third Schedule.\n\n\f15\n\n(2)\n\nThe Minister may by Order amend the Third Schedule.\n\nMaking counter-proliferation orders in respect of listed\npersons\n\n10B.(1)\nThe Director of Public Prosecutions may apply to a judge in\nChambers for a counter-proliferation order against a person where the\nperson is a listed person.\n\n(2)\n\nAn application for a counter-proliferation order shall be\n\n(a)\n\n(b)\n\nmade without delay and without notice; and\n\nsupported  by  affidavit  deposing  to  the  matters  set  out  in\nsubsection (1).\n\nWhere the Director of Public Prosecutions applies for a counter-\n(3)\nproliferation order, he shall at the same time apply to the judge for a\nrestraining order to\n\n(a)\n\nfreeze any\n\n(i)\n\n(ii)\n\n(iii)\n\nproperty of the listed person;\n\nproperty that is wholly or jointly owned or controlled,\ndirectly or indirectly, by the listed person;\n\nproperty that is derived or generated from property or\nother assets owned or controlled, directly or indirectly,\nby the listed person;\n\n(iv)\n\nproperty  of  a  person  acting  on  behalf  of,  or  at  the\ndirection of, the listed person,\n\nwhere such property is situated in Barbados; and\n\n(b)\n\nprohibit  the  listed  person,  directly  or  indirectly,  from\npossessing, controlling or having access to any property.\n\n\f16\n\n(4)\n\nThe judge shall without delay\n\n(a)\n\n(b)\n\nmake  the  counter-proliferation  order  against  the  person\nwhere  he  is  satisfied  of  the  circumstances  set  out  in\nsubsection (1) in relation to the person; and\n\nwhere  he  makes  the  counter-proliferation  order,  make,  in\naccordance with the Proceeds and Instrumentalities of Crime\nAct,  2019  (Act  2019-17),  a  restraining  order  where  the\nrequirements for the making of the restraining order under\nthat Act are satisfied.\n\nSections 8(5) to (8), 9 and 10 apply with such adaptations and\n(5)\nmodifications as may be necessary to a counter-proliferation order and\nthe person against whom that order and any related restraining order\nwas made as those sections apply to a terrorist designation order and\nthe person against whom the terrorist designation order and any related\nrestraining order was made.\n\nRestraining orders in respect of related State actors\n\n10C.(1)\nThe  Director  of  Public  Prosecutions  shall,  without  delay,\napply  to  a  judge  in  Chambers  for  a  restraining  order  to  freeze  all\nproperty of\n\n(a)\n\n(b)\n\n(c)\n\na related State actor;\n\na person controlled by a related State actor;\n\na person acting on behalf of, or at the direction of, a related\nState actor,\n\nwhich is associated with any act, plot, threat or programme connected\nwith the proliferation of weapons of mass destruction and is situated in\nBarbados.\n\nThe judge shall make the restraining order in accordance with the\n(2)\nProceeds  and  Instrumentalities  of  Crime  Act,  2019  (Act  2019-17)\n\n\f17\n\nwhere the requirements for the making of the restraining order under\nthat Act are satisfied.\n\n(3)\nSections 8(5) to (8), 9 and 10 apply with such adaptations and\nmodifications  as  may  be  necessary  to  a  related  State  actor  and  a\nrestraining order made under subsection (2) as those sections apply to\na person against whom a terrorist designation order, and any related\nrestraining order, was made.”.\n\nInsertion of section 12A into Cap. 158\n\n9.\nfollowing:\n\nThe  principal  Act  is  amended  by  inserting  after  section  12,  the\n\n“Attempted offences\n\n12A.\nA person who attempts to commit an offence under this Act\nis guilty of an offence and is liable on conviction on indictment to be\npunished  as  a  principal  offender\nthe  offence\nattempted.”.\n\nin  relation\n\nto\n\nRepeal and replacement of section 15 of Cap. 158\n\n10.\nsubstituted:\n\nSection  15  of  the  principal  Act  is  repealed  and  the  following\n\n“Attorney-General to be competent authority\n\n15.\nBarbados for\n\nThe  Attorney-General  is  the  competent  authority  of\n\n(a)\n\nthe  exchange  of\nto  criminal\ninvestigations  or  extradition  proceedings  in  respect  of  an\noffence under this Act; and\n\ninformation\n\nrelating\n\n\f18\n\n(b)\n\nthe purpose of proposing any addition or removal of the name\nof a person from a list referred to in section 8(1) or 10A.\n\nAct 2011-23 to apply to financing of proliferation of weapons\nof mass destruction etc.\n\nThe  Money  Laundering  and  Financing  of  Terrorism\n16.(1)\n(Prevention and Control) Act, 2011 (Act 2011-23) applies, with such\nadaptations and modifications as may be necessary, to the financing of\nthe proliferation of weapons of mass destruction as that Act applies to\nthe financing of terrorism.\n\nWithout  prejudice  to  the  generality  of  subsection  (1),  for  the\n(2)\npurpose of preventing, suppressing and disrupting the financing of the\nproliferation  of  weapons  of  mass  destruction,  in  the  application  of\nsections 15, 17, 19, 21, 23, 26, 41 and 43 of the Money Laundering and\nFinancing  of  Terrorism  (Prevention  and  Control)  Act,  2011\n(Act 2011-23), the words “financing of terrorism” in that Act shall be\nconstrued to include “financing of the proliferation of weapons of mass\ndestruction”.\n\nAlteration of Constitution\n\n16A.\nnecessary to give effect to sections 8, 10B and 10C.”.\n\nSection  16  of  the  Constitution  is  altered  to  the  extent\n\nInsertion of new Schedule into Cap. 158\n\n11.\nthereto, the Schedule set out in the First Schedule to this Act.\n\nThe principal Act is amended by inserting as the Third Schedule\n\nConsequential amendments\n\n12.\namended to the extent set out opposite thereto in Column 2.\n\nThe  enactments  set  out  in  Column  1  of  the  Second  Schedule  are\n\n\f19\n\n L.R.O. 1998Column 1StatesDemocratic People's Republic of KoreaColumn 2Related State Actors1. The Government of the Democratic People's Republic of Korea2. The Worker's Party of Korea\".FIRST SCHEDULE(Section 11)\"THIRD SCHEDULE(Section 10A)States and State Actors\f20\n\n L.R.O. 1998Column 1Enactments1. Mutual Assistance in Criminal Matters Act, Cap. 140A2. Extradition Act, Cap. 1893. Charities Act, Cap. 2434. Civil Aviation Act, Cap. 288BColumn 2Amendments1. In section 18(1), insert after the word \"Anti- Terrorism\", the words \"and Counter-Proliferation of Weapons of Mass Destruction\".2. In section 29(1)(c), insert after the word \"Anti- Terrorism\", the words \"and Counter-Proliferation of Weapons of Mass Destruction\".1. In section 7(3), delete the words \"under section 3 or 4 of the Anti-Terrorism Act, Cap. 158\" and substitute the words \"in section 3, 3A or 4 of the Anti-Terrorism and Counter-Proliferation of  Weapons of Mass Destruction Act, Cap. 158\".2. In paragraph 38 of the Schedule, insert after the word \"Anti-Terrorism\", the words \"and Counter-Proliferation of Weapons of Mass Destruction\".In section 38(1A), delete the words \"section 3 or 4of the Anti-Terrorism Act\" and substitute the words\"section 3, 3A or 4 of the Anti-Terrorism and Counter-Proliferation of Weapons of Mass Destruction Act,Cap. 158\".1. In section 35(6)(a)(ii), insert after the word \"Anti-Terrorism\", the words \"and Counter-Proliferation of Weapons of Mass Destruction\".2. In section 37(1), insert  after the word \"Anti- Terrorism\", the words \"and Counter-Proliferation of Weapons of Mass Destruction\".SECOND SCHEDULE(Section 12)CONSEQUENTIAL AMENDMENTS\f21\n\n L.R.O. 1998Second Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Column 1Enactments5. Money Laundering and Financing of Terrorism (Prevention and Control) Act, 2011 (Act 2011-23)6. Criminal Assets Recovery Fund Act, 2016 (Act 2016-10)Column 2Amendments1. In section 2, in the deﬁ nition of \"ﬁ nancing of terrorism\", insert after the word \"Anti-Terrorism\", the words \"and Counter-Proliferation of Weapons of Mass Destruction\".2. In section 23(a) in subsection (1)(a)(iv), insert after the word \"order\", the words \"or counter-proliferation order\"; and(b) delete subsection (2) and substitute the following: \"(2) In subsection (1)(a)(iv), \"terroristdesignation          order\"  and  \"   counter-proliferationorder\" have the meanings assigned to them respectively by the Anti-Terrorism and Counter-Proliferation of Weapons of Mass Destruction Act, Cap. 158.\".1.  In section 4(a), insert after the word \"Anti- Terrorism\", the words \"and Counter-Proliferation of Weapons of Mass Destruction\".2. In section 6, insert after the word \"Anti-Terrorism\" wherever it appears, the words \"and Counter-Proliferation of Weapons of Mass Destruction\".\f22\n\n L.R.O. 1998Second Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Column 1Enactments7. Proceeds and Instrumentalities of  Crime Act, 2019 (Act 2019-17)Column 2Amendments1. In section 2(a) insert in alphabetical order, the following deﬁ nitions:\" \"counter-proliferation order\" has the meaning assigned to it by section 2 of the Anti-Terrorism and Counter- Proliferation of Weapons of Mass Destruction Act, Cap. 158;    \"related State actor\" has the meaning assigned to it by section 2 of  the Anti-Terrorism and Counter- Proliferation of Weapons of Mass Destruction Act, Cap. 158;\"; and(b) in the deﬁ nition of \"terrorist designation order\", insert after the word \"Anti- Terrorism\", the words \"and Counter- Proliferation of Weapons of Mass  Destruction\".2. In section 52(a) delete subsection(1)(i) and substitute the following:\"(i)  the person in respect of whom the powers conferred by section 54 are sought to be exercised has had a terroristdesignation order or counter-proliferation order made against him or is, or is connectedto, a related State actor;”; and\f23\n\n L.R.O. 1998Second Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Column 1Enactments7. Proceeds and Instrumentalities of  Crime Act, 2019 (Act 2019-17) - (Cont'd)Column 2Amendments(b) in subsection (4), (i)  delete paragraph (a)(i) and substitute   the following:\"(i) the defendant are to the alleged   offender or the person against whom the terrorist designation order or counter-proliferation order is in force or who is,   or is connected to, a related State actor; and\"; and(ii)  delete paragraph (b) and substitute the  following:\"(b) section 12(2) has effect as if proceedings for the offence had been instituted against the defendant (i) when the investigation was started;(ii) where a terrorist designation  or counter-proliferation order is involved, when the order came into force; or(iii) where a related State actor is involved, when the person became a related State actor.\".\f24\n\n L.R.O. 1998Second Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Column 1Enactments7. Proceeds and Instrumentalities of  Crime Act, 2019 (Act 2019-17) - (Cont'd)Column 2Amendments3. Delete section 53(2) and substitute the following: \"(2) Notwithstanding subsection (1),where the defendant is a person in respectof whom a terrorist designation order orcounter-proliferation order is in force oris a related State actor(a) an application for a restraining order shall be made without notice; and(b) it shall be sufﬁ cient to provide   with the application, the information  set out in subsection (1)(b)(v)  and (vi).\".4. Insert after section 54(3), the following: \"(3A) For the avoidance of doubt andnotwithstanding subsection (3), where arestraining order is made under section8, 10B or 10C of the Anti-Terrorism and Counter-Proliferation of Weapons of Mass Destruction Act, Cap. 158(a) other provision, although not expressly stated in subsection (3), may be made in the restraining order where such provision is consistent with the United Nations Security Council Resolutions pursuant to which the order was made;\f25\n\n L.R.O. 1998Second Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Column 1Enactments7. Proceeds and Instrumentalities of  Crime Act, 2019 (Act 2019-17) -  (Cont'd)Column 2Amendments(b) no provision shall be made in the restraining order that is inconsistent with the resolutions referred to in paragraph (a); and(c) any requirements, including notiﬁ cation to the United Nations Security Council, to be satisﬁ ed pursuant to the resolutions referred to in paragraph (a) shall be complied with before provision for expenses is made.\".5. Insert after section 156, the following:\"Certain  dealing  permitted   notwithstandingrestraining order or freezing order 156A. (1) Nothing in this Act shall prohibit(a) the addition of interest or other earnings  due on an account to which a restraining order or  freezing order applies, provided that such interest or earnings are also restrained or frozen; or(b) the making of a payment due under any contract or other agreement  or obligation that arose prior to the making of the restraining order or freezing order,\f26\n\n L.R.O. 1998Second Schedule - (Concl'd)CONSEQUENTIAL AMENDMENTS - (Concl'd)Column 1Enactments7. Proceeds and Instrumentalities of  Crime Act, 2019 (Act 2019-17) - (Concl'd)Column 2Amendmentsand the Court may make in the restrainingorder or freezing order, such provision asit thinks ﬁ t to give effect to paragraphs (a)and (b).  (2) Notwithstanding subsection (1), where a restraining order is made under section 8, 10B or 10C of the Anti-Terrorism and Counter-Proliferation of Weapons of Mass Destruction Act, Cap. 158(a) subsection (1)(b) shall not operate in any manner that is inconsistent with any United Nations Security Council Resolutions pursuant to which the order was made; and(b) any requirements, including notification to the United Nations Security  Council, to be satisﬁ ed pursuant to the resolutions referred to in paragraph (a), shall be complied with before any payments are allowed.\"."
}