{
  "bill_id": 405,
  "slug": "national-cruise-development-commission-final-report-a-new-dawn-for-cruise-tourism-in-barbados",
  "title": "National Cruise Development  Commission - Final Report A New Dawn For Cruise Tourism in  Barbados.",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/60b9659bdba995fe49002564d644c5d6.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2019-06-18",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "A New Dawn\n\n for Cruise Tourism\n\n in Barbados\n\n## Final Report February 2019\n\n### National Cruise Development Commission\n\nPage 1\n\n\fNational Cruise Development Commission\n\nPage 2\n\n\f                                                                                                                                      Page\n\nTable of Contents\n\nAbbreviations & Acronyms                                                                                             5\n\nExecutive Summary                                                                                                         6\n\n### 1.0  Context\n\n1.1  Thumb-nail sketch of cruise industry                                                                      13\n1.2  Establishment of the National Cruise Development Commission (NCDC)            14\n1.3  The Commission’s vision and envisaged results                                                     14\n1.4  The Commission’s approach                                                                                   16\n\n### 2.0  Cruise Tourism – Situational Analysis\n\n2.1  Current global trends                                                                                               18\n2.2  Caribbean remains dominant cruise destination                                                      19\n2.3  Cruise passenger spend’ in Barbados disappoints                                                   22\n2.4  Cruise tourism’s economic impact                                                                          24\n2.5  Essential and transformational interventions needed to overcome the principal    26\n       challenges confronting cruise tourism in Barbados\n\n### 3.0  Barbados’ Key Infrastructures Below Par\n\n3.1  Port experience of cruise passengers visiting Barbados must be enhanced            29\n3.2  ‘Pilot project’ re cruise ships berthing on the West Coast should be expedited     36\n3.3  GAIA needs to plan for the increasing air-to-sea demand                                      38\n3.4  Visitor centres, information kiosks & public toilets needed                                   39\n3.5  Roads, sidewalks, & overall physical environment must be addressed                  40\n3.6  Transport vehicles must be subject to minimum standards                                     41\n\n### 4.0  It is time to restore Pelican Village, Bridgetown, & Oistins\n\n4.1  A New lease on life for Pelican Craft Centre                                                          42\n4.2  Historic Bridgetown and its Garrison present a great marketing opportunity         45\n4.3  Bridgetown re-imagined                                                                                          47\n4.4  Time to save the Oistins ‘goose’ or risk losing the ‘golden egg’                            54\n\n### 5.0  Strategic approaches to cruise development\n\n5.1  Barbados’ Cruise development strategy should prioritize homeporting                 57\n5.2  The European market beckons & Barbados should respond                                   59\n\n### National Cruise Development Commission\n\nPage 3\n\n\f5.3  Barbados should explore mechanisms for growing Summer cruise traffic             60\n5.4  Training should be a priority, including certification of tour guides                       61\n\n### 6.0  Barbados Must Unveil Hidden Tourism ‘Gems’\n\n6.1  Barbados, as a cruise destination, must deliver in three key areas                          62\n6.2  Paradigm Shift Needed                                                                                            62\n### 6.3  Partnerships are invaluable for cruise tourism                                                        63\n6.4  Perspectives of three visiting tourism strategic partners                                         64\n\n### 7.0  Institutional Considerations\n\n7.1  Principal public sector tourism stakeholders in Barbados’ cruise sector                65\n7.2  Cruise division or comparable entity must become a genuine facilitator               66\n7.3  Regulatory requirements are enmeshed in bureaucratic obfuscation                      68\n\n### 8.0  Random thoughts about possible visitor attractions\n\n8.1  Bajan tales from the crypt - the mystery of the Chase Vault                                  69\n8.2  Mermaids Tavern & the Charter of Barbados                                                         69\n8.3  Barbados and the story of “Rumbullion”                                                                70\n8.4  Other tales from beneath the earth or high above it                                                71\n\n### Comment\nA wake-up call is no longer enough, it is time for action                                              71\n\n### Appendix 1\nA Summary of Objectives and Recommended Actions                                            73\n\nReferences                                                                                                                      83\n\nTables\n\nTable 1:  Cruise Line Deployments by Region1 (% of available Lower Berths)                          20\nTable 2:  Economic contribution of cruise tourism, by destination, 2017/18 cruise                     21\nTable 3:  Spending by Transit & Homeporting passengers ($US), 2017/18 cruise year              23\nTable 4:  Economic contribution of cruise tourism, by destination, 2017/18 cruise year2            25\nTable 5:  Av. Onshore Exp. ($US) from a Transit Call by a 4,000 Passenger Cruise Ship          58\nTable 6:  Av. Onshore Exp. ($US) from a Homeport Call by a 4,000 Passenger Cruise Ship     59\n\n1 CLIA, 2018\n2 Adapted from the BRIA Oct. 2018 study.\n\n### National Cruise Development Commission\n\nPage 4\n\n\fAbbreviations & Acronyms\n\nBCTI                                         Bridgetown Cruise Terminal Inc.\nBIDC                                         Barbados Investment & Development Corporation\nBPI                                             Barbados Port Inc.\nBREA                                        Business Research & Economic Advisors\nBSO                                           Business Support Organisations\nBTII                                           Barbados Tourism Investments Inc.\nBTMI                                         Barbados Tourism Marketing Inc.\nBTPA                                         Barbados Tourism Product Authority\nCBI                                            Centre for the promotion of imports from developing countries\nC&LA                                        Caribbean and Latin America\nCLIA                                          Cruise Lines International Association\nDMC                                          Destination Management Companies\nFCCA                                         Florida-Caribbean Cruise Association\nGVC                                           Global Value Chains\nGDP                                           Gross Domestic Product\nILO                                            International Labor Organization\nIT                                               Information Technology\nMCS                                          Ministry of Culture and Sports\nMEB                                          Ministry of the Environment & National Beautification\nMMB                                         Ministry of Maritime Affairs & the Blue Economy\nMTI                                            Ministry of Tourism and International Transport\nMTW                                          Ministry of Transport, Works and Maintenance\nPA                                              Public Address\nPSV                                            Public Service Vehicles\nSME                                           Small and Medium-sized Enterprise\nUSVI                                          US Virgin Islands\nWTTC                                        World Travel & Tourism Council\n\n### National Cruise Development Commission\n\nPage 5\n\n\fContext & Situational Analysis\n\nExecutive Summary\n\nCurrent global trends: Cruise tourism is one of the fastest growing segments in the travel and\ntourism  industry.  The  global  cruise  market  grew  from  1.4  million  passengers  in  1980  to  25.8\nmillion  in  2017.    The  cruise  sector  continues  to  build  capacity  with  sixty-five  (65)  new  cruise\nships expected to be delivered over the ten-year period from beginning 2016 to end of 2025. The\nUSA continues to be the principal market for cruise passengers, but the fastest growing markets\nare in Asia and Europe.\n\nCaribbean  remains  dominant  cruise  destination:  Worldwide,  the  combined  Caribbean  and\nLatin American region continues to be the dominant cruise destination, accounting for 35.4% of\nthe global cruise sector deployment. During the 2017/2018 cruise year (May 2017 – April 2018),\ncruise tourism generated nearly US$3.4 billion in direct expenditures and created 79,000 jobs in\nthe thirty-six (36) cruise destinations in the Caribbean, Mexico, and Central and South America.\n\nCruise Passenger ‘spend’ in Barbados disappoints: Cruise passenger spend in  Barbados has\nbeen  below  expectations  in  recent  years.  Average  spend  per  ‘transit’  cruise  passenger  for\n2017/18 was only US$64.05 or 15.6% below the US$75.85 recorded in 2014/15.  Homeporting\n(air-to-sea), on the other hand, has been performing well and recorded solid growth in both the\nnumber  of  homeporters  and  their  average  per  passenger  spend,  which  rose  dramatically  from\nUS$85.94 per passenger in 2014/15 to US$144.78 in 2017/18.\n\nPrincipal  challenges  confronting  cruise  tourism  in  Barbados:  Some  of  the  conditions  and\nchallenges, contributing to the underperformance of the cruise sector in Barbados, include:\n\n1.  An aging and aesthetically limited Port infrastructure;\n2.  An uncompetitive and unappealing shopping environment;\n3.  A limited number of tourism attractions and the absence of new products;\n4.  Too much consolidation of cruise sector-related representation and product distribution;\n5.  Limited implementation of strategic objectives by government institutions; and\n6.  The need for Barbadian SMEs to raise their game.\n\nMeanwhile,  the  two  defining  trends,  with  respect  to  Barbados’  cruise  tourism  sector  in  recent\nyears, have been:\n\n1)  The island is receiving more cruise passengers, but they are spending less money; and\n2)  Barbados’ overall cruise sector competitiveness and performance have been deteriorating\n\nvis-à-vis other regional cruise destinations.\n\nEstablishment of the National Cruise Development Commission: It is against the background\nof an underperforming cruise tourism sector that the Cabinet of Barbados decided, to establish a\n\n### National Cruise Development Commission\n\nPage 6\n\n\fNational  Cruise  Development  Commission  with  a  mandate,  “to  identify  immediate  workable\nsolutions to the challenges currently facing the cruise sector in Barbados”. A key outcome for\nthe  Commission  would  be  “A  sustainable  increase  in  the  cruise  industry-related  economic\nbenefits for Barbados”, which would be built on a number of intermediate outcomes.\n\nCommission’s  approach:  The  Commission  has  been  evaluating  and  reflecting  on  the  entire\ncruise  passenger  experience.  Members  of  the  Commission  have  been  meeting  with  key\nstakeholders (individuals and organisations); have undertaken site visits to both sea & air ports;\nhave convened Town Hall Meetings;  have made visits to  and done assessments  of a variety of\nattractions; and have assessed the challenges, which are having negative impacts on a number of\nthe attractions.\n\n### Barbados’ Key Infrastructures Below Par\n\nPort  experience  of  cruise  passengers  visiting  Barbados  must  be  enhanced:  The  need  for\nmajor expansion of the existing Bridgetown Port or the construction of  a new dedicated Cruise\nTerminal  has  been  embraced  by  all  cruise  sector  stakeholders  and  has  been  under  serious\nconsideration  for  a  number  of  years.    Nevertheless,  given  the  uncertainty  surrounding  Sugar\nPoint  et  al, this  Report will proceed on the basis that Barbados  is  at  least  three  years removed\nfrom the operationalization of any new Port or Cruise Terminal. In the circumstances, the actions\ndiscussed  below  are  intended  to  enhance  the  performance  of  the  Port,  with  respect  to  the\nhandling of cruise ships and passengers, in the short to medium term.\n\nFirst,  the  shore-side  welcome  -  both  the  built  and  personal  aspects  -  need  a  major  upgrade.\n#### Barbados was ranked 29th of the 36 C&LA destinations with respect to the quality of the initial\nshore-side welcome.\nSecondly, there is a need for Improved Signage throughout the Port.\nThirdly,  the  Port  needs  to  have  appropriate  arrangements  for  the  safe  movement  of  cruise\npassengers  in  the  Port.  Adequate  transportation,  including  for  the  differently-abled,  should  be\navailable to move passengers from the distant berths to the Cruise Terminal.\nFourthly, the Port would benefit from the maximization of branding/marketing opportunities,\nincluding strategically-placed “Welcome to Barbados” signs and related images.\nFifthly,  the  area  reserved  for  tour  buses  and  taxis  to  pick-up  cruise  passengers  needs  proper\norganization and the introduction of systems to improve the dispatch of tours.\nPort  entrance  &  exit  –  The  process  seems  unnecessarily  slow  and  prone  to  bottlenecks.  The\nproblem seems to revolve around the capacity to deploy an adequate number of Customs officers\nin a timely manner.\n\n‘Pilot  project’  re  cruise  ships  berthing  on  the  West  Coast  should  be  expedited  :  In  recent\nyears, there have been discussions with interested cruise lines about the possibility of anchoring\nsmaller  cruise  ships  offshore  at  Holetown/Speightstown  and  using  tenders  to  transport  the\npassengers ashore. This would make attractions in the north of the island more readily accessible\n\n### National Cruise Development Commission\n\nPage 7\n\n\fby cruise passengers. Progress in advancing the technical aspects of this initiative has been rather\nlimited.\n\nVisitor centres, information kiosks & public toilets needed:  Consideration should be given to\nthe  positioning  of  a  few  purpose-built  visitor  centres  along  key  routes.  These  facilities would\ninclude  an  information  kiosk;  space  for  vendors  (preferably  from  the  surrounding  area)  of\n### Barbadian arts and craft; and properly maintained toilet facilities.\n\nRoad  infrastructure,  verges  &  overall  physical  environment  in  poor  condition:  The  road\ninfrastructure is in desperate need of serious maintenance. Road surfaces, sidewalks, and verges\nare all in unsatisfactory condition. The prevalence of uncollected garbage and overflowing trash\nbins add to the impression of a country where maintenance has been forgotten.\n\n### It is Time to Restore Pelican Village, Bridgetown, & Oistins\n\nA New Lease on Life for Pelican Craft Centre: The Pelican Craft Centre is floundering under\nthe  burden  of  numerous  shortcomings.  A  number  of  stimulating  initiatives  are  proposed,\nincluding:\n\n(1) Installation of new management, public or private sector;\n(2) Timely maintenance and refurbishment to make the complex more presentable.\n(3) Signage – Introduce a new series of bold, attention-getting, and unambiguous signs\n(4) Advertising  –  The  management  of  Pelican  Craft  Centre  should  execute  an  online\n\nmarketing campaign as well as local TV and radio advertising.\n\n(5) Entertainment  –  When  cruise  ships  are  in  Port,  organize  colourful  entertainment\npackages around the gazebo area and on the lawn beside Princess Alice Highway.\n(6) Open  market  –  The  lawn  beside  Princess  Alice  Highway  and  the  areas  around  the\n\ngazebo and along the artist wall should be used as an “open air craft market”.\n\n(7) Customer  experiences  –  Arrange  interactive  craft  demonstrations,  in  areas  such  as:\nwood & straw work, jewelry design, leather craft, glass blowing, pottery making etc.\n(8) Product development –  Craft vendors in  Barbados, with  the help  of the BIDC Design\nCenter, need to pay more attention to new product design with a view towards developing\na range of “Authentic Barbadian souvenirs”.\n\nHistoric  Bridgetown  and  its  Garrison  must  be  promoted  more  effectively:  Barbados  must\nmake  a  serious  effort  to  promote  effectively  “Historic  Bridgetown  and  its  Garrison  (an\nUNESCO World Heritage Site)”.  There is considerable scope for the packaging and promotion\nof  “Heritage  City  Tours”,  with  stops  at  an  awakened  Pelican  Craft  Centre,  Museum  of\nParliament,  Exchange  Museum,  Jewish  Synagogue,  a  properly-developed  Rihanna  Drive  (a\nphase 2 project), George Washington House and the tunnels, the changing of the guard (attired in\nZouave  uniforms)  at  St.  Ann’s  Fort,  a  light  Bajan-oriented  lunch  somewhere  on  Bay  street  or\naround  the  Careenage,  shopping  on  Broad  street,  plus  additions,  such  as:  a  beach,  the  Screw\nDock, Mt. Gay Rum Tour, a drive up to Gun Hill Signal Station etc.\n\n### National Cruise Development Commission\n\nPage 8\n\n\fBridgetown re-imagined: Bridgetown needs cleaning-up and reinvigorating in order to bring\nher back to life and encourage, not only visitors but also Barbadian residents to return to the city\nafter the sun has gone down and the stars have come out.\n\nBridgetown Phase One\n\n(i)\n\nBridgetown  needs  a  more  effective  sanitation  service  (public,  private,  or  a\ncombination);\nBridgetown needs attended public toilet facilities;\n\n(ii)\n(iii)  Consideration  should  be  given  to  the  deployment  of  a  few  “City  Guides”  at  select\n\nlocations, when cruise ships are in Port.\nShopping experience can be improved for cruise passengers visiting Bridgetown.\nThe much talked about ‘free wi-fi’ must be enabled throughout the City.\n\n(iv)\n(v)\n(vi)  A walking map, both interactive & printed versions, covering the area from the Port\n\nexit/Pelican Craft Centre to St. Patrick’s Cathedral, should be introduced.\n\nBridgetown Phase two\nFor the medium term, the Commission proposes the following:\n\n  Removing vehicular traffic from Broad Street;\n  Encouraging the introduction of more water side and open air cafes;\n  Introducing a water taxi service – to transport persons between the inner Careenage and\n\nupper Bay street, Rockley, and Oistins or Brighton, Holetown and Speightstown;\n\n  Enhancing the Squares and other open spaces around the city with ‘greenery’ and seating;\n  Introducing  alternative  arrangements  for  housing  and  more  comfortably  feeding  the\n\nCity’s homeless.\n\nBridgetown Phase three – Transformational Initiatives\nIn phase three, some of the proposed transformational initiatives are identified and it is envisaged\nthat they will be developed, refined, and implemented in the years to come.\n\nTransformation  of  Bridgetown  Fish  Market:      A  Bridgetown/Pelican  Market,  designed  to\ncombine  in  one  location:  A  world  class  fish  and  meat  market;  a  market  for  provisions,  herbs,\nspices and various cooking paraphernalia; an entertainment space; and two restaurants.\n\nBuild a Bridgetown Marina:  It is time for Government to encourage, promote, and incentivize\nthe development of a world-class full service marina.\n\nMake  Bridgetown  a  livable  city  for  young  professionals:  The  City’s  old/unused  warehouse\nspace should be refurbished and utilized as accommodation for upwardly-mobile professionals, a\nhigh-end boutique hotel, and to present quality experiences/entertainment.\n\nRe-claim prime real estate from parking lots: We should discourage parking in the city and\nuse the water-side land for recreational use and/or upmarket housing.\n\n### National Cruise Development Commission\n\nPage 9\n\n\fRestore  Bridgetown’s  historical  buildings:    The  restoration  of  a  number  of  the  historic\nbuilding, which are currently running to ruin within Historic Bridgetown, should be pursued as a\nlong  term  project  -  The  old  Empire  Theatre,  The  abandoned  Dale  Carnegie  Library,  The\ndilapidated Eye Ward building etc.\n\nTime to save the Oistins ‘goose’ or risk losing the ‘golden egg’\n\nThe  Oistins  Bay  Garden  needs  major  refurbishment  or  even  a  comprehensive  rebuilding.  The\nfollowing  areas  should  be  specifically  targeted  for  immediate  action  and  should  be  addressed,\neven if the extensive rebuild has to be deferred:\n-  Bathroom facilities must be upgraded;\n-  The stagnant pool of water that seems to be a permanent fixture should be addressed;\n-  Rotting boats, abandoned appliances and other debris must be removed from the area;\n-  Proper stalls must be provided for the craft vendors;\n-  The Complex’s wooden tables and chairs should be restored or replaced, as necessary;\n-  Garbage bins should be regularly serviced to prevent unsightly and unhealthy overflows.\n\n### Strategic Approaches to Cruise Development\n\nHomeporting provides more opportunities to increase cruise passenger spend:  An analysis\nof  available  data  indicates  that  homeporting  offers  more  opportunities  for  cruise  passengers  to\nspend  money  in  Barbados.  The  transportation  aspect  of  moving  a  large  number  of  passengers\nfrom charter planes to their cruise ships in the Bridgetown Port is merely scratching the surface\nof  the  opportunities  associated  with  homeporting.  The  real  homeporting  benefits  for  Barbados\nare in areas, such as: hotel accommodation, meals in restaurants, money spent in night clubs &\nother night time attractions, using taxis and the like.\nWith respect to homeporting, the three lessons to take away from the FCCA data for the 2017/18\ncruise may be summarized as follows:\n\n(1) Based on current data, total passenger and crew spending from one call at Barbados by\n(for example) a 4,000-passenger cruise ship is now approximately US$247.9 thousand or\n$136.6  thousand  below  what  would  have  been  spent  if  Barbados  was  operating  at  the\nregional average.\n\n(2) If the 4,000-passenger ship was homeporting in Barbados, the total passenger and crew\nspending  (approx.  US$516.0  thousand)  would  more  than  double  the  spending  by  a\ncomparable  number  of  regular/transit  cruise  passengers  and  crew  (approx.  US$247.9\nthousand).\n\n(3) Whereas  the  average  total  amount  spent  by  transit  passengers  and  crew  in  Barbados  is\n35.5  %  below  the  regional  average,  the  average  spent  by  homeporting  passengers  and\ncrew in Barbados is only 2.8% below the regional average.\n\n### National Cruise Development Commission\n\nPage 10\n\n\fThe European Market Beckons & Barbados should respond:  It seems that there is a case to\nbe made that the European cruise passengers are more compatible with where we want to go with\nour  cruise  tourism  product.  They  are  generally  more  affluent,  more  interested  in  heritage  &\ncultural  attractions,  and  they  are  also  more  oriented  towards  the  pre  &  post  aspects  of\nhomeporting than the increasingly budget conscious travellers coming out of the US. When these\nfactors are taken into consideration, it is recommended that cruise tourism promotion authorities\nshould step-up their efforts to attract more Europeans cruise passengers.\n\nBarbados should explore mechanisms for growing Summer Cruise Traffic: Increased cruise\ntraffic  during  the  summer  months  would  boost  Barbados’  economic  benefits  in  a  number  of\nways,  including  through  supporting  the  financial  viability  of  tourist  attractions,  which  might\notherwise be marginal undertakings. Barbados should endeavour to grow the summer season by\ngiving cruise lines  reasons  to  deploy their ships  in  our region  during the summer months. The\ncreation  of  an  effective  “Southern  Caribbean  Alliance”  could  help  with  this  push.    The  areas,\nwhich could be promoted by such an alliance, include:\n\nIncreasing regional cruise traffic generally;\n\n\n  Exploring  modalities  for  incentivising  cruise  lines  to  maintain  a  buoyant  summer\n\nschedule in the Southern Caribbean; and\n\n  Cooperation in the areas of marketing and the negotiation of port fees and the like.\n\nTraining  should  be  a  priority,  including  certification  for  tour  guides:  Barbados’  tourism\nauthorities  and  persons  in  the  cruise  sector  must  prioritize  training  and  treat  it  as  a  core\ncomponent  of  capacity-building  with  respect  to  essential  cruise  sector  personnel.  In  addition,\ncontinuing  training  should  be  introduced  for  various  types  of  service  staff,  including:  store\nemployees, taxis drivers, and front line staff at attractions, tour operators etc.\n\n### Barbados Must Unveil Hidden Tourism ‘Gems’\n\nParadigm  Shift  Needed:    The  cruise  tourism  sector  demands  that  the  Barbados  experience\nshould  exceed  visitor  expectations  “all  the  time  every  time”  because  cruise  tourism  does  not\nprovide opportunities for Barbados or Barbadian service providers to recover from initial sub-par\nperformances.  Consequently,  Barbados  needs  to  address  visitor  concerns  about  quality  of\nservice, neglected physical environment, and limited variety of products.\n\nPartnerships  are  invaluable  for  cruise  tourism:    Tourism  authorities  should  become  more\nproactive in establishing standards of behavior and service for the sector; broadening the range of\n“products” being offered to cruise lines; and exploring additional opportunities to bring greater\neconomic benefits to Barbados. This approach requires an agency, public or private sector or a\npublic-private  partnership,  with  a  mandate  and  the  capacity  to  promote,  stimulate,  and\nfacilitate the diversification and growth of the sector.\n\n### National Cruise Development Commission\n\nPage 11\n\n\fInstitutional Considerations\n\nCruise  Division  or  comparable  entity  must  become  a  genuine  facilitator:    BTMI’s  Cruise\nDivision  or  the  Division  in  partnership  with  a  complementary  entity  should  have  a  clearly-\narticulated developmental and business facilitating role.\n\ni)\n\nii)\n\niii)\n\nThe  Division  must  become  more  proactive  and  innovative  in  brokering  strategic\npartnerships and packaging small attractions into viable tours.\nIt should be able to support tourism-related projects which are facing bureaucratic or\nrelated challenges in getting approvals;\nIt  should  be  able  to  provide  information,  guidance,  and  introductions  to  key\nregulatory institutions and to potential strategic partners.\n\nRegulatory requirements are too burdensome:  Written and verbal comments from persons in\nthe  cruise  tourism  sector  convey  the  impression  that  the  regimes  for  purchasing  duty  free\nvehicles,  obtaining  permits  for  tour  buses,  and  securing  approval  for  modifications  to  vehicles\ninvolve  opaque  requirements  and  distinctly  inhibiting  procedures.  Business  operators  report  a\nnumber of negative experiences, with respect to their dealings with Town Planning, the Ministry\nof Finance, and the regulatory arm of the Ministry of Transport and Works.\n\n### Comment\n\nBarbados,  which  is  considered  by  many  to  be  a  marquee  cruise  destination,  has  been  losing\nground to regional competitors over the past nine/ten years.  One of the key messages, which is\nemerging from recent studies and from interviews with stakeholders, is  that Barbados needs to\npresent a more diversified portfolio of tours and attractions.\n\nMeanwhile,  the  objective  of  involving  more  SMEs  in  the  cruise  sector  will  not  be  achieved\norganically,  it  will  necessitate  significant  encouragement  and  “hand  holding”.  In  the\ncircumstances,  there  is  a  role  for  a  suitably  enabled  institution,  the  cruise  division  within  the\nBTMI  or  similar  entity,  to  become  more  “hands  on”  in  facilitating  the  diversification  and\nexpansion of the island’s suite of visitor attractions. Barbados needs to do a better job developing\nand promoting all of the island’s cruise sector offerings.\n\n### National Cruise Development Commission\n\nPage 12\n\n\fNCDC’s Final Report (February 2019)\n\n## A New Dawn for Cruise Tourism in Barbados\n\n1.0 Context\n\n1.1  Thumb-nail sketch of cruise industry\n\nThe cruise market is one of the fastest growing segments in the travel and tourism industry and it\ncan  make  a  significant  contribution  to  a  destination’s  economy.    The  phenomenal  growth  of\ncruise tourism has been driven by the continuing dynamism in cruise activity and the increasing\nnumber of countries that include cruise, as a key component of their tourism development. The\ncompetition to attract visits from cruise lines is fierce within the Caribbean and beyond.\n\nWorldwide,  the  combined  Caribbean  and  Latin  American  region  continues  to  be  the  leading\ncruise destination. In 2017, according to the Cruise Lines International Association (CLIA), the\nCaribbean  and  Latin  American  region  accounted  for  35.4%  of  the  global  cruise  sector\ndeployment. The second leading region for cruise visitors was the Mediterranean with just over\n15%.\n\nMeanwhile,  the  two  defining  trends,  with  respect  to  Barbados’  cruise  tourism  sector  in  recent\nyears, have been:\n\n### National Cruise Development Commission\n\nPage 13\n\n\f1)  The island is receiving more cruise passengers, but they are spending less money; and\n2)  Barbados’ overall cruise sector competitiveness and performance have been deteriorating\n\nvis-à-vis other regional cruise destinations.\n\n1.2  Establishment of the National Cruise Development Commission (NCDC)\n\nIt  is  against  the  background  of  an  underperforming  cruise  tourism  sector  that  the  Cabinet  of\nBarbados  decided,  in  August  2018,  to  establish  a  National  Cruise  Development  Commission\nwith a mandate, “to identify immediate workable solutions to the challenges currently facing the\ncruise  sector  in  Barbados”.  The  Commission  was  appointed  the  following  month  (September\n2018) and its principal deliverables include:\n\n  An up-to-date  assessment  of the cruise industry in Barbados, including  an audit among\n\nlocal public  and private stakeholders and the general public:\n\n  Motivating the active participation & investment of small and medium-sized enterprises\n\nin the development & diversification of the local cruise sector;\n\n  Identifying opportunities to expand the economic benefits, which can be derived from\n\ncruise tourism;\n\n  Recommending  short-term  initiatives  to  enhance  the  onshore  experience  and  increase\n\nvisitor spend for the 2018/19 winter season; and\n\n  Identifying an additional body of measures to ensure the long-term competitiveness of the\n\ncruise industry.\n\n1.3  The Commission’s Vision and Expected Results\n\n1.3.1 Vision\n“To establish Barbados as the premier cruise destination in the Caribbean and Latin American\ncruise region”\n\n1.3.2  Overarching Goal\nIt is envisaged that the recommendations put forward by the Commission will  contribute to “A\nsustainable increase in the cruise industry-related economic benefits for Barbados”.\n\n1.3.3  Strategic Objectives\nThe  strategic  objectives  listed  below  are  expected  to  contribute  to  the  overarching  goal  stated\nabove and should also help to establish a basis for monitoring the performance of the principal\ncruise sector institutions over the next six (6) years.\n\na)  Number of cruise passengers visiting Barbados increased by thirty (30) per cent over the\n\nsix-year period 2017/2018 to 2023/24;\n\nb)  The number of cruise passengers homeporting in Barbados increased from 149,065 in the\n\n2017/18 cruise year to 185,000 in 2023/24;\n\n### National Cruise Development Commission\n\nPage 14\n\n\fc)  The  percentage  of  homeporting  cruise  passengers  persuaded  to  spend  pre  or  post  hotel\n\nnights in Barbados increased from 7% in 2017/18 to 13% by 2023/24;\n\n#### d)  Sixty (60) new or reconfigured tour packages3 introduced over the next six years;\ne)  Fifteen  (15)  new  or  re-imagined  attractions  or  visitor  experiences  introduced  over  the\n\nnext six years;\n\nf)  Average  spend  per  transit  cruise  passenger  increased  from  US$64.05  in  2017/18  to\n\nUS$100.00 by the 2023/24 cruise season;\n\ng)  Average spend per homeporting cruise passenger increased from US$144.78 in 2017/18\n\nto US$235.00 by the 2023/24 cruise season;\n\n#### h)  Cruise  passenger  satisfaction,  with  respect  to  shopping,  improved  from  20th  of  36th\ncountries in the C&LA region in 2017/18 to a place in the top third by the 2020/21 cruise\nyear.\n\n1.3.4  Key assumptions\n\nAlthough  the  key  assumptions  relate  to  conditions  that  are  outside  the  control  of  the\nCommission, the achievement of the desired results depends on whether or not the assumptions\nhold true.  The assumptions, listed below,  represent some of the conditions that must obtain in\norder to ensure the attainment of the Overarching Goal and Strategic Objectives.\nWith respect to cruise tourism development in Barbados, key assumptions include that:\n\n  The  Government  of  Barbados,  the  Ministry  responsible  for  Tourism,  and  other\nstakeholders at all levels will be fully supportive of the Cruise Tourism sector, even in the\nface of severe national financial constraints;\n\n  Barbadian  institutions,  organisations,  agencies  and  individuals  associated  with  cruise\ntourism  (BTMI,  BTPA,  BTII,  BPI,  the  GAIA,  Tour  &  Taxis  Operators,  Organisers  of\nVisitor Experiences,  Operators of Attractions, craft vendors, and Operators of duty-free\nestablishments)  will  be  committed  to  the  growth  of  cruise  tourism  and  to  increasing\ncruise passenger ‘spend’ in Barbados;\n\n  Adequate  resources  will  be  available  to  the  Ministry  responsible  for  Tourism  and  to\ntourism facilitating agencies to support the promotion and development of cruise tourism\nin Barbados;\n\n  Stakeholder  capacities  to  support  cruise  tourism,  including  infrastructural  development,\nthe diversification of visitor attractions, and the shopping experience, will be enhanced;\nand\n\n  Transparent  and  effective  mechanisms  will  be  applied  to  ensure  that  there  is  a  “level\n\nplaying field” with respect to the provision of services to the cruise tourism sector.\n\n3 Tour packages refer to the variety of configurations of attractions, which can be combined into different packages by tour\noperators to offer more options to our visitors.\n\n### National Cruise Development Commission\n\nPage 15\n\n\f1.4  The Commission’s approach\n\n1.4.1  Establishment of three working committees\nIt  was  decided  to  organise  the  Commission  into  three  committees  in  order  to  facilitate  better\ncoverage of the diverse range of issues, which needed to be considered.\n\nThe areas covered by the three committees are:\n\n1.  Visitor attractions & experiences\n2.  Tours, plus Bridgetown redevelopment\n3.  Air & Sea Ports, plus Duty-free, and indigenous Craft\n\nThe Commission has been evaluating and reflecting on the entire cruise passenger experience –\nprocedural,  visual,  verbal  and  experiential  –  from  arrival  at  the  sea  and/or  airport  to  final\ndeparture from Barbados - in order to be able to make informed recommendations to address any\nidentified shortcomings.\n\nThe  Commission’s  Committees  have  been  meeting  with  key  cruise  sector  stakeholders\n(individuals  and  organisations)  and  have  undertaken  a  number  of  site  visits  to  both  the  airport\nand  seaport,  incl.  the  Cruise  Terminal.  The  Commission  and  its  Committees  have  convened\nTown  Hall  Meetings;  have  visited  and  did  assessments  of  a  variety  of  visitor  attractions;  and\nhave evaluated the challenges, which are having negative impacts on some of the attractions that\nare now being developed or which are operational, but are seeking to attract cruise ship business.\nThe views of cruise line executives have also been canvassed in order to get their perspectives on\ncruise passenger expectations and about areas where Barbados might be falling short or failing to\ncapitalize on what it already available on the island.\n\n1.4.2  Review previous technical work\nThe  Commission  has  reviewed  and  taken  into  consideration  recent  studies  and  other  technical\nwork related to the Cruise sector in Barbados, including:\n\n  The 2011 Barbados Cruise Tourism Development Strategy;\n  The Barbados Tourism Master Plan 2014-2023;\n####   The 2014/15 BREA4 Study for the FCCA5;\n  The 2016 BTPA Cruise Audit Report;\n  The  2017  study  by  the  Duke  University  Global  Value  Chain  Center  “Barbados  in  the\n\nCruise Tourism Global Value Chain”; and\n\n  The 2017/18 BREA Study for the FCCA.\n\n4 Business Research and Economic Advisors, a New Jersey-based organization, which undertakes marketing & economic impact\nanalyses for tourism & travel industry clients\n5 Florida-Caribbean Cruise Association, a trade organization which seeks to enhance relations between its member cruise lines\nand governments and cruise-related institutions in cruise destinations.\n\n### National Cruise Development Commission\n\nPage 16\n\n\fFigure 1:  Prime Minister Mottley & delegation at FCCA Conference with senior cruise\n                line executives, November 2018\n\n1.4.3  Guiding Principles\n\nThese principles, not only reflect the basis on which the Cruise Development Commission went\nabout its work, but more importantly should underpin the actual implementation of any national\ncruise development strategy.\n\n(i)\n\n(ii)\n\n‘Visitor welcome’ and ‘level of service’ - Tourism authorities and those operating in\nthe  cruise  sector  (Port  officials,  Immigration  and  Customs  Officers,  Cruise  terminal\nstaff,  sales  representatives,  tour  guides,  taxis  operators,  craft  persons,  and  those\nworking with attractions and the like) must do their utmost to ensure that, as a tourism\ndestination  (both  long  stay  &  cruise),  Barbados  must  not  be  beaten  on  the  overall\nquality of the ‘visitor welcome’ and ‘level of service’.\nHeritage & Culture  -  A more effective promotion of Barbadian Heritage and Culture\nwill enable Barbados to differentiate its cruise  tourism product from what is available\nelsewhere  in  the  Caribbean.  There  is  tremendous  potential  in  differentiating  the\n‘Barbados Brand’ from its competitors and Barbados must take full advantage of this\nhitherto untapped potential.\n\n### National Cruise Development Commission\n\nPage 17\n\n\f(iii)\n\n(iv)\n\n(v)\n\n(vi)\n\nContribution to employment, economic growth, and foreign exchange earnings - The\nfocus of tourism promotion in Barbados, including the cruise sector, has traditionally\nbeen  to  monitor  and  report  on  the  number  of  visitors  each  quarter  or  each  year.\nHowever, modern tourism planners are placing greater emphasis on “visitor spend”.\nIn the circumstances, it can reasonably be argued that a strategic decision to allocate\nmore and more scarce resources (directly and indirectly) to the facilitation of cruise\ntourism can only be justified if cruise tourism is making an increasing contribution to\nemployment, economic growth, and foreign exchange earnings in Barbados.\nSustainable  Development  –  The  growth  of  the  cruise  sector  must  be  founded  on\nsustainability.  Preservation  of  the  environment,  as  well  as  the  island’s  heritage  and\nculture must also  be paramount. Future development must be oriented towards high\nquality and significant value added rather than overemphasizing quantity.\nAwareness  and  Sensitisation  -    Barbados  seems  to  be  falling  behind  in  the  area  of\nvisitor  welcome  and  friendliness  towards  visitors.  There  should  be  a  sustained,  but\nalmost  subtle,  campaign  to  make  Barbadians  more  aware  of  the  importance  of  the\ntourism industry and to encourage them to ‘engage with the visitors’. Barbados must\nrecapture  and  enhance  its  reputation  as  being  a  welcoming,  orderly,  clean  and  safe\ndestination.\nSpecific and implementable recommendations -  It  is  envisaged that the Commission\nwill,  not  only  identify  challenges  and  shortcomings,  but  will  make  implementable\nrecommendations for addressing identified problem areas.\n\n### 2.0 Cruise Tourism – Situational Analysis\n\n2.1  Current global trends\n\nOver  the  past  thirty-five  years,  worldwide  demand  for  cruise  tourism  has  posted  some  of  the\nbiggest  gains  within  the  tourism  industry  and  cruise  has  cemented  its  reputation  as  one  of  the\nfastest growing segments in the travel and tourism industry.\n\nThe  global  cruise  market  grew  from  almost  3.8  million  passengers  in  1990  to  25.8  million  in\n2017, according to the Cruise Lines International Association (CLIA), which represents 95% of\nthe  global  cruise  capacity.  When  CLIA  began  tracking  cruise  passengers  in  1980,  the  number\nwas only 1.4 million and, when we look at a more recent time period, the global cruise market\nhas  increased  by  81%  since  2006  –  advancing  from  15  million  in  2006  to  the  25.8  million\nrecorded in 2017.\n\nIn terms of capacity, the cruise industry added nine (9) new ships in 2016, six (6) more in 2017\nand an additional fifty (50) are on order for delivery between 2018 and 2025. These sixty-five\n(65) new cruise ships will add more than 250,000 to the industry’s worldwide passenger capacity\n\n### National Cruise Development Commission\n\nPage 18\n\n\fover the ten-year period from beginning 2016 to end of 2025. Therefore, governments globally\nare investing large sums of money in high quality infrastructures to accommodate these ships and\nthe hundreds of thousands of additional passenger arrivals.\n\nWhat is Cruise Tourism?\nIn  the  context  of  this  Report,  cruise  tourism  is  seen  as  a  form  of  leisure  travel,\ninvolving an all-inclusive holiday on a cruise ship. The ship-based holiday should be at\nleast 48 hours and follow a specific itinerary in which the cruise ship calls at a number\nof ports or cities.\nA  cruise  can  be  a  one-way  or  a  round  trip  journey  and  generally  passengers  come\nashore to visit attractions and experience the culture and shopping of that town, city or\nregion.\nSometimes travelers first fly to a specific destination, take a cruise trip from there and\nthen fly back, the so-called ‘fly & cruise’ or ‘homeporting’.\n\nThe USA dominates global cruise demand, providing 46.6% of cruise passengers in 2016. The\nnext largest supplier was China, with 8.5%, followed closely by Germany (8.1) & the UK (7.7).\nHowever, the relative dominance of the United States, as a source of cruise passengers, is being\neroded because the cruise market expansion is currently being driven by growing demand from\n#### Europe and the rest of the world6 (especially Australia/New Zealand and China/Asia).\n\nEuropean  residents,  including  from  the  UK,  now  represent  over  25%  of  worldwide  cruise\n#### passengers7. European  cruise passengers  represent an interesting target market  for Barbados\nbecause they are usually more interested, than Americans, in exploring culture and heritage and\n#### are also more likely to disembark8 during their cruise trip.\n\n2.2  Caribbean remains dominant cruise destination\n\nWorldwide,  the  combined  Caribbean  and  Latin  American  (C&LA)  region  continues  to  be  the\ndominant cruise destination. The reason why this region is so popular is because of its weather\nand proximity to the principal source market in North America. In 2017, according to CLIA, the\nC&LA  region  accounted  for  35.4%  of  the  global  cruise  sector  deployment.  The  C&LA  region\nwas  followed  by  the  Mediterranean  with  just  over  15%.  Europe  without  the  Mediterranean\nreceived about 11%, followed by China and Australia/New Zealand with around 5% each.\n\nIn terms of cruise industry impact, in the C&LA region, during the 2017/2018 cruise year (May\n2017  –  April  2018),  cruise  tourism  generated  nearly  US$3.4  billion  in  direct  expenditures,\ncreated 79,000 jobs, resulting in US$903 million in employee wages in the thirty-six (36) cruise\n\n6 CBI in the Netherlands, “What are the opportunities for cruise tourism with guests from Europe?”\n7 Daly, J., Fernandez-St,K., (Aug.2017) “Barbados in the Cruise Tourism Global Value Chain”\n8 Daly, J., Fernandez-St,K., (Aug.2017) “Barbados in the Cruise Tourism Global Value Chain”\n\n### National Cruise Development Commission\n\nPage 19\n\n\fdestinations  in  the  Caribbean,  Mexico,  and  Central  and  South  America,  which  have  been\nincluded in the latest triennial survey conducted on behalf of the FCCA by BREA.\n\nTable 1.   Cruise Line Deployments by Region9 (% of available Lower Berths)\n\nRegion\n\n2012\n\n2013\n\n2014\n\n2015\n\n2016\n\n2017\n\nCaribbean\n\n37.3%\n\n34.4%\n\n37.3%\n\n35.5%\n\n33.7%\n\n35.4%\n\nMediterranean\n\nOther\n\nEurope (w/o\nMediterranean)\nAsia (incl.\nChina)\n\nAustralia\n\nAlaska\n\nSouth America\n\n19.9\n\n16.5\n\n9.8\n\n3.6\n4.1\n\n5.4\n\n3.4\n\n21.7\n\n15.8\n\n10.9\n\n3.4\n5.0\n\n4.8\n\n3.9\n\n18.9\n\n14.5\n\n11.1\n\n4.4\n5.9\n\n4.5\n\n3.3\n\n19.5\n\n15.0\n\n10.6\n\n6.0\n6.0\n\n4.5\n\n2.9\n\n18.7\n\n13.8\n\n11.7\n\n9.2\n6.1\n\n4.1\n\n2,7\n\n16.0\n\n14.5\n\n11.5\n\n10.4\n6.0\n\n4.0\n\n2.2\n\nThe  cruise  industry  has  divided  the  Caribbean  and  Latin  America  into  the  following  four  (4)\ncruise itineraries: The “Eastern Caribbean”, comprising ten (10) destinations, which received an\n#### estimated 14.5 million cruise visitors10 (passengers and crew) during the 2017/18 cruise year; the\n“Western  Caribbean”,  comprising    nine  (9)  destinations  and  accounting  for  10.1  million\npassenger and crew arrivals; the “Southern Caribbean”, comprising Barbados and eight (8) other\ndestinations and receiving only 6.5 million passengers and crew; and Mexico, involving eight (8)\ndestinations and receiving 9.7 million passengers and crew.\n\n#### Overall,  eight  (8)  of  the  twenty-two  (22)  Caribbean11  destinations,  listed  in  table  2  below,\nwelcomed more than  a million cruise passengers during the 2017/18 cruise year. The Bahamas\nheaded  this  ’big  eight’  with  three  million  (2,999.7  thousand)  passengers,  followed  by  Jamaica\nwith 1.99 million and ending with Belize at 1.025 million. Barbados reported passenger arrivals\nof 730.9 thousand, placing it thirteenth on the list of Caribbean destinations, immediately behind\n#### St. Maarten12 (896.2), Turks and Caicos (813.5), Aruba (812.8), and Antigua & Barbuda (790.2).\n\n9 CLIA, 2018\n10 Note that cruise visitors include passengers & crew, whereas cruise passengers do not include ships’ crews\n11 “Caribbean” in this context and, as used elsewhere in this document refers to the twenty-two (22) destinations, comprising the\nrelevant English, Dutch, and French-speaking islands of the Caribbean, plus Belize and Puerto Rico.\n12 St. Maarten & USVI were seriously affected by hurricanes in 2017 and each recorded about one million fewer cruise passenger\nvisits than normal.\n\n### National Cruise Development Commission\n\nPage 20\n\n\fTable 2:  Arrivals, Onshore Visits and Expenditures by Caribbean Destination\n2017/2018 Cruise Year13\n\nDestinations\n\nPassenger\nArrivals\n(Thousands)\n\nPassenger\nOnshore Visits14\n(Thousands)\n\nAverage Spend\nper Passenger\n(US$)\n\nTotal Passenger\nExpenditures\n($US Millions)\n\nAntigua & Barbuda15\n\nAruba\n\nBahamas\n\nBarbados②\n\nBelize\n\nBonaire\n\nBritish Virgin Islands\n\nCayman Islands\n\nCuracao\n\nDominican Republic②\n\nGrenada\n\nGuadeloupe②\n\nJamaica②\n\nMartinique②\n\nPuerto Rico ②\n\nSt. Kitts & Nevis\n\nSt. Lucia\n\nSt. Maarten\n\nSt. Vincent\n\nTrinidad\n\nTurks and Caicos\n\nU. S. Virgin Islands\n\n790.02\n\n812.8\n\n2,999.7\n\n730.9\n\n1,024.9\n\n481.1\n\n140.8\n\n1,855.5\n\n724.8\n\n1,062.8\n\n343.6\n\n417.1\n\n1,988.8\n\n594.1\n\n1,187.7\n\n1,120.8\n\n668.0\n\n896.2\n\n241.0\n\n48.0\n\n813.5\n\n1,115.7\n\n  663.0\n\n  677.0\n\n2,444.8\n\n 630.8\n\n877.3\n\n378.6\n\n124.9\n\n1,636.5\n\n602.3\n\n881.9\n\n298.3\n\n396.2\n\n1,773.2\n\n516.1\n\n1,105.0\n\n978.5\n\n585.2\n\n784.2\n\n203.2\n\n  40.8\n\n699.6\n\n943.9\n\n$73.55\n\n$121.94\n\n$131.95\n\n$83.12\n\n$77.88\n\n$67.19\n\n$78.11\n\n$105.17\n\n$70.00\n\n$88.26\n\n$51.57\n\n$100.29\n\n$115.98\n\n$54.99\n\n$90.78\n\n$135.94\n\n$81.12\n\n$142.23\n\n$52.67\n\n$54.17\n\n$95.51\n\n$165.42\n\n$48.76\n\n$82.55\n\n$322.57\n\n$52.43\n\n$68.33\n\n$25.44\n\n$9.75\n\n$172.12\n\n$42.16\n\n$77.84\n\n$15.38\n\n$39.73\n\n$205.66\n\n$28.38\n\n$100.32\n\n$133.02\n\n$47.47\n\n$111.54\n\n$10.70\n\n$2.21\n\n$66.82\n\n$156.14\n\n13 Adapted from the BRIA Oct. 2018 study.  This table focuses on CARIFORUM countries & other Caribbean island destinations\n\n14 On shore visits refer to those cruise passengers, who actually disembarked cruise ships and visited the destinations\n15 CARIFORUM destinations are shown in italics\n\n② The homeporting destinations are indicated by this symbol ②\n\n### National Cruise Development Commission\n\nPage 21\n\n\f2.2.1  Competition intensifies\n\n“Today’s  cruise  ships  offer  a  world  of  innovations  that  build  cruise  lines’  brands  –  from  sky-\ndiving  simulators,  biking  above  the  ocean  and  robotic  bartenders  to  celebrity  chef  kitchens,\nbutler service and all-suite staterooms – and facilities that accommodate family members of all\n#### generations16  ..”  Cruise  ships  are  continually  striving  to  exceed  the  expectations  of  a  growing\nnumber  of  travelers  and  ‘cruisers’  can  easily  find  a  ship,  cabin,  and  itinerary  to  satisfy  their\nrequirements.    Consequently,  destinations  within the  Caribbean  region,  the  Mediterranean,  and\nthe  Pacific  are  also  “raising  their  game”  in  order  to  meet  or  exceed  cruise  passenger\nexpectations. Barbados must take steps to keep pace or it will be left behind.\n\nFor  example,  Jamaica  is  reportedly  investing  $US  110  Million  into  the  redevelopment  of  its\nMontego  Bay  Cruise  Terminal  facility.  In  Bahamas,  cruise  lines  such  as  “Carnival,  Royal\nCaribbean,  Disney  and  MSC  are  completing  negotiations  for  major  developments  that  would\nmean hundreds of millions of dollars being invested over the next year or two.”\n\nCruise  destinations  across  the  region  have  committed  to  various  enhancements  to  their  cruise\ntourism offerings in order to capitalize on the potential benefits to be derived from the sector.  In\nBarbados, policy makers recognize the need for investment in new port facilities. However, the\nproposed dedicated cruise terminal, Sugar Point, which has been just over the horizon for a few\nyears, remains shrouded in uncertainty.\n\n2.3  Cruise Passenger ‘spend’ in Barbados disappoints\n\nBarbados has been positioned in the “Southern Caribbean” together with the following eight (8)\ndestinations:  Aruba,  Bonaire,  Curacao,  Grenada,  Martinique,  St.  Lucia,  St.  Vincent,  and\nTrinidad.  This  cruise  itinerary  is  the  worst  performing  in  the  C&LA  region,  averaging  only\n722,220  visitors  (passengers  &  crew)  per  destination,  compared  to  1.45  million  per  “Eastern\nCaribbean”  destination,  1.12  million  per  “Western  Caribbean”  destination;  and  1.21  million\nper destination in Mexico.  On the Southern Caribbean itinerary, only Aruba (1.13 million) and\nBarbados  (1.06  million)  received  more  than  one  million  cruise  visitors  (passengers  &  crew)\nduring the 2017/18 cruise year.\n\nBarbados experienced mixed fortunes during the recently-concluded 2017/18 cruise year. Cruise\npassenger arrivals reached 730,909, comprising 581,844  regular cruise passengers and 149,065\n“homeporters”  compared  with  the  674,160,  comprising  554,400  regular  and  119,760  “air-to-\nsea” passengers, who arrived in 2014/15. However, average spend per transit cruise passenger\nfor  2017/18  was  only  US$64.05  or  15.6%  below  the  US$75.85  recorded  in  2014/15.  The\nproblem  is  underlined  when  it  is  considered  that  the  2014/15  per  passenger  spend  was  itself\nalready well below the $111.82 figure, achieved nine years earlier in the 2005/06 cruise year.\n\n16 FCCA’s 2018 Cruise Industry Overview\n\n### National Cruise Development Commission\n\nPage 22\n\n\fThere are also indications that the perception of Barbados as a cruise tourism destination has\n#### slipped vis-à-vis other destinations in the region. Indeed, Barbados is now ranked 21st out of 36 with respect to overall shopping experience, 29th in terms of initial shore-side welcome, and 26th\nas it relates to satisfaction with overall prices.\n\nTable 3:  Spending by Transit & Homeporting passengers ($US), 2017/18 cruise year\n\nExpenditure Categories\n\nAv. spend per\ntransit passenger\nAcross the region\n\nAv. Spend  per\ntransit17 passenger\n in Barbados\n\nAv. Spend per\nHomeporting18\npassenger in B’dos\n\nLodging\n\nShore excursions\n\nFood & Bev. at restaurants & bars\n\nClothing\n\nLocal crafts & souvenirs\n\nTaxis/Ground transportation\n\nOther purchases\n\nWatches & jewelry\n\nPerfumes & cosmetics\n\nRetail purchases of liquor\n\nEntertainment/Night clubs\n\nTelephone & internet\n\nElectronics\n\nTotal Av. spend per cruise\npassenger\n\n---\n\n$24.26\n\n  $7.44\n\n$10.11\n\n  $8.09\n\n  $2.70\n\n  $8.43\n\n$34.21\n\n $0.95\n\n $2.52\n\n$0.68\n\n$0.18\n\n$0.10\n\n---\n\n$22.25\n\n$5.05\n\n$7.80\n\n$5.74\n\n$2.82\n\n$5.50\n\n$12.13\n\n$0.12\n\n$1.87\n\n$0.75\n\n----\n\n--\n\n$66.06\n\n$34.65\n\n$7.20\n\n$13.76\n\n$2.59\n\n$6.56\n\n$6.93\n\n---\n\n$1.06\n\n$3.18\n\n$0.80\n\n$1.90\n\n$0.10\n\n$99.69\n\n$64.04\n\n$144.78\n\nDespite an increased number of cruise visitors, the total regular cruise passenger spend in 17/18\nwas only US$30.9M or a decline of US$2.1M (6.4%) from the 2014/15 total of US$33.0M.\n\n17 The 481,767 Transit passengers, who disembarked & visited Barbados during the 2017/18 cruise year, spent\nUS$30.9 million\n\n18 In the 2017/18 cruise year, the 149,065 homeporting or air-to-sea passengers, who started their cruise in Barbados,\nspent US$21.6 million\n\n### National Cruise Development Commission\n\nPage 23\n\n\fOn  the  other  hand,  the  really  good  news  with  respect  to  the  latest  cruise  year  was  the\nperformance of homeporting. This category of cruise passengers recorded solid growth of 24.4%\nover  the  three-year  period  (advancing  from  119,760  to  149,065)  and  there  was  a  spectacular\nincrease in the average spend per homeporting passenger, from US$85.94 per person in 2014/15\nto US$144.78 in 2017/18.\n\nIn assessing these latest figures with respect to homeporters, we should be mindful of the impact\nof  hurricanes  on  other  cruise  destinations  in  the  region  during  the  period  under  review.\nIndications are that the impact of hurricanes during the 2017 season, particularly on St. Maarten\nand  USVI,  drove  additional  homeport  business  to  Barbados  during  2017/18  and  helped  to\nstimulate the trial of extended stay business for Barbados during the same period. Nevertheless,\nthe  reality  is  that  total  homeporting  spend  in  2017/18  was  US$21.6M,  a  significant  increase\nover the US$10.3M recorded in 2014/2015.\n\n2.4  Cruise Tourism’s Economic Impact\n\nDriven by the exceptional performance of homeporting, overall cruise tourism economic impact\nfor 2017/18 was estimated at US$71.0 million compared with US$57.3 million in 2014/15. This\nreflects  an  accumulated  increase  of  23.9%  over  the  three-year  period.  In  terms  of  further\neconomic impact, the US$71.0 million is associated with 1,227 direct and approximately 2,351\nindirect jobs in Barbados.\n\nThe economic benefits of cruise tourism to Barbados flow from three principal sources:\n\n1)  The expenditures by cruise passengers on tours to places of interest, visits to attractions,\npurchases of duty-free items,  such as:  jewelry, clothing etc.  and purchases of souvenirs\n(local arts and craft);\n\n2)  The expenditures by ships’ crews on food and beverages, local transportation, and duty-\n\nfree purchases of clothing and electronics;\n\n3)  The  expenditures  by  the  cruise  lines  for  port  services  (mainly  navigation  and  utility\nservices and taxes, such as: wharfage and dockage fees) and purchases of supplies, such\nas: food and beverages and other stores\n\nSimilar to other small economies in the region, cruise tourism is making a significant impact on\neconomic activity in Barbados. More than fifty-five (55) per cent of the 1.4 million tourists, who\nvisited the country in 2017, were cruise passengers.\n\nThe  630.8  thousand  cruise  passengers,  who  actually  disembarked  and  visited  Barbados  during\nthe  2017/18  cruise  year,  spent  a  total  of  US$52.43  million.  The  resulting  weighted  average  of\nUS$83.12 per passenger, even though it was boosted by the stellar performance of homeporters,\nwas 18.1% below the regional weighted average.\n\n### National Cruise Development Commission\n\nPage 24\n\n\fTable 4:  Economic contribution of cruise tourism, by destination, 2017/18 cruise year19\n\nDestinations\n\nTotal Cruise Tourism\nExpenditures\n($US millions)\n\nTotal Employment\n\nTotal Employee Wage\nIncome ($US Millions)\n\nAntigua & Barbuda20\nAruba\nBahamas\nBarbados②\nBelize\nBonaire\nBritish Virgin Islands\nCayman Islands\nColombia\nCosta Maya\nCosta Rica\nCozumel\nCuracao\nDominican Republic②\nEnsenada\nGrenada\nGuadeloupe②\nGuatemala\nHonduras\nJamaica②\nManzanillo\nMazatian\nMartinique②\nNicaragua\nPanama\nProgresso\nPuerto Rico ②\nPuerto  Chiapas\nPuerto Vallarta\nSt. Kitts & Nevis\nSt. Lucia\nSt. Maarten\nSt. Vincent\nTrinidad\nTurks and Caicos\nU. S. Virgin Islands\n\n  $77.74\n  102.75\n 405.75\n 71.03\n86.12\n30.15\n12.63\n224.54\n59.85\n89.54\n29.24\n474.07\n71.73\n134.72\n40.39\n19.25\n52.94\n11.08\n107.36\n244.53\n 2.71\n15.87\n38.22\n  5.70\n77.75\n32.72\n151.17\n   1.59\n 42.50\n149.28\n59.42\n143.24\n16.43\n  3.50\n86.47\n184.69\n\n1,466\n2,255\n9,004\n2,351\n2,530\n  525\n 234\n4,622\n1,186\n2,081\n  825\n               11,945\n1,106\n4,052\n1,016\n   529\n 994\n 345\n2,198\n8,293\n   58\n420\n 790\n 323\n1,827\n   807\n3,644\n   38\n1,027\n2,065\n1,465\n3,499\n  418\n 116\n1,461\n 3,439\n\n$14.41\n 38.03\n155.71\n25.36\n27.68\n 8.77\n 4.33\n92.24\n 8.56\n13.45\n 5.17\n78.21\n20.73\n17.43\n 7.69\n 3.65\n8.56\n1.66\n11.61\n 56.57\n  0.45\n 2.56\n                  6.43\n                  0.96\n                 12.65\n                   5.02\n 56.00\n   0.25\n   7.27\n 17.64\n11.64\n72.34\n  3.39\n 1.59\n 26.76\n 77.89\n\nTotal – All destinations\n\n$3,356.65\n\n78,954\n\n$902.68\n\n19 Adapted from the BRIA Oct. 2018 study.\n20 CARIFORUM countries are shown in italics\n\n### National Cruise Development Commission\n\nPage 25\n\n\fThe expenditures by ships’ crew, during the cruise  year, totaled US$6.94 million for the 127.8\nthousand  crew  members,  who  disembarked  and  visited  Barbados.  The  weighted  average  of\nUS$54.26 per crew member was significantly higher than the US$40.2 recorded in 2014/15, but\n#### still only ranked 13th in the region and 10.2 % below the regional average.\n\nDuring  the  most  recent  cruise  year,  direct  expenditures  by  cruise  lines  in  Barbados  totaled\n#### US$11.7  million,  which  placed  the  island  in  16th  position  among  the  thirty-six  (36)  C&LA\ndestinations  and  fifth  among  the  seven  homeports  in  the  region.  Only  the  French  islands  of\nGuadeloupe and Martinique performed worse among homeports in the region.\n\n2.5  Essential and transformational interventions needed to overcome the principal\nchallenges confronting cruise tourism in Barbados\n\nSome  of  the  findings  of  the  Commission  with  respect  to  the  conditions  and  challenges,\nwhich  contribute  to  the  underperformance  of  the  cruise  sector  in  Barbados,  were  also\nidentified,  explicitly  or  implicitly,  by  the  studies  referred  to  earlier.  These  shortcomings\nand location-specific impediments, which  have  a negative impact  on the  competitiveness\nof  the  cruise  sector  were  also  identified  by  Daly,  J.  &  Fernandez-St,  K.,  in  their  August\n2017  work  for  the  Duke  Global  Value  Chain  Center,  “Barbados  in  the  Cruise  Tourism\nGlobal Value Chain”.\nThe  principal  challenges  confronting  the  cruise  sector  in  Barbados  and  the  essential  or\ntransformational interventions proposed, include the following:\n\n(1) The aging  and aesthetically limited Bridgetown cargo port has  made a significant\ncontribution  to  development  of  the  cruise  sector  over  the  past  four  decades,  but\ncruise has outgrown this facility.\n\nBarbados  needs  a  dedicated  cruise  terminal.  However,  while  we  are  waiting  for  a  new\ncruise terminal to be constructed, there must be meaningful enhancements to every aspect\nof the cruise passenger experience – docking, transiting the Port, and exiting the Port by\ntour bus or taxi.\n\n(2) After the shore-side welcome, Barbados’ lowest performance in the 2017/18 BREA\ncruise  passenger  survey  was  associated  with  its  shopping  experiences.  Barbados’\nranking  in  the  following  areas  is  indicative  of  the  problems  -  Courtesy  of  store\n#### employees 20th of the 36 destinations; quality of goods 18th; overall prices 26th; and overall shopping experience 21st.\n\nThere  have  been  repeated  calls  in  recent  months  for  Bridgetown  stores  to  open  for\nbusiness  on  public  holidays  when  cruise  ships  are  in  port.  It  is  equally  important  that\nBridgetown merchants, particularly those in the duty-free sector, improve the competitive\nof  their  products  and  the  level  of  customer  service  in  order  to  attract  more  cruise\npassenger business.\n\n### National Cruise Development Commission\n\nPage 26\n\n\f(3) The  Pelican  Village  craft  centre  is  not  delivering.  It  is  too  inward-looking,\n\nuninviting, lifeless and lacking in creativity.\nrecommends  a\n\nThe  Commission\nmerchandising, and marketing in order to breathe new life into the moribund complex.\n\nradical  overhaul  of  ambition,  management,\n\n(4) Historic Bridgetown and its Garrison is the best kept UNESCO Heritage secret.\nIt  is  time  to  work  with  tour  operators,  the  taxi  associations,  the  museums  and  other\nheritage attractions in maximising the opportunities for sharing this heritage site with the\nhundreds of thousands of cruise passengers, who flock to Barbados every year.\n\n(5) Bridgetown is beginning to look like a weary, poorly maintained, and declining city\n\n(a product well pass its sell by date)\n\n#### A visionary transformational approach is  needed if Bridgetown is  to  become a truly 21st\ncentury  smart  city.  This  is  envisaged  in  three  phases  –  cleaning-up  the  city,  establishing\nvisitor centres and expanding the use of technology; introducing more traffic-free streets\nand water taxis; and delivering on transformational initiatives.\n\n(6) The Oistins Bay Gardens is very popular with both visitors and locals, particularly\non  Friday  and  Saturday  nights,  but  the  area  is  in  desperate  need  of  serious\nrehabilitation. The complex looks dirty and poorly maintained.\n\nIt  is  recommended  that  the  refurbishment  of  Oistins  Bay  Gardens  should  be  prioritized,\nbut,  as  far  as  possible,  the  work  should  be  done  in  phases  in  order  to  avoid  a  total\nshutdown of the complex.\n\n(7) Across  the  C&LA  cruise  region,  more  than  twenty-two  per  cent  (22%)  of\nhomeporters are spending an average of two and a half pre &/or post hotel nights in\nthe homeport. In Barbados, the figure is seven per cent (7%), who only spend one\npre or post hotel night. Furthermore, in the 2017/18 cruise year, the average ‘spend’\nper  homeporter  in  Barbados  was  more  than  two  and  a  quarter  times  the  average\n‘spend’ by a regular cruise passenger.\n\nClearly  Barbados  has  considerable  scope  to  improve  these  numbers.  It  is  recommended\nthat Barbados should place much more of its business facilitating and promotion emphasis\non increasing the number of “homeporting” cruise passengers as well as the extra nights\nthey spend in Barbados.\n\n(8) A persistent complaint from cruise line executives has been that there is not enough\nvariety in the Barbados product offering of attractions. However, when cruise line\nexecutive  visit  the  island  on  “familiarization  trips”,  they  are  moved  to  comment\nfavourably on the number of attractions that they did not know existed.\n\nBarbados  must  do  a  better  job  in  facilitating  the  emergence  of  new  attractions  and  tour\n\n### National Cruise Development Commission\n\nPage 27\n\n\foperators  and  of  promoting  all  of  the  “product”  that  can  be  made  available  to  cruise\npassengers.\n\n(9) Foster & Ince, a major player in the distribution of the cruise tourism product, has\nmade  an  outstanding  contribution  to  the  development  of  the  cruise  industry  in\nBarbados over the past forty plus  years. However, their dominance in and control\nof the key aspects of the industry present a significant challenge for new small and\nmedium-sized businesses interested in working with cruise lines.\n\nThis situation raises questions about the level of competition, equal access to markets, and,\nof  course,  how  best  to  foster  “…  the  active  participation  and  investment  of  small  and\nmedium-sized  enterprises  in  the  development  and  diversification  of  the  local  cruise\nsector”.\n\n(10)\n\nSmall and medium-sized Barbadian companies, seeking to enter the cruise\ntourism  sector,  often  seem  ill-prepared  to  engage  with  international  partners  and\noften  complain  about  the  onerous  requirements.  In  the  circumstances,  it  is  not\nsurprising that many of them fail to make a favourable impression.\n\nBarbadian  SMEs need to raise their game in  order  to  compete successfully in  the cruise\ntourism  sector.  They  must  become  more  outward-looking,  more  engaging  with\ninternational  partners,  and  knowledgeable  about  how  international  business  works.\nBarbadian  small  businesses  need  to  fully  understand  the  nuances  of  the  cruise  sector\ncompared with conventional stay-over tourism.\n\n(11)\n\nBarbados’  road  network  and  the  general  physical  environment  –  verges,\n\nparks and beaches – is in an embarrassingly poor condition.\n\nBarbados  must  execute  urgently  a  sustained  island-wide  road  rehabilitation  programme\nand  agencies,  such  as  the  NCC  must  do  a  much  better  job  of  maintaining  the  physical\nenvironment.\n\nIn  chapter  one  of  this  Report,  we  outlined  the  context  within  which  the  National  Cruise\nDevelopment  Commission  (NCDC)  was  established.  Chapter  two  allowed  us  to  provide  an\noverview of the underperformance of Barbados’ cruise sector in recent years, to review some of\nthe  challenges  facing  the  sector,  and  to  introduce  some  of  the  essential  or  transformational\nproposals to overcome the identified challenges.\n\nSubsequent  chapters  of  the  Report  will  analyse  some  specific  problem  areas  and  propose\nalternative  approaches  or  corrective  actions.  The  Report  will  also  consider  some  fundamental\nchanges  with  respect  to  market  segments;  will  underline  the  importance  of  facilitating  the\nemergence  of  new  ‘product’;  and  will  assess  the  sector’s  institutional  framework  in  order  to\nrecommend some strategic adjustments.\n\n### National Cruise Development Commission\n\nPage 28\n\n\f3.0  Barbados’ Key Infrastructures Below Par\n\n3.1  Port experience of cruise passengers visiting Barbados must be enhanced\n\nThe  need  for  major  expansion  of  the  existing  Bridgetown  Port  or  the  construction  of  a  new\ndedicated Cruise Port and Terminal has been embraced by all cruise sector stakeholders and has\nbeen under serious consideration for a number of years. All parties seem to agree that any new\nCruise  Terminal  should  be  located  closer  to  the  centre  of  Bridgetown,  but  there  are  some\ndifferences about the best location. There are also concerns that incorporating a large purpose-\nbuilt shopping facility in a Cruise Terminal within easy walking distance of the City Centre will\nbe a major blow to retail business in the City and is likely to contribute to the eventual demise of\nBridgetown.  Given the uncertainty surrounding Sugar Point et al, this Report will proceed on the\nbasis  that  Barbados  is  still  some  years  removed  from  any  new  Cruise  Terminal.  In  the\ncircumstances, the actions discussed below are relevant in enhancing the performance of the Port\nwith respect to the handling of cruise ships and passengers, in the short to medium term.\n\nThe  Port  is  critical  to  the  Cruise\nsector.  Indeed,  one  of\nthe  key\nrequirements  of  cruise  lines  is  an\naccessible  port  and  a  second  major\nconsideration  is  the  availability  of\nfor\ngood\nhandling\na  welcoming\npassengers\nenvironment at the Port. In addition,\ninfrastructural\nbeyond\nconsiderations,\nand\narrival\nthe  first\ndisembarkation  provide\nopportunity to give the cruise passengers a warm welcome to Barbados. Indications are that the\noverall  arrival  experience  for  cruise  passengers  in  the  Barbados  Port  is  below  what  is\nexperienced in most other Ports in the region.\n\nfacilities\nand\n\nthe\n\nthe\n\nThe BTPA’s 2016 Cruise Sector Audit cited this issue by referring to a comment from a cruise\nline executive that “in Grenada, guests always speak about the warm welcome they receive at the\ngangway……”  and  observing  that  Barbados’  welcome  does  not  measure-up  to  that  desired\nvisitor experience.\n\nThere have been other negative comments about the first impression conveyed by the Port and,\n#### in  the  2017/18  BRIA  study,  Barbados  was  ranked  only  29th  out  of  36  Caribbean  &  Latin\nAmerican  destinations  in  terms  of  passenger  satisfaction  in  response  to  the  question  “How\nsatisfied were you with your initial shore-side welcome?” .\n\n### National Cruise Development Commission\n\nPage 29\n\n\fThe management team at the Port appreciates the need for change and steps are being taken to\naddress some of the issues. However, as we begin a new calendar year, more urgency should be\nbrought to the amelioration of these problem areas, particularly the low-key shore-side welcome,\nthe  dangerous-looking  simultaneous  movement  of  pedestrians  and  vehicles/equipment  in  the\nPort, and the challenging tour bus and taxis dispatch areas.\n\nSome of the initiatives discussed below might seem basic, but if such simple steps are going to\nmake a cruise line and the three or four thousand passengers arriving in Barbados aboard each of\nits  ships  happy,  the  Commission  recommends  that  Barbados  should  embrace  the  “simple  but\neffective”.\n\nFirst, the  dock/shore-side welcome, both  the built  and personal  aspects  need a major upgrade.\nWith respect to the built aspect, the use of murals to beautify the doors on the water side of shed\nthree  (3)  reflects  some  progress  since  2016.  However,  shed  three  (3)  can  also  be  freshened-up\ninternally and on the land-side (to improve the Port welcome as well as Immigration & Customs\nprocessing ambiance for Air-to-sea cruise passengers/Homeporters).\n\nShed two (2), which all  arriving cruise passengers  can see  close-up on their way to  the Cruise\nTerminal,  needs  to  be  similarly  decorated.  There  have  been  some  observations  about  the  high\ncost  of  murals,  such  as  those  placed  on  shed  three  (3).  In  the  circumstances,  perhaps\nconsideration  should  be  given  to  using  pictorial  advertisements  of  key  tourists  attractions\n(Harrison’s  cave,  changing  of  the  guard  at  the Garrison  in  their  zouave  uniforms,  Parliament\nbuildings, a beach scene, one of the gardens etc.,). In other words, the Port might be able to earn\nsome advertising revenue and at the same time secure the desired decoration of the doors to its\nsheds.\n\nIn  terms  of  the  personal  aspect,  a  welcoming  interactive  approach  is  needed.  For  example,\nperhaps a small steel pan band or tuk band (attired in colourful matching outfits), plus 4 or 5 stilt\nwalkers (also in colourful outfits), and a few individuals (male & female colourfully attired and\nlooking  happy)  on  a  platform  behind  the  steel  pan  band  supporting  a  banner,  which  reads\n“Welcome  to  Barbados”.  The  idea  is  to  present  a  welcoming  picture,  characterized  by  fun,\ninfectious music, bold colours and a ‘we are happy to welcome you to our shores’ ambiance.\n\nSecond, there is a need for Improved Signage throughout the Port & Cruise terminal as well as\non Trevor’s way. My understanding is that the Port is installing new standardized signage, some\nof which is now in place and the remainder will be installed as soon as they are delivered by the\nlocal  manufacturer.  The  new  signs  will  use  English,  plus  easily-recognised  international\nsymbols.\n\n### National Cruise Development Commission\n\nPage 30\n\n\fThird,  the  Port  needs  to  have  appropriate  arrangements  for  the  safe  movement  of  cruise\npassengers,  throughout  the  Port.  There  should  be  a  clearly-spelt  out  regime,  incorporating\nprocedures  for  regulating  vehicular  and  pedestrian  movements  to  ensure  that  the  two  do  not\ncome into conflict. This regime should be shared and discussed, as necessary, with all relevant\nparties  to  ensure  that  everyone  involved  understands  what  is  expected.  In  addition,  adequate\ntransportation,  including  vehicles  specially-equipped  for  the  differently-abled,  should  be\navailable to move passengers from the Breakwater or other distant berths to the Cruise Terminal.\n\nPort  management  has  indicated  that  this  area  of  concern  is  being  addressed  and  a  number  of\ntrams have already been acquired to transport passengers. However, the trams have not yet been\ncommissioned  and  therefore  are  not  in  service.  In  other  words,  the  Port  is  still  relying  on  the\ninadequate bus fleet to transport cruise passengers across the Port.\n\nFourth,  Creating  branding/marketing  opportunities  –  Deliberate  efforts  should  be  made  to\nplace “Welcome to  Barbados” signs  and related images strategically in  positions where cruise\npassengers  might  be  motivated  to  take  selfies  and  other  photos  to  post  on  their  various  social\nmedia platforms showing friends and relatives that they are in Barbados.  This simple action can\nhelp to brand and market Barbados as a welcoming destination for visitors.\n\nFifth,  the  Tour  Bus  Dispatch  area  -  The  area  reserved  for  tour  buses  to  pick-up  cruise\npassengers needs proper organization. When the area was used, on a regular basis, by only one or\ntwo tour operators, the process could have been virtually self-managed.\n\nHowever,  a  number  of  additional  tour  companies  and  entities  marketing  attractions  have  now\napplied for and been granted permission to pick-up passengers from the Cruise Terminal. With\nthe additional tour companies and buses to be accommodated, the process has not been working\nas  it  should.  One  of  the  new  players,  after  complaining  verbally  on  a  few  occasions,  wrote\nrecently  to  complain  that  more  than  once  already  this  season  her  ‘pick-up’  operation  has  been\ncompromised because two of the four bus bays, assigned to  her company, were occupied by  a\nrival  tour company. This is  a problem, which is  having  a negative impact,  not  only on current\nactivity  at  the  loading  bays,  but  also  potentially  on  the  willingness  and  ability  of  other  tour\noperators to offer services to cruise ships and their passengers.\n\nPort management acknowledges the problem and is working on a solution, but challenges remain\nand a fully workable solution must be developed, discussed with the applicable stakeholders, and\nimplemented  with  some  urgency.  The  status  quo  is  neither  desirable  nor  sustainable  and  this\nmatter will not resolve itself to the betterment of Barbados.\n\n### National Cruise Development Commission\n\nPage 31\n\n\fProposed tour bus dispatch system\n\nThe Port/Cruise Terminal must take charge of the tour bus dispatch arrangements and introduce a\nnew regime, which takes into consideration the reality of greater demand and a larger number of\n‘players’. Some options for consideration include:\n\n  Instituting  a scheduling  system with  a particular bus bay or bays  assigned to  “Operator\n‘A’ or ‘B’ for a pick-up at a given time (i.e. 9.00 a.m.) and departure by a certain time\n(i.e. 9.30 a.m.). This type of scheduling works at busy airports and bus terminals around\nthe world.\n\n  The Tour Operators would be required to schedule their pick-ups and share their schedule\nwith  the  applicable  Port  Manager  well  in  advance  in  order  to  facilitate  any  necessary\nadjustments, where pick-up times might conflict.\n\n  Tour  operators  would  be  required  to  keep  their  buses  in  a  “holding  area”  close  to  the\nCruise Terminal and only approach the loading bays at their scheduled pick-up times.\n  A  holding  area  could  be  designated  within  the  Port  compound,  if  possible  &  practical\ngiven space and security considerations. If not, on some of the vacant land in the BIDC\nindustrial park, immediately outside of the Port.\n\n  A proper PA system (it must be audible in the cruise terminal & the tour dispatch area)\nshould be introduced to announce the departure of each tour, 15 minutes before scheduled\ndeparture and at departure time. This would require each tour to be identifiable by those\nvisitors  taking  that  particular  tour  and,  of  course,  by  the  tour  operator  representative\nresponsible for boarding the tour.\n\n  Tour operators would be prohibited from “parking” their buses in the pick-up area during\nbusy  pick-up  and  drop-off  times,  except  when  they  are  making  scheduled  pick-ups  or\ndrop-offs.\n\nThe  proposed  system,  like  all  systems  with  a  number  of  moving  parts,  requires  discipline,\ncooperation, and conformity to the agreed rules. The system should include a contractual “code\nof conduct” and enforceable obligations on both sides. The arrangements should be discussed at\nmeetings with all of the tour operators (perhaps two or three meetings to address concerns and\nagree  on  any  necessary  operational  adjustments).  Most  importantly,  the  new  regime  must  be\nenforced even-handedly and there must be penalties for violators.\n\nProposed Taxi dispatch system\n\nThe arrangements for taxis picking-up passengers are even more contentious than those for tour\nbuses.  Although  a  “dispatch  system”,  which  had  been  developed  primarily  by  the  taxi\nassociations, has been in place for sometime and was supposedly governed by a code of practice,\nthe  code  is  not  followed.  Infractions  are  common  and  every  rule  is  routinely  broken  with\nimpunity. Consequently, there is no semblance of order.\n\n### National Cruise Development Commission\n\nPage 32\n\n\fMany of the taxi operators also complain that the Associations’ executives take the best jobs for\nthemselves  and  give  them  the  “leftovers”.  One  regular  port  taxi  operator  stated:  “I  respect  the\nrules, but if the executives are going to go past the line and get the best work then I have to go\npast the line too, to get work. If I wait for what they leave back, I get the scraps. I have no choice\nbut to break the line too”.\n\nTaxi operators who seek to abide by the code of practice often come into conflict with those who\nignore  the  rules  and  solicit  jobs  outside  of  the  system.  This  ‘hustling’  often  encourages  cruise\npassengers to congregate or walk about in the road in order to negotiate their tour. Clearly this\nraises safety concerns and if anyone of these passengers is struck by a vehicle, the Port would be\nliable.\n\nThe letter, reproduced below, was sent to Port management by one of the cruise lines in January\n2018. It should be evident that the type of behavior referred to in the letter will have a negative\nimpact on visitor perception of Barbados. The letter reads:\n\n        “ Good afternoon ?????,\n\n             May we ask for your assistance in relaying some observations from our guests to the\n             local port authorities pertaining to the taxis inside the pier yesterday.\n            The taxi drivers inside the pier were quite aggressive, not directly to our guests,\n            However amongst each other.\n\nThey were fighting over passengers and at some point became physical with each other\nmaking our guests feel unsafe and scared.\nWe are not sure if there is only 1 taxi company or taxi union who is allowed to access the\npier, however they seem to be in tight competition for getting passengers\n\n             Best Regards”\n\nThe cruise line further indicated that their passengers were so terrified by the aggression of the\ntaxi  drivers  in  the  Cruise  Terminal’s  courtyard  that  they  cancelled  their  plans  for  touring  and\nreturned  to  the  vessel.  Therefore,  the  passengers  never  left  the  Port  and  never  even  had  the\nopportunity to spend any money in Barbados. We do not know who or what benefitted from this\nincident, but we are certain that Barbados did not benefit.\n\nThe  letter  above  is  one  of  a  number  of  reports  about  taxis  drivers  quarreling  (even  sometimes\nphysical altercations) with each other and generally confusing &/or terrifying visitors. This type\nof behavior must remain in the past. The political directorate, Port management, and the taxi\nassociations must all stand firm against such unruly behavior. Responsible leaders (public\nor private sector) simply cannot justify ‘aiding and abetting’ or ‘turning a blind eye’ while\na recalcitrant and selfish minority destroys the integrity of an entire sector.\n\n### National Cruise Development Commission\n\nPage 33\n\n\fIn the circumstances, the Port feels obliged to introduce a new system.  However, the two taxis\nassociations,  with  permission  to  operate  in  the  Port,  are  not  happy  with  the  proposed  new\ndispatch  arrangements.  Port  management  and  the  Associations  have  been  engaged  in  a  “back-\nand-forth”  over  the  past  few  weeks,  during  and  between  structured  meetings,  with  each  side\nblaming the other for perceived shortcomings in the system. The two sides continue to exchange\nviews on the new dispatch system and it is hoped that they will soon find a mutually-acceptable\narrangement.\n\nThe  previous  system,  featuring  multiple  taxi  lines,  seems  unnecessarily  complicated  to\nadminister  and  prone  to  abuse.  A  simple  system  with  one  line  and  controlled  by  independent\ndispatchers  might  be  the  best  arrangement.  In  the  circumstances,  the  following  system  is\nproposed for consideration.\n\nThere  should  be one  (1)  dispatch  line,  regulated  by  Taxi  Dispatchers.  Over  time,  the  laws  of\nprobability will distribute short, intermediate & long trips. There should be provision that when\nthere are parties of 4/5 or more, the closest maxi-taxi in the cue will be called forward to take\nthat trip.  Alternately, there could be a separate line reserved only for maxi-taxis.\n\n1)  There  should  be  a  contractual  arrangement  between  the  Port  and  the  Taxi  Associations\nauthorized  to  work  in  the  Port  and  the  contract  should  include  a  \"Code  of  conduct\",\nwhich should be approved by both the Port & the taxi associations.\n\n2)  The  code of  conduct  should  comprise  obligations  on  both  sides  and  must include\nenforceable penalties and these penalties must be enforced impartially (there should be\nno doubt in anyone's mind about the consequences for violating the agreed code of\nconduct).\n\n3)  In addition to the obligations of individual taxi operators, the taxi associations should also\nbe  subject  to  evaluation  and  penalties  when  the  associations  do  not  fulfill  their\nresponsibilities.\n\n4)  The  Port  should  also  consider  going  out  to  tender,  perhaps  every  three  or  five  years,\nprovided other interested taxi associations can satisfy the operating criteria stipulated by\nthe Port.\n\nPort management and the Taxi Associations need to develop and try a new dispatch system ‘in\ngood  faith’.  The  arrangement  should  provide  for  periodic  reviews  and  discussion  about  any\nnecessary adjustments, based on actual empirical evidence of what is working and what needs to\nbe modified.\n\nWhile some of the problem areas mentioned above may be cumulatively important, they seem\nrather  cosmetic  when  compared  to  the  continuing  problems  in  the  Tour  Bus  and  Taxis\nDispatch  areas.  Taking  control  of  and  properly  managing  the  two  dispatch  areas  is  a\nchallenge that must be addressed urgently because it has the potential to damage seriously the\nperception of Barbados as a welcoming, well-regulated and orderly society. It could also have\n\n### National Cruise Development Commission\n\nPage 34\n\n\fthe impact of dissuading new and innovative entrepreneurs from offering services to the cruise\nsector because they become completely “turned-off” by the chaos.\n\nPort  entrance  &  exit  –  The  process  of  entering  and  exiting  the  Port’s  main  gate  seems\nunnecessarily slow, whimsical and prone to bottlenecks. The problem seems to  revolve around\nthe  capacity  to  deploy  an  adequate  number  of  Customs  &  Immigration  officers  in  a  timely\nmanner. This is an irritant, which can easily be addressed if and when those responsible decide to\nsolve the problem.\n\nIn  addition  to  the  need  to  deploy  additional  Customs  &  Immigration  officers  when\nthree/four/five cruise ships are in Port, there seems to be issues of consistency. One tour operator\nreports  that  their  tour  was  recently  leaving  the  Port  with  a  load  of  passengers  and  scuba  gear,\nwhen they were required to return to the Terminal to secure a clearance form for the equipment.\nThis  was  a  surprise  and  an  inconvenience  (a  40-minute  delay)  because  they  had  previously\noffered and delivered golfing and scuba diving tours without any problems.\n\nWe are not at all questioning the right of the persons controlling the gate to ask for a clearance\nform, if one is required. Our concern is with clarity and consistency. If a form is required, this\ninformation should be communicated to the tour operators and it would be their responsibility to\nensure they have the form. If the form is demanded by some persons manning the gate and not\nby  others,  that  is  also  a  problem.  There  should  be  established  procedures,  which  are  clearly\ncommunicated  to  those  transacting  business  in  the  Port.  In  this  way,  there  is  no  uncertainty  or\nconfusion about what is required. This is a fundamental, first step, in implementing best practice.\n\nIt  is  not  far-fetched to  imagine this simple incident  leading to  a cruise line becoming skeptical\nabout  the  capacity  of  the  new  tour  operator  to  handle  their  business  or  about  their  passengers\nhaving  good  experience  in  Barbados.  Then  we  wonder  why  we  are  falling  behind  our\ncompetition. Barbados is considered to be a well-established premier destination, we must live-\nup to those standards.\n\nChaotic scene in front of Port exit - The congregation of taxis and drivers outside of the main\nentrance/exit of the Port is another problem that should be addressed sooner rather than later. The\nlarge number of taxis in front of the exit tend to obstruct the flow of traffic and presents a chaotic\nspectacle.  In  addition,  in  their  quest  to  secure  business,  the  drivers  often  aggressively  solicit\nvisitors  and  the  verbal  exchanges  between  drivers  can  be  boisterous.  This  scene  can  be\nintimidating  for  visitors,  particularly  elderly  persons  who  are  unaccustomed  to  travel  in  the\nCaribbean.\n\nPort management is working on a solution, which would limit the number of taxis parked in front\nof  the  Port  exit  and  the  majority  would  be  parked  in  a  holding  area  close  to  the  Port.  The\nCommission  supports  this  approach  to  regulating  the  large  number  of  taxis,  which  previously\nwere stationed at the main exit from the Port. It is hoped that steps can also be taken to curb the\naggressive solicitation by the taxi drivers – six drivers jostling each other and shouting at visitors\n\n### National Cruise Development Commission\n\nPage 35\n\n\fcan  also  have  a  serious  negative  impact  on  visitors’  comfort  level  and  their  perception  of  the\ndestination.\n\nLighting & maintenance of Trevor’s way. As we get more into homeporting & ships remaining\nin  Port  for  late  night  sailings.  Lighting  comes  more  into  focus.  Women  have  commented  that\nthey would not walk on Trevor’s way after dark and  observed that the area looked too dark and\ndangerous for cruise passengers to be walking in that area at night.\n\nIn  reality,  the  lighting  on  Trevor’s  Way  is  oriented  towards  the  main  road,  Princess  Alice\nHighway, so that someone standing or crouching away from the road and trying to avoid being\nseen could be difficult to detect.\n\nThere have also been observations about the unsatisfactory maintenance of Trevor’s Way. Given\nthat  cruise  passengers  walking  out  of  the  Port  inevitably  walk  on  Trevor’s  Way,  every  effort\nshould  be  made  to  ensure  that  it  can  be  seen  as  a  creatively-presented,  well-maintained,  and\nverdant area.\n\n3.2  The ‘pilot project’ re cruise ships berthing on the West Coast should be expedited\n\nIn recent months, shipping agency representatives and tourism officials have been approached by\na number of cruise lines, which operate smaller “high-end” cruise ships, about the possibility of a\nberthing location in a more exotic location, away from the Bridgetown Port.\n\nDiscussions  with  the  interested  cruise  lines,  in  conjunction  with  the  Bridgetown  Port  and  the\nBTMI,  have  resulted  in  the  identification  of  both  Holetown  and  Speightstown  as  possible\nanchorage locations on the west coast.  However, tangible progress has been painfully slow and\nno agency seems ready to take charge of the matter, determine what needs to be done, and move\nthe process forward to a resolution.\n\nNevertheless, in December 2018, a team from one of the interested cruise lines came to Barbados\nfor a site visit on the west coast. Speightstown seems to be the preferred location and the findings\nof the cruise line’s team may be summarized as follows:\n\n-  A direct beach landing  with “beachers/launches” seems difficult because of the number\nof rocks on nearby beaches and the fact that the launch’s engine is below water level;\n-  The  beaches  in  the  area  are  small  and  poorly  maintained  (they  are  dirty  and  do  not\n\ncompare favourably with beaches in with other Caribbean destinations).\n\n-  A  tendering  operation  using  the  jetty  is  not  possible,  at  this  time,  because  the  jetty  is\n\n-\n\ndamaged;\nIf it is decided to repair the jetty, it will still be necessary to provide some type of ‘step up\nand step down’ to facilitate the disembarkation and embarkation of passengers because of\nthe height of the jetty compared with the low platform of the “beachers”; and\n\n### National Cruise Development Commission\n\nPage 36\n\n\f-\n\nIf  Government  is  interested  in  exploring  the  potential  of  the  destination, we  (the  cruise\nline’s technical staff) will be more than pleased to assist.\n\nGiven the lack of urgency with which government agencies seem to be handling this matter, the\nrelevant  cruise  lines  might  already  be  wondering  whether  Barbados  is  really  interested  in\nfacilitating this option.\n\nIf it has been decided that Barbados should not enable the anchoring and landing of cruise ships\non the  West  Coast, this  information  should be communicated to  the cruise lines  without  undue\ndelay – stringing along serious business persons is always a bad idea. On the other hand, if it is\nthought  that  this  initiative  is  likely  to  benefit  the  cruise  tourism  sector  in  Barbados,  some\nindividual or entity needs to take the lead in making it happen.\n\nThe ‘anchoring and tendering’ approach, which would have to be used for a west coast landing,\nis  itself  not  a  problem  for  the  applicable  cruise  lines  and  their  passengers.  These  small  luxury\nships, which habitually go into more unusual bays or landing areas, have their own landing craft\n(beachers/zodiacs)  which  they  use  to  ferry  their  passengers  from  the  anchored  ships  to  the\nonshore landing area.\n\nFigure 3: A typical ‘beacher’ on the beach at Speightstown. Note the low boarding platform\n\nA Holetown/Speightstown landing area would be perfect for these smaller luxury ships, carrying\nhundreds rather than thousands of passengers (usually only a few hundred). This initiative could\nbe  a  good  opportunity  to  expose  the  north  of  the  island  and  create  much-needed  economic\nactivity  in  the  greater  Speightstown  and  Holetown  areas.  In  addition,  attractions  such  as  the\nAnimal  Flower  Cave,  River  Bay,  Cherry  Tree  Hill,  St.Nicholas  Abbey,  East  Coast  Road  etc.\nwould become more readily accessible to cruise passengers, who are on the island for only a few\nhours.\n\n### National Cruise Development Commission\n\nPage 37\n\n\fGiven  that  a  west  coast  landing  could  possibly  be  accommodated,  on  an  interim  basis  (pilot\nproject), with very little infrastructural work, it is recommended that every effort should be made\nto take advantage of this opportunity. If Barbados is able to use this “pilot phase” to demonstrate\nthat a West Coast anchorage can work well, both for the cruise lines and for public and private\nsector stakeholders in Barbados, the relevant cruise lines might be persuaded to plan more West\nCoast landings for the coming seasons. In addition, other cruise lines might also be influenced to\ntake their smaller ships to the Holetown/Speightstown area.\n\nFigure 4: Broken jetty at Speightstown. Repaired jetty would be useful to both locals & visitors\n\nThe real concern with respect to this matter is the seeming level of uncertainty about how best to\nproceed  and  the  concomitant  inaction.  If  Barbados  is  unable  or  unwilling  to  demonstrate  the\nlevel  of  interest  and  degree  flexibility  to  satisfy  a  relatively  straightforward  customer  request,\nthere is the possibility that the cruise lines will find another destination, which is more customer-\nfriendly, service-oriented and willing to act with a sense of urgency when the situation demands.\n\n3.3  GAIA needs to plan for the increasing air-to-sea demand\n\nOne  might  wonder  about  the  GAIA’s  connection  to  cruise  tourism.  The  answer  lies  in\nhomeporting  (the  air-to-sea  transfer).    One  of  the  important  aspects  of  homeporting  is  the\nlogistics  arrangements  for  handling  arriving  and  departing  air-to-sea  cruise  passengers.  The\ncurrent  provisions  for  arriving  passengers  seem  to  work  satisfactorily  with  the  passengers\narriving  by  charter,  being  met  on  the  tarmac,  and  transported  directly  to  a  check-in  facility  in\n\n### National Cruise Development Commission\n\nPage 38\n\n\fShed 3 at the Bridgetown Port.  However, there are indications that the available transportation\nequipment is already stretched to properly service this arrangement.\n\nIn  the  circumstances,  GAIA  will  need  to  develop  a  regime  that  will  enable  it  to  handle  larger\nnumbers satisfactorily as we pursue a strategy of growing the more lucrative homeporting aspect\nof cruise tourism. The most appropriate arrangement might necessitate the scheduling of air-to-\nsea arrivals to ensure that the system can comfortably handle the increased numbers. In an ideal\nscenario,  some  homeporters  would  arrive  on  island  three  or  four  days  before  sailing,  others\nwould arrive two or three days before etc.\n\nUnlike the arriving air-to-sea passengers, the departing homeporters have been facing long lines\nto  clear  security  checks  at  the  airport  and  a  crowded  Departure  Hall  in  which  to  await  the\nboarding  call  for  their  flights,  particularly  on  weekends.  The  recent  elimination  of  outbound\nimmigration has enabled the airport to install additional security screening positions to facilitate\ndeparting passengers. A new departure area (gates 14 – 22) was opened in January, specifically\nto accommodate cruise passengers. These arrangements represent a step in the right direction and\nshould improve the airport transit experience of departing cruise passengers.\n\nThe  question  of  sufficient  capacity  to  handle  satisfactorily  the  number  of  cruise  passengers  is\nalready  a  concern  and  the  situation  will  be  exacerbated  as  homeporting  expands.  In  the\ncircumstances, as discussed earlier with respect to arrivals, the most practical arrangement might\nnecessitate the scheduling of departures in a phased manner.\n\n3.4  Visitor centres, information kiosks & public toilets needed\n\nPublic toilet facilities throughout the island are often either inadequate in number or in a state of\ndisrepair or are closed without notice. Non-existent or broken hand driers – malfunctioning taps\n–  missing  toilet  tissue  –  broken  or  missing  toilet  seat  covers  –  unsanitary  facilities.  These  are\nsome of the problems with public toilet facilities across the island, from Bridgetown to Ragged\nPoint and everywhere in between.\n\n#### In 21st century Barbados, there must be adequate public toilet facilities at the following places,\ninter alia:\n\nIn Bridgetown, Holetown, Speightstown, and Oistins;\n  At major bus terminals in Bridgetown and elsewhere;\n\nIn shopping malls and other major shopping or entertainment venues; and\n  At visitor centres, heavily-trafficked public beaches and popular attractions\n\nThere  is  also  a  need  to  provide  satellite  locations  on  roads  which  are  normally  used  by  tour\nbuses,  taxis,  self-driven  visitors,  and  sight-seeing  Barbadians.    These  visitor  centres  would  be\nconvenient  locations  where  visitors  can  seek  information,  purchase  maps,  take  a  refreshment\n\n### National Cruise Development Commission\n\nPage 39\n\n\fbreak, and acquire authentic Barbadian souvenirs. In addition, the centres and their toilets must\nbe  designed  to  accommodate  the  ‘differently-abled’,  who  are  taking  cruises  in  increasing\nnumbers.\n\n3.5  Road infrastructure, sidewalks & overall physical environment must be addressed\n\nThe  lack  of  adequate  infrastructure  often  prevents  cruise  passengers  from  visiting  interesting\ntourist  attractions  or  landmarks.  Therefore,  it  is  important  to  have  good  transport  connections\nbetween the Cruise Terminal and important heritage sites or other attractions. In theory Barbados\nshould not have concerns about easy road access to any attraction, but in reality, roads across the\nisland are in such a state of disrepair that it is now a valid question to ask about vehicular access.\nBarbados  needs  a  serious  and  sustained  road  rehabilitation  programme.  Merely  patching  the\noccasional street will not do.\n\nFigure 5:  Derelict vehicle beside the road in Christ Church, Nov. 2018\n\nAssociated with road rehabilitation is the issue of overall maintenance of the environment. There\nis bush everywhere and, in some areas, uncontrolled shrubbery covers significant portions of the\nroadway.  Abandoned  vehicles  litter  the  roadside  and  it  has  been  reported  that  some  cruise\npassengers, particularly Europeans, wonder why there is so much debris and uncollected garbage\n\n### National Cruise Development Commission\n\nPage 40\n\n\fby the roadside. The verges and other greenery, which are intended to help beautify and “soften”\nthe roadside, have been allowed to get out-of-control. The NCC needs to make a serious effort to\nregain control of the environment.\n\nFigure 6:  This stop sign is barely visible behind overgrown roadside bush in Christ Church\n\n3.6  Transport vehicles must be subject to minimum standards\n\nTour  buses  in  Barbados  are  usually  maintained  in  relatively  good  condition.  Nevertheless,  as\nsteps are taken to establish and enforce minimum standards throughout the cruise tourism sector,\nappropriate  standards  should  be  put  in  place  with  respect  to  vehicles  providing  transportation\nservices to the tourism market.\n\nTaking into consideration the importance of visitor safety and the requisite high level of liability\ninsurance cover, certain standards should be mandatory for tour buses and taxis. These vehicles\nshould  be  subjected  to  annual  inspections  to  ensure  that  they  are  sound  mechanically  and  that\nbodywork and upholstery are in good condition.\n\nIn  addition,  tour  buses  should  be  appropriately  equipped  with  properly-functioning  public\naddress  systems  as  well  as  video  systems  and  screens.    The  video  systems  could  be  used  to\nenhance  the  visitor  experience,  by  showing  images  of  popular  attractions,  amazing  Barbadian\nscenery etc.\n\n### National Cruise Development Commission\n\nPage 41\n\n\f4.0  It is time to restore Pelican Village, Bridgetown, & Oistins\n\n4.1  A New Lease on Life for Pelican Craft Centre\n\nThe Pelican Craft Centre, which is adjacent to Trevor’s Way, is floundering under the burden of\nnumerous  shortcomings.  The  first  problem  is  the  lack  of  proper  signage  -  directional,\npromotional, or interpretative.  As an example, there is a sign, just off the roundabout by the exit\nfrom the Port. The sign is promoting “Pelican Centre”, but there is no indication that indigenous\narts  and  craft  are  being  sold  in  this  ‘centre’.  The  sign  advertises  ‘Fine  Food’,  Great  gifts’  and\n‘Free Wifi’. Unfortunately, the word “craft” does not appear anywhere on the sign - this is not a\nsuitable  sign  to  advertise  the  island’s  largest  craft  centre,  particularly  one  that  already  suffers\nfrom an identity crisis.\n\nIn addition to the signage issue, the Pelican Craft Centre also has the appearance of a “block of\noffices”  rather  than  a  vibrant  location  marketing  a  range  of  local  arts  and  craft.  There  is  no\nactivity and no visible evidence from the main road (Princess Alice Highway) or Trevor’s Way\nthat this complex is a centre of arts and craft production and/or sale.   Consequently, the centre\nneither appeals to nor attracts cruise passengers or Barbadians, who usually go pass the centre on\ntheir way to and from Bridgetown.\n\nThere  have  been  many  negative  comments  about  the  Pelican  Craft  Centre  complex,  including\nthat it is a waste of prime real estate, which could be used more productively.  Even Barbadians\ncomplain  that they  do not  know what  goes on in the complex. The reality is  that there is  little\neffective advertising either locally or to cruise passengers.\n\nThe situation in Pelican is exacerbated by the fact that, on the one hand, many of the tenants are\nmaking few sales and have not been paying their rent. On the other hand, the landlord (BIDC)\nthinks that the tenants are not trying hard enough to make sales and to pay their rent. Persons on\nboth sides of this divide are gloomy and pessimistic.\n\nPelican craft centre must address the following three major challenges:\n\n1)  The  need  to  get  the  attention  and  arouse  the  curiosity  of  cruise  passengers  and  others\n\ntraversing Trevor’s Way;\n\n2)  The  need  to  attract  passersby  and  others  to  come  into  the  Pelican  Village  shops  to  see\n\nwhat is being sold; and\n\n3)  The  need  to  motivate  those  who  come  into  the  craft  center  to  purchase  locally-made\n\nitems.\n\nPelican craft centre requires a complete re-think if it is going to confront these three challenges\nsatisfactorily. In the past, merely tinkering has failed to produce the desired outcome.  Therefore,\nthe following initiatives are recommended for implementation over the short and medium terms:\n\n### National Cruise Development Commission\n\nPage 42\n\n\fFigure 7: What is this sign advertising? What is Pelican Centre?\n\nStrategic decision\n\nThe question has been raised by more than one person in recent weeks and, in the margins of the\nrecent Pelican Town Hall meeting, about whether the BIDC is still the best institution to manage\nthe  Pelican  Craft  Centre.  BIDC  has  contributed  immeasurably  to  the  development  of  the  craft\nsector  in  Barbados,  but  the  present  relationship  between  the  tenants  in  Pelican  and  the\nmanagement of the craft centre (BIDC) is far from good.  Neither side has much confidence or\ntrust  in  the  other  and  this  toxic  relationship  should  not  be  allowed  to  continue.  In  the\ncircumstances,  consideration  should  be  given  to  the  installation  of  new  management.  The\npossibility  might  also  be  explored  of  a  management  contract  with  a  private  sector  entity\n(Government would determine the fundamental operating principles – a minimum percentage of\nthe shops must be selling local arts & craft etc.)\n\n### National Cruise Development Commission\n\nPage 43\n\n\fMeanwhile, regardless of the arrangements  for the future management of Pelican Craft Centre,\nthe following are a few recommendations that could be and should be implemented immediately\nin order to capture some of the 2018/19 season’s business.\n\nMaintenance – Pelican craft centre is beginning to look in need of preventative maintenance.\nThe  complex  should  be  repainted;  murals  could  be  placed  on  selected  walls;  some  tiles  in  the\ncourt  yard have risen-up and should be properly reinstalled; and the fountains, which currently\nlook abandoned, should be brought back to life. This type of maintenance work should be done\nin order to give the property a lift and also to arrest further deterioration.\n\nRent  moratorium/forgiveness  –  Given  the  current  situation,  there  might  be  merit  in  a  new\nbeginning. Assess the seriousness and capability of all tenants with rent arrears. Convert overdue\nrent  into  equity  or  deferred  payments  –  introduce  a  one-month  moratorium  on  rent  payments\nwhile  both  management  &  the  tenants  prepare  for  a  new  regime  –  New  leases  should  be\nintroduced  to  set  out  properly  the  responsibilities  of  management  and  tenants,  with  the  clear\nunderstanding that the obligations, on either side, will be enforced.\n\nTo get people’s attention & attract them into Pelican Craft Centre\n\nSignage – A new series of bold, attention-getting, and unambiguous signs should be erected in\nthe Cruise Terminal (if possible), at the exit to the Port, on Trevor’s Way across from the craft\ncentre  and  pointing  towards  the  craft  complex,  and  on  the  craft  centre  itself  but  facing  out\ntowards Princess Alice highway. For example, the sign outside of the Port exit might be re-made\nto read:\n## Pelican Craft Centre\n### Local Arts & Craft Great Souvenirs Free Wifi\n\nThere is also the potential to introduce interpretive signage, linking Pelican Village to Pelican\nIsland and the Deep Water Harbour.\n\nAdvertising  –  The  management  of  Pelican  Craft  Centre  should  execute  an  online  marketing\ncampaign, positioned to reach persons booked on cruise ships sailing to Barbados and visitors or\nlocals looking for local arts and craft. There should also be selected TV and radio advertising in\nBarbados to attract locals.\n\nShuttle service – Pelican Craft Centre is a short walk from the Cruise Terminal for those cruise\npassengers who enjoy walking, but would be a long walk for those, who really don’t want to do\nany walking or whose mobility is constrained. At present, there is a shuttle service between the\nCruise Terminal and the city centre. The possibility could be explored of incorporating a stop at\nthe Pelican Craft Centre into that shuttle service.\n\n### National Cruise Development Commission\n\nPage 44\n\n\fEntertainment  -  When  cruise  ships  are  in  Port  (day  and/or  late  night  departures)  and  at  other\nspecial  occasions  (Crop  over,  Independence,  Christmas  etc.),  the  Craft  Centre  should  organize\nmodest, but colourful entertainment packages ( chosen from small steel pan bands, stilt walkers,\nTuk  bands,  Mother  Sally  etc.)  around  the  gazebo  area  and  on  the  lawn  beside  Princess  Alice\nHighway.\n\nTo motivate cruise passengers & others to purchase\n\nOpen market – The lawn looking out towards Trevor’s Way, around the gazebo, and the area\nalong  the  artist  wall  should  become  an  “open  air  craft  market”  when  cruise  ships  are  in  Port.\nLarge  umbrella  assemblies  could  be  used  to  protect  vendors  &  their  customers  from  the  sun.\nAbove  all  else,  vendors  must  leave  their  “closed  Units”  and  come  outside  to  interact  with  the\nvisitors in a friendly and engaging manner.\n\nCustomer  experiences  –  Management  of  the  craft  centre,  together  with  the  tenants,  should\narrange a number of interactive craft production experiences, where cruise passengers and others\nwould  have  the  opportunity  to  experience  the  production  of  wood  work,  straw  work,  jewelry\ndesign, leather craft, glass blowing, pottery making and the like   - from  preparation of the raw\nmaterial through the various stages of the process to delivery of the final product - examples of\nwhich would be beautifully displayed and available for purchase.\n\nProduct development – Many of the craft items now available for sale in Pelican Craft Centre\nand elsewhere on the island are either also available in other Caribbean islands (often at lower\nprices) and/or imported from extra-regional sources. The craft vendors in Barbados need to pay\nmore  attention  to  new  product  design  with  a  view  towards  developing  a  range  of  “Authentic\nBarbadian souvenirs”, which would be different from what is being sold elsewhere in the region.\nPelican Craft Centre, as the island’s premier location for craft items, should lead this movement\ninto the creation and sale of more authentic Barbadian arts and craft.  BIDC has a design centre,\nwhich  could  work  with  craft  producers  to  design  a  range  of  souvenirs  that  represent  uniquely\nBarbadian objects and which can realistically be produced commercially.\n\n4.2  Historic Bridgetown and its Garrison must be promoted more effectively\n\nBarbados  must  make  a  serious  effort  to  protect  and  effectively  promote  “Historic  Bridgetown\nand its Garrison (an UNESCO World Heritage Site)”.  For reasons that remain a mystery, this\nUNESCO  World  Heritage  Site  (with  all  of  its  varied  heritage  attractions)  has  been  largely\nignored  as  an  area  to  which  cruise  passengers  should  be  exposed.  On  the  contrary,  the\nachievement  of  an  UNESCO  World  Heritage  designation  should  be  celebrated  and  promoted\nwith interpretive signage and enlightening tours to enhance the experiences of our visitors.\n\n### National Cruise Development Commission\n\nPage 45\n\n\fEvery  effort  must  be  made  to  package  and  promote  this  World  Heritage  Site  effectively.  In\naddition,  there  are  a  number  of  individual  attractions,  such  as:  the  Museum  of  Parliament,\nExchange Museum, Jewish Synagogue, and Dinner with  George come to  mind as examples of\nattractions/experiences that seem to be under-promoted and under-utilized.\n\nFigure 8:  Parliament Buildings, Bridgetown\n\nFrom St. Mary’s Church through the city centre, along Bay street, and onto the Garrison. This\nentire area needs proper  interpretive signage; restoration must be encouraged  and incentivized;\nhistoric  buildings  need  to  be  protected  by  appropriate  legislation;  penalties  for  violating  the\nrelated legislation should be severe and applied to any and all violators.\n\nA BTMI cruise division, with a clear mandate to be more facilitating, would work closely with\ntour  operators  and  taxi  associations  in  packaging  and  promoting  tours  to  showcase  the  many\ninteresting  attractions  within  Bridgetown  and  its  Garrison.  We  need  to  visualize  and  work\ntowards the reality of a 14-seater maxi-taxi, driven by a trained and engaging driver, setting-out\non  a  “Heritage  City  Tour”,  with  stops  at  an  awakened  Pelican  Craft  Centre,  Museum  of\nParliament,  Exchange  Museum,  Jewish  Synagogue,  a  properly-developed  Rihanna  Drive  (a\nphase 2 project), George Washington House and the tunnels, the changing of the guard (attired in\nZouave  uniforms)  at  St.  Ann’s  Fort,  a  light  Bajan-oriented  lunch  somewhere  on  Bay  street  or\naround the Careenage, shopping on Broad street.\n\n### National Cruise Development Commission\n\nPage 46\n\n\fFigure 9: Changing of the sentry at the Main Guard, St. Ann’s Fort\n\nThis is merely an idea, tours could be/should be packaged differently by different tour operators\nand  might  have  different  add-ons  (stop  at  a  beach,  at  the  Screw  Dock,  Mt.  Gay  Rum  Tour,  a\ndrive up to Gun Hill Signal Station etc.) and the sequencing of stops would need to be worked-\nout for maximum efficiency.\n\nMeanwhile, the BTMI, in cooperation with the Port, has been working recently with the two taxi\nassociations  which  operate  from  the  Port  to  put  together  a  tour  package  incorporating  the\nabove-mentioned  museums.    In  addition,  the  Commission’s  Attractions  Committee  has  been\nassisting  the  Museum  of  Parliament  and  the  Exchange  Museum  in  preparing  to  launch  a\n“Heritage  Museum  Passport”,  which  might  also  involve  the  Jewish  Synagogue  and  George\nWashington House.\n\n4.3  Bridgetown re-imagined\n\nBridgetown,  as  a  city,  has  lost  her  soul.  We  must  resuscitate  her  and  bring  her  back  to  life  in\norder to  encourage, not only visitors but also  Barbadian residents to return to the city after the\nsun has gone down and the stars have come out.\n\n### National Cruise Development Commission\n\nPage 47\n\n\fIt is proposed that this should be done in three phases. The first phase would cover those things,\nwhich can and should be done immediately, the second phase would look at the medium term,\nand the third phase would address the long term transformation of our capital city.\n\nBridgetown Phase one\n\nFirst, Bridgetown needs a more effective sanitation service (public, private, or a combination).\nThe  streets  of  the  city  always  seem  to  have  garbage  about,  as  a  result  of  uncollected  trash  or\noverflowing bins, and there are reports that rats are rampant in the city.\n-  The  sanitation  service  should  meet  with  businesses  in  Bridgetown  and  work  out  an\nimplementable  arrangement  for  effective  garbage  removal.  This  could  include  the  use  of\nprivate garbage collection by those businesses, which generate large volumes of garbage;\n\n-  More and larger trash receptacles are needed throughout Bridgetown. The cans  could have\ncovers  and  removable  bags,  which  should  be  replaced  periodically  during  business  days.\nHowever, given environmental concerns, rather than using plastic bags, a system of rotating\ngarbage  cans  can  be  employed  with  the  cans  being  rotated  periodically  and  the  full  cans\ntaken to a central collection point to be emptied into a waiting truck.  This garbage removal\nprocess  would  be  accomplished  by  deploying  persons  with  small  push  carts,  in  order  to\navoid the dislocation that would result from the deployment of regular garbage trucks in the\nCity during the work day.\n\n-  Box Drains/ Open Gutters and the like must be cleaned and kept cleared of trash at all times.\nThe  smell  emanating  from  dirty  blocked  drains  can  be  offensive  and  off-putting  to\nBarbadians and visitors alike, particularly if they are in front of  or close to restaurants and\nother places selling food.\n\n-\n\nIn view of the extent of the rodent problem in the City, there is need for an unrelenting effort\nto rid the city of rats or, more realistically, to reduce the problem significantly.\n\n-  Unsightly Graffiti should be removed from walls and it should be an offense to paint graffiti\non  walls,  stick  advertisements  and  posters  randomly  on  street  light  poles  or  the  sides  of\nbuildings.\n\nSecond, Bridgetown needs public toilet facilities. The long term solution probably involves the\nprovision of a few strategically-placed Visitor Centers, comprising information kiosks, attended\ntoilet  facilities,  basic  refreshments,  and  space  for  selling  local  arts  &  craft.  The  cost  of  these\nCentres might  be shared between Government  and the private sector and consideration should\nbe  given  to  charging  a  small  ‘user’  fee  to  help  meet  the  cost  of  manning  and  maintaining  the\ntoilets.\n\n### National Cruise Development Commission\n\nPage 48\n\n\fThird,  The  Careenage/Constitution  river,  which  was  cleaned  recently,  now  presents  a  more\nagreeable  appearance  and  smell.  There  should  be  a  structured  maintenance  programme  to\nremove trash and other debris and try to maintain the condition of Bridgetown’s only waterway.\nIndeed,  the  recently-dredged  river  might  even  be  used  for  transporting  visitors,  in  small  motor\nlaunches, from the Port into the City centre or ‘up river’ as far as Queens Park.\n\nMeanwhile,  the  Commission  has  learnt  that  there  is  an  IDB-funded  “National  Tourism\nProgramme” to reinvigorate the tourism industry and the programme’s first phase includes the\nestablishment  of  a  major  Visitor  Centre,  probably  in  the  Old  Town  Hall  building,  and  the\ndevelopment of a “Tourist Urban Route” in Historic Bridgetown.\n\nThe  Commission  envisages  that  its  recommendations  concerning  the  placement  of  information\nkiosks,  craft  outlets,  and  associated  public  toilets  will  complement  and  build  upon  the  IDB-\nfunded  project.  It  is  hoped  that  the  IDB-funded  Visitor  Centre  will  stimulate  private  sector\ninitiatives to establish a number of “satellite visitor centres” around the city, in areas such as:\nIndependence  Square,  Church  Village  Green,  Lower  Wharf  Road,  James  Street,  and  Roebuck\nStreet.    In  addition,  the  “Tourist  Urban  Route”,  which  is  also  part  of  the  IDB-funded  project,\ncan  serve  as  a  catalyst,  prompting  tour  guides  and  other  private  sector  operators  to  develop\ncomplementary routes, as part of their suite of activities for cruise passengers.\n\n Figure 10:  Aerial view of the Careenage\n\nFourth,  consideration  should  be  given  to  the  deployment  of  a  few  “Tourist  Ambassadors”  or\n“City Guides” at select locations, when cruise ships are in Port – Trevor’s Way, top & bottom of\n\n### National Cruise Development Commission\n\nPage 49\n\n\fBroad  Street,  Independence  Square  etc.  These  would  probably  be  retired  individuals,  who\nwanted to help, and/or students who saw an opportunity to improve their foreign language skills,\nby  providing  a  welcoming  presence  and  information  to  visitors.  These  “Guides”  would  not  be\nsalaried employees, but would receive modest honoraria.\n\nFourth, the shopping experience for cruise passengers visiting Bridgetown during the 2017/18\ncruise  year  has  not  been  good,  according  to  the  latest  BREA  survey.    This  FCCA-supported\n#### study reported that Barbados ranked 26th of 36 destinations with respect to overall prices, 20th in terms  of the  courtesy of store employees, 18th  re quality of  goods,  and 21st with  respect  to  the\noverall shopping experiences. Stores in Bridgetown, especially duty free shops, must endeavor to\nchange these perceptions.\n\nFigure 11: Colonnade (DaCosta Mall) – A heritage building & duty-free shopping\n\nIn the first  place,  Bridgetown  merchants should be encouraged  to  open  on Sundays and public\nholidays, when cruise ships are in the Port? Given that the arrival dates for the cruise ships are\nknown  well  in  advance,  the  stores  should  be  able  to  publicize  that  they  will  be  open  so  that\nresidents  will  also  be  motivated  to  come  out  to  shop.  In  addition,  the  stores  need  to  assess\ncarefully the range and competitive pricing of their products and their staff should be exposed to\ncontinuous training on how best to interact with both visitors and residents.\n\nFifth, these days access  to  reliable wi-fi is  almost  a necessity  for Barbadians and visitors. The\nmuch talked about initiative to make Bridgetown a ‘smart city’ should be advanced a step closer\nto  reality  with  the  introduction  of  ‘free  wi-fi’  throughout  Bridgetown.  This  would  be  an\nattraction for ships’ crews and for a large number of cruise passengers, who would now be able\n\n### National Cruise Development Commission\n\nPage 50\n\n\fto  upload  and/or  transmit  to  relatives  and  friends,  without  hassle  or  inconvenience,  images  of\ntheir visit to Barbados. In addition to the convenience for our visitors, this would help to promote\nbrand Barbados among the hundreds of thousands with whom the photos of an exotic city would\nbe shared.\n\nSixth, in an effort to encourage and facilitate cruise passengers and ships’ crews who might be\nattracted  to  the  idea  of  walking  from  the  Cruise  Terminal  into  Bridgetown,  the  BTII  and/or  a\nconsortium of Bridgetown merchants could introduce a walking map. This map,  available both\n#### as  a  21st  century  interactive  mobile  version  and  as  an  old-fashioned  printed  version,  would\nidentify  a number of useful/interesting landmarks (including walking distances  between them),\nfrom the Cruise Terminal to St. Patrick’s Cathedral.\n\nSeventh,  Use  large  potted  plants  to  decorate  and  help  to  enhance  the  appearance  of  Trevor’s\nWay,  Broad  Street,  Swan  Street,  and  other  non-vehicular  streets  around  Bridgetown  and  our\nother  towns.  These  large  potted  plants  should  also  be  installed  in  City  squares  and  other  open\npublic spaces to help to improve the ambiance (either in place of trees or to supplement the trees,\nwhich are already in place).\n\nBridgetown Phase two\n\nFor the medium term, the Commission proposes the following:\n\n  Removing vehicular traffic from Broad Street – From time-to-time the question has been\nraised about reducing or eliminating traffic from Bridgetown’s main shopping street. The\nCommission thinks the time has come to take that step. Increasingly, small cities around\nthe world, particularly those situated on rivers, lakes or close to the ocean, are removing\nvehicular traffic and opening-up city streets to outdoor cafes and the like.\n\n  Introducing  open  air  cafes  –  The  removal  of  vehicular  traffic  from  more  city  streets\nwould,  not  only  help  to  reduce  pollution  in  Bridgetown,  but  also  encourage  the\nintroduction  of  more  water  side  and  open  air  cafes.  Observe  the  visitors  dining  or\ndrinking outdoors at the Waterfront Café, particularly when cruise ships are in Port?\n\n  Road-side food vendors – a number of licensed (this would be a requirement) road-side\nvendors would be allowed in a cleaned-up and re-invigorated Baxter’s Road and at other\ndesignated  locations  throughout  Bridgetown.  In  addition  to  the  mandatory  health\ncertificate to prepare and sell food, the food vendors would be required to have a license\nto set-up in a particular area.\n\n  Introducing  water  taxi  service  -  With  vehicular  traffic  removed  from  Broad  Street,\nconsideration should be given to  the introduction of a water taxi  service  to ferry  guests\n\n### National Cruise Development Commission\n\nPage 51\n\n\fbetween  yachts,  anchored  in  the  bay,  and  the  inner  Careenage  and  also  to  transport\npersons  between  the  inner  Careenage  and  upper  Bay  street,  Rockley,  and  Oistins  or\nBrighton, Holetown and Speightstown.\n\n  Enhancing open spaces around the city  - The Squares and other open spaces in the city\nshould  be  cleaned-up,  seating  installed  etc.,  not  only  for  Independence,  but  throughout\nthe  year  so  that  they  can  become  areas  for  both  Barbadians  and  visitors  to  enjoy  the\noutdoors.  This  would  make  it  appealing  for  parents  to  bring  their  children,  buskers  to\nshowcase  their  skills,  young  emerging  performers  to  display  their  talents,  as  they  hone\ntheir performing skills in front of strangers.\n\n  Homeless  &  Vagrants  –  The  worsening  of  the  economic  situation  over  the  past  decade\nhas led to an increase in the number of homeless persons and vagrants, who tend to use\nthe city’s parks and squares as living quarters. This undesirable development needs to be\naddressed  by\nfew  dozen\nhomeless/vagrants  and  a  suitable  covered  space  to  feed  more  comfortably  the  hundred\nplus, who tend to descend on the city at meal time.\n\nfinding  alternative  arrangements\n\nfor  housing\n\nthe\n\nBridgetown Phase three – Transformational Initiatives\n\nThe transformation of Bridgetown began in phase two, with the removal of vehicular traffic from\nBroad  Street  and  the  introduction  of  water  taxi  services.  In  phase  three,  some  of  the  proposed\ntransformational initiatives are identified and it is envisaged that they will be developed, refined,\nand implemented in the years to come.\n\nBridgetown Fish Market re-invented:   One of the principal landmarks and visitor attractions\nin the city of Seattle is Pike Place Market. The market, which is a favourite location for locals\nand  visitors,  covers  several  acres  and  includes  a  reported  150  stalls  of  fresh  seafood,  produce,\nflowers,  artisanal  products,  and  local  art,  plus  see  the  numerous  street  performers  wandering\nthroughout. There are also a number of restaurants within the complex.\n\nSimilarly,  the  Castries  market  has  been  one  of  the  city’s  iconic  landmarks  and  a  must-see\nattraction  for  generations  of  visitors  to  the  St.  Lucian  capital.  The  Market  provides  a  one-stop\nshopping opportunity for local cuisine, provisions, spices, herbs, and crafts. A new and improved\nCastries market will provide a setting that appeals to visitors, citizens and vendors.\n\nIt  is  envisaged  that  the  current  Bridgetown  Fishing  Complex  or  a  nearby  location  could  be\nsimilarly  developed  into  a  city  landmark.  Can  you  imagine  a  Bridgetown/Pelican  Market,\ndesigned  and  developed  to  combine  in  one  location:  A  world  class  fish  and  meat  market\n(operating in compliance with first world SPS standards;  a market for provisions, herbs, spices\nand various cooking paraphernalia;  an entertainment space with music, day and night; and two\n\n### National Cruise Development Commission\n\nPage 52\n\n\frestaurants  –  a  casual  space  for  a  quick  lunch,  dinner  or  snack;  and  a  high-end  restaurant\ncombining air-conditioned space with an open air on the water ambiance.\n\nBuild a Bridgetown Marina:  Discussions about building a marina in the Carlisle Bay area have\nbeen around for decades. Barbados, as the most easterly of the Caribbean islands, is the natural\nfirst  landfall  for  yachts  crossing  the  Atlantic.  Sailing  races  in  Barbados’  waters  is  a  sport  that\nattracts  diverse  local,  regional,  and  extra-regional  participants.  It  is  time  for  Government  to\nencourage,  promote,  and  incentivize  this  initiative.  A  world-class  full  service  marina  would\nattract more yachting-related activity to Barbados and the spin-off business would be significant\nas  more  yachts  and  power  boats  would  find  Bridgetown  an  appealing  and  convenient  place  to\ndock. The marina could be developed as a BOT project in order to limit the demand for scarce\nGovernment funding.\n\nMake Bridgetown a livable city for young professionals: In order to  maximize its  potential,\nBridgetown needs to  attract  young professionals  to  live, work,  and socialize in  and around the\ncity. The capital city and its immediate environs are dotted with old/unused warehouse space, the\nrefurbishment  and  utilization  of  these  spaces,  as  accommodation  for  upwardly-mobile\nprofessionals,  a  high-end  boutique  hotel,  and  to  present  quality  experiences/entertainment,\nshould be encouraged and incentivised.\n\nRe-claim  parking  lots  from  prime  real  estate:  Curiously,  Bridgetown,  which  is  a  small  city\nwith very little space that can be developed, has at least three open parking lots sitting on prime\nwater-side land. It would seem that a better approach would be to discourage parking in the city\nand  make  use  of  well-lit  and  patrolled  multi-story  car  parks  away  from  the  water’s  edge.  The\nwater-side  land  would  then  be  available  for  recreational  use,  upmarket  housing,  or\nenvironmentally-friendly commercial activity.\n\nRestore  Bridgetown’s  historical  buildings:    The  restoration  of  a  number  of  the  historic\nbuilding, which are currently running to ruin within Historic Bridgetown, should be pursued as a\nlong term project.\n\n  The  old  Empire  Theatre  could  be  restored  as  a  city  centre  entertainment  space  to\ncomplement Frank Collymore Hall. The Bridgetown Live Musical “Rihanna” and similar\nproductions would be able to find suitable homes in this type of purpose-built (interior)\nwithin a genuine heritage building.\n\n  The abandoned Dale Carnegie Library could be restored to its former glory and use or be\n\nrestored and used as a museum.\n\n### National Cruise Development Commission\n\nPage 53\n\n\fFigure 12: The historical Carnegie Library Building, part of our heritage abandoned\n\n  The  dilapidated  Eye  Ward  building  (a  truly  iconic  structure)  needs  to  be  saved.  This\neyesore in our heritage city needs to be restored and its prime location maximized.\n\nThere are probably other buildings within the ambit of Historic Bridgetown and its Garrison that\nare  deserving  of  restoration.  The  three  listed  above  are  merely  indicative  of  what  could  and\nprobably should be done.\n\n4.4  Time to save the Oistins ‘goose’ or risk losing the ‘golden egg’\n\nThe founding of the Oistins Fish Festival and the subsequent creation of the Oistins Bay Garden\nbreathed new life into Oistins. However, the Bay Garden area is looking run down and in need of\nmajor refurbishment.\n\nThe Oistins “Fish Fry” remains very popular with both visitors and locals, particularly on Friday\nnights, but the area is in desperate need of serious rehabilitation. Although the darkness of night\nmight camouflage a number of the problems, the area looks dirty, bathroom facilities are poor,\nthe smell of raw sewage permeates the area, particularly when it rains, and there is a seemingly\npermanent pool of stagnant water between the restaurant area and the craft vendors.\n\nThe unfiltered glare of daylight makes the above-listed shortcomings even more pronounced. In\naddition,  the list  can be  supplemented by  adding the abandoned and rotting boats  (a haven  for\nrats and other vermin), uncollected garbage, the broken tables and chairs, the wooden tables and\n\n### National Cruise Development Commission\n\nPage 54\n\n\fchairs which clearly need re-painting, dilapidated vendor stalls, and a general air of disrepair and\nneglect.\n\nThe  Commission  has  also  learned  that  phase  two  of  the  previously-mentioned  IDB-funded\ntourism reinvigoration project is expected to address the rebuilding and expansion of the existing\nOistins Bay Garden to incorporate the Berinda Cox Fish Market and the boatyard. Since phase\none of the IDB-funded project is scheduled to be completed in summer 2020, it seems unlikely\nthat phase two will commence before second half of 2020.\n\nHowever, the entire Bay Garden facility urgently needs a major refurbishment. A cosmetic coat\nof paint would be inadequate. In the circumstances, consideration should be given to advancing\nthe execution timeframe for the Oistins Bay Garden refurbishment and.undertaking the work in\nphases  in  order  to  avoid  a  total  shutdown  of  the  complex.  This  matter  should  be  addressed\nwithout  delay  to  ensure  that  we  keep  the  Oistins  ‘goose’  alive  and  she  can  continue  to  lay\n‘golden eggs’.\n\nFigure 10:   The back of Oistin’s Bay Gardens - This photo was taken about 11.30 a.m. towards the\nend of November 2018. There was no rain overnight or earlier that morning.\n\n### National Cruise Development Commission\n\nPage 55\n\n\fWithin  the  context  of  an  overall  refurbishment,  the  following  areas  should  be  specifically\ntargeted for  immediate  action and should be  addressed,  even if the extensive rebuild has to  be\ndeferred:\n\n-  Bathroom  facilities  must  be  upgraded  and  should  remain  open  and  attended  whenever  the\nBay Garden facility is  open. Consideration should be  given to  charging a small  user fee to\nhelp offset the cost of the attendants.\n\n-  The  stagnant  pool  of  water  that  seems  to  be  a  permanent  fixture  should  be  addressed.  The\narea might need to be paved and graded so that rain water runs off into gutters and out to sea\n(but  this  requires  a  professional  evaluation  leading  to  a  sustainable  solution  that  will  not\nsimply relocate the problem within the complex).\n\n-  Rotting  boats,  abandoned  appliances  and  other  debris  must  be  removed  from  the  area\n\nwithout delay and proper management practices introduced to address this problem.\n\n-  Proper  stalls  must  be  provided  for  the  craft  vendors,  both  to  make  them  more  comfortable\nand also to improve the shopping ambiance for persons wishing to acquire local craft items.\n-  The  Complex’s  wooden  tables  and  chairs  should  be  restored/refreshed  or  replaced,  as\n\nnecessary.\n\n-  The  management  of  the  Bay  Garden  Complex  should  employ  at  least  one  person  to  walk\naround the area continuously throughout the evening to empty the garbage bins, replacing the\nliners and disposing of the full garbage bags.\n\n-  The  facility  should  be  properly  illuminated  and  visible  but  engaging  security  personnel\ndeployed throughout the complex (patrons must feel protected and safe, but not be terrified\nthat they are in danger).\n\nFigure 11:  Rotting boats & scattered garbage – This is Oistin’s Bay Gardens, Nov. 2018\n\n### National Cruise Development Commission\n\nPage 56\n\n\f5.0  Strategic approaches to cruise development\n\n5.1  Barbados’ Cruise Development Strategy Should Prioritize Homeporting\n\nTourism authorities must review they approach to the promotion and facilitation of homeporting,\nas  well  as  the  associated  in-country  arrangements  in  order  to  determine  how  to  maximise  the\nbenefits for Barbados. The real homeporting (air-to-sea cruise tourism) benefits for Barbados are\nin areas, such as: hotel accommodation, meals in restaurants, money spent in night clubs & other\nnight time experiences/attractions, using taxis and the like.\n\nDuring  the  2017/18  cruise  year,  homeporting  arrivals  in  Barbados  totaled  149,065.  This\nnumber was 24.4% higher than the 119,851 recorded for 2014/15.\n\nThe average per-person-spend by homeporting cruise passengers, who began their Caribbean\ncruise  from  Barbados  in  2017/18  was  US$144.78.  This  represents  a  68.5%  increase  over  the\n2014/15  average  homeporting  passenger  spend  of  US$85.94.  The  total  spend  by  homeporting\npassengers in 2017/18 was US$21.6M, more than double the US$10.3M in 2014/2015.\n\nAvailable data underline the positives associated with homeporting in terms of passenger spend\nand  overall  contribution  to  economic  activity.  However,  cruise  lines  do  not  schedule\nhomeporting  calls  whimsically.  Barbados  needs  a  comprehensive  strategy,  plus  a  well-\nresearched,  properly-executed,  and  sustained  promotion  programme  in  order  to  attract  more\nhomeporting business and to ensure that Barbados obtains maximum economic benefits from the\nhomeporting aspect of cruise tourism.\n\nThere  were  25.2  million  onshore  visits  by  cruise  passengers  in  the  36  Caribbean  and  Latin\nAmerican destinations during the 2017/2018 cruise year, 1.02 million of these visits were made\nby  air-to-sea  cruise  passengers,  who  embarked  on  their  cruises  from  one  of  the  seven\nhomeporting locations - Barbados, Cartagena (Colombia), the Dominican Republic, Guadeloupe,\nJamaica, Martinique and San Juan (Puerto Rico).\n\nThe  average  per  passenger  spend  by  homeporters  in  Barbados  during  the  2017/18  cruise  year\nwas  US$144.78  versus  US$64.04  for  regular  transit  cruise  passengers.  Expenditures  by\nhomeporters were boosted by hotel costs and higher spending on key categories, such as: Shore\nexcursions, Food & Beverage, and Clothing.\n\nThe  strategy,  with  respect  to  homeporting,  should  not  be  limited  to  collecting  persons  from\ncharter planes on the tarmac and transporting them to the Port for processing in order to board\ntheir ships and sail off into the sunset. We need a holistic approach, which envisages significant\npre  &/or  post  periods  in  Barbados.  The  additional  expenditures  on  hotel  rooms,  attractions,\n\n### National Cruise Development Commission\n\nPage 57\n\n\fentertainment,  food  and  beverage,  and  clothing  etc.  represent  the  real  value  added  associated\nwith cruise tourism.\n\nTable 5:  Av. Onshore Expenditures ($US) from a Transit Call by a 4,000 Passenger Cruise Ship\n\nArrivals\n\nOnshore visits\n\nAverage spend\nUS$\n\nTotal spend\nUS$\n\nRegional\nAverage\n\nBarbados\n\nRegional\nAverage\n\nBarbados\nAverage\n\nRegional\nAverage\n\nBarbados\n\nPassengers\n\nCrew\n\nTotal\n\n4,000\n\n1,670\n\n5,670\n\n3,400\n\n3,320\n\n101.52\n\n64.04\n\n345,168\n\n212,613\n\n651\n\n651\n\n60.44\n\n54.26\n\n  39,346\n\n   35,323\n\n4,051\n\n3,951\n\n80.98\n\n59.15\n\n384,514\n\n247,936\n\nIt is enlightening that, based on 2017/18 BREA data, one regular/transit call by a 4000-passenger\ncruise  ship  is  likely  to  generate  approximately  US$247.9  thousand  in  Barbados  vis-à-vis  the\nregional average of US$384.5 thousand (Table 5 above).  On the other hand, a comparable cruise\nship on a homeporting call is likely to generate approximately US$516.0 thousand in Barbados,\ncompared with the regional average of US$531.6 thousand (Table 6 below). The three lessons to\ntake away from this data are:\n\n(i)\n\n(ii)\n\nBased  on  current  information,  total  passenger  and  crew  spending  from  a  4,000-\npassenger  cruise  ship  call  at  Barbados  is  approximately  US$136.6  thousand  below\nwhat would have been spent if Barbados was operating at the regional average.\n\nIf  the  4,000-passenger  ship  was  homeporting  in  Barbados,  the  total  passenger  and\ncrew  spending  would  more  than  double  the  spending  by  a  comparable  number  of\nregular/transit cruise passengers and crew.\n\n(iii)  Whereas  the  average  spend  by  transit  passengers  and  crew  in  Barbados  is  35.5  %\nbelow the regional average, the average spend for homeporting passengers and crew\nin Barbados is only 2.8% below the regional average.\n\nAcross the C&LA more than twenty-two per cent (22%) of homeporters are spending an average\nof two and a half pre &/or post hotel nights in the homeport. In Barbados, the figure is seven per\ncent (7%), who only spend one pre or post hotel night. Clearly Barbados has considerable scope\nto improve these numbers.\n\nPassengers and cruise lines favour destinations, which consistently deliver high quality product.\nThis  is  especially  the  situation  with  respect  to  homeporting  in  Barbados  because  many  of  the\npassengers  are  European  and  are  more  likely  to  disembark  in  order  to  visit  heritage  sites  and\ncultural attractions. Consequently, Barbados must be constantly looking for unique experiences\nincluding  entertainment  and  other\nthat  can  be  packaged  and  brought\n\nto  market,\n\n### National Cruise Development Commission\n\nPage 58\n\n\fpackages/experiences, specifically developed for ships’ crews. In the context of homeporting, an\nadditional  selling  point  for  Barbados  is  its  geographic  location  and  the  fact  that  it  is  easily\naccessible by both air and sea.\n\nTable 6:  Av. Onshore Expenditures ($US) from a Home Port Call by a 4,000 Passenger Cruise Ship\n\nArrivals\n\nOnshore visits\n\nAverage spend\nUS$\n\nTotal spend\nUS$\n\nRegional\nAverage\n\nBarbados\n\nRegional\nAverage\n\nBarbados\nAverage\n\nRegional\nAverage\n\nBarbados\n\nPassengers\n\n4,000\n\n3,400\n\n3,320\n\n144.78\n\n144.78\n\n492,252\n\n480,670\n\nCrew\n\nTotal\n\n1,670\n\n651\n\n651\n\n60.44\n\n54.26\n\n  39,346\n\n   35,323\n\n5,670\n\n4,051\n\n3,951\n\n205.22\n\n99.52\n\n531,598\n\n515,993\n\nA  strategy,  focused  on  securing  additional  pre  and/or  post  hotel  nights  by  homeporters  and  on\npersuading  other  cruise  lines  to  remain  in  port  until  late  (11.00  p.m./midnight)  must  also  take\ninto consideration the need to develop the requisite product to satisfy the additional and different\npassenger  demand.  Incidentally,  this  night  product  should  also  be  targeted  at  residents  and\nregular  stayover  tourists  so  that  the  potential  developers  of  new  attractions  would  not  feel\nconstrained  or  be  deterred  by  the  prospect  of  a  limited  (six  –  seven  month)  cruise  market.\nAnother  factor  that  must  be  taken  into  consideration  as  Barbados  promotes  homeporting  more\naggressively is the availability of affordable hotel rooms.\n\n5.2  The European Market Beckons & Barbados should respond\n\nGlobalisation  of  the  cruise  industry  has  led  to  consolidation  within  the  ranks  of  the  cruise\ncompanies,  reducing  the  number  of  cruise  operators  to  four  principal  players:  Carnival\nCooperation,  Royal  Caribbean  Cruises,  Norwegian  Cruise  Lines  and  MSC  Cruises.  Together\nthey  control  more  than  eighty-five  per  cent  (85%)  of  the  worldwide  cruise  market.  Horizontal\nconcentration  of  the  industry  seems  likely  to  continue  since  the  investment  required  to  build  a\nmodern “mega” cruise ship exceeds US$250 million.\n\nIn this environment, only small, highly specialised cruise lines are likely to survive alongside the\nlarge  groups.  The  small  specialized  cruise  lines  might  be  a  good  target  group  for  Barbados\nbecause the smaller ships tend to cater to more affluent cruise passengers, who are more likely to\ndisembark and more likely to be interested in the type of heritage and culture attractions, which\nBarbados  can  provide.  Furthermore,  the  small  ships  might  be  attracted  to  alternative  berthing\narrangements  in  places  like  Holetown  or  Speightstown.  This  is  also  something  that  Barbados\nshould  encourage  in  order  to  relieve  some  of  the  congestion  that  is  now  associated  with  all\naspects of the cruise activity in and around the Bridgetown Port.\n\n### National Cruise Development Commission\n\nPage 59\n\n\fCompetition in the cruise market is fierce so a cruise destination, even one as well-known and\nestablished as Barbados, really has to have something attractive, unique or iconic if it wants to\nattract additional cruise lines and get more cruise passengers to disembark for tours and/or other\nattractions. The regular cruise passengers have limited time ashore, usually less than six hours to\nget to know a destination. They prefer to do a different activity at each port and will try to avoid\nrepeating the same or very similar activity at different places on the same trip. It is for this reason\nthat  Barbados  must  place  more  emphasis  on  its  heritage  sites  and  other  attractions  that  are\nuniquely Barbadian.\n\nNorth  America  remains  by  far  the  largest  source  market  in  terms  of  cruise  passengers,  but  we\nneed to look more closely at the European market. It seems that there is a case to be made that\nthe European cruise passengers are more compatible with where we want to go with our cruise\ntourism  product.  They  are  generally  more  affluent,  more  interested  in  heritage  &  cultural\nattractions  and  experiences,  and  more  oriented  towards  the  pre  &  post  aspects  of  homeporting\nthan the increasingly budget conscious travellers coming out of the US. In addition, Europe is a\nfaster-growing  market  than  North  America  and  Barbados  is  still  seen  as  an  exotic  destination.\nWhen  these  factors  are  taken  into  consideration,  plus  the  prospect  of  attracting  more\nhomeporters,  it  is  recommended  that  cruise  tourism  promotion  authorities  should  step-up  their\nefforts to persuade more Europeans to take a cruise to Barbados.\n\n5.3  Barbados should explore mechanisms for growing Summer Cruise Traffic\n\nTraditionally,  the  major  cruise  lines  tend  to  relocate  most  of  their  ships  to  the  Mediterranean\nbecause the weather is more predictable and the financial returns per cabin are higher. Carnival\nreported  that,  in  2016,  passenger  income  represented  72%  of  its  revenue  for  North  American\noperations and 82% for European consumers.\n\nNevertheless,  despite the lure of the Mediterranean and concerns about  weather systems  in  the\nCaribbean during the summer months, Barbados should endeavour to  grow the summer season\nby giving cruise lines reasons to deploy their ships in our region during the summer months. The\ncreation of an effective “Southern Caribbean Alliance” could help with this push.\n\nA Southern Caribbean Alliance was being discussed a few years ago and a MOU was proposed\nas a non-legal mechanism for promoting cooperation between the destinations on the “Southern\nCaribbean Cruise Itinerary”. The primary areas of common interest to be addressed were:\n\n  To increase regional cruise traffic;\n  To consider the possibility of a summer incentive programme; and\n  To cooperate in the areas of marketing and communication\n\nAt that time, Barbados had the primary responsibility for advancing the process, but the initiative\nseems to have faltered.\n\n### National Cruise Development Commission\n\nPage 60\n\n\fGiven, that the leverage of individual countries to negotiate  almost any substantive issues with\nthe cruise companies is limited by the substitutability of ports, an alliance encompassing all of\nthe destinations on a particular cruise itinerary might afford the group some degree of leverage.\nThis leverage might enable the Alliance more easily to negotiate a mutually-beneficial agreement\nwith one or more of the cruise companies for additional summer traffic. A successful Southern\nCaribbean Alliance could also help to redress the balance of power in terms of negotiating higher\nport fees with cruise companies.\n\n5.4  Training should be a priority, including certification of tour guides\n\nBarbados’ tourism authorities and persons in the cruise sector must prioritize training and treat it\nas a core component of capacity-building with respect to essential cruise sector personnel.\n\nFirst,  ongoing training is  necessary  for  all  categories  of  service  staff  -  The  courtesy  of  store\nemployees  is  one  of  the  areas  where  Barbados  lags  behind  most  of  its  regional  competitors.\nGiven  Barbados’  profile  in  the  cruise  tourism  sector  and  given  the  importance  of  presenting  a\nwelcoming and visitor-friendly outlook to the island’s visitors, it is recommended that  training\nfor service staff should be ongoing, in how best to engage with visitors and Barbadians to whom\nthey are delivering a service.\n\nIn  other  words,  rather  than  having  a  training  session  now  and  another  five  years  later  or\nwhenever  the  problem  is  again  highlighted,  Barbados  should  institute  a  training  programme,\nwhich  provides  for  frequent  ‘refreshers’  in  order  to  improve  the  likelihood  of  the  desired\nbehavior becoming automatic. This ongoing training should cover store employees, taxis drivers,\ntour bus drivers, and persons working at attractions and the like.\n\nSecond, there must be appropriate training and certification for tour guides - Barbados should\nintroduce,  as  a  priority,  professionally-developed  and  delivered  training  for  tour  guides.    The\nrelevant courses, oriented towards ensuring that the attendees acquire comprehensive knowledge\nof  Barbadian  heritage  and  culture  and  are  equipped  to  deliver  engaging  tours,  should  lead  to\ncertification.\n\nIn addition, other key areas to be covered in the training should be related to awareness of cruise\ntourism  and  cruise  tourists,  communication  and  hospitality,  tourist  safety  and  security,  inter-\npersonal skills, language skills and environmental awareness.\n\nThird,  Barbados  should  use  the  experience  of  strategic  partners  -  FCCA-affiliated  entities\nprovide  training  for  various  types  of  service  staff,  Barbados  should  take  steps  immediately  to\nmake such training available to the various categories of front line staff, mentioned earlier.  We\nneed  to  build-in  ongoing  training  for  the  above-listed  categories  of  persons,  including,  as\nindicated earlier, provisions for annual ‘refresher’ training. Taxi drivers, tour guides, department\nstore employees, staff at attractions, heritage sites and the like must be trained to interact easily\nwith cruise passengers and to be able to sell Barbados effectively.\n\n### National Cruise Development Commission\n\nPage 61\n\n\f6.0  Barbados Must Unveil Hidden Tourism ‘Gems’\n\n6.1  Barbados, as a cruise destination, must deliver in three key areas\n\nIn an interview with the third quarter 2018 edition of Travel & Cruise,  Ugo Savino, Carnival’s\nDirector of Deployment and Itinerary Planning opined that cruise destinations need to deliver in\nthree areas:\n\n1)  The  ability  to  generate  demand,  i.e.  to  create  awareness  of  and  a  desire  to  visit,  the\ndestination. Marketing must increase awareness or interest in visiting. If people know the\ndestination & have already visited, there is likely to be a drop-off in those interested in\ngoing unless there are new products or some other form of demand creation.\n\n2)  During  the  visit  to  a  destination,  it  must  offer  a  variety  of  tours  that  resonate  with\ndifferent  guest  profiles.  The  portfolio  of  shore  excursions  needs  to  be  refreshed  on  a\nregular basis in order to remain relevant and interesting.\n\n3)  The destination needs to deliver a high satisfaction score, which will eventually lead to\nword  of  mouth  promotion  when  the  happy  cruiser  returns  home  and  tell  his/her  friends\nabout the fabulous experience in the  destination.\n\nBarbados’ cruise tourism planners and facilitators need to be mindful that  these three elements\nare crucial in the decision making of those who plan cruise ship itineraries. Consequently, BTMI\nofficials, related agencies, and developers of visitor attractions will know what has to be done in\norder  to  make  Barbados  more  appealing  to  cruise  passengers  and  to  increase  the  likelihood  of\nsecuring more  calls by cruise lines.\n\n6.2  Paradigm Shift Needed\n\nBarbados'  ability  to  maximize  its  earnings  from  the  cruise  tourism  sector  requires  a  paradigm\nshift in our thinking about visitor satisfaction and our approach to customer service. The cruise\ntourism sector demands that the Barbados experience exceeds visitor expectations  “all the time\nevery time”.\n\nIn  a  written  submission  a  few  months  ago,  one  of  our  leading  tour  guides  made  the  insightful\nobservation that: “For the long-stay visitor, a poor reception at the port of entry may be erased by\na  warm  reception  at  hotel  check-in  -  An  un-inspiring  experience  during  the  day  may  be\ncompensated for by a wonderful  evening of dinner and dancing  -  An unrewarded search today\nfor local items can be overcome by a productive shopping day tomorrow”.\n\nOn  the  other  hand,  cruise  tourism  does  not  provide  those  opportunities  for  Barbados  or\nBarbadian service providers to recover from initial sub-par performances. The visitor experience\nfor  cruise  passengers  is  usually  condensed  into  a  few  hours  rather  than  being  spread  out  over\n\n### National Cruise Development Commission\n\nPage 62\n\n\fdays  or  weeks.    Therefore,  the  initial  welcome  extended  to  cruise  passengers  arriving  in\nBarbados must be memorable; the tours and attractions to which the ‘cruisers’ are exposed must\nbe  unforgettable;  and  the  quality  of  their  overall  experience  in  Barbados  must  exceed  their\nexpectations and always leave them wanting more.\n\nThe  demands  of  the  cruise  tourism  sector  underline  the  need  to  make  a  good  first  impression\nbecause there is so little scope for second or third opportunities. Barbados must make that first\nimpression, not just good, but memorable. This is the time to unveil that “WOW FACTOR”.\n\nOne of the frequently repeated messages reaching the Commission  over the past  six months is\nthat Barbados needs to take ‘preventive’ actions by addressing visitor concerns about quality of\nservice, neglected physical environment, and lack of variety in product offerings. In recent years,\nboth  cruise companies and their passengers have indicated that there is  a need for Barbados to\nrefresh and diversify onshore experiences.\n\nConsequently, it is evident that Barbados should deal with these shortcomings before conditions\ndeteriorate  to  the  point  where  the  island  loses  ships,  which  decide  to  substitute  other  more\nappealing ports. Barbados’ policy makers and tourism planners are aware of the danger and are\ntaking steps to boost the competitiveness of the cruise sector, but more must be done to expose\ncruise line itinerary planners and visiting cruise passengers to a greater variety of attractions and\nmemorable experiences.\n\n6.3  Partnerships are invaluable for cruise tourism\n\nCruise  lines  operating  large  ships  generally  work  with  specific  Destination  Management\nCompanies  (DMCs)  in  which  they  have  a  financial  interest  or  to  which  they  have  a  strong\ncommitment. Consequently, it is very difficult for small and medium-sized enterprises (SMEs) to\nwork  directly  with  these  types  of  cruise  lines.  In  the  circumstances,  a  small  island  nation,  like\nBarbados, finds it difficult to foster the emergence of SMEs in the cruise sector.\n\nOne  possible  approach  in  addressing  this  challenge  is  for  governmental  authorities  to  become\nproactive in establishing standards of behavior and service for the sector, broadening the range of\n“products” being offered to cruise lines, and exploring additional opportunities to bring greater\neconomic benefits to Barbados. This approach usually requires an agency with a mandate and the\ncapacity to promote, stimulate, and facilitate the diversification and growth of the sector.  This\nReport  recommends  that,  for  the  foreseeable  future,  BTMI’s  Cruise  Section  or  a  comparable\nentity should be entrusted with that facilitating role.\n\nIn the early decades of the last century, Helen Keller, an American writer and social activist, who\nwas deaf and blind, is reported to have used the following words to move those whom she could\n\n### National Cruise Development Commission\n\nPage 63\n\n\fneither  see  nor  hear:  “We  live  by  each  other  and  for  each  other.  Alone  we  can  do  so  little.\nTogether we can do so much.”\n\nThis  should be the “mantra” of those in  Barbados, who are struggling to  have their attractions\nsold  on  board  cruise  ships  or  who  feel,  rightly  or  wrongly,  that  some  tour  operators  are\ndeliberately trying to sabotage their efforts.\n\nPartnerships are invaluable in both business and life. We often rely on partners for ideas, input\nand support. We need reliable and knowledgeable partners to stimulate and facilitate the growth\nof  cruise  tourism  in  Barbados.  At  this  time,  we  have  needs  everywhere,  beginning  with  the\nreality that:\n\n-  We  need  to  bear  in  mind  that  Cruise  lines  prefer  to  work  through  “distributors”  or  tour\noperators  rather  than  dealing  directly  with  large  numbers  of  small  attractions  –  This  is  the\n### preferred  operating  model  for  all  of  the  cruise  lines  in  whichever  markets  they  operate\naround the world.\n\n-  Barbados needs enhancements to its existing attractions and it also needs to develop and bring to\n\nmarket new attractions and tour packages.\n\n-  Tour operators need attractions because that is what they sell, either through the cruise lines\n\nor directly to cruise passengers and other visitors.\n\n-  The operators of attractions need innovative and committed tour operators, who will market\n\ntheir attractions and deliver a continuing flow of customers.\n\n6.4  Perspectives of three visiting tourism strategic partners\n\nDuring a Town Hall session at Hilton Barbados in July 2017, to engage with local entities which\nare supplying services to the cruise lines, Michele Paige, President of the FCCA stated “We need\nto  retain  the  Barbados  identity”  and  later  in  the  same  event,  she  stated  “We  need  to  put  the\n‘Wow’ back into Barbados”.\n\nIn  September  2018,  Joe  Thompson  the  Managing  Director  of  Virgin  Holidays,  speaking  at  a\n#### function  to  celebrate  the  20th  anniversary  of  the  company’s  relationship  with  Barbados,  stated:\n“What we are always looking for and trying to encourage with our partners here in Barbados is\nto  recognize  that  the  way  to  be  successful  in  the  tourism  industry  is  to  keep  evolving  your\nproduct.  I  think  ………………the  key  to  success  in  the  long  run  is  to  keep  investing  in  your\nproducts and to make sure that you are improving the guest experience in a way that keeps them\ncoming back for more”.\n\n### National Cruise Development Commission\n\nPage 64\n\n\fThe  Dutch  CBI,  in  its  2017  paper  “What  are  the  opportunities  for  cruise  tourism  with  guests\nfrom Europe“, wrote: “Destinations that want to develop cruise tourism have to make sure they\nmaintain the core natural and cultural values of their destination. They have to develop policies\nthat safeguard their heritage and culture and that limit potential negative impacts. (They should)\nFocus  on  developing  attractive,  creative  excursions  for  cruise  passengers  that  include  unique,\n#### authentic experiences”21.\n\nI think there are at least  four ‘takeaways’ from the three statements above that Cruise Tourism\npolicy  makers  should  endeavor  to  inculcate  into  the  thinking  of  both  public  and  private  sector\n‘players’ servicing cruise tourism.\n\n1.  Barbados should remain true to itself and not simply try to copy others. Barbados needs\nto  develop  and  present  a  product  (Barbados  brand),  which  is  different  from  other\ndestinations;\n\n2.  Barbados’  cruise  development  strategies  should  both  protect  and  showcase  its  heritage\n\nand culture;\n\n3.  We need to give the visitor a positive and memorable first impression of Barbados; and\n\n4.  The tourism product can become ‘stale’ and uninviting unless it is frequently refreshed to\n\nimprove the visitor experience.\n\n### 7.0  Institutional Considerations\n\n7.1  Principal Public Sector Tourism Stakeholders in Barbados’ Cruise sector\n\nThe  cruise  tourism  sector  in  Barbados  now  comprises  a  number  of  public  sector  institutional\nactors. These institutions can play pivotal roles as intermediaries between the policy makers and\nprivate  sector  operators.  On  the  one  hand,  they  must  ensure  that  the  policies  are  clearly\narticulated  and  that  an  appropriate  regulatory  mechanism  is  in  place  to  facilitate  the  business\ncommunity. On the other hand, the public sector facilitating institutions should keep the policy\nmakers  informed  on  how  the  policies  are  working  and  whether  there  are  any  unintended\nconsequences  that should be addressed in  order  to  enable the policies to accomplish  what  they\nwere intended to do.\n\nMinistry  of  Tourism  and  International  Transport  is  the  Government  Ministry  with\nresponsibility  for  determining  tourism-related  policy  and  for  overseeing  the  specialized\n\n21 Centre for the Promotion of Imports from developing countries (CBI), Ministry of Foreign Affairs of the Netherlands  - What\nare the opportunities for cruise tourism with guests from Europe\n\n### National Cruise Development Commission\n\nPage 65\n\n\fimplementation  agencies,  such  as  the  BTMI,  BTPA  and  BTII.    The  Ministry  needs  to  be\nsensitive  to  the  challenges  facing  the  cruise  sector  and  be  prepared  to  give  the  necessary\noversight  and  support,  including  “fast-tracking”  of  legislation,  expediting  the  introduction  of\nregulations, and intervening with other Ministries, where necessary.\n\nBarbados  Tourism  Marketing  Inc.  (BTMI)  is  the  agency  with  responsibility  for  promoting\nand generally raising awareness of the entire Barbados tourism product.  BTMI has a relatively\nnew division dedicated to the development of the cruise sector. There is scope for elaborating the\nmandate  of  this  division  to  ensure  that  it  is  able  to  function  effectively  as  a  facilitator  of\nincreased cruise sector activity. This facilitating role may also be pursued in partnership with a\ncompatible and complementary private sector entity.\n\nIn the circumstances where  two of  Government’s  objectives with respect to  the  cruise sector\nare: (1) To increase the contribution of cruise tourism to economic development in Barbados;\nand  (2)  to  stimulate  and  facilitate  the  participation  of  more  small  and  medium-sized\nenterprises (SMEs) in the sector; the mandate of the BTMI’s Cruise Division should include\nthe cultivation of relationships with operators of attractions and tours, regulatory and business\nsupport organisations, and cruise lines.\n\nBarbados  Tourism  Product  Authority  (BTPA)  is  the  Government  agency  that  works  to\nimprove tourism products in Barbados, primarily focused on licensing and regulation of entities\nin the accommodation sector. BTPA also assist with human capital development.\n\nThere  is  a  view  that  the  regulation,  development,  and  facilitation  of  the  tourism  industry,\nparticularly  cruise,  would  benefit  from  the  maximization  of  the  synergies  between  BTMI  and\nBTPA.  It  is  posited  that  the  existing  personnel  and  financial  resources  would  achieve  more\ncombined  than  they  can  within  separate  organisations.  If  BTMI  and  BTPA  must  remain  as\nseparate organisations, they should, at least, have a truly symbiotic relationship.\n\nBarbados  Tourism  Investment  Inc.  (BTII)  is  the  Government  agency  that  coordinates\ninvestments in tourism projects. It is more engaged in the traditional tourism sector than in cruise\ntourism  development.  The  BTII  provides  tourism-related  loans  through:  1)  loan  facilitation\n(fiscal  incentives);  2)  Public  Private  Partnerships  (PPPs);  and  3)  straight  investments.  There\nshould  be  a  close  and  mutually-reinforcing  working  relationship  between  BTII  and  the  other\npublic sector tourism stakeholders.\n\n7.2  Cruise Division or comparable entity must become a genuine facilitator\n\nBTMI’s  Cruise  Division’s  overall  responsibilities  should\ninclude  a  clearly-articulated\ndevelopmental and business facilitating role. The  Division should be oriented towards working\nwith new emerging or recently refurbished attractions and encouraging the type of private sector\ninitiative, which is required to develop and market more attractions and tours.\n\n### National Cruise Development Commission\n\nPage 66\n\n\fThe Cruise Division or some comparable entity should become more proactive in and committed\nto helping attractions to enter into strategic partnerships with various tour operators or with other\nattractions.  A  new  collection  of  diverse  and  appealing  attractions  should  be  promoted,  not  just\nfor  the  cruise  sector,  but  that  will  equally  appeal  to  residents  and  to  stayover  visitors.  This\nbroader outlook could be critical in ensuring the long term viability of an attraction, which might\nbe marginal or unappealing financially if catering only for the six to seven month cruise season.\n\nBTMI’s  Cruise  Division,  by  itself  or  in  partnership  with  an  appropriate  private  sector  entity,\nmust  become  more  proactive  and  innovative  in  brokering  strategic  partnerships  and  helping  to\npackage small attractions into viable tours. Furthermore, if potential tourism-related projects are\nfacing  regulatory,  bureaucratic  or  other  related  challenges,  BTMI  should  be  able  to  assist,  by\nhelping  to  overcome  these  types  of  hurdles.  Similarly,  if  the  operators  of  existing  attractions\nwant to expand their market into the cruise sector, they should find a BTMI, which is willing and\nable to provide information, guidance, introductions to key persons and the like.\n\nGenuine  facilitation  of  SMEs,  particularly  those  endeavouring  to  enter  a  complex  and\ncompetitive  international  market,  requires  significant  “hand  holding”.  Consequently,  it  is\nenvisaged  that  the  Cruise  Division’s  officers  would  be  willing  and  able  to  work  with  and\nfacilitate  the  developers  of  new  attractions  or  existing  operators  seeking  to  get  into  the  cruise\nmarket,  through  the  entire  process  –  from  conceptualisation  to  eventual  realisation  of  an\nattraction receiving cruise passengers. This would necessitate, as we noted above, the cultivation\nand  maintenance  of  relationships  with  several  local  and  international  economic  operators  and\nregulatory or business support institutions.\n\nBTMI should also be a principal player in the administration of any incentives regime intended\nto  stimulate  investment  in  cruise  sector-related  projects.  Regardless  of  which  institution  has\nresponsibility  for  the  approval  of  incentives  to  cruise  tourism  projects,  the  regime  should  be\ntransparent, predictable  and open to  consultation  with cruise tourism staff.  Consequently, the\nrelevant  information  about  available  incentives,  qualifying  criteria,  required  documentation,\nprocessing timeframes and the like should be readily accessible, as a resource tool, to support the\nbusiness facilitation efforts of BTMI staff. Consequently, the mandate of BTMI’s cruise division\nshould include:\n\n  The cultivation of relationships with local suppliers (operators of attractions and the like);\n  Working with  tour operators (who help  to  evaluate, package, market,  and distribute the\n\ncruise products);\n\n  Liaison with other support entities (sea and airport management);\n  Building relationships with relevant regulatory institutions (those responsible for granting\n\nvarious approvals, licenses etc. to enable businesses to serve the cruise sector);\n\n### National Cruise Development Commission\n\nPage 67\n\n\f  Building  contacts  in  and  relationships  with  the  cruise  companies  and  cruise  lines  (who\n\ndecide where to deploy cruise ships and plan itineraries for those ships etc.,); and\n\n  Working  with  counterparts  in  other  regional  destinations,  particularly  those  in  the\n“Southern  Caribbean  cruise  itinerary”,  (with  the  objective  of  developing  joint  strategic\napproaches in negotiating with cruise companies and other external partners).\n\n7.3  Regulatory requirements are enmeshed in Bureaucratic obfuscation\n\nA  number  of    persons,  who  are  involved  in  or  trying  to  provide  services  to  the  cruise  sector\ncomplain  that  the  process  for  securing  approval  to  purchase  duty  free  vehicles  seems  to  have\nbeen changed in recent years making it more difficult. It is now necessary, they claim, to secure\ninput from more Ministries than before and, in the end, the Ministry of Finance seems intent on\nfinding every possible mechanism to delay the process. The result of this “run around” is that it\nnow takes, on average, five (5) to six (6) months to clear new vehicles out of the Port, compared\nwith the three (3) weeks promised by the Ministry of Finance. In this electronic age, even three\nweeks  seem  too  long  and  six  months  is  simply  unacceptable  if  Government  really  intends  to\nfacilitate the conduct of business.\n\nSimilarly, some operators of tour buses and prospective operators of tours observe that it is very\ndifficult to secure permits to operate tour buses and incredibly complicated to retrofit and licence\nsuch buses.  One small business operator writes of trying for over a year to obtain a BT licence,\nalthough she met all of the relevant requirements. She also observes that last year (2018) she was\nobliged to wait six months to obtain approval for a retrofit. In the intervening months, she was\ndriven  almost  to  distraction  by  the  pointless  delays  (including  waiting  until  November  for  a\nletter, which she had been assured, in June, was being drafted).\n\nThis lady concluded her letter by emphasizing that she was NOT complaining, but she want the\nprocess to be improved for the benefit of other applicants. (Imagine this middle aged lady, trying\nto operate a small business, providing services to the sector which is supposed to be our leading\nforeign exchange earner. She battles to overcome incomprehensible bureaucratic delays and her\nconcern is that the process should be improved “for the benefit of other applicants”. Employees\nof the applicable regulatory institutions should read her letter and ask themselves whether they\nare  doing  their  best  to  facilitate  the  conduct  of  business  in  Barbados,  particularly  when  this\nbusiness will employ Barbadians and earn foreign Exchange”)\n\nListening  to  and  reading  of  the  frustrations  that  businesses  have  to  overcome  simply  to  do\nbusiness  and  employ  Barbadians,  it  is  amazing  that  any  business  actually  gets  done  by  small\nbusiness  people  trying  to  equip  themselves  to  provide  services  in  the  cruise  sector.  The\nimpression conveyed is that the Customs Dept., certain sections of the Ministry of Finance, the\nTown Planning Dept., and MTW’s do more to frustrate than facilitate business persons.\n\n### National Cruise Development Commission\n\nPage 68\n\n\fIn an earlier chapter of this Report, we underlined the need for training across the entire gamut of\nservice  providers.  Similarly,  there  is  a  need  for  sensitisation  and  training  programmes  to  help\nthe staff in regulatory agencies to appreciate the importance of what they do and how vital it is\nfor them to see their role as removing obstacles and facilitating rather than erecting unnecessary\nbarriers and frustrating people trying to do business with Government. The process of obtaining\na tour bus licence is simply too opaque and convoluted. It must be made more transparent and\nless time consuming.\n\n### 8.0  Random Thoughts About Possible Visitor Attractions\n\nThe history  of  Barbados is  littered with  interesting  and unusual  stories, some bordering on the\nmacabre.  These  random  ideas  are  merely  intended  to  stimulate  the  curiosity  and  sense  of\nadventure in all of us, while serving as reminders that visitor attractions are often born out of the\nunusual, which is right next door.\n\n8.1  Bajan Tales from the crypt - the mystery of the Chase Vault\n\nThe  vault,  which  became  infamous  as  the  Chase  Vault,  can  be  found  in  the  cemetery  of  the\nChrist  Church  parish  church.  The  vault  was  originally  built  in  1724  and  had  an  unremarkable\nhistory  until  August  9th  1812  when  it  was  opened  for  the  interment  of  wealthy  landowner\nColonel  Thomas  Chase.  The  coffins  of  Chase’s  two  young  daughters,  Mary  Ann  and  Dorcas,\nwere already located in the vault and the burial team was horrified to observe that the coffins had\nseemingly been tossed about from their original locations and were now scattered to the sides of\nthe vault. There was no evidence of human tampering with the sealed vault and other vaults in\nthe cemetery had not been affected in the same way.\n\nThat  might  have  been  the  end  of  the  tale  but  for  the  fact  that  this  spectacle  was  repeated  four\nyears  later  and  again  the  following  year,  when  two  more  coffins  were  added  to  the  vault.\nInspection of the vault revealed no alternate entrances or secret passageways.\n\nIn 1819 the Governor of Barbados oversaw another burial in the vault and affixed his seal to the\nconcrete sealing the entrance. However, a year later, when the vault was opened once again (with\nthe  seal  found  intact)  the  coffins  were  again  found  in  disarray.  At  this  point,  the  authorities\ndecided  to  remove  the  \"moving  coffins\"  and  they  were  reburied  separately  elsewhere  in  the\ncemetery.  The  empty  vault  has  remained  open  since  that  time  and  the  mystery  of  the  moving\ncoffins is still unsolved.\n\n8.2  Mermaids Tavern & the Charter of Barbados\n\nThese days Oistins is best known for  two popular attractions; the Oistins Fish Festival, which\nwas founded in 1977 by the late Sir Harold St. John, a former Prime Minister and parliamentary\n\n### National Cruise Development Commission\n\nPage 69\n\n\frepresentative  for  Christ  Church  South  and  the  Oistins  Bay  Garden,  which  has  become  a\npopular entertainment venue, particularly with its Friday night Fish Fry.\n\nHowever,  Oistins  is  best  known  historically  as  the  location  for  the  signing  of  the  Charter  of\nBarbados at “Ye Mermaids Tavern” on January 11, 1652.  A month prior to the signing of the\nCharter, an English naval force had blockaded Barbados, invading and burning Speightstown in\nDecember of 1651.\n\nThis charter peacefully ended the threat of invasion by English forces loyal to Oliver Cromwell,\nwho had targeted Barbados because the island was supporting the Royalists. The signing of the\nCharter or “Articles of Agreement” meant that  Barbados’ House of Assembly, which had been\nmeeting since 1639, was officially recognized by Oliver Cromwell.\n\nAt  that  time,  Oistins  was  both  an  important  transshipment  point  for  the  sugar  and  cotton\nproduced  by  neighbouring  plantations  and  a  centre  for  administration  because  the  monthly\nsessions of the Court of Common Pleas were held in the town until 1828.\n\nIt is reported that, in referring to the Charter, the educator Leonard Shorey wrote:\n“The  Treaty  was  indeed  quite  remarkable,  for  it  actually  guaranteed  that  ‘no  taxes,  customs,\nimports  or  excise  shall  be  laid,  nor  levy  made  on  any  of  the  inhabitants  of  this  island  without\ntheir consent in a General Assembly’. This provision thus predated by more than 120 years the\nsame important provision later adopted by the American colonies when they themselves revolted\nagainst the English Crown”.\n\n8.3  Barbados and the story of “Rumbullion”\n\nBarbados is known as the birthplace of rum “Rumbullion” and the leading Barbadian brands are\nknown around the globe. Nevertheless, the island of Martinique is known, in the cruise tourism\nworld,  as  “Land  of  Grands  Rhums”.  Martinique  promotes  itself  as  the  “rum  capital  of  the\nworld”  –  its  distilleries  are  promoted  as  the  only  ones  in  the  world  to  have  been  awarded  the\nprestigious  ‘AOC’  (appellation  d’origine  controlee)  i.e.  the  same  designation  that  recognizes\ncertain exceptional wines of France.\n\nThey  speak  of  the  rums  from  Martinique  as  being  distinguished  by  the  “rhum  Agricole”\nproduction technique – they speak about the technique & the results, from white rum to cocktails\nto  dark  rum  (making  a  comparison  between  the  dark  rum  and  a  fine  cognac)  &  rum-based\nliqueurs.  The  publicity  states  that  visitors  are  encouraged  to  travel  &  experience  La  Route  des\nGrands  Rhums  to  distilleries  all  over  the  island.  Finally,  the  point  is  made  that  whichever\ndistillery cruisers visit, “they won’t be able to resist the chance to bring home a bottle or two …\nto share with friends and loved ones”.\n\n### National Cruise Development Commission\n\nPage 70\n\n\fOn the other hand, although there is a ‘rum tour’ among the offerings of several cruise lines, it\nseems certain that Barbados, the home of rum, would have an even more enthralling story to tell.\nFirst we must develop a truly memorable “visitor experience” to replace the rather  bland tours,\nwhich are currently on offer.\n\nSecondly, we must launch a bold advertising/promotion campaign to let the cruise world know\nthat we have a unique story of rum to tell, a memorable experience to enjoy, and a selection of\nunequalled rums to take home to share with friends.\n\n8.4  Other tales from beneath the earth or high above it\n\nGarrison Tunnels\n\nThe 200-year-old tunnels, which were discovered accidentally during the restoration of George\nWashington  House,  reportedly  comprise  a  two-mile  network  of  underground  corridors  beneath\nthe Garrison. Surely the secrets, which these tunnels hold, are just waiting to be brought to light\nas a thrilling mystery of what soldiers did or did not do five metres underground 200 years ago,\nwhen Barbados was one of the most heavily fortified locations on this side of the Atlantic.\n\nThe HARP Gun\n\nIn the early nineteen sixties, Barbados was home to a High Altitude Research Project, which was\nbeing  undertaken  by  the  American  and  Canadian  governments.  Imagine  a  satellite  launcher  in\nBarbados  almost  sixty  years  ago.  A  project  shrouded  in  secrecy,  involving  Canadians  and\nAmericans, Israelis and Iraqis – spies and assassinations – was it a scientific or military venture.\n#### What is the real or imagined story behind this 20th century mystery.\n\nCherry Tree Hill\n\nCherry Tree Hill has long been well known for  its fabulous views of the Scotland District and\ncertain gravity-defying characteristics. Where else have you seen or heard of motor cars rolling\nuphill. Imagine experiencing this phenomenon, followed by a drink at a nearby establishment as\nyou look out over the East coast and try to rationalize what you had just experienced.\n\n### Comment\n\nA wake-up call is no longer enough, it is time for action\n\nThere is a tongue-in-cheek American saying “déjà vu all over again”\nIn an August  2016 interview with  Gercine Carter,  Cecil  Ince, one of the founders of Foster  &\nInce,  is  reported  to  have  said  that  he  started  to  take  a  more  active  role  in  the  cruise  business\n\n### National Cruise Development Commission\n\nPage 71\n\n\fbecause “I discovered that the cruise lines were not happy with the standard and quality of tours\nbeing offered in Barbados.”\n\nIn December 2018, a similar message is being conveyed by cruise sector studies undertaken over\nthe past seven/eight years, by formal and informal discussions with cruise sector stakeholders in\nrecent  months,  and,  most  importantly,  by  the  disappointing  cruise  sector  per  passenger  spend\nduring the past ten years.\n\nIt should be instructive that despite the pioneering work done by Foster & Ince and others over\nthe past forty years, Barbados still finds itself struggling to remain competitive in today’s cruise\ntourism  industry.  The  key  message,  which  we  should  take  away  from  this  scenario,  is  that  the\ncruise sector demands continuous innovation and reinvention.  We must strive to give the cruise\nvisitors a different and memorable experience every time.\n\nIt  is  evident  that  Government,  perhaps  through  an  enabled  cruise  section  within  the  BTMI  or\nsimilar entity, needs to become more “hands on” in facilitating the diversification and expansion\nof  the  island’s  suite  of  visitor  attractions.  There  is  also  an  obvious  need  to  promote  all  of  the\nisland’s  cruise  sector  offerings  more  effectively  to  the  cruise  lines  because  there  are  repeated\ncomments  from  cruise  line  executives  that  they  did  not  know  that  Barbados  had  this  or  that\nattraction.\n\nThis  is  not  “a  wake-up  call”,  the  cruise  industry  in  Barbados  has  long  passed  that  stage.  The\ncruise sector, which provides more than half of all tourist visitors to the island, which contributed\n71.3  million  US  dollars  in  foreign  exchange  during  the  2017/18  cruise  year,  and  which  is\nresponsible for more than two thousand, three hundred and fifty jobs, is not only underachieving,\nit  has  also  been  on  a  downward  trajectory  for  the  past  decade.  More  than  enough  words  have\nbeen spoken and written. Serious action is now a necessity.\n\nxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx\n\n### National Cruise Development Commission\n\nPage 72\n\n\fAppendix 1\n\nA Summary of Objectives & Recommended Actions\n\nOnce  the  orientation,  strategic  objectives,  and  expected  outcomes  outlined  in  this  Report  have\nbeen  approved  by  the  applicable  policy  makers,  a  complete  action  plan  can  be  prepared  in\ncooperation  with  the  relevant  Ministries  and  agencies.  The  action  plan  should  identify  the\nMinistry or agency responsible for each action, the estimated budget, the timeframe within which\nthe  action  should  be  completed,  a  number  of  key  performance  indicators,  and  provision  for\nexplaining the status of implementation at any given point in time.\n\nMeanwhile,  thirteen  (13)  expected  Outcomes  and  the  eighty-two  (82)  recommended  actions,\nwhich are integral to the attainment of the particular Outcomes, are presented below.\n\n### Expected Outcome (1)   Enhanced Port experience for cruise passengers visiting Barbados\n\nRecommended actions\nAccording to the 2017/18 version of the triennial cruise passenger survey conducted by BREA\non  behalf  of  the  FCCA,  the  shore-side  welcome,  which  cruise  passengers  experience  at  the\n#### Barbados  Port,  is  ranked  29th  out  of  the  36  cruise  destinations  in  the  Caribbean  and  Latin\nAmerica.\n\nFrom the view of the cargo sheds as the ship docks to the exit from the Port by tour bus, taxi or\non foot, the cruise passenger experience must be enhanced.  In the interim, before a new Cruise\nTerminal  is  constructed,  there  must  be  significant  upgrades  to  the  shore-side  welcome,  transit\nthrough the Port and Cruise Terminal, boarding of tour buses or taxis, and the process of exiting\nthe Port.   The following are some of the recommended interventions:\n\n  Reproduction  on  shed  doors  of  murals  &/or  pictorial  advertisements  of  Barbadian\nheritage sites and iconic attractions. Shed three (3), which is  used for the processing of\nair-to-sea passengers, should also be freshened-up internally and on the land-side.\n\n  Organisation of a rotating package of entertainment – perhaps including a small steel pan\nband or tuk band and stilt walkers in order to bring a feeling of pleasure, fun, Caribbean\nmusic, and colourful costumes to the shore-side welcome.\n\n  Installation of new standardized signage throughout the Port and onto Trevor’s Way. The\nnew  signs,  some  of  which  have  already  been  installed,  will  use  English,  plus  easily-\nrecognised international symbols.\n\n  Introduction  of  a  proper  regime  to  regulate  the  movement  of  equipment,  traffic,  &\npedestrians  in  the  Port.    There  should  be  a  clearly-spelt  out  regime  to  ensure  that\n\n### National Cruise Development Commission\n\nPage 73\n\n\feveryone  involved  understands  what  is  expected.  In  addition,  adequate  transportation,\nincluding  vehicles  specially-equipped  for  the  differently-abled,  should  be  available  to\nmove passengers from the Breakwater or other distant berths to the Cruise Terminal.\n  Creating branding/marketing opportunities by deploying “Welcome to Barbados” signs\nand related images strategically in positions where cruise passengers might be motivated\nto take selfies and other photos to post on their various social media platforms  showing\nfriends and relatives that they are in Barbados.\n\n  Introduction  of  new  Tour  Bus  Dispatch  system  that  takes  into  account  the  increased\nnumber  of  tour  operators  and  buses.  This  system  would  involve  the  scheduling  of\npassenger pick-up times, plus the use of holding areas for buses waiting to enter assigned\nloading bays.\n\n  Introduction  of  new  Taxis  Dispatch  system  that  takes  into  account  the  need  for\ntransparency and fairness in the allocation of trips. The system, which would be regulated\nby  independent  dispatchers,  is  also  intended  to  eliminate  direct  solicitation  of  cruise\npassengers by taxis drivers and thereby removing the trigger, which has led to verbal and\nsometimes physical altercations in the past.\n\n  Engage  with  Customs  Dept.  in  an  effort  to  secure  the  timely  deployment  of  additional\nCustoms  Officer, both  for additional “Boarding  Parties”  and to  speed-up the movement\nof tour bus and taxi traffic out of the Port.\n\nExpected Outcome (2)\n  Expedited  launch  of  ‘pilot  project’  re  cruise  ships  berthing  on  the  West\n\nCoast\n\nRecommended actions\nA designated facilitator should be mandated to take charge of this project and drive it through the\nvarious stages from repair of the broken jetty to assessment of the ‘pilot phase’.\n\na)  A  lead  entity  and/or  individual  “champion”  should  be  designated  to  advance  this\n\ninitiative;\n\nb)  Efforts should be made to motivate the relevant  Government Ministry/Agency to  repair\n\nthe broken jetty expeditiously;\n\nc)  Lead  agency  must  endeavor  to  persuade  the  Customs,  Immigration,  and  Port  Health\n\nservices to facilitate a ‘pilot project’ by operating from a very temporary base.\n\nd)  The cruise line’s offer of assistance should be accepted to ensure the speedy installation\nof  facilities,  which  are  acceptable  to  us,  while  also  satisfying  the  requirements  of  the\napplicable cruise lines.\n\ne)  Tourism authorities should engage with tour operators and taxi associations to facilitate\n\nthe provision of workable tour and taxi dispatch arrangements.\n\n### National Cruise Development Commission\n\nPage 74\n\n\ff)  We  should  undertake  an  assessment  of  the  ‘pilot  phase’,  viewed  from  Barbados’\nperspective  and  from  the  experience  of  the  relevant  cruise  lines,  in  order  to  take  into\nconsideration ‘lessons learned’ as we determine how best to move forward.\n\ng)  Assuming that the ‘pilot phase’ was satisfactory work would begin on the acquisition of\nthe requisite permanent facilities to accommodate appropriately the applicable regulatory\nauthorities and the disembarking cruise passengers.\n\n### Expected Outcome (3)   Improved Maintenance of Roads and Related Infrastructure\n\nRecommended actions\nThe road conditions and the general physical environment had become a major embarrassment.\nSome  steps  have  been  taken  to  address  the  situation,  but  a  lot  of  work  remains  to  be  done.  In\norder  to  improve  road  conditions  and  the  general  ambiance  around  the  country,  it  is\nrecommended that:\n\n-  The  Ministry  of  Transport  and  Works  (MTW)  should  undertake  a  comprehensive  road\nrehabilitation  programme,  which  is  front  loaded  to  resurface,  as  a  priority,  the  most\nheavily travelled roads and those used by tour buses and taxis to visit popular attractions.\n\n-  The NCC must develop and implement a structured action plan to address systematically\n\nthe road verges, parks, and beaches for which that agency has responsibility.\n\n-  Since the SSA is struggling with limited resources, including garbage trucks, the agency\nshould have discussions with the private sector with a view towards freeing-up some of\nthe SSA’s resources for household garbage collection as more businesses are encouraged\nto use private sanitation services providers.\n\nThe absence or unavailability of public toilets is  a problem  from  Bridgetown to  the most rural\ncommunities. In order to provide better facilities for sightseeing residents and cruise passengers,\nit is recommended that:\n\n-  A  few  visitor  centres  should  be  located  along  heavily  travelled  routes.  These\ncentres would  comprise  an  information  kiosk,  space  for  vendors  of  local  arts  and  craft,\nprovision for refreshment (a drink, sandwich, muffin etc.) and attended toilet facilities.\n\n-  All public toilet facilities should be properly maintained, serviced by paid attendants, and\nkept open on public holidays & Sundays, as necessary.   Consideration might be given to\ncharging a small user fee to help cover the attendant’s wages and to reduce the level of\nrandom vandalism.\n\n### National Cruise Development Commission\n\nPage 75\n\n\fExpected Outcome (4)\n  New lease on life for Pelican Craft Centre\n\nRecommended actions\nThe Pelican Craft Centre is struggling to survive. It is on life support and barely breathing. There\nis no visible evidence from the main road (Princess Alice Highway) that this complex is a centre\nfor the production and sale of arts and craft. The recommendations listed below are intended to\nbreathe new life into Pelican Village so that it becomes a vibrant location marketing a range of\nlocal arts and craft.\n\n  Installation of new management, public or private sector  - One of the first challenges\nfor the new management would be to engage with the current tenants and make it clear\nhow  they  propose  to  work  -  New  leases,  clearly  setting  out  the  rights  &  obligations  of\nboth parties would be introduced.\n\n  Timely  maintenance  and  refurbishment  to  make  the  complex  more  presentable,\nincluding the use of murals depicting our culture, iconic craft items, heritage images etc.\ncould be interesting.\n\n  Signage – Introduce a new series of bold, attention-getting, and unambiguous signs - in\n\nthe Cruise Terminal, on Trevor's Way, on each side of the Pelican complex.\n\n  Advertising  –  The  management  of  Pelican  Craft  Centre  should  execute  a  marketing\n\ncampaign – online, in print, on radio & TV.\n\n  Street  crossings    -  Create  proper  street  crossings  with  flashing  lights  (from  Trevor's\nWay)  and  from  the  'cross  street'  for  persons  who  might  walk  on  the  BIDC  side  of\nPrincess Alice Highway.\n\n  Entertainment  –  When  cruise  ships  are  in  Port  and  on  other  special  occasions  -  crop\nover, Independence, Christmas and the like - a colourful entertainment package should be\nrolled out on the lawns in front of the complex and around the area of the gazebo.\n\n  Open  market  –  The  lawn  beside  Princess  Alice  Highway  and  the  areas  around  the\ngazebo  and  along  the  artist  wall  should  be  used as  an  “open  air  craft  market”  -  mobile\n\"umbrella equipped stands\" could be used to protect both the vendors and their customers\nfrom the sun.\n\n  Customer  experiences  –  Arrange  interactive  craft  demonstrations,  in  areas  such  as:\nwood  &  straw  work,  jewelry  design,  leather  craft,  glass  blowing,  pottery  making  etc.\n\n### National Cruise Development Commission\n\nPage 76\n\n\fwhere  visitors  can  see/experience  craft  items  being  made  and,  of  course  have  the\nopportunity to buy.\n\n  Product  development  –  There  should  be  a  focused  effort  to  introduce  a  line  of\n“Authentic  Barbadian  souvenirs”  -  clock  tower  of  Parliament,  clock  tower  at  St.  Ann's\nFort, Lion at Gun Hill, the Harp Gun (there must be photos somewhere), the screw dock,\nold windmills, Green monkeys, turtles etc. etc.\n\n### Expected Outcome (5)   More effective promotion of Historic Bridgetown and its Garrison\n\nRecommended actions\nTo date, promotion of the Bridgetown Heritage Site has been restrained, the following are some\nrecommendations to raise the profile:\n\n  The UNESCO World Heritage designation of Bridgetown and its Garrison as a World\n\nHeritage Site should be celebrated and promoted.\n\n  Tour operators should be encouraged to choose from the selection of Bridgetown heritage\nattractions to offer a variety of tour packages and enhance the experiences of our visitors.\n\n  Interpretive  signage  must  be  installed  throughout  the  Heritage  area  to  enhance  visitor\nappreciation  for  Historic  Bridgetown  and  its  Garrison.  These  interpretive  signs  can\nalmost  become  destinations  in  their  own  right.  They  will  draw  attention  to  the  unique\nhistory and identity of the Heritage City and help visitors to appreciate better why it is a\nUNESCO World Heritage Site.\n\n  We should compile a comprehensive list  of existing Bridgetown heritage attractions, of\nthose which are now being developed, and of those with potential for development.\n\n  The BTMI should become more proactive in helping tour operators, taxi  operators, and\n\nheritage attractions to build strategic relationships.\n\nExpected Outcome (6)\n  Smart City Launched, Garbage Collection Improved, & Bridgetown Open\n\nfor Business\n\nRecommended actions with respect to phase one of Bridgetown re-imagined\n\n  The  SSA  and  the  business  community  should  come  together  and  consider  alternative\n\ngarbage collection arrangements in the city;\n\n### National Cruise Development Commission\n\nPage 77\n\n\f  Deploy more and larger trash cans throughout Bridgetown with provisions for servicing\n\nthe cans throughout the business day;\n\n  Maximize any opportunity to use the Careenage for recreation and in-city transportation;\n  Deploy  tourist  guides  around  Bridgetown  to  give  directions  and  provide  other\n\ninformation about the city.\n\n  Smart city launched with the introduction of free wifi throughout Bridgetown.\n  A  cooperative  effort  should  be  launched  to  persuade  stores  in  Bridgetown  to  open  for\nbusiness on Sundays and Public Holidays when cruise ships are in Port and, at the same\ntime, to get more cruise passengers into the Bridgetown stores.\n\n  Introduction of a walking or self-guided map highlighting points of interest from the Port\n\nexit to St. Patrick’s Cathedral.\n\nExpected Outcome (7)\n  Traffic-free  Broad  Street,  Water-taxis  Service  Launched,  &  Visitor\n\nCentres Open\n\nRecommended actions with respect to phase two of Bridgetown re-imagined\n\n  Use the IDB-funded tourism project, to establish a major Visitor Centre in Bridgetown,\nas  a  catalyst  to  encourage  and  facilitate  private  sector  investment  in  a  series  of  smaller\nsatellite  Visitor  Centres  throughout  Bridgetown.    The  establishment  of  these  centres\nwould also help to address the insufficiency of public toilets.\n\n  Re-route vehicular traffic from Broad Street, thereby making it a pedestrian street and\n\nopening it to outdoor cafes and the like.\n\n  Use large potted plants to improve the aesthetics of traffic-free streets, public squares and\n\nthe like in Bridgetown;\n\n  Re-introduce community entertainment in places such as Baxter’s Road\n\n\nIntroduce a water-taxi service from Bridgetown eastwards to Oistins and westwards to\n.Speightstown.\n\nExpected Outcome (8)\n  Iconic  Bridgetown  Market  Developed,  Marina  built,  Up-market  Housing\n\nIntroduced, & Restoration of Heritage Buildings underway\n\nRecommended actions with respect to phase three of Bridgetown re-imagined\n\n  Develop  the  Bridgetown  Fish  Market  area  into  a  world  class  food  and  entertainment\n\ncomplex;\n\n  Promote and facilitate the building of a marina in the larger Carlisle Bay area;\n\n### National Cruise Development Commission\n\nPage 78\n\n\f  Convert  abandoned  and  underutilized  warehouse  space  in  Bridgetown  into  up-market\napartment/town house-type accommodation in order to attract young professionals to live\nin the City.\n\n  Re-claim water-side land from parking lots and convert them for recreational use, quality\n\nhousing, or environmentally-friendly commercial activity.\n\n  Initiate a long term plan to restore Bridgetown’s historical buildings, using mostly donor\n\nfunding\n\n### Expected Outcome (9)   Oistins Bay Garden complex refurbished\n\nRecommended actions\nGiven  plans  for  a  major  re-building  of  the  Oistins  Bay  Gardens  at  a  later  phase  of  the  IDB-\nfunded tourism re-invigoration programme, the following actions are recommended at this time:\n\n-  Upgrade  toilet  facilities  and  make  arrangements  to  ensure  that  they  are  open  and  attended\n\nwhenever the Bay Garden complex is open;\n\n-\n\nImplement  a  sustainable  solution  to  the  problem  of  stagnant  water  and  poor  run-off  in  the\narea in front of the craft vendor stalls;\n\n-  Arrange  for  the  removal  of  rotting  boats  and  other  debris  from  the  rear  of  the  Bay  Garden\n\ncomplex;\n\n-  Refurbish craft vendor stalls, not only to make them more comfortable for vendors, but also\nto improve the shopping ambiance for persons looking to do business with the vendors;\n\n-  Refresh/restore  the  Complex’s  wooden  tables  and  chairs  in  order  improve  the  general\n\nappearance of the area;\n\n-  Deploy a sufficient number of garbage bins and arrange for their timely servicing when the\n\ncomplex is open;\n\n-\n\nImprove  lighting  and  security  throughout  the  Bay  Gardens  complex,  particularly  on  Friday\nand Saturday nights.\n\n### National Cruise Development Commission\n\nPage 79\n\n\fExpected Outcome (10)\n  The number of cruise passengers homeporting in Barbados increased from\n\n149,065 to 185,000 by the 2023/24 cruise year\n\nRecommended actions\n\n  The total spend from a cruise ship homeporting in Barbados is more than double the total\nspend  by  an  identical  number  of  passengers  on  a  regular  cruise  ship  visit.  Barbados’\ncruise promotion strategy must place more emphasis on developing the homeporting side\nof the cruise sector.\n\n  As cruise tourism authorities intensify the promotion of homeporting, discussions should\nbe  initiated  with  management  of  GAIA  to  determine  the  most  appropriate  arrival  and\ndeparture regimes to handle the increasing number of homeporters.\n\n  Tourism authorities should engage with applicable cruise lines, at an early stage, in order\nto determine the best way forward to accommodate comfortably the additional air-to-sea\ncruise passengers.\n\n  Expanded homeporting will only work if the associated requirements are also addressed.\nTourism  officials  must  ensure  that  hotels  are  ‘on  board’  with  good  packages,  and  that\nattractions are ready to deliver quality night experiences.\n\n  The  work  involved  in  planning,  promoting,  and  securing  homeporting  calls  is  more\nchallenging  for  tourism  officials.  BTMI  must  develop  a  well-researched,  carefully-\ntargeted, and sustained programme to attract additional homeporting calls.\n\n  Although  the  USA  continues  to  be  the  largest  source  market  for  cruisers  into  the\nCaribbean,  Europe  is  a  faster-growing  market  and  European  homeporters  seem  more\ninterested  in  pre/post  stayovers.  Against  this  background,  Barbados  should  step-up  its\nefforts to persuade more Europeans to take a cruise to Barbados.\n\nExpected Outcome (11)\n  A  More  Diversified  cruise  Tourism  Product,  Characterized  by  Strategic\n\nPartnerships\n\nRecommended actions\n\no  Barbados  should  focus  on  diversifying  its  range  of  visitor  attractions  and  on  enhancing\nvisitor perception of what the island has to offer. Visitors should feel that Barbados is a\nplace to which they want to return and about which they are happy to tell their friends;\no  The  promotion  of  Barbados  as  a  cruise  destination  should  place  greater  emphasis  on\n\nquality of service and giving visitors a memorable first impression of Barbados;\n\no  Passengers  and  cruise  lines  favour  destinations,  which  consistently  deliver  high  quality\nproduct. Barbados must be looking constantly for unique attractions/experiences that can\nbe packaged and brought to market.\n\n### National Cruise Development Commission\n\nPage 80\n\n\fo  Tourism officials and the relevant private sector actors must be mindful of the need for\nentertainment and other packages/experiences, specifically developed for ships’ crews.\no  Given the profile of the smaller ships as catering to more affluent cruise passengers, who\nare  interested  in  heritage  and  culture,  Barbados  should  target  this  group  in  its  overall\nmarketing package;\n\no  Given  that  individual  Barbadian  SMEs  seem  to  have  difficulty  in  satisfying  all  of  the\ncruise lines requirements for business plans, liability insurance and the like, they should\npursue  an  approach  based  on  establishing  partnerships  or  strategic  alliances  with\ncomplementary attractions and/or tour operators.\n\no  Greater emphasis  should be placed on the development of human capital  within SMEs,\nparticularly  exposure  related  to  how  business  is  done  with  the  cruise  lines.  This  would\nalso include facilitating more interaction between cruise companies and SMEs;\n\no  Barbados should avoid trying to copy what seems to be working for other destinations in\nthe region and, instead,  should focus on developing  and marketing authentic Barbadian\nattractions or experiences, which are different from what is available in other Caribbean\ndestinations;\n\nExpected Outcome (12)\n  BTMI’s  Cruise  Division  or  a  comparable  entity  must  become  a  genuine\n\nfacilitator\n\nRecommended actions\nAlthough the Cruise Division already undertakes some of the activities listed below, there should\nbe greater support and appreciation for the need to pursue a systematic and holistic  facilitating\nrole, including:\n\n  The cultivation of relationships with the developers and operators of attractions, heritage\n\nor cultural experiences and the like;\n\n  Working  with  and  assisting  tour  operators  in  evaluating,  packaging,  marketing,  and\n\ndistributing products to satisfy cruise passenger demand;\n\n  Liaison with other support entities, including sea and airport management;\n  Building relationships with relevant regulatory institutions, particularly those responsible\nfor  granting  various  approvals,  licenses  etc.  to  enable  businesses  to  serve  the  cruise\nsector;\n\n  Building  contacts  in  and  relationships  with  the  cruise  companies  and  cruise  lines,\nparticularly those executives, who are responsible for the deployment of cruise ships and\nwho plan itineraries for those ships; and\n\n  Working  with  counterparts  in  other  regional  destinations,  particularly  those  on  the\n“Southern  Caribbean  cruise  itinerary”,  with  the  objective  of  developing  joint  strategic\napproaches in negotiating with cruise companies and in marketing the cruise itinerary.\n\n### National Cruise Development Commission\n\nPage 81\n\n\fExpected Outcome (13)\n  Implementation  of  an  industry-wide  continuous  training  programme,\n\nincluding certification of tour guides\n\nRecommended actions\nBarbados’ tourism authorities and persons in the cruise sector must prioritize training and treat it\nas a core component of capacity-building with respect to essential cruise sector personnel.\n\n  The courtesy of store employees is one of the areas where Barbados lags behind most of\nits regional competitors. Given Barbados’ profile in the cruise tourism sector and given\nthe  importance  of  presenting  a  welcoming  and  visitor-friendly  outlook  to  the  island’s\nvisitors, it is recommended that training for service staff should be a continuous process,\nin how best to engage with visitors and Barbadians to whom they are delivering a service.\n\n  In  place  of  ad  hoc  periodic  training  sessions,  Barbados  should  institute  a  training\nprogramme, which provides for frequent ‘refreshers’ in order to improve the likelihood of\nthe  desired  behavior  becoming  ingrained.  This  ongoing  training  should  cover  store\nemployees, taxis drivers, tour bus drivers, persons working with attractions and the like.\n\n  Barbados  should  introduce,  as  a  priority,  professionally-developed  and  delivered\ntraining  for  tour  guides.  The  relevant  courses,  oriented  towards  ensuring  that  the\nattendees acquire comprehensive knowledge of Barbadian heritage and culture and are\nequipped to deliver engaging tours, should lead to certification.\n\n  Barbados  should  benefit  from  the  experience  of  strategic  partners,  by  partnering  with\nFCCA-affiliated entities, which already provide training for various types of service staff.\nCruise tourism officials, as a priority, should take steps to make such training available to\nthe various categories of front line staff operating in the cruise sector.\n\nXXXXXXXXXXXXXXXXXXXXXXXXX\n\n### National Cruise Development Commission\n\nPage 82\n\n\fReferences\n\nBarbados Tourism Master Plan 2014-2023, Prepared by Environmental Planning Group Inc. &\nHLA Consultants for the Ministry of Tourism and International Transport\n\nBREA, Oct. 2018, “Economic contribution of cruise tourism to destination economies”, 2017/18\n\nBREA, Oct. 2015, “Economic contribution of cruise tourism to destination economies”, 2014/15\n\nCentre for the Promotion of Imports from developing countries (CBI), Ministry of Foreign\nAffairs of the Netherlands  - “What are the opportunities for cruise tourism with guests from\nEurope”;\n\nDaly,  J.,  Fernandez-St,K.,  (Aug.2017)  “Barbados  in  the  Cruise  Tourism  Global  Value  Chain”,\nDuke Global Value Chain Center, Duke University\n\nHilaire, A., (2007)  “An analysis of cruise tourism in the Caribbean and its impact on regional\ndestination ports”;  World Maritime University\n\nLo, C., (Nov.2018) “Charting a fresh course for Barbados’ cruise sector”;\n\nMonie, G. D., Hendrickx, F., Joos, K., Couvreur, L., & Peeters, C. (1998). “Strategies for Global\nand  Regional  Ports-the  Case  of  Caribbean  Container  and  Cruise  Ports”.  London:  Kluwer\nAcademic Publishers.\n\nThe World Travel & Tourism Council, “Travel & Tourism Economic Impact 2017 – Barbados”;\n\nTravel & Cruise Magazine, Third Quarter 2018, published by FCCA\n\n### National Cruise Development Commission\n\nPage 83\n\n"
}