{
  "bill_id": 406,
  "slug": "resolution-re-national-cruise-development-commission-report",
  "title": "Resolution re National Cruise  Development Commission Report",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/542c87d10fd8d0bf549d116931b6618e.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-06-18",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "RESOLUTION\n\nWHEREAS the Government of Barbados has recognised that while the\ncruise industry has been recording significant growth over the last several\nyears, outpacing land-based arrivals, cruise lines are reporting declining\nconsumer interest in Barbados, due to the fact that its product offering, in\ngeneral, and onshore tour capacity, in particular, has neither diversified\nnor expanded over the last decade.\n\nAND  WHEREAS  the  Government  of  Barbados  established  a  National\nCruise  Development  Commission  on  August  13,  2018  to  provide  for\nimmediate  implementation,  a  Mission  Critical  Plan  to  address  the\nchallenges currently facing the cruise sector in Barbados.\n\nAND  WHEREAS  the  Report  of  the  National  Cruise  Development\nCommission,  entitled  “A  New  Dawn  for  Cruise  Tourism  in  Barbados”,\nanalyses  the  cruise  tourism  industry;  examines  current  global  trends  in\ncruise  tourism  and  the  Barbados  situation  and  gives  recommendations\nneeded to overcome the principal challenges confronting cruise tourism\nin Barbados.\n\nAND  WHEREAS  the  Report  also  examines  the  key  infrastructure\nnecessary for the cruise industry to operate at an optimum level including\nenhancing  the  Port  experience  for  cruise  passengers,  improving  road\ninfrastructure and the need to improve the overall  physical environment\nwhich often prevents cruise passengers from visiting tourist attractions or\nlandmarks.\n\nAND WHEREAS the Report provides key strategic approaches to cruise\ndevelopment  including  looking  more  closely  at  the  European  market,\nexploring mechanisms for growing summer cruise traffic and prioritizing\ntraining.\n\n\fAND WHEREAS the Report provides recommendations as to how those\npublic sector  institutions  involved  in  the  cruise industry  can  play  pivotal\nroles  as  intermediaries  between  the  policy  makers  and  private  sector\noperators, so as to ensure that an appropriate regulatory mechanism is in\nplace to facilitate the business community.\n\nAND WHEREAS It is intended that the recommendations put forward by\nthe  Commission  will  contribute  to  a  sustainable  increase  in  the  cruise\nindustry-related economic benefits for Barbados.\n\nAND  WHEREAS  the  Cabinet  on  May  30,  2019  agreed  that  the  Final\nReport  submitted  by  the  National  Cruise  Development  Commission\nentitled  “A  New  Dawn  for  Cruise  Tourism  in  Barbados”  be  laid  in\nParliament.\n\nBE IT RESOLVED that the Parliament of Barbados take note of the Final\nReport of the National Cruise Development Commission.\n\nAPPROVED by the House of Assembly this   day of                2019\n\nSpeaker\n\nAPPROVED by the Senate this\n\nday of\n\n2019.\n\nPresident\n\n"
}