{
  "bill_id": 408,
  "slug": "customs-amendment-no-3-bill-2019",
  "title": "Customs (Amendment) (No. 3) Bill,  2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/c25c3b8b51e7a63b13d5e1a5e43485e2.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-07-17",
  "first_reading": "2019-07-17",
  "gazette_date": "2019-07-29",
  "markdown": "2019-07-05\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Customs Act, Cap. 66 to provide for advance cargo\n\ninformation.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 66\n\nAmendment of section 34 of Cap. 66\n\nAmendment of section 34A of Cap. 66\n\nRepeal and replacement of section 34A.1 of Cap. 66\n\nAmendment of section 34A.2 of Cap. 66\n\nAmendment of section 34C of Cap. 66\n\nAmendment of section 34E of Cap. 66\n\nAmendment of Cap. 66\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nAmendment of section 78 of Cap. 66\n\n11.\n\nAmendment of section 81 of Cap. 66\n\n12.\n\nAmendment of section 241 of Cap. 66\n\n13.\n\nAmendment of Cap. 66\n\n14.\n\nAmendment of Cap. 66\n\n15.\n\nAmendment of the First Schedule to Cap. 66\n\n\f3\n\nSCHEDULE\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Customs Act, Cap. 66 to provide for advance cargo\n\ninformation.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n2019.\n\nThis  Act  may  be  cited  as  the  Customs  (Amendment)  (No.      )  Act,\n\nAmendment of section 2 of Cap. 66\n\nSection 2 of the Customs Act, Cap. 66 in this Act referred to as the\n2.\nprincipal  Act,  is  amended  by  inserting  the  following  definitions  in  the\nappropriate alphabetical order:\n\n“  “advance cargo information” means a manifest, an airway bill, a bill\nof lading, information or data as set out in the First Schedule in\nrespect of\n\n(a)\n\n(b)\n\ncargo and stores including all imports, exports in transit and\ntrans shipment of goods; or\n\nany package of which there is no bill of lading or airway bill\non board an aircraft or ship;\n\n“break bulk” means cargo that must be loaded individually and is not\n\nin intermodal containers;\n\n“bulk” means cargo that is transported unpackaged in large quantities;\n\n“cargo”  means  goods,  mail,  stores,  crew  member’s  effects  and\npassenger’s accompanied baggage carried on board an aircraft or\nship for consideration;\n\n“cargo manifest” means a list of cargo being transported or warehoused;\n\n“cargo reporter” includes a freight forwarder or a consolidator;\n\n“carrier” means a person who transports goods or is in charge of or\n\nresponsible for the operation of the means of transport;\n\n\f7\n\n“consolidator”  means  a  person  or  firm  that  combines  cargo  from\nmultiple shippers into a single shipment providing consolidation\nservices;\n\n“freight  forwarder”  means  a  person  who  specialises  in  arranging\nstorage and shipping or merchandise on behalf of shippers;\n\n“long haul flight” means a flight with a duration of more than 8 hours;\n\n“short  haul  flight”  means  a  flight  with  a  duration  of  less  than  8\n\nhours.”.\n\nAmendment of section 34 of Cap. 66\n\n3.\nthe following:\n\nThe principal Act is amended by deleting section 34 and substituting\n\n“Duty of master of ship or commander of aircraft\n\n34.(1)\nto arrive in Barbados.\n\nThis section shall apply to a ship or aircraft that is expected\n\n(2)\nThe master of every ship, the commander of every aircraft, the\nagent of the master or commander respectively and every cargo reporter\nwhether the ship or aircraft is laden or unladen shall at the time stated\nin subsection (6) provide the proper officer at the intended port of arrival\nin Barbados with the advance passenger information and advance cargo\ninformation set out in Part I and Part II of the First Schedule.\n\nThe  advance  passenger  information  and  the  advance  cargo\n(3)\ninformation referred to in subsection (2) shall be in electronic format\nor in a form that is approved by the Comptroller.\n\n\f8\n\nThe  advance  passenger\n\n(4)\ninformation  and  advance  cargo\ninformation referred to in subsection (2) shall consist of data in respect\nof\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe estimated time of arrival of the ship or aircraft;\n\na list of the names of all passengers and crew on board the\nship  or  aircraft  in  accordance  with  Part  I  of  the  First\nSchedule;\n\nthe port or airport at which the ship or aircraft will arrive;\n\na  list  of  the  ship  and  aircraft’s  cargo  for  discharge  in\nBarbados,  whether  commercial  or  non-commercial  in\naccordance with Part II of the First Schedule; and\n\na list of the ship or aircraft’s commercial cargo which is not\nintended for discharge in Barbados in accordance with Part\nIII of the First Schedule.\n\nThe master of a ship, commander of an aircraft, the agent of the\n(5)\nmaster  or  commander  respectively  and  every  cargo  reporter  shall  at\nsuch time as is stated in subsection (6) provide the Chief Operations\nOfficer of the JRCC with the data set out in the First Schedule in an\nelectronic format or in the form that is approved by the Chief Operations\nOfficer.\n\nWhere a ship or aircraft is expected to arrive in Barbados, the\n(6)\ndata referred to in subsections (4) and (5) shall be provided in the case\nof\n\n(a)\n\n(b)\n\n(c)\n\na commercial aircraft, no later than 40 minutes prior to the\ndeparture from the last port of call;\n\na  private  aircraft,  no  later  than  40  minutes  prior  to  the\ndeparture from the last port of call;\n\na ship or an aircraft arriving from outside the domestic space,\nno later than 24 hours prior to arrival; and\n\n\f9\n\n(d)\n\na ship or an aircraft arriving from a destination within the\ndomestic space, no later than one hour prior to arrival.\n\n(7)\nThe  advance  passenger  information  and  the  advance  cargo\ninformation  referred  to  in  subsection  (2)  shall  show  separately  any\ngoods which are\n\n(a)\n\n(b)\n\nin transit; or\n\nto be transferred to another ship or aircraft for re-exportation,\n\nand shall state whether there are any goods which are to remain on board\nfor exportation on the same ship or aircraft and the information shall\ngive an account of all goods remaining on board for exportation.\n\nOn  the  arrival  of  a  ship  or  aircraft  in  Barbados,  the  master,\n(8)\ncommander or agent of the master or commander shall proceed to the\nport or airport referred to in subsection 4(c).\n\nThe master of any ship, the commander of any aircraft to which\n(9)\nsubsection (2) applies or the agent of that master or commander may,\nwhere  specially  allowed  by  the  Comptroller  provide  the  advance\npassenger information and advance cargo information as required by\nthis section after arrival in Barbados and after bulk is broken.\n\n(10)\n\nA master, commander, agent or cargo reporter who\n\n(a)\n\nfails to comply with subsection (2), (3), (4), (5) or (7) is guilty\nof an offence and is liable on summary conviction to a fine\nof $50 000; or\n\n(b)\n\ntransmits  incomplete  or  false  data  is  liable  to  pay  to  the\nComptroller a penalty of $10 000.”.\n\nAmendment of section 34A of Cap. 66\n\n4.\nsubstituting the following:\n\nThe  principal  Act  is  amended  by  deleting  section  34A  and\n\n\f10\n\n“JRCC to share advance passenger and advance cargo\ninformation with intelligence agencies\n\n34A.\nWhere data is provided to the Chief Operations Officer of\nJRCC pursuant to section 34, the Chief Operations Officer shall share\nthat information with intelligence agencies.”.\n\nRepeal and replacement of section 34A.1 of Cap. 66\n\n5.\nsubstituting the following:\n\nThe  principal  Act  is  amended  by  deleting  section  34A.1  and\n\n“Use and retention of advance passenger information and\nadvance cargo information by JRCC\n\n34A.1.(1)\nWhere the Chief Operations Officer of JRCC receives data\npursuant  to  section  34(5),  JRCC  shall  use  the  advance  passenger\ninformation  and  advance  cargo  information  to  conduct  screening  of\npersons and cargo on board a ship or aircraft, which enters, departs from\nor travels within the domestic space.\n\nJRCC  shall  use  the  advance  passenger  and  advance  cargo\n(2)\ninformation  referred  to  in  subsection  (1)  to  conduct  screening  of\npersons against a watch list for the purposes of assisting participating\ncountries  or  intelligence  agencies  in  the  furtherance  of  national,\nregional and international security.\n\nWhere  JRCC  conducts  screening  of  persons  pursuant  to\n\n(3)\nsubsection (2) and as a result of the screening suspects that\n\n(a)\n\na person on board a ship or aircraft is\n\n(i)\n\na criminal;\n\n(ii)\n\na criminal deportee;\n\n\f11\n\n(iii)\n\ninvolved in criminal activity; or\n\n(iv)\n\na person of interest to an intelligence agency; or\n\n(b)\n\nthe cargo on board a ship or aircraft is liable to forfeiture\npursuant to section 207,\n\nJRCC  shall  share  the  information  with  law  enforcement  agencies  of\nparticipating countries and with intelligence agencies.\n\nAdvance cargo information and advance passenger information\n(4)\ncollected under this Act shall be retained by JRCC for a period of 7\nyears from the date of collection.”.\n\nAmendment of section 34A.2 of Cap. 66\n\n6.\nsubstituted:\n\nSection  34A.2  of  the  principal  Act  is  deleted  and  the  following\n\n“(1)\n\nThe Minister may by order\n\n(a)\n\nwaive any requirements of subsection (2), (4) or (5) of section\n34;\n\n(b)\n\nmodify any of the data referred to in the First Schedule; or\n\n(c)\n\nwaive or modify any of the requirements of subsection (6) of\nsection 34 with regard to the time required for the submission\nof data.\n\nAn  order  made  under  subsection  (1)  is  subject  to  negative\n\n(2)\nresolution.”.\n\nAmendment of section 34C of Cap. 66\n\n7.\n(1) and substituting the following:\n\nSection 34C of the principal Act is amended by deleting subsection\n\n\f12\n\n“(1)\nWhere a master of a ship, a commander of an aircraft, the agent\nof the master or commander or a cargo reporter fails to comply with the\nprovisions of subsection (2) of section 34, the Comptroller may seize\nand detain the ship or aircraft to which the non-compliance relates.”.\n\nAmendment of section 34E of Cap. 66\n\n8.\nsubstituting the following:\n\nThe  principal  Act  is  amended  by  deleting  section  34E  and\n\n“Denial of clearance\n\n34E.\nWhere the ship or aircraft referred to in subsection (2) of\nsection 34 is not a commercial ship or aircraft, the proper officer may\nrefuse to grant clearance to the ship or aircraft to leave port until\n\n(a)\n\n(b)\n\nthe penalty imposed under section 34(10)(b) has been paid;\nand\n\nthe  advance  passenger  information  and  the  advance  cargo\ninformation  referred  to  in  subsection  (2)  of  section  34  has\nbeen received.”.\n\nAmendment of Cap. 66\n\n9.\n36 the following:\n\nThe principal Act is amended by inserting immediately after section\n\n“Emergency stop\n\n36A.(1)\nWhere a ship or aircraft has to enter a port or land at an airport\nrespectively due to an emergency, accident or unfavourable weather\nconditions, the master of the ship or the commander of the aircraft is\n\n\f13\n\nnot  required  to  provide  advance  passenger  information  or  advance\ncargo information to the Comptroller.\n\nThe master or commander referred to in subsection (1) shall on\n\n(2)\narrival\n\n(a)\n\n(b)\n\n(c)\n\nimmediately report to the Comptroller;\n\nonly permit cargo to be off loaded from the ship or aircraft\nwith the permission of the Comptroller; and\n\ncomply  with  any  directions  given  by  the  Comptroller  in\nrespect of any cargo on board the ship or aircraft.”.\n\nAmendment of section 78 of Cap. 66\n\n10.\n\nSection 78 of the principal Act is amended by\n\n(a)\n\ndeleting subsection (2) and substituting the following:\n\n“(2)\nThe master of every ship and the commander of every aircraft or\nthe agent of the master or commander, or a cargo reporter whether the\nship  or  aircraft  is  laden  or  not,  shall,  at  such  time  as  is  provided  in\nsubsection (4), deliver a content to the proper officer at the intended\nport of departure in Barbados, in an electronic format approved by the\nComptroller or in the form approved by the Comptroller.”; and\n\n(b)\n\ndeleting subsection (4) and substituting the following:\n\n“(4)\nWhere a ship or aircraft has left or is expected to leave Barbados,\nthe data referred to in subsection (3) shall be provided no later than 30\nminutes after departure from Barbados.”\n\n\f14\n\nAmendment of section 81 of Cap. 66\n\n11.\nand substituting the following:\n\nSection 81 of the principal Act is amended by deleting subsection (1)\n\n“(1)\nWhere a master of a ship or a commander of an aircraft, an agent\nof the master or commander or a cargo reporter fails to comply with the\nprovisions of subsection (2) of section 78, the Comptroller may seize\nand detain the ship or aircraft to which the non-compliance relates.”.\n\nAmendment of section 241 of Cap. 66\n\n12.\nafter subsection (1) the following:\n\nSection 241 of the principal Act is amended by inserting immediately\n\nThe Minister may make regulations that prescribe the procedures\n\n“(1A)\nfor the reporting and processing of advance cargo information.”.\n\nAmendment of Cap. 66\n\n13.\n241 the following new section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Power to make order\n\n241A.(1)\nFirst Schedule.\n\nThe Minister may by order amend Part I and Part II of the\n\nThe  order  referred  to  in  subsection  (1)  is  subject  to  negative\n\n(2)\nresolution.”.\n\n\f15\n\nAmendment of Cap. 66\n\n14.\n260 the following:\n\nThe principal Act is amended by inserting immediately after section\n\n“Waiver in respect of advance passenger information and\nadvance cargo information\n\n260A.\nThe Minister in consultation with the Minister responsible\nfor Defence and National Security may waive the requirement for a\nmaster of a ship or the commander of an aircraft or the agent of the\nmaster or commander to provide advance passenger information or\nadvance cargo information in such circumstances and subject to such\nconditions as the Minister may prescribe where the ship or aircraft is\n\n(a)\n\n(b)\n\na military or law enforcement ship or aircraft; or\n\na ship or aircraft of a sovereign State and is in Barbados on\nofficial State business.”.\n\nAmendment of the First Schedule to Cap. 66\n\n15.\nsubstituting the First Schedule as set out in the Schedule to this Act.\n\nThe  principal  Act  is  amended  by  deleting  the  First  Schedule  and\n\n\f16\n\n L.R.O. 1998SCHEDULE(Section 15)\"FIRST SCHEDULE(Sections 34, 34A.2)Advance Passenger InformationPART IA. Data relating to the voyage or ﬂ ight 1. Flight Identiﬁ cation   IATA/ICAO airline code and ﬂ ight number, registration number 2. (Ship/Airline) Identiﬁ cation   IMO or Registration number. 3. Registration   Ship or aircraft’s registration number. 4. Country of Registration   Country where ship or aircraft is registered. 5. Agent or Owner   Name of agent for the ship or aircraft or, where no agent, name of owner. 6. Call Sign (if applicable) 7. Scheduled Departure Date  Date of scheduled departure of ship or aircraft based on local time of departure from location.\f17\n\n L.R.O. 1998PART I - (Cont'd)A. Data relating to the voyage or ﬂ ight - (Concl'd) 8. Scheduled Departure Time   Time of scheduled departure of ship or aircraft based on local time of departure from location. 9. Scheduled Arrival Date   Date of scheduled arrival of ship or aircraft based on local time of arrival at location.10. Scheduled Arrival Time   Time of scheduled arrival of ship or aircraft based on local time of arrival at location.11. Last Place or Port of Call of Ship or Aircraft   Ship or aircraft departed from this last place or port of call to go to a place or port of call.12. Place or Port of Initial Arrival of Ship or Aircraft   Place or port of call in the country of destination where the ship or aircraft arrives from the    last place or port of ship or aircraft initial arrival.13. Subsequent Place or Port of Call Within the Country or Domestic Space14. Number of passengers on board ship or aircraft   Total number of passengers on board ship or aircraft.15. Number of crew on board ship or aircraft   Total number of crew on board ship or aircraft.Schedule - (Cont'd)\f18\n\n L.R.O. 1998PART I - (Cont'd)B. Data relating to each individual on board a ship or aircraftCore Data Elements of the Ofﬁ cial Travel Documents 1. Ofﬁ cial Travel Document Number   Passport or other ofﬁ cial travel document number. 2. Issuing State or Organisation of the Ofﬁ cial Travel Document   Name of the state or organisation responsible for the issuance of the ofﬁ cial travel document. 3. Ofﬁ cial Travel Document Type   Indicator to identify type of ofﬁ cial travel document. 4. Expiration Date of Ofﬁ cial Travel Document   Expiration date of the ofﬁ cial travel document 5. Surname and Given Name(s)   Family name and given name(s) of the holder as they appear on the ofﬁ cial travel document. 6. Nationality   Nationality of the holder/of the travel document. 7. Date of Birth   Date of birth of the holder of the travel document. 8. Gender   Gender of the holder. 9. Place of Birth   Please give City and Country of birth.10. Place or Port of Original Embarkation   Place or Port on that journey where traveller ﬁ rst boarded for foreign travel.Schedule - (Cont'd)\f19\n\n L.R.O. 1998PART I - (Cont'd)B. Data relating to each individual on board a ship or aircraft - (Cont'd)Core Data Elements of the Ofﬁ cial Travel Documents - (Cont'd)11. Place or Port of Clearance   Place or port where the traveller is cleared by the border control agencies.12. Place or Port of Onward Foreign Destination   Foreign place or port where the traveller is transiting.13. Passenger Name Record (PNR) Data   As available in the traveller's Passenger Name Record in the carrier's Reservation System    including all historical changes to the PNR listed.  Must include:(1) PNR record locator(2) Date of reservation or issue of ticket(3) Date(s) of intended travel(4) Surname and Given Name(s)(5) Address and contact information (telephone number, e-mail address)(6) All forms of payment information, including billing address(7) Complete travel itinerary for speciﬁ c PNR(8) Frequent ﬂ yer information(9) Travel agency or Travel agentSchedule - (Cont'd)\f20\n\n L.R.O. 1998PART I - (Cont'd)B. Data relating to each individual on board a ship or aircraft - (Concl'd)Core Data Elements of the Ofﬁ cial Travel Documents - (Concl'd)(10) Travel status of passenger, including conﬁ rmations, check-in status, no show or go show information(11) Split or divided PNR information(12) General remarks (including all available information on unaccompanied minors under 18 years, such as name and gender of the minor, language(s) spoken, name and contact details of guardian on departure and relationship to the minor, name and contact details of guardian on arrival and relationship to the minor, departure and arrival agent)(13) Ticketing ﬁ eld information, including ticket number, date of ticket issuance and one-way tickets, Automated Ticket Fare Quote ﬁ elds(14) Seat number and other seat information(15) Code share information(16) All baggage information(17) Number and other names of travellers on PNR(18) Any Advance Passenger Information (API) data collected(19) All historical changes to the PNR listed in numbers 1 to 18Schedule - (Cont'd)\f21\n\n L.R.O. 1998PART I - (Concl'd)C. Additional Data 1. Visa Number (if applicable)  2. Place of Issuance of the Visa   Place where Visa was issued 3. Date of Issuance of the Visa   Date when Visa issued 4. Other Document Number used for Travel (if applicable)   The other document number used for travel when the ofﬁ cial travel document is not required 5. Other Document Number used for Travel (if applicable)   Type of Other Document used for Travel (supporting travel document) 6. Primary Residence   Country of Primary Residence    (Country where Passenger resides most of the year)   Address    (location identiﬁ cation such as: street name and number)   City   State/Province/Country   Postal CodeD. Data relating to the Reporting Party   Reporting Party Name   Reporting Party Telephone Number   Reporting Party Facsimile Number   Reporting Party Electronic Mail AddressSchedule - (Cont'd)\f22\n\n L.R.O. 1998PART II(Section 34(2), (4)(d))Advance Cargo InformationElectronic Manifest Management AsycudaA. AIR CARGO DATA MESSAGESCargo Manifest:To be submitted by AirlinesMaster Air Waybill:To be submitted by AirlinesHouse Air Waybill:To be submitted by Freight Forwarded or RepresentativesResponse Message:To be handled by the ﬁ ling partyB. MARITIME CARGO DATA MESSAGESCargo Manifest:To be submitted by Master or AgentMaster Waybill:To be submitted by Master or AgentHouse Waybill:To be submitted by Freight Forwarded or RepresentativesResponse Message:To be handled by the ﬁ ling partySchedule - (Cont'd)\f23\n\n L.R.O. 1998PART II - (Cont'd)C. Cargo for Discharge in BarbadosData relating to the ManifestData relating to the Manifest: Voyage number  (A number assigned by local Shipping Agent for ships or the scheduled ﬂ ight number for aircraft)Date and Time of submissionCarrier  (Name of ship)Scheduled Departure Date  (Date of departure of ship or aircraft)Scheduled Arrival Date  (Date of arrival of ship or aircraft)Scheduled Arrival Time  (Time of arrival of ship or aircraft)Place of Departure  (The last foreign port or place of call for ship or aircraft)Destination  (Port or place in the country of destination where the ship or aircraft ﬁ rst reports)Subsequent Place or Port of call within the country (Optional)Agent: Name  Authorised representative of the ship or aircraft, where available)Owner  (Name of owner of ship or aircraft)Schedule - (Cont'd)\f24\n\n L.R.O. 1998PART II - (Cont'd)C. Cargo for Discharge in Barbados - (Concl'd)Data relating to the Manifest - (Concl'd)Transport: Mode  (The manner in which the goods are imported or exported)Transport: Name  (Name of the importing or exporting ship or aircraft)Transport: Nationality  (Nationality of ship or aircraft as determined by its port of registry)Transport: Place (Optional)  (Port of Registry)Registration (Optional)(International registration number including, in respect of ships, the International MaritimeOrganisation registration number or Lloyd's registration number, or, in respect of aircraft, theInternational Air Transport Authority registration number)Master (Optional)  (Name of ship's captain)Total: BillsTotal: PackagesTotal: ContainersTotal: Gross (Optional)Tonnage: Net  (Ship's registered tonnage)Date of last discharge (Optional)  (Date ship last discharged cargo at any port)Schedule - (Cont'd)\f25\n\n L.R.O. 1998PART II - (Cont'd)D. Data relating to Container ManagementContainer: Number  (The BIC identiﬁ cation number of containers)Container: Type  (Type of containers, e.g. 20 feet, refrigerated)Empty/Full Indicator  (Whether full container load or less than container load)Seals  (The number of the security seal(s) afﬁ xed to the container door)Marks(Marks or numbers of the seal(s) afﬁ xed to the container door)Sealing Party  (The authority that afﬁ xed the seal(s) to the containers)Total ContainersTransport Document Reference NumberSchedule - (Cont'd)\f26\n\n L.R.O. 1998PART II - (Cont'd)E. Data relating to individual Bills of Lading or Airway BillsManifest Line Number  (Number indicating the order of bills of lading on a manifest)Transport Document Type  (Type of document issued by ship or aircraft, including airway bills, bills of lading or waybills)Transport Document Reference NumberPurpose of Shipment  (Whether for import, export, in transit or transhipment)Unique Cargo Reference (Optional)Place of loadingPlace of dischargeExporterExporter AddressConsigneeNotify  (Either the consignee or the name and phone number of the representative)Schedule - (Cont'd)\f27\n\n L.R.O. 1998PART II - (Cont'd)E. Data relating to individual Bills of Lading or Airway Bills - (Cont'd)Total ContainersPackages: KindPackages: Marks and NumbersQuantity: PackageQuantity: Gross MassVolume: Cubic Measurement (cbm)Description of Goods  (Pursuant to applicable law)Freight Indicator  (Payment status, whether prepaid or payment on collection)Amount and CurrencyValues:Customs (Optional)Insurance (Optional)Freight (Optional)Additional SealsAdditional InformationSchedule - (Cont'd)\f28\n\n L.R.O. 1998PART II - (Cont'd)ADVANCE CARGO INFORMATION ELECTRONIC MANIFESTMANAGEMENT ASYCUDA CARGO MANIFEST DATA FIELDSNo.Tracking No.123456789DATA FIELDSGeneral InformationOfﬁ ce of departure or arrivalVoyage number or Flight numberDate of departureTime of departureDate of arrivalTime of arrivalPlace of departurePlace of destinationPort of last callDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftCode  of   the   Customs   Departmentﬁ ling of departure or arrivalVoyage  number  or   ﬂ ight  number,which uniquely identiﬁ es thecurrent journey of the means oftransport (the ship or aircraft)Date when the ship or aircraftleaves the place of departureEstimated time when the ship oraircraft departs the place ofdepartureEstimated date when the ship oraircraft arrives at the place ofdestinationEstimated time when the ship oraircraft arrives at the place ofdestinationPlace (LOCODE) where currentvoyage begins on the ship oraircraftPlace (LOCODE) where currentvoyage ends on the ship or aircraftThe place of (LOCODE) wherethe ship or aircraft last reportedbefore docking at the place ofarrival.MANDATORYYESYESYESYESYESYESYESYESYESYESSchedule - (Cont'd)\f29\n\n L.R.O. 1998PART II - (Cont'd)ADVANCE CARGO INFORMATION ELECTRONIC MANIFESTMANAGEMENT ASYCUDA CARGO MANIFEST DATA FIELDS - (Cont'd)No.Tracking No.1011DATA FIELDSGeneral InformationVessel or Aircraft codeAgentDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftShip or aircraft code assigned tothe party undertaking the transportof the goodsCode of the agent in charge ofthe ship or aircraft reportingduring the stay in portMANDATORYYESYESYESSHIPPING INFORMATIONNo.Tracking No.1213141516DATA FIELDSGeneral InformationBillsPackagesVehiclesContainersGross WeightDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftTotal number of waybills onmanifestTotal number of packages onmanifestTotal number of motor vehicleson manifestTotal number of containers onmanifestTotal gross weight contained inthe manifestMANDATORYYESYESYESYESYESYESTOTALSSchedule - (Cont'd)\f30\n\n L.R.O. 1998PART II - (Cont'd)ADVANCE CARGO INFORMATION ELECTRONIC MANIFESTMANAGEMENT ASYCUDA CARGO MANIFEST DATA FIELDS - (Cont'd)No.Tracking No.17181920212223DATA FIELDSGeneral InformationModeNationalityIdentityRegistrationPlaceDateMasterDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftIdentifying the mode of transportFlag or Nationality of means of transportName of ship or aircraftRegistration number of ship or aircraftPort where the ship or aircraft was registeredDate of dischargeName of Master or Commander of the ship or aircraftMANDATORYYESYESYESYESYESNONOYESTRANSPORTSchedule - (Cont'd)\f31\n\n L.R.O. 1998PART II - (Cont'd)ADVANCE CARGO INFORMATION ELECTRONIC MANIFESTMANAGEMENT ASYCUDA CARGO MANIFEST DATA FIELDS - (Cont'd)CO LOADERNo.Tracking No.27DATA FIELDSGeneral InformationCo-loader codeDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftCarrier code of the party sharingthe ship or aircraft when multipleparties involvedMANDATORYYESConditional or OptionalWAYBILL SEGMENT: Bill of lading or Airway BillNo.Tracking No.28DATA FIELDSGeneral InformationOfﬁ ce CodeDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftThe Code of the DepartmentMANDATORYYESNo.Tracking No.242526DATA FIELDSGeneral InformationGross TonnageNet TonnageOfﬁ ce of destinationDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftNet tonnage plus maximumallotted cargo weight per voyageCarrier's base weightOfﬁ ce of destination.  Code ofthe Customs Department ofdestination in case of transitMANDATORYYESYESConditional or OptionalTONNAGESchedule - (Cont'd)\f32\n\n L.R.O. 1998No.Tracking No.293031323334353637DATA FIELDSGeneral InformationWaybill  reference numberWaybill typeNatureWaybill LinePrevious DocumentUCRPlace of loadingPlace of unloadingFAS/LinerDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftThis is the \"Identiﬁ er\" of thetransport document. This is the reference assigned by the carrier oragent (e.g. bill of lading or airwaybill number; it is unique in themanifest)Alphanumeric code for the type oftransport documentCode of the document: export-22,import-23, transit-24, transhipment-28, FROB-26The 'line number' is a sequencenumber used to identify each item-bill of lading or airway billin the manifestReference of the previousdocument (master waybill) whenconsolidated cargoUnique consignment referencenumberPlace (LOCODE) where the goods were orignally loaded onthe ship or aircraftPlace (LOCODE) where the goodswill be ultimately unloaded or discharged from the ship oraircraftTerms of condition for transported goods (accepted values F or L)MANDATORYYESYESYESYESYESConditional or OptionalNOYESYESYESGeneral InformationPART II - (Cont'd)ADVANCE CARGO INFORMATION ELECTRONIC MANIFESTMANAGEMENT ASYCUDA CARGO MANIFEST DATA FIELDS - (Cont'd)Schedule - (Cont'd)\f33\n\n L.R.O. 1998PART II - (Cont'd)ADVANCE CARGO INFORMATION ELECTRONIC MANIFESTMANAGEMENT ASYCUDA CARGO MANIFEST DATA FIELDS - (Cont'd)No.Tracking No.38394041DATA FIELDSGeneral InformationCarrierCarrier NameCarrier AddressShipping agentDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftCarrier code, name and addressof the party undertaking thetransport of the goods.The name of the shipping lineor the airline transporting cargoto and from BarbadosThe address of the shipping lineor the airline transporting cargoto and from BarbadosCode of the shipping agent in charge of the ship managementduring the stay in portMANDATORYYESYESYESYESYESCARRIERNo.Tracking No.424344DATA FIELDSGeneral InformationExporter codeName of ExporterAddress of ExporterDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftExporter codeName of ExporterAddress of ExporterMANDATORYYESNOYESYESEXPORTER OR SHIPPERSchedule - (Cont'd)\f34\n\n L.R.O. 1998PART II - (Cont'd)ADVANCE CARGO INFORMATION ELECTRONIC MANIFESTMANAGEMENT ASYCUDA CARGO MANIFEST DATA FIELDS - (Cont'd)No.Tracking No.4546DATA FIELDSGeneral InformationPlace of loading on currenttransportPlace of discharge fromcurrent transportDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftPlace (LOCODE) where thegoods were loaded on currenttransport (if there was a changeof ship, it would be recorded here)Place (LOCODE) where the goods will be discharged from current transport (if there was further transhipment to be done, it would be recorded here)MANDATORYYESYES or OptionalYES or OptionalTRANSPORTNo.Tracking No.474849DATA FIELDSGeneral InformationNotiﬁ y codeNotify nameNotify addressDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftCode of the notifying partyName of the notifying partyAddress of the notifying partyMANDATORYYESNOYESYESNOTIFYSchedule - (Cont'd)\f35\n\n L.R.O. 1998No.Tracking No.505152DATA FIELDSGeneral InformationConsigneeConsignee nameConsignee addressDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftConsignee code (TIN)Name of the consigneeFull address of the consigneeMANDATORYYESNO or OptionalYESYESCONSIGNEEPART II - (Cont'd)ADVANCE CARGO INFORMATION ELECTRONIC MANIFESTMANAGEMENT ASYCUDA CARGO MANIFEST DATA FIELDS - (Cont'd)No.Tracking No.535455565758DATA FIELDSGeneral InformationTotal containersPackages codesMarks and NdrManifested packagesTotal VehiclesManifested gross weightDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftTotal number of containers for this transport documentKind of packages (packaging typecode)Marks and numbersNumber of packages as indicatedon the waybillTotal number of vehicles for thiswaybillGross weight as indicated on the waybill.  This ﬁ eld must beaccurrately captured as the data are compared to the \"Totals\"information of the generalsegment.MANDATORYYESYESYESYESYESYESYESGOOD DETAILSSchedule - (Cont'd)\f36\n\n L.R.O. 1998PART II - (Cont'd)ADVANCE CARGO INFORMATION ELECTRONIC MANIFESTMANAGEMENT ASYCUDA CARGO MANIFEST DATA FIELDS - (Cont'd)No.Tracking No.59606162636465DATA FIELDSGeneral InformationVolume (CBM)Description of goodsH.S. CodeUNDGPlace of OriginPlace of DestinationLocationDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftVolume of the goods in cubicmetresCommercial description of thegoods from the waybill data (e.g.clothes, machines...)Tariff code for goodsDangerous goods code (UNDG)Place where goods are loadedinto container for shipment (freetext area)Place where goods will beunloaded from container (freetext area)Code of the place where thegoods are located in a shed orcontainer parkMANDATORYYESNO or MandatoryYESNO or OptionalConditionalNO or OptionalNO or OptionalNO or OptionalGOOD DETAILS - (Concl'd)Schedule - (Cont'd)\f37\n\n L.R.O. 1998PART II - (Cont'd)ADVANCE CARGO INFORMATION ELECTRONIC MANIFESTMANAGEMENT ASYCUDA CARGO MANIFEST DATA FIELDS - (Cont'd)No.Tracking No.6667686970717273747576777879DATA FIELDSGeneral InformationValue or freight codeP/CFreight value amountFreight currencyCustoms valueCustoms currencyInsurance valueInsurance currencyTransport valueTransport currencySeal number of sealsMarks of sealsPartyInformationDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftValue or Freight codePrepaid or collect indicator forthe value codeAmount of the value codeCurrency code for the value codeCustoms value of goodsCustoms currency codeInsurance cost of the goodsInsurance currency codeOverall freight costOverall freight currency codeNumber of seals afﬁ xed on non-containerized cargoDescription Marks or referencesnumber of sealsCode of the party having afﬁ xedthe sealsAdditional Information whenrequiredMANDATORYYESYESConditional or MandatoryYESYESYES or OptionalYES or OptionalYESYESYESYESConditional or OptionalConditional or OptionalConditional or OptionalNO or OptionalDECLARED VALUES AND SEAL DETAILSSchedule - (Cont'd)\f38\n\n L.R.O. 1998PART II - (Cont'd)ADVANCE CARGO INFORMATION ELECTRONIC MANIFESTMANAGEMENT ASYCUDA CARGO MANIFEST DATA FIELDS - (Cont'd)No.Tracking No.80818283848586878889909192DATA FIELDSGeneral InformationContainer NumberNumber of packagesContainer TypeE/FSeal NumberSealing PartyEmpty WeightGoods WeightMin. Temp. CEMax. Temp. CEHumidityDangerous CodeH.S. CodeDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftContainer number(s) for container(s) relating to waybillNumber of packages in containerContainer size-typeEmpty or Full indicatorQuantity of seals afﬁ xed and sealnumbers (3 ﬁ elds)Party afﬁ xing the sealsEmpty weight of container (KG)Weight of goods in container (KG)Minimum temperature in celsiusfor refrigerated containersMaximum temperature in celsiusfor refrigerated containersTemperature in celsius that thegoods should be storedUNDG code for dangerous goodsTariff Code for goods in containerMANDATORYYESYESYESYESYESYES or OptionalYES or OptionalYES or OptionalYESConditional or OptionalConditional or OptionalConditional or OptionalConditional or OptionalNo or OptionalCONTAINER SEGMENTSchedule - (Cont'd)\f39\n\n L.R.O. 1998PART II - (Cont'd)ADVANCE CARGO INFORMATION ELECTRONIC MANIFESTMANAGEMENT ASYCUDA CARGO MANIFEST DATA FIELDS - (Concl'd)No.Tracking No.93949596DATA FIELDSGeneral InformationGoods DescriptionContainer DispositionVolumeContainer line codeDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftDescription of goods in container(Cargo disposition, acceptedvalues \"CY. CFS and P. UN-STUFF). Required only whenBL nature 23 and container isnot emptyVolume of cargo per containerCode identifying shippingcontainer ownerMANDATORYYESYESConditionalYESYESCONTAINER SEGMENT - (Concl'd)No.Tracking No.979899100101102103104DATA FIELDSGeneral InformationChassis NumberEngine NumberEngine SizeOdometer ReadingMake or BrandYearColourNew or UsedDESCRIPTIONGeneral details with respect tovoyage and Ship or AircraftChassis number of vehicleEngine number of vehicleEngine (cc) or (kw)Mileage of vehicleMake and brand of vehicleYear of manufactureColour of vehicleIf vehicle new or usedMANDATORYYESYESYES or OptionalYESYES or OptionalYESYESYES or OptionalYES or OptionalVEHICLE SEGMENTSchedule - (Cont'd)\f40\n\n L.R.O. 1998PART II - (Concl'd)DATA SUBMISSION TIMEFRAME 1. The information set out in the Advance Cargo Information System Data Fields(a) for incoming cargo by aircraft(i) in the case of a short haul ﬂ ight, at time of departure of aircraft;(ii) in the case of a long haul ﬂ ight, 4 hours prior to arrival at the ﬁ rst port in the country of destination;(b) for outgoing cargo on short and long haul ﬂ ights, at the time of departure of the aircraft;(c) for incoming cargo by ship;(i) containerized cargo: 24 hours before arrival at ﬁ rst port in the country of destination;(ii) bulk or break bulk: 24 hours before arrival at ﬁ rst port in the country of destination;(d) for outgoing cargo by ship;(i) containerized cargo: 24 hours before loading at port of departure;(ii) bulk or break bulk: 24 hours before departure to the ﬁ rst port in the country of destination.PART III(Section 34(4)(e))2. Cargo not intended for discharge within BarbadosAll dangerous or hazardous goods, explosives, ﬁ rearms and ammunition, prohibited or restricteditems not destined for Barbados must be listed separately in the following format: Description Quantity in Kilos Country of Destination\".Schedule - (Cont'd)"
}