{
  "bill_id": 411,
  "slug": "tourism-levy-bill-2019-2019",
  "title": "Tourism Levy Bill, 2019, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/69edac78e36ad3d1ec039cbaecc9075e.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-07-17",
  "first_reading": "2019-07-17",
  "gazette_date": "2019-07-29",
  "markdown": "2019-12-11\n\nOBJECTS AND REASONS\n\nThis Bill would provide for\n\n(a)\n\na  room  rate  levy  to  be  charged  on  the  provision  of  tourist\naccommodation;\n\n(b)\n\na product development levy to be charged on a direct tourism service;\n\n(c)\n\n(d)\n\na  shared  economy  levy  to  be  charged  on  the  provision  of  tourist\naccommodation owned or operated by persons who earn income from\nthe tourism sector in Barbados, but who are either not registered or\ngiven exempt status under the Value Added Tax Act, Cap. 87;\n\nthe validation of the imposition and collection of the room rate levy,\nproduct  development  levy  and  shared  economy  levy  from  the\nimposition of each levy until the commencement of this Act; and\n\n(e)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nApplication and Administration\n\nRegistration and listing of tourist accommodation\n\nImposition of room rate levy\n\nNotification of room rate levy\n\nImposition of product development levy\n\nNotification of product development levy\n\nImposition of shared economy levy\n\n10.\n\nNotification of shared economy levy\n\n11.\n\nPayment of levies\n\n12.\n\nConsolidated fund\n\n13.\n\nRefund for overpayment\n\n14.\n\nWaivers and refunds\n\n15.\n\nKeeping of accounts and records\n\n\f3\n\n16.\n\nAudit\n\n17.\n\nCopies of documents\n\n18.\n\nNotice of assessment of levy\n\n19.\n\nNotice of assessment result\n\n20.\n\nObjections\n\n21.\n\nAppeal to Tribunal\n\n22.\n\nAppeal to the High Court\n\n23.\n\nRecovery of the levy\n\n24.\n\nObstruction of officers\n\n25.\n\nValidation\n\n26.\n\nAmendment of enactments in the Fifth Schedule and Sixth Schedule\n\n27.\n\nCommencement\n\n\f4\n\nFIRST SCHEDULE\n\nClassification of Hotels\n\nSECOND SCHEDULE\n\nRate of Room Levy\n\nTHIRD SCHEDULE\n\nProduct Development Levy\n\nFOURTH SCHEDULE\n\nShared Economy Levy\n\nFIFTH SCHEDULE\n\nEnactments to be Amended\n\nSIXTH SCHEDULE\n\nAmendment of the Value Added Tax Act, Cap. 87\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for\n\n(a)\n\na  room  rate  levy  to  be  charged  on  the  provision  of  tourist\naccommodation;\n\n(b)\n\na product development levy to be charged on a direct tourism service;\n\n(c)\n\na  shared  economy  levy  to  be  charged  on  the  provision  of  tourist\naccommodation owned or operated by persons who earn income from\n\n\f6\n\nthe tourism sector in Barbados, but who are either not registered or\ngiven exempt status under the Value Added Tax Act, Cap. 87;\n\n(d)\n\nthe validation of the imposition and collection of the room rate levy,\nproduct  development  levy  and  shared  economy  levy  from  the\nimposition of the levy until the commencement of this Act; and\n\n(e)\n\nrelated matters.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Tourism Levy Act, 2019.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“ “A” class hotel” means a hotel with extensive facilities, furnishings and décor\ndesigned to provide a high level of comfort, rest and relaxation, which offers\na higher standard of amenities and services than a “B” class hotel, with at\nleast the minimum requirements as specified in the First Schedule;\n\n“apartment” means a complete unit which provides short-term accommodation\nto guests for reward, having either one or more studio bedrooms or separate\nbedrooms, a living room, a kitchen or kitchenette, a dining area, where\n\n(a)\n\n(b)\n\n(c)\n\nat least one bathroom in the unit is for the exclusive use of the occupant\nof the unit;\n\nthe occupants of the unit share the grounds, other recreational facilities\nand other common buildings with the occupants of other units; and\n\nthe unit is within a building or group of buildings owned by a single\nowner without a separate legal title per unit;\n\n“accommodation  period”  means  the  time  to  be  spent  in  the  tourist\n\naccommodation;\n\n\f7\n\n“ “B” class hotel” means a hotel with modest facilities, furnishings and décor,\nwhich  offers  basic  amenities  and  services  with  at  least  the  minimum\nrequirements as specified in the First Schedule;\n\n“Barbados  Revenue  Appeals  Tribunal”  or  “Tribunal”  means  the  tribunal\nestablished  by  section  24  of  the  Barbados  Revenue  Authority  Act,  2014\n(Act 2014-1);\n\n“Barbados  Revenue  Authority”  or  “Authority”  means  the  Barbados  Revenue\nAuthority established under section 3 of the Barbados Revenue Authority\nAct, 2014 (Act 2014-1);\n\n“ Barbados Tourism Product Authority” means the Authority established under\nsection  3  of  the  Barbados  Tourism  Product  Authority  Act,  2014\n(Act 2014-2);\n\n“direct tourism service”” means the provision of goods and services by a person\n\nwho\n\n(a)\n\n(b)\n\nhas a licence from the Barbados Tourism Product Authority; and\n\nis also registered or licensed by any of the following:\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\nBarbados Hotel and Tourism Association Inc.;\n\nSmall Hotels of Barbados Inc.;\n\nCultural Industries Development Authority;\n\nMinistry of Creative Economy, Culture and Sports;\n\nMinistry of Health and Wellness;\n\n(vi)\n\nTown and Country Planning Office;\n\n(vii)\n\nMinistry of Maritime Affairs and the Blue Economy;\n\n(viii)\n\nMinistry of Tourism and International Transport; or\n\n(ix)\n\nanother  entity  or  organization  which  is  approved  by  the\nBarbados Tourism Productivity Authority;\n\n\f8\n\n“goods and services” means any of the following goods or services\n\n(a)\n\nentertainment,  other  than  entertainment  supplied  by  a  promoter  of\npublic  entertainment,\ntheatrical  performances,  film,\nexhibitions, dinner shows and other performances;\n\nincluding\n\n(b)\n\ncruises other than international cruises;\n\n(c)\n\ngoods and services related to sport and recreation;\n\n(d)\n\ngoods and services provided at marinas;\n\n(e)\n\ngoods and services provided at spas and retreats;\n\n(f)\n\ngoods and services provided at conference facilities; or\n\n(g)\n\nmeals, drinks and dining services;\n\n“guest” means a visitor to Barbados or a citizens of Barbados;\n\n“guest house” means any premises in which\n\n(a)\n\n(b)\n\n(c)\n\nsleeping accommodation is provided in 3 or more bedrooms;\n\na charge is made for the accommodation provided; and\n\nmeals are served to residents;\n\n“hotel” means\n\n(a)\n\n(b)\n\nany building containing not less than 10 bedrooms each of which is\nvalued at not less than $175 000; or\n\nany  group  of  buildings,  whether  cottages,  bungalows  or  otherwise,\nsituate within the same precincts, served by a common maid service\nand together containing not less than 10 bedrooms each of which is\nvalued at not less than $175 000,\n\nwhich is available for the accommodation of guests for reward at anytime\nin a calender year;\n\n“levy” means the room rate levy, product development levy or shared economy\n\nlevy;\n\n\f9\n\n“Luxury class hotel” means an upscale hotel with superior facilities, furnishings\nand  décor  designed  to  provide  an  exceptional  level  of  comfort,  rest  and\nrelaxation,  at  a  higher  standard  than  an  “A”  class  hotel  with  at  least  the\nminimum requirements as specified in the First Schedule;\n\n“officer” means a person who is employed by the Authority and authorised or\nassigned to assist the Authority in the administration and enforcement of\nthis Act;\n\n“payment  period”  means  the  taxable  period  specified  under  section  44  of  the\nValue Added Tax Act, Cap. 87 or such other period as may be specified by\nthe Authority;\n\n“product development levy” means the levy charged in accordance with section\n\n7;\n\n“Revenue Commissioner” means the Revenue Commissioner appointed under\nsection 7 of the Barbados Revenue Authority Act, 2014 (Act 2014-1);\n\n“room rate levy” means the levy charged in accordance with section 5;\n\n“shared economy levy” means a levy charged in accordance with section 9;\n\n“tourist accommodation ” means an apartment, hotel, guest house, and vacation\n\nrental property which is\n\n(a)\n\n(b)\n\nregistered with the Barbados Tourism Product Authority; and\n\nis rented by guests for reward\n\n(i)\n\nsystematically or periodically in a calendar year; or\n\n(ii)\n\nfor a specified period in a calender year;\n\n“vacation rental property” means any property, including a dwelling house or\nhouse, but not a guest house, hotel or apartment, which is registered with\nthe  Barbados  Tourism  Product  Authority,  that  is  systematically  or\nperiodically rented by guests during a calendar year, and in which\n\n(a)\n\na charge is made for the accommodation provided;\n\n\f10\n\n(b)\n\nsleeping accommodation is provided in one or more bedrooms;\n\n(c)\n\n(d)\n\nthe grounds and any common areas or recreational facilities are for the\nuse of the occupants of a single booking; and\n\nthe property is managed by an individual, a company or a real estate\nagent.\n\nApplication and Administration\n\n3.(1)\n\nThis Act shall apply to a person who\n\n(a)\n\n(b)\n\nprovides or supplies any tourist accommodation; or\n\nprovides or supplies a direct tourism service to a visitor or a citizen of\nBarbados.\n\nthe\nThe  Barbados  Revenue  Authority  shall  be  responsible  for\n(2)\nadministration of this Act, and for the assessment, collection and recovery of the\nroom rate levy, product development levy and shared economy levy.\n\nRegistration and listing of tourist accommodation\n\n4.(1)\n\nAny person who provides\n\n(a)\n\n(b)\n\ntourist  accommodation  shall  register  with  the  Barbados  Tourism\nProduct Authority; or\n\na  direct  tourism  service  shall  register  with  the  Barbados  Revenue\nAuthority.\n\nThe  Barbados  Tourism  Product  Authority  shall  submit  to  the  Revenue\n(2)\nCommissioner before the 1st day of July, 2018 a list of persons who own or operate\ntourist accommodation and shall thereafter submit an updated list of such persons\nevery month .\n\nThe Barbados Tourism Product Authority shall ensure that the list prepared\n(3)\nfor the purposes of subsection (2) classifies each hotel listed as either a “B” class\nhotel,  an  “A”  class  hotel  or  a  luxury  class  hotel  in  accordance  with  the  First\nSchedule.\n\n\f11\n\nImposition of room rate levy\n\n5.(1)\naccommodation in the manner specified in the Second Schedule.\n\nA  room  rate  levy  shall  be  imposed  on  the  rental  of  tourist\n\n(2)\nA person who provides tourist accommodation shall charge the room rate\nlevy on the tourist accommodation provided by that person to a visitor or a citizen\nof Barbados in the manner specified in the Second Schedule.\n\nIn  circumstances  where  the  tourist  accommodation  is  paid  for  online\n(3)\nthrough the internet the person providing that tourist accommodation online shall\ncharge the room rate levy on that tourist accommodation and where provision is\nnot made for the collection or payment of the room rate levy online it shall be\ncollected by the person providing the tourist accommodation by the end of the\naccommodation period.\n\nFrom the 1st day of April, 2019 the room rate levy shall not be applied to\n\n(4)\na vacation rental property.\n\nA  person  who  receives  payment  of  the  room  rate  levy  pursuant  to\n(5)\nsubsection (2) and who fails to submit the sums collected to the Authority is guilty\nof an offence and is liable on summary conviction to a fine of $10 000.\n\nNotification of room rate levy\n\n6.(1)\nA person who provides tourist accommodation a for reward to a visitor\nor a citizen of Barbados and who advertises that tourist accommodation online\nor otherwise shall ensure that any such advertisement includes a notification of\nthe requirement to pay the room rate levy.\n\nA person who provides for the booking and purchase of any stay at a tourist\n(2)\naccommodation, offered by a person online shall ensure that any person who\nseeks to make a payment online to use the tourist accommodation is notified of\nthe room rate levy, where the room rate levy is\n\n(a)\n\nincluded in the sums which will be collected when the online payment\nis made; or\n\n\f12\n\n(b)\n\nnot included with the online payment, that it will be collected when the\nperson comes to use the tourist accommodation for the accommodation\nperiod.\n\nA person who contravenes subsection (1) or subsection (2) is guilty of an\n\n(3)\noffence and is liable on summary conviction to a fine of $5 000.\n\nImposition of product development levy\n\n7.(1)\ndirect tourism service in the manner specified in the Third Schedule.\n\nA product development levy shall be imposed on the provision of a\n\n(2)\n\nA person who\n\n(a)\n\nis  registered  or  not  registered  under  the  Value  Added  Tax  Act,\nCap. 87; and\n\n(b)\n\nprovides a direct tourism service\n\nshall charge the product development levy on the provision of the direct tourism\nservice to a visitor or a citizen of Barbados in the manner specified in the Third\nSchedule.\n\nIn circumstances where the direct tourism service is paid for online through\n(3)\nthe internet the person providing that direct tourism service online shall charge\nthe product development levy on that direct tourism service and where provision\nis not made for the collection or payment of that product development levy online\nit shall be collected from the visitor or the citizen of Barbados at the time that the\ndirect tourism service is used by the visitor or citizen of Barbados.\n\nA person who receives payment of the product development levy pursuant\n(4)\nto subsection (1) and who fails to submit the sums collected to the Authority is\nguilty of an offence and is liable on summary conviction to a fine of $10 000.\n\nNotification of product development levy\n\n8.(1)\nA person who provides a direct tourism service and who advertises\nthat  direct  tourism  service  online  or  otherwise  shall  ensure  that  any  such\n\n\f13\n\nadvertisement  includes  a  notification  of  the  requirement  to  pay  the  product\ndevelopment levy.\n\nA person who provides for the booking and purchase of any direct tourism\n(2)\nservice offered by that person online shall ensure that any person who seeks to\nmake  payment  to  use  a  direct  tourism  service  is  notified  of  the  product\ndevelopment levy, where the product development levy is\n\n(a)\n\n(b)\n\nincluded in the sums which will be collected when the online payment\nis made; or\n\nnot included with the online payment, that it will be collected when the\nperson comes to use the direct tourism service.\n\nA person who contravenes subsection (1) or subsection (2) is guilty of an\n\n(3)\noffence and is liable on summary conviction to a fine of $5 000.\n\nImposition of shared economy levy\n\n9.(1)\n\nA person who\n\n(a)\n\nis not registered under the Value Added Tax Act, Cap. 87 or who is\nexempt pursuant to section 10 of the Value Added Tax Act, Cap. 87 and\nspecified as such in the Second Schedule to that Act;\n\n(b)\n\nsupplies tourist accommodation; and\n\n(c)\n\nis registered with the Barbados Tourism Product Authority\n\nshall be required to charge a shared economy levy on the supply of that tourist\naccommodation.\n\nThe shared economy levy, required by subsection (1), shall be imposed on\n\n(2)\ntourist accommodation in the manner specified in the Fourth Schedule.\n\nIn  circumstances  where  the  tourist  accommodation  is  paid  for  online\n(3)\nthrough the internet the person providing that tourist accommodation online shall\ncharge  the  shared  economy  levy  on  that  tourist  accommodation  and  where\nprovision is not made for the collection or payment of that shared economy levy\n\n\f14\n\nonline it shall be collected from the visitor or the citizen of Barbados by the end\nof the accommodation period.\n\nFrom the 1st day of April, 2019 the shared economy levy shall be applied\n\n(4)\nto a vacation rental property.\n\nA person who receives payment of the shared economy levy pursuant to\n(5)\nsubsections (1) and (2) and who fails to submit the sums collected to the Authority\nis guilty of an offence and is liable on summary conviction to a fine of $10 000.\n\nNotification of shared economy levy\n\nA  person  who  provides  tourist  accommodation  to  which  section  9\n10.(1)\napplies and who advertises that tourist accommodation online or otherwise shall\nensure that any such advertisement includes a notification of the requirement to\npay the shared economy levy.\n\nA  person  who  provides  for  the  booking  and  purchase  of  any  tourist\n(2)\naccommodation offered by a person online shall ensure that any person who seeks\nto make a payment online to use that tourist accommodation is notified of the\nshared economy levy, where the shared economy levy is\n\n(a)\n\n(b)\n\nincluded in the sums which will be collected when the online payment\nis made; or\n\nnot included with the online payment, that it will be collected when the\nperson comes to use the tourist accommodation for the accommodation\nperiod.\n\nA person who contravenes subsection (1) or subsection (2) is guilty of an\n\n(3)\noffence and is liable on summary conviction to a fine of $5 000.\n\nPayment of levies\n\nThe Revenue Commissioner shall notify a person who provides tourist\n11.(1)\naccommodation or a direct tourism service, to a visitor or citizen of Barbados of\nhis payment period and where that person is also registered under the Value Added\n\n\f15\n\nTax Act, Cap. 87, the payment period shall be the same as the taxable period of\nthat person.\n\nA person, referred to in subsection (1), shall within 21 days after the end\n\n(2)\nof each payment period,\n\n(a)\n\nfile with the Barbados Revenue Authority, in such a form or manner\nas the Revenue Commissioner determines and notifies by an instrument\nin writing\n\n(i)\n\n(ii)\n\na return for the payment period;\n\na statement of the number of rentals or services which occurred\nin  the  period,  and  the  revenue  obtained  from  the  rentals  or\nservices; and\n\n(iii)\n\nsuch  additional  information  as  the  Revenue  Commissioner\nrequires; and\n\n(b)\n\npay to the Barbados Revenue Authority the levy payable by that person\nfor the payment period.\n\nA  person  who  files  a  return  after  the  payment  period  referred  to  in\n(3)\nsubsection (2) shall pay a penalty of $100 to the Barbados Revenue Authority.\n\nA person who fails to pay the amount of the levy payable by that person\n\n(4)\nwithin one month of the period referred to in subsection (2) shall pay\n\n(a)\n\n(b)\n\na penalty of 10 per cent of the amount of the levy that is payable; and\n\nsimple interest at the rate of one per cent per month calculated for each\nmonth or part of a month during which any amount of the levy and\npenalty remains unpaid.\n\nConsolidated fund\n\n12.\nthe Consolidated Fund.\n\nAll monies collected as a levy pursuant to this Act shall be paid into\n\n\f16\n\nRefund for overpayment\n\n13.(1)\nIn circumstances where a person has paid an amount as a levy and that\namount exceeds the amount that was payable by that person under this Act, the\nRevenue Commissioner shall refund to that person the sum which is equal to the\namount of the excess, where that person applies for a refund within 2 years after\nthe amount was paid.\n\nThe  refund  payable  under  subsection  (1)  shall  be  paid  from  the\n\n(2)\nConsolidated Fund.\n\nWaivers and refunds\n\nThe  Minister  may  by  order,  where  he  thinks  it  equitable  to  do  so,\n14.\nwaive,  exempt,  remit  or  refund,  in  whole  or  in  part,  the  amount  of  any  levy\npayable or paid by any person under this Act.\n\nKeeping of accounts and records\n\n15.(1)\nA  person  who  provides  tourist  accommodation  or  a  direct  tourism\nservice shall keep records, information and accounts so as to enable the Revenue\nCommissioner  to  determine  the  amount  of  the  levy  which  is  payable  by  that\nperson for any payment period.\n\nWhere  a  person  fails  to  keep  records,  information  and  accounts  for  the\n(2)\npurposes of this Act, the Revenue Commissioner may require that person to keep\nsuch records, information and accounts as the Authority determines.\n\nA person shall retain the records, information and accounts referred to in\n(3)\nsubsections (1) and (2) until the expiration of 5 years after the end of the year to\nwhich the records, information and accounts relate or for such shorter period as\nthe Revenue Commissioner may determine.\n\nA person who fails to keep records, information and accounts in accordance\n(4)\nwith this section is guilty of an offence and is liable on summary conviction to a\nfine of $5 000.\n\n\f17\n\nAudit\n\n16.(1)\nAn officer may at any reasonable time audit or examine the records\nof a person who provides tourist accommodation or a direct tourism service for\nthe purposes of assessing\n\n(a)\n\n(b)\n\n(c)\n\nthe amount paid by that person as a levy;\n\nany amount to be refunded to that person; or\n\nwhether  the  records  of  the  tourist  accommodation  or  direct  tourism\nservice  are  being  kept  in  the  manner  required  by  the  Revenue\nCommissioner pursuant to section 15.\n\nFor the purposes of subsection (1), an officer may, at any reasonable time,\n\n(2)\nenter any premises or place to which this Act applies and\n\n(a)\n\ninspect or examine the records, information and books of account kept\nby a person who provides tourist accommodation or a direct tourism\nservice, or any employee or agent of that person any other document,\nitem or matter that may be relevant in determining\n\n(i)\n\nthe amount of the levy or other amounts payable or remittable\nunder this Act or any other obligation under this Act; or\n\n(iii)\n\nthe amount of a refund due to the owner under this Act;\n\n(b)\n\nrequire  the  person  who  provides  tourist  accommodation  or  a  direct\ntourism service or any employee or agent of that person to give him all\nreasonable assistance with his inspection, audit or examination and to\nanswer all questions relating to the person responsible for the payment\nof the levy under this Act either orally or in writing.\n\nWhere,  during  the  course  of  an  audit  or  examination  referred  to  in\n(3)\nsubsection (1), it appears to the officer referred to in that subsection that there\nhas been a violation of this Act, the officer may seize and take away any records,\ninformation or books of account which may afford evidence of the violation.\n\n\f18\n\n(4)\nThe  Revenue  Commissioner  may,  for  any  purpose  related  to  the\nadministration  of  this  Act,  by  registered  letter  or  by  an  instrument  in  writing\nserved personally, require any person\n\n(a)\n\n(b)\n\nto provide any information in the form of a return or otherwise; and\n\nto produce any record, information or books of account, within such\ntime as the Revenue Commissioner specifies.\n\nCopies of documents\n\nWhere  any  document,  information  or  book  of  account  has  been\n17.\nproduced, seized, inspected or examined by an officer under this Act, the officer\nmay make copies and a document purporting to be certified by the officer to be\na copy made pursuant to this section is admissible in evidence and has the same\nprobative value as the original document.\n\nNotice of assessment of levy\n\n18.\n\nIn circumstances where,\n\n(a)\n\na person has failed to submit the sums collected  in accordance with\nsections 5, 7 or 9;\n\n(b)\n\na person has failed to file a return in accordance with section 11; or\n\n(c)\n\nthe Revenue Commissioner is satisfied that a true account of the levy\npayable has not been given in a return\n\nthe Revenue Commissioner shall notify the person by an instrument in writing\nthat an assessment will be done, and that instrument in writing shall state what\nis  being  assessed,  the  reason  for  the  assessment,  detail  when  and  how  the\nassessment will be done, and invite the person to submit in writing by a stated\ndate any representation or information which the person has which can explain\nthe concern raised by the Revenue Commissioner.\n\n\f19\n\nNotice of assessment result\n\nThe  Revenue  Commissioner  shall  notify  the  person  referred  to  in\n19.\nsection 18, by an instrument in writing, of the result of the assessment, and state\nwhat action the person is required to take and by what date.\n\nObjections\n\n20.(1)\n\nSubject to this section, a person who\n\n(a)\n\n(b)\n\nhaving been assessed, disagrees with the assessment; or\n\nhaving made an application for a refund of the levy, disagrees with the\nRevenue Commissioner's determination respecting the application\n\nmay object to the assessment or determination by filing an instrument in writing\nwith the Revenue Commissioner within 21 days after the date of the notice of\nassessment or notice of determination, as the case may be, or such longer period\nas the Revenue Commissioner allows.\n\nA notice of objection shall be in writing and shall state the precise grounds\n\n(2)\nfor the objection.\n\nThe Revenue Commissioner shall give a person who has objected to an\n(3)\nassessment or determination an opportunity to support his objection by a written\nor oral submission to the Revenue Commissioner.\n\nThe Revenue Commissioner shall, after receiving a notice of objection in\n(4)\nrespect  of  an  assessment  or  determination  and  after  giving  the  person  who\nobjected an opportunity to support his objection,\n\n(a)\n\n(b)\n\nreview the assessment or determination and either confirm it or make\na reassessment or redetermination, as the case may require; and\n\ndeliver to the person who objected, a notice of confirmation, a notice\nof reassessment or a notice of redetermination, as the case may require.\n\nWhere  a  person  has  filed  a  notice  of  objection  under  this  Act  and  the\n(5)\nRevenue  Commissioner  has  not,  within  6  months  thereafter,  delivered  to  the\n\n\f20\n\nperson  a  notice  of  confirmation,  reassessment  or  redetermination,  that  person\nmay appeal to the Tribunal in respect of the objection.\n\nWhere  the  Revenue  Commissioner  delivers  to  a  person,  a  notice  of\n(6)\nconfirmation, reassessment or redetermination respecting an objection after the\nexpiration of the period of 6 months referred to in subsection (5), the person may\nappeal to the Tribunal within 30 days after the delivery of the notice.\n\nAppeal to Tribunal\n\nA  person  who  objects  to  an  assessment  or  determination  and  who\n21.(1)\nreceives a notice of confirmation, reassessment or redetermination, may appeal\nthe decision of the Revenue Commissioner to the Barbados Revenue Appeals\nTribunal,  within  30  days  after  the  day  on  which  the  notice  of  confirmation,\nreassessment or redetermination, as the case may be, was delivered to him.\n\nAn appeal under this section shall be instituted by filing a notice of appeal\n(2)\nwith the Tribunal together with such copies thereof as the Tribunal may require,\nand such notice shall, as far as possible, state the precise grounds of appeal.\n\nWhere the Tribunal is satisfied that there is good reason for the failure of\n(3)\na  person  to  object  or  appeal  within  the  time  specified  in  subsection  (1)  the\nTribunal may allow the person objecting such further time as the Tribunal thinks\nfit.\n\nAppeal to the High Court\n\n22.(1)\nof the Tribunal to the High Court on a point of law.\n\nAny party to an appeal to the Tribunal may appeal from the decision\n\nIn disposing of an appeal under this section in respect of an assessment or\n\n(2)\ndetermination, the High Court may\n\n(a)\n\n(b)\n\nconfirm or set aside the assessment or determination;\n\nmake an order referring the assessment or determination back to the\nRevenue  Commissioner  for  reassessment  or  redetermination  in\naccordance with the directions of the Court; or\n\n\f21\n\n(c)\n\nmake such other order as it thinks fit.\n\nRecovery of the levy\n\n23.\nAny  levy  payable  under  this  Act  and  any  other  amount  payable  as\npenalty and interest is a debt due to the Crown and is recoverable as such in civil\nproceedings in the magistrate’s court, notwithstanding that the amount involved\nexceeds the normal monetary limit on the jurisdiction of a magistrate’s court.\n\nObstruction of officers\n\nA person who threatens, assaults or obstructs an officer acting in the\n24.\nexecution  of  his  duty  under  this  Act  is  guilty  of  an  offence  and  is  liable  on\nsummary conviction to a fine of $10 000 or to imprisonment for 2 years or to\nboth.\n\nValidation\n\nAll decisions made, all acts done and all levies paid to and collected\n25.(1)\nby  the  Barbados  Revenue  Authority  from  the  1st  day  of  July,  2018  until  the\ncommencement of this Act shall be deemed to have been lawfully and validly\nmade, done, paid, and collected.\n\nSubsection (1) shall not prohibit the Barbados Revenue Authority or the\n(2)\nMinister from taking any action as may be required pursuant to section 13 or\nsection 14.\n\nAmendment of enactments in the Fifth Schedule and Sixth Schedule\n\n26.(1)\namended in the manner specified in the second column thereof.\n\nThe enactments specified in the first column of the Fifth Schedule are\n\nThe  enactment  specified  in  the  first  column  of  the  Sixth  Schedule  is\n\n(2)\namended in the manner specified in the second column thereof.\n\n\f22\n\nCommencement\n\n27.(1)\nSections  1  to  8,  11  to  24,  section  25,  section  26  and  the  First\nSchedule, the second column of the Second Schedule and the Third Schedule of\nthis Act shall be deemed to have come into effect on the 1st day of July, 2018.\n\nSection 9, section 10 and the Fourth Schedule shall be deemed to have\n\n(2)\ncome into effect on the 1st day of August, 2018.\n\nThe amendments in PART I of the Fifth Schedule  shall be deemed to come\n(3)\ninto effect on the 1st day of July, 2018.and the amendment in PART II shall be\ndeemed to come into effect on the 1 th day of April, 2019.\n\nThe third column of the Second Schedule shall be deemed to come into\n\n(4)\neffect on the 1st day of April, 2019.\n\nThe amendment specified in the Sixth Schedule shall take effect 1st day of\n\n(5)\nJanuary, 2020.\n\n\f23\n\nFIRST SCHEDULE\n\nClassification of Hotels\n\n(Section 2, 4 and 27(1))\n\nCategory of Hotel\n\nMinimum requirement for this Category of\nHotel\n\nLuxury Hotel\n\n1. 24 hour reception facility .\n\n2. Property is clean and is maintained- rooms\nand varied hotel areas are identified by signage.\n\n3. The structure and features, furniture, fittings\nof the hotel’s exterior are aesthetically\nappealing and of a high standard, and are\ndesigned to give a greater or higher level of\ncomfort, and relaxation.\n\n4. En-suite bathrooms in each room with a daily\nsupply of high quality absorbent towels and\nhigh quality toiletries (hot tub or jacuzzi in en-\nsuite master bathrooms).\n\n5. Complimentary wireless internet access in\nall public areas and guest rooms.\n\n6. Multiple restaurants with table d'hôte and à\nla carte menus with extensive food choices,\neach with a hostess to greet and seat guests upon\narrival- three course meals available (with\nhealthy, vegan and vegetarian options).\n\n7. Continental breakfast and cooked breakfast\nwith options.\n\n8. 24-hour full room service with meals served\non decorated dining tables.\n\n9. Multiple bars with cocktails available-\nextensive wine menus in the restaurants.\n\n\f24\n\n10. Housekeeping services offered daily.\n\n11. Iron and iron board in all guest rooms.\n\n12. Air-conditioned rooms or rooms with\nfan(s).\n\n13. Welcome beverage and canapes and\ncomplimentary pack as a part of the arrival\npackage.\n\n14. Business centre available.\n\n15. Provision of do not disturb sign.\n\n16. Staff fluent in a foreign language(s).\n\n17. Porter services offered.\n\n18. Spacious fitness facilities and spa available\nas well as beauty and hair salon.\n\n19. Convenience store and multiple shops\noffering male and female duty-free clothing,\njewellery and personal amenities for sale.\n\n20. International in-room direct dial phones.\n\n21. Complimentary airport/ seaport transport\nservice using luxury vehicles available on\nrequest.\n\n22. Butler service should at least be available\nto some rooms on request.\n\n23. Rooms offer spacious accommodation\nfacilities with turndown service with\naccompaniments.\n\n24. Room furnishings, fittings and fixtures\nprovide excessive comfort, rest and relaxation.\n\n25. Excellent sound proofing in rooms.\n\n26. Provide safety deposit facilities in the room.\n\n27. Provide manned security services on site.\n\n\f25\n\n28. Requisite licences and certificates from the\nMinistry of Health.\n\n29. Fire Certificate from the Barbados Fire\nService.\n\n30. Tax clearance certificates from the\nBarbados Revenue Authority and the National\nInsurance Department.\n\n“A” Class Hotel\n\n1. 24 hour reception facility.\n\n2. Property is clean and is maintained- rooms\nand varied hotel areas are identified by signage.\n\n3. Furniture, fixtures, fittings and general décor\nare designed to give a great or high level of\ncomfort, and relaxation — may have some\nsound proofing.\n\n4. En-suite bathrooms in each room with daily\nsupply of clean towels and toiletries.\n\n5. Complimentary wireless internet access in\nguest rooms and in at least two public areas.\n\n6. Restaurant serving at least 3 meal options\nwith table d’hôte and à la carte menus ( with\nhealthy, vegan and vegetarian options).\nRestaurant has a hostess to greet and seat guests\nupon arrival.\n\n7. Continental breakfast and cooked breakfast\nwith options.\n\n8. Minimum room service with hot or cold\ndrinks with sandwiches or light snacks.\n\n9. Housekeeping offered daily.\n\n10. Iron and iron board in all guest rooms.\n\n11. Air-conditioned rooms or rooms with\nfan(s).\n\n\f26\n\n12. Welcome beverage and complimentary\npack as part of arrival package.\n\n13. Business centre available.\n\n14. Provision of do not disturb sign.\n\n15. Staff fluent in a foreign language.\n\n16. Porter services offered.\n\n17. Fitness facilities available.\n\n18. A dedicated sundry area or shop.\n\n19. International in-room direct dial phones.\n\n20. Provide safety deposit facilities in the room.\n\n21. Provide manned security services on site.\n\n22. Requisite licences and certificates from the\nMinistry of Health.\n\n23. Fire Certificate from the Barbados Fire\nService.\n\n24. Tax clearance certificates from the\nBarbados Revenue Authority and the National\nInsurance Department.\n\n“B” Class Hotel\n\n1. Staffed reception facilities.\n\n2. The property is clean and is maintained-\nrooms and varied hotel areas are identified by\nsignage.\n\n3. Furnishings, fittings and fixtures are such to\nprovide basic comfort in rooms.\n\n4. En-suite bathrooms in each room with daily\nsupply of clean towels and toiletries.\n\n5. Complimentary internet access in at least one\npublic area.\n\n\f27\n\n6. A restaurant serving at least 3 meal options\nwith legible table d'hôte or à la carte menus.\n\n7. At least continental or cooked breakfast\nprovided.\n\n8. Housekeeping offered daily.\n\n9. Iron and iron board.\n\n10. Air-conditioned rooms or rooms with\nfan(s).\n\n11. Provide safety deposit facilities.\n\n12. Provide security services on site.\n\n13. Requisite licences and certificates from the\nMinistry of Health.\n\n14. Fire Certificate from the Barbados Fire\nService.\n\n15. Tax clearance certificates from the\nBarbados Revenue Authority and the National\nInsurance Department.\n\n\f28\n\nSECOND SCHEDULE\n\n(Sections 5, 27 (1) and 27(3))\n\nRate of Room Levy\n\nRoom Classification\n\nAmount of Room Rate Levy\neffective 1st July 2018 to 30th\nMarch, 2019\n\nAmount of Room Rate Levy\neffective 1st April, 2019\n\nApartment\n\n$5.00 per bedroom per night\n\n$8.75 per bedroom per night\n\nGuest House\n\n$5.00 per bedroom per night\n\n$8.75 per bedroom per night\n\nHotel\nLuxury class\n“A” class\n“B” class\n\nVacation rental property\n\n$20.00 per bedroom per night\n$11.00 per bedroom per night\n$5.00 per bedroom per night\n\n$35.00 per bedroom per night\n$19.25 per bedroom per night\n$8.75 per bedroom per night\n\n2.5% of the rate charged per\nbedroom per night, and where\nthis amount exceeds $20.00 per\nnight, the rate to be charged\nshall be $20.00 per bedroom\nper night.\n\nThe Room Rate Levy shall no\nlonger be applied to a vacation\nrental property from this date.\nThe shared economy levy shall\nbe applied.\n\n\f29\n\nTHIRD SCHEDULE\n\nProduct Development Levy\n\n(Sections 7 and 27(3) )\n\nAmount of Product Development Levy with effect from the 1st July 2018\n\n2.5% of the cost of the direct tourism service\n\n\f30\n\nFOURTH SCHEDULE\n\nShared Economy Levy\n\n(Sections 9 and 27(3) )\n\nAmount of Shared Economy Levy with effect from the 1st August 2018\n\n10 % of the cost of the rental or lease of the tourist accommodation whether that charge is a rate\nwhich is charged per night or per bedroom, or a rate for the period of use.\n\n\f31\n\nFIFTH SCHEDULE\n\nEnactments to be Amended\n\n(Section 26(1) )\n\nPART I\n\nENACTMENT\n\nAMENDMENT\n\nBarbados Revenue Authority Act, 2014\n\nInsert in section 15 the following new\nsubsection after subsection (3):\n\n“ (4) All revenue paid, collected or received\npursuant to section 4 shall be paid into the\nConsolidated Fund.”.\n\nIn the First Schedule  insert the following new\nparagraph after paragraph 10:\n\n“ 11.Tourism Levy Act, 2019 ”.\n\nLand Tax Act, Cap. 78A\n\nDelete section 6D delete and substituting:\n\n“ Tax payable in respect of vacation rentals\n\n6D. (1) The proprietor of a vacation rental\nproperty shall pay tax at the rate specified under\nsection 6(1), with effect from the 1st day of\nApril, 2011, where the tax is paid at the time\nprescribed in section 28, the actual amount\npayable shall be calculated on 75 per cent of the\ntax demanded.\n\n(2) For the purposes of this section,\n(a) “proprietor” includes the owner of a\nvacation property rental and any person, not\nbeing the owner, who for the time being has\nimmediate control over the management of the\nvacation rental property;\n\n\f32\n\n(b) “vacation rental property” means a a\ndwelling house or house which is registered\nwith the Barbados Tourism Product Authority,\nand which\n\n(i) is valued at not less than $525 000;\n\n(ii) makes a charge for the\naccommodation provided;\n\n(iii) is systematically or periodically rented by\nguests during the calendar year, for at least 3\nmonths during that year;\n\n(iv) provides sleeping accommodation in one or\nmore rooms;\n(v) is managed by an individual, company or\nreal estate agent and employs no less than 3\npersons; and\n\n(vi) the grounds and any common areas or\nrecreational facilities are for the use of the\noccupants of a single booking.”.\n\nTourism Development Act, Cap. 341\n\nSection 2\n\n(a) delete the definition of the word “villa”; and\n\n(b) insert the following definition in\nalphabetical order:\n\n“ “vacation rental property” means a a dwelling\nhouse or house which is registered with the\nBarbados Tourism Product Authority, and\nwhich\n\n(a) is valued not less than $525 000;\n\n(b) makes a charge for the\naccommodation provided;\n\n(c) is systematically or periodically rented by\nguests during the calendar year, for at least 3\nmonths during that year;\n\n\fValue Added Tax Act, Cap. 87\n\n33\n\n(d) provides sleeping accommodation in one or\nmore rooms;\n\n(e) is managed by an individual, company or\nreal estate agent and employs no less than 3\npersons; and\n\n(f) the grounds and any common areas or\nrecreational facilities are for the use of the\noccupants of a single booking.”.\n\nDelete the word “villa” wherever it appears and\nsubstitute the words “vacation rental property”\ntherefor.\n\nSection 2 insert the following definition in\nalphabetical order\n\n“ “direct tourism service” has the meaning\nassigned to by section 2 of the Tourism Levy\nAct, 2019 (Act 2019 -).”.\n\nSection 7 repeal subsection (3B).\n\nDelete section 7(11) and substitute the\nfollowing:\n“ (11) With effect from the 1st day of October,\n2013 the tax imposed by subsection (1) on the\nsupply of accommodation in a guest house,\nhotel, inn, apartment or any other similar place;\nor for a direct tourism service shall be 7.5 per\ncent of the value of the supply and is payable\nby the registrant at the time the supply is\nmade.”.\n\nDelete section 7(12).\n\nDelete the Fourth Schedule.\n\n\f34\n\n        PART II\n\nENACTMENT\n\nAMENDMENT\n\nValue Added Tax Act, Cap. 87\n\nInsert in the Second Schedule the following\nnew paragraph after paragraph 15:\n“ 16. From the 1st day of April, 2019, a supply\nof a vacation rental property, being a house or\na dwelling house, which is registered with the\nBarbados Tourism Product Authority and is\nsystematically or periodically rented for a\ncharge or sum during a calendar year by guests\nas tourist accommodation. ”.\n\n\f35\n\nSIXTH SCHEDULE\n\nAmendment of the Value Added Tax Act, Cap. 87\n\n(Sections 26(2) and 27(4) )\n\nENACTMENT\n\nAMENDMENT\n\nValue Added Tax Act, Cap. 87\n\nDelete section 7(11) and substitute the\nfollowing:\n\n“ (11) With effect from the 1st day of January,\n2020 the tax imposed by subsection (1) on the\nsupply of accommodation in a guest house,\nhotel, inn, apartment or any other similar place;\nor for a direct tourism service shall be 10\npercent of the value of the supply and is payable\nby the registrant at the time the supply is\nmade. ”.\n\n\f36\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}