{
  "bill_id": 413,
  "slug": "resolution-re-vesting-of-73283-square-meters-of-land-in-barbados-tourism-investment-inc",
  "title": "Resolution re vesting of 7328.3 square meters of land in Barbados Tourism Investment Inc.",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/46cf797ca348404efcb90ebc9e431bb6.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-07-23",
  "first_reading": "2019-07-24",
  "gazette_date": null,
  "markdown": "                                                                                                                                2019-07-22\n\nPARLIAMENT\n\nRESOLVED that Parliament, in accordance with section 5 of the Crown Lands (Vesting\n\nand  Disposal)  Act,  Cap.  225  approve  the  vesting  in  the  Barbados  Tourism  Investment  Inc.\n\nof the parcel of land, the property of the Crown situate at Bay Street in the parish of Saint Michael\n\nin  this  Island,  more  particularly  described  in  the  Schedule  hereto  for  the  purpose  of\n\ntourism development.\n\nAPPROVED by the House of Assembly this            day of                               , Two\n\nThousand and Nineteen.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                          , Two\n\nThousand and Nineteen.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL THAT land the property of the Crown situate at Bay Street in the parish of\n\nSaint Michael in this Island containing by admeasurement 7328.3 square metres or thereabouts\n\n(inclusive  of  158.4  square  metres  in  road  and  3831.3  square  metres  in  beach) Abutting  and\n\nBounding  on  lands  now  or  formerly  of  Vision  Developments  Inc.  on  the  sea  on  lands  now\n\nor  formerly  of  M.  G.  Tucker  and  Co.  Ltd.  on  a  public  road  known  as  Bay  Street  leading  to\n\nChamberlain Bridge in one direction and to Wellington Street in the other direction or however\n\nelse the same may abut and bound together with the buildings thereon, as shown and delineated\n\non a Plan certiﬁ ed on the 10th day of May, 2019 by Anderson R. Alleyne, Land Surveyor and\n\nrecorded in the Lands and Surveys Department on the 10th day of May 2019 as Plan No. 575/2019.\n\n\f3\n\nADDENDUM\n\nThe  Cabinet  at  its  meeting  held  on  the  18th  day  of  July  2019  agreed  to  the\n\nvesting  of  7328.3  square  metres  of  land  the  property  of  the  Crown  situate  at  Bay  Street\n\nin the parish of Saint Michael in the Barbados Tourism Investment Inc.\n\nOn  the  8th  day  of  July  2019  the  property  situated  at  Bay  Street  in  the\n\nparish  of  Saint  Michael  became  acquired  by  the  Crown  in  accordance  with  the  provisions  of\n\nsection 5 of the Land Acquisition Act, Cap. 228.\n\nIn  accordance  with  the  provisions  of  section  5  of  the  Crown  Lands  (Vesting\n\nand  Disposal) Act,  Cap.  225,  the  approval  of  Parliament  is  now  sought  for  the  vesting  in  the\n\nBarbados  Tourism  Investment  Inc.  of  the  parcel  of  land  more  particularly  described  in  the\n\nSchedule to this Resolution.\n\n"
}