{
  "bill_id": 418,
  "slug": "order-of-freedom-of-barbados-bill-2019",
  "title": "Order of Freedom of Barbados Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/2ab592b582fb2157df92f694d778cfb0.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-07-31",
  "first_reading": "2019-07-31",
  "gazette_date": "2019-08-08",
  "markdown": "2019-07-30\n\nOBJECTS AND REASONS\n\nThis  Bill  would  provide  for  the  conferment  of  the  Order  of  Freedom  of\n\nBarbados and for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nConstitution of the Order\n\nChancellor\n\nDuties of Secretary\n\nSeal\n\nEligibility for Conferment of Order\n\nConferment of Order\n\nPublication\n\n10.\n\nDesignation, insignia and post nominals\n\n11.\n\nRegulations\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the conferment of the Order of Freedom of Barbados\n\nand for related matters\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n2019.\n\nThis  Act  may  be  cited  as  the  Order  of  Freedom  of  Barbados  Act,\n\nInterpretation\n\n2.\nconstituted by section 3.\n\nIn  this  Act,  “Order”  means  the  Order  of  Freedom  of  Barbados\n\nConstitution of the Order\n\n3.(1)\n\nThe Order of Freedom of Barbados is hereby constituted.\n\nThe Order shall comprise members who are eligible for the conferment of\n\n(2)\nthe Order pursuant to section 7.\n\nChancellor\n\n4.(1)\nbe responsible for the administration of the Order.\n\nThe Governor-General shall be the Chancellor of the Order and shall\n\n(2)\nIn  the  absence  of  the  Governor-General,  the  person  for  the  time  being\nperforming the functions of the office of the Governor-General shall discharge\nthe functions of the Chancellor of the Order.\n\n(3)\n\nThe Chancellor\n\n(a)\n\n(b)\n\nshall appoint a person to be the Secretary of the Order; and\n\nmay appoint such other officials to assist in the administration of the\nOrder as he considers necessary for the purpose.\n\nA person is not a member of the Order by reason of the fact only that he is\n\n(4)\nan official of the Order.\n\n\f5\n\nDuties of Secretary\n\n5.\n\nThe Secretary of the Order shall\n\n(a)\n\n(b)\n\n(c)\n\nSeal\n\n6.(1)\n\nmaintain the records of the Order;\n\narrange investitures; and\n\nperform such other functions in respect of the Order as the Governor-\nGeneral may from time to time direct.\n\nThe Order shall have an official Seal.\n\n(2)\n\nThe Governor-General shall have the custody of the Seal of the Order.\n\nEligibility for Conferment of Order\n\n7.(1)\n\nA person who\n\n(a)\n\n(b)\n\n(c)\n\nwas born in Barbados;\n\nis a citizen of Barbados; or\n\nis entitled to be registered as a citizen of Barbados\n\nand  who  has  distinguished  himself  by  extraordinary  service  to  Barbados,  the\nCaribbean,  the  Caribbean  Diaspora  or  to  humanity  at  large  is  eligible  to  be\nconferred with the Order of Freedom of Barbados.\n\n(2)\n\nAn honorary conferment of the Order may be made to a person who\n\n(a)\n\nis  not  a  citizen  of  Barbados,  and  who  has  distinguished  himself  by\nextraordinary  service  to  Barbados,  the  Caribbean,  the  Caribbean\nDiaspora or to humanity at large; or\n\n(b)\n\nis a Head of State or Government.\n\n\f6\n\nConferment of Order\n\n8.(1)\nSubject to subsection (2), the Governor-General may by instrument\nunder the Seal of the Order confer the Order of Freedom of Barbados upon a\nperson referred to in section 7.\n\nThe power conferred on the Governor-General by subsection (1) shall be\n\n(2)\nexercised by him on the advice of the Prime Minister.\n\nThe conferment of the Order shall take effect from the date of the affixing\n\n(3)\nof the Seal or from such other date as may be specified in the instrument.\n\nNo more than two honorary Orders may be conferred in any one calendar\n(4)\nyear and shall be conferred at any time deemed appropriate by the Prime Minister.\n\nThe Order of Freedom of Barbados shall be conferred on a person referred\n\n(5)\nto in section 7(1) on Independence Day.\n\nPublication\n\n9.\nThe Prime Minister shall by order published in the Official Gazette\npublish  the  name  or  names  of  persons  upon  whom  the  Order  of  Freedom  of\nBarbados is conferred.\n\nDesignation, insignia and post nominals\n\n10.(1)\nconferred\n\n(a)\n\n(b)\n\n(c)\n\nA person referred to in section 7(1) upon whom the Order has been\n\nshall be referred to as “the Most Honourable”;\n\nis entitled to wear as a decoration the prescribed insignia of the Order\nof Freedom of Barbados; and\n\nis entitled to have the letters “FB” place after his name on all occasions\nwhen the use of letters after a name is customary.\n\nFor  the  purpose  of  this  section  the  letters  “FB”  means  Freedom  of\n\n(2)\nBarbados.\n\n\f7\n\n(3)\n\nThe Prime Minister shall prescribe the insignia of the Order.\n\nRegulations\n\n11.(1)\n\nThe Governor-General may make regulations providing for\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe Seal and motto of the Order;\n\ninvestitures in relation to the Order;\n\nthe wearing of insignia issued in relation to the Order;\n\nthe prevention of abuses in the wearing of insignia issued in relation\nto the Order; and\n\n(e)\n\ngenerally giving effect to the provisions of this Act.\n\nAll  regulations  made  under  this  section  shall  be  subject  to  affirmative\n\n(2)\nresolution.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}