{
  "bill_id": 419,
  "slug": "electric-light-and-power-amendment-bill-2019",
  "title": "Electric Light and Power (Amendment) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b23db8923a3c1d52698ca60460ada687.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-08-14",
  "first_reading": "2019-08-14",
  "gazette_date": "2019-08-15",
  "markdown": "2019-08-06\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend\n\nthe  Electric  Light  and  Power  Act,  2013\n\n(Act 2013-21).\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Act 2013-21\n\nRepeal and replacement of section 3 of Act 2013-21\n\nAmendment of section 5 of Act 2013-21\n\nAmendment of section 6 of Act 2013-21\n\nAmendment of section 7 of Act 2013-21\n\nAmendment of section 29 of Act 2013-21\n\nRepeal and replacement of section 31 of Act 2013-21\n\nAmendment of section 35 of Act 2013-21\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Electric Light and Power Act, 2013 (Act 2013-21).\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\nAct, 2019.\n\nThis Act may be cited as the Electric Light and Power (Amendment)\n\n\f4\n\nAmendment of section 2 of Act 2013-21\n\n2.\nin this Act referred to as the principal Act, is amended\n\nSection 2 of the Electric Light and Power Act, 2013 (Act 2013-21)\n\n(a)\n\nby inserting in the appropriate alphabetical order, the following:\n\n“    “dispatch”,  in  relation  to  electricity,  means  the  conduct  of  the\nactivities  involved  in  the  central  management  and  direction  of\ngenerating systems and other sources of supply of electricity to the\npublic grid in order to achieve the optimal safety, reliability and\neconomic supply of electricity;\n\n“dispatch code” means rules to govern the dispatch of electricity;\n\n“distribution”  means  the  transport  of  electricity  by  means  of  a\n\ndistribution system;\n\n“distribution system” means a system which\n\n(a)\n\n(b)\n\nconsists, wholly or mainly, of low voltage electric lines; and\n\nis used primarily for conveying electricity from a substation\nto a consumer;\n\n“storage  system”  means  a  system,  mechanism  or  device  for  the\nconversion of electricity into a form of energy which can be kept\nin  reserve,  the  keeping  of  that  energy  and  the  subsequent\nreconversion of that energy into electrical energy in a controllable\nmanner;\n\n“store”, in relation to electricity, means to operate a storage system;\n\n“system operator” means a person who holds a dispatch licence;\n\n“transmission”  means  the  transport  of  electricity  by  means  of  a\n\ntransmission system;\n\n\f5\n\n“transmission system” means a system for conveying electricity from\na generating station to a substation or to another generating station\nor  to  or  from  an  interconnector  or  to  a  consumer  but  does  not\ninclude an electric line that is part of a distribution system;”; and\n\n(b)\n\nby deleting the definition of “works” and substituting the following:\n\n“    “works”  includes  electric  lines  and  any  buildings,  machinery,\nengines, equipment and other things required to generate, store,\ntransmit and distribute or otherwise supply electricity.”.\n\nRepeal and replacement of section 3 of Act 2013-21\n\n3.\nsubstituted:\n\nSection  3  of  the  principal  Act  is  deleted  and  the  following\n\n“Licence required for certain activities in relation to\nelectricity\n\n3.(1)\n\nNo person shall\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\ngenerate  electricity,  wholly  or  partly  for  the  purpose  of\nsupplying electricity to another person, except in accordance\nwith a generation licence;\n\nstore electricity, wholly or partly for the purpose of supplying\nelectricity  to  the  public  grid,  except  in  accordance  with  a\nstorage licence;\n\ntransmit and distribute electricity except in accordance with\na transmission and distribution licence;\n\ndispatch  electricity  except  in  accordance  with  a  dispatch\nlicence; or\n\n\f6\n\n(e)\n\noffer for sale or sell electricity except in accordance with a\nsales licence,\n\nissued to the person for the purpose under section 6.\n\n(2)\nSubsection (1)(a) does not apply to a person who generates and\nsupplies electricity to the public grid where the cumulative installed\ncapacity of the generation systems owned, controlled or operated by\nthe person for the supply of electricity does not exceed the amount set\nout in paragraph 1 of the First Schedule.\n\nSubsection  (1)(b)  does  not  apply  to  a  person  who  stores\n\n(3)\nelectricity\n\n(a)\n\nwhere the person supplies electricity to the public grid but,\nby  virtue  of  subsection  (2),  does  not  require  a  generation\nlicence under subsection (1); or\n\n(b)\n\nin  such  other  circumstances  as  the  Minister  may  by  Order\nprescribe.\n\nSubsection (1)(d) does not apply to a person who offers for sale\n\n(4)\nor sells electricity to the public utility.\n\nA person who contravenes subsection (1) is guilty of an offence\n(5)\nand  is  liable  on  summary  conviction  to  a  fine  of  $100  000  or  to\nimprisonment  for  2  years  or  to  both  and  where  the  offence  is  a\ncontinuing one, to a further fine of $10 000 for every day or part of a\nday  during  which  the  offence  continues  after  a  conviction  is  first\nobtained.”.\n\nAmendment of section 5 of Act 2013-21\n\n4.\n\nSection 5 of the principal Act is amended\n\n(a)\n\nby deleting subsection (1) and substituting the following:\n\n\f7\n\nA person may apply for such licence as he may require in such\n\n“(1)\nform as may be approved by the Minister.”;\n\n(b)\n\nby deleting subsection (3) and substituting the following:\n\n“(3)\n\nWhere the applicant\n\n(a)\n\n(b)\n\nis the public utility;\n\nproposes to operate a generation system the installed capacity\nof which equals or exceeds the amount set out in paragraph\n2 of the First Schedule; or\n\n(c)\n\nseeks  a  storage  licence  or  a  transmission  and  distribution\nlicence,\n\nthe applicant shall publish notice of his application in such form and\nmanner and with such particulars as the Minister may direct or approve,\nin  at  least  2  daily  newspapers,  at  least  twice  at  intervals  of  2\nweeks.”; and\n\n(c)\n\nin  subsection  (4)(a),  by  deleting  the  words  “3  months”  and\nsubstituting the words “28 days”.\n\nAmendment of section 6 of Act 2013-21\n\n5.\nsubstituted:\n\nSection  6(1)  of  the  principal  Act  is  deleted  and  the  following\n\n“(1)\nThe  Minister  may,  upon  payment  of  such  fee  as  may  be\nprescribed,  issue  to  a  person  who  satisfies  the  requirements  of\nsubsection  (3),  a  generation,  storage,  transmission  and  distribution,\ndispatch or sales licence, as the case may be, granting a non-exclusive\nright to\n\n(a)\n\n(b)\n\ngenerate;\n\nstore;\n\n\f8\n\n(c)\n\ntransmit and distribute;\n\n(d)\n\ndispatch; or\n\n(e)\n\noffer for sale and sell,\n\nelectricity for any purpose within any area and for such period as the\nMinister considers appropriate in the circumstances.”.\n\nAmendment of section 7 of Act 2013-21\n\n6.\n(a) and substituting the following:\n\nSection 7(1) of the principal Act is amended by deleting paragraph\n\n“(a)\n\nthe  limits  within  which,  and  the  conditions  under  which,\nelectricity  may  be  generated,  stored,  transmitted  and\ndistributed  or  otherwise  supplied  or  dispatched,  including\nwhether\n\n(i)\n\nany of the provisions of Part III apply to the licensee; or\n\n(ii)\n\nelectricity  is  to  be  generated  only  from  sources  of\nrenewable energy;”.\n\nAmendment of section 29 of Act 2013-21\n\n7.\n“annual”.\n\nSection  29  of  the  principal  Act  is  amended  by  deleting  the  word\n\nRepeal and replacement of section 31 of Act 2013-21\n\n8.\nsubstituted:\n\nSection  31  of  the  principal  Act  is  deleted  and  the  following\n\n\f9\n\n“Codes\n\n31.(1)\nCommission and the Chief Electrical Officer, issue a grid code.\n\nThe  public  utility  shall,  subject  to  the  approval  of  the\n\n(2)\nThe  system  operator  shall,  subject  to  the  approval  of  the\nCommission and the Chief Electrical Officer, issue a dispatch code.”.\n\nAmendment of section 35 of Act 2013-21\n\n9.\nafter subsection (3), the following:\n\nSection 35 of the principal Act is amended by inserting immediately\n\nNotwithstanding section 3, a person other than the public utility,\n“(3A)\nwho obtained a licence before the commencement of the Electric Light\nand Power (Amendment) Act, 2019 (Act 2019- ) shall not be held to be\nin breach of that section and shall be treated for the purposes of this Act\nas if he had obtained the required licence under that section.”.\n\n\f10\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}