{
  "bill_id": 420,
  "slug": "resolution-re-lease-of-land-and-buildings-at-pine-st-michael-to-the-royal-commonwealth-society",
  "title": "Resolution re lease of land and buildings at Pine, St Michael to the Royal Commonwealth Society",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/4f09d96056d728ea62d55b8634fe7ff0.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-10-09",
  "first_reading": "2019-10-16",
  "gazette_date": null,
  "markdown": "2019-07-08\n\nPARLIAMENT\n\nRESOLVED that Parliament, in accordance with section 5 of the Crown Lands\n\n(Vesting and Disposal) Act, Cap. 225, approve the lease to the Royal Commonwealth Society\n\n(Barbados Branch) of the parcel of land, together with the buildings thereon being the property of\n\nthe Crown, situate at The Pine in the parish of Saint Michael in this Island and more particularly\n\ndescribed in the First Schedule to this Resolution, on the terms and conditions set out in the\n\nSecond Schedule to this Resolution, for use as its Headquarters and commercial ofﬁ ce.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and nineteen.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and nineteen.\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL  THAT  land  the  property  of  the  Crown  situate  at  The  Pine  in  the\n\nparish of Saint Michael in this Island containing by admeasurement 5,796.7 square metres or\n\nthereabouts Abutting and Bounding on lands now or late of Majorie Lynch being Lot 3 on lands\n\nnow or late of Khiema Ramdass being Lot 5 on lands now or late of Darnley Rayside being\n\nLot 7 on lands now or late of Mitchinson and Caslene Hewitt being Lot 8 on lands now or late\n\nof Norraine Davis being Lot 9 on lands now or late of Michael Bryan on lands now or late of\n\nErskine Simmons and on a public road leading to Government Hill in one direction to Collymore\n\nRock in another direction and to Pine Gardens or however else the same may abut and bound\n\nas delineated and shown on a Plan certiﬁ ed on the 28th day of May, 2014 by Camille Belgrave,\n\nLand Surveyor and recorded in the Lands and Surveys Department on the 10th day of June, 2014\n\nas Plan No. 527 of 2014.\n\n\f3\n\nSECOND SCHEDULE\n\nTERMS AND CONDITIONS\n\n1.  The  lease  of  5,796.7  square  metres  of  Crown  Land  located  on  Pine  Plantation\nRoad,  St.  Michael,  together  with  the  the  buildings  thereon  is  made  between  the\nCrown  (\"the  lessor\")  and  the  Royal  Commonwealth  Society  (Barbados  Branch)\n(\"the lessee\").\n\n2.  The lease shall be for a period of 25 years with an option to renew for a further\n\nperiod of 25 years.\n\n3.  The initial rent shall be at a concessionary rate of $500.00 per annum during the\n\nﬁ rst 5 years of the lease.\n\n4.  A rent review shall take place every 5 years within the rental period.\n\n5.  The  lessee  shall  be  responsible  for  the  payment  of  insurance  of  the  buildings,\npublic liability and occupier's liability of the premises, payment of utilities, land\ntaxes and other outgoings arising out of the use of the site.\n\n6.  The lessee shall bear the cost of development of the site and shall comply with\nDevelopment Planning and other statutory requirements throughout the term.\n\n7.  The  lessee  shall  be  responsible  for  renovations  as  well  as  the  repairs  and\n\nmaintenance of the buildings and premises.\n\n8.  The  lessee  shall  advise  the  Ministry  responsible  for  Housing,  Lands  and  Rural\nDevelopment  of  the  replacement  cost  of  the  buildings  and  plant  on  site\non completion of the refurbishments.\n\n9.  The lessor shall be indemniﬁ ed against all actions, costs, claims and demands in\nrespect of any injury to or death of any person or damage to any property which\nmay arise directly or indirectly as a result of the lessee's use of the property.\n\n\f4\n\nSECOND SCHEDULE - (Concl'd)\n\n  10.     At the end of the lease period or its sooner determination, all buildings, structures\nand other facilities and improvements regardless of stage of construction, shall\nrevert to the lessor for nil consideration.\n\n  11.     The lessee may bring this lease to an end at any time by giving 6 months' notice\n\nto the lessor.\n\n12.  The lessor may bring this lease to an end at any time after the second rent review\n\nby giving one year's notice to the lessee.\n\n13.  The  lessee  shall  not  assign,  mortgage  or  otherwise  dispose  of  the  property  by\nlease or part with possession without prior written consent of the lessor and such\nconsent not to be unreasonably withheld.\n\n 14.  The  lessee  shall  be  allowed  to  sublet  the  premises  for  ofﬁ ce  accommodation\nonly which shall be for a period of 5 years without the written permission from\nthe lessor.\n\n15.  The lessee shall be allowed to use the property for a mortgage with the written\n\npermission of the lessor.\n\n\f5\n\nADDENDUM\n\nThe Cabinet at its meeting held on the 11th day of April, 2019 agreed that 5,796.7 square\n\nmetres of land together with buildings thereon situate at Pine Plantation Road in the parish of\n\nSaint Michael in this Island should be leased to the Royal Commonwealth Society (Barbados\n\nBranch) for use as its Headquarters and commercial ofﬁ ce.\n\nThe lease shall be subject to the terms and conditions set out in the Second Schedule\n\nin accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal) Act,\n\nCap. 225.\n\n        In  accordance  with  the  provisions  of  section  5  of  the  Crown  Lands  (Vesting  and\n\nDisposal) Act, Cap. 225, the approval of Parliament is now sought for the lease to the Royal\n\nCommonwealth Society (Barbados Branch) of the parcel of land together with the buildings\n\nthereon  and  more  particularly  described  in  the  First  Schedule,  hereto,  on  the  terms  and\n\nconditions set out in the Second Schedule.\n\n"
}