{
  "bill_id": 421,
  "slug": "medicinal-cannabis-industry-bill-2019",
  "title": "Medicinal Cannabis Industry Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/649f0a83657d6e8a0ae7ec0e10894863.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-11-06",
  "first_reading": "2019-11-13",
  "gazette_date": "2019-11-11",
  "markdown": "2019-08-29\n\nOBJECTS AND REASONS\n\nThis Bill would provide for\n\n(a)\n\n(b)\n\nthe regulation of the handling of medicinal cannabis in Barbados;\n\nthe  establishment  of  a  Barbados  Medicinal  Cannabis  Licensing\nAuthority,  a  Barbados  Medicinal  Cannabis  Licensing  Board  and  a\nBarbados Medicinal Cannabis Appeals Tribunal;\n\n(c)\n\nthe issuing of licences for the handling of medicinal cannabis; and\n\n(d)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nPART II\n\nBARBADOS MEDICINAL CANNABIS AUTHORITY\n\nEstablishment of Authority\n\nFunctions of the Authority\n\nEstablishment of a Board to manage Authority\n\nFunctions of the Board\n\nBoard may delegate functions\n\nDisclosure of interest\n\nReport to Minister\n\n10.\n\nDirections of Minister\n\n11.\n\nChief Executive Officer and staff of the Authority\n\n\f3\n\n12.\n\nTransfer and secondment of public officers\n\n13.\n\nLimitation on powers of Board\n\n14.\n\nFunctions of the Chief Executive Officer\n\n15.\n\nObligation to secrecy\n\n16.\n\nProtection from personal liability\n\n17.\n\nFunds and resources of the Authority\n\n18.\n\nBorrowing power\n\n19.\n\nGuarantee of loans\n\n20.\n\nAccounts\n\n21.\n\nMonthly statements\n\n22.\n\nAudit\n\n23.\n\nPublic Finance Management Act to apply\n\n24.\n\nAnnual Report to Minister\n\nPART III\n\nACCESS TO MEDICINAL CANNABIS\n\n25.\n\nUse of Medicinal Cannabis\n\n26.\n\nDose limitation\n\n27.\n\nKeeping of records\n\n\f4\n\n28.\n\nCaregivers\n\n29.\n\nDispensing of medicinal cannabis\n\nPART IV\n\nLICENSING THE SUPPLY OF MEDICINAL CANNABIS\n\n30.\n\nCategories of licences\n\n31.\n\nTiers and types of licences\n\n32.\n\nEligibility to apply\n\n33.\n\nConditions of licences\n\n34.\n\nDuration of a Licence\n\n35.\n\nProhibition against supply\n\n36.\n\nSuspension or Revocation\n\n37.\n\nProtection from criminal liability\n\nPART V\n\nBARBADOS MEDICINAL CANNABIS APPEALS TRIBUNAL\n\n38.\n\nEstablishment of Appeals Tribunal\n\n39.\n\nAppeals to the Cannabis Appeals Tribunal\n\n\f5\n\nPART VI\n\nOFFENCES\n\n40.\n\nOffences\n\n41.\n\nGeneral Penalty\n\nPART VII\n\nMISCELLANEOUS\n\n42.\n\nRegulations\n\n43.\n\nAmendment of Schedule\n\n44.\n\nAmendment of enactments in the Third Schedule\n\n45.\n\nCommencement\n\nFIRST SCHEDULE\n\nComposition and Management of the Barbados Medicinal Cannabis Licensing\nBoard\n\nSECOND SCHEDULE\n\nBarbados Medicinal Cannabis Appeals Tribunal\n\nTHIRD SCHEDULE\n\nConsequential Amendments\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for\n\n(a)\n\n(b)\n\nthe regulation of the handling of medicinal cannabis in Barbados;\n\nthe  establishment  of  a  Barbados  Medicinal  Cannabis  Licensing\nAuthority,  a  Barbados  Medicinal  Cannabis  Licensing  Board  and  a\nBarbados Medicinal Cannabis Appeals Tribunal;\n\n(c)\n\nthe issuing of licences for the handling of medicinal cannabis; and\n\n\f8\n\n(d)\n\nrelated matters.\n\nENACTED by the Parliament of Barbados as follows:\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Medicinal Cannabis Industry Act, 2019.\n\nInterpretation\n\n2.(1)\n\nIn this Act,\n\n“Authority”  means  the  Barbados  Medicinal  Cannabis  Licensing  Authority\n\nestablished under section 3;\n\n“analytical services” includes services for the testing or abstraction of cannabis;\n\n“Board” means the Barbados Medicinal Cannabis Licensing Board which is the\n\nBoard of the Authority established under section 5;\n\n“cannabis” means all parts of any plant of the genus cannabis including any resin\n\nobtained from the plant;\n\n“cannabis material” means\n\n(a)\n\n(b)\n\n(c)\n\ncannabis;\n\ncannabis resin; and\n\nany other raw material derived from the cannabis plant;\n\n“cannabis resin” has the meaning assigned to it in the Drug Abuse (Prevention\n\nand Control) Act, Cap. 131;\n\n\f9\n\n“cannabidiol” or “CBD” means a substance found in the cannabis plant which\nreacts  with  specific  receptors  in  the  human  brain  and  body  to  give  a\ntherapeutic effect;\n\n“CARICOM Member States” or “CARICOM” means the countries or territories\nwhich  are  party  to  the  Revised  Treaty  of  Chaguaramas  establishing  the\nCaribbean  Community,  as  well  as  the  CARICOM  Single  Market  and\nEconomy, that was signed in the Bahamas on 5th July, 2001;\n\n“controlled drug” has the meaning assigned to it by section 3 of the Drug Abuse\n\n(Prevention and Control) Act, Cap. 131;\n\n“cultivation” includes harvesting, curing and drying;\n\n“cultivation  site”  means  the  premises  specified  in  a  Cultivator  Licence  as\n\npremises on which cannabis plants are authorised to be cultivated;\n\n“dispose” means the procedures for destroying cannabis;\n\n“document”  means,  in  addition  to  a  document  in  writing,  anything  in  which\n\ninformation of any description is recorded;\n\n“handling”  includes  use,  cultivation,  processing,  importation,  exportation,\ntransit, transshipment, manufacture, sale, possession and distribution;\n\n“harvest”  means  the  process  of  gathering  every  plant  that  is  reaped,  whether\nmanually  or  by  way  of  machinery,  whether  or  not  that  plant  is  dead  or\ndeemed to have no commercial value or viability;\n\n“licence” means a licence issued to a person by the Authority to facilitate the\nhandling of medicinal cannabis or research and development of cannabis in\naccordance with the Act to supply medicinal cannabis;\n\n“medical,  therapeutic  or  scientific  purposes”  includes  scientific  research,\nresearch  trials,  clinical  trials,  therapy  and  treatment,  and  manufacture  of\nnutraceuticals and pharmaceuticals;\n\n“medicinal cannabis” means\n\n(a)\n\ncannabis that is grown and sold pursuant to this Act;\n\n\f10\n\n(b)\n\n(c)\n\nseeds, immature plants as well as all parts of the plant, along with resin\nextracted from any part of the plant ;\n\nevery compound, manufacture, salt, derivative, mixture or preparation\nfrom cannabis;or\n\n(d)\n\ncannabis concentrate;\n\nthat  is  cultivated,  processed,  manufactured,  distributed  or  sold  under  a\nlicence.\n\n“medical practitioner ” has the meaning assigned to it by section 2 of the Medical\n\nProfession Act, 2011 (Act 2011 - 1);\n\n“Minister” means the Minister responsible for Agriculture and Food Security;\n\n“minor” means a person who is a patient and who is under the age of 18 years;\n\n“patient” means a person who suffers from a medical condition which may be\ntreated with medicinal cannabis prescribed or recommended pursuant to this\nAct;\n\n“pharmacist” has the meaning assigned to it by section 2 of the Pharmacy Act,\n\nCap. 372D;\n\n“pharmacy” means a place registered as a pharmacy under the Pharmacy Act,\n\nCap. 372D;\n\n“premises” means any land or building as well as any vehicle or receptacle located\n\non such land or in any such building;\n\n“public officer” has the meaning assigned to it by section 2 of the Public Service\n\nAct, Cap. 29;\n\n“recommendation”  means  a  written  recommendation  dispensing  cannabis  for\n\nmedical purposes;\n\n“tetrahydrocannabinol” or “THC” means the main active ingredient in cannabis\nand  one  of  the  many  naturally  occurring  chemical  compounds  found  in\ncannabis;\n\n\f11\n\n“Tribunal” means the Barbados Medicinal Cannabis Tribunal established under\n\nsection 38;\n\n“therapeutic facility” means a premises granted a Retail Distributor Licence to\n\n(a)\n\n(b)\n\nsell,  dispense  or  provide  medicinal  cannabis  prescribed  or\nrecommended by a medical practitioner; and\n\nprovide facilities and other medicinal or therapeutic requirements to\nallow  a  patient  who  has  purchased  prescribed  or  recommended\nmedicinal cannabis to use or consume that medicinal cannabis there\nfor therapeutic purposes;\n\n“visitor” means a person who is\n\n(a)\n\n(b)\n\n(c)\n\na patient\n\nis not a resident of Barbados; and\n\nis in possession of a prescription or written recommendation from a\nmedical practitioner in respect of medicinal cannabis;\n\n“young person” means a person who is a patient and who is under the age of 21\n\nyears;\n\nThe  provisions  of  the  Drug  Abuse  (Prevention  and  Control)  Act,\n(2)\nCap.  131,  and  the  Proceeds  and  Instrumentalities  of  Crime  Act,  2019\n(Act 2019-17) shall not prohibit, or otherwise be applied to the use of medicinal\ncannabis or cannabis pursuant to this Act, or be used to restrict or render unlawful,\nthe  handling  of  medicinal  cannabis  or  cannabis  by  any  person,  unless  it  is  in\naccordance with the provisions of this Act.\n\n\f12\n\nPART II\n\nBARBADOS MEDICINAL CANNABIS AUTHORITY\n\nEstablishment of Authority\n\n3.(1)\nMedicinal Cannabis Licensing Authority.\n\nThere  is  hereby  established  a  body  to  be  known  as  the  Barbados\n\nThe Authority is a body corporate to which, subject to section 17, section 21\n\n(2)\nof the Interpretation Act, Cap. 1 applies.\n\nFunctions of the Authority\n\n4.(1)\n\nThe Authority shall\n\n(a)\n\ndevelop policies, procedures and guidelines to establish the medicinal\ncannabis industry and to ensure that medicinal cannabis is available to\npatients in a safe and efficient manner;\n\n(b)\n\nregulate the handling of medicinal cannabis;\n\n(c)\n\n(d)\n\nsubject to subsection (2), issue licences in relation to the handling of\nmedicinal cannabis in accordance with the provisions of this Act;\n\ndevelop  enforcement  procedures  in  relation  to  the  inspection  of\npremises that are operated by a person in order to ensure compliance\nwith the provisions of this Act or any regulations made pursuant to this\nAct;\n\n(e)\n\nwhere required, assist with the provision of analytical services;\n\n(f)\n\nwith the approval of the Board, establish and maintain an electronic\ndatabase to\n\n(i)\n\ninclude  information  relating  to  persons  who  handle  medicinal\ncannabis or cannabis in accordance with this Act; and\n\n\f13\n\n(ii)\n\nprovide for the electronic tracking of the handling of medicinal\ncannabis or cannabis in accordance with this Act;\n\nwith the approval of the Board establish and maintain an electronic\nregister of medical practitioners, patients and caregivers, in accordance\nwith this Act and such other registers as may be prescribed;\n\nprovide for the distribution of educational materials and the conduct\nof  training  programmes  in  relation  to  the  development  and  use  of\nmedicinal cannabis and the medicinal cannabis industry;\n\nensure  that  proper  disposal  requirements  are  prescribed  for  the  safe\ndisposal of cannabis which is handled under this Act;\n\nperform such other functions assigned to it under this Act or any other\nenactment; and\n\nenter into any arrangement, which, in the opinion of the Authority, is\nnecessary to ensure the proper performance of its functions.\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\n(k)\n\n(2)\n\nIn performing the functions specified in subsection (1) , the Authority shall\n\n(a)\n\n(b)\n\n(c)\n\nformulate standards and prescribe codes of practice to be observed by\nlicensees or other persons involved in the medicinal cannabis industry;\n\ndetermine the fees to be charged for services provided by or on behalf\nof the Authority;\n\nfacilitate scientific research in respect of medicinal cannabis and where\napplicable, apply the results of such research in the development of the\nmedicinal cannabis industry; and\n\n(d)\n\ndo all such things as the Authority considers necessary or expedient\nfor the purpose of carrying out its functions.\n\n\f14\n\nEstablishment of a Board to manage Authority\n\n5.(1)\nThere  shall  be  established  a  Board,  to  be  known  as  the  Barbados\nMedicinal Cannabis Licensing Board, which shall be responsible for the policy,\norganisation and administration of the Authority, and in particular for\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe appointment of staff to the Authority and the management thereof;\n\nthe management of the other resources and contracts of the Authority;\n\nthe development of policies for the prudent and efficient management\nof the Authority; and\n\nthe monitoring of the performance of the Authority in respect of the\ndischarge of its functions.\n\nThe  First  Schedule  has  effect  with  respect  to  the  constitution  and\n\n(2)\nmanagement of the Board and otherwise in relation thereto.\n\nFunctions of the Board\n\n6.(1)\ngovernance of the Authority.\n\nThe Board shall be responsible for the policy, strategic direction and\n\n(2)\n\nIn performing its functions, the Board shall\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nmonitor the administrative operations of the Authority;\n\nadvise  the  Minister  on  matters  of  general  policy  relating  to  the\nmanagement, and development of an efficient and regulated medicinal\ncannabis industry;\n\nensure that the Authority receives and manages its funds in a prudent\nmanner; and\n\ndo  all  such  things  as  the  Board  reasonably  considers  necessary  or\nexpedient for the purpose of carrying out its functions under this Act.\n\n\f15\n\nBoard may delegate functions\n\n7.(1)\nThe Board may delegate to the Chairman, a committee of the Board\nor the Chief Executive Officer of the Authority such of its functions as it thinks\nexpedient for the purpose of effectively transacting the business of the Board .\n\n(2)\n\nA delegation of a function under subsection (1)\n\n(a)\n\n(b)\n\ndoes not prevent the discharge by the Board of the function; and\n\nmay, at any time, be revoked by the Board.\n\nDisclosure of interest\n\nA  member  of  the  Board  who  is  in  any  way  directly  or  indirectly\n8.(1)\ninterested in any contract or other matter whatsoever which falls to be considered\nby the Board, or in any contract made or proposed to be made by the Board, shall\ndisclose the nature of his interest to the other members of the Board at a meeting\nof the Board, and the disclosure shall be recorded in the minutes taken at that\nmeeting of the Board, and that member shall not take part in any deliberation or\ndecision of the Board relating to the contract.\n\nA disclosure made by a member of the Board under subsection (1), to the\n(2)\neffect  that  he  is  a  director  or  shareholder  of,  or  has  a  significant  economic\nrelationship with a specific company, firm or other person or is to be regarded as\ninterested in any contract which is made with the company, firm or other person\nshall, for the purposes of subsection (1), be a sufficient disclosure of his interest\nin relation to any contract so made.\n\nReport to Minister\n\n9.\nThe Board may at any time, be required by the Minister to submit a\nreport in respect of any matter or activity in which the Authority is involved under\nthis Act.\n\n\f16\n\nDirections of Minister\n\nThe Minister may give directions of a general nature as to the policy\n10.\nto  be  followed  by  the  Board  and  the  Authority  in  the  performance  of  their\nfunctions, as appear to the Minister to be necessary in the public interest, and the\nBoard and the Authority shall comply with those directions.\n\nChief Executive Officer and staff of the Authority\n\n11.(1)\nto be the Chief Executive Officer of the Authority.\n\nThe Board shall, with the approval of the Minister, appoint a person,\n\n(2)\n\nThe Chief Executive Officer\n\n(a)\n\n(b)\n\nshall hold office for a term not exceeding 3 years, but is eligible for\nreappointment; and\n\nis  entitled  to  such  remuneration  and  allowances  as  the  Minister\ndetermines.\n\nThe Board shall, with the approval of the Minister, appoint or employ such\n\n(3)\nother members of staff as may be required for the Authority.\n\nThe  staff  of  the  Authority  shall  receive  such  remuneration  and  such\n\n(4)\nallowances as the Minister may determine.\n\nTransfer and secondment of public officers\n\n12.(1)\nWhere a public officer is seconded to a post in the Authority from a\npensionable  office  within  the  meaning  of  section  2  of  the  Pensions  Act,\nCap. 25, the period of service with the Authority, unless the Governor-General\notherwise determines, counts for pension under that Act as if the officer had not\nbeen so seconded.\n\n\f17\n\nWhere a public officer accepts employment with the Authority, the public\n\n(2)\nofficer shall\n\n(a)\n\n(b)\n\nbe employed on terms and conditions that are no less favourable than\nthose enjoyed by a public officer of proximate rank or a public officer\nperforming comparable duties; and\n\nretain any right to pension, gratuity or other allowance for which he\nwould have been eligible had he remained in the public service and any\nsuch right is preserved.\n\nLimitation on powers of Board\n\n13.\n\nThe Board shall not, without the prior approval of the Minister,\n\n(a)\n\n(b)\n\nassign to a post established by the Board a salary in excess of such\namount  per  annum  as  the  Minister  may  determine  and  notify  the\nAuthority in writing;\n\nappoint a person to a post established by the Board to which a salary\nin  excess  of  the  amount  determined  by  the  Minister  under\nparagraph (a) is assigned; or\n\n(c)\n\nprovide for the payment of a pension, gratuity or similar benefit to the\nstaff of the Authority in respect of their service to the Authority.\n\nFunctions of the Chief Executive Officer\n\n14.(1)\nmanagement of the affairs of the Authority which shall include the following\n\nThe Chief Executive Officer shall be responsible for the day to day\n\n(a)\n\n(b)\n\ncoordinating the functions of the Authority;\n\nthe taking of any administrative and managerial action as is necessary\nand appropriate for the effective implementation of this Act and any\nregulations made pursuant to this Act;\n\n\f18\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nassigning personnel as may be necessary to ensure that applications for\nlicences are submitted to the Board for approval within the prescribed\nperiod after the making thereof;\n\nensuring the timely implementation of the decisions and directions of\nthe Board;\n\nsubmitting quarterly reports to the Board in relation to the activities of\nthe Authority, in such manner as may be approved by the Board;\n\npreparing the budget of the Authority and submitting the same to the\nBoard for approval;.\n\nimplementing  operational  policies  and  procedures  in  relation  to  the\nfunctions of the Authority; and\n\nperforming  such  other  functions  as  may  be  assigned  to  the  Chief\nExecutive Officer by the Board or under this Act.\n\nThe Chief Executive Officer shall attend the meetings of the Board, but\n\n(2)\nshall not have a vote at any meeting of the Board.\n\nObligation to secrecy\n\n15.(1)\nEvery  person  having  an  official  duty  or  being  employed  in  the\nadministration of this Act shall regard and deal with as secret and confidential\nall  information,  databases,  registers,  records  or  documents  relating  to  the\nfunctions of the Authority or the Board obtained by the person in the course of\nthe performance of his duties or otherwise.\n\nNotwithstanding subsection (1) a person may disclose information in any\n\n(2)\nof the following circumstances\n\n(a)\n\n(b)\n\npursuant to an order of the Court;\n\nto any person or to an employee of the Authority, where he is authorised\nor required to do so; or\n\n(c)\n\nwhere disclosure is permitted under any other enactment.\n\n\f19\n\nA  person  who  receives  information  pursuant  to  subsection(2)(a)  shall\n\n(3)\nregard and deal with that information as confidential.\n\n(4)\nA person who contravenes subsection (1) or (2) is guilty of an offence and\nis liable on summary conviction to a fine of $10 000 or to imprisonment for a\nterm of 2 years.\n\nProtection from personal liability\n\n16.\nNo action, suit, prosecution or other proceedings shall be brought or\ninstituted personally against any member of the Board or Tribunal, employee or\nagent  of  the  Authority  in  respect  of  any  Act  done  bona  fide  in  pursuance  or\nexecution of the Act.\n\nFunds and resources of the Authority\n\n17.(1)\n\nThe funds and resources of the Authority shall comprise\n\n(a)\n\n(b)\n\n(c)\n\nmonies voted for the purpose by Parliament;\n\nsuch sums as may be borrowed by the Authority for its purposes; or\n\nrevenue earned from application fees, fees for the issuing of licences\nand other related matters.\n\nThe  resources  of  the  Fund  shall  be  applied  in  the  payment  of  salaries,\n(2)\npayment or discharge of the expenses, obligations and liabilities of the Authority,\nthe Board and the Tribunal and towards the performance of any function of the\nAuthority, the Board or the Tribunal under this Act.\n\nBorrowing power\n\nThe  Authority  may,  with  the  approval  of  the  Minister,  borrow  any\n18.\nmoney  it  requires  for  meeting  any  of  its  obligations  or  performing  any  of  its\nfunctions and shall, in such a case, inform the Minister of\n\n(a)\n\n(b)\n\nthe amount and source of the loan; and\n\nthe terms and conditions on which the loan may be obtained.\n\n\f20\n\nGuarantee of loans\n\nIn circumstances where approval under section 18 requires a guarantee\n19.\nthe Government may, with the approval of Parliament, in such manner and on\nsuch terms and conditions as may be specified, guarantee a loan to the Authority\ntogether with any interest or other charges payable thereon.\n\nAccounts\n\n20.\n\nThe Authority shall, in respect of its affairs and functions,\n\n(a)\n\n(b)\n\nkeep proper accounts and adequate financial and other records; and\n\nprepare financial statements in respect of each financial year,\n\nin conformity with generally accepted accounting practice.\n\nMonthly statements\n\nEvery month the Chief Executive Officer shall prepare and submit to\n21.\nthe  Accountant-General  within  such  time  as  the  Accountant-General  may\ndetermine\n\n(a)\n\na  statement  of  revenue  showing,  under  such  headings  as  the\nAccountant-General may determine, the total revenue earned;\n\n(b)\n\na statement of cash flows; and\n\n(c)\n\na statement of refunds, remittances and waivers made,\n\nduring the preceding month.\n\nAudit\n\n22.(1)\n\nThe Auditor-General shall be the auditor of the Authority.\n\n(2)\n\nThe Auditor-General shall\n\n(a)\n\naudit annually, the accounts of the Authority and report to the Authority\nand the Minister on the financial statements of the Authority;\n\n\f21\n\n(b)\n\nperiodically  assess,  on  such  basis  as  the  Auditor-General  may\ndetermine  to  be  reasonable,  the  fairness  and  reliability  of  the\ninformation submitted to him by the Authority; and\n\n(c)\n\nprovide the Minister and the Authority with copies of reports of audits\nand assessments carried out under this section.\n\nPublic Finance Management Act to apply\n\n23.\nthe Authority with such modifications and adaptations as may be necessary.\n\nThe Public Finance Management Act, 2019 (Act 2019-1) applies to\n\nAnnual Report to Minister\n\n24.(1)\nyear, submit to the Minister an annual report including\n\nThe Board shall, not later than 3 months after the end of every financial\n\n(a)\n\n(b)\n\n(c)\n\ninformation on the execution of its functions, and the functions of the\nAuthority over the period;\n\nan account of the activities and transactions of the Authority throughout\nthe financial year in such detail as the Minister may direct; and\n\na  detailed  statement  of  all  sums  remitted  in  accordance  with  the\nthe  Public  Finance  Management  Act,  2019\nprovisions  of\n(Act 2019-1).\n\nThe Board may include in its annual report mentioned in subsection (1)\n(2)\nmatters which, in the opinion of the Board, require the attention of the Minister.\n\n\f22\n\nPART III\n\nACCESS TO MEDICINAL CANNABIS\n\nUse of Medicinal Cannabis\n\nA  person  or  visitor  shall  only  use  medicinal  cannabis  where  that\n25.(1)\nmedicinal  cannabis  is  prescribed  by  a  medical  practitioner  or  required  by  a\nrecommendation by a medical practitioner.\n\nThe parent or guardian of a patient who is a minor or young person must\n(2)\nobtain a certificate in writing from a medical practitioner certifying that the use\nof medicinal cannabis is necessary in the case of that minor or young person, and\nthe parent or guardian shall consent in writing to the use of medicinal cannabis.\n\nA person who consumes medicinal cannabis without being authorised to\n(3)\nuse  medicinal  cannabis  by  a  prescription  or  recommendation  from  a  medical\npractitioner is guilty of an offence and is liable on conviction on indictment to a\nfine of $100 000 or to imprisonment for a term of 10 years or to both.\n\nDose limitation\n\n26.\nIn  circumstances  where  a  prescription  or  recommendation  by  a\nmedical  practitioner  requires  repeated  usage  over  a  period  of  3  months,  a\npharmacy or therapeutic facility shall not dispense to that patient more than a 30\nday supply of individual doses at a time.\n\nKeeping of records\n\n27.(1)\nA  medical  practitioner  shall  maintain  a  record  of  every  patient  to\nwhom he has prescribed or recommended medicinal cannabis, and where that\npatient has a caregiver the medical practitioner shall also enter into the record the\nname, national registration number and contact information for the caregiver.\n\nAll information acquired by the medical practitioner under subsection (1)\n(2)\nis confidential, but the medical practitioner shall submit to the Authority at such\n\n\f23\n\ntimes as the Authority may direct a report containing such information, excluding\nthe name of the patient, address of the patient, or the national registration number\nof his patient, from his records as the Authority may prescribe.\n\nThe  Authority  may  request  further  information  from  the  medical\n\n(3)\npractitioner in writing.\n\nCaregivers\n\n28.(1)\nas a caregiver and that person has the responsibility\n\nSubject to subsections (2) and (3), a patient may designate a person\n\n(a)\n\n(b)\n\n(c)\n\nfor the immediate care and safety of the patient;\n\nto assist him with obtaining or using medicinal cannabis; or\n\nto act in the best interest of that person.\n\nA guardian appointed for a person by the Court under the Mental Health\n\n(2)\nAct, Cap. 45 shall be deemed to be the caregiver of that person.\n\nA parent or legal guardian of a patient who is a minor or young person shall\n(3)\nbe deemed to be the caregiver for that minor or young person unless that parent\nor legal guardian designates another person or a person is designated by an order\nof the Court.\n\nA person who is designated as a caregiver under this Act shall obtain from\n(4)\na medical practitioner a certificate that states that the caregiver is not addicted to\na controlled drug.\n\nA person who is under the age of 18 years shall not be designated as a\n\n(5)\ncaregiver.\n\nA caregiver shall not be a person who has been convicted of an indictable\n\n(6)\noffence under the Drug Abuse (Prevention and Control) Act, Cap. 131.\n\nA patient who changes his caregiver shall notify his medical practitioner\n(7)\nof the change, and give that medical practitioner such information as the medical\npractitioner may require in respect of the new caregiver.\n\n\f24\n\nDispensing of medicinal cannabis\n\n29.(1)\nA  pharmacist  or  authorised  personnel  under  the  supervision  of  a\npharmacist  in  a  pharmacy  or  a  pharmacist  or  authorised  personnel  under  the\nsupervision  of  a  pharmacist  in  a  therapeutic  facility  may  dispense  medicinal\ncannabis to a patient and where applicable, to a caregiver for a patient.\n\nSubject  to  subsection  (1),  a  pharmacist  or  authorised  person  being\n(2)\nsupervised by a pharmacist shall only dispense or supply medicinal cannabis on\nthe submission by a patient or where applicable, a caregiver, of a prescription\nor recommendation and a valid form of identification.\n\nUpon dispensing medicinal cannabis to a patient or, where applicable, a\n(3)\ncaregiver, a pharmacist or other authorised personnel under the supervision of a\npharmacist shall ensure that the label given in respect of the prescription or the\nrecommendation has the information required by regulation 3(2) of the Pharmacy\n(Compounding  and  Dispensing  of  Drugs  and  Poisons)  Regulations,  1986\n(S.I. 1986 No. 82).\n\nA pharmacist shall enter the information referred to in subsection (3) in a\n(4)\nregister kept by him and established for that purpose, in the prescribed manner.\n\nA  pharmacist  shall  not  dispense  to  a  patient  or  where  applicable,  a\n\n(5)\ncaregiver\n\n(a)\n\na quantity of medicinal cannabis greater than that which the patient or\ncaregiver is permitted to obtain under a prescription; or\n\n(b)\n\nany form of cannabis prohibited under this Act or any other enactment.\n\nA pharmacist shall conform to any requirement or limitation set by the\n(6)\nmedical  practitioner  as  to  the  form  of  medicinal  cannabis  that  is  required  in\nrelation  to  the  patient  and  shall  provide  to  a  patient  and  where  applicable,  a\ncaregiver, the following information\n\n(a)\n\nthe lawful methods for administering medicinal cannabis in individual\ndoses;\n\n\f25\n\n(b)\n\nany potential danger stemming from the use of medicinal cannabis;\n\n(c)\n\n(d)\n\nhow to prevent or deter the misuse of medicinal cannabis by minors or\nyoung persons; and\n\nany  other  information  which  the  pharmacist  may  consider  to  be\nrelevant.\n\nPART IV\n\nLICENSING THE SUPPLY OF MEDICINAL CANNABIS\n\nCategories of licences\n\n30.\ncannabis industry for the\n\nLicences may be issued in respect of the development of the medicinal\n\n(a)\n\n(b)\n\n(c)\n\ncultivation of cannabis for medicinal purposes;\n\ntransporting of medicinal cannabis;\n\nmanufacturing of medicinal cannabis products;\n\n(d)\n\ndispensing of medicinal cannabis at a therapeutic facility;\n\n(e)\n\nsale of medicinal cannabis;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\nresearch  and  development  of  cannabis  for  medical  therapeutic  or\nscientific purposes;\n\nlaboratory testing of medicinal cannabis;\n\nimporting of medicinal cannabis; and\n\nexporting of medicinal cannabis.\n\n\f26\n\nTiers and types of licences\n\n31.(1)\ncannabis industry may apply for any of the following licences\n\nA person who desires to obtain a licence to operate in the medicinal\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\na Cultivator Licence (Tier 1), Cultivator Licence (Tier 2), Cultivator\nLicence (Tier 3) and Cultivator Licence (Tier 4) which shall be issued\nto  allow  for  the  growing,  harvesting,  drying,  trimming,  curing  or\npackaging of medicinal cannabis;\n\na Research and Development Licence, which shall be issued to allow\nfor the conduct of scientific research for the purpose of improving or\nfurther  developing  cannabis  for  medical,  therapeutic  or  scientific\npurposes;\n\na Laboratory Licence which shall be issued to allow for the conduct of\ntesting and analytical services for the purpose of improving or further\ndeveloping medicinal cannabis;\n\na Processor Licence (Tier 1), Processor Licence (Tier 2), and Processor\nLicence (Tier 3)  which shall be issued to allow for activities relating\nto  the  processing  and  manufacturing  of  cannabis  material  and\nmedicinal cannabis products;\n\na  Retail  Distributor  Licence,  which  shall  be  issued  to  allow  for  the\noperation  of  a  therapeutic  facility  for  the  dispensing  of  medicinal\ncannabis to patients;\n\nan Import Licence, which shall be issued to allow for the importation\nof medicinal cannabis products and planting material from any country\nwhere it is legal so to do;\n\nan Export Licence, which shall be issued to allow for the exportation\nof medicinal cannabis to any country in keeping with the laws of any\nsuch country; and\n\n\f27\n\n(h)\n\na Transport Licence, which shall be issued to allow for the transport of\nmedicinal cannabis.\n\n(2)\n\nWhere a person applies for a\n\n(a)\n\n(b)\n\nResearch and Development Licence; or\n\nLaboratory Licence\n\nand  the  licence  is  issued,  that  person  shall  also  receive  an  import  and  export\nlicence which shall only be used for purposes in connection with the Research\nand Development Licence or the Laboratory Licence.\n\n(3)\n\n(4)\n\nA licence issued pursuant to this Act shall not be transferable.\n\nIn respect of a Cultivator Licence the area of land for\n\n(a)\n\n(b)\n\n(c)\n\nTier 1 shall be not more than 1 acre;\n\nTier 2 shall be more than 1 acre but not more than 5 acres; and\n\nTier 3 shall be more than 5 acres but not more than 25 acres;\n\n(d)\n\nTier 4 shall be more than 25 acres.\n\n(5)\n\nIn respect of a Processor Licence, the processing area for\n\n(a)\n\n(b)\n\nTier 1 shall be not more than 200 square metres; and\n\nTier 2 shall be more than 200 square metres but not more than 500\nsquare metres; and\n\n(c)\n\nTier 3 shall be more than 500 square metres.\n\nEligibility to apply\n\n32.(1)\n\nA person who\n\n(a)\n\n(b)\n\n(c)\n\nis 18 years of age or older;\n\nis a citizen of Barbados;\n\nis a permanent resident of Barbados;\n\n\f28\n\n(d)\n\nhas immigrant status in Barbados;\n\n(e)\n\nis a citizen of a CARICOM Member State, other than Barbados; or\n\n(f)\n\nis a company, partnership or co-operative society\n\nmay apply for a licence.\n\nAn application for a licence under subsection (1) shall be accompanied by\n\n(2)\na certificate from a medical practitioner that states\n\n(a)\n\n(b)\n\nin  the  case  of  an  individual,  that  the  individual  is  not  addicted  to  a\ncontrolled drug; or\n\nin the case of a partnership, that a member is not addicted to a controlled\ndrug.\n\n(3)\n\nA person who has been convicted of an indictable offence under\n\n(a)\n\n(b)\n\n(c)\n\nthe Drug Abuse (Prevention and Control) Act , Cap. 131;\n\nthe  Proceeds  and  Instrumentalities  of  Crimes  Act,  2019  (Act  2019\n-17); or\n\nany other similar enactment creating offences for illegal drugs and for\nthe proceeds gained from such illegal drugs in Barbados or in any other\ncountry\n\nshall not be eligible for a licence.\n\nA person to whom subsection (1)(f)   applies that person shall not be eligible\n(4)\nfor  a  licence  unless  30  per  cent  of  the  company,  partnership,  or  co-operative\nsociety is owned by a citizen, permanent resident, person with immigrant status\nor a citizen of a CARICOM Member State  .\n\nSubsection (4) shall not apply to a Research and Development Licence or\n\n(5)\na Laboratory Licence.\n\nThe Authority shall prescribe regulations in relation to the criteria for the\n\n(6)\neligibility to apply for each category of licence.\n\n\f29\n\nConditions of licences\n\n33.\nimpose conditions in respect of the issue of licences.\n\nThe  Minister  on  the  advice  of  the  Authority  shall  by  regulations\n\nDuration of a Licence\n\n34.(1)\nand is not renewable.\n\nA Cultivator Licence, irrespective of the Tier, shall be valid for 3 years\n\n(2)\n\nAll other licences shall be valid for 3 years and are not renewable.\n\nA person who holds a licence under subsection (1) or (2) may, not later\n(3)\nthan 3 months before the expiration of the licence, re-apply for the issue of a new\nlicence.\n\nProhibition against supply\n\nA  person  shall  not  cultivate,  supply,  possess,  or  obtain  medicinal\n35.(1)\ncannabis for any of the purposes specified under this Act, unless that person is\nthe holder of the relevant licence issued pursuant to this Act.\n\nA person who contravenes subsection (1) is guilty of an offence and is\n(2)\nliable on conviction on indictment to a fine of 15 times the value of the medicinal\ncannabis cultivated, supplied, possessed, or obtained or to imprisonment for a\nterm of 10 years or to both.\n\nSuspension or Revocation\n\n36.\n\nThe Authority may suspend or revoke a licence where the\n\n(a)\n\n(b)\n\n(c)\n\nperson issued the licence is convicted of an offence under this Act;\n\nperson issued the licence contravenes a term or condition of a licence\ngranted under this Act; or\n\nMinister  requires  the  suspension  or  revocation  of  the  licence  in  the\ninterest of public health or public safety.\n\n\f30\n\nProtection from criminal liability\n\nA person who is authorised to undertake any activity under this Act\n37.\nis  hereby  protected  from  criminal  liability,  to  the  extent  that  the  activity  is\nauthorised by, and conducted in accordance with, the provisions of this Act .\n\nPART V\n\nBARBADOS MEDICINAL CANNABIS APPEALS TRIBUNAL\n\nEstablishment of Appeals Tribunal\n\n38.(1)\nTribunal, hereinafter called the Tribunal.\n\nThere is hereby established a Barbados Medicinal Cannabis Appeals\n\nThe  provisions  of  the  Second  Schedule  shall  have  effect  as  to  the\n\n(2)\nconstitution and operation of the Tribunal and otherwise in relation thereto.\n\nThe Tribunal may, with the approval of the Minister, make rules to regulate\n\n(3)\nits own procedure, including provision for any fees to be charged.\n\nAppeals to the Cannabis Appeals Tribunal\n\n39.(1)\nA person who is aggrieved by a decision of the Authority or any other\nperson acting in exercise of any function delegated under this Act, may appeal\nto the Tribunal by way of a notice of appeal within 14 days of the date of the\ndecision  or  within  such  longer  period  as  the  Tribunal  may,  in  any  special\ncircumstance, allow.\n\nThe notice of appeal shall set out clearly the grounds of the appeal and\n(2)\nshall be accompanied by copies of any correspondence, document or statement\nrelevant to the appeal.\n\nA copy of the notice of appeal, together with copies of any correspondence,\n\n(3)\ndocument or statement shall be served on the Authority.\n\n\f31\n\n(4)\nThe Tribunal shall, within 14 days of the receipt of a notice of appeal under\nsubsection  (1),  request  the  Authority  to  furnish  it  with  a  statement  in  writing\nsetting  out  the  reasons  for  its  decision  and  within  14  days  of  receipt  of  the\nstatement, a copy of the statement shall be served on the appellant.\n\nThe  Tribunal  may  order  that  any  book,  paper,  document  or  statement,\n(5)\nrelating to the appeal which is in the possession of the Authority, any other person\nacting in accordance with this Act, or the person aggrieved, be produced at the\nhearing of the appeal.\n\n(6)\n\nThe Tribunal shall cause all parties to the appeal to be informed\n\n(a)\n\nof the date of the hearing of the appeal, which shall be within 30 days\nfrom the date on which the statement is served on the appellant pursuant\nto subsection (4);\n\n(b)\n\nthat they may appear in person or be represented by an attorney-at-law;\nand\n\n(c)\n\nthat they may call witnesses on their behalf.\n\n(7)\n\nOn hearing an appeal under this section, the Tribunal may\n\n(a)\n\n(b)\n\n(c)\n\ndismiss the appeal and confirm the decision of the Authority;\n\nallow the appeal and set aside the decision of the Authority; or\n\ndirect that the matter be referred to the Authority.\n\n\f32\n\nPART VI\n\nOFFENCES\n\nOffences\n\n40.(1)\n\nNo person shall\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nsell, offer for sale or offer for free distribution, medicinal cannabis,\ncannabis or any derivatives or samples thereof at any convention, trade\nshow or at a public or private event;\n\nhave  medicinal  cannabis  in  his  possession,  if  that  person  is  not  a\ncaregiver or authorised to use or licensed to use medicinal cannabis\nunder this Act;\n\nallow another person who is not authorised to use medicinal cannabis\nunder this Act to use medicinal cannabis; or\n\nmake a misrepresentation in relation to a medical condition to a medical\npractitioner  or  fraudulently  provide  material  misinformation  to  the\nmedical  practitioner\nto  obtain  a  prescription  or\nrecommendation for medicinal cannabis.\n\nin  order\n\nA patient or caregiver shall not knowingly obtain, seek to obtain, or have\n(2)\nin their possession, individually or collectively, an amount of medicinal cannabis\nfrom a pharmacy or therapeutic facility that would cause either the patient or the\ncaregiver  to  exceed  the  prescribed  or  recommended  amount  that  they  are\nauthorised to have in their possession.\n\nA patient or caregiver who sells medicinal cannabis that is obtained under\n(3)\na  prescription  or  recommendation  issued  pursuant  to  this  Act  is  guilty  of  an\noffence.\n\n(4)\n\nA person who contravenes this section is guilty of an offence.\n\n\f33\n\nGeneral Penalty\n\nA person who is guilty of an offence under this Act for which no other\n41.\npenalty is provided, is liable on conviction on indictment to a fine of 15 times\nthe value of the medicinal cannabis or to imprisonment for a term of 10 years or\nto both.\n\nPART VII\n\nMISCELLANEOUS\n\nRegulations\n\nThe  Minister  shall,  with  the  approval  of  the  Authority,  make\n42.(1)\nregulations for any matter that is required or permitted to be prescribed and for\ncarrying out or giving effect to this Act.\n\n(2)\n\nWithout limiting the generality of subsection (1), regulations may\n\n(a)\n\n(b)\n\n(c)\n\nprescribe  standards  for  the  supply  of  medicinal  cannabis  and  the\nsystems for certification to meet these prescribed standards;\n\nprescribe fees for the application of a licence and fees for the granting\nor issuing of a licence;\n\nprescribe the documents required for an application and procedures for\nmaintaining the confidentiality of information contained in application\nforms;\n\n(d)\n\nprescribe fees for administrative costs, where required;\n\n(e)\n\nprescribe application forms and the form of licences;\n\n(f)\n\nregulate, restrict or prohibit premises, vehicles or equipment used or\nintended to be used for or in connection with the supply of medicinal\ncannabis;\n\n\f34\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\n(k)\n\nprescribe the category of person who can apply for each type of licence;\n\nregulate or prohibit the transport of medicinal cannabis, including in\nrelation to specific areas in Barbados;\n\nprescribe matters to be considered by the Authority in relation to the\nsuitability of premises for the supply of medicinal cannabis;\n\nprescribe  standards  or  requirements  as  to  the  security  of  access  to\npremises and for securing the premises in which medicinal cannabis\nis supplied or cultivated;\n\nprescribe  requirements  for  signage  at  premises  licensed  in  the\nprescribed manner and information to be displayed at those premises,\nor on equipment or vehicles used for or in connection with the supply\nof medicinal cannabis;\n\n(l)\n\nprescribe the manner in which inspections, searches, detentions and\nseizures under this Act are to be carried out;\n\n(m)\n\nprescribe documents to be kept in relation to medicinal cannabis;\n\n(n)\n\n(o)\n\n(p)\n\n(q)\n\n(r)\n\nprescribe the information to be submitted to the Authority in annual\nreports to be submitted by a medical practitioner;\n\nprescribe  the  sale,  supply  and  safe  custody,  storage  and  security  of\nmedicinal cannabis;\n\nprescribe the procedure for dispensing medicinal cannabis to visitors\nwho have a medical condition;\n\nprescribe the zoning of designated areas to be used as cultivation sites\nor in connection with the supply of medicinal cannabis; and\n\nprescribe  generally,  any  other  matter  or  thing  that  is  authorised  or\nrequired to be prescribed by this Act.\n\n\f(3)\n\nRegulations may be made with respect to\n\n35\n\n(a)\n\nprohibiting, regulating or controlling the supply, distribution, use, safe\ncustody and storage of medicinal cannabis;\n\n(b)\n\npreventing the improper use of medicinal cannabis;\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\nprescribing the manner in which cannabis is to be disposed of;\n\nprohibiting  or  regulating  the  issuing  of  medicinal  cannabis  by\npharmacists to patients;\n\nrequiring persons engaged in the supply of medicinal cannabis to keep\nrecords and provide information in writing or otherwise;\n\nthe  custody,  accumulation,  destruction,  disposal,  use,  supply  and\nstorage of medicinal cannabis, including,\n\n(i)\n\nthe specifications of cupboards and other receptacles; and\n\n(ii)\n\nthe manner of storage of any form of medicinal cannabis;\n\nregulating the supply of medicinal cannabis to persons who have had\na history of substance abuse;\n\nregulating and controlling the advertising by any person of medicinal\ncannabis, including the form and content of advertisements;\n\nprohibiting or regulating the supply of medicinal cannabis, whether by\nwholesale or by retail, or any class of products, unless the product or\nclass  of  product  is  packaged  in  accordance  with  regulations  and\ncontains  no  more  than  a  specified  concentration  of  cannabidiol  or\ntetrahydrocannabinol;\n\n(j)\n\nthe  minimum  size  of  packages  or  containers  in  which  medicinal\ncannabis or any class of medicinal cannabis may be supplied or offered\nfor supply;\n\n(k)\n\nspecifying the containers in which medicinal cannabis maybe supplied\nand prohibiting the use of those containers for other substances;\n\n\f36\n\n(l)\n\n(m)\n\nlabelling and specifying the particulars to be included in labels attached\nto containers of medicinal cannabis;\n\nthe  inspection  of  premises,  other  than  residential  premises,  mobile\nfacilities, stocks, records and any other documents relating to medicinal\ncannabis; or\n\n(n)\n\nthe administration and use of medicinal cannabis.\n\nAny  regulations  made  under  this  section  shall  be  subject  to  negative\n\n(4)\nresolution.\n\nWhere  the  regulations  made  under  this  Act  create  an  offence,  the\n(5)\nregulations may provide for such offences to be   tried summarily or on indictment\nand the  regulations may  prescribe the following penalties\n\n(a)\n\n(b)\n\nin  the  case  of  an  offence  triable  summarily,  a  fine  of  $500  000  or\nimprisonment for a term of 5 years or to both;\n\nin the case of an offence triable on indictment, a fine of $1 000 000 or\nimprisonment for a term of 10 years or to both.\n\nAmendment of Schedule\n\n43.(1)\nGazette amend, revoke or vary the provisions of the Schedule to this Act.\n\nThe Minister may, from time to time, by order published in the Official\n\n(2)\n\nAn order made under subsection (1) shall be subject to negative resolution.\n\nAmendment of enactments in the Third Schedule\n\n44.\namended in the manner specified in the second column of the Third Schedule\n\nThe enactments specified in the first column of the Third Schedule are\n\nCommencement\n\n45.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f37\n\nFIRST SCHEDULE\n\nComposition and Management of the Barbados Medicinal Cannabis Licensing\nBoard\n\n(Section 5)\n\nAppointment of members\n\n1.(1)\ninstrument in writing.\n\nThe Board shall comprise 7 members appointed by the Minister by\n\n(2)\n\nThe Minister shall appoint as members of the Board persons from\n\n(a)\n\nany of the following disciplines:\n\n(i)\n\nbanking:\n\n(ii)\n\nsociology;\n\n(iii)\n\nagriculture;\n\n(iv)\n\npharmacology; or\n\n(v)\n\nmedicine; and\n\n(b)\n\nfrom the members of the Clergy, staff of the University of the West\nIndies, or members of youth organizations.\n\n(3)\n\nA member shall, subject to the provisions of this Schedule,\n\n(a)\n\n(b)\n\nhold office for a term not exceeding 3 years; and\n\nbe eligible for reappointment.\n\nChairman\n\n2.\n\nThe Minister shall appoint a member to be Chairman.\n\n\f38\n\nResignation\n\n3.(1)\naddressed to the Minister.\n\nThe  Chairman  may  resign  his  office  by  instrument  in  writing\n\n(2)\nA member, other than the Chairman, may resign his office by instrument\nin writing addressed to the Chairman, who shall forthwith forward the instrument\nto the Minister.\n\nA resignation takes effect from the date on which the Minister receives the\n\n(3)\ninstrument.\n\nTemporary leave of absence\n\n4.\n\nThe Minister may, in writing, grant a leave of absence to a member.\n\nTemporary appointment\n\nWhere a member is, or is likely to be, unable to perform the functions\n5.\nof his office for more than 30 days, whether as a result of absence from Barbados,\nillness or other cause or reason, the Minister may appoint a person to act in the\nplace of the member.\n\nRevocation of appointment\n\n6.\n\nThe Minister shall revoke the appointment of a member who\n\n(a)\n\n(b)\n\n(c)\n\nfails to carry out any of his functions under this Act;\n\nbecomes of unsound mind or becomes permanently unable to perform\nhis functions by reason of ill health;\n\nis convicted of an offence involving fraud or dishonesty or, in the case\nof any other offence, is sentenced to a term of imprisonment;\n\n(d)\n\nis guilty of serious misconduct in relation to his functions;\n\n(e)\n\nis bankrupt or compounds with or suspends payment to his creditors;\nor\n\n\f39\n\n(f)\n\nfails to declare his interest in a matter before the Board as required by\nthis Act.\n\nVacancies\n\n7.(1)\n\nA vacancy in the membership of the Board arises on\n\n(a)\n\n(b)\n\n(c)\n\nthe death or resignation of a member;\n\nthe revocation of the appointment of a member; or\n\nthe absence of a member from 4 consecutive meetings of the Board\nwithout the approval of the Minister.\n\nA person who is appointed to fill a vacancy referred to in sub-paragraph\n(2)\n(1)  shall  hold  office  only  for  the  unexpired  portion  of  the  term  of  the  former\nmember.\n\nDisqualification of a member\n\n8.\n\nA person who\n\n(a)\n\n(b)\n\n(c)\n\nis a member of Parliament;\n\nis a public officer; or\n\nwere he a member, would have to be removed from office pursuant to\nparagraph 6,\n\nis not eligible to be a member.\n\nGazetting of appointments\n\n9.\nmember shall be published in the Official Gazette.\n\nThe  appointment,  resignation,  death  or  removal  from  office  of  a\n\n\f40\n\nSeal and execution of documents\n\n10.(1)\n\nThe seal of the Authority shall be\n\n(a)\n\nkept  in  the  custody  of  the  Chairman,  or  the  person  performing  the\nfunctions of secretary to the Board and may be affixed to documents\nor instruments pursuant to a resolution of the Board, in the presence of\nany 2 of the persons referred to in this sub-paragraph; and\n\n(b)\n\nauthenticated  by  the  signature  of  the  Chairman  or  the  person\nperforming the functions of secretary to the Board.\n\nAll documents or instruments made by the Board, other than those required\n(2)\nby law to be under seal, and all decisions of the Board shall be signified under\nthe hand of the Chairman, or the person performing the functions of secretary to\nthe Board.\n\nCommittees\n\n11.(1)\nto assist it with the proper discharge of its functions.\n\nThe Board may appoint committees of its members or other persons\n\n(2)\nWhere  a  person  who  is  not  a  member  of  the  Board  is  appointed  to  a\ncommittee,  the  Board  may,  with  the  approval  of  the  Minister,  determine  the\nremuneration and allowances to be paid to the person.\n\nMeetings\n\n12.(1)\nThe Board shall meet as often as may be necessary or expedient for\nthe transaction of its business and such meetings shall be held at such places and\ntimes and on such days as the Board may determine.\n\nThe Chairman, or in the event of his absence from Barbados or inability\n(2)\nto  act  as  such,  the  person  acting  as  Chairman,  may  at  any  time  call  a  special\nmeeting of the Board and shall call such a meeting within 7 days of the receipt\nby him of a request for the purpose addressed to him in writing and signed by not\nless than 3 members.\n\n\f41\n\nThe  Chairman,  or  in  his  absence,  the  person  acting  as  Chairman,  shall\n\n(3)\npreside at all meetings of the Board.\n\nWhere the Chairman is absent from a meeting, the members present shall\n\n(4)\nelect a member from among their number to preside at the meeting.\n\n(5)\n\nFive members shall constitute a quorum.\n\nThe decisions of the Board shall be by a majority of votes and in a case\n(6)\nwhere the voting is equal, the Chairman or other person presiding at the meeting\nshall, in addition to an original vote, have a casting vote.\n\nMinutes  of  each  meeting  shall  be  kept  by  the  person  performing  the\n(7)\nfunctions of secretary to the Board or by such other officer as the Board appoints\nfor the purpose and shall be confirmed by the Board and signed by the Chairman\nat the next meeting of the Board.\n\nAttendance of non-members at meetings\n\nThe Board may invite any person to attend any of its meetings to assist\n13.\nor advise it with respect to any matter under its consideration, but a person so\ninvited does not have a right to vote.\n\nBoard may regulate proceedings\n\n14.\nregulate its own proceedings.\n\nSubject  to  the  provisions  of  this  First  Schedule,  the  Board  may\n\n\f42\n\nSECOND SCHEDULE\n\nBarbados Medicinal Cannabis Appeals Tribunal\n\n(Section 38(2))\n\nAppointment of members\n\nThe Minister shall by an instrument in writing appoint 3  persons to\n1.(1)\nbe  to  be  members  of  the  Barbados  Medicinal  Cannabis  Appeals  Tribunal,\nhereinafter referred to as the Tribunal.\n\nOne  of  the  members  appointed  pursuant  to  paragraph  (1)  shall  be  an\n\n(2)\nattorney-at-law of at least 10 years standing.\n\nThe other 2 members   shall be persons who in the opinion of the Minister,\n(3)\nhave such expertise as may be required for the discharge of the functions of the\nTribunal.\n\n(4)\n\nA member of the Tribunal shall\n\n(a)\n\n(b)\n\nhold office for a term not exceeding 3 years; and\n\nbe eligible for reappointment.\n\nResignation, temporary absence and disqualification\n\n2.\nTribunal as those paragraphs apply to a member of the Board.\n\nParagraphs  3  to  9  of  the  First  Schedule  apply  to  a  member  of  the\n\nInstitution of appeal\n\n3.(1)\nAn  appeal  to  the  Tribunal  shall  be  instituted  by  filing  with  the\nTribunal,  within  such  time  as  may  be  stipulated  in  the  relevant  specified\nenactment, a notice of appeal together with such copies thereof as the Tribunal\nmay require, and the notice shall state the precise grounds of appeal.\n\n\f43\n\n(2)\nThe Chairman of the Tribunal shall set the place, date and time for the\nhearing of the appeal and shall notify the parties of the place, date and time at\nleast 7 days before the date set for the hearing.\n\nProcedure on appeal\n\n4.(1)\n\nThe appeal shall be held in camera and\n\n(a)\n\nthe parties may appear in person or may be represented by an attorney-\nat-law or an agent; and\n\n(b)\n\nthe onus of proof is on the appellant.\n\nAn  appeal  may  be  heard  in  the  absence  of  a  party  who  has  been  given\n\n(2)\nreasonable notice in writing to attend.\n\nIn  determining  the  appeal,  the  Tribunal  may  review  the  whole  case  in\n(3)\nrespect of the law and fact, exercise any discretion, and shall determine the case\nin accordance with its own judgment.\n\nIn the case of a difference of opinion among members sitting together, the\n(4)\nopinion of the majority shall prevail, and in case of an equality of numbers, the\nopinion of the Chairman shall prevail.\n\nNotwithstanding sub-paragraph (4), where the question to be determined\n(5)\nis one of law, account shall not be taken of the opinion of a member who is not\nan attorney-at-law.\n\nPowers of Tribunal\n\n5.(1)\n\nThe Tribunal\n\n(a)\n\nmay\n\n(i)\n\nissue subpoenas,\n\n(ii)\n\nmake orders and give directions to such persons in such manner\nas it thinks fit\n\n(A)\n\nfor the purpose of summoning witnesses;\n\n\f44\n\n(B)\n\nfor requiring the disclosure of documents or other evidence;\n\n(C)\n\nfor requiring parties or witnesses to answer questions;\n\n(D)\n\nfor the purpose of conducting its proceedings in a proper and\norderly manner;\n\n(b)\n\n(c)\n\nmay,  consult  any  person  having  experience  in  any  relevant  field  in\norder to assist it with a matter; and\n\nshall, with respect to the attendance and examination of witnesses, the\nproduction and inspection of documents and all other matters necessary\nfor the exercise of its jurisdiction, have all such powers as are vested\nin a magistrate’s court in an action in that court.\n\n(2)\n\nIn the hearing and determination of any matter before it, the Tribunal\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nmay act without regard to technicalities and legal form;\n\nshall  not  be  bound  to  follow  the  rules  of  evidence  stipulated  in  the\nEvidence Act, Cap. 121;\n\nmay inform itself on any matter in such manner as it thinks just; and\n\nmay take into account opinion evidence and such facts as it considers\nrelevant and material,\n\nbut in any such case, the parties to the proceedings shall be given the opportunity,\nif they so desire, of adducing evidence.\n\nDecisions of Tribunal\n\n6.(1)\nThe  decision  of  the  Tribunal  shall  be  in  writing  and  shall  include\nreasons  for  the  decision,  a  statement  of  the  Tribunal’s  findings  on  material\nquestions of fact and a reference to the evidence or other material on which the\nfindings are based.\n\nThe Tribunal shall ensure that the decision is served on each party to the\n\n(2)\nproceedings.\n\n\f45\n\nMeetings of Tribunal\n\n7.\nprocedure.\n\nSubject to this Second Schedule, the Tribunal may regulate its own\n\n\f46\n\nTHIRD SCHEDULE\n\nConsequential Amendments\n\n(Section 43)\n\nEnactment\n\nDrug Abuse (Prevention and Control) Act,\nCap. 131\n\nAmendment\n\nSection 2 is amended by\n\nCustoms (List of Prohibited and Restricted\nImports and Export) Order, 2009\n(S.I. 2009 No. 127)\n\n(a) deleting the definition of cannabis and\nsubstituting the following:\n“ cannabis” means any plant of the genus\nCannabis from which the resin has not been\nseparated and includes any part of that plant by\nwhatever name it may be designated but does\nnot include medicinal cannabis;” and\n\n(b) inserting the following definition in the\nappropriate alphabetical order:\n\n“medicinal cannabis” has the meaning assigned\nto it by section 2 of the Medicinal Cannabis\nIndustry Act, 2019 (Act 2019- );\n\nParagraph 2 of Part II of the First Schedule is\ndeleted and the following is substituted:\n\n“ Cannabis Satvia etc.\n2. Cannabis sativa ( know as Indian hemp or\nbhang), Cannabis indicia, or any preparation or\nmixture thereof, except\n(a) under a licence issued by the Chief Medical\nOfficer; or\n(b) in accordance with the provisions of\nMedicinal Cannabis Industry Act, 2019.\n\n\fMEDICINAL CANNABIS INDUSTRY BILL, 2019\n\nEXPLANATORY MEMORANDUM\n\nThe This Bill would provide for\n\n(a)\n\n(b)\n\nthe regulation of the handling of medicinal cannabis in Barbados;\n\nthe  establishment  of  the  Barbados  Medicinal  Cannabis  Licensing\nAuthority, the Barbados Medicinal Cannabis Licensing Board, and the\nBarbados Medicinal Cannabis Appeals Tribunal;\n\n(c)\n\nthe issuing of licences for the handling of medicinal cannabis; and\n\n(d)\n\nrelated matters.\n\nPART IPRELIMINARY\n\nClause 1:\n\nprovides a short tile for citing the Act.\n\nClause 2:\n\ndefines certain words which are to guide the interpretation of\nthe Act.\n\nPART II: BARBADOS MEDICINAL CANNABIS AUTHORITY\n\nClause 3:\n\nestablishes  the  Authority  as  a  statutory  corporation  to\nfacilitate the regulation and building of a medicinal cannabis\nindustry in Barbados.\n\nClause 4:\n\nstates the functions of the Authority.\n\ni\n\n\fMedicinal Cannabis Industry Bill, 2019\n\nClause  5:\n\nprovides  a  Board  appointed  by  the  Minister  to  manage  the\nAuthority.\n\nClause 6:\n\nstates the functions of the Board.\n\nClause 7:\n\nClause 8:\n\nClause 9:\n\nClause 10:\n\nClause 11:\n\nClause 12:\n\nClause 13:\n\nprovides  for  the  Board  to  delegate  certain  functions  to  the\nChief Executive Officer of the Authority.\n\nprovides for members of the Board to disclose their interest\nin  any  contractual  or  related  matter  which  falls  to  be\nconsidered by the Board and where such a disclosure is made\nthat Board member cannot participate in the deliberation or\nthe decision taken by the Board.\n\nthe  Minister\n\nmakes  provision  for\nto  request  written\ninformation  on  the  operation  of  the  Authority  and  to  give\ndirection where this is required in the public interest, so the\nMinister  can  ensure  that  the  Authority  is  acting  in  the  best\ninterest of the citizens of Barbados.\n\nprovides for the Board to keep the Minister up to date on how\nthe Authority is functioning;\n\nprovides for a chief Executive Officer to manage the day to\nday operations of the Authority, and for the Authority to have\nthe staff it will need.\n\nprovides for public servants to be seconded to the Authority\nif this is necessary.\n\nmakes it clear that the Board cannot vary the remuneration\npaid under the Act.\n\nii\n\n\fMedicinal Cannabis Industry Bill, 2019\n\nClause 14:\n\nstates the functions of the Chief Executive Officer.\n\nClause 15:\n\nClause 16:\n\nimposes a strict duty of secrecy and confidentiality on the staff\nand people involved with the Board or the Authority.\n\noffers  protection  from  personal  liability  for  the  staff  of  the\nAuthority or members of the Board or Tribunal.\n\nClause 17:\n\nstates how the Authority is to be funded.\n\nClause 18:\n\nprovides a limitation on the statutory powers of the Authority,\nas the Authority can only borrow money with the approval of\nthe Minister.\n\nClause 19:\n\nprovides for the Government to guarantee loans where this is\nrequired.\n\nClause 20:\n\nrequires that the Authority keeps proper accounts.\n\nClause 21:\n\nClause 22:\n\nClause 23:\n\nClause 24:\n\nrequires  the  submission  of  monthly  statements  to  the\nAccountant- General.\n\nprovides  for  Auditor-General  to  be  the  auditor  of  the\nAuthority.\n\nprovides for the Authority and the Board to be subject to the\nPublic Finance Management Act, 2019.\n\nrequires the Board to submit annual report giving a detailed\nassessment on how the Authority functioned over the year.\n\niii\n\n\fMedicinal Cannabis Industry Bill, 2019\n\nPART III: ACCESS TO MEDICINAL CANNABIS\n\nClause 25:\n\nClause 26:\n\nClause 27:\n\nprovides  for  the  use  of  medicinal  cannabis  under  a  strict\nregime which will be fully prescribed in regulations.\n\nrestricts the amount of medicinal cannabis a patient may have\nat one time.\n\nprovides for the medical practitioner to keep medical records\nof  all  patients  given  medicinal  cannabis  so  they  can  be\nproperly  monitored.  This  information  is  usually  kept  by  a\nmedical  practitioner  and  shall  remain  confidential  but  the\nAuthority will be entitled to statistical information which does\nnot  identify  a  patient  beyond  usage  of  medicinal  cannabis,\nimpact of the usage medicinal cannabis, condition and gender.\n\nClause 28:\n\nprovides for caregivers, as many patients may not be able to\nget  their  medication  on  their  own.  It  also  provides  for  the\nregulation  of  the  kind  of  person  who  can  be  a  caregiver  to\nreduce the likelihood of patient not receiving their medication\nand necessary care.\n\nClause 29:\n\nprovides for the manner by which medicinal cannabis will be\ndispensed, and this will be by pharmacy or therapeutic facility\nand  provides  for  the  kind  of  information  which  must\naccompany medicinal cannabis issues to a patient.\n\niv\n\n\fMedicinal Cannabis Industry Bill, 2019\n\nPART IV: LICENSING THE SUPPLY OF MEDICINAL CANNABIS\n\nClause 30:\n\nClause 31:\n\nClause 32:\n\nClause 33:\n\nClause 34:\n\nClause 35:\n\nClause 36:\n\nClause 37:\n\ngives  the  categories  of  licences  which  will  exist  in  the\nindustry.\n\ngives details about each type of licence and makes it clear that\na  single  person  may  have  multiple  licences  to  build  their\nbusiness.\n\nmakes provision for the kind of person who can apply for a\nlicence.\n\nprovides for conditions to attached to licences where this may\nbe required.\n\nprovides for the duration of each kind of licence and makes it\nclear that renewal is not automatic so that the performance of\nthe person granted the licence can be assessed. This does not\nalter the usual renewal procedure or business productivity or\ngrowth but serves as a form of legal notification to prevent a\nperson  developing  a  legitimate  expectation  or  proprietary\nright to renewal which can create legal complications in event\nthat a person is a person whose licence should not be renewed\nbecause that person is in contravention of the Act or in breach\nof the granted licence.\n\nmakes it an offence to be involved in the medicinal cannabis\nindustry without a licence.\n\nprovides for suspension or revocation of a licence where this\nmay be necessary.\n\nmakes  a  declaration  that  a  person  acting  under  this  Act  or\nunder a licence issued thereunder is not subject to criminal\nliability for the authorised activities under the Act.\n\nv\n\n\fMedicinal Cannabis Industry Bill, 2019\n\nPART V: BARBADOS MEDICINAL CANNABIS APPEALS TRIBUNAL\n\nClause 38:\n\nestablishes a Tribunal to hear matters under the Act.\n\nClause 39:\n\noutlines the basic procedure for going before the Tribunal.\n\nPART VI: OFFENCES\n\nClause 40:\n\nprovides for certain general offences.\n\nClause 41:\n\nprovides the penalty for these general offences.\n\nPART VI: MISCELLANEOUS\n\nClause 42:\n\nprovides for detailed regulations to be made to ensure proper\nregulation of the use of medicinal cannabis.\n\nClause 43:\n\nprovides for the Schedules to be amended by order.\n\nClause 44:\n\nprovides for consequential amendments.\n\nClause 45:\n\nprovides for the Act come into operation on a date to be fixed\nby Proclamation.\n\nvi\n\n"
}