{
  "bill_id": 423,
  "slug": "resolution-re-special-loans-republic-bank-barbados-limited-up-to-bbd-263-mllion-re-overdraft",
  "title": "Resolution re Special Loans (Republic Bank (Barbados) Limited) up to BBD $ 26.3 mllion re overdraft",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/9d8071367eee1a88c4fe56d43445627a.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-08-30",
  "first_reading": "2019-09-04",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\n2019-07-29\n\nPARLIAMENT\n\nWHEREAS  by  section  2  of  the  Special  Loans  Act,  Cap.  105  the  Government\n\nis  authorised  from  time  to  time  to  borrow  from  any  bank,  corporation,  company  or  other\n\ninstitution sums of money not exceeding in the aggregate BBD2,500,000,000 on such terms as\n\nmay be agreed upon between the Government and the lender of any such sum of money;\n\nAND  WHEREAS  by  section  3  of  the  said Act  it  is  provided  that  any  money\n\nborrowed under the authority of the Act shall be appropriated and applied to such purposes as\n\nParliament may approve by resolution and that such money and any interest payable thereon is\n\ncharged upon the general revenues and assets of Barbados;\n\nAND WHEREAS the Government considers it necessary to borrow the sum of up\n\nto BBD26.3 million from Republic Bank (Barbados) Limited to repay existing overdraft facilities\n\nheld by the Barbados Transport Board, the National Housing Corporation and the Queen Elizabeth\n\nHospital;\n\nAND WHEREAS the said sum of up to BBD26.3 million is borrowed on the terms\n\nand conditions contained in an Agreement, the main provisions of which are set out in the Schedule;\n\n\f2\n\nAND WHEREAS the said sum of up to BBD26.3 million is within the authorised borrowing\n\nlimit given to the Government under section 2 of the said Act;\n\nBE  IT  RESOLVED  therefore  that  Parliament  approve  the  borrowing  of  the  said  sum  of  up\n\nto BBD26.3 million from Republic Bank (Barbados) Limited to repay existing overdraft facilities held by\n\nthe Barbados Transport Board, the National Housing Corporation and the Queen Elizabeth Hospital, on the\n\nterms and conditions contained in the Agreement, the main provisions of which are set out in the Schedule.\n\nAPPROVED by the House of Assembly this            day of                               , Two\n\nThousand and Nineteen.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                          ,  Two\n\nThousand and Nineteen.\n\n   President\n\n\f3\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nGovernment of Barbados.\n\nRepublic Bank (Barbados) Limited (the \"Bank\")\n\nUp to BBD26,300,000\n\nTo facilitate repayment of existing overdraft facilities in the names of\nthe Barbados Transport Board, the National Housing Corporation and\nthe Queen Elizabeth Hospital.\n\nNew term loan\n\n18 months\n\nThe term loan is repayable over 18 months via blended principal and\ninterest installments. Maturing 18 months from initial disbursement.\nAny amounts still due to the Bank on the last day of the facility's term\nshall be paid on that day.\n\nAll interest payable hereunder shall accrue from day to day on the basis\nof the actual number of days elapsed in a 365/366 - day year.\n\nInterest shall be charged at the rate of 5.0 per cent per annum for the 18\nmonth term of the loan.\n\nBorrower:\n\nLender:\n\nAmount:\n\nPurpose:\n\nFacility:\n\nTenor:\n\nRepayment:\n\nBasis:\n\nInterest rate:\n\nCommitment fees:\n\nA one time facility fee of $131,500 is due and payable upon signing\nof the Agreement.\n\nLegal fees:\n\nLate fees:\n\nAll legal, valuation, stamp duty or other fees incurred by the Bank in\nconnection with this facility shall be paid by the Borrower.\n\nWith respect to loans, where these are not repaid at maturity or a payment\nis not made within nine (9) days of its due date, a late payment charge\ncalculated at 5% of the installment amount (minimum of $40.00) will\nbe applied.\n\n\f4\n\nNotices:\n\nA.  Any instruction or notice given by the Borrower to the Bank\n\nWaiver:\n\nhereunder shall be signed by a person authorized by resolution\nto be given to the Bank.\n\nB.  Any demand made by the Bank hereunder shall be sufﬁ ciently\nmade if in writing and signed by a Manager or the Managing\nDirector of the Bank or if made by the Attorney-at-Law of the Bank.\n\nAny  waiver  by  the  Bank  of  any  breach  by  the  Borrower  of  any\nof  the  terms  hereof,  or  any  indulgence,  time  or  relaxation  by  the\nBank  to  the  Borrower  shall  be  without  prejudice  to,  and  shall  not\naffect the exercise any time thereafter by the Bank of all or any of\nits  rights  and  remedies  hereunder,  as  though  such  waiver  had  not\nbeen made or indulgence or relaxation of time had not been granted.\n\nPrincipal Covenants:\n\nA.\n\nThe Borrower will furnish the Bank with the following:\n\n(i)\n\n(ii)\n\nannually, with evidence that all outgoings, rates and taxes\naffecting all property being charged are paid up to date\n(including land tax, water and National Insurance Scheme\ncontributions).\n\nsuch  other  information  as  the  Bank  may  from  time\nto  time  reasonably  request,  and  provided  that  if  the\nfinancial  information  requested  is  not  submitted  as\nstipulated, the Bank reserves the right to have the said\nﬁ nancial  information  prepared,  and  to  debit  the  cost\nto  the  Borrower's  account,  and  to  vary  upwards  the\ninterest rate on the facility having given notice of such\nvariation.\n\n\f5\n\nPrincipal Covenants: (Concl'd)\n\nB.\n\nThe Borrower will not, without prior written consent from the\nBank create or suffer to exist any encumbrances against property\nor assets now being charged to the Bank.\n\nC.\n\nThe Borrower undertakes to keep the Bank informed of other\nﬁ nancial  obligations  when  submitting  ﬁ nancial  information.\n\nEvents of default:\n\nThe following are the events of default:\n\n(1)\n\n(2)\n\n(3)\n\n(4)\n\n(5)\n\nIf any payment due by the Borrower is not paid on that date\nﬁ xed for the payment thereof or within a 30 day grace period;\n\nIf the Borrower or any guarantor fails to observe any term in\nthe Letter of Offer or any other agreement, security or document\nwith the Bank or commits an Event of Default under the same;\n\nIf any representation or warranty given hereunder shall prove\nto be untrue or incorrect in any respect;\n\nIf a receiver shall have been appointed in respect of the whole\nor part of the assets of the Borrower;\n\nIf any distress or execution shall be levied or issued against any\nproperty of the Borrower and shall not be discharged within\n10 days.\n\n\f6\n\nADDENDUM\n\nThis Resolution seeks the approval of Parliament for the borrowing of up to BBD26.3\n\nmillion by way of a term loan from Republic Bank (Barbados) Limited.\n\nThe sum of up to BBD26.3 million is within the limit of the Special Loans Act, Cap. 105.\n\nThe  loan  will  be  used  to  repay  the  existing  overdraft  facilities  held  by  the  Barbados\n\nTransport Board, the National Housing Corporation and the Queen Elizabeth Hospital.\n\n"
}