{
  "bill_id": 427,
  "slug": "award-pride-of-barbados-bill-2019",
  "title": "Award Pride of Barbados Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/a0f61e69dd2964f6005e60e4f82bfc81.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-10-23",
  "first_reading": "2019-10-23",
  "gazette_date": "2019-10-14",
  "markdown": "2019-09-26\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the conferment of the Award of Pride of Barbados\non  persons  who  are  deserving  of  recognition  by  virtue  of  their  humanitarian,\nsocial, religious or educational contribution to the development of each parish in\nBarbados and for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\nShort title\n\nInterpretation\n\nEstablishment of Award\n\nConferment of Award\n\nEligibility for conferment of Award\n\nPublication\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the conferment of the Award of Pride of Barbados on\npersons  who  are  deserving  of  recognition  by  virtue  of  their  humanitarian,\nsocial, religious or educational contribution to the development of each parish\nin Barbados and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n\nThis Act may be cited as the Award of Pride of Barbados Act, 2019.\n\nInterpretation\n\n2.\n\nIn this Act “Award” means the award established by section 3.\n\nEstablishment of Award\n\n3.\n\nThere is established an award entitled “The Pride of Barbados”.\n\nConferment of Award\n\n4.(1)\nunder the Public Seal confer the Award upon a person referred to in section 5.\n\nSubject to subsection (3), the Governor-General may by instrument\n\nThe power conferred on the Governor-General by subsection (1), shall be\n\n(2)\nexercised by him on the advice of the Prime Minister.\n\nThe conferment of the Award shall take effect from the date of the affixing\n(3)\nof  the  Public  Seal  or  from  such  other  date  as  may  be  specified  in  the\ninstrument.\n\nFor every month in any year an award may be conferred on each of 10\n\n(4)\npersons who reside in Barbados.\n\nFor every month in any year an award may be conferred on each of 10\n\n(5)\npersons who reside outside Barbados.\n\nEligibility for conferment of Award\n\n5.(1)\n\nA person who\n\n(a)\n\nis a citizen of Barbados or is entitled to be registered as a citizen of\nBarbados; or\n\n(b)\n\nis a permanent resident of Barbados\n\n\f5\n\nand  through  sacrifice,  diligence  and  dedication  to  service  has  made  an\noutstanding  contribution  to  community  life  in  a  parish  in  Barbados  or  to  the\nimprovement of economic and social conditions in a parish in Barbados is eligible\nfor the conferment of “the Award”.\n\nThe awards referred to in section 4(4) shall be conferred on persons who\n(2)\nreside in a parish in Barbados and who have been nominated by persons who live\nin the respective parish.\n\n(3)\n\nThe awards referred to in section 4(5) shall be conferred on persons who\n\n(a)\n\n(b)\n\nformerly  resided  in  a  parish  in  Barbados  but  now  reside  outside\nBarbados; and\n\nwho are nominated by persons who either reside in the parish or used\nto reside in the parish, but now reside outside Barbados.\n\nPublication\n\nThe Prime Minister shall by order published in the Official Gazette\n6.\npublish  the  names  of  those  persons  upon  whom  “The  Pride  of  Barbados”  is\nconferred.\n\n\f6\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}