{
  "bill_id": 430,
  "slug": "resolution-re-national-housing-corporation-re-indian-ground-st-peter",
  "title": "Resolution re National Housing Corporation re Indian Ground, St. Peter",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/05af88763c77d11aec120efd44dffb97.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-10-09",
  "first_reading": "2019-11-13",
  "gazette_date": null,
  "markdown": "2019-09-16\n\nPARLIAMENT\n\nRESOLVED  that  Parliament,  in  accordance  with  section  5  of  the  Crown\n\nLands  (Vesting  and  Disposal)  Act,  Cap.  225,  approve  the  vesting  in  the  National  Housing\n\nCorporation of the parcel of land, the property of the Crown, situate at Indian Ground in the parish of\n\nSaint Peter in this Island and more particularly described in the Schedule hereto.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and nineteen.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and nineteen.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  the  property  of  the  Crown,  situate  at  Indian  Ground  in  the\n\nparish  of  Saint  Peter  in  this  Island,  together  with  the  building  thereon  containing  by\n\nadmeasurement 1,876 square metres or thereabouts Abutting and Bounding on a private road\n\nof  Cleland  Plantation  on  lands  now  or  late  of  Stephen  Steward  on  lands  now  or  late  of\n\nCatherine Gill on lands now or late of Anita Cumberbatch and on a public road which leads to\n\nRoebuck in one direction and Prospect in the other direction or however else the same may abut\n\nand bound together with the building thereon as shown and delineated on a Plan certiﬁ ed on the\n\n20th day of March, 2000 by G. Devere Walcott, Land Surveyor and recorded in the Lands and\n\nSurveys Department on the 22nd day of March, 2000 as Plan No. 270/2000.\n\n\f3\n\nADDENDUM\n\nThe Cabinet at its meeting held on the 19th day of October, 2017 considered Note\n\n(17) 720/MHLR 48 and agreed to the sale to the East Caribbean Conference of Seventh-Day\n\nAdventists of 1,876 square metres of Crown land situate at Indian Ground (the site of the former\n\nIndian Ground Primary School) in the parish of Saint Peter in this Island and more particularly\n\ndescribed in the Schedule for the sum of $400,000.00.\n\nThe Cabinet at its meeting held on the 18th day of April, 2019 ratiﬁ ed the decision\n\ntaken by the Cabinet at its meeting held on the 19th day of October, 2017 with respect to Note\n\n(17) 720/MHLR 48 and agreed to the sale of 1,876 square metres of Crown land together with\n\nthe building thereon, the site of the former Indian Ground Primary School in the parish of Saint\n\nPeter to the East Caribbean Conference of the Seventh-Day Adventist for the sum of $400,000.00.\n\nThe Cabinet at its meeting held on the 18th day of July, 2019 considered Note (2019)\n\n915/MHLR 36 and rescinded the decision taken at its meeting held on the 18th day of April,\n\n2019 and instead agreed to vest the said 1,876 square metres of Crown land together with the\n\nbuilding thereon, the site of the former Indian Ground Primary School, in the parish of Saint\n\nPeter in the National Housing Corporation for sale to the East Caribbean Conference of the\n\nSeventh-Day Adventist Church.\n\n\f4\n\nADDENDUM - (Concl'd)\n\nThe land more particularly described in the Schedule hereto is an amalgamation of two\n\nparcels of land. The ﬁ rst parcel was acquired by a conveyance dated 31st March, 1916 between\n\nthe Reverend Henry Ernest Olton of the One Part and the Education Board of this Island of the\n\nOther Part and was recorded in the Registration Department on the 10th November, 1916 as Deed\n\nNumber 908.\n\nThe second parcel was acquired by a conveyance dated 15th October, 1929 between\n\nJohn Wesley Grifﬁ th of the One Part and the Education Board of this Island of the Other Part and\n\nwas recorded in the Registration Department on the 29th November, 1929 as Deed Number 1216.\n\nIn  accordance  with  the  provisions  of  section  5  of  the  Crown  Lands  (Vesting  and\n\nDisposal) Act, Cap. 225 the approval of Parliament is now sought for the vesting in the National\n\nHousing Corporation of the property described in the Schedule to this Resolution for sale to the\n\nEast Caribbean Conference Seventh-Day Adventists for the sum of $400,000.\n\n"
}