{
  "bill_id": 431,
  "slug": "family-law-miscellaneous-provisions-bill-2019",
  "title": "Family Law (Miscellaneous Provisions) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/766c3093f4919a7871ce18d24a73db86.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-12-04",
  "first_reading": "2019-12-04",
  "gazette_date": "2019-12-17",
  "markdown": "2019-09-23\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Family Law Act, Cap. 214 and the Family Law\nRules, 1982 (S.I.1982 No.18) in order to confer certain functions on the Master\nof the High Court.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\nShort title\n\nAmendment of enactments in Schedule\n\nSCHEDULE\n\nCONSEQUENTIAL AMENDMENTS\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend certain enactments relating to family law.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\nAct, 2019.\n\nThis Act may be cited as the Family Law (Miscellaneous Provisions)\n\n\f4\n\nAmendment of enactments in Schedule\n\n2.\nthe respects set out opposite thereto in column 2 of the Schedule.\n\nThe enactments set out in column 1 of the Schedule are amended in\n\n\f5\n\n L.R.O. 1998SCHEDULE(Section 2)CONSEQUENTIAL  AMENDMENTS Column 1Enactments1. Family Law Act, Cap. 214Column 2Amendments1. In section 2, insert the following deﬁ nition in its appropriate alphabetical order:\" \"Master\" has the meaning assigned to it by section 2 of the Supreme Court of Judicature Act, Cap. 117A;\".2. In section 98(a) by deleting the word \"and\" appearing at the end of subsection (2)(i); and(b) by inserting therein immediately after that subparagraph the following:\"(j) the power, authority and  jurisdiction of the  Master;\"; and(c) by renumbering the existing paragraph (j) as paragraph (k).\f6\n\n L.R.O. 1998CONSEQUENTIAL  AMENDMENTS - (Concl'd)Schedule - (Concl'd) Column 1Enactments2. Family Law Rules, 1982 (S.I. 1982 No. 18)Column 2AmendmentsImmediately after rule 87 insert the following new rule:Power of Master \"87A. (1) The Master has the power to grant an order under section 27 of the Act in an uncontested application for the dissolution of a marriage. (2) For the purpose of paragraph (1), the Master is hereby authorised to transact all such business and exercise all such jurisdiction as may be transacted or exercised by a judge in chambers.\".\f7\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}