{
  "bill_id": 433,
  "slug": "queen-elizabeth-hospital-amendment-bill-2019",
  "title": "Queen Elizabeth Hospital (Amendment) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/0021a27666504a51be7b15df17b506f4.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-10-16",
  "first_reading": "2019-10-16",
  "gazette_date": "2019-10-24",
  "markdown": "2019-11-27\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Queen Elizabeth Hospital Act, Cap. 54 to establish\nthe posts of executive chairman, chief operations officer and executive director\nof clinical and diagnostic services and to provide for related matters.\n\n\f2\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 7 of Cap. 54\n\nAmendment of section 9 of Cap. 54\n\nInsertion of new sections 9A and 9B into Cap. 54\n\nAmendment of the First Schedule to Cap. 54\n\nAmendment of the Second Schedule to Cap. 54\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Queen Elizabeth Hospital Act, Cap. 54.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\nAct, 2019.\n\nThis Act may be cited as the Queen Elizabeth Hospital (Amendment)\n\n\f4\n\nAmendment of section 7 of Cap. 54\n\n2.\nSection 7 of the Queen Elizabeth Hospital Act, in this Act referred\nto as the principal Act, is amended by deleting subsection (1) and substituting\nthe following:\n\n“(1)\nThe  Board  may  delegate  such  of  its  functions  as  it  thinks\nexpedient for the purpose of effectively transacting the business of the\nBoard  to  the  Executive  Chairman,  to  any  committee  appointed  or\nestablished by the Board or to any of its employees.”\n\nAmendment of section 9 of Cap. 54\n\n3.\nand (3) and substituting the following:\n\nSection 9 of the principal Act is amended by deleting subsections (2)\n\n“(2)\n\nThe Board shall appoint as employees:\n\n(a)\n\n(b)\n\n(c)\n\nChief Operations Officer;\n\nExecutive Director of Human Resources;\n\nExecutive Director of Medical Services;\n\n(d)\n\nExecutive Director of Nursing Services;\n\n(e)\n\nExecutive Director of Support Services;\n\n(f)\n\n(g)\n\n(h)\n\nExecutive Director of Financial Services;\n\nExecutive Director of Engineering Services; and\n\nExecutive Director of Clinical and Diagnostic Services.\n\n(3)\n\nThe Chief Operations Officer shall\n\n(a)\n\nreport  to  the  Executive  Chairman  on  the  operational\nmanagement of the Hospital; and\n\n\f5\n\n(b)\n\nhave  responsibility  for  the  operational  management  of  the\nHospital including:\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\nmaintaining external accreditations;\n\nensuring the effective planning and implementation of\ncapital works projects;\n\nthere\nensuring\nmanagement; and\n\nis  a  current  plan  for  disaster\n\nmaintaining  an  effective  information  technology  and\ncyber security infrastructure.\n\n(4)\n\nThe Executive Directors referred to in subsection (2) shall\n\n(a)\n\n(b)\n\nreport to the Chief Operations Officer; and\n\nprovide  support  to  the  Chief  Operations  Officer  in  their\nrespective technical areas.\n\nAll persons employed by the Board shall act under the general\n(5)\nsuperintendence and direction of the Board in the performance of their\nduties.”.\n\nInsertion of new sections 9A and 9B into Cap. 54\n\n4.\nimmediately after section 9:\n\nThe principal Act is amended by inserting the following new sections\n\n“Appointment of an Executive Chairman\n\n9A.(1)\nan Executive Chairman.\n\nThe Minister shall, with the approval of the Cabinet, appoint\n\n(2)\nThe Executive Chairman is an employee of the Hospital and is\nsubject to the directions of the Board and is responsible to the Board\nfor the execution of its policy and the management of its affairs.\n\n\f6\n\n(3)\nThe  Board  shall  employ  the  Executive  Chairman  at  such\nremuneration and on such terms and conditions, as the Minister may\ndetermine.\n\n(4)\n\nThe Executive Chairman shall\n\n(a)\n\n(b)\n\nmanage the overall operations and resources of the Hospital;\n\nreport directly to the Minister on matters related to the overall\noperations  and  resources  of  the  Hospital  and  on  matters\npertaining to the Board;\n\n(c)\n\nensure the objectives of the Board are met including:\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\nensuring  the  efficient  delivery  of  timely,  responsive,\npatient-centred health care;\n\nimplementing  strict  adherence  to  principles  of  good\ngovernance;\n\nensuring  optimal  human  resources  output  from  staff\nand ensuring continuous staff development;\n\nensuring the acquisition of appropriate equipment and\ntechnologies;\n\nmaintaining  the  Hospital’s  infrastructure,  equipment\nand technologies;\n\n(vi)\n\nfostering a culture of medical research; and\n\n(d)\n\nset targets and monitor implementation; and\n\n(e)\n\nbe accountable for the performance of the Hospital.\n\nRemoval of an Executive Chairman\n\n9B.\nMinister without the approval of the Cabinet.”.\n\nThe  Executive  Chairman  shall  not  be  removed  by  the\n\n\f7\n\nAmendment of the First Schedule to Cap. 54\n\n5.\nparagraph (1) and substituting the following:\n\nThe  First  Schedule  to  the  principal  Act  is  amended  by  deleting\n\n“1.(1)\nappointed by the Minister by instrument in writing.\n\nThe  Board  shall  consist  of  13  members  who  shall  be\n\nSubject to sub-paragraph (3), members of staff of the Hospital\n\n(2)\nshall not be appointed as members of the Board.\n\nThe  Minister  shall  appoint\n\n(3)\nChairman of the Board.\n\nthe  Executive  Chairman  as\n\nThe members of the Board to be appointed under sub-paragraph\n\n(4)\n(1) shall in addition to the Executive Chairman comprise:\n\n(a)\n\n(b)\n\n(c)\n\nthe Permanent Secretary, Ministry of Health ex officio or the\nnominee of that person;\n\nthe Chief Medical Officer ex officio or the nominee of that\nofficer; and\n\npersons who possess the qualifications set out in section 5(3)\nin relation to the following disciplines:\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\naccounting;\n\nengineering;\n\nfinance;\n\nhuman resource management and industrial relations;\n\ninformation technology;\n\n(vi)\n\nlaw;\n\n(vii)\n\nmanagement operations;\n\n\f8\n\n(viii)\n\nmedicine;\n\n(ix)\n\nnursing; and\n\n(x)\n\nparamedical services.\n\nThe Minister shall appoint the Deputy Chairman from among the\n\n(5)\nmembers of the Board.\n\nThe names of the Chairman, the Deputy Chairman and the other\n(6)\nmembers of the Board shall be published in the Official Gazette within\n3 months of an appointment.”.\n\nAmendment of the Second Schedule to Cap. 54\n\n6.\nSchedule set out in the Schedule to this Act is substituted.\n\nThe Second Schedule to the principal Act is deleted and the Second\n\n\f9\n\nSCHEDULE\n\n“SECOND SCHEDULE\n\nAppeal to Privy Council\n\n(Section 6)\n\n(Section 19(2C)\n\nWhere upon an application for a review by an officer the\n1.\nBoard  has  confirmed  the  decision  in  respect  of  the  officer,  an\napplication may be made in writing to the Governor-General to have\nthe matter referred to the Privy Council.\n\n2.\n\nThe application shall\n\n(a)\n\n(b)\n\nbe made within 14 days of the date on which the officer was\nadvised in writing of the decision of the Board;\n\nbe  transmitted  to  the  Governor-General  by  the  Chief\nOperations Officer pursuant to paragraph 3.\n\n3.\nTogether with the application referred to in paragraph (2)\n(b), the Chief Operations Officer shall transmit the complete report of\nall the proceedings in the matter.”.\n\n\f10\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}