{
  "bill_id": 434,
  "slug": "caribbean-broadcasting-corporation-amendment-bill-2019",
  "title": "Caribbean Broadcasting Corporation (Amendment) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3390cb1ba742cd24ac44e823a85c931d.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2019-11-14",
  "first_reading": "2019-11-22",
  "gazette_date": "2019-10-31",
  "markdown": "2019-10-14\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Caribbean Broadcasting Corporation Act, Cap.\n276  to  provide  for  modern  broadcasting  services,  abolish  the  post  of  general\nmanager, establish the posts of chief executive officer and chief operating officer\nand for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nShort title\n\nAmendment of section 2 of Cap. 276\n\nAmendment of section 3 of Cap. 276\n\nAmendment of section 4 of Cap. 276\n\nAmendment of section 6 of Cap. 276\n\nAmendment of section 7 of Cap. 276\n\nAmendment of section 9 of Cap. 276\n\nAmendment of section 20 of Cap. 276\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Caribbean Broadcasting Corporation Act, Cap. 276.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n(Amendment) Act, 2019.\n\nThis Act may be cited as the Caribbean Broadcasting Corporation\n\n\f4\n\nAmendment of section 2 of Cap. 276\n\n2.\nin this Act referred to as the principal Act, is amended\n\nSection 2 of the Caribbean Broadcasting Corporation Act, Cap. 276,\n\n(a)\n\nby  deleting  the  definitions  of  “broadcasting”,  “broadcasting\nservices”,  “receiving  station”,  “television”,  “transmitting  station”,\nand “wireless telegraphy”; and\n\n(b)\n\nby inserting in the appropriate alphabetical order the following new\ndefinitions:\n\n“ “broadcasting” means any transmission of programmes, whether or\nnot encrypted, by radio waves, other means of telecommunication\nor  by  other  electronic  delivery,  for  reception  by  the  public  by\nmeans of broadcasting receiving apparatus, but does not include\nany  such  transmission  of  programmes  that  is  made  solely  for\nperformance or display in a public place;\n\n“broadcasting receiving apparatus” means a device, or combination of\ndevices, intended for or capable of being used for the reception of\nbroadcasting;\n\n“encrypted” means treated electronically or otherwise for the purpose\n\nof preventing intelligible reception;\n\n“other  means  of  telecommunication”  means  any  wire,  cable,  radio,\nsatellite, optical or other electromagnetic system, or any similar\ntechnical system; and\n\n“programme”  means  sounds  or  visual  images,  or  a  combination  of\nsounds and visual images, that are intended to inform, enlighten\nor entertain, but does not include visual images, whether or not\ncombined  with\nthat  consist  predominantly  of\nalphanumeric text;\n\nsounds,\n\n\f5\n\n“receiving station” means a station for the receipt of messages or other\n\nmatter;\n\n“transmitting station” means a station for the transmission of messages\n\nor other matter.”.\n\nAmendment of section 3 of Cap. 276\n\n3.\nand substituting the following:\n\nSection 3 of the principal Act is amended by deleting subsection (1)\n\nThere  shall  be  a  Corporation,  to  be  called  the  Caribbean\n“(1)\nBroadcasting Corporation (hereinafter in this Act referred to as “the\nCorporation”), whose function shall be to provide, in accordance with\nthis Act, services related to broadcasting that are of a high quality both\nas to the transmission and as to the matter transmitted.”.\n\nAmendment of section 4 of Cap. 276\n\n4.\nand substituting the following:\n\nSection 4 of the principal Act is amended by deleting subsection (1)\n\n“(1)\nThe Corporation may by a vote of a majority of all the members\nthereof delegate to any one or more of the following persons, that is to\nsay, the chairman, the chief executive officer, the chief operating officer\nand a committee appointed by the Corporation, such of the functions\nof the Corporation as to enable them effectively to transact such of the\nday-to-day  business  of  the  Corporation  as  the  Corporation  may\ndecide.”.\n\nAmendment of section 6 of Cap. 276\n\n5.\nand substituting the following:\n\nSection 6 of the principal Act is amended by deleting subsection (2)\n\n\f6\n\n“(2)\nIt shall be the duty of all officers, employees and agents of the\nCorporation, and in particular of the chief executive officer to ensure\nthat any standards so laid down are maintained.”.\n\nAmendment of section 7 of Cap. 276\n\n6.\nthereof.\n\nSection 7 of the principal Act is amended by deleting subsection (2)\n\nAmendment of section 9 of Cap. 276\n\n7.\nthe following:\n\nSection 9 of the principal Act is amended by deleting and substituting\n\n“9.\nThe Corporation may appoint advisory committees to advise\nthe  Corporation  on  any  matter  concerning  services  related  to\nbroadcasting and other business of the Corporation and consisting of\nas  many  persons  whether  or  not  members  of  the  Corporation  as  the\nCorporation thinks fit.”.\n\nAmendment of section 20 of Cap. 276\n\n8.\nsubstituting the following:\n\nSection  20  of  the  principal  Act  is  amended  by  deleting  and\n\n“20.\nThe  Corporation  may  appoint  and  employ  at  such\nremuneration and on such terms and conditions as it thinks fit a chief\nexecutive officer, a chief operating officer, a secretary and such other\nemployees and agents as it may deem necessary for the proper carrying\nout of this Act provided that:\n\n(a)\n\nno person shall be appointed chief executive officer or chief\noperating officer without the prior approval of the Minister;\n\n\f7\n\n(b)\n\n(c)\n\n(d)\n\nthe  Corporation  shall  have  power  to  dismiss  the  chief\nexecutive  officer  or  chief  operating  officer,  subject  to  the\nprior approval of the Minister;\n\nno salary in excess of such sum as the Minister may determine\nand notify in writing to the Corporation shall be assigned to\nany post without the prior approval of the Minister ;\n\nno  appointment  whether  permanent  or  temporary  shall  be\nmade to any post to which a salary is assigned by the Minister\nunder  paragraph  (c)  without  the  prior  approval  of  the\nMinister;\n\n(e)\n\nexcept with the prior approval of the Minister, no person shall\nbe dismissed from any post specified in paragraph (d).”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}