{
  "bill_id": 435,
  "slug": "broadcasting-amendment-bill-2019",
  "title": "Broadcasting (Amendment) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/fb7258d0212884e73babb432a0f18437.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2019-11-14",
  "first_reading": "2019-11-22",
  "gazette_date": "2019-10-31",
  "markdown": "2019-10-14\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Broadcasting Act, Cap. 274B to redefine the term\n\n“broadcast” and provide for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\nShort title\n\nAmendment of section 2 of Cap. 274B\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Broadcasting Act, Cap. 274B.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Broadcasting (Amendment) Act, 2019.\n\n\f4\n\nAmendment of section 2 of Cap. 274B\n\n2.\n\nSection 2 of the Broadcasting Act, Cap. 274B is amended\n\n(a)\n\nby  deleting  the  definition  of  “broadcast”  and  substituting  the\nfollowing:\n\n“ “broadcast” means any transmission of programmes, whether or not\nencrypted, by radio waves, other means of telecommunication or\nby other electronic delivery, for reception by the public by means\nof broadcasting receiving apparatus, but does not include any such\ntransmission of programmes that is made solely for performance\nor display in a public place; ”\n\n(b)\n\nby deleting the definition of “licence” and substituting the following:\n\n“  “licence”  means  a  licence  to  carry  on  a  broadcasting  undertaking\nissued  to  a  person,  whether  under  an  agreement  or  otherwise,\npermitting  that  person  to  operate  a  radio  station  or  television\nstation; and”\n\n(c)\n\nby inserting in the appropriate alphabetical order the following new\ndefinitions:\n\n“ “broadcasting receiving apparatus” means a device, or combination\nof devices, intended for or capable of being used for the reception\nof broadcasting;\n\n“broadcasting  undertaking”  includes  a  distribution  undertaking,  a\n\nprogramming undertaking and a network;\n\n“distribution undertaking” means an undertaking for the reception of\nbroadcasting  and  the  retransmission  thereof  by  radio  waves  or\nother means of telecommunication to another such undertaking;\n\n\f5\n\n“encrypted” means treated electronically or otherwise for the purpose\n\nof preventing intelligible reception;\n\n“network” includes any operation where control over all or any part of\nthe  programmes  or  programme  schedules  of  one  or  more\nbroadcasting undertakings is delegated to another undertaking or\nperson;\n\n“other  means  of  telecommunication”  means  any  wire,  cable,  radio,\nsatellite, optical or other electromagnetic system, or any similar\ntechnical system;\n\n“programme”  means  sounds  or  visual  images,  or  a  combination  of\nsounds and visual images, that are intended to inform, enlighten\nor entertain, but does not include visual images, whether or not\nthat  consist  predominantly  of\ncombined  with\nalphanumeric text; and\n\nsounds,\n\n“programming undertaking” means an undertaking for the transmission\nof programmes, either directly by radio waves or other means of\ntelecommunication  or\nthrough  a  distribution\nindirectly\nundertaking, for reception by the public by means of broadcasting\nreceiving apparatus.”.\n\n\f6\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}