{
  "bill_id": 438,
  "slug": "markets-and-slaughterhouses-amendment-bill-2019",
  "title": "Markets and Slaughter-Houses (Amendment) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/440aa468f2c4a6d046a9f3532a7e2976.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2019-10-25",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "2019/10/11\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Markets and Slaughter-Houses Act, Cap. 265 to\nmake provision for the imposition of pecuniary penalties and other matters related\nthereto.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nRepeal and replacement of section 22 of Cap. 265\n\nAmendment of section 24 of Cap. 265\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Markets and Slaughter-Houses Act, Cap. 265 to make\nprovision for the imposition of pecuniary penalties and other matters related\nthereto.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment) Act, 2019.\n\nThis  Act  may  be  cited  as  the  Markets  and  Slaughter-Houses\n\nRepeal and replacement of section 22 of Cap. 265\n\nSection 22 of the Markets and Slaughter-Houses Act, Cap. 265, in\n2.\nthis  Act  referred  to  as  the  principal  Act,  is  deleted  and  the  following  is\nsubstituted:\n\n“Selling marketable commodities and other goods within\nprescribed areas\n\n22.(1)\nSubject to section 23, no person shall sell, offer or expose\nfor  sale  any  marketable  commodities  or  any  goods,  wares  or\nmerchandise\n\n(a)\n\n(b)\n\nin  the  doorway  or  entrance  to  any  building  or  on  the\npavements  or  sidewalks  of  any  street,  lane,  alley  or  road\nwhich is situate within the limits of an area prescribed by the\nMinister pursuant to section 26; or\n\nin any part of any public place, whether a street, lane, alley,\nroad  or  other  public  place  within  the  limits  of  the  area\nprescribed by the Minister in paragraph (a).\n\nThe Chief Supervisor may apply to the magistrate’s court for an\n(2)\norder that a person who contravenes subsection (1) pays to the Crown\na pecuniary penalty.\n\nThe  magistrate  may  make  the  order  for  a  pecuniary  penalty,\n(3)\nreferred to in subsection (2), where the magistrate is satisfied that the\nperson to whom the order refers has contravened subsection (1).\n\n\f5\n\nThe magistrate, in exercising his powers under subsection (3),\n\n(4)\nshall have regard to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe nature and extent of the contravention of subsection (1);\n\nthe nature and extent of any loss suffered by any person as a\nresult of the contravention of subsection (1);\n\nthe circumstances of the contravention of subsection (1); and\n\nany previous determination made by the magistrate’s court\nagainst the offending person.\n\nThe pecuniary penalty in respect of an order made pursuant to\n\n(5)\nsubsection (3) is $300.”.\n\nAmendment of section 24 of Cap. 265\n\n3.\n\nSection 24 of the principal Act is amended by\n\n(a)\n\ndeleting subsection (2) and substituting the following:\n\nA permit referred to in subsection (1) shall be issued by the Chief\n“(2)\nSupervisor in the form prescribed and upon payment of the prescribed\nfee and shall be valid for such period as may be specified therein, not,\nhowever, exceeding one year from the date of issue of the permit:”;\n\n(b)\n\ninserting immediately after subsection (4), the following:\n\n“(4A)\nWhere an order for a pecuniary penalty has been made against a\nperson  pursuant  to  section  22,  the  Chief  Supervisor  may  cancel  the\npermit issued to that person pursuant to subsection (2).”; and\n\n(c)\n\ndeleting subsection (5) and substituting the following:\n\n“(5)\nAn  applicant  for  a  permit  mentioned  in  subsection  (1)  who  is\ndissatisfied by a refusal of the Chief Supervisor to grant a permit may\n\n\f6\n\nappeal  to  a  Judge  in  chambers  within  14  days  of  the  date  of  that\nrefusal.”.\n\n"
}