{
  "bill_id": 439,
  "slug": "resolution-re-gob-external-commercial-dept-restructuring-gecd2",
  "title": "Resolution re GOB External Commercial Dept Restructuring GECD.2",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/68ebb78203a9268f63c6b2f75df41cad.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-10-30",
  "first_reading": "2019-11-13",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\n2019-10-24\n\nPARLIAMENT\n\nWHEREAS by virtue of section 3(1)  of  the External  Loans  Act, Cap. 94D,  the\n\nGovernment of Barbados is authorised to borrow money outside of Barbados for such purposes\n\nand in such sums as are approved by resolution of Parliament;\n\nA N D   W H E R E A S   b y   v i r t u e   o f   s e c t i o n   3 ( 2 )   o f   t h e   s a i d   A c t ,   a l l\n\nborrowings  thereunder  shall  be  effected  and  secured  by  issue  and  sale  of  securities;\n\nAND  WHEREAS  by  virtue  section  5(2)  of  the  said  Act,  the  principal\n\nof  and  the  interest  on  securities  and  any  sinking  fund  payment  required  to  be  made\n\nunder  section  6(1)  of  the Act  are  charged  on  and  payable  out  of  the  Consolidated  Fund;\n\nAND  WHEREAS  the  Government  of  Barbados  deems  it  necessary  to\n\nexchange  certain  eligible  existing  debt  for  two  new  series  of  securities  of  up  to  $580\n\nmillion  in  the  currency  of  the  United  States  of America  with  Bank  of  New  York  Mellon\n\nCorporation as Trustee on the terms and conditions set out in  the Schedule to this Resolution;\n\nA N D   W H E R E A S   t h e   n e w   b o r r o w i n g   i n   t h e   f o r m   o f   t w o   n e w\n\nseries  of  securities  is  for  the  purpose  of  supporting  the  principle  agreement  reached  to\n\nrestructure the Government's external commercial debt.\n\n\f2\n\nBE IT RESOLVED therefore that Parliament\n\n(a)\n\napprove  the  borrowing  in  the  form  of  the  issuance  of  two  new\n\nseries  of  securities  of  the  said  sums  up  to  $580  million  in  the  currency\n\nof  the  United  States  of  America  with  Bank  of  New  York  Mellon\n\nCorporation  as  Trustee  for  the  purpose  herein  mentioned;  and\n\n(b)\n\napprove the establishment of a sinking fund for the redemption of each issue\n\nof  securities  made  under  the  said Act  and  for  the  moneys  necessary  to\n\nmaintain and service that fund.\n\nAPPROVED by the House of Assembly this            day of                               , 2019.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                          ,  2019.\n\n   President\n\n\f3\n\nSCHEDULE\n\nIssuer:\n\nTrustee:\n\nInstruments:\n\nFace Value:\n\nTERMS AND CONDITIONS\n\nGovernment of Barbados\n\nBank of New York Mellon Corporation\n\nU.S. Dollar 6.500% Bonds due 2029 (the \"2029 Bonds\"); and\nU.S. Dollar 6.500% Bonds due 2021 (the \"PDI Bonds\").\n\nFor the 2029 Bonds: Up to US$547.5 million.\n\nFor  the PDI Bonds: Up to US$32.5 million.\n\nMaturity:\n\nFor the 2029 Bonds: 1st  October, 2029.\n\nInterest Rate:\n\nFor the 2029 Bonds: 6.500% per annum.\n\nFor the PDI Bonds: 1st February, 2021.\n\nFor  the PDI Bonds: 6.500% per annum.\n\nInterest Payment Dates:\n\nFor  the  2029  Bonds:  1st   April  and  1st    October  of  each  year,\ncommencing on 1st  April, 2020.\n\nAmortisations:\n\nCash Payment:\n\nFor the PDI Bonds: 1st  October, 2020 and 1st  February, 2021.\n\nFor the 2029 Bonds: The 2029 Bonds will be amortised in 10 equal\nsemi-annual payments from 1st  April, 2025 through 1st  October, 2029\n(inclusive).\n\nFor the PDI Bonds: Two instalments of US$30 million on 1st  October,\n2020 and US$2.5 million on 1st  February, 2021.\n\nUS$7.5 million to be paid in cash at closing to holders participating\nin the exchange.\n\nAdverse Weather Clause:\n\nFor the 2029 Bonds: Included, providing a 2 year grace on principal\nand interest.\n\nFor the PDI Bonds: Not applicable.\n\nPrincipal Reinstatement\nClause:\n\nThe  reinstatement  of  forgiven  principal  upon  the  occurrence  of  a\npayment event of default prior to the expected end date of the current\nIMF program.\n\nGoverning Law:\n\nEnglish Law.\n\n\f4\n\nADDENDUM\n\nThe  Resolution  seeks  the  approval  of  Parliament  for  the  issuance  of  two  new  series\n\nof securities with the aggregate principal amount of up to US$580 million  on the international\n\ncapital markets by the issue of securities with Bank of New York Mellon Corporation as Trustee\n\nfor  the  purpose  of  supporting  the  arrangement  reached  to  restructure  the  Government's\n\nexternal commercial debt.\n\n"
}