{
  "bill_id": 442,
  "slug": "supplementary-estimates-no-7-20192020-2950000",
  "title": "Supplementary Estimates No. 7  2019-2020   $2,950,000",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/e3d5148594e25df0436cafe9653de7dc.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2019-11-12",
  "first_reading": "2019-11-22",
  "gazette_date": null,
  "markdown": "HOUSE OF ASSEMBLY\nResolved that the sum of ONE MILLION EIGHT HUNDRED AND FIFTY THOUSAND DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2019-2020 as shown in the Supplementary Estimates No.7 2019-2020 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2019 — 2020 No.7\nHEAD Code Provision in Number Approved Estimates 2019 - 2020 Other Expenditure HEAD: 15 CABINET OFFICE Program: 070 Cabinet Secretariat Subprogram: 7020 General Management and 150707020 Coordination Services Account Code: 230 — Contingencies 152,000 HEAD: 30 OFFICE OF THE ATTORNEY GENERAL Program: 040 Direction and Policy Formulation Services Subprogram: 0240 Forensic Services 300400240 Account Code: 752 — Machinery and Equipment 150,000\nProvision in Supplementary Supplementary Provision Estimates Required No. 1-6\nOther Other Expenditure Expenditure\n1,000,000\n850,000\nADDENDUM\nRequest for Supplementary Provision to Cover the Cost of Barbados’ Contribution to the Bahamas Hurricane Relief Fund\nA supplementary provision in the sum of one million dollars ($1,000,000.00) is requested to cover the cost of Barbados’ contribution to The Bahamas Hurricane Relief Fund. The supplementary provision is as follows:\nHead 15: Cabinet Office\nProgramme 070: Cabinet Secretariat\nSub-Programme__7020: General Management and\nCoordination Services\nAccount Code 230:\nContingencies\n$1,000,000.00\n_\nADDENDUM\nThe sum of eight hundred and fifty thousand dollars ($850,000) should be approved under Head 30 — Office of the Attorney General as follows:\nHead 30: Office of the Attorney General Programme 040: Direction and Policy Formulation Services Sub-programme 0240: Forensic Services Account Code: 752 Machinery and Equipment - $850,000\nA supplementary provision of eight hundred and fifty thousand dollars ($850,000) is required to meet the cost of expenditure for Capital Works for the remediation of the Forensics Sciences Centre.\n"
}