{
  "bill_id": 443,
  "slug": "sacramental-cannabis-bill-2019",
  "title": "Sacramental Cannabis Bill,  2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/c4433732d6d7e8242403e549be66dcae.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-11-23",
  "first_reading": "2019-11-27",
  "gazette_date": null,
  "markdown": "Explanatory Menorandum after page 23\n\n22nd November, 2019 - Sixth Draft\n\nOBJECTS AND REASONS\n\nThis Bill would provide for a person who is an adherent of the Rastafarian\nreligion  and  for  Rastafarian  congregations  to  use  cannabis  as  a  sacrament  in\nworship at a place of worship or at a public place, and for related purposes.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nInterpretation\n\nUse of Cannabis as a sacrament\n\nApplication for sacramental use permit\n\nSacramental use permit\n\nExempt event permit\n\nTerms and conditions\n\nSecuring premises\n\nCommercial use\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nRegister\n\n11.\n\nInspection of premises\n\n12.\n\nSuspension or revocation of permits\n\n13.\n\nChange of Particulars\n\n14.\n\nOffences\n\n15.\n\nAmendment of enactment in the Second Schedule\n\n\f3\n\nFIRST SCHEDULE\n\nFORMS\n\nSECOND SCHEDULE\n\nConsequential Amendments\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for a person who is an adherent of the Rastafarian religion\nand for Rastafarian congregations to use cannabis as a sacrament in worship\nat a place of worship or at a public place, and for related purposes.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n\nThis Act may be cited as the Sacramental Cannabis Act, 2019.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“cannabis”  has  the  meaning  assigned  to  it  by  section  2  of  the  Drug  Abuse\n\n( Prevention and Control) Act, Cap. 131;\n\n“exempt event permit” means a permit granted under section 6;\n\n“Minister” means Minister with responsibility for Legal Affairs;\n\n“minor” means a person who is under 18 years of age;\n\n“permit” means sacramental use permit or exempt event permit, as the case may\n\nbe;\n\n“place of worship” means any premises and the buildings thereon used as a place\n\nof worship for adherents of the Rastafarian religion;\n\n“public place” means an indoor or outdoor area, whether privately or publicly\nowned, to which the public has access by right or by invitation, expressed\nor implied, whether by payment of money or not;\n\n“religion” means the moral system of beliefs practised or followed by a person;\n\n“religious body” means a group or association of persons who are adherents of\nthe same religion and who elect to worship or practice their religion as a\ngroup or association;\n\n“sacrament” means an item, thing or object, which is venerated or revered, as it\n\nis believed to be vital or essential to practice of the religion;\n\n“sacramental use permit” means a permit granted under section 4.\n\n\f7\n\nUse of Cannabis as a sacrament\n\nA person who is an adherent of the Rastafarian religion shall in the\n3.\nenjoyment of his freedom of religion be permitted to use cannabis as a sacrament\nin an assembly of or in association with other Rastafarians in a place of worship\nin accordance with the provisions of this Act.\n\nApplication for sacramental use permit\n\n4.(1)\nA person who is responsible for the administration or management of\na place of worship may apply to the Minister for the grant of a sacramental use\npermit to allow persons of that religious body to use cannabis for sacramental\npurposes at that place of worship.\n\nA  person  desirous  of  making  an  application  under  subsection  (2)  shall\n\n(2)\napply in the form set out as Form 1 of the First Schedule.\n\nA person whose application is approved by the Minister shall be granted\n\n(3)\na permit in the form set out as Form 2 of the First Schedule.\n\nThe Minister shall notify the Commissioner of Police by an instrument in\n\n(4)\nwriting where a permit has been granted under subsection (2).\n\nA permit granted under this section shall remain valid unless the place of\n(5)\nworship is no longer being used by the religious body referred to in subsection\n(1) as a place of worship.\n\nSacramental use permit\n\n5.(1)\n\nA permit granted under section 4(2) grants permission for\n\n(a)\n\nthe cultivation and harvesting of cannabis on the premises of the place\nof worship for the sacramental use of persons who attend that place or\nworship;\n\n(b)\n\nthe possession, preparation or processing of cannabis as a sacrament\nat the place of worship;\n\n\f8\n\n(c)\n\nthe  smoking  or  other  use  of  cannabis  as  sacrament  at  the  place  of\nworship; and\n\n(d)\n\nthe storage, destruction, or disposal of cannabis at the place of worship.\n\nA permit granted under section 4(2), shall not allow the growth of cannabis\n\n(2)\nwithin 600 metres of a school.\n\nExempt event permit\n\n6.(1)\nA  person  in  charge  of  a  place  of  worship  granted  a  permit  in\naccordance  with  section  4(3),  may  make  an  application  for  an  exempt  event\npermit in the form set out as Form 3 in the First Schedule to observe an occasion\nof worship or fellowship at a public place.\n\nA person whose application is approved by the Minister shall be granted\n\n(2)\nan exempt event permit in the form set out as Form 4 in the First Schedule.\n\nA  permit  granted  under  subsection  (2)  shall  only  be  valid  for  the  date\n\n(3)\nspecified therein.\n\nA permit granted under subsection (2) shall give permission for persons\n\n(4)\nattending the exempt event to\n\n(a)\n\n(b)\n\nuse cannabis in the public place being used for the event;\n\ntransport  no  more  than  14  grammes  of  cannabis  to  the  public  place\nbeing used for the event; or\n\n(c)\n\nsupply or give cannabis for sacramental purposes at the event.\n\nThe Minister shall notify the Commissioner of Police by an instrument in\n\n(5)\nwriting where a permit has been granted under subsection (2).\n\n\f9\n\nTerms and conditions\n\n7.(1)\nSubject  to  the  provisions  of  this  Act,  the  Minister  may  grant  a\nsacramental use permit under this Act subject to such terms and conditions as the\nMinister considers necessary\n\n(a)\n\n(b)\n\n(c)\n\nto secure the cannabis from public access and public visibility;\n\nto protect minors; or\n\nin the interest of public safety, public health or public morality.\n\nSubject to the provisions of this Act, the Minister may grant an exempt\n(2)\nevent permit under this Act subject to such terms and conditions as the Minister\nconsiders necessary\n\n(a)\n\n(b)\n\nto protect minors; or\n\nin the interest of public safety, public health or public morality.\n\nSecuring premises\n\n8.(1)\nA person who is granted a sacramental use permit shall implement\nsuch measures as the Minister shall specify in that permit to secure the cannabis\non the premises of the place of worship in such a manner as to ensure that the\ncannabis is secured from public access and public visibility.\n\nA person who contravenes subsection (1) is guilty of an offence and is\n(2)\nliable on summary conviction to a fine of $10 000 or to a term of imprisonment\nof 2 years or to both.\n\nCommercial use\n\n9.(1)\nA person who sells cannabis on the premises of a place of worship\ngranted a sacramental use permit is guilty of an offence and is liable on summary\nconviction to a fine of $10 000 or to a term of imprisonment of 2 years or to both.\n\nA person who sells or uses the cannabis grown at a place of worship in a\n(2)\ncommercial venture or for any commercial purpose is guilty of an offence and is\n\n\f10\n\nliable on summary conviction to a fine of $10 000 or to a term of imprisonment\nof 2 years or to both.\n\nA person who sells or offers for sale any cannabis at an event for which an\n(3)\nexempt event permit has been granted is guilty of an offence and is liable on\nsummary conviction to a fine of $10 000 or to a term of imprisonment of 2 years\nor to both.\n\nRegister\n\nThe Minister shall ensure that a register is kept in electronic form or\n10.\notherwise, to record each issue of a sacramental use permit or an exempt event\npermit to a person for the benefit of a place of worship, and the register shall also\nrecord such other particulars with respect to place of worship, or the exempt event\nas the Minister may require.\n\nInspection of premises\n\n11.(1)\n\nThe Minister may for the purposes of the Act appoint inspectors to\n\n(a)\n\n(b)\n\ninspect a place of worship or a public place where the Minister requires\nsuch an inspection for the purposes of making a determination under\nsection 4(3) or section 6(2); or\n\nexamine,  where  required  by  the  Minister,  any  premises  granted  a\nsacramental use permit or exempt event permit to ensure compliance\nwith this Act.\n\nAn  inspector  appointed  under  subsection  (1)  shall  be  eligible  for  such\n\n(2)\nremuneration or other allowances, as the Minister may determine.\n\nAn inspector appointed under subsection (1) shall report to the Minister\n\n(3)\nwithin 4 days of being required to do any inspection under subsection (1).\n\n\f11\n\nSuspension or revocation of permits\n\n12.(1)\nAct\n\n(a)\n\n(b)\n\nThe Minister may suspend or revoke any permit granted under this\n\nwhere there is a breach of any provision of this Act;\n\nwhere there is a breach of any term or condition attached to a permit;\nor\n\n(c)\n\nin the interest of public safety, public health or public morality.\n\nWhere the Minister suspends or revokes a permit he shall by an instrument\n\n(2)\nin writing notify\n\n(a)\n\n(b)\n\nthe person in charge place of worship of the suspension or revocation\nand that the cannabis on the premises will be harvested and disposed\nof by the Commissioner of Police; and\n\nthe Commissioner of Police of the suspension or revocation and request\nthat he attend the premises and harvest and dispose of any cannabis\nthereon, and submit a report on the completion of the same.\n\nIn the case of a suspension the Minister, shall by the instrument in writing\n(3)\nissued under subsection (2) notify the person in charge of the place of worship\nof the period of the suspension and the date on which that the suspension will\nend.\n\nChange of Particulars\n\n13.\nThe person granted a sacramental use permit under section 4(2) or his\nsuccessor, shall in circumstances where the person in charge of a place of worship\nchanges,  notify  the  Minister  by  an  instrument  in  writing  of  the  change  of\nleadership, and that notification shall state the full name of all persons who are\ninvolved in leadership of the place of worship as well as the relevant contact\ninformation such as residential addresses, residential telephone numbers, cellular\ntelephone numbers and email addresses.\n\n\f12\n\nOffences\n\n14.(1)\n\nNo person shall\n\n(a)\n\n(b)\n\n(c)\n\ntransport cannabis to or from a place of worship unless this occurs on\na date for which an exempt event permit has been granted;\n\nimport cannabis into Barbados or export cannabis from Barbados for\nsacramental purposes;\n\nbe in possession of, supply or handle cannabis outside of a place of\nworship  unless  he  is  permitted  to  do  so  in  accordance  with  the\nprovisions of this Act; or\n\n(d)\n\npermit or allow a minor to use cannabis as a sacrament.\n\nA person who contravenes subsection (1) is guilty of an offence and is\n(2)\nliable on summary conviction to a fine of $10 000 or to a term of imprisonment\nof 2 years or to both.\n\nAmendment of enactment in the Second Schedule\n\n15.\nThe enactment specified in the first column of the Second Schedule is\namended in the manner specified in the second column of the Second Schedule.\n\n\f13\n\nFIRST SCHEDULE\n\nFORMS\n\nFORM I\n\n(Sections 4 and 6)\n\n(Section 4(2))\n\nSACRAMENTAL CANNABIS ACT, 2019\n\nAPPLICATION FOR SACRAMENTAL USE PERMIT\n\n1.\n\nName of place of worship*\n\n3.\n\n3.\n\n4.\n\n5.\n\nAddress of place of worship :\n\nFull name of person (individual) applying:\n\nAddress of applicant:\n\nEmail address of applicant (optional):\n\n\f6.\n\nTelephone Numbers (home, cellular, work) of applicant:\n\n14\n\n7.\nidentification card):\n\nNational  Identification  number  of  applicant  (attach  a  copy  of  the\n\n8.\n\nState approximately how many people attend this place of worship:\n\n9.\nList the full name of at least 5 people (other than the applicant) who\nare principal officers, people involved in administration or management of this\nplace  of  worship,  as  well  as  their  national  identification  numbers,  residential\naddresses, home and cellular telephone numbers and email addresses?\n\nContact 1:\n\nContact 2:\n\n\f15\n\nContact 3:\n\nContact 4:\n\nContact 5:\n\n\f16\n\n10.\nI ____________________ hereby give permission for the Minister\nto make such enquiries regarding me, as well as with respect to any information\nherein regarding the place of worship as may be necessary for the purposes of the\nAct.\n\nSignature of applicant\n\nDate\n\n\f17\n\nFORM 2\n\nSACRAMENTAL CANNABIS ACT, 2019\nSACRAMENTAL USE PERMIT\n\n(section 4(3))\n\nPermit No.\n\nName of ( place of worship )\n\nI  hereby  certify  that  the  above-mentioned  (  name  of  place  of  worship  )  which  is  located  at\n____________________is hereby by granted permission to use cannabis as a sacrament in the\npractice of the Rastafarian religion at this place of worship, in accordance with provisions of the\nSacramental Cannabis Act, 2019.\n\nTerms and Conditions of this Permit\n\nMinister responsible for Legal Affairs\n\nFull name\n\nDate of Issue\n\n\f18\n\nFORM 3\n\n(Section 6(1))\n\nSACRAMENTAL CANNABIS ACT, 2019\n\nEXEMPT EVENT PERMIT\n\n1.\n\nName of place of worship\n\n2.\n\n3.\n\n3.\n\n4.\n\n5.\n\nPermit no: ______________\n\nAddress of place of worship:\n\nFull name of person (individual) applying:\n\nAddress of applicant:\n\nEmail address of applicant (optional):\n\n\f19\n\nTelephone Numbers (home, cellular, work) of applicant:\n\nNational Identification number of applicant:\n\n6.\n\n7.\n\nNOTE.\nPlease  be  advised  that  this  permit  allows  the  use  of  cannabis  as\nsacrament only. It DOES NOT grant permission to use a specific venue or remove\nthe  requirement  to  meet  the  necessary  legal  requirements  to  use  that  venue  or\nplace.\n\n8.\n\nWhat event is this permit being sought for?\n\n9.\nand end time?\n\nWhere will the event be held, and what is the estimated start time\n\n10.\n\nWill a fee be charged for the event and if so how much?\n\n11.\n\nHow many persons do think will attend this event?\n\n12.\nI ____________________ hereby give permission for the Minister\nto  make  such  enquiries  regarding  me,  any  information  herein  or  the  place  of\nworship as may be necessary for the purposes of the Act.\n\n\f20\n\nSignature of applicant\n\nDate\n\n\f21\n\nFORM 4\n\nSACRAMENTAL CANNABIS ACT, 2019\nEXEMPT EVENT PERMIT\n\n(section 6(2))\n\nPermit No.\n\nName of place of worship\n\nI  hereby  certify  that  the  above-mentioned  (name  of  place  of  worship)  is  hereby  by  granted\npermission to use cannabis as a sacrament in the practice of the Rastafarian religion at an event\nlocated  at\nto  be  held  on  __________  at  ________________________  which\n____________________.\nThis  permit  only  allows  the  use  cannabis  in  accordance  with  provisions  of  the  Sacramental\nCannabis Act, 2019 , for the date for which this permit is valid. It does not grant permission to\nuse the venue. You must make the necessary arrangements for the use of your venue of choice\nand comply with any legal requirements to use that venue.\n\nis\n\nTerms and Conditions of this Permit\n\nMinister responsible for Legal Affairs\n\nFull name\n\nDate of Issue\n\n\f22\n\nSECOND SCHEDULE\n\nConsequential Amendments\n\n(Section 15)\n\nEnactment this\n\nAmendment\n\nDrug Abuse (Prevention and Control) Act,\nCap. 131\n\nIn section 5(1) insert the following words after\nthe words “section 12 ,”:\n“ or the Sacramental Cannabis Act, 2019\n(Act 2019 -), ”\n\nIn section 6 (1) insert the following words after\nthe words “section 12 ,”:\n“ or the  , ”\n\nSacramental Cannabis Act, 2019 (Act 2019 - )\n\nIn section 9(1) delete the word “It” and\nsubstituting the following words:\n“ Subject to the provisions of the Sacramental\nCannabis Act, 2019 (Act 2019 - ), it”.\n\nIn section 11(1) insert the following words after\nthe words “section 12 ,”:\n“ or the Sacramental Cannabis Act, 2019\n(Act 2019 -), ”\n\nIn section 18 by insert immediately after\nsubsection (3) the following new subsection:\n“(3A) Where an exempt event permit is granted\nin accordance with the Sacramental Cannabis\nAct, 2019 (Act 2019 - ), no person attending the\nevent to which the permit applies shall be liable\nunder this section.”.\n\nIn Section 20(1) by delete the word “No” and\nsubstituting the following:\n\n\f23\n\n“ Subject to the provisions of the Sacramental\nCannabis Act, 2019 (Act 2019 - ), no”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n\fEXPLANATORY MEMORANDUM\n\nThe Bill would provide for the sacramental use of cannabis by an adherent of\n\nthe Rastafarian religion in association with other persons of the same religion.\n\nClause 1:\n\nprovides a short title by which the Act will be cited.\n\nClause 2:\n\nClause 3:\n\nClause 4:\n\nClause 5:\n\ndefines certain terms which are critical to the understanding\nof the Act.\n\nis  a  declaratory  clause  affirming  that  the  adherents  of  the\nRastafarian religion may use cannabis in their worship as a\nreligious body.\n\ncreates a permit scheme to facilitate the use of cannabis for\nsacramental purposes.\n\nindicates what the sacramental use permit facilitates. It allows\nfor the cultivation, harvesting and processing of cannabis at a\nplace of worship to ensure its availability for the worship of\nthe religious body. The cannabis produced on the compound\nof  the  place  of  worship  can  be  readily  supplied  to  and\npossessed by the people who attend that place of worship.\n\nClause 6:\n\nprovides  for  the  observance  and  use  of  the  sacrament  of\ncannabis at special events which are held away from the place\nof worship.\n\nClause 7:\n\nprovides for terms and conditions to be attached to premises.\n\nClause 8:\n\nrequires that cannabis grown for the purposes of this Act is to\nbe secured from public access and public viewing.\n\ni\n\n\fClause 9:\n\nClause 10:\n\nClause 11:\n\nClause 12:\n\nClause 13:\n\nprohibits the use of cannabis under this Act for commercial\nbenefit.\n\nestablishes a register to ensure that these places of worship are\nknown  and  can  be  supported  or  regulated  as  the  law  may\nrequire.\n\nprovides for the Minister to appoint inspectors to investigate\nplaces of worship to ensure compliance.\n\nprovides for the permits to be suspended or revoked where the\npermit is not being used in accordance with the Act.\n\nrequires that the people in charge of the places of worship keep\nthe Minister informed of any change in the leadership.\n\nClause 14:\n\ncreates offences for the protection of the vulnerable.\n\nClause 15:\n\nprovides  for  consequential  amendments  to  be  made  to  the\nDrug  Abuse  (Prevention  and  Control)  Cap.  131    to\naccommodate the use of cannabis as a sacrament.\n\nii\n\n"
}