{
  "bill_id": 445,
  "slug": "supplementary-estimates-no-8-20192020-1100000",
  "title": "Supplementary Estimates No. 8  2019-2020  $1,100,000",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/6f6e332c7637c02f4e72e494288a9f56.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2019-11-26",
  "first_reading": "2019-11-26",
  "gazette_date": null,
  "markdown": "HOUSE OF ASSEMBLY\nResolved that the sum of ONE MILLION, ONE HUNDRED THOUSAND DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2019-2020 as shown in the Supplementary Estimates No.8 2019-2020 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2019 — 2020 No.8\nHEAD Code Provision in Number Approved Estimates 2019 - 2020 Other Expenditure HEAD: 28 MINISTRY OF HOME AFFAIRS Program: 040 Direction and Policy Formulation Services Subprogram: 0241 National Council on 280400241 Substance Abuse Account Code: 316 — Grants to Public Institutions 1,100,000 Program: 201 Immigration Regulatory Services Subprogram: 0202 Immigration Department 282010202 Account Code: 102 — Other Personal 1,000,878 Emoluments\nProvision in Supplementary Supplementary Provision Estimates Required No. 1-7\nOther Other Expenditure Expenditure\n800,000\n300,000\nADDENDUM\nHead 28: Ministry of Home Affairs Programme 040: Direction and Policy Formulation Services Sub-programme 0241: National Council on Substance Abuse Account Code: 316 Grants to Public Institutions $800,000\nSupplementary provision of eight hundred thousand dollars ($800,000) is required to meet the remainder of the programming and operating costs of the Council until the end of the Financial Year.\nProgramme 201: Immigration Regulatory Services Sub-programme 0202: Immigration Department Account Code: 102 Other Personal Emoluments $300,000\nSupplementary funding of three hundred thousand ($300,000) is being requested to meet the cost of salaries and overtime until the end of the Financial Year 2019-2020.\n"
}