{
  "bill_id": 446,
  "slug": "companies-amendment-no-bill-2019-parliament",
  "title": "Companies (Amendment) (No.  ) Bill, 2019 (Parliament)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/d8903c00096af892aee97e993560a0f3.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-11-27",
  "first_reading": "2019-11-27",
  "gazette_date": null,
  "markdown": "2019-11-26\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Companies Act, Cap. 308 and provide for related\n\nmatters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nRepeal and replacement of section 15A of Cap. 308\n\nAmendment of section 105 of Cap. 308\n\nAmendment of section 170 of Cap. 308\n\nAmendment of section 339 of Cap. 308\n\nAmendment of section 362 of Cap. 308\n\nAmendment of section 370 of Cap. 308\n\nAmendment of section 371 of Cap. 308\n\nAmendment of section 372 of Cap. 308\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nAmendment of section 376 of Cap. 308\n\n11.\n\nAmendment of section 381 of Cap. 308\n\n12.\n\nRepeal and replacement of section 383 of Cap. 308\n\n13.\n\nInsertion of Part IVA into Cap. 308\n\n14.\n\nAmendment of section 407 of Cap. 308\n\n15.\n\nAmendment of section 412 of Cap. 308\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  amend  the  Companies  Act,  Cap.  308  and  provide  for  related\n\nmatters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n2019.\n\nThis  Act  may  be  cited  as  the  Companies  (Amendment)  (No.  )  Act,\n\nRepeal and replacement of section 15A of Cap. 308\n\n2.\nas the principal Act, is repealed and the following substituted:\n\nSection 15A of the Companies Act, Cap. 308, in this Act referred to\n\n“Annual return\n\n15A.(1)\ncompany to which section 343 applies, shall\n\nSubject to this section, every company except an external\n\n(a)\n\n(b)\n\nfile  with  the  Registrar  an  annual  return  in  the  manner  and\nform prescribed; and\n\nat the time of filing under paragraph (a) pay the prescribed\nfee.\n\n(2)\n\nA company where incorporated\n\n(a)\n\n(b)\n\nbetween 1st January and 30th June in any year shall file its\nannual return no later than 30th June;\n\nbetween 1st July and 31st December in any year shall file its\nannual return no later than 31st December\n\nin every succeeding year after incorporation.\n\nA company that is in default in complying with the requirements\n(3)\nof subsections (1) and (2) is liable to a penalty, not exceeding $3000,\nof $10 payable to the Registrar for every day during which the default\ncontinues and every director and officer of the company who knowingly\nand  wilfully  authorises  or  permits  the  default  is  also  liable  to  that\npenalty.\n\n\f5\n\n(4)\nPursuant to section 412, the Registrar may strike off the register\na  company  that  neglects  or  refuses  to  file  an  annual  return  required\nunder this section.\n\n(5)\nThe Registrar may issue guidelines or administrative directions\nfor the efficient administration of this section including directions in\nrespect of the submission of the annual return in electronic format.\n\nA director or an authorised officer of a company shall certify in\n(6)\nan annual return filed under subsection (1), that information related to\nshareholders and beneficial ownership is maintained at the registered\noffice of the company in accordance with section 170.\n\n(7)\n\nSubsection (1) does not apply to\n\n(a)\n\n(b)\n\n(c)\n\nan exempt insurance company;\n\nan international business company;\n\nan international society with restricted liability;\n\n(d)\n\nan international financial service entity;\n\n(e)\n\na private trust company;\n\n(f)\n\n(g)\n\n(h)\n\na foreign sales corporation;\n\nan entity that holds a valid foreign currency permit;\n\na company, the gross revenue of which, as shown in the most\nrecent financial statements referred to in section 147, exceed\n$1 000 000; and\n\n(i)\n\nsuch other entity as the Minister may by order designate.\n\nThe  exemption  specified  in  subsection  (7)  in  respect  of  a\n(8)\ncompany described in paragraph (h) of that subsection does not apply\nwhere the company is a service provider that holds a licence under the\nCorporate and Trust Service Providers Act, 2015 (Act 2015-12).\n\n\f6\n\nIn subsection (8),“service provider”has the meaning assigned to\n\n(9)\nit in section 392B.”.\n\nAmendment of section 105 of Cap. 308\n\n3.\n“15” and substituting the word “12”.\n\nSection 105(a) of the principal Act is amended by deleting the word\n\nAmendment of section 170 of Cap. 308\n\n4.\n\nSection 170 of the principal Act is amended by\n\n(a)\n\ndeleting subsection (2) and substituting the following:\n\n“(2)\n\nA company shall maintain a register of shareholders showing\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe name and the latest known address of each shareholder;\n\na statement of the shares held by each shareholder;\n\nthe date on which a person was entered on the register as a\nshareholder, and the date on which any person ceased to be\na shareholder; and\n\nan up to date and accurate record of the basic and beneficial\nownership\ncompany,  whether\ninformation  of\nincorporated or registered in Barbados.”; and\n\nthe\n\n(b)\n\ninserting after subsection (4), the following:\n\nThe registers referred to in subsections (2), (3) and (4) shall be\n\n“(5)\nmaintained at the registered office of the company.”.\n\nAmendment of section 339 of Cap. 308\n\n5.\n(1) and substituting the following:\n\nSection 339 of the principal Act is amended by deleting subsection\n\n\f7\n\n“(1)\nSubject to subsection (4), where the registration of an external\ncompany has been cancelled under section 338 or has ceased to be valid\nby virtue of section 342(3), the Registrar may revive the registration of\nthe external company where the company\n\n(a)\n\n(b)\n\nfiles with him such documents as he may require; and\n\npays  the  prescribed  fee  and  all  penalties  and  fees  due  in\nrespect  of  the  company  and  outstanding  at  the  time  of\ncancellation of its registration or cessation of the validity of\nits registration.”.\n\nAmendment of section 362 of Cap. 308\n\n6.\nsubsection (1), the following:\n\nSection  362  of  the  principal  Act  is  amended  by  inserting  after\n\nThe Registrar shall not approve an application for the revival of\n“(1A)\na company unless all penalties and fees due in respect of the company\nand outstanding at the time of its dissolution have been paid.”.\n\nAmendment of section 370 of Cap. 308\n\n7.\n(2) and substituting the following:\n\nSection 370 of the principal Act is amended by deleting subsection\n\nThe articles of dissolution in the prescribed form shall be sent to\n\n“(2)\nthe Registrar accompanied by\n\n(a)\n\ncertificates of clearance indicating that the company has paid\nall  the  taxes  and  contributions  required  by  any  enactment;\nand\n\n\f8\n\n(b)\n\nthe name and address of the person appointed by the company\nto take custody of the documents and records of the company\nupon its dissolution.”.\n\nAmendment of section 371 of Cap. 308\n\n8.\nsubsection (3), the following:\n\nSection  371  of  the  principal  Act  is  amended  by  inserting  after\n\n“(3A)\nNotwithstanding subsections (1), (2) and (3), the Registrar shall\nnot  dissolve  a  company  unless  the  Registrar  has  applied  for  and\nobtained  from  the  court  an  order  directing  such  person  as  the  court\nthinks  fit  to  take  custody  of  the  documents  and  records  of  the\ncompany.”.\n\nAmendment of section 372 of Cap. 308\n\n9.\nsubsection (3), the following:\n\nSection  372  of  the  principal  Act  is  amended  by  inserting  after\n\n“(3A)\nWhere  the  court  makes  an  order  to  dissolve  the  company,  the\ncourt must also make an order directing such person as the court thinks\nfit to take custody of the documents and records of the company.”.\n\nAmendment of section 376 of Cap. 308\n\n10.\n(i) and substituting the following:\n\nSection 376 of the principal Act is amended by deleting paragraph\n\n“(i)\n\nan order directing such person as the court thinks fit to take\ncustody of the documents and records of the company;”.\n\n\f9\n\nAmendment of section 381 of Cap. 308\n\n11.\n(b) and substituting the following:\n\nSection 381(4) of the principal Act is amended by deleting paragraph\n\n“(b)\n\ndirecting such person as the court thinks fit to take custody\nof the documents and records of the company;”.\n\nRepeal and replacement of section 383 of Cap. 308\n\n12.\nsubstituted:\n\nSection  383  of  the  principal  Act  is  deleted  and  the  following\n\n“Record custody\n\n383.\nAny person who has taken or has been granted custody of\nthe documents and records of a dissolved company under this Division\nremains liable to keep those documents and records in Barbados for 6\nyears following the date of the company's dissolution and to produce\nthem where so required.”.\n\nInsertion of Part IVA into Cap. 308\n\n13.\nfollowing:\n\nThe  principal  Act  is  amended  by  inserting  after  Part  IV,  the\n\n\f10\n\n“PART IVA\n\nCOMPANIES REQUIRING SERVICE PROVIDERS\n\nCertain companies required to have service provider\n\nThe following companies shall have its corporate services\n392A.(1)\nperformed by a service provider who holds a licence issued under the\nCorporate and Trust Service Providers Act, 2015 (Act 2015-12):\n\n(a)\n\nany company described in section 15A(7)(h) that\n\n(i)\n\n(ii)\n\n(iii)\n\ndoes not hold a licence under the Financial Institutions\nAct, Cap. 324A;\n\nis  not  registered  or  licensed  under  the  Financial\nServices Commission Act, 2010 (Act 2010-21); and\n\nis  not  itself  a  service  provider  who  holds  a  licence\nissued under the Corporate and Trust Service Providers\nAct, 2015 (Act 2015-12); and\n\n(b)\n\nany external company that does not hold a licence under the\nFinancial Institutions Act, Cap. 324A and is not registered or\nlicensed  under  the  Financial  Services  Commission  Act,\n2010 (Act 2010-21).\n\n(2)\n\nSubsection (1) takes effect in respect of\n\n(a)\n\na company described in subsection (1)(a), within 180 days of\n\n(i)\n\n(ii)\n\nthe  commencement  of  the  Companies  (Amendment)\n(No. ) Act, 2019 (Act 2019 - ); or\n\nthe  company  becoming  a  company  described  in\nsubsection (1)(a),\n\nwhichever is later; and\n\n\f11\n\n(b)\n\nan external company described in subsection (1)(b)\n\n(i)\n\nupon  registration  of  the  company  as  an  external\ncompany,  where  such  registration  occurs  after  the\ncommencement of the Companies (Amendment) (No. )\nAct, 2019 (Act 2019 - );\n\n(ii)\n\nwithin 180 days of the commencement of the Companies\n(Amendment) (No. ) Act, 2019 (Act 2019 - ).\n\nInterpretation of Part IVA\n\n392B.\n\nIn this Part,\n\n“corporate service” has the meaning assigned to it by section 2 of the\nCorporate and Trust Service Providers Act, 2015 (Act 2015-12);\n\n“service provider” has the meaning assigned to it by section 2 of the\n2015\n\nService  Providers  Act,\n\nand  Trust\n\nCorporate\n(Act 2015-12). ”.\n\nAmendment of section 407 of Cap. 308\n\n14.\nsubsection (3), the following:\n\nSection  407  of  the  principal  Act  is  amended  by  inserting  after\n\n“(3)\nNotwithstanding  subsections  (2)  and  (3),  the  Registrar  may\nrequire any document required or sent to him pursuant to this Act, that\nis signed outside Barbados, to be verified on oath before\n\n(a)\n\n(b)\n\n(c)\n\na diplomatic or consular representative for Barbados;\n\na judge of a superior court of record;\n\na mayor of any city;\n\n(d)\n\na notary public; or\n\n\f12\n\n(e)\n\nsuch  other  person  as  appears  to  the  Registrar  to  be\nempowered to administer such oaths.”.\n\nAmendment of section 412 of Cap. 308\n\n15.\n(5) and substituting the following:\n\nSection 412 of the principal Act is amended by deleting subsection\n\nWhere  a  company  or  other  body  corporate  is  struck  off  the\n\n“(5)\nregister, the Registrar may, upon\n\n(a)\n\n(b)\n\nreceipt of an application in the prescribed form; and\n\npayment of the prescribed fee and all penalties and fees due\nin respect of the company and outstanding at the time that it\nwas struck off the register,\n\nrestore  the  company  to  the  register  and  issue  a  certificate  in  a  form\nadapted to the circumstances.”.\n\n\f13\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}