{
  "bill_id": 447,
  "slug": "companies-economic-substance-bill-2019-parliament",
  "title": "Companies (Economic Substance) Bill, 2019 (Parliament)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/c9c9d8ec082d93bb3c2ca0daa6223e44.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-11-27",
  "first_reading": "2019-11-27",
  "gazette_date": null,
  "markdown": "2019-11-26\n\nBill as amended\n\nOBJECTS AND REASONS\n\nThis Bill would provide for\n\n(a)\n\n(b)\n\nthe imposition of an economic substance test on companies carrying\non business in Barbados;\n\nthe determination of whether the test is met by assessing the extent of\nrelevant  activities  carried  out  by  such  companies  and  taking\nappropriate enforcement action; and\n\n(c)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nRelevant activity\n\nCore income-generating activities\n\nRequirement to meet economic substance test\n\nAssessment of whether economic substance test is met\n\nFailure to provide evidence of tax residence outside Barbados\n\nRequirement to provide information\n\nExchange of information to competent authority\n\n10.\n\nPenalty where the economic substance test is not met\n\n11.\n\nPenalty for failure to provide information or for inaccurate information\n\n12.\n\nImposition of penalty for failure to provide information or for inaccurate\ninformation\n\n13.\n\nRight of appeal against penalty\n\n14.\n\nEnforcement of penalty\n\n\f3\n\n15.\n\nConfidentiality\n\n16.\n\nPower to enter business premises and examine business documents\n\n17.\n\nObstructing an authorised person\n\n18.\n\nRegulations\n\n19.\n\nRepeal\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  provide  for  the  imposition  of  an  economic  substance  test  on\n\ncompanies carrying on business in Barbados and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n2019.\n\nThis Act may be cited as the Companies (Economic Substance) Act,\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“authorised person” means the Director or any person authorised by the Director\n\nto perform functions under section 16;\n\n“banking  business”  means  the  business  of  providing  financial  services  by  a\ncompany licenced under the Financial Institutions Act, Cap. 324A;\n\n“Barbados competent authority” means the Barbados Revenue Authority;\n\n“business premises” means premises used in connection with the carrying on of\n\na business, trade, profession or vocation;\n\n“company” has the meaning assigned to it by the Income Tax Act, Cap. 73;\n\n“core income-generating activities” means activities set out in section 4;\n\n“deposit-taking  business”  has  the  meaning  assigned  to  it  by  the  Financial\n\nInstitutions Act, Cap. 324A;\n\n“Director” means the Director of International Business;\n\n“distribution and service centre business” means the business of\n\n(a)\n\npurchasing from a related party outside Barbados\n\n(i)\n\ncomponent parts or materials for goods; or\n\n(ii)\n\ngoods ready for sale;\n\nand reselling such component parts, materials or goods outside Barbados;\n\n(b)\n\nproviding services to a related party outside Barbados in connection\nwith the business,\n\n\f7\n\nbut  does  not  include  any  activity  included  in  any  other  relevant  activity\nexcept holding company business;\n\n“finance and leasing business” means the business of providing credit facilities\nfor any kind of consideration and undertaking the leasing of assets but does\nnot include leasing of land or an interest in land, banking business, fund\nmanagement business or insurance business;\n\n“financial services” means services of a financial nature and includes:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nthe acceptance of deposits and other repayable funds from the public;\n\nlending  of  all  types,  including  consumer  credit,  mortgage  credit,\nfactoring and financing of commercial transactions;\n\nfinancial leasing;\n\nthe  provision  of  all  payment  and  money  transmission  services,\nincluding credit cards, charge cards and debit cards, travellers cheques\nand bankers drafts;\n\nthe  provision  of  guarantees  and  commitments,  including  letters  of\ncredit;\n\nengaging in trading for own account or for the account of customers,\nwhether on an exchange, in an over-the-counter market or otherwise\nin the following:\n\n(i)\n\nmoney market instruments, such as cheques, bills, certificates of\ndeposit;\n\n(ii)\n\nforeign exchange;\n\n(iii)\n\n(iv)\n\nderivative  products,  including  but  not  limited  to  futures  and\noptions;\n\nexchange rate and interest rate instruments, including products\nsuch as swaps and forward rate agreements;\n\n(v)\n\ntransferable securities; and\n\n\f8\n\n(vi)\n\nother  negotiable  instruments  and  financial  assets,  including\nbullion,\n\n(g)\n\nparticipation in issues of all kinds of securities, including underwriting\nand  placement  as  agent,  whether  publicly  or  privately,  and  the\nprovision of services related to such issues;\n\n(h)\n\nthe provision of money broking services;\n\n(i)\n\n(j)\n\n(k)\n\n(l)\n\nengaging in asset management, such as cash or portfolio management,\nall  forms  of  collective  investment  management,  pension  fund\nmanagement, custodial depository and trust services;\n\nthe provision of settlement and clearing services for financial assets,\nincluding  securities,  derivative  products,  and  other  negotiable\ninstruments;\n\nthe provision of transfer of financial information, and financial data\nprocessing and related software by suppliers of other financial services;\n\nthe provision of advisory, intermediation and other auxiliary financial\nservices on all activities listed above, including credit reference and\nanalysis,  investment  and  portfolio  research  and  advice,  advice  on\nacquisitions and on corporate restructuring and strategy;\n\n“fiscal period” has the meaning assigned to it by the Income Tax Act, Cap. 73;\n\n“foreign competent authority” in respect of a country other than Barbados, means\nthe authority designated in or for the purposes of an approved obligation\nowed by Barbados to another country;\n\n“fund management business” means a business which derives income from the\ndiscretionary  management  of  pooled  securities  or  other  assets  held  in  a\ncollective investment arrangement;\n\n“Guidelines” mean guidance notes issued from time to time by the Director with\n\nrespect to the application and interpretation of this Act;\n\n\f9\n\n“headquarters business” means the business of providing in Barbados any of the\nfollowing services to one or more related parties outside of Barbados:\n\n(a)\n\n(b)\n\n(c)\n\nthe provision of senior management;\n\nthe assumption or control of material risk for activities carried out by,\nor assets owned by, any of those related parties;\n\nthe provision of substantive advice in connection with the assumption\nor control of risk referred to in paragraph (b),\n\nbut does not include anything falling within the definition of financing and\nleasing  business,  intellectual  property  business,  insurance  business,  or\nbanking business;\n\n“high  risk  intellectual  property  company”  means  a  resident  company  which\n\ncarries on an intellectual property business and\n\n(a)\n\nacquired the intellectual property asset\n\n(i)\n\nfrom a related party; or\n\n(ii)\n\nin consideration for funding research and development by another\nperson situate in a country or territory other than Barbados; and\n\n(b)\n\nlicenses the intellectual property asset to one or more related parties or\notherwise  generates  income  from  the  asset  in  consequence  of\nactivities, such as facilitating sale agreements, performed by related\nparties outside of Barbados;\n\n“holding company  business” means the business of establishing or acquiring\nentities and administering the holdings of the group that company controls;\n\n“insurance  business”  has  the  meaning  assigned  to  it  by  the  Insurance  Act,\n\nCap. 310;\n\n“intellectual property asset” means\n\n(a)\n\npatents  and  assets  that  share  the  same  features  of  patents  including\nresearch and development;\n\n\f10\n\n(b)\n\nmarketable intangibles such as trademarks and similar assets;\n\n“intellectual  property  business”  means  the  business  of  holding,  exploiting  or\n\nreceiving income for intellectual property assets;\n\n“Minister” means the Minister responsible for International Business;\n\n“MN Group” means any group that includes two or more companies for which\nthe tax residence is in different jurisdictions or includes a company that is\nresident for tax purposes in one jurisdiction and is subject to tax with respect\nto the business carried out through a permanent establishment in another\njurisdiction;\n\n“Registrar”  means  the  Registrar  of  Companies  within  the  meaning  of  the\n\nCompanies Act, Cap. 308;\n\n“related  party”  means  an  affiliate  or  associate  within  the  meaning  of  the\n\nCompanies Act, Cap. 308;\n\n“relevant activity” has the meaning assigned by section 3;\n\n“resident company” for the purposes of this Act means\n\n(a)\n\n(b)\n\na  company,  whether  incorporated  in  Barbados  or  elsewhere,  or  a\nsociety with restricted liability organised in Barbados, or an association\nformed in Barbados, other than an association of underwriters, which\nis managed and controlled in Barbados; or\n\na  company  incorporated  outside  Barbados,  that  is  registered  in\nBarbados as an external company that is not regarded as a tax resident\ncompany in the jurisdiction of incorporation; or\n\n(c)\n\na company incorporated in Barbados as an entity but which is not tax\nresident in any other jurisdiction;\n\n“service provider” has the meaning assigned to it by the Corporate and Trust\n\nService Providers Act, 2015 (Act 2015-12);\n\n\f11\n\n“shipping business” means any of the following activities involving the operation\nof  a  ship  anywhere  in  the  world,  other  than  solely  within  the  Exclusive\nEconomic Zone of Barbados\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe business of transporting by sea person, animals, goods or mail;\n\nthe hiring or chartering of ships for the purpose set out in paragraph\n(a);\n\nthe sale of travel tickets or equivalent and ancillary services connected\nwith the operation of a ship;\n\nthe use, maintenance or hire of containers, including trailers and other\nvehicles  or  equipment  for  the  transport  of  containers  used  for  the\ntransport of anything by sea; and\n\n(e)\n\nthe management of the crew of the ship;\n\n“single purpose equity holding company” means a resident company that only\nholds equity participations in other entities and only earns dividends and\ncapital gains;\n\n“society” means a society with restricted liability organised under the Societies\n\nWith Restricted Liability Act, Cap. 318B.\n\nRelevant activity\n\n3.\n\nFor the purpose of this Act any of the following is a relevant activity:\n\n(a)\n\n(b)\n\n(c)\n\nbanking business;\n\ninsurance business;\n\nfund management business;\n\n(d)\n\nfinance and leasing business;\n\n(e)\n\nheadquarters business;\n\n(f)\n\nshipping business;\n\n(g)\n\nholding company business;\n\n\f12\n\n(h)\n\nintellectual property business;\n\n(i)\n\n(j)\n\ndistribution and service centre business; and\n\nsuch other activities as the Minister may by order prescribe.\n\nCore income-generating activities\n\n4.\nactivities\n\nCore  income-generating  activities,  include  the  following  relevant\n\n(a)\n\nin respect of banking business,\n\n(i)\n\nraising funds, and managing risk, including credit risk, currency\nrisk and interest risk;\n\n(ii)\n\ntaking hedging positions;\n\n(iii)\n\nproviding loans, credit or other financial services to customers;\n\n(iv)\n\n(v)\n\nmanaging capital and preparing reports and returns to the Central\nBank of Barbados;\n\nany  other  financial  services  activity  carried  on  by  a  regulated\nfinancial  institution  which  is  similar  to  any  of  the  activities\ndescribed in this paragraph;\n\n(b)\n\nin respect of distribution and service centre business,\n\n(i)\n\ntransporting and storing goods, components and materials;\n\n(ii)\n\nmanaging stocks;\n\n(iii)\n\ntaking orders;\n\n(iv)\n\nproviding consulting or other administrative services;\n\n(c)\n\nin respect of finance and leasing business,\n\n(i)\n\n(ii)\n\nagreeing funding terms;\n\nidentifying  and  acquiring  assets  to  be  leased,  in  the  case  of\nleasing;\n\n\f13\n\n(iii)\n\nsetting the terms and duration of any financing or leasing;\n\n(iv)\n\nmonitoring and revising any agreements;\n\n(v)\n\nmanaging any risks;\n\n(d)\n\nin respect of fund management business,\n\n(i)\n\ntaking decisions on the holding and selling of investments;\n\n(ii)\n\ncalculating risk and reserves;\n\n(iii)\n\n(iv)\n\ntaking decisions on currency or interest fluctuations and hedging\npositions;\n\npreparing reports and returns for submission to investors and to\nthe Financial Services Commission;\n\n(e)\n\nin respect of headquarters business;\n\n(i)\n\ntaking relevant management decisions;\n\n(ii)\n\nincurring expenditures on behalf of group entities;\n\n(iii)\n\nco-ordinating group activities;\n\n(f)\n\nin respect of holding company business, all activities related to that\nbusiness;\n\n(g)\n\nin respect of insurance business,\n\n(i)\n\npredicting or calculating risk;\n\n(ii)\n\ninsuring or re-insuring against risk;\n\n(iii)\n\nproviding insurance business services to clients;\n\n(h)\n\nin respect of intellectual property business conducted by a company\nthat is not a high-risk intellectual property company\n\n(i)\n\nin the case of a business exploiting patent assets and assets that\nshare similar features of a patent, research and development;\n\n\f14\n\n(ii)\n\nin the case of a business exploiting assets which are marketing\nintangibles  such  as  trademarks,  marketing,  branding  and\ndistribution;\n\n(iii)\n\nin all other cases, other core income generating activities relevant\nto the creation of the income, which could include:\n\n(A)\n\n(B)\n\ntaking the strategic decisions and managing and bearing the\nprincipal risks relating to the development and subsequent\nexploitation  of  the  intangible  intellectual  property  asset\ngenerating income;\n\ntaking the strategic decisions and managing and bearing the\nprincipal  risks  relating  to  acquisition  by  third  parties  and\nsubsequent  exploitation  of\nintellectual\nproperty asset; or\n\nintangible\n\nthe\n\n(C)\n\ncarrying on the underlying trading activities through which\nthe intangible intellectual property assets are exploited, and\nwhich lead to the generation of revenue from third parties;\n\n(i)\n\nin respect of shipping business;\n\n(i)\n\nmanaging  crew,  including  hiring,  paying  and  overseeing  crew\nmembers;\n\n(ii)\n\noverhauling and maintaining ships;\n\n(iii)\n\noverseeing and tracking deliveries;\n\n(iv)\n\ndetermining what goods to order and when to deliver them;\n\n(v)\n\norganising and overseeing voyages;\n\nRequirement to meet economic substance test\n\n5.(1)\nA resident company which derives income from the carrying on of a\nrelevant  activity  must  satisfy  the  economic  substance  test  in  relation  to  that\nrelevant activity.\n\n\f15\n\n(2)\nA  resident  company  meets  the  economic  substance  test  in  relation  to  a\nrelevant activity carried on by the company where it conducts its core income\ngenerating  activities  in  Barbados,  and  the  company  is  directed,  managed  and\ncontrolled in Barbados in relation to that activity.\n\nA  resident  company  conducts  its  core  income  generating  activities  in\n(3)\nBarbados in circumstances where, having regard to the level of income derived\nfrom the relevant activity carried on,\n\n(a)\n\n(b)\n\nthere is an adequate number of qualified full-time employees in relation\nto that activity in Barbados;\n\nthere is an adequate number of employees who are physically present\nin Barbados in relation to that activity;\n\n(c)\n\nthere is adequate operating expenditure incurred in Barbados; and\n\n(d)\n\nthere are adequate physical assets in Barbados.\n\nA resident company may satisfy the economic substance test in relation to\n(4)\na  relevant  activity  if  its  core-income  generating  activities  in  relation  to  that\nrelevant activity are conducted by any other person in Barbados and the resident\ncompany  is  able  to  monitor  and  control  the  carrying  out  of  the  core  income\ngenerating activities by that other person.\n\n(5)\n\nThe test in subsection (2) is satisfied where\n\n(a)\n\n(b)\n\n(c)\n\nthe board of directors of the company hold meetings in Barbados at an\nadequate frequency having regard to the amount of decision-making\nrequired  at  that  level  and  there  is  a  quorum  of  directors  physically\npresent;\n\nthe minutes of the board meetings referred to in paragraph (a) record\nthe making of strategic decisions of the company at the meeting;\n\nthe  directors  of  the  company  have  the  necessary  knowledge  and\nexpertise to discharge the duties of the board; and\n\n\f16\n\n(d)\n\nthe minutes of all board meetings and the records of the company are\nkept in Barbados.\n\n(6)\nA resident company that is a single purpose equity holding company is\nsubject to a reduced economic substance test which is satisfied if the resident\ncompany\n\n(a)\n\n(b)\n\ncomplies with all applicable filing requirements under the Companies\nAct, Cap. 308, Societies with Restricted Liabilities Act, Cap. 318B, and\nthe Income Tax Act, Cap. 73;\n\nhas  adequate  human  resources  and  adequate  physical  assets  in\nBarbados  for  holding  and  managing  equity  participations  in  other\nentities; and\n\n(c)\n\nsubmits confirmation of its compliance with paragraphs (a) and (b) to\nthe Director in the prescribed manner.\n\nA resident company which is controlled by residents of Barbados, that is\n(7)\nnot part of an MN group and which carries on a relevant activity exclusively in\nBarbados and derives income solely from such relevant activity, is subject to a\nreduced economic substance test which is satisfied where the resident company\nhas adequate human resources and adequate physical assets in Barbados.\n\nA resident company that is carrying on a relevant activity shall satisfy the\n\n(8)\neconomic substance test from the date prescribed in the Guidelines.\n\nIn determining whether a person has complied with subsections (4) and\n(9)\n(5),  the  Director  shall  consider  whether  a  resident  company,  to  which  those\nsubsections apply, has followed the relevant Guidelines.\n\nSubject to section 18, the Director shall publish all Guidelines in any other\n(10)\nmanner which the Director considers will bring it to the attention of those most\nlikely to be affected by it.\n\n(11)\n\nFor the purposes of subsection (7) “resident of Barbados” means:\n\n(a)\n\nin the case of an individual, a person who satisfies subsections (5), (6)\nand (7) of section 85 of the Income Tax Act, Cap. 73; and\n\n\f17\n\n(b)\n\nin the case of a company, a company which is managed and controlled\nin Barbados.\n\nAssessment of whether economic substance test is met\n\n6.(1)\nThe Director may determine that a resident company has not met the\neconomic substance test during any fiscal period beginning on the date prescribed\nin  the  regulations  from  which  the  resident  company  commences  the  relevant\nactivity.\n\nA determination referred to in subsection (1) must be made no later than\n\n(2)\n4 years after the date of filing of the economic substance declaration.\n\nSubsections (1) and (2) do not apply where the Director is unable to make\n(3)\na determination within the 3 years after the economic substance declaration has\nbeen provided by reason of any deliberate misrepresentation, or fraudulent action\nby the resident company or by any other person.\n\nIn relation to a high risk intellectual property company, the Director must\n(4)\ndetermine that the economic substance test was not met during a fiscal period\nunless the high risk intellectual property company provides sufficient information\nto satisfy the Director that the test was met.\n\nFor the purposes of subsection (4), sufficient information is information\n(5)\nwhich demonstrates that the high risk intellectual property company exercises a\nhigh  degree  of  control  over  the  development,  exploitation,  maintenance,\nenhancement and protection of the intellectual property asset, which high degree\nof control has historically been and is exercised by suitably qualified employees\nof the high risk intellectual property company who are physically present and\nperform their functions within Barbados.\n\nFailure to provide evidence of tax residence outside Barbados\n\n7.(1)\nWhere  a  company  incorporated  in  Barbados  is  managed  and\ncontrolled outside Barbados, the company shall be subject to the provisions of\nthis Act unless it satisfies the Director that it is tax resident outside Barbados.\n\n\f18\n\n(2)\nWhere a company incorporated outside Barbados is registered in Barbados\nas an external company it shall be subject to the provisions of this Act unless it\nsatisfies the Director that it is tax resident outside Barbados.\n\nRequirement to provide information\n\n8.(1)\nannually in the prescribed form on or before the date stated in the Guidelines.\n\nA  resident  company  shall  file  an  economic  substance  declaration\n\nThe  Director  may  serve  notice  on  any  person  requiring  that  person  to\n(2)\nprovide within the period, and at the place specified in the notice, such additional\ndocuments and information as the Director may require for the purpose of the\nexercise of his functions under this Act.\n\nThe economic substance declaration and any additional documents shall\n(3)\nby filed by an officer of the company designated to handle all matters related to\nsubstance, a corporate and trust service provider or any other appointed officer.\n\nExchange of information to competent authority\n\nSubject to subsection (2), where the Director determines under section\n9.(1)\n6 that a resident company has not met the economic substance test for a fiscal\nperiod,  the  Director  shall  provide  to  the  Barbados  competent  authority  the\ninformation filed pursuant to section 8 relating to that resident company for the\nrelevant period.\n\nWhere the Barbados competent authority receives information from the\n(2)\nDirector  under  subsection  (1)  relating  to  a  resident  company,  the  Barbados\ncompetent authority shall, in accordance with any law or international agreement\nrelating to exchange of information, exchange relevant information for each fiscal\nperiod of the resident company commencing on or after 1st January, 2019 to the\nforeign competent authority of the country\n\n(a)\n\nin which\n\n(i)\n\nthe holding company;\n\n(ii)\n\nthe ultimate holding company of the resident company; and\n\n\f19\n\n(iii)\n\nthe ultimate beneficial owner,\n\nof the resident company, is resident;\n\n(b)\n\nwhere  the  resident  company  is  incorporated  outside  Barbados,  the\nBarbados  competent  authority  shall  forward  the  information  to  the\nforeign competent authority of the country or territory in which\n\n(i)\n\nthe holding company;\n\n(ii)\n\nthe ultimate holding company of the resident company; and\n\n(iii)\n\nthe ultimate beneficial owner,\n\nof the resident company, is resident.\n\nIn  respect  of  a  high  risk  intellectual  property  company  regardless  of\n(3)\nwhether or not the Director has made a determination under section 6 in respect\nof  it,  the  Director  shall  provide  to  the  Barbados  competent  authority  the\ninformation filed pursuant to section 8 relating to that resident company for the\nrelevant period.\n\nWhere the Barbados competent authority receives information from the\n(4)\nDirector  under  subsection  (4)  relating  to  a  resident  company,  the  Barbados\ncompetent authority shall, in accordance with any law or international agreement\nrelating  to  the  exchange  of  information,  exchange  full  details  for  each  fiscal\nperiod of the resident company commencing on or after 1st January 2019\n\n(a)\n\nto the foreign competent authority of the country in which\n\n(i)\n\na holding company;\n\n(ii)\n\nthe ultimate holding company of the resident company; and\n\n(iii)\n\nan ultimate beneficial owner,\n\nof the resident company, is resident;\n\n(b)\n\nwhere  the  high  risk  intellectual  property  company  is  incorporated\noutside Barbados, the Barbados competent authority shall forward the\n\n\f20\n\ninformation  to  the  foreign  competent  authority  of  the  country  or\nterritory in which the company is resident.\n\nWhere the Barbados competent authority receives information from the\n(5)\nDirector under section 8, the Barbados competent authority shall in accordance\nwith  any  law  or  international  agreement  relating  to  exchange  of  information,\nexchange  full  details  for  each  fiscal  period  of  a  company  under  section  8\ncommencing on or after 1st January, 2019 to the foreign competent authority of\nthe country\n\n(a)\n\n(b)\n\nin which the company under section 8 claims to be tax resident; or\n\nin which\n\n(i)\n\na holding company;\n\n(ii)\n\nthe ultimate holding company of the resident company; and\n\n(iii)\n\nan ultimate beneficial owner,\n\nof the company, is resident.\n\nPenalty where the economic substance test is not met\n\n10.(1)\nWhere  the  Director  determines  under  section  6  that  a  resident\ncompany has failed to meet the economic substance test for a fiscal period, the\nDirector shall within 21 days of the date of that determination issue a notice to\nthe company notifying it\n\n(a)\n\nthat he has determined that the resident company does not meet the\neconomic substance test for that year;\n\n(b)\n\nof the reasons for the determination;\n\n(c)\n\n(d)\n\nof  the  amount  of  penalty  imposed  on  the  resident  company  under\nsubsection (5);\n\nof the date from which the penalty under subsection (5) is due, being\nnot less than 28 days after the issue of the notice;\n\n\f21\n\n(e)\n\nof what action he considers should be taken by the resident company\nto meet the economic substance test; and\n\n(f)\n\nof the resident company's right of appeal under section 13.\n\n(2)\nWhere  the  Director  pursuant  to  subsection  (1)  has  determined  that  a\nresident company did not meet the economic substance test on account of failure\nto have an adequate number of employees who are physically present in Barbados\nin relation to that relevant activity, depending on the nature of the breach, the\nDirector may issue a notice to the resident company notifying it\n\n(a)\n\nthat he has determined that the resident company does not meet the\neconomic substance test for that year; and\n\n(b)\n\nof the reasons for that determination.\n\nThe resident company shall no later than 12 months from the date of the\n(3)\nnotice issued under subsection (1), rectify the breach and advise the Director of\nthe rectification no later than the last day of the 12 months from the date of the\nnotice.\n\nWhere  the  resident  company  fails  to  rectify  the  breach  referred  to  in\n(4)\nsubsection (3) within the time given in the notice issued pursuant to subsection\n(1), the Director shall issue a second notice to the resident company notifying it\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthat it failed to remedy the breach for which the first notice was issued;\n\nof  the  amount  of  penalty  imposed  on  the  resident  company  under\nsubsection  (5)  in  addition  to  the  penalty  previously  imposed  under\nsubsection (1);\n\nof the date from which the penalty under subsection (5) is due, being\nnot less than 30 days after the issue of the notice;\n\nthat the Director may within 2 days make a report to the Minister under\nthis subsection; and\n\nof what action the Director considers should be taken by the resident\ncompany to meet the economic substance test.\n\n\f22\n\n(5)\nFor  the  purpose  of  this  section,  the  Director  may  impose  a  penalty  not\nexceeding $300 000 in any subsequent year payable within 30 days of the date\nof notice of the imposition of the penalty.\n\n(6)\nWhere, for the fiscal period following a fiscal period in which a notice was\nissued  under  subsection  (1),  hereinafter  called  the  “further  fiscal  period\",  the\nDirector determines that the resident company has failed to meet the economic\nsubstance test, he shall issue a further notice to the resident company notifying\nit\n\n(a)\n\nthat the Director has determined that the resident company does not\nmeet the economic substance test for the further fiscal period;\n\n(b)\n\nof the reasons for the determination;\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nof  the  amount  of  penalty  imposed  on  the  resident  company  under\nsubsection  (2)  in  addition  to  the  penalty  previously  imposed  under\nsubsection (1);\n\nof the date from which the penalty under subsection (4) is due, being\nnot less than 30 days after the issue of the notice;\n\nthat the Director may within 2 days make a report to the Minister under\nsubsection (4);\n\nof what action the Director considers should be taken by the resident\ncompany to meet the economic substance test; and\n\n(g)\n\nof the resident company’s right of appeal under section 13.\n\nFollowing  the  issue  of  a  notice  under  subsection  (4),  the  Director  shall\n(7)\nprovide the Minister with a report of the matters referred to in that notice together\nwith any additional information, whether or not such additional information was\nprovided to the Director under section 8.\n\nThe Director shall notify the Registrar of any failure after two consecutive\n(8)\nyears. The Registrar may issue an order that the company be struck off the register\nof companies under section 412 of the Companies Act, Cap. 308.\n\n\f23\n\nPenalty for failure to provide information or for inaccurate\ninformation\n\n11.(1)\nprovide the information required under section 8.\n\nA person is liable to a penalty of $10 000 where that person fails to\n\n(2)\n\nA person is liable to a penalty of $10 000 where\n\n(a)\n\nin complying with a requirement under section 8 that person provides\ninaccurate information; and\n\n(b)\n\ncondition A or B set out in subsections (3) and (4), respectively is met.\n\nCondition A is that the person referred to in subsection (2) knows of the\n(3)\ninaccuracy  at  the  time  when  information  is  provided  but  does  not  inform  the\nDirector at that time.\n\n(4)\n\nCondition B is that the person\n\n(a)\n\ndiscovers  the  inaccuracy  after  the  information  was  provided  to  the\nDirector; and\n\n(b)\n\nfails to take reasonable steps to inform the Director.\n\n(5)\n\nA person is not liable to a penalty under this section where\n\n(a)\n\n(b)\n\nthat person satisfies the Director; or\n\non an appeal under section 13, satisfies a judge in chambers\n\nthat there is a reasonable excuse for the failure.\n\nWhere a person has a reasonable excuse for failure to provide information\n(6)\nin accordance with subsection (1), but the excuse is no longer valid that person\nmay be allowed to provide the information within a reasonable time after the\nexcuse becomes invalid without the imposition of a penalty.\n\nA penalty for failure to provide accurate information may only be imposed\n(7)\nwithin 12 months commencing on the date on which the inaccuracy first came to\nthe attention of the Director.\n\n\f24\n\nImposition of penalty for failure to provide information or for\ninaccurate information\n\n12.(1)\nmay determine the amount of penalty and impose it on that person.\n\nWhere a person is liable to a penalty under section 10 the Director\n\n(2)\n\nWhere the Director imposes a penalty, he must notify the person\n\n(a)\n\n(b)\n\nof the reasons for imposing the penalty;\n\nthe date on which the penalty is due, being not less than 28 days after\nthe issue of the notice; and\n\n(c)\n\nof the person's right of appeal under section 13.\n\nA penalty under this section may only be imposed within a period of 6\n(3)\nyears  commencing  on  the  date  on  which  the  person  became  liable  to  pay  the\npenalty.\n\nRight of appeal against penalty\n\n13.(1)\n\nA person upon whom a penalty is imposed by the Director may\n\n(a)\n\n(b)\n\nappeal on the ground that liability to that penalty does not arise; or\n\nappeal against the amount of the penalty.\n\nAn  appeal  under  subsection  (1)  shall  lie  to  a  judge  in  chambers  whose\n\n(2)\ndecision shall be final.\n\nEnforcement of penalty\n\n14.(1)\nmentioned in subsection (2);\n\nA penalty under this Act shall be paid within 30 days after the date\n\n(2)\n\nThe date referred to in subsection (1) is the later of\n\n(a)\n\nthe date from which the penalty is due under section 10(1)(d) or (3)(b);\nor\n\n\f25\n\n(b)\n\nwhere notice of appeal is given under section 13, the date on which the\nappeal is finally determined or withdrawn.\n\n(3)\nA penalty under this Act is a debt due to the Crown and is recoverable in\nthe Magistrate’s Court for District A, notwithstanding that the amount exceeds\nthe monetary limit of the jurisdiction of the Magistrate fixed by the Magistrate’s\nCourt Act, Cap. 116.\n\nConfidentiality\n\nThe  Director’s  power  to  disclose  information  under  section  8  has\n15.(1)\neffect  despite  any  obligation  as  to  confidentiality  or  other  restriction  on  the\ndisclosure of information imposed by statute, contract or otherwise.\n\n(2)\n\nDisclosure of information under this Act does not breach\n\n(a)\n\n(b)\n\nany  obligation  of  confidentiality  in  relation  to  the  information  so\ndisclosed; or\n\nany other restriction on the access to or disclosure of the information\nso accessed.\n\nPower to enter business premises and examine business documents\n\n16.(1)\ndocument that is located on business premises.\n\nAn authorised person may examine and take copies of any business\n\nThe power under subsection (1) may be exercised only for the purpose of\n\n(2)\ninvestigating any issue relating to compliance with any provision of this Act.\n\nAn authorised person may at any reasonable time enter business premises\n\n(3)\nfor the purpose of exercising the power under subsection (1).\n\nAn authorised person may by notice require any person to produce any\n(4)\nspecified  business  document  at  the  business  premises  where  the  business\ndocument is located for the purpose of enabling the authorised person to exercise\nthe power under subsection (1) in relation to that document.\n\n\f26\n\nObstructing an authorised person\n\n17.(1)\n\nA person who, without reasonable excuse,\n\n(a)\n\n(b)\n\nobstructs  an  authorised  person  in  the  exercise  of  his  powers  under\nsection 16; or\n\nfails to provide such reasonable assistance as the authorised person may\nrequire in the exercise of his powers under section 16 is guilty of an\noffence.\n\nA  person  who  intentionally  alters,  suppresses  or  destroys  any  business\n\n(2)\ndocument specified in a notice under section 7(2) is guilty of an offence.\n\nA person guilty of an offence under subsection (1) is liable on summary\n\n(3)\nconviction to a fine of $50 000 or to imprisonment for 2 years, or to both.\n\nA person guilty of an offence under subsection (2) is liable on summary\n\n(4)\nconviction to a fine of $100 000 or imprisonment for 5 years or to both.\n\nRegulations\n\n18.(1)\nThe Minister may make such regulations as may be necessary to give\neffect to this Act and for prescribing anything that is required by this Act to be\nprescribed.\n\nThe  Director  shall  issue  Guidelines  in  respect  of  the  application  and\n\n(2)\ninterpretation of this Act and all such Guidelines shall have the force of law.\n\nRepeal\n\n19.\nrepealed.\n\nThe Business Companies (Economic Substance) Act (Act 2018-41) is\n\n\f27\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}