{
  "bill_id": 44,
  "slug": "land-sale-former-public-bath-at-haynes-hill-st-john",
  "title": "Land Sale - Former Public Bath at Haynes Hill, St. John",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/fb58e409065216e55ac0e46dd2742bf1.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-02-18",
  "first_reading": "2015-02-17",
  "second_reading": null,
  "gazette_date": null,
  "passed_date": "2015-07-08",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament, in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, approve the sale, to Reginald Blackett, of the parcel of land, the property of the Crown situate at Haynes Hill, in the parish of Saint John in this Island, more particularly described in the Schedule hereto.\nAPPROVED by the House of Assembly this\nday of\n; Two thousand and fourteen.\nSpeaker\nAPPROVED by the Senate this\nday of\nTwo thousand and fourteen.\nPresident\nSCHEDULE\nALL THAT land situate at Haynes Hill in the parish of Saint John, in this Island containing by admeasurement 181.5 square metres or thereabouts (inclusive of 7.3 square metres in road and 8.4 square metres in drain) Abutting and Bounding to the North on a road which leads to Highway F, to the East on Highway F which leads to Bath in one direction and to Codrington College in the other direction, to the South on lands now or formerly of Haynes Hill Estates Ltd and to the West on Lot 38 and on a road respectively or however else the same may abut and bound, as shown and delineated on a Plan certified on the 10\" day of June, 2010, by Michael L. Banfield, Land Surveyor and recorded in the Lands and Surveys Department on the 11\" day of June, 2010 as Plan No. 739/2010.\n\nwe\nADDENDUM\nOn the 4\" day of July 2013 the Cabinet agreed that 181.5 square metres of land, being the former public bath site and said to be situate at Sargeant Street in the parish of Saint John in this Island but more particularly described in the Schedule to this Resolution, should be sold to Reginald Blackett for the sum of $10,000.00.\nThe land, more particularly described in the Schedule hereto, was acquired by Private Treaty and Conveyance dated 19 October, 1956 between Henrietta Mildred Blow, of the One Part, Haynes Hill Limited, of the Second Part and the Executive Committee of this Island of Barbados of the Third Part, and was recorded in the Registration Department on 8th November, 1956 as Deed Numbered 4379.\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is sought, for the sale to Reginald Blackett, of the property described in the Schedule hereto.\nLANDS AND SURVEYS DEPARTMENT\nSurvey Order No: 15/2010 Correspondence No: 033/18 T1\nParish of: St. John Locality: Haynes Hill\nor Hill Haynes Estates ry 2 Q > = Q zg LA an 2 3 \\ \\ \\ \\ x\n| | | | |\n| | | | \\ \\ \\ \\ \\ \\\n\\ \\ \\\nlay om 2, %, a) ° % Os\nGRID NORTH\nSCALE 1:250\nPLAN OF LAND\nat\nHaynes Hill, St. John\nDistances are in metres Bearings are referred to Grid North derived from a previous survey plan by G. L. Jenkins certified 21-10-1986 and recorded as D. L. S. # 985/1986.\ncontaining\nLand 165.8 sq. m. (green) Road 7.3. sq. m. (brown) Drain 8.4 sq. m. (blue) Total 181.5 sq. m.\n© denotes iron found\n© denotes iron put\n@ denotes nail in x found\n@ denotes nail in x put\nLand Tax #: 44.12.03.001\nsurveyed for\nMINISTRY OF HOUSING AND LANDS\nFor Lands and Surveys Dept only\nCertified\n10th June,\n2010\n>)\nMichael |. Banfield\nZo ea)\n"
}