{
  "bill_id": 451,
  "slug": "societies-with-restricted-liability-amendment-bill-2019-parliament",
  "title": "Societies With Restricted Liability (Amendment) Bill, 2019 (Parliament)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/92a9f1cae4048977153fb584c9073064.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-11-27",
  "first_reading": "2019-11-27",
  "gazette_date": null,
  "markdown": "2019-11-25\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Societies  With  Restricted  Liability  Act,\n\nCap. 318B.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\nShort title\n\nAmendment of section 32 of Cap. 318B\n\nAmendment of section 34 of Cap. 318B\n\nAmendment of section 35 of Cap. 318B\n\nInsertion of section 35A into Cap. 318B\n\n\f3\n\nBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Societies With Restricted Liability Act, Cap. 318B.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n(Amendment) Act, 2019.\n\nThis  Act  may  be  cited  as  the  Societies  with  Restricted  Liability\n\n\f4\n\nAmendment of section 32 of Cap. 318B\n\nSection  32  of\n\n2.\nthe  Societies  With  Restricted  Liability  Act,\nCap. 318B, in this Act referred to as the principal Act, is amended in subsection\n(1) by inserting after the word “Registrar”, the words “together with notice of\nthe name and address of the person appointed by the society to take custody of\nthe records and other documents of the society upon its dissolution”.\n\nAmendment of section 34 of Cap. 318B\n\n3.\n\nSection 34 of the principal Act is amended by\n\n(a)\n\n(b)\n\nrenumbering that section as section 34(1); and\n\ninserting after section 34(1) as renumbered, the following:\n\n“(2)\nNo  society  shall  be  dissolved  under  subsection  (1)  unless  the\nsociety has given notice to the Registrar of the name and address of the\nperson appointed by the society to take custody of the records and other\ndocuments of the society upon its dissolution or the court has made an\norder  directing  such  person  as  the  court  thinks  fit  to  take  such\ncustody. ”.\n\nAmendment of section 35 of Cap. 318B\n\n4.\nand substituting the following:\n\nSection 35 of the principal Act is amended by deleting subsection (2)\n\n“(2)\n\nNo society shall be dissolved under subsection (1) unless\n\n(a)\n\nthe  Registrar  has  given  the  society  not  less  than  90  days'\nnotice  of  the  proposed  dissolution,  stating  the  reasons\ntherefor  and  addressed  to  its  registered  office  or  to  its\nprincipal place of business, and the society has failed prior to\nsuch dissolution to correct the omission; and\n\n\f5\n\n(b)\n\nthe society has given notice to the Registrar of the name and\naddress of the person appointed by the society to take custody\nof the records and other documents of the society upon its\ndissolution or the Registrar has applied for and obtained from\nthe court an order directing such person as the court thinks\nfit to take such custody.”.\n\nInsertion of section 35A into Cap. 318B\n\n5.\nfollowing:\n\nThe  principal  Act  is  amended  by  inserting  after  section  35,  the\n\n“Custody of records of dissolved society\n\n35A.\nAny person who has taken or has been granted custody of\nthe records and other documents of a society that has been dissolved\nremains liable to keep those records and other documents in Barbados\nfor 6 years following the date of the society's dissolution and to produce\nthem where so required.”.\n\n\f6\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2019.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2019.\n\nPresident\n\n"
}