{
  "bill_id": 458,
  "slug": "money-laundering-and-financing-of-terrorism-prevention-and-control-amendment-no2-bill-2019",
  "title": "Money Laundering and Financing of Terrorism (Prevention and Control) (Amendment) (No.2) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/fcb5393c6cfce3eeb658ad55fbb6a5d9.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2019-12-18",
  "first_reading": "2019-12-23",
  "gazette_date": null,
  "markdown": "2019/12/11\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Money Laundering and Financing of Terrorism\n(Prevention  and  Control)  Act,  2011  (Act  2011-23)  to  make  provision  for  the\nestablishment  of  a  unit  to  be  known  as  the  “Compliance  Unit”  and  for  other\nmatters related thereto.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\nShort title\n\nRepeal and replacement of section 9 of Act 2011-23\n\nAmendment of section 13 of Act 2011-23\n\nAmendment of section 34 of Act 2011-23\n\nRepeal and replacement of section 38 of Act 2011-23\n\nInsertion of Part VIA into Act 2011-23\n\nRepeal and replacement of section 50 of Act 2011-23\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  amend  the  Money  Laundering  and  Financing  of  Terrorism\n(Prevention and Control) Act, 2011 (Act 2011-23) to make provision for the\nestablishment of a unit to be known as the “Compliance Unit” and for other\nmatters related thereto.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nTerrorism (Prevention and Control) (Amendment) (No. ) Act, 2019.\n\nThis Act may be cited as the Money Laundering and Financing of\n\nRepeal and replacement of section 9 of Act 2011-23\n\n2.\n\nSection 9 of the principal Act, is deleted and following is substituted:\n\n“Administration and staff\n\n9.(1)\n\nThe office of the Authority shall comprise\n\n(a)\n\n(b)\n\nthe  Financial  Intelligence  Unit  which  shall  consist  of  a\ndirector  and  other  public  officers  whose  offices  shall  be\nestablished  in  accordance  with  the  Public  Service  Act,\nCap. 29; and\n\nthe Compliance Unit which shall consist of public officers\nwhose  offices  shall  be  established  in  accordance  with  the\nPublic Service Act.\n\nThe Director shall, subject to the directions of the Authority, be\n\n(2)\nresponsible for the general administration of this Act.\n\nThe  Compliance  Unit  shall,  subject  to  the  directions  of  the\n(3)\nAuthority, be responsible for the supervision of non-financial business\nentities or professionals.\n\nFor  the  purposes  of  this  section  and  Part  VIA,  “non-financial\n(4)\nbusiness  entities  or  professionals”  means  entities  or  professionals\nreferred  to  in  the  Second  Schedule  who  are  not  corporate  service\nproviders  or  trust  service  providers  licensed  in  accordance  with\nthe  Corporate  and  Trust  Service  Providers  Act,  2015\n(Act 2015-12).”.\n\n\f5\n\nAmendment of section 13 of Act 2011-23\n\n3.\nand substituting the following:\n\nSection 13 of the principal Act is amended by deleting subsection (3)\n\nThe Authority may delegate to the Director any of its functions\n\n“(3)\nunder this Act except\n\n(a)\n\n(b)\n\nthe functions set out in section 26; and\n\nthe  responsibilities  of  the  Compliance  Unit  under  this\nAct.”.\n\nAmendment of section 34 of Act 2011-23\n\n4.\nand substituting the following:\n\nSection 34 of the principal Act is amended by deleting subsection (3)\n\n“(3)\n\nA person who is aggrieved by a decision of\n\n(a)\n\n(b)\n\nthe Authority made pursuant to this section; or\n\na  regulatory  authority  or  other  public  authority  under  this\nsection or sections 35 or 36,\n\nmay appeal to a Judge in Chambers against the decision.”.\n\nRepeal and replacement of section 38 of Act 2011-23\n\n5.\nsubstituted:\n\nSection  38  of  the  principal  Act  is  deleted  and  the  following  is\n\n\f6\n\n“Power to freeze assets\n\n38.(1)\nOn  receipt  of  information  under  this  Act  and  on  being\nsatisfied that it is necessary to do so, the Director may apply to a Judge\nin Chambers for an order to\n\n(a)\n\n(b)\n\nprohibit  any  person  from  completing  any  transaction  for  a\nperiod not exceeding 72 hours; or\n\nfreeze a bank account of a person for a period not exceeding\n5 days.\n\nWhere the Director decides that it is necessary to apply to a Judge\n(2)\nin  Chambers  for  an  order  pursuant  to  subsection  (1),  he  shall  do  so\nexpeditiously.”.\n\nInsertion of Part VIA into Act 2011-23\n\n6.\nthe following:\n\nThe principal Act is amended by inserting immediately after Part VI\n\n“PART VIA\n\nCOMPLIANCE UNIT\n\nRequest for information\n\nThe Compliance Unit may require a non-financial business\n47A.(1)\nentity or professional to produce information that is considered relevant\nto\n\n(a)\n\n(b)\n\nensuring compliance with the provisions of this Act except\ninformation that is subject to legal professional privilege; and\n\nfacilitating the keeping of a register pursuant to subsection\n(3).\n\n\f7\n\n(2)\nThe  Compliance  Unit  shall  retain  a  record  of  all  information\nreceived pursuant to subsection (1)(a) for a period of no less than 5\nyears from the date that the information is received.\n\nThe Compliance Unit may cause to be kept a register of non-\n\n(3)\nfinancial business entities or professionals which shall record\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe name of the entity or professional;\n\nthe  address  of  the  registered  office  or  principal  place  of\nbusiness of the entity or professional;\n\nthe nature of the operations of the entity or professional;\n\nsuch  other  information  as  the  Compliance  Unit  considers\nappropriate.\n\nWhere  a  non-financial  business  entity  or  professional  fails  to\n\n(4)\ncomply with subsection (1)\n\n(a)\n\nthe Compliance Unit may\n\n(i)\n\nissue  a  warning  or  reprimand  to  the  non-financial\nbusiness entity or professional;\n\n(ii)\n\ngive such directives as seem appropriate;\n\n(iii)\n\nthe  non-financial  business\n\nrequire\nentity  or\nprofessional,  within  such  period  as  the  Compliance\nUnit specifies, to cease engaging in the activity which\nmay  obstruct  the  Compliance  Unit  in  performing  its\nfunctions pursuant to subsection (1); or\n\n(b)\n\nthe Authority may, with the necessary modifications, impose\non  the  non-financial  business  entity  or  professional,  a\npecuniary penalty in accordance with section 36.\n\n\f8\n\nCommunication of information to foreign states by the\nCompliance Unit\n\nThe Compliance Unit may, in accordance with the directions\n47B.\nof  the  Authority,  communicate  information  that  is  relevant  to  the\npurposes  of  this  Act  to  any  compliance  unit  of  a  foreign  state,  by\nwhatever name called, where the Compliance Unit is satisfied that\n\n(a)\n\n(b)\n\nthe unit is located in a state that is a party to any agreement\nwith  Barbados  in  respect  of  the  exchange  of  information\nunder this Act; and\n\nthe appropriate arrangements are in place for protecting the\nconfidentiality  of  the  information  and  controlling  the\ninformation and the use that will be made of the information.\n\nInformation sharing with a public authority by the\nCompliance Unit\n\nSubject to section 48, any report or information received by\n47C.(1)\nor on behalf of or disclosed to the Compliance Unit under this Act may\nbe  provided  by  the  Compliance  Unit  to  a  public  authority  for  the\npurposes of this Act.\n\nNotwithstanding any law to the contrary but subject to section\n(2)\n49, a public authority may provide information to the Compliance Unit\nfor the purposes of this Act, if the information is not subject to legal\nprofessional privilege.\n\n\f9\n\nPower to ensure compliance\n\n47D.(1)\nThe Compliance Unit may examine or cause an examination\nof the operations of a non-financial business entity or professional to\ndetermine whether\n\n(a)\n\nthe provisions of this Act or any regulation or guideline made\nthereunder; or\n\n(b)\n\nany directives given by the Compliance Unit\n\nare being complied with.\n\nWhere  it  appears  to  the  Compliance  Unit  that  a  non-financial\n(2)\nbusiness entity or professional is in contravention of this Act or any\nregulation or guideline made under this Act, or any directive given by\nthe Compliance Unit, the Compliance Unit may\n\n(a)\n\nrequire the non-financial business entity or professional to\ncease engaging in the activity which is in contravention of\nthe Act, regulation, guideline or directive and to take such\nremedial  measures  as  the  Compliance  Unit  directs  within\nsuch period as the Compliance Unit specifies;\n\n(b)\n\ngive such directives as seem appropriate.\n\nA requirement or a directive referred to in subsection (1) shall be\n(3)\nin  writing  and  shall  specify  the  reasons  for  such  requirement  or\ndirection.\n\nThe  Compliance  Unit  may,  in  ensuring  that  a  non-financial\n\n(4)\nbusiness entity or professional complies with\n\n(a)\n\nthe provisions of this Act or any regulation or guideline made\nthereunder; or\n\n(b)\n\nany directive given by the Compliance Unit,\n\n\f10\n\nexercise the powers set out in sections 31, 32(1) and 34(2)(a), (b) and (c)\nwith the necessary modifications.\n\n(5)\nA non-financial business entity or professional who is aggrieved\nby a decision of the Compliance Unit made pursuant to this section may\nappeal to a Judge in Chambers against the decision within 14 days of\nthe date of the decision.”.\n\nRepeal and replacement of section 50 of Act 2011-23\n\n7.\nsubstituted:\n\nSection  50  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Immunity from suit\n\n50.\nNo action or other proceeding for damages shall be instituted\nagainst the Authority, the Financial Intelligence Unit or the Compliance\nUnit or a member of the Authority or officer, employee or agent of the\nFinancial Intelligence Unit or Compliance Unit for any act done in good\nfaith in the performance of a duty or in the exercise of a power under\nthis Act.”.\n\n"
}