{
  "bill_id": 45,
  "slug": "borrowing-from-republic-bank-of-350-million",
  "title": "Borrowing from Republic Bank of $35.0 million",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/017c60a9e805a01a07bca1c75bc00bb2.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2014-12-03",
  "first_reading": "2014-12-10",
  "second_reading": "2014-12-02",
  "gazette_date": null,
  "passed_date": "2014-12-10",
  "markdown": "RESOLUTION NO.\n\nPARLIAMENT\n\nWHEREAS by section 2 of the Special Loans Act, Cap. 105\n\nthe Government is authorized from time to time to borrow from any bank,\n\ncorporation, company or other institution sums of money not exceeding in\n\nthe  aggregate  BDS$2  500  000  000  on  such  terms  as  may  be  agreed\n\nupon between the Government and the lender of any such sum of money;\n\nAND WHEREAS by section 3 of the said Act it is provided\n\nthat  any  money  borrowed  under  the  authority  of  the  Act  shall  be\n\nappropriated  and  applied  to  such  purposes  as  Parliament  may  approve\n\nby  resolution  and  that  such  money  and  any  interest  payable  thereon\n\nis charged upon the general revenues and assets of Barbados;\n\nAND WHEREAS the Government considers it necessary to\n\nborrow  the  sum  of  BDS$35.0  million  from  the  Republic  Bank\n\n(Barbados)  Limited  to  repay  a  BDS$35.0  million  line  of  credit  on  the\n\nterms and conditions contained in the Agreement, the main provisions\n\nof which are set out in the Schedule;\n\n\fL.R.O. 1998    2\n\nAND WHEREAS the said sum of BDS$35.0 million is within\n\nthe  authorized  borrowing  limits  given  to  the  Government  under\n\nsection 2 of the said Act;\n\nR E S O LV E D   t h e r e f o r e   t h a t   P a r l i a m e n t   a p p r o v e   t h e\n\nborrowing of the said sum of BDS$35.0 million from the Republic Bank\n\n(Barbados)  Limited  to  repay  a  BDS$35.0  million  line  of  credit  on  the\n\nterms and conditions contained in the Agreement, the main provisions\n\nof which are set out in the Schedule.\n\nAPPROVED by the House of Assembly this                   day of\n\n                                                , 2014.\n\nSpeaker\n\nAPPROVED by the Senate this           day of                                 ,\n\n2014.\n\nPresident\n\n\f3\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nBetween  the  Government  of  Barbados  and\nRepublic  Bank  (Barbados)  Limited  dated\n2014/06/20.\n\nGovernment of Barbados.\n\nRepublic Bank (Barbados) Limited (hereinafter called\n\"the Bank\").\n\nBDS$35,000,000.00\n\nTo repay a Line of Credit.\n\nTerm Loan.\n\nSeven (7) years.\n\nAgreement:\n\nBorrower:\n\nLender:\n\nAmount:\n\nPurpose:\n\nFacility:\n\nTerm:\n\nTerms of Repayment:\n\nPayable over 7 years via quarterly blended payments\nof principal and interest totaling $1,501,818.68.\n\nBasis:\n\nInterest Rate:\n\nAll interest payable hereunder shall accrue from day to\nday on the basis of the actual number of days elapsed\nin a 365 day year.\n\nInterest  shall  be  charged  at  the  rate  of  2.75%  below\nPrime floating, currently 8.0%, for an effective rate of\n5.25% per annum.\n\nThe  Bank  reserves  the  right  to  adjust  the  rate  of\ninterest  payable  to  such  level  as  it  may  in  its\nabsolute  discretion  consider  appropriate  on  the\ngiving  of  three  (3)  months  notice  to  the  Borrower.\n\n\fNotices:\n\nWaiver:\n\n# L.R.O. 1998    4\n\ni)\n\nii)\n\nAny  instruction  or  notice  given  by  the\nBorrower  to  the  Bank  hereunder  shall  be\nsigned  by  a  person  authorized  to  do  so  by\nthe  Government  to  be  given  to  the  Bank.\n\nAny demand made by the Bank hereunder\nshall be sufficiently made if in writing and\nsigned  by  the  Manager  or  Managing\nDirector  of  the  Bank  or  if  made  by  the\nAttorney-at-Law of the Bank.\n\niii) Whenever  any  payment  to  be  made\nhereunder shall be due on a day other than\na business day, such payment shall be made\non  the  next  succeeding  business  day  and\nsuch  additional  days  shall  be  included  in\ncomputing interest in connection with such\npayment.\n\n`\n\nAny  waiver  by  the  Bank  of  any  breach  by  the\nBorrower  of  any  of  the  terms  thereof,  or  any\nindulgence, time or relaxation by the Bank to the\nBorrower shall be without prejudice to and shall\nnot affect the exercise any time thereafter by the\nBank  of  all  or  any  of  its  rights  and  remedies\nhereunder,  as  though  such  waiver  had  not  been\nmade or indulgence or relaxation of time had not\nbeen granted.\n\nCommitment Fees:\n\nA committment fee of 0.35% of $35,000,000.00\ni.e.  $122,500.00  is  due  and  payable  up  front.\n\nLegal Fees:\n\nAll  legal,  valuation,  stamp  duty  or  other  fees\nincurred  by  the  Bank  in  connection  with  this\nfacility shall be paid by the Borrower.\n\n\f   L.R.O. 1998\n\nLate Fees:\n\n# 5\n\nProvided  payment  is  not  made  on  the  due\npayment  date,  this  facility  will  be  charged  late\nfees  at  a  rate  to  be  determined  and  which  is\npayable on demand by the Bank.\n\nPrepayment of Principal:\n\nPrepayment of principal may be without penalty.\n\nPrincipal Covenant:\n\nEvents of Default:\n\nThe  Borrower  shall  furnish  the  Bank  with  such\ninformation  as  the  Bank  may  from  time  to  time\nreasonably request.\n\nNotwithstanding  any  other  provision  herein\ncontained,  any  sum  advanced  with  all  unpaid\ninterest thereon shall become immediately payable\nto  the  Bank  upon  the  happenings  of  the\nfollowing:\n\n(a)\n\n(b)\n\n(c)\n\nIf any payment due by the Borrower\nhereunder is not paid on that date fixed\nfor  the  payment  thereof,  or  within  a\nthirty-day grace period.\n\nIf  the  Borrower  shall  default  in  the\nperformance or observance of any of\nthe  terms  or  covenants  contained\nherein.\n\nIf any representation or warranty given\nhereunder shall prove to be untrue or\nincorrect in any respect.\n\nTHE LAWS OF BARBADOS\nPrinted by the Government Printer, Bay Street, St. Michael\nby the authority of the Government of Barbados\n\n\fL.R.O. 1998    6\n\nADDENDUM\n\nThis  Resolution  seeks  the  approval  of  Parliament  for  the\n\nborrowing  of  BDS$35.0  million,  a  sum  which  is  within  the  limit  of  the\n\nSpecial Loans Act, Cap. 105, from the Republic Bank (Barbados) Limited.\n\nThe purpose of the loan is to repay a BDS$35.0 million line of credit.\n\n"
}