{
  "bill_id": 460,
  "slug": "prevention-of-corruption-bill-2019",
  "title": "Prevention of Corruption Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/5146ed8dd703074cdd929fb763176e01.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2019-12-16",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "Explanatory Memorandum After Page 26\n\n2019-12-16\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the prevention, investigation and prosecution of\n\nacts of corruption.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nShort title\n\nInterpretation\n\nOffering, soliciting or accepting an advantage\n\nPART II\n\nACTS OF CORRUPTION - OFFENCES AND PENALTIES\n\nBribery of persons exercising public functions\n\nBribery of a foreign public official\n\nBribery of an official of a public international organisation\n\nTrading in influence\n\nAcquiring private interest in contract, agreement or investment in relation\nto public authority\n\n9.\n\nBribery in relation to contracts and tenders\n\n10.\n\nBribery in relation to auctions\n\n11.\n\nCorrupt transactions with agents\n\n\f3\n\n12.\n\nBribery in the private sector\n\n13.\n\nPenalties\n\n14.\n\nDisqualification from holding public office\n\nPART III\n\nINVESTIGATIONS\n\n15.\n\nDisclosure orders\n\n16.\n\nSearch and seizure warrants\n\n17.\n\nOffence of tipping off etc.\n\nPART IV\n\nEVIDENCE\n\n18.\n\nEvidence of unexplained property\n\n19.\n\nPresumption of corruption in certain cases\n\n20.\n\nCertain defences not available\n\nPART V\n\nMISCELLANEOUS\n\n21.\n\nOffences in respect of false complaints\n\n22.\n\nMaking of Regulations\n\n23.\n\nRepeal\n\n\f4\n\n24.\n\nCommencement\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the prevention, investigation and prosecution of acts\n\nof corruption.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Prevention of Corruption Act, 2019.\n\nInterpretation\n\n2.\n\nIn this Act\n\n“advantage” includes\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nmoney and any gift, loan, fee, reward, bonus, commission, discount,\nrebate, valuable security or other property or interest in property of any\ndescription;\n\nany status, honour, office, contract, employment or agreement to render\nservices in any capacity;\n\nany  forbearance  to  demand  any  money  or  money's  worth  or  other\nvaluable thing;\n\nany avoidance of a loss, liability, penalty, forfeiture, punishment or\nother  disadvantage  or  any  protection  from  any  disability  or  penalty\napprehended  or  incurred  from  any  action  or  proceedings  of  a  civil,\ncriminal or disciplinary nature, whether or not already instituted;\n\nany discharge, liquidation, payment or release of any loan, obligation\nor other liability, whether in whole or in part;\n\nany residential or hotel accommodation;\n\nany exercise, or forbearance from the exercise, of any duty, power or\nright;\n\nany real or pretended aid, vote, consent, influence or abstention from\nvoting;\n\n\f7\n\n(i)\n\n(j)\n\nany other service, favour, right or privilege; and\n\nany offer, promise or undertaking, whether conditional or not, of any\nadvantage within the meaning of paragraph (a), (b), (c), (d), (e), (f), (g),\n(h) or (i);\n\n“agent” means a person employed by, or acting for, another and includes a trustee,\n\nan administrator and an executor;\n\n“disclosure order” means an order made under section 15(1);\n\n“document” includes\n\n(a)\n\n(b)\n\n(c)\n\nanything on which there is writing;\n\na map, plan, drawing or photograph; and\n\nany  information  recorded  or  stored  by  means  of  any  tape  recorder,\ncomputer or other device, and any material subsequently derived from\nthe information so recorded or stored;\n\n“foreign public official” means a person who\n\n(a)\n\n(b)\n\nholds an administrative, executive, judicial or legislative office of a\nforeign State, whether appointed or elected; or\n\nexercises  a  public  function  for  a  foreign  State  including  a  public\nfunction for a public agency or public enterprise of a foreign State;\n\n“foreign State” means a State other than Barbados;\n\n“income” includes\n\n(a)\n\n(b)\n\nmoney or money’s worth derived from whatever source or acquired in\nBarbados or elsewhere, whether directly or indirectly; and\n\nall receipts by way of salary, fees, wages, requisitions, profits, grants,\nemoluments, rents, interest, commissions, bonuses, pensions, annuities\nor benefits;\n\n\f8\n\n“induce” includes to persuade, encourage, coerce, intimidate, threaten or cause\na  person  to  perform  an  act,  and  \"inducement\"  has  the  corresponding\nmeaning;\n\n“investigative officer” means a member of the Police Force or such other person\nas may be by authorised by any other enactment to conduct an investigation\ninto an offence under this Act;\n\n“liability” means any obligation of a person to pay money or to provide goods or\n\nservices in Barbados or elsewhere;\n\n“official of a public international organisation” means a person who is authorised\n\nby a public international organisation to act on its behalf;\n\n“persons exercising public functions” includes\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nall specified persons in public life;\n\npublic officers;\n\nmembers, chief executive officers, managers, directors and employees\nof state-owned enterprises; and\n\nall other persons who hold a legislative, executive, administrative or\njudicial office in the Government of Barbados, whether appointed or\nelected, permanent or temporary, paid or unpaid;\n\n“principal” includes an employer;\n\n“private sector entity” means an entity that is not a public authority and is not\n\nunder the direct control of the Government;\n\n“privileged material” means\n\n(a)\n\ncommunications  between  an  attorney-at-law  and  his  client,  or  any\nperson representing his client, made in connection with the giving of\nlegal advice to the client;\n\n(b)\n\ncommunications  between  an  attorney-at-law  and  his  client,  or  any\nperson representing his client, or between such an attorney-at-law or\n\n\f9\n\nhis client, or any such representative, and any other person made in\nconnection with or in contemplation of legal proceedings and for the\npurposes of such proceedings; and\n\n(c)\n\nmaterial enclosed with or referred to in such communications and made\n\n(i)\n\nin connection with the giving of legal advice; or\n\n(ii)\n\nin connection with or in contemplation of legal proceedings and\nfor the purposes of such proceedings,\n\nwhen the communications or material are in the possession of a person who\nis entitled to such possession and are not held with the intention of furthering\na criminal purpose;\n\n “property” means\n\n(a)\n\n(b)\n\nassets of every kind, whether situated in Barbados or elsewhere and\nwhether real or personal, tangible or intangible and includes money;\nand\n\nlegal documents or instruments in any form, including electronic or\ndigital, evidencing title to or interest in assets referred to in paragraph\n(a)  such  as  bank  credits,  travellers’  cheques,  bank  cheques,  money\norders, shares, securities, bonds, drafts and letters of credit;\n\n“public authority” includes\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe House of Assembly and the Senate;\n\nthe Cabinet;\n\nthe judiciary;\n\nany  ministry,  department,  agency,  organ,  unit  or  other  authority  of\nGovernment;\n\n(e)\n\na state-owned enterprise; and\n\n(f)\n\nany person exercising public functions;\n\n\f10\n\n“public international organisation” means an organisation, the members of which\n\nare\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\ncountries or territories;\n\ngovernments of countries or territories;\n\nother public international organisations; or\n\na combination of countries, territories, governments and other public\ninternational organisations;\n\n“public officer” has the meaning assigned to it by section 2 of the Public Service\n\nAct, Cap. 29;\n\n“specified person in public life” has the meaning assigned to it by section 2 of\n\nthe Integrity in Public Life Act, 2019 (Act 2019- );\n\n“state-owned  enterprise”  has  the  meaning  assigned  to  it  by  section  2  of  the\n\nIntegrity in Public Life Act, 2019 (Act 2019- ).\n\nOffering, soliciting or accepting an advantage\n\n3.\n\nFor the purposes of this Act, a person\n\n(a)\n\n(b)\n\n(c)\n\noffers  an  advantage  where  he,  or  any  person  acting  on  his  behalf,\ndirectly or indirectly gives, affords or holds out, or agrees, undertakes\nor promises to give, afford or hold out, any advantage to or in trust for\nany other person;\n\nsolicits  an  advantage  where  he,  or  any  person  acting  on  his  behalf,\ndirectly or indirectly demands, invites, asks for or indicates willingness\nto receive, any advantage, whether for himself or for any other person;\n\naccepts  an  advantage  where  he,  or  any  person  acting  on  his  behalf,\ndirectly  or  indirectly  takes,  receives  or  obtains,  or  agrees  to  take,\nreceive or obtain any advantage, whether for himself or for any other\nperson.\n\n\f11\n\nPART II\n\nACTS OF CORRUPTION - OFFENCES AND PENALTIES\n\nBribery of persons exercising public functions\n\nA  person  who  offers  an  advantage  to  a  person  exercising  public\n4.(1)\nfunctions as an inducement to, or reward for, or otherwise on account of, the\nperson exercising public functions’\n\n(a)\n\n(b)\n\n(c)\n\nperforming  or  refraining  from  performing,  or  having  performed  or\nrefrained  from  performing,  any  act  in  his  capacity  as  a  person\nexercising public functions;\n\nexpediting,  delaying,  hindering  or  preventing  or  having  expedited,\ndelayed, hindered or prevented, the performance of an act, whether by\nhimself or by another person exercising public functions in his or that\nother person’s capacity as a person exercising public functions; or\n\nassisting,  favouring,  hindering  or  delaying,  or  having  assisted,\nfavoured,  hindered  or  delayed,  any  person  in  the  transaction  of  any\nbusiness with a public authority,\n\nis guilty of an offence.\n\nA person exercising public functions who solicits or accepts an advantage\n\n(2)\nas an inducement to, or reward for, or otherwise on account of, his\n\n(a)\n\n(b)\n\nperforming  or  refraining  from  performing,  or  having  performed  or\nrefrained  from  performing,  any  act  in  his  capacity  as  a  person\nexercising public functions;\n\nexpediting,  delaying,  hindering  or  preventing,  or  having  expedited,\ndelayed, hindered or prevented, the performance of an act, whether by\nhimself or by another person exercising public functions in his or that\nother person’s capacity as a person exercising public functions; or\n\n\f12\n\n(c)\n\nassisting,  favouring,  hindering  or  delaying,  or  having  assisted,\nfavoured,  hindered  or  delayed,  any  person  in  the  transaction  of  any\nbusiness with a public authority,\n\nis guilty of an offence.\n\nBribery of a foreign public official\n\nA person who offers an advantage to a foreign public official as an\n5.(1)\ninducement  to,  or  reward  for,  or  otherwise  on  account  of,  the  foreign  public\nofficial’s  acting  or  refraining  from  acting,  or  having  acted  or  refrained  from\nacting, in the exercise of his official functions, in order to obtain or retain any\nbusiness or other advantage, is guilty of an offence.\n\nA  foreign  public  official  who  solicits  or  accepts  an  advantage  as  an\n(2)\ninducement to, or reward for, or otherwise on account of, his acting or refraining\nfrom acting, or having acted or refrained from acting, in the exercise of his official\nfunctions, is guilty of an offence.\n\nBribery of an official of a public international organisation\n\n6.(1)\nA  person  who  offers  an  advantage  to  an  official  of  a  public\ninternational organisation as an inducement to, or reward for, or otherwise on\naccount  of,  the  official’s  acting  or  refraining  from  acting,  or  having  acted  or\nrefrained from acting, in the exercise of his official functions, in order to obtain\nor retain any business or other advantage, is guilty of an offence.\n\nAn official of a public international organisation who solicits or accepts\n(2)\nan advantage as an inducement to, or reward for, or otherwise on account of, his\nacting or refraining from acting, or having acted or refrained from acting, in the\nexercise of his official functions, is guilty of an offence.\n\nTrading in influence\n\n7.(1)\nA person who offers an advantage to another person as an inducement\nto, or reward for, or otherwise on account of, that other person’s using his real or\nsupposed influence, or having used influence, in order for the first mentioned\n\n\f13\n\nperson or another person to obtain an advantage from a public authority, is guilty\nof an offence.\n\nA  person  who  solicits  or  accepts  an  advantage  as  an  inducement  to,  or\n(2)\nreward for, or otherwise on account of, his using his real or supposed influence,\nor having used influence, in order for another person to obtain an advantage from\na public authority, is guilty of an offence.\n\nAcquiring private interest in contract, agreement or investment in\nrelation to public authority\n\nSubject to subsection (2), a person exercising public functions shall\n8.(1)\nnot acquire or hold a private interest in any contract, agreement or investment\nemanating from or connected with a public authority with which he is employed\nor which is made on account of such public authority.\n\n(2)\n\nSubsection (1) does not apply to a person exercising public functions\n\n(a)\n\n(b)\n\nwho acquires or holds an interest referred to in that subsection as a\nshareholder of a state-owned enterprise; or\n\nwhose terms and conditions of employment do not prohibit him from\nacquiring or holding such an interest.\n\nBribery in relation to contracts and tenders\n\n9.(1)\nA  person  who  offers  an  advantage  to  a  person  exercising  public\nfunctions as an inducement to, or reward for, or otherwise on account of, the\nperson exercising public functions’ giving assistance or using his real or supposed\ninfluence, or having given assistance or used influence, in\n\n(a)\n\nthe promotion, procuring or execution of\n\n(i)\n\n(ii)\n\nany contract with a public authority for the supply of any goods,\nservices or works; or\n\nany subcontract under a contract referred to in subparagraph (i);\nor\n\n\f14\n\n(b)\n\nthe payment of the price or other consideration stipulated or otherwise\nprovided for in any contract or subcontract referred to in paragraph\n(a),\n\nis guilty of an offence.\n\nA person exercising public functions who solicits or accepts an advantage\n(2)\nas  an  inducement  to,  or  reward  for,  or  otherwise  on  account  of,  his  giving\nassistance or using his real or supposed influence, or having given assistance or\nused influence, in\n\n(a)\n\n(b)\n\nthe promotion, procuring or execution of; or\n\nthe payment of the price or other consideration stipulated or otherwise\nprovided for in,\n\nany contract or subcontract referred to in subsection (1)(a) is guilty of an offence.\n\nA person who offers an advantage to another person as an inducement to,\n(3)\nor reward for, or otherwise on account of, the other person’s withdrawal of a\ntender or refraining from tendering, for a contract with a public authority for the\nsupply of any goods, services or works, is guilty of an offence.\n\nA  person  who  solicits  or  accepts  an  advantage  as  an  inducement  to,  or\n(4)\nreward for, or otherwise on account of, his withdrawal of a tender or refraining\nfrom tendering, for a contract referred to in subsection (3) is guilty of an offence.\n\nBribery in relation to auctions\n\n10.(1)\nA person who offers an advantage to another person as an inducement\nto, or reward for, or otherwise on account of, that other person’s refraining or\nhaving refrained from bidding at an auction conducted by or on behalf of a public\nauthority, is guilty of an offence.\n\nA  person  who  solicits  or  accepts  an  advantage  as  an  inducement  to,  or\n(2)\nreward for, or otherwise on account of, his refraining or having refrained from,\nbidding at an auction conducted by or on behalf of a public authority, is guilty of\nan offence.\n\n\f15\n\nCorrupt transactions with agents\n\n11.(1)\nreward for, or otherwise on account of, the agent’s\n\nA person who offers an advantage to an agent as an inducement to, or\n\n(a)\n\n(b)\n\nperforming  or  refraining  from  performing,  or  having  performed  or\nrefrained from performing, any act in relation to his principal’s affairs\nor business; or\n\nshowing or refraining from showing, or having shown or refrained from\nshowing, favour or disfavour to any person in relation to his principal’s\naffairs or business,\n\nis guilty of an offence.\n\nAn  agent  who  solicits  or  accepts  an  advantage  as  an  inducement  to,  or\n\n(2)\nreward for, or otherwise on account of, his\n\n(a)\n\n(b)\n\nperforming  or  refraining  from  performing,  or  having  performed  or\nrefrained from performing, any act in relation to his principal’s affairs\nor business; or\n\nshowing or refraining from showing, or having shown or refrained from\nshowing, favour or disfavour to any person in relation to his principal’s\naffairs or business,\n\nis guilty of an offence.\n\nAn agent who, with intent to deceive his principal, uses any receipt, account\n\n(3)\nor other document\n\n(a)\n\n(b)\n\nin respect of which his principal is interested; and\n\nwhich\n\n(i)\n\ncontains any statement which is false, erroneous or defective in\nany material particular; and\n\n(ii)\n\nto his knowledge is intended to mislead his principal,\n\n\fis guilty of an offence.\n\n16\n\nFor the purposes of subsections (1) and (2), the permission of a principal\n(4)\nto  the  soliciting  or  accepting  of  an  advantage  by  his  agent  shall  constitute  a\ndefence to an offence under this section.\n\nBribery in the private sector\n\nA person who offers an advantage to a person who directs or works\n12.(1)\nin any capacity for a private sector entity as an inducement to, or reward for, or\notherwise on account of, the other person’s acting or refraining from acting, or\nhaving acted or refrained from acting, in the exercise of his functions in such\ncapacity, is guilty of an offence.\n\nA person who directs or works in any capacity for a private sector entity\n(2)\nand who solicits or accepts an advantage as an inducement to, or reward for, or\notherwise on account of, his acting or refraining from acting, or having acted or\nrefrained from acting, in the exercise of his functions in such capacity, is guilty\nof an offence.\n\nPenalties\n\n13.(1)\n\nA person guilty of an offence under this Part is liable\n\n(a)\n\n(b)\n\non conviction on indictment, to a fine of $1 500 000 or to imprisonment\nfor 15 years or to both;\n\non summary conviction, to a fine of $500 000 or to imprisonment for\n10 years or to both,\n\nand, without prejudice to any other law, to pay as a penalty, within such time as\nthe court may specify, the amount or value of any advantage he is determined as\nhaving accepted.\n\n(2)\n\nA penalty referred to in subsection (1) is recoverable as a fine.\n\n\f17\n\nDisqualification from holding public office\n\nA  person  who  is  convicted  of  an  offence  under  this  Part  shall,  in\n14.\naddition to any other penalty prescribed by law, be disqualified from holding any\npublic office for a period of 5 years from the date of conviction for the offence.\n\nPART III\n\nINVESTIGATIONS\n\nDisclosure orders\n\nWhere on an application made by an investigative officer, a judge in\n15.(1)\nChambers is satisfied that each of the requirements set out in subsection (3) is\nfulfilled, the judge may make an order authorising the officer to give to any person\nthe  officer  considers  has  relevant  information,  notice  in  writing  requiring  the\nperson, with respect to any matter relevant to the investigation for the purposes\nof which the order is sought, to\n\n(a)\n\n(b)\n\n(c)\n\nanswer any question, either at a time specified in the notice or at once,\nat a place so specified;\n\nprovide  any  information  specified  in  the  notice,  by  a  time  and  in  a\nmanner so specified;\n\nproduce any document, or any documents of a description, specified\nin the notice, either at or by a time so specified or at once, and in a\nmanner so specified.\n\nAn application for a disclosure order shall be made without notice and shall\n(2)\nstate that a person specified in the application is subject to an investigation under\nthis Act.\n\n\f18\n\nThe requirements referred to in subsection (1) are that there are reasonable\n\n(3)\ngrounds for\n\n(a)\n\nsuspecting that the person specified in the application has committed\nan offence under Part II; and\n\n(b)\n\nbelieving that\n\n(i)\n\n(ii)\n\ninformation which may be provided in compliance with the order\nis likely to be of substantial value, whether or not by itself, to the\ninvestigation for the purposes of which the order is sought; and\n\nit is in the public interest for the information to be provided, having\nregard  to  the  benefit  likely  to  accrue  to  the  investigation  if  the\ninformation is obtained.\n\nA person is not bound to comply with a requirement imposed by a notice\n(4)\ngiven under a disclosure order unless evidence of authority to give the notice is\nproduced to him.\n\n(5)\n\nA person who\n\n(a)\n\n(b)\n\nwithout reasonable excuse, fails to comply with a requirement imposed\non him under a disclosure order; or\n\nin purported compliance with a requirement imposed on him under a\ndisclosure order\n\n(i)\n\n(ii)\n\nmakes a statement which he knows to be false or misleading in a\nmaterial particular; or\n\nrecklessly  makes  a  statement  which  is  false  or  misleading  in  a\nmaterial particular,\n\nis guilty of an offence.\n\n(6)\n\nA person guilty of an offence under subsection (5) is liable\n\n(a)\n\non summary conviction, to a fine of $50,000 or to imprisonment for 3\nyears or to both; and\n\n\f19\n\n(b)\n\non conviction on indictment, to a fine of $150 000 or to imprisonment\nfor 5 years or to both.\n\n(7)\nSubject to subsection (8), a statement made by a person in response to a\nrequirement imposed by a disclosure order may not be used in evidence against\nthe person in criminal proceedings.\n\n(8)\n\nSubsection (7) does not apply in the case of\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nproceedings for contempt of court;\n\na prosecution for an offence under subsection (6);\n\na prosecution for an offence under the Perjury Act, Cap. 142; or\n\na prosecution for another offence where, in giving evidence, the person\nmakes  a  statement  inconsistent  with  the  statement  mentioned  in\nsubsection (7).\n\nA statement may not be used by virtue of subsection (8)(d) against a person\n\n(9)\nunless\n\n(a)\n\n(b)\n\nevidence relating to it is adduced; or\n\na question relating to it is asked,\n\nby or on behalf of the person in the proceedings arising out of the prosecution.\n\nA  disclosure  order  has  effect  notwithstanding  any  obligation  as  to\n(10)\nconfidentiality  or  any  other  restriction  upon  the  disclosure  of  information\nimposed by any enactment, rule of law or otherwise.\n\nA disclosure order does not require a person to provide privileged material\n(11)\nbut an attorney-at-law may be required to produce the name and address of a\nclient.\n\nAn investigative officer may take copies of or extracts from any documents\n(12)\nproduced  by  a  person  in  connection  with  complying  with  a  requirement  of  a\ndisclosure order.\n\n\f20\n\n(13)\nAny document produced in compliance with a disclosure order may be\nretained for so long as it is necessary to retain it, as opposed to copies of it, in\nconnection with the investigation for the purposes of which the order was made.\n\nNotwithstanding  subsection  (13),  where  an  investigative  officer  has\n\n(14)\nreasonable grounds for believing that the document\n\n(a)\n\nmay need to be produced for the purposes of any legal proceedings;\nand\n\n(b)\n\nmight otherwise be unavailable for those purposes,\n\nthe document may be retained until the proceedings are concluded.\n\nAn investigative officer who applied for a disclosure order or any person\n(15)\naffected by the order may apply to a judge in Chambers to vary or discharge the\norder, and the judge may do so where he considers it appropriate.\n\nFor the purposes of subsection (1), “relevant information” is information,\n(16)\nwhether or not contained in a document, which the investigative officer considers\nto be relevant to the investigation.\n\nSearch and seizure warrants\n\n16.(1)\nWhere on an application made by an investigative officer, a magistrate\nis satisfied of the circumstances set out in subsection (3), the magistrate may issue\na warrant authorising the officer to\n\n(a)\n\n(b)\n\nenter  and  search  the  premises  specified  in  the  application  for  the\nwarrant; and\n\nseize and retain any material found on the premises which is likely to\nbe of substantial value, whether or not by itself, to the investigation for\nthe purposes of which the application is made.\n\n(2)\n\nAn application for a search and seizure warrant shall\n\n(a)\n\n(b)\n\nspecify the person subject to investigation;\n\nstate that the warrant is sought for the purposes of the investigation;\n\n\f21\n\n(c)\n\n(d)\n\nspecify the premises in respect of which the warrant is sought; and\n\nspecify the material in respect of which the warrant is sought or, where\nthe material cannot be identified at the time of the application, state\nthat there are reasonable grounds for believing that there is material on\nthe premises that\n\n(i)\n\n(ii)\n\nrelates to the person specified in the application or the question\nwhether that person has committed an offence under Part II; and\n\nis likely to be of substantial value, whether or not by itself, to the\ninvestigation for the purposes of which the warrant is sought.\n\n(3)\n\nThe circumstances referred to in subsection (1) are that\n\n(a)\n\n(b)\n\na disclosure order in relation to material has not been complied with\nand there are reasonable grounds for believing that the material is on\nthe premises specified in the application for the warrant; or\n\nthere are reasonable grounds for suspecting that the person specified\nin the application for the warrant has committed an offence under Part\nII and\n\n(i)\n\nthe conditions specified in subsection (4) are fulfilled; or\n\n(ii)\n\nthe conditions specified in subsection (5) are fulfilled.\n\n(4)\n\nThe conditions referred to in subsection (3)(b)(i) are that\n\n(a)\n\nthere are reasonable grounds for believing that\n\n(i)\n\nany material on the premises specified in the application for the\nwarrant is likely to be of substantial value, whether or not by itself,\nto the investigation for the purposes of which the warrant is sought;\nand\n\n(ii)\n\nit is in the public interest for the material to be obtained, having\nregard  to  the  benefit  likely  to  accrue  to  the  investigation  if  the\nmaterial is obtained; and\n\n\f22\n\n(b)\n\nit would not be appropriate to make a disclosure order because\n\n(i)\n\n(ii)\n\n(iii)\n\nit  is  not  practicable  to  communicate  with  any  person  against\nwhom the disclosure order could be made;\n\nit is not practicable to communicate with any person who would\nbe required to comply with an order to grant entry to the premises;\nor\n\nthe  investigation  might  be  seriously  prejudiced  unless  an\ninvestigative  officer  is  able  to  secure  immediate  access  to  the\nmaterial.\n\n(5)\n\nThe conditions referred to in subsection (3)(b)(ii) are that\n\n(a)\n\nthere are reasonable grounds for believing where the material cannot\nbe identified at the time of the application, that there is material on the\npremises specified in the application for the warrant that\n\n(i)\n\n(ii)\n\nrelates to the person specified in the application or the question\nwhether he has committed an offence under Part II; and\n\nis likely to be of substantial value, whether or not by itself, to the\ninvestigation for the purposes of which the warrant is sought; and\n\n(b)\n\nthere are reasonable grounds for believing that it is in the public interest\nfor the material to be obtained, having regard to the benefit likely to\naccrue to the investigation if the material is obtained; and\n\n(c)\n\none of the following applies:\n\n(i)\n\n(ii)\n\n(iii)\n\nit  is  not  practicable  to  communicate  with  any  person  against\nwhom a disclosure order could be made;\n\nentry  to  the  premises  will  not  be  granted  unless  a  warrant  is\nproduced; or\n\nthe  investigation  might  be  seriously  prejudiced  unless  an\ninvestigative  officer  arriving  at  the  premises  is  able  to  secure\nimmediate entry to them.\n\n\f23\n\nA search and seizure warrant does not confer the right to seize privileged\n\n(6)\nmaterial.\n\nOffence of tipping off etc.\n\n17.\nA person who knows or suspects that an investigation into an offence\nunder Part II has been, is being, or is about to be conducted, or that an order under\nthis Part has been made or may be made and\n\n(a)\n\n(b)\n\ndivulges that fact or other information to another person whereby the\ninvestigation is likely to be prejudiced; or\n\nfalsifies,  conceals,  destroys  or  otherwise  disposes  of,  or  causes  or\npermits the falsification, concealment, destruction or disposal of, any\nmatter or thing that he knows or suspects is or is likely to be relevant\nto the investigation,\n\nis guilty of an offence and is liable, on conviction on indictment to a fine of $250\n000 or to imprisonment for 10 years or to both.\n\nPART IV\n\nEVIDENCE\n\nEvidence of unexplained property\n\n18.(1)\nthat\n\nIn proceedings against a person for an offence under Part II the fact\n\n(a)\n\nthe person\n\n(i)\n\nwas at or about the date of, or at any time since the date of, the\nalleged offence; or\n\n(ii)\n\nis,\n\nin  possession,  for  which  he  cannot  satisfactorily  account,  of  property\ndisproportionate to his known sources of income; or\n\n\f24\n\n(b)\n\nthe person had, at or about the date of, or at any time since the date of,\nthe  alleged  offence,  obtained  an  accretion  to  property  for  which  he\ncannot satisfactorily account,\n\nmay be proved and may be taken by the court as corroborating the testimony of\nany  witness  giving  evidence  in  such  proceedings  that  the  person  solicited  or\naccepted an advantage and showing that such advantage was solicited or accepted\nas an inducement or reward.\n\nFor the purposes of subsection (1), a person accused of an offence under\n(2)\nPart II shall be presumed to be or to have been in possession of property, or to\nhave obtained an accretion thereto, where such property is or was held, or such\naccretion was obtained, by any other person who, having regard to his relationship\nto the accused or to any other circumstances, there is reason to believe is or was\nholding  such  property  or  obtained  such  accretion  in  trust  for  or  otherwise  on\nbehalf of the accused or as a gift from the accused.\n\nPresumption of corruption in certain cases\n\n19.\nWhere in any proceedings for an offence under section 4 or section\n9(1)  or  (2),  it  is  proved  that  the  accused  gave  or  accepted  an  advantage,  the\nadvantage shall be presumed to have been given or accepted as such inducement\nor reward as is alleged in the particulars of the offence unless, on a balance of\nprobabilities, the contrary is proved.\n\nCertain defences not available\n\n20.\nit is proved that\n\nWhere, in any proceedings for an offence under any section of Part II,\n\n(a)\n\nthe accused accepted an advantage, believing or suspecting or having\ngrounds  to  believe  or  suspect  that  the  advantage  was  given  as  an\ninducement to, or reward for, or otherwise on account of, his doing or\n\n\f25\n\nrefraining from doing, or having done or refrained from doing, any act\nreferred to in that section, it shall be no defence that\n\n(i)\n\n(ii)\n\nhe did not actually have the power, right or opportunity so to do\nor refrain;\n\nhe accepted the advantage without intending so to do or refrain;\nor\n\n(iii)\n\nhe did not in fact so do or refrain;\n\n(b)\n\n(c)\n\nthe accused offered an advantage to another person as an inducement\nto, or reward for, or otherwise on account of, that other person’s doing\nor refraining from doing, or having done or refrained from doing, any\nact referred to in that section, believing or suspecting or having reason\nto  believe  or  suspect  that  the  other  person  had  the  power,  right  or\nopportunity so to do or refrain, it shall be no defence that the other\nperson had no such power, right or opportunity;\n\nthe accused offered an advantage to another person as an inducement\nto or reward for or otherwise on account of that other person’s doing\nor refraining from doing, or having done or refrained from doing, any\nact referred to in that section, it shall be no defence that the advantage\nis customary in any profession, trade, vocation or calling.\n\n\f26\n\nPART V\n\nMISCELLANEOUS\n\nOffences in respect of false complaints\n\nA  person  who  knowingly  makes  a  false  allegation  or  maliciously\n21.\nprovides  false  information  related  to  an  offence  under  Part  II  is  guilty  of  an\noffence and is liable\n\n(a)\n\n(b)\n\non summary conviction, to a fine of $50,000 or to imprisonment for 3\nyears or to both; and\n\non conviction on indictment, to a fine of $150 000 or to imprisonment\nfor 5 years or to both.\n\nMaking of Regulations\n\n22.\n\nThe Minister may make Regulations for giving effect to this Act.\n\nRepeal\n\n23.\nCorruption Act, 2012 (Act 2012-31) are repealed.\n\nThe Prevention of Corruption Act, Cap. 144 and the Prevention of\n\nCommencement\n\n24.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  day  to  be  fixed  by\n\n\fPREVENTION OF CORRUPTION BILL, 2019\n\nEXPLANATORY MEMORANDUM\n\nThe Prevention of Corruption Bill, 2019 would provide for the prevention,\n\ninvestigation and prosecution of acts of corruption.\n\nPART IPRELIMINARY\n\nClause 1:\n\nprovides the short title.\n\nClause 2:\n\nprovides definitions for certain terms used in the legislation.\n\nClause 3:\n\nexplains the concepts of offering, soliciting and accepting an\nadvantage.\n\nPART IIACTS OF CORRUPTION - OFFENCES AND PENALTIES\n\nClause 4:\n\nmakes  it  an  offence  to  bribe  persons  exercising  public\nfunctions.\n\nClause 5:\n\nmakes it an offence to bribe a foreign public official.\n\nClause 6:\n\nClause 7:\n\nClause 8:\n\nmakes  it  an  offence  to  an  official  of  a  public  international\norganisation.\n\nmakes it illegal for a person to offer or accept a bribe to use\nhis  influence  in  order  for  another  person  to  obtain  an\nadvantage from a public authority.\n\nprohibits  an  employee  from  acquiring  a  private  interest  in\ncontracts, agreement or investments of a public authority, in\ncertain circumstances.\n\ni\n\n\fPrevention of Corruption Bill, 2019\n\nClause 9:\n\nClause 10:\n\nClause 11:\n\nmakes it an offence, among other things, to offer or accept a\nbribe in relation to the promotion, procuring or execution of\na contract with a public authority.\n\nmakes  it  illegal  to  offer  or  accept  a  bribe  in  relation  to\nrefraining from bidding an at auction of a public authority.\n\nmakes it an offence for an agent to accept a bribe as regards\nhis obligations to his principal.\n\nClause 12:\n\nproscribes bribery in the private sector.\n\nClause 13:\n\nspecifies the penalties for acts of corruption.\n\nClause 14:\n\ndisqualifies  a  person  convicted  of  an  offence  from  holding\npublic office for 5 years.\n\nPART IIIINVESTIGATIONS\n\nClause 15:\n\nClause 16:\n\nClause 17:\n\nallows an investigative officer to obtain a disclosure order to\nrequire persons to provide information.\n\nprovides for a warrant to be issued for the search of premises\nand the seizure of material.\n\nmakes it an offence to tip off someone, among other things,\nabout the conduct of an investigation.\n\nPART IV EVIDENCE\n\nClause 18:\n\nprovides for evidence that an accused has property for which\nhe  cannot  give  a  satisfactory  account  to  be  used  for\ncorroboration and as evidence that he accepted an advantage.\n\nii\n\n\fClause 19:\n\nClause 20:\n\nClause 21:\n\nClause 22:\n\nClause 23:\n\nClause 24:\n\nPrevention of Corruption Bill, 2019\n\nallows for a presumption of corruption to be made in certain\ncases.\n\ndisallows  the  use  of  certain  defences  including  that  the\noffering or accepting of an advantage is customary in certain\nprofessions or trades.\n\nPART VMISCELLANEOUS\n\nmakes it an offence to knowingly make a false allegation of\ncorruption.\n\nprovides for the Minister to make Regulations to give effect\nto the legislation.\n\nrepeals the Prevention of Corruption Act, Cap. 144 and the\nPrevention of Corruption Act, 2012 (Act 2012-31).\n\nprovides  for  the  legislation  to  come  into  effect  upon\nProclamation.\n\niii\n\n"
}