{
  "bill_id": 462,
  "slug": "caribbean-community-movement-of-skilled-nationals-amendment-bill-2019",
  "title": "Caribbean Community (Movement of Skilled Nationals) (Amendment) Bill, 2019",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/6a0fd4ba6d94b2d35b00219e37674d0c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-02-12",
  "first_reading": "2020-02-14",
  "gazette_date": "2020-01-16",
  "markdown": "Corrected Copy: 2019-12-04\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Caribbean  Community  (Movement  of  Skilled\n\nNationals) Act, Cap. 186A\n\n(a)\n\n(b)\n\nto revise the categories of persons who are eligible to be recognised as\nskilled community nationals;\n\nto revise provisions relating to the indefinite stay of skilled community\nnationals and dependants of skilled community nationals in Barbados;\nand\n\n(c)\n\nfor related matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 186A\n\nAmendment of Cap. 186A\n\nRepeal and replacement of section 3 of Cap. 186A\n\nRepeal and replacement of section 4 of Cap. 186A\n\nRepeal and replacement of section 5 of Cap. 186A\n\nRepeal of sections 6 and 7 of Cap. 186A\n\nAmendment of section 8 of Cap. 186A\n\nAmendment of section 9 of Cap. 186A\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nAmendment of section 10 of Cap. 186A\n\n11.\n\nInsertion of section 10A into Cap. 186A\n\n12.\n\nRepeal and replacement of section 11 of Cap. 186A\n\n13.\n\nAmendment of Schedules to Cap. 186A\n\n14.\n\nAmendments of certain enactments\n\n\f3\n\nFIRST SCHEDULE\n\nSECOND SCHEDULE\n\nTHIRD SCHEDULE\n\nFOURTH SCHEDULE\n\nFIFTH SCHEDULE\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  amend  the  Caribbean  Community  (Movement  of  Skilled\n\nNationals) Act, Cap. 186A\n\n(a)\n\n(b)\n\nto revise the categories of persons who are eligible to be recognised as\nskilled community nationals;\n\nto revise provisions relating to the indefinite stay of skilled community\nnationals  and  the  dependants  of  skilled  community  nationals  in\nBarbados; and\n\n\f6\n\n(c)\n\nfor related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\nSkilled Nationals) (Amendment) Act, 2019.\n\nThis Act may be cited as the Caribbean Community (Movement of\n\nAmendment of section 2 of Cap. 186A\n\n2.\nCap. 186A, in this Act referred to as the principal Act, is amended\n\nThe Caribbean Community (Movement of Skilled Nationals) Act,\n\n(a)\n\n(b)\n\nby renumbering section 2 as section 2(1);\n\nin subsection (1) of section 2,\n\n(i)\n\nby inserting in the appropriate alphabetical order the following\ndefinitions:\n\n“ “agricultural worker” means a person who holds a\n\n(a)\n\n(b)\n\n(c)\n\nCVQ or NVQ;\n\nqualification from the Caribbean Examinations Council; or\n\ncertificate from an agency which a Member State permits to\nissue certificates which confirms that the person possesses\npractical experience,\n\nin the field of agriculture;\n\n“artisan” means a person who\n\n(a)\n\n(b)\n\nis a skilled trades person, craftsman or worker; and\n\nholds  a  CVQ  in  craft  and  related  trades  or  in  plant  and\nmachine operations;\n\n\f7\n\n“artiste” means a person who is active in or qualified to enter a field of\nart  for  the  purpose  of  earning  a  living  and  includes  a  person\nspecified in Part I of the Sixth Schedule;\n\n“authorised agency” means an agency of a Member State authorised to\ncertify that a national engages in an occupation listed in paragraph\n2 of Part B of the First Schedule;\n\n“Caribbean Examinations Council” has the meaning assigned to it in\nsection 2 of the Caribbean Examinations Council (Examinations)\nAct, Cap. 39A;\n\n“Chief  Immigration Officer” has the meaning assigned to it in section\n\n2 of the Immigration Act, Cap. 190;\n\n“Commissionerof  Police” has the meaning assigned to it in section 2\n\nof the Police Act, Cap. 167;\n\n“competent authority” means an agency which a Member State permits\n\nto issue a qualifying certificate;\n\n“controlled drug”  has the meaning assigned to it in section 2(1) of the\n\nDrug Abuse (Prevention and Control) Act, Cap. 131;\n\n“CVQ”  means  a  Caribbean  Vocational  Qualification  issued  by  a\n\nnational training authority;\n\n“graduate” means a person who has obtained at least\n\n(a)\n\n(b)\n\na bachelor’s degree; or\n\na professional qualification which is equivalent to at least a\nbachelor’s degree,\n\nfrom a university or other institution of higher learning which is\nrecognised or approved by the Minister responsible for Education;\n\n“household  domestic”  means  a  person  who  holds  a  CVQ  or  an\nequivalent  qualification  in  domestic  cleaning,  domestic  help  or\ndomestic house keeping;\n\n\f8\n\n“immigration officer”  has the meaning assigned to it in section 2 of\n\nthe Immigration Act, Cap. 190;\n\n“media  person”  means  a  person  whose  primary  source  of  income  is\nfrom the media or media related work or is qualified to enter the\nfield of media and includes a person specified in Part II of the Sixth\nSchedule;\n\n“Member State” means a member State of the Caribbean Community\n\nspecified in the Second Schedule;\n\n“musician” means a person who is active in or qualified to enter a field\nof music for the purpose of earning a living and includes a person\nspecified in Part III of the Sixth Schedule;\n\n“narcotic drug”  has the meaning assigned to it in section 2(1) of the\n\nDrug Abuse (Prevention and Control) Act, Cap. 131;\n\n“national training authority” means a training authority authorised by\n\na Member State to issue a CVQ or an NVQ;\n\n“NVQ” means a National Vocational Qualification issued by a national\n\ntraining authority;\n\n“nurse” means a person who\n\n(a)\n\n(b)\n\nhas successfully completed a basic or higher level training\nfor nurses; and\n\nis registered as a nurse with a General Nursing Council of a\nMember State;\n\n“security guard” means a person who\n\n(a)\n\n(b)\n\nholds  a  CVQ  in  security  operations  or  any  equivalent\nqualification; and\n\nis registered with an agency which a Member State permits\nto licence and register security guards;\n\n\f9\n\n“skilled community national”  means any national of a Member State\n\nwho is recognised by the Minister as a\n\n(a)\n\n(b)\n\nholder  of  a  qualification  specified  in  Part  A  of  the  First\nSchedule; or\n\nperson who engages in an occupation listed in Part B of the\nFirst Schedule;\n\n“sports person” means a person who is active in or qualified to enter a\nfield of sport for the purpose of earning a living as a professional\nor semi-professional in respect of that sport and includes a person\nspecified in Part IV of the Sixth Schedule;\n\n“teacher” means a person who has successfully completed a teacher\npreparation programme with an institution which is recognised or\napproved  by  the  Minister  responsible  for  Education  as  an\ninstitution which offers teacher education;”;\n\n(ii)\n\n(iii)\n\nby  deleting  the  definitions  “Community  national”  and\n“qualifying Caribbean Community state”;\n\nby  deleting  the  definition  “national”  and  substituting  the\nfollowing:\n\n“  “national”  means  a  person  referred  to  in  Article  32(5)  of  the\n\nTreaty;”;\n\n(iv)\n\nby  deleting\nsubstituting the following:\n\nthe  definition  “qualifying  certificate”  and\n\n“  “qualifying  certificate”  means  a  Certificate  of  Recognition  of\nCaribbean Community Skills issued by a competent authority or\na competent Minister of a Member State;”;\n\n(c)\n\nby inserting the following subsection immediately after subsection\n(1) as renumbered:\n\n\f10\n\nFor the purposes of this Act, agriculture does not include fishing\n\n“(2)\nor forestry.”.\n\nAmendment of Cap. 186A\n\n3.\n\nThe principal Act is amended by deleting the words\n\n(a)\n\n(b)\n\n“Community  national”  wherever  they  appear  and  substituting  the\nwords “skilled community national”; and\n\n“qualifying Caribbean Community state” wherever they appear and\nsubstituting the words “Member State”.\n\nRepeal and replacement of section 3 of Cap. 186A\n\n4.\nthe following:\n\nThe principal Act is amended by deleting section 3 and substituting\n\n“Provisional entry of nationals and dependants\n\n3.(1)\nNotwithstanding the provisions of any law, and subject to\nsubsection (3), section 8 and section 10A, an immigration officer shall\nat a port of entry permit\n\n(a)\n\n(b)\n\na skilled community national to whom this section applies;\nand\n\nwhere applicable, any dependant of that skilled community\nnational,\n\nto enter Barbados for a period of 6 months.\n\nA skilled community national who enters Barbados pursuant to\n(2)\nsubsection (1) is permitted to engage in employment without a work\npermit.\n\n\f11\n\n(3)\n\nThis section applies to a skilled community national who\n\n(a)\n\n(b)\n\n(c)\n\nis the holder of a valid passport issued by a Member State;\n\nhas  a  right  to  enter  and  seek  employment  in  Barbados\npursuant to Article 46 of the Treaty; and\n\npresents to the immigration officer, on entry into Barbados,\na  qualifying  certificate  and  a  valid  passport  issued  by  a\nMember State.”.\n\nRepeal and replacement of section 4 of Cap. 186A\n\n5.\nthe following:\n\nThe principal Act is amended by deleting section 4 and substituting\n\n“Indefinite entry\n\n4.(1)\nWhere  a  skilled  community  national,  other  than  a  skilled\ncommunity  national  of  Barbados,  wishes  to  enter  Barbados  for  an\nindefinite period, he shall\n\n(a)\n\nsubmit\n\n(i)\n\n(ii)\n\nan  application  in  the  form  set  out  in  Part  I  of  the\nSeventh Schedule;\n\nany  documents  as  required  by  the  Council  with  the\napplication; and\n\n(b)\n\npay the fees set out in Part II of the Seventh Schedule,\n\nto the Council.\n\nThe Council shall on the presentation of the qualifying certificate\n(2)\nverify with the competent authority or Minister in the relevant Member\nState that the qualifying certificate is a valid certificate issued by that\ncompetent authority or Minister to the skilled community national.\n\n\f12\n\n(3)\nWhere  the  Council  verifies  that  the  qualifying  certificate  is  a\nvalid certificate, the Council shall notify the skilled community national\nin writing of the verification and forward a copy of the notice to the\nChief Immigration Officer.\n\nWhere  the  skilled  community  national  receives  notice  in\n(4)\naccordance with subsection (3), the skilled community national shall\nsubmit his passport, where applicable, the passport of any dependant\nand  the  notification  referred  to  in  subsection  (3)  to  the  Chief\nImmigration Officer.\n\nWhere the Chief Immigration Officer receives passports and a\n(5)\nnotification  pursuant  to  subsection  (4),  he  shall  stamp  the  words\n“indefinite entry” in each passport.\n\nNotwithstanding subsections (4) and (5), a dependant of a skilled\n(6)\ncommunity national referred to in subsection (3) is permitted to remain\nin Barbados on the condition that the skilled community national lives\nin Barbados in accordance with the provisions of this Act and, where\napplicable, the Immigration Act, Cap. 190.”.\n\nRepeal and replacement of section 5 of Cap. 186A\n\n6.\nthe following:\n\nThe principal Act is amended by deleting section 5 and substituting\n\n“Certificate of Recognition\n\n5.(1)\nshall\n\nA national who desires to obtain a Certificate of Recognition\n\n(a)\n\nsubmit\n\n(i)\n\nan application in the form set out in Part I of the Third\nSchedule;\n\n\f13\n\n(ii)\n\nany  documents  as  required  by  the  Council  with  the\napplication; and\n\n(b)\n\npay  the  application  fee  set  out  in  Part  II  of  the  Third\nSchedule,\n\nto the Council.\n\nWhere  the  national  referred  to  in  subsection  (1)  satisfies  the\n(2)\nrequirements  for  recognition  as  a  skilled  community  national,  the\nCouncil shall\n\n(a)\n\nissue  the  national  with  a  Certificate  of  Recognition  as\nprescribed by the Fourth Schedule; and\n\n(b)\n\nso inform the Minister.\n\nThe Council may refuse to issue a Certificate of Recognition to\n\n(3)\na person\n\n(a)\n\n(b)\n\n(c)\n\nreferred to in section 8;\n\nwho has been convicted of an offence under section 11; or\n\nwho has been convicted of an offence under the laws of a\nMember State which is similar to an offence under section\n11.\n\nWhere a person obtains a Certificate of Recognition pursuant to\n(4)\nthis Act and is convicted of an offence under section 11, the Council\nshall cancel the Certificate of Recognition.”.\n\nRepeal of sections 6 and 7 of Cap. 186A\n\n7.\n\nSections 6 and 7 of the principal Act are repealed.\n\n\f14\n\nAmendment of section 8 of Cap. 186A\n\n8.\nafter subsection (4) the following:\n\nSection 8 of the principal Act is amended by inserting immediately\n\nThe Chief Immigration Officer shall inform the Council of any\n\n“(5)\nperson to whom this section applies. ”.\n\nAmendment of section 9 of Cap. 186A\n\n9.\nand substituting the following:\n\nSection 9 of the principal Act is amended by deleting subsection (2)\n\nA  dependant  of  a  skilled  community  national  referred  to  in\n“(2)\nsubsection (1) is permitted to engage in employment without a work\npermit.”.\n\nAmendment of section 10 of Cap. 186A\n\n10.\nand substituting the following:\n\nSection 10 of the principal Act is amended by deleting subsection (2)\n\nAny  decision  of  the  Minister  to  revoke  permission  under\n\n“(2)\nsubsection (1) shall be made in the interest of\n\n(a)\n\nprotecting national security, public morality, public order and\nsafety or public health; or\n\n(b)\n\npreventing a charge on public funds.”.\n\nInsertion of section 10A into Cap. 186A\n\n11.\n10 the following section:\n\nThe principal Act is amended by inserting immediately after section\n\n\f15\n\n“Unlawful entry into Barbados\n\n10A.\nNothing in this Act shall be construed as conferring the right\nto enter or remain in Barbados on any person who has entered Barbados\notherwise than in accordance with this Act or, where applicable, the\nImmigration  Act,  Cap.  190  and  the  Minister  responsible  for\nImmigration may make a deportation order against such person.”.\n\nRepeal and replacement of section 11 of Cap. 186A\n\n12.\nthe following:\n\nThe principal Act is amended by deleting section 11 and substituting\n\n“Offences and penalties\n\n11.(1)\nperson\n\n(a)\n\nA  person  commits  an  offence  under  this  Act  where  the\n\nfor the purposes of procuring a Certificate of Recognition or\nseeking permission to enter Barbados for an indefinite period\npursuant to this Act\n\n(i)\n\n(ii)\n\n(iii)\n\nrecklessly makes a statement for himself or any other\nperson, knowing the statement to be false in a material\nparticular;\n\nknowingly  submits  false  or  forged  documents  to  the\nCouncil; or\n\nknowingly submits documents to the Council which are\nfraudulently obtained;\n\n\f16\n\n(b)\n\nfor the purpose of seeking permission under this Act to enter\nBarbados pursuant to Article 45 or 46 of the Treaty\n\n(i)\n\n(ii)\n\n(iii)\n\nrecklessly makes a statement for himself or any other\nperson, knowing the statement to be false in a material\nparticular;\n\nknowingly  submits  a  false  or  forged  qualifying\ncertificate to an immigration officer; or\n\nknowingly  submits  to  an  immigration  officer  a\nqualifying  certificate  which  has  been  fraudulently\nobtained;\n\n(c)\n\nknowingly uses a qualifying certificate issued by a competent\nauthority or a Minister of a Member State, who is responsible\nfor  the  issuance  of  qualifying  certificates,  that  has  been\ncancelled  by\nthe  competent  authority  or  Minister,\nrespectively; or\n\n(d)\n\nutters or has in his possession a qualifying certificate that is\nfraudulently obtained or forged.\n\nA  person  who  commits  an  offence  under  this  Act  is  liable  on\n(2)\nsummary conviction to a fine of $50 000 or to imprisonment for a term\nof 5 years or to both.\n\nWhere a court convicts a person in accordance with this section,\n\n(3)\nthe court shall notify the Council of the conviction.\n\nWhere a person is convicted of an offence under this section, any\n\n(4)\npermission granted to\n\n(a)\n\n(b)\n\nthe person; and\n\nwhere applicable, his dependant,\n\nunder this Act is revoked.\n\n\f17\n\n(5)\nThe Commissioner of Police and the Chief Immigration Officer\nshall advise the Council of any person who has been convicted under\nthe laws of any Member State of an offence similar to an offence under\nthis section.”.\n\nAmendment of Schedules to Cap. 186A\n\n13.(1)\n\nThe principal Act is amended by\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\ndeleting the First Schedule and substituting the Schedule as set out\nin the First Schedule to this Act;\n\ndeleting the Third Schedule and substituting the Schedule as set out\nin the Second Schedule to this Act;\n\ndeleting the Fourth Schedule and substituting the Schedule as set out\nin the Third Schedule to this Act; and\n\ninserting immediately after the Fifth Schedule, the Sixth Schedule\nand the Seventh Schedule as set out in the Fourth Schedule to this\nAct.\n\n(2)\n\nThe Fifth Schedule to the principal Act is amended by\n\n(a)\n\ndeleting the words “Prohibited Community Nationals” appearing in\nthe heading to the Schedule and substituting the words “Prohibited\nPersons”;\n\n(b)\n\ndeleting  paragraph  4  of  the  Fifth  Schedule  and  substituting  the\nfollowing:\n\n“4.(1)\n\nPersons who\n\n(a)\n\nare or have been at any time engaged or reasonably suspected\nof  being  likely  to  engage  in  the  unlawful  giving  or  using,\noffering or exposing for sale or buying of any drug or in the\nunlawful trading or trafficking in any drug; or\n\n\f18\n\n(b)\n\nhave  been  convicted  of  any  offence  under  any  enactment\nrelating to dangerous or narcotic drugs, other than persons\nreferred to in paragraph 5 who have been convicted of the\noffence of possession of a controlled drug under the Drug\nAbuse (Prevention and Control) Act, Cap. 131, the amount\nof which was less than a trafficable quantity.\n\n(2)\n\nSub-paragraph (1)(b) does not apply to persons who\n\n(a)\n\nhave been convicted of one offence only of the possession of\ncannabis,  the  amount  of  which  was  less  than  a  trafficable\nquantity; and\n\n(b)\n\nwhose sentence in respect of that offence was a non-custodial\nsentence.”.\n\nAmendments of certain enactments\n\nThe enactments set out in the first column of the Fifth Schedule to\n14.\nthis  Act  are  amended  in  the  manner  set  out  opposite  thereto  in  the  second\ncolumn.\n\n\f19\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of Barbados    FIRST SCHEDULE(Section 13(1)(a))\"FIRST SCHEDULE(Sections 2 and 12(1)(c))PART AQualiﬁ cations1. A degree or equivalent qualiﬁ cation from the University of the West Indies,  University of Guyana, University of Suriname or any other university or  institution of higher learning or equivalent institution approved by the Minister   responsible for Education. 2. An associate degree or a comparable qualiﬁ cation from an institution approved by  the Minister responsible for Education.3. Any qualiﬁ cation or combination of qualiﬁ cations speciﬁ ed in a list prescribed by   the Minister by order published in the Ofﬁ cial Gazette as a list of qualiﬁ cations or   combinations of qualiﬁ cations satisfying the qualiﬁ cation requirements of this Act. 4. A certiﬁ cate from any authority designated by the Minister by order as an accrediting   authority for the purposes of this Act, attesting that qualiﬁ cations possessed by the   applicant satisfy the conditions for recognition of Caribbean Community skills   qualiﬁ cation.   The authority referred to in this paragraph includes(a) an institution or other body, whether incorporated or not, whether or not  established under the authority of the Government of Barbados or any  other Member State, whether or not established under any written law, and whether or not situated in Barbados;(b) any person designated as holding an ofﬁ ce in any institution or other  body in sub-paragraph (a); and(c) any public ofﬁ cer appearing to the Minister to have technical expertise  in the assessment of qualiﬁ cations.\f20\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of Barbados    First Schedule - (Concl'd)PART BOccupations1. Persons certiﬁ ed by a competent authority as representing a Member State as sports  persons, media workers, artistes or musicians.2. Agricultural workers, artisans, household domestics and security guards certiﬁ ed as   such by an authorised agency or a competent authority. 3. Nurses and teachers.\".    \f21\n\n L.R.O. 1998SECOND SCHEDULE(Section 13(1)(b))\"THIRD SCHEDULE(Section 5)PART ICARIBBEAN COMMUNITY (MOVEMENT OF SKILLED NATIONALS) ACTCap. 186AAPPLICATION FORM FOR CERTIFICATE OF RECOGNITIONINSTRUCTIONS• Where applicable, please attach the following with the application form:• Birth certiﬁ cate• Proof of status as a Caribbean Community national• Marriage certiﬁ cate• Undergraduate, postgraduate or professional qualiﬁ cation (if the original document is not in English, please submit a certiﬁ ed translation of the document in English from a campus of the University of the West Indies, the Barbados Community College or a relevant Embassy or Consulate)• Passport (copy of bio-data in passport and date of issue and expiry date of passport)• Two passport size photographs (name of applicant in block letters at back of photographs)\f22\n\n L.R.O. 1998 1. Full name of applicant: Mr./Mrs./Miss 2. Category of skill: Media Person   Artiste   Musician   Artisan   Sports Person   Nurse   Teacher   Household Domestic   Agricultural Worker   Security Guard   Graduate   Holder of an Associate Degree or a Comparable Qualiﬁ cation 3. Date of birth: 4. Sex: Male Female 5. Nationality: 6. Place of birth: 7. (a) Passport number:  (b) Expiration date of passport:  (c) Country which issued passport:Second Schedule - (Cont'd)Date/Month/YearCountryNationalityPassport NumberFamily Name/First Name/Middle Name(s) (in capitals)Date/Month/YearCountry\f23\n\n L.R.O. 1998 8. Marital status: 9. Current permanent residential address:10. Telephone number (local):11. Where applicable, telephone number (overseas):12. Email address:13. Where applicable, name of professional agency applicant is registered with and the address and telephone number of the professional agency:(Area Code)-Telephone NumberEmail AddressName of AgencyAddress of Agency(Area Code)-Telephone Number of AgencyCurrent Permanent Residential AddressTelephone NumberSecond Schedule - (Cont'd)Status\f24\n\n L.R.O. 1998DECLARATIONI the applicant hereby declare that Ihave knowledge of the categories of prohibited persons as set out in the Fifth Schedule to the Caribbean Community (Movement of Skilled Nationals) Act, Cap. 186A and I hereby declare that I am not a prohibited person within the meaning of that Act.Sworn before:PRINT NAME:Ofﬁ cial Stamp:SignatureJustice of the Peace/Notary PublicName of ApplicantSignature of ApplicantDate/Month/YearFull Name (in capitals)Second Schedule - (Cont'd)\f25\n\n L.R.O. 1998FOR OFFICIAL USE ONLYCategory of skill:Agency:I certify that the above named applicantqualiﬁ es for recognition under the CaribbeanCommunity (Movement of Skilled Nationals)Act, Cap. 186A.Authorised Ofﬁ cer:Authorised Signature:Ofﬁ cial Stamp:Date:SkillName of AgencyPrint Name in CapitalsSignature of Ofﬁ cerDay/Month/YearBARBADOS ACCREDITATION COUNCILAuthorised Ofﬁ cer:Authorised Signature:Ofﬁ cial Stamp:Date:Print Name in CapitalsSignature of Ofﬁ cerDay/Month/YearApprovedNot ApprovedSecond Schedule - (Cont'd)\f26\n\n L.R.O. 1998PART IIApplication FeeColumn 1Application for Certiﬁ cate of RecognitionColumn 2$100.00\".Second Schedule - (Concl'd)\f27\n\nL.R.O. 1998THIRD SCHEDULE(Section 13(1)(c))\"FOURTH SCHEDULE(Sections 2 and 5(2))Caribbean Community (Movement of Skilled Nationals) ActCap. 186ACERTIFICATE OF RECOGNITION OF CARIBBEAN COMMUNITY SKILLSCertiﬁ cate No.: WHEREAS  has applied to the Barbados Accreditation Council for a Certificate of Recognition ofCaribbean Community Skills in reliance on the requirements set out hereto, and has satisﬁ edthe Barbados Accreditation Council that the conditions laid down in the Caribbean Community(Movement of Skilled Nationals) Act, Cap. 186A for the grant of a Certificate ofRecognition of Caribbean Community Skills have been fulﬁ lled in respect of the skill of  . NOW THEREFORE the Barbados Accreditation Council in exercise of the powersconferred on it by section 5(2)(a) of the Caribbean Community (Movement of SkilledNationals) Act, Cap. 186A hereby issues to this Certificate of Recognition of Caribbean Community Skills in respect of the skill of  .Place passport size of PhotographFull NameName of SkillFull NameName of Skill\f28\n\n L.R.O. 1998Full Name:Current Permanent Residential Address:Place of Birth:Date of Birth:Nationality:Passport No.:Expiration Date of Passport:Country which Issued Passport:Marital Status: Issued by the Council this day of , 20 .Third Schedule - (Concl'd)Caribbean Community (Movement of Skilled Nationals) ActCap. 186ACERTIFICATE OF RECOGNITION OF CARIBBEAN COMMUNITY SKILLS - (Concl'd)Date/Month/YearChairman/Deputy Chairman of the Barbados Accreditation CouncilAfﬁ x Sealof BarbadosAccreditation Council\f29\n\n FOURTH SCHEDULE(Section 13(1)(d))\"SIXTH SCHEDULE(Section 2)PART IARTISTESVisual Artiste: 1. Fine artist  2.  Costume builder3. Costume designer 4. Fashion designer5. Set designer6. Make-up artist7. Stylist8. Interior designer9. Textile designer10.  Architect11.  Landscape artist12. Graphic artist13. Print makerPerformance Artiste:1. Dancer2. Actor3. Choreographer4. Director5. Performance poet6.  Story-teller7.  Folk performer8.  Puppeter\f30\n\n Fourth Schedule - (Cont'd)Literary Artiste:1.  Creative writer2. Novelist 3. Poet4.    Essayist5. Short-story writer6.  Play writer7. Script writer8.  LyricistCultural Worker, Manager or Technician:1. Producer2. Stage manager3. Lighting designer4.     Lighting technician5. Sound design6.  Sound technician7.  Arts administrator8.  Production assistant\f31\n\n PART IIMEDIA PERSONS  1. Editor  2. Sub-editor  3. Administrator of an editorial department, a programming department or a   newsroom department  4.  Media manager  5. Reporter  6.  Producer  7.  Announcer  8.  Broadcaster  9.  Camera operator 10. Sound engineer 11.  Video technician 12.  Production worker in print and electronic media 13.  Graphic artist 14.  Cartoonist 15.  PhotographerPART IIIMUSICIANS1.  Player of a musical instrument2. Singer3. Songwriter4.  Band or orchestra leader5. Conductor6.  Promoter7.  Events managerFourth Schedule - (Cont'd)\f32\n\n PART IVSPORTS PERSONS1.  Athlete2. Coach3. Team leader4.     Sports manager5. Sports promoter6.  Massage therapist7.  Events managerFourth Schedule - (Cont'd)\f33\n\n SEVENTH SCHEDULE(Section 4)PART ICARIBBEAN COMMUNITY (MOVEMENT OF SKILLED NATIONALS) ACTCap. 186AAPPLICATION FORM FOR INDEFINITE STAYINSTRUCTIONSWhere applicable, please attach the following with the application form:• Passport (copy of bio-data in passport and date of issue and expiry date of passport)• Passport (copy of bio-data in passport and date of issue and expiry date of passport) of dependant(s)• Two passport size photographs of applicant (place name of applicant name in block letters at back of photographs)• Two passport size photographs of dependant(s) (place name of  dependant name in block letters at back of photographs)• Marriage certiﬁ cate• Qualifying certiﬁ cateFourth Schedule - (Cont'd)\f34\n\n  1. Full name of applicant: Mr./Mrs./Miss 2. Category of skill: Media Person   Artiste   Musician   Artisan   Sports Person   Nurse   Teacher   Household Domestic   Agricultural Worker   Security Guard   Graduate   Holder of an Associate Degree or a Comparable   Qualiﬁ cation 3. Date of birth: 4. Sex: Male Female 5. Nationality: 6. Place of birth: 7. (a) Passport number:  (b) Expiration date of passport:  (c) Country which issued passport: Date/Month/YearCountryNationalityPassport NumberDate/Month/YearCountryFourth Schedule - (Cont'd)Family Name/First Name/Middle Name(s) (in capitals)\f35\n\n  8. Marital status: 9. • Current permanent residential address:  • Where applicable, intended address in Barbados:10. Telephone number (local):11. Where applicable, telephone number (overseas):12. Email address:13. Where applicable, name of professional agency applicant is registered  with and the address and telephone number of the professional agency:Telephone Number(Area Code)-Telephone NumberEmail AddressName of AgencyAddress of AgencyTelephone Number of AgencyFourth Schedule - (Cont'd)StatusCurrent Permanent Residential AddressIntended Address\f36\n\n 14. Where applicable, information on dependant(s):• Full name of dependant:(a) Date of birth:(b) Sex: Male Female(c) Nationality:(d) Place of birth:(e) Passport number:(f) Expiration date of passport:(g) Country which issued passport:(h) • Current permanent residential address:  • Where applicable, intended address in Barbados:(i) • Telephone number (local):  • Where applicable, telephone number (overseas):(j) Relationship to applicant:Date/Month/YearCountryNationalityPassport NumberDate/Month/YearCountryCurrent Permanent Residential AddressFamily Name/First Name/Middle Name(s) (in capitals)Intended AddressRelationshipFourth Schedule - (Cont'd)Telephone Number(Area Code)-Telephone Number\f37\n\n Fourth Schedule - (Cont'd)• Full name of dependant:(a) Date of birth:(b) Sex: Male Female(c) Nationality:(d) Place of birth:(e) Passport number:(f) Expiration date of passport:(g) Country which issued passport:(h) • Current permanent residential address:  • Where applicable, intended address in Barbados:(i) • Telephone number (local):  • Where applicable, telephone number (overseas):(j) Relationship to applicant:Date/Month/YearCountryNationalityPassport NumberDate/Month/YearCountryCurrent Permanent Residential AddressFamily Name/First Name/Middle Name(s) (in capitals)Intended AddressRelationshipTelephone Number(Area Code)-Telephone Number\f38\n\n Fourth Schedule - (Cont'd)• Full name of dependant:(a) Date of birth:(b) Sex: Male Female(c) Nationality:(d) Place of birth:(e) Passport number:(f) Expiration date of passport:(g) Country which issued passport:(h) • Current permanent residential address:  • Where applicable, intended address in Barbados:(i) • Telephone number (local):  • Where applicable, telephone number (overseas):(j) Relationship to applicant:CountryNationalityPassport NumberDate/Month/YearCountryCurrent Permanent Residential AddressFamily Name/First Name/Middle Name(s) (in capitals)Intended AddressRelationshipTelephone Number(Area Code)-Telephone Number\f39\n\n • Full name of dependant:(a) Date of birth:(b) Sex: Male Female(c) Nationality:(d) Place of birth:(e) Passport number:(f) Expiration date of passport:(g) Country which issued passport:(h) • Current permanent residential address:  • Where applicable, intended address in Barbados:(i) • Telephone number (local):  • Where applicable, telephone number (overseas):(j) Relationship to applicant:CountryNationalityPassport NumberDate/Month/YearCountryCurrent Permanent Residential AddressFamily Name/First Name/Middle Name(s) (in capitals)Intended AddressRelationshipFourth Schedule - (Cont'd)Telephone Number(Area Code)-Telephone Number\f40\n\n • Full name of dependant:(a) Date of birth:(b) Sex: Male Female(c) Nationality:(d) Place of birth:(e) Passport number:(f) Expiration date of passport:(g) Country which issued passport:(h) • Current permanent residential address:  • Where applicable, intended address in Barbados:(i) • Telephone number (local):  • Where applicable, telephone number (overseas):(j) Relationship to applicant:CountryNationalityPassport NumberDate/Month/YearCountryCurrent Permanent Residential AddressFamily Name/First Name/Middle Name(s) (in capitals)Intended AddressRelationshipFourth Schedule - (Cont'd)Telephone Number(Area Code)-Telephone Number\f41\n\n DECLARATIONI , the applicant, herebydeclare that the information I have provided on this form is correct and that thequalifying certiﬁ cate presented was issued to me by theofI also understand that Barbados has the right to reject my application for indeﬁ nitestay if I am found to be undesirable pursuant to Article 226 of the Revised Treatyof Chaguaramas establishing the Caribbean Community including the CARICOMSingle Market and Economy.Name of ApplicantName of Competent Authority/Title of Competent MinisterMember StateSignature of ApplicantDate/Month/YearFourth Schedule - (Cont'd)\f42\n\n PART IIFeesColumn 1Application for indeﬁ nite stayVeriﬁ cation of qualifying certiﬁ cateColumn 2$200.00   $100.00\".Fourth Schedule - (Concl'd)\f43\n\n FIFTH  SCHEDULE(Section 13)CONSEQUENTIAL  AMENDMENTSColumn 1Enactments1. Barbados Accreditation  Council, Cap. 38AColumn 2Amendments1. In section 2(a) delete the definiton \"Certificate of Recognition\" and substitute the following:\" \"Certificate of Recognition\" means a Certificate of Recognition issued by (a) a competent authority;(b) a competent Minister of a Member State; or(c) the Council;\";(b) insert in the appropriate alphabetical order the following definitions:\" \"competent authority\" has the meaning assigned to it in section 2 of the Caribbean Community (Movement of Skilled Nationals) Act, Cap. 186A;\"Member State\" has the meaning assigned in section 2 of the Caribbean Community (Movement of Skilled Nationals) Act, Cap. 186A;\". \f44\n\n CONSEQUENTIAL  AMENDMENTS - (Cont'd)Column 1Enactments1. Barbados Accreditation  Council, Cap. 38A -  (Cont'd)Column 2Amendments2. In section 4 delete paragraph (o) and substitute the following:\"(o) grant Certiﬁ cates of Recognition in accordance with section 5(2) of the Caribbean Community (Movement of Skilled Nationals) Act, Cap. 186A;\".3. In this Act, delete(a) the words \"First Schedule\" wherever  they appear and substitute the  word \"Schedule\"; and(b) section 8, the Second Schedule and  the Third Schedule.4. In paragraph 6 of the Schedule insert the following sub-paragraph immediately aftersub-paragraph (3):   \"(4) Notwithstanding sub-paragraph (2), where  the seal of the Council is affixed to a  Certificate of Recognition, it shall be   authenticated by the signature of the   Chairman or Deputy Chairman.\". Fifth Schedule - (Cont'd)\f45\n\n CONSEQUENTIAL  AMENDMENTS - (Cont'd)Column 1Enactments2. Immigration Act, Cap. 190 Column 2Amendments1. In section 2 delete the deﬁ niton \"dependant' and substitute the following:\" \"dependant\", in relation to a person, means (a) the spouse, unless, the parties to the marriage are living apart under a deed of separation or the decree or order of a court;(b) a child or step-child under the age of 18 years;(c) a child adopted by the person in a manner recognised by law and who is under the age of 18 years; or(d) any other relative who is, by reason of age or any infirmity of body or mind, wholly dependant on that person for his subsistence;\".2. In section 17 delete subsection (1) and substitute the following: (1) A person other than(a) a person referred to in Article 32(5) of the Treaty to whom(i) the right of establishment referred to in Article 32, Article 33, paragraph (c) ofFifth Schedule - (Cont'd)\f46\n\n Column 1Enactments2. Immigration Act,  Cap. 190  - (Concl'd)Column 2Amendments Article 34, Article 36 and Article 37 of the Treaty applies;(ii) the provision of services referred to in Articles 37 and 38 of the Treaty applies; or(iii) free movement referred to in Articles 45 and 46 of the Treaty applies;(b) subject to sections 9(2), 10A and 11 of the Caribbean Community (Movement of Skilled Nationals) Act, Cap. 186A, a dependant of a person referred to in paragraph (a),may not, in Barbados, engage in anyoccupation or accept employment withoutﬁ rst having obtained a written permit for the purpose granted by the Minister.\".CONSEQUENTIAL  AMENDMENTS - (Concl'd)Fifth Schedule - (Concl'd)"
}