{
  "bill_id": 467,
  "slug": "public-transport-miscellaneous-provisions-bill-2020",
  "title": "Public Transport (Miscellaneous Provisions) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/d5e0179c90211a79042bf34556445b41.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-06-10",
  "first_reading": "2020-06-10",
  "gazette_date": "2020-02-13",
  "markdown": "2019-11-18\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  certain  enactments  consequent  upon\n\nthe\n\ncommencement of the Transport Authority Regulations, 2019.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\nShort title\n\nAmendment of enactments in Schedule\n\nSCHEDULE\n\nCONSEQUENTIAL AMENDMENTS\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend certain enactments consequent upon the commencement\n\nof the Transport Authority Regulations, 2019 (S.I. 2019 No. ).\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nProvisions) Act, 2020.\n\nThis  Act  may  be  cited  as  the  Public  Transport  (Miscellaneous\n\nAmendment of enactments in Schedule\n\n2.\nin the manner specified in Column 2 of the Schedule.\n\nThe enactments set out in Column 1 of the Schedule are amended\n\n\f5\n\n L.R.O. 1998SCHEDULE(Section 2)CONSEQUENTIAL AMENDMENTSColumn 1Enactments1. Road Trafﬁ c Act, Cap. 295.2. Transport Authority Act, Cap. 295A Column 2AmendmentsDelete section 106.Delete section 106A.In section 107,  (a) delete the words \"public service vehicles,\" in subsection (1); and  (b) delete the words \"public service vehicle,\"  wherever they appear in subsection (2).   Insert immediately after section 2, the following:  \"Construction 2A. Where a conflict arises between anenactment, with the exception of the Constitution,and the provisions of this Act, this Act and anysubsidiary legislation made under this Act shallprevail.\".Insert immeditaely after section 23, the following:\"Subsequent convictions \"23A. (1) The Authority may suspend the licence of a driver or a conductor where that driver or conductor is subsequently convicted pursuant to section 27(1)(b). (2) The Authority may suspend the permit of theowner or operator of vehicle who is subsequently convictedpursuant to section 27(2)(b).\".\f6\n\n L.R.O. 1998CONSEQUENTIAL AMENDMENTS - (Cont'd)Column 1Enactments2. Transport Authority Act, Cap. 295A - (Cont'd) Column 2AmendmentsInsert immediately after section 24, the following:\"Appointment of stands for public service vehicles  24A. The Transport Authority may, subject to theapproval of the Minister and by notice published in the Official Gazette, designate stands and parkingplaces for use exclusively by public service vehiclesplying or standing for hire, and inform the Commissionerof Police accordingly in writing.\".Delete section 27 and substitute the following:\"Special offences in respect of public service vehicles  27. (1) Any person who drives or conducts a publicservice vehicle in respect of which there is not  in existancea valid permit issued under this Act is guilty of an offenceand is liable on summary conviction,  (a) in the case of a ﬁ rst conviction, to a ﬁ ne of $1 000; and(b) in the case of a second or subsequent  conviction, to a ﬁ ne of $2 000. (2) Any owner or operator of a vehicle who uses orpermits a vehicle to be used as a public service vehicleSchedule - (Cont'd)\f7\n\n L.R.O. 1998Column 1Enactments2. Transport Authority Act, Cap. 295A - (Concl'd)3. Road Trafﬁ c Regulations, 1984 (S.I. 1984 No. 141) Column 2Amendmentson a road in contravention of this Act or the regulations is guilty of an offence and is liable on summary conviction,(a) in the case of a ﬁ rst conviction, to a ﬁ ne of $1 000; and(b) in the case of a second or subsequent  conviction, to a ﬁ ne of $2 000.\".Delete section 28.In section 29, delete subsection (2). In regulation 13, delete the words \"public service vehicle,\".In regulation 14, delete the words \"public service vehicle,\"wherever they appear.In the First Schedule,(a) delete Form E; and(b) in Form F, delete the words \"Motor Omnibus No.\" and the words \"Public Service Vehicle No.\".In Part I of the Fifth Schedule,(a) delete paragraph 5 and all the words appearing opposite thereto in the columns marked \"Description of Examination\" and \"Amount of Fees\" respectively;CONSEQUENTIAL AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f8\n\n L.R.O. 1998CONSEQUENTIAL AMENDMENTS - (Concl'd)Column 1Enactments3. Road Trafﬁ c Regulations, 1984 (S.I. 1984 No. 141) - (Concl'd) Column 2Amendments(b) in paragraph 8, delete the words \"4, 5 and 6\" and  substitute the words \"4 and 6\"; and(c) in paragraph 10, delete the words \"4, 5 and 6\" and substitute the words \"4 and 6\".In the Eleventh Schedule,(a) delete paragraphs 1, 2 and 3 and all the words appearing opposite thereto in the columns marked \"Description\" and \"Amount of Fees\" respectively;(b) in paragraph 4(1), delete sub-subparagraphs (e), (f) and (g) and all of the words appearing opposite thereto in the columns marked \"Description\" and \"Amount of Fees\" respectively; and(c) in paragraph 4(2) delete all of the words appearing in the column marked \"Description\" and substitute the words \"Duplicate licence for classes (a) to (d)\".Schedule - (Concl'd)\f9\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n"
}