{
  "bill_id": 468,
  "slug": "resolution-re-marriott-barbados-limited-harrismith-saint-philip",
  "title": "Resolution re Marriott Barbados Limited, Harrismith, Saint Philip",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/fbdac8eb709ba9377fd4ec170635de83.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-01-29",
  "first_reading": "2020-02-05",
  "gazette_date": null,
  "markdown": "2020-01-13\n\nPARLIAMENT\n\nRESOLVED  that  Parliament,  in  accordance  with  section  5  of  the  Land\n\nAcquisition Act, Cap. 228 approve the compulsory acquisition by the Crown of the parcel of\n\nland, the property of Marriott Barbados Limited, situate at Harrismith in the parish of Saint Philip\n\nin this Island, more particularly described in the Schedule hereto, for the public purposes of\n\nhousing and tourism development.\n\nAPPROVED by the House of Assembly this               day of                                     ,\n\nTwo thousand and Twenty.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                day  of                                                    ,\n\nTwo thousand and Twenty.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  the  property  of  Marriott  Barbados  Limited  situate  at\n\nHarrismith in the parish of Saint Philip in this Island formerly said to contain by estimation 10.5\n\nhectares but by recent survey found to contain by admeasurement 10.9041 hectares (or 109041.0\n\nsquare metres) made up of two parcels, namely, Parcel “A” being 8.4108 hectares (or 84108.0\n\nsquare metres) and Parcel “B” being 2.4933 hectares (or 24933.0 square metres) or thereabouts\n\nAbutting and Bounding on lands now or formerly of Samuel Waithe (Lot 330), on lands now\n\nor formerly of Peter Waterman (Lot 331), on lands now or formerly of Simon and Charamaine\n\nGrifﬁ th (Lot 338), on lands now or formerly of Leo F. Brewster (Lot 339), on an Open Space\n\non lands now or formerly of Terry K. Clarke (Lot 346), on lands now or formerly of Carlos\n\nH. S. and Wayne A. Hunte (Lot 347), on lands now or formerly of Trebla Inc. on a right of way\n\n3.66 metres wide leading to a public road in one direction, on lands now or formerly of Barlow\n\nand Pauline Lynch, on lands now or formerly of Edward B. Bowring on three sides, on the sea\n\nwith an undercut of 3.0 metres from the cliff’s edge, on an Open Space, on lands now or formerly\n\nof Wellhouse Villas Limited (Lot 1), on lands now or formerly of Garvey Corporation (Lot 5),\n\non lands now or formerly of Michael L. Rose (Lot 7), on lands now or formerly of Victor Carter\n\n(Lot 9), on lands now or formerly of  Richard J. Rawlinson (Lot 9A), on lands now or formerly of\n\nBuzinec & Co. (Lot 11), on lands now or formerly of Dawn Marie Greenidge (Lot 13), on lands\n\n\f3\n\nSCHEDULE - (Concl'd)\n\nnow or formerly of Denise A. Miller (Lot 15), on lands now or formerly of Randolph and Miriam\n\nBradshaw  (Lot  17),  on  lands  now  or  formerly  of  Vova  Khavin  (Lot  19),  on  lands  now  or\n\nformerly of Learie F. Scott (Lot 21), on lands now or formerly of Harold D. Johnson (Lot 23),\n\non lands now or formerly of Caston D. Marshall (Lot 25), on lands now or formerly of Caren\n\nRawlins  (Lot  27),  on  lands  now  or  formerly  of  Kenrick  L.  Forde  (Lot  29),  on  lands  now  or\n\nformerly  of  Laura  Beckles-Cragwell  (Lot  31),  on  lands  now  or  formerly  of  David  S.  Clarke\n\n(Lot 33) and on lands now or formerly of Charles E. U. Ledette (Lot 35) on a road leading to\n\nWellhouse in one direction and to Highway 5 in another direction, on Lots 1 and 6, on a road,\n\non Lots 5, 4, 3 and 2, on a road leading to Wellhouse in one direction and to Highway 5 in\n\nanother direction or however else the same may abut and bound as shown and delineated on a Plan\n\ncertiﬁ ed on the 12th day of September, 2017 by Camille Belgrave, Land Surveyor and recorded\n\nin the Lands and Surveys Department on the 12th day of October, 2017 as Plan No. 996/2017.\n\n\f4\n\nADDENDUM\n\n  On the 21st day of July, 2016, the Cabinet agreed to the compulsory acquisition of 10.5\n\nhectares of land the property of Marriott Corporation Barbados Limited (made up of two parcels,\n\nbeing parcel “A” 8.0 hectares and parcel “B” 2.5 hectares) situate at Harrismith in the parish of\n\nSaint Philip for the public purposes of housing and tourism development.\n\n  On  the  19th  day  of  September,  2019,  the  Cabinet  ratiﬁ ed  the  decision  of  the  21st  day\n\nof July, 2016 and agreed that the relevant Resolution with respect to the acquisition of 10.5\n\nhectares of land at Harrismith in the parish of Saint Philip for the public purposes of housing\n\nand tourism development, should be prepared for certiﬁ cation by the Attorney-General and be\n\nintroduced into Parliament.\n\n  By a recent survey, the said land is now found to contain by admeasurement 10.9041\n\nhectares (109041.0 square metres) wherein 8.4108 hectares (84108.0 square metres) being Parcel\n\n“A” and 2.4933 hectares (24933.0 square metres) being Parcel “B” as shown and delineated on\n\na Plan certiﬁ ed on the 12th day of September, 2017 by Camille Belgrave, Land Surveyor and\n\nrecorded in the Lands and Surveys Department on the 12th day of October, 2017 as Plan No. 996/2017.\n\n\f5\n\nADDENDUM - (Concl'd)\n\n  By  Notice  given  under  section  3  of  the  Land  Acquisition  Act,  Cap.  228  and  by  the\n\naforementioned  decisions  of  the  Cabinet,  the  name  of  the  landowner  appeared  as  Marriott\n\nCorporation Barbados Limited and this name should have been Marriott Barbados Limited.\n\n  In accordance with the provisions of section 5 of the Land Acquisition Act, Cap. 228, the\n\napproval of Parliament is now sought for the compulsory acquisition of the parcel of land described\n\nin the Schedule to this Resolution in order that the public purposes set out in the Resolution\n\nmay be effected and that the Crown may acquire an indefeasible title to the said parcel of land.\n\n"
}