{
  "bill_id": 469,
  "slug": "resolution-re-pine-plantation-road-saint-michael-lease-to-national-insurance-board-to-construct-building-for-fire-service",
  "title": "Resolution re Pine Plantation  Road, Saint Michael lease to National Insurance Board to construct Building  for Fire Service",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/02dc5ef9fe59910072040318749b5ae5.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-01-29",
  "first_reading": "2020-02-05",
  "gazette_date": null,
  "markdown": "2020-01-28\n\nPARLIAMENT\n\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands\n\n(Vesting and Disposal) Act, Cap. 225 approve the lease to the National Insurance Board the parcel\n\nof land, the property of the Crown, situate at Pine Plantation Road in the parish of Saint Michael\n\nin this Island more particularly described in the First Schedule to this Resolution on the terms\n\nand conditions set out in the Second Schedule to this Resolution to be used for the construction\n\nof a new headquarters for the Barbados Fire Service.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and Twenty.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and Twenty.\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL  THAT  land  the  property  of  the  Crown  situate  at  Pine  Plantation  Road\n\nin  the  parish  of  Saint  Michael  in  this  Island  containing  by  admeasurement  1.941  hectares\n\n(19  408.2  square  metres)  or  thereabouts Abutting  and  Bounding  on  a  road  on  lands  now  or\n\nformerly  of  the  Barbados  Government  (Caribbean  Examination  Council)  on  the  public  road\n\nknown as Prince Road which leads to Pine Plantation Road in one direction and to Collymore\n\nRock in another direction on other lands now or formerly of the Barbados Government and on a\n\npublic road known as Pine Plantation Road which leads to Two Mile Hill in one direction and to\n\nCollymore Rock in the other direction or however else the same may abut and bound as shown\n\nand delineated on a Plan certiﬁ ed on the 19th day of December, 2019 by Anderson R. Alleyne,\n\nLand Surveyor and recorded in the Lands and Surveys Department on the 7th day of January,\n\n2020 as Plan No. 16 of 2020 together with the buildings situated thereon.\n\n\f3\n\nSECOND SCHEDULE\n\nTERMS AND CONDITIONS\n\nThe Lessee\n\nThe Lessor\n\nNational Insurance Board\n\nGovernment of Barbados\n\nThe lease of 19 408.2 square metres or thereabouts of land together with the buildings situated\n\nthereon at Pine Plantation Road, the Pine in the parish of Saint Michael in this Island for the\n\nconstruction  of  a  new  headquarters  for  the  Barbados  Fire  Service  shall  be  executed  in\n\naccordance with the following terms and conditions:\n\n(a)\n\nthe lease shall be for a period of 30 years;\n\n(b)\n\nthe rent shall be $100.00 per annum payable yearly in advance;\n\n(c)\n\nthe  lessee  shall  not  assign,  demise,  underlet  or  otherwise  part  with  possession  or  any\n\npart thereof without the lessor's consent; and\n\n(d)\n\nthe lessor shall be responsible for all outgoings associated with use of the land inclusive\n\nof land tax.\n\n\f4\n\nADDENDUM\n\n  The area of land to be leased is part of a larger parcel of land conveyed by Deed of\n\nConveyance dated the 2nd day of March, 1945 between Mrs. John Davis Elvira Yearwood and\n\nthe Executive Committee and recorded on the 6th day of March, 1945 in Volume of Deeds 619\n\nat folio 66.\n\n  The Cabinet at its meeting held on the 16th day of January, 2020 considered Note (2020)\n\n28/MHLR.  06  and  agreed  to  the  lease  of  19  408.2  square  metres  of  land  together  with  the\n\nbuildings situated thereon at Pine Plantation Road, the Pine, in the parish of Saint Michael in\n\nthis Island to the National Insurance Board for the construction of a new headquarters for the\n\nBarbados Fire Service under the terms and conditions set out in the Second Schedule to this\n\nResolution.\n\n  In  accordance  with  the  provisions  of  section  5  of  the  Crown  Lands  (Vesting  and\n\n Disposal) Act, Cap. 225, the approval of Parliament is now sought for the lease of Crown lands\n\nto the National Insurance Board of that property described in the First Schedule on the terms and\n\nconditions set out in the Second Schedule.\n\n"
}