{
  "bill_id": 470,
  "slug": "resolution-re-maxwell-christ-church-change-of-purpose-and-lease-to-mahogany-park-inc",
  "title": "Resolution re Maxwell Christ  Church change of purpose and Lease to Mahogany Park Inc",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/6c897640c7fc009ba430b0dd0c1231d8.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-02-19",
  "first_reading": "2020-06-09",
  "gazette_date": null,
  "markdown": "2020-01-28\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  approve  the  change  of  the  public  purpose\n\nfor  which  the  parcel  of  land,  the  property  of  the  Crown  situate  at  Maxwell  in  the  parish  of\n\nChrist Church in this Island, more particularly described in the First Schedule to this Resolution\n\nwas compulsorily acquired by the Crown under the Land Acquisition Act, Cap. 228 from the\n\npublic purpose of the provision of public parking facilities to that of tourism development and\n\npublic parking.\n\nAND  FURTHER  RESOLVED  that  Parliament  in  accordance  with  section\n\n5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, approve the lease to Mahogany\n\nPark  Inc.  of  the  parcel  of  land,  being  the  property  of  the  Crown,  situate  at  Maxwell  in  the\n\nparish  of  Christ  Church  in  this  Island  and  more  particularly  described  in  the  First  Schedule\n\nto this Resolution, on the terms and conditions set out in the Second Schedule to this Resolution,\n\nto give effect to the public purpose of tourism development and public parking.\n\n\f2\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and twenty.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and twenty.\n\nPresident\n\n\f3\n\nFIRST SCHEDULE\n\nALL THAT land the property of the Crown situate at Maxwell in the parish of\n\nChrist  Church  in  this  Island  formerly  said  to  contain  by  admeasurement  1  310.5  square\n\nmetres  or  thereabouts  but  by  a  more  recent  survey  was  found  to  contain  by  admeasurement\n\n1 340.7 square metres (excluding 24.3 square metres in pavement) or thereabouts, Abutting and\n\nBounding on lands now or formerly Maxwell Park Development (access lot) on lands now or late\n\nof Valdymer L. Barnett (Lot 39) on lands now or late of Ena Alleyne and on a pavement adjoining\n\na road known as Highway 7 which leads to Oistins in one direction and Top Rock in the other\n\ndirection or however else the same may abut and bound as shown and delineated on the Plan\n\ncertiﬁ ed by Kevin R. Belgrave, Land Surveyor, on the 12th day of December, 2018 and recorded\n\nin the Lands and Surveys Department on the 9th day of January, 2019 as Plan No. 20/2019.\n\n\f4\n\nSECOND SCHEDULE\n\nTERMS AND CONDITIONS\n\n1.  The lease of 1 316.4 square metres of Crown Land situate at Maxwell in the parish of\n\nChrist Church in this Island is made between the Crown (\"the lessor\") and Mahogany\n\nPark Inc. (\"the lessee\").\n\n2.  The lease shall be for a term of 25 years with an option to renew for a further 25 years.\n\n3.  The initial rent shall be at a rate of $9,920.00 per annum, payable monthly at a rate of\n\n$826.66, during the ﬁ rst 5 years of the lease.\n\n4.  A rent review shall take place every 5 years within the rental period.\n\n5.  The rental rate at the ﬁ rst rent review shall be $19,840.00 per annum, payable monthly\n\nat a rate of $1,653.33.\n\n6.  Subsequent rent reviews shall be at a rate equivalent to 4% of the open market rental\n\nvalue of the property, but no lower than the rate at the previous rent review.\n\n7.  The lessee shall be granted a concession on the open market rental value of the property\n\nat the rates of:\n\n(a)\n\n $20,000.00 per annum in the ﬁ rst 5 years of the lease; and\n\n(b)  $55,979.40 per annum in the next 5 years of the lease.\n\n8.  The lessee shall be responsible for the payment of insurance of the property, public\n\nliability and occupier's liability of the property, payment of utilities, land taxes and\n\nother outgoings arising out of the use of the property.\n\n\f5\n\n9.  The lessee shall be responsible for insuring the property at its full reinstatement cost\n\nin the joint names of the lessor and lessee.\n\n10.  The lessee shall be responsible for renovations, repairs and maintenance of the property.\n\n11.   The property shall be kept clean and appropriately landscaped.\n\n12.  The lessee shall bear the cost of development of the property and shall comply with\n\ndevelopment planning and other statutory requirements throughout the term.\n\n13.  Either party may bring this lease to an end at any time by giving 2 years notice to the\n\nother party.\n\n14.  The lessee shall not be liable to pay a penalty where it has given notice to end the lease\n\nand has not breached any of the terms and conditions of the lease.\n\n15.  Where  the  lessor  brings  the  lease  to  an  end  during  the  ﬁ rst  term  of  the  lease,  the\n\nleasehold interest may be valued and depreciated for the period of use and thereafter\n\nthe total concession on rate is to be subtracted from that value and the lessee paid the\n\ndifference during the two year notice period.\n\n16.  The lessee shall not assign, mortgage or otherwise dispose of the property by way of\n\nlease or part with possession without the prior written consent of the lessor such consent\n\nnot to be unreasonably withheld.\n\n\f6\n\nADDENDUM\n\n  The  Cabinet  at  its  meeting  held  on  the  19th  day  of  February  1998  agreed  that\n\ntwo    parcels  of  land  together  containing  approximately  1  807  square  metres  situate  at\n\nMaxwell in the parish of Christ Church in this Island should be acquired for the public purpose of the\n\nprovision of beach access and for public parking facilities.\n\n  The said parcels of land were acquired under the Land Acquisition Act, Cap. 228 and\n\nbecame vested in the Crown pursuant to Notice under section 5 thereof published in the Ofﬁ cial\n\nGazette of this Island on the 10th day of January, 2002 as Statutory Instrument 2001 No. 135.\n\n  The Cabinet at its meeting held on the 9th day of April, 2019 agreed that the parcel of\n\nland more particularly described in the First Schedule to this Resolution should now be leased\n\nto Mahogany Park Inc. for the public purpose of tourism development and public parking.\n\n  The approval of Parliament is now being sought to\n\n(a)\n\n use  the  said  parcel  of  land  more  particularly  in  the  First  Schedule  to  this\n\nResolution for tourism development and public parking; and\n\n(b)\n\nlease the said parcel of land more particularly described in the First Schedule to\n\nthis Resolution in accordance with section 5 of the Crown Lands (Vesting and\n\nDisposal) Act, Cap. 225 to Mahogany Park Inc. on the terms and conditions set\n\nout  in  the  Second  Schedule  of  this  Resolution,  if  Parliament  approves  of  the\n\nrequest as mentioned in paragraph (a).\n\n"
}