{
  "bill_id": 471,
  "slug": "exchange-control-amendment-bill-2020",
  "title": "Exchange Control (Amendment) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/aaa48acdd7a7d915cf30b9d011c755f5.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-02-19",
  "first_reading": "2020-04-27",
  "gazette_date": null,
  "markdown": "2020/01/23\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Exchange Control Act, Cap. 71 to provide for\n\n(a)\n\n(b)\n\nthe  imposition  of  a  foreign  exchange  fee  on  foreign  exchange\ntransactions;\n\nthe validation of the collection of the foreign exchange fee from 17th\nJuly, 2017; and\n\n(c)\n\nfor related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nShort title\n\nAmendment of section 2 of Cap. 71\n\nInsertion of Part IIIA into Cap. 71\n\nAmendment of section 38 of Cap. 71\n\nInsertion of Fifth Schedule into Cap. 71\n\nInsertion of Sixth Schedule into Cap. 71\n\nCommencement\n\nValidation\n\nFIRST SCHEDULE\n\nSECOND SCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  amend  the  Exchange  Control  Act,  Cap.  71  to  provide  for  the\nimposition of a fee on foreign exchange transactions and for the validation of\nthe collection of the fee and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n2020.\n\nThis  Act  may  be  cited  as  the  Exchange  Control  (Amendment)  Act,\n\nAmendment of section 2 of Cap. 71\n\nSection 2 of the Exchange Control Act, Cap. 71, in this Act referred\n2.\nto as the principal Act, is amended by inserting the following new definitions\nin the appropriate alphabetical order:\n\n“  “Central  Bank”  means  the  Central  Bank  of  Barbados  established\nunder section 3 of the Central Bank of Barbados Act, Cap. 323C;\n\n“foreign currency provider” means authorised dealers, money or value\ntransmission service providers, credit card providers, debit card\nproviders and prepaid card providers;\n\n“foreign exchange fee” means the fee payable under section 10A(1);\n\n“money  or  value  transmission  service  provider”  means  a  person\ncarrying on the business of accepting cash, cheques or any other\nmonetary instrument or other means of storing value and paying\na corresponding sum in cash or in another form to a beneficiary,\nby means of a communication, message or transfer or through a\nclearing system to which the money or value transmission service\nbelongs;\n\n“weekday”  means  a  day  of  the  week  other  than  Sunday  or\n\nSaturday. ”.\n\nInsertion of Part IIIA into Cap. 71\n\n3.\nimmediately after Part III:\n\nThe  principal  Act  is  amended  by  inserting  the  following  Part\n\n\f5\n\n“PART IIIA\n\nFOREIGN EXCHANGE FEE ON FOREIGN CURRENCY\nTRANSACTIONS\n\nForeign exchange fee\n\n10A.(1)\nsubsection (3) and subject to subsection (4), is payable by a person\n\nA  foreign  exchange  fee,  calculated  in  accordance  with\n\n(a)\n\n(b)\n\nwho obtains foreign currency in Barbados, in any form, from\na foreign currency provider; or\n\nwho,  whether  in  Barbados  or  outside  Barbados,  purchases\nforeign currency or purchases goods or services in foreign\ncurrency with a credit card, a debit card or a prepaid travel\ncard  denominated  in  Barbados  dollars  and  issued  in\nBarbados.\n\nPart I of the Fifth Schedule shall apply to the foreign exchange\n\n(2)\nfee.\n\nThe formula for the computation of the foreign exchange fee is\n\n(3)\nset out in Part II of the Fifth Schedule.\n\nThe foreign exchange fee payable in accordance with this section\n\n(4)\nshall not exceed $100 000 per transaction.\n\nTransactions which are exempt from the foreign exchange\nfee\n\n10B.\ntransactions set out in the Sixth Schedule.\n\nThe foreign exchange fee is not payable in respect of the\n\n\f6\n\nExemption of diplomats and diplomatic missions\n\n10C.\n\nThe foreign exchange fee is not payable by\n\n(a)\n\n(b)\n\na  diplomatic  mission,  a  consulate  or  an  international\norganisation\nthe  Diplomatic\nto\nImmunities and Privileges Act, Cap. 18; or\n\nrecognised  pursuant\n\nany person entitled to be exempt from the payment of duties,\nfees, taxes or rates pursuant to the Diplomatic Immunities and\nPrivileges Act,\n\non  production  of  evidence  that  the  transaction  relates  to  the  person,\nentity or organization referred to in paragraphs (a) or (b).\n\nPayment of foreign exchange fee to the Central Bank\n\nEvery  foreign  currency  provider  shall  pay  the  foreign\n10D.(1)\nexchange fee collected pursuant to section 10A(1) to the Central Bank\nno later than the 15th day of the month following the end of the reporting\nperiod.\n\nThe Central Bank may by notice request an authorised dealer to\n(2)\nsubmit reporting schedules and supporting information for the purposes\nof subsection (1).\n\nWhere a notice is served on an authorised dealer under subsection\n(3)\n(2), the authorised dealer shall comply with the notice within the time\nspecified in the notice.\n\nFor the purposes of this section, “reporting period” means the\n\n(4)\nmonth prior to the month in which a report is submitted.\n\nPayment of foreign exchange fee into the Consolidated Fund\n\nThe  Central  Bank  shall  pay  the  foreign  exchange  fee\n10E.(1)\ncollected pursuant to section 10(D)(1) into the Consolidated Fund no\nlater than the 15th day of each month following its collection; but where\n\n\f7\n\nthe 15th day of the month is not a weekday, the fee is payable on the\nfirst weekday thereafter.\n\n(2)\nThe  Central  Bank  shall  forthwith  submit  a  statement  of\nconfirmation  of  the  deposit  to  the  Minister  of  Finance  and  the\nAccountant-General on payment of the foreign exchange fee into the\nConsolidated Fund under subsection (1).\n\nAmendment of Fifth and Sixth Schedules\n\n10F.\nSchedules.”.\n\nThe  Minister  may  by  order  amend  the  Fifth  and  Sixth\n\nAmendment of section 38 of Cap. 71\n\n4.\n\nSection 38(2) of the principal Act is amended\n\n(a)\n\n(b)\n\nin  paragraph  (a)  by  inserting  the  words  “foreign  currency\nproviders” immediately after the words “authorised dealers,”; and\n\nin  paragraph  (e)(ii)  by  inserting  the  words  “and  foreign  currency\nproviders” immediately after the words “authorised dealers”.\n\nInsertion of Fifth Schedule into Cap. 71\n\n5.\nThe  principal  Act  is  amended  by  inserting  immediately  after  the\nFourth Schedule, the Fifth Schedule as set out in the First Schedule to this\nAct.\n\nInsertion of Sixth Schedule into Cap. 71\n\n6.\nThe  principal  Act  is  amended  by  inserting  immediately  after  the\nFifth Schedule as inserted by section 5 of this Act, the Sixth Schedule as set\nout in the Second Schedule to this Act.\n\n\f8\n\nCommencement\n\n7.\n\nThis Act shall be deemed to have come into operation as follows:\n\n(a)\n\n(b)\n\nthe provisions of the Act, except for the provisions relating to credit\ncard, debit card and prepaid card transactions, shall be deemed to\nhave come into operation on 17th July, 2017; and\n\nthe  provisions  relating  to  credit  card,  debit  card  and  prepaid  card\ntransactions  shall  be  deemed  to  have  come  into  operation  on  1st\nSeptember, 2017.\n\nValidation\n\nAll monies collected in relation to the foreign exchange fee from\n8.\n17th July, 2017 to the commencement of this Act shall be deemed to have been\nvalidly and lawfully collected as if collected under the Exchange Control Act,\nCap. 71.\n\n\f9\n\nFIRST SCHEDULE\n\n“FIFTH SCHEDULE\nPART I\n\n(Section 5)\n\n(Section 10A(2))\n\nRules Applicable to the Collection of the Foreign Exchange Fee by\nAuthorised Dealers\n\n1.\ntransaction records.\n\nThe  foreign  exchange  fee  shall  be  shown  separately  on\n\nThe exchange rate relating to foreign currency transactions\n2.\nis  the  exchange  rate  applicable  to  the  currency  which  is  being\npurchased.\n\nThe foreign exchange fee for foreign exchange transactions\n3.\nand the currency of the settlement of the foreign exchange fee shall\nboth be calculated in Barbados dollars.\n\n4.\nthe time of the cash purchase or added to the credit card statement.\n\nThe foreign exchange fee shall be charged and payable at\n\nPART II\n\n(Section 10A(3))\n\nCalculation of Foreign Exchange fee\n\n2 per cent (Foreign Currency Purchased or Utilised x Applicable\nExchange Rate)\n\n”.\n\n\f10\n\nSECOND SCHEDULE\n\n“SIXTH SCHEDULE\n\nExempt Transactions\n\n(Section 6)\n\n(Section 10B)\n\nThe  sale  of  foreign  currency  by  the  Central  Bank  to\n1.\nauthorised dealers where the purchase is on behalf of a customer of the\nauthorised dealer.\n\n2.\n\nTrading between authorised dealers on the interbank market.\n\n3.\ndealer.\n\nTrading  between  the  Central  Bank  and  any  authorised\n\nThe sale of foreign currency by authorised dealers to foreign\n4.\ncurrency providers for the purpose of settling obligations relating to\ntransactions by customers of the foreign currency providers where the\ncustomer  has  paid  the  foreign  exchange  fee  in  respect  of  those\ntransactions.\n\n5.\nindividual or business in a foreign currency account.\n\nTransactions  involving  the  use  of  funds  held  by  any\n\n6.\nThe sale of foreign currency by authorised foreign exchange\ndealers to a business or person which is exempt from the payment of\nthe foreign exchange fee where that business or person produces written\n\n\f11\n\nevidence\nexemption.\n\nthat\n\nthe  Government  of  Barbados  has  granted\n\nthe\n\nThe purchase of foreign currency for foreign debt service\n7.\npayments  by  a  statutory  board  within  the  meaning  of  section  40  of\nthe  Interpretation  Act,  Cap.  1  or  a  statutory  corporation  where  the\nGovernment of Barbados is the sole shareholder of the corporation.\n\n8.\n\nThe purchase of\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nkerosene  type  jet  fuel  falling  under  tariff  heading  number\n2710.19.10 of the Customs Tariff;\n\ndiesel oil for use as fuel for road motor vehicles falling under\ntariff heading number 2710.19.40.100 of the Customs Tariff;\n\ndiesel oil falling under tariff heading number 2710.19.40.900\nof the Customs Tariff; and\n\nbunker “C” grade fuel oil falling under tariff heading number\n2710.19.60 of the Customs Tariff.”.\n\n\f12\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n"
}