{
  "bill_id": 472,
  "slug": "resolution-re-qeh-board-martindales-road-saint-michael",
  "title": "Resolution re QEH Board, Martindales Road, Saint Michael",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/cb2f739137bc491cb75cd3c1546e45c5.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-08-04",
  "first_reading": "2020-08-05",
  "gazette_date": null,
  "markdown": "2020-01-29\n\nPARLIAMENT\n\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands\n\n(Vesting and Disposal) Act, Cap. 225 approve the lease to the Queen Elizabeth Hospital Board\n\nof two parcels of land, the property of the Crown, situate at Martindales Road in the parish of\n\nSaint Michael in this Island more particularly described in the First Schedule to this Resolution\n\non the terms and conditions set out in the Second Schedule to this Resolution for the purpose of\n\nthe provision of health services and to facilitate development programmes.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and twenty.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                            day  of                                                    ,\n\nTwo thousand and twenty.\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL  THAT  land  the  property  of  the  Crown  situate  at  Martindales  Road  in\n\nthe parish of Saint Michael (being Lot 1) containing by admeasurement 52 307.3 square metres\n\n(exclusive of 343.2 square metres in road reserve) or thereabouts Abutting and Bounding on Lot 2\n\n(as shown on the Plan) on a public road known as Martindales Road which leads to Mencea Cox\n\nRoundabout in one direction to Ena Walters Roundabout in the other direction on a public road\n\nknown as River Road on the lands now or late of Jefferson Clarke on lands now or formerly of\n\nTiffany Krystal Inc. on lands now or late of Lawson Hooper on lands now or formerly of the\n\nNew Testament Church on lands now or formerly of  Genesis Holding Inc. on lands now or late\n\nof Authur Marshall on lands now or formerly of C G I Consumers' Guarantee Insurance Co. Ltd.\n\non the public road known as River Road which leads to Fairchild Street and on the public road\n\nknown as John Beckles Drive which leads to St. Michaels Row or however else the same may\n\nabut and bound as shown and delineated on a Plan certiﬁ ed on the 17th day of August, 2018 by\n\nSamuel N. Taylor, Land Surveyor and recorded in the Lands and Surveys Department on the\n\n27th day of September, 2019 as Plan No. 1205/2019 together with the buildings thereon.\n\n\f3\n\nFIRST SCHEDULE - (Concl'd)\n\nALL  THAT  land  the  property  of  the  Crown  situate  at  Martindales  Road  in\n\nthe parish of Saint Michael (being Lot A) over which there is a right-of-way containing by\n\nadmeasurement 12 823.3 square metres (exclusive of 231.2 square metres in road reserve and\n\nexclusive of 1 774.3 square metres in right-of-way) or thereabouts Abutting and Bounding on\n\na road reserve on lands now or formerly of The Barbados Government (Bannister Land) on\n\nlands now or formerly of the Ursuline Convent on Lot B (as shown on the Plan) on a right-of-\n\nway on a roundabout on the sidewalk on the public road called Lower Collymore Rock which\n\nleads to Culloden Road in one direction and to Ena Walters Roundabout in the other direction\n\nand on the said sidewalk on the public road known as Martindales Road which leads to Bay\n\nStreet in one direction to Fairchild Street in another direction and to George Street in the other\n\ndirection  as  shown  and  delineated  on  a  Plan  certiﬁ ed  on  the  17th  day  of August,  2018  by\n\nSamuel N. Taylor, Land Surveyor and recorded in the Lands and Surveys Department on the\n\n27th day of September, 2019 as Plan No. 1204/2019 together with the buildings thereon.\n\n\f4\n\nSECOND SCHEDULE\n\nTERMS AND CONDITIONS\n\nThe Lessee\n\nThe Lessor\n\nQueen Elizabeth Hospital  Board\n\nGovernment of Barbados\n\nThe lease of two parcels of land, Lot 1, the Queen Elizabeth Hospital Campus, containing by\n\nadmeasurement  52  307.3  square  metres  (exclusive  of  343.3  in  road  reserve)  and  Lot A,  the\n\nEnmore  Complex,  containing  by  admeasurement  12  823.3  square  metres  (exclusive  of\n\n231.2  square  metres  in  road  reserve  and  exclusive  of  1774.3  square  metres  in  right-of-\n\nway)  with  buildings  thereon,  situate  at  Martindales  Road  in  the  parish  of  Saint  Michael  to\n\nthe Queen Elizabeth Hospital Board ('QEH Board') for the provision of health services and to\n\nfacilitate its development programmes under the following terms and conditions:\n\n(i)\n\nthe lease shall be for a term of 50 years with an option  to renew for a further 50 years;\n\n(ii)\n\nthe lessee shall pay an initial concessionary rate of $12,000.00 per annum during the ﬁ rst\n\n10 years of the lease;\n\n(iii)\n\nthe rent shall be reviewed at 10 year intervals;\n\n(iv)\n\nthe  premises  shall  revert  to  the  Crown  for  nil  consideration  at  the  end  of  the  lease;\n\n(v)\n\nthe lease may be terminated by either party serving 2 years notice on the other party;\n\n\f5\n\nSECOND SCHEDULE - (Concl'd)\n\nTERMS AND CONDITIONS - (Concl'd)\n\n(vi)\n\nthe lessee shall be responsible for the insurance of the buildings, public liability and\n\noccupiers' liability at the premises, the repairs and maintenance of the buildings, the\n\npayment of utilities and other outgoings arising out of the use of the site;\n\n(vii)\n\nthe lessee shall bear the cost of the development of the property so that it complies with\n\ntown planning and other statutory requirements;\n\n(viii)  the  lessee  shall  advise  the  Ministry  of  Housing,  Lands  and  Rural  Development  of\n\nthe  replacement  cost  of  the  buildings  and  plant  on  site  on  the  completion  of  any\n\nrefurbishment, improvements or expansion;\n\n(ix)\n\nthe lessee shall indemnify the Crown against all actions, costs, claims and demands in\n\nrespect of any injury which may arise directly or indirectly as a result of the lessee's use\n\nof the property;\n\n(x)\n\nthe buildings, structures and other facilities and improvements, regardless of the stage of\n\nconstruction, shall revert to the Crown for nil consideration at the end of the lease period\n\nor its sooner determination; and\n\n(xi)\n\nthe lessee shall not assign or otherwise dispose of the property by way of lease or part with\n\npossession  without  the  prior  written  consent  of  the  lessor,  such  consent  not  to  be\n\nunreasonably withheld.\n\n\f6\n\nADDENDUM\n\n    The  Cabinet  at  its  meeting  held  on  the  16 th  day  of  January,  2020\n\nconsidered  Note  (2020)  27/MHLR  05  and  agreed  to  the  lease  of  two  parcels  of  land\n\nLot  1,  the  Queen  Elizabeth  Hospital  Campus  Property  containing  52  307.3  square\n\nmetres  (exclusive  of  343.2  square  metres  in  road    reserve)  of  Crown  land  situate  at\n\nMartindales Road in the parish of Saint Michael in this Island together with the buildings thereon\n\nand Lot A, the Enmore Complex containing 12 823.3 square metres (exclusive of 231.2 square\n\nmetres in road reserve and exclusive of 1 774.3 square metres in right-of-way) of Crown lands\n\nsituate  at  Martindales  Road  in  the  parish  of  Saint  Michael  in  this  Island  together  with  the\n\nthe buildings thereon but more particularly described in the First Schedule to this Resolution\n\nto the Queen Elizabeth Hospital Board for the provision of health services and to facilitate the\n\nQueen Elizabeth Hospital Board's development programmes under the terms and conditions set\n\nout in the Second Schedule to this Resolution.\n\n    The parcels of land described in the First Schedule formed part of the estates and\n\nproperty of the Constitution Swamp and Reef and by virtue of section 7 of the Crown Lands\n\n(Vesting and Disposal) Act, Cap. 225 became vested in the Crown.\n\nIn  accordance  with  the  provisions  of  section  5  of  the  Crown  Lands  (Vesting  and\n\nDisposal) Act, Cap. 225 the approval of Parliament is now sought for the lease of the parcels\n\nof Crown lands described in the First Schedule to the Queen Elizabeth Hospital Board on the\n\nterms and conditions set out in the Second Schedule.\n\n"
}