{
  "bill_id": 474,
  "slug": "resolution-life-assurance-company-ltd-transfer-of-bonds-bill-2020",
  "title": "Resolution Life Assurance Company Ltd. (Transfer of Bonds) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/098905d9abeb610341a58cf2323cf192.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-08-04",
  "first_reading": "2020-08-05",
  "gazette_date": "2020-02-20",
  "markdown": "2020/01/03\n\nOBJECTS AND REASONS\n\nThis Bill will enable the Government of Barbados to facilitate the transfer of\nbonds from Resolution Life Assurance Company Ltd. to the individual policy\nholders of the Company.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\nShort title\n\nInterpretation\n\nPurpose\n\nTransfer of bonds\n\nCharge on the Consolidated Fund\n\nValidation\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to enable the Government of Barbados to facilitate the transfer of\nbonds from Resolution Life Assurance Company Ltd. to the individual policy\nholders of the Company.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Transfer of Bonds) Act, 2020.\n\nThis Act may be cited as the Resolution Life Assurance Company Ltd.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“bonds” means Series B Bonds and Series I Bonds;\n\n“Company”  means  Resolution  Life  Assurance  Company  Ltd.,  a  company\n\nincorporated under the Companies Act, Cap. 308;\n\n“Natural  Disaster  Clause”  has  the  meaning  assigned  to  it  by  the  Part  I  of  the\nSecond Schedule to the Debt Holders (Approval of Debt Restructuring) Act,\n2018 (Act 2018-24);\n\n“Series B Bonds” means the bonds described in Part I of the Schedule;\n\n“Series  G  Bonds”  means  the  bonds  referred  to  in  Part  II  of  the  Second\nSchedule to the Debt Holders (Approval of Debt Restructuring) Act, 2018\n(Act  2018-24)  allocated  to  the  Company  as  a  part  of  the  Government’s\ncomprehensive debt restructuring programme pursuant to the Debt Holders\n(Approval of Debt Restructuring) Act, 2018;\n\n“Series I Bonds” means the bonds described in Part II of the Schedule.\n\nPurpose\n\n3.\nThe purpose of this Act is to enable the Government of Barbados to\nexchange  Series  G  Bonds,  allocated  to  the  Company  as  a  part  of  the\nGovernment’s  comprehensive  debt  restructuring  programme  pursuant  to  the\nDebt  Holders  (Approval  of  Debt  Restructuring)  Act,  2018  (Act  2018-24),  for\nSeries B Bonds and Series I Bonds and facilitate the transfer of those bonds to\nthe individual policyholders following the liquidation of the Company.\n\n\f5\n\nTransfer of bonds\n\n4.(1)\nThe Government of Barbados may, pursuant to section 3, exchange\nthe  Series  G  Bonds  for  Series  B  Bonds  and  Series  I  Bonds  and  facilitate  the\ntransfer of those bonds to the individual policyholders of the Company.\n\nThe  bonds  transferred  to  the  individual  policyholders  of  the  Company\n(2)\npursuant  to  subsection  (1)  shall  not  exceed  in  aggregate  the  sum  of  $316.32\nmillion.\n\nCharge on the Consolidated Fund\n\n5.\nthe bonds pursuant to section 4 are a charge on the Consolidated Fund.\n\nAll principal monies and interest payable in respect of the transfer of\n\nValidation\n\nAll bonds transferred to the individual policyholders of the Company\n6.\nfrom the 30th day of September, 2019 to the date of the commencement of this\nAct shall be deemed to have been lawfully and validly transferred as if those\nbonds were properly transferred pursuant to section 4.\n\n\f6\n\n L.R.O. 1998SCHEDULE              (Section 2)PART ISeries B BondsStructure: 11 Series B amortising strips issued by the Government of Barbados with maturities of 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, and 15 years.Interest Rate: 1.0% per annum for ﬁ rst 3 years 2.5% per annum for year 4 3.75% to maturityInterest Payments: Quarterly with ﬁ rst payment on 30th September, 2019Principal Repayment: The principal of each strip will be repaid in four equal  quarterly principal instalments commencing one year prior to the maturity date of that strip.  Allocation of  5-Year: 7.49% 11-Year: 9.37%Aggregate Principal 6-Year: 7.78% 12-Year: 9.72%Amount Amongst Strips:  7-Year: 8.07% 13-Year: 10.10% 8-Year: 8.38% 14-Year: 10.48% 9-Year: 8.70% 15-Year: 10.88% 10-Year: 9.03%Natural Disaster Clause: Yes \f7\n\n L.R.O. 1998PART IISchedule - (Concl'd)Series I BondsStructure: 15 Series I amortising strips issued by the Government of Barbados with maturities of 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, and 15 years.Interest Rate: 0.25% per annumInterest Payments: Quarterly with ﬁ rst payment on 30th September, 2019Principal Repayment: The principal of each strip will be repaid in four equal  quarterly principal instalments commencing one year prior to the maturity date of that strip.  Allocation of  1-Year: 6.67% 9-Year:   6.67%Aggregate Principal 2-Year: 6.67% 10-Year: 6.67%Amount Amongst Strips:  3-Year: 6.67% 11-Year: 6.67% 4-Year: 6.67% 12-Year: 6.67% 5-Year: 6.67% 13-Year: 6.67% 6-Year: 6.67% 14-Year: 6.67% 7-Year: 6.67% 15-Year: 6.62% 8-Year: 6.67%Natural Disaster Clause: Yes \f8\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n"
}