{
  "bill_id": 477,
  "slug": "employment-prevention-of-discrimination-bill-2020",
  "title": "Employment (Prevention of  Discrimination) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/06948a67143d62e36c426fbd077e1055.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-07-29",
  "first_reading": "2020-08-05",
  "gazette_date": "2020-03-05",
  "markdown": "Explanatory menorandum after page 32\n\n2020-02-04\n\nOBJECTS AND REASONS\n\nThis Bill would protect persons from discrimination related to employment.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\nPART II\n\nDISCRIMINATION\n\nShort title\n\nInterpretation\n\nMeaning of discrimination\n\nPrevention of discrimination in relation to job creation and recruitment\n\nPrevention of discrimination in employment\n\nProhibition against testing for medical condition\n\nEmployer to make reasonable adjustment\n\nPART III\n\nEXCEPTIONS\n\nGenuine occupational qualification\n\nUnjustifiable hardship\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n\f3\n\n10.\n\nMeasures intended to achieve equality\n\n11.\n\nCare of minors\n\n12.\n\nReligious bodies\n\n13.\n\nEducational institutions administered in accordance with particular\nreligious beliefs\n\n14.\n\nReligious appearance or dress\n\n15.\n\nCharities\n\n16.\n\nSport\n\n17.\n\nVisual and performing arts\n\n18.\n\nEmployment other than in connection with a business\n\n19.\n\nInsurance\n\n20.\n\nException regarding identity of family member in certain cases\n\n21.\n\nException regarding pregnancy\n\n22.\n\nActs done in compliance with court order or pursuant to enactment\n\nPART IV\n\nENFORCEMENT\n\n23.\n\nComplaint of discrimination in relation to job creation and recruitment\n\n24.\n\nComplaint of discrimination by fellow employee\n\n\f4\n\n25.\n\nComplaint of discrimination by employer\n\n26.\n\nComplaint in relation to questions on or testing for medical conditions\n\n27.\n\nComplaint in relation to failure to make reasonable adjustment\n\n28.\n\nComplaints by representative organisations and group complaints\n\n29.\n\nTribunal may extend time for making complaint\n\n30.\n\nComplaint to Tribunal to be made through Chief Labour Officer\n\n31.\n\nAction by Chief Labour Officer and Tribunal upon receipt of a complaint\n\n32.\n\nDetermination of complaint by Tribunal\n\n33.\n\nFunctions of Chief Labour Officer generally in relation to administration\nand enforcement of Act\n\nPART V\n\nMISCELLANEOUS\n\n34.\n\nRegister of complaints\n\n35.\n\nPolicy against discrimination\n\n36.\n\nConfidentiality\n\n37.\n\nProhibition of victimization of employees\n\n38.\n\nRegulations\n\n39.\n\nConsequential amendments\n\n\f5\n\n40.\n\nCommencement\n\nCONTENT OF POLICY STATEMENT AGAINST DISCRIMINATION\n\nFIRST SCHEDULE\n\nSECOND SCHEDULE\n\nCONSEQUENTIAL AMENDMENTS\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to protect persons from discrimination related to employment.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f8\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\nDiscrimination) Act, 2020.\n\nThis  Act  may  be  cited  as  the  Employment  (Prevention  of\n\nInterpretation\n\n2.(1)\n\nIn this Act\n\n“business” has the meaning assigned to it by section 2(1) of the Employment\n\nRights Act, 2012 (Act 2012-9);\n\n“complainant” means a person who makes a complaint under this Act;\n\n“contract  of  employment”  has  the  meaning  assigned  to  it  by  section  3  of  the\n\nEmployment Rights Act, 2012 (Act 2012-9);\n\n“detriment” includes humiliation and denigration;\n\n“disability”,  in  relation  to  a  person,  includes  a  long  term  physical,  mental,\nintellectual or sensory impairment which in interaction with various barriers\nmay hinder the full and effective participation of the person in society;\n\n“discriminate” has the meaning assigned to it by section 3;\n\n“domestic partnership” means the relationship between 2 persons each at least\n18 years of age, who live together on a genuine domestic basis but does not\ninclude\n\n(a)\n\n(b)\n\nthe relationship between a married couple;\n\na  relationship  where  one  of  the  persons  provides  the  other  with\ndomestic support or personal care or both for a fee or reward,\n\nand “domestic partner” shall be construed accordingly;\n\n\f9\n\n“domestic partnership status” means the state of being\n\n(a)\n\n(b)\n\na domestic partner; or\n\nthe  domestic  partner  or  the  former  domestic  partner  of  a  particular\nindividual;\n\n“employee” has the meaning assigned to it by section 2(1) of the Employment\n\nRights Act, 2012 (Act 2012-9);\n\n“employer” has the meaning assigned to it by section 2(1) of the Employment\n\nRights Act, 2012 (Act 2012-9);\n\n“employment agency” means a person who, for profit, provides services for the\npurpose of finding employment for others or for supplying employers with\nemployees;\n\n“family  member”,  in  relation  to  a  person,  means  the  child,  spouse,  domestic\npartner, parent, uncle, aunt, grandparent, nephew, niece, grandchild, brother\nor sister of the person;\n\n“family responsibility” means the responsibility of a person, whether alone or in\nconjunction  with  others,  for  the  care,  support  and  welfare  of  a  family\nmember;\n\n“marital status” means the state of being\n\n(a)\n\n(b)\n\n(c)\n\nsingle;\n\nmarried;\n\nmarried but living separate and apart from one’s spouse;\n\n(d)\n\ndivorced;\n\n(e)\n\nwidowed; or\n\n(f)\n\nthe spouse or the former spouse of a particular individual;\n\n\f10\n\n“medical condition”, in relation to a person, includes\n\n(a)\n\nthe total or partial loss of\n\n(i)\n\nbodily or mental functions; or\n\n(ii)\n\na part of the body;\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nthe presence in the body of organisms causing, or capable of causing,\ndisease or illness;\n\nthe malfunction, malformation or disfigurement of a part of the body;\n\na disorder or malfunction that results in a person learning differently\nfrom a person without the disorder or malfunction;\n\na  disorder,  illness  or  disease  that  affects  the  thought  processes,\nperception of reality, emotions or judgment of a person or that results\nin disturbed behaviour;\n\na former medical condition; and\n\na medical condition that may develop whether because of a genetic\npredisposition to the condition or otherwise;\n\n“minor”  has  the  meaning  assigned  to  it  by  section  2  of  the  Minors  Act,\n\nCap. 215;\n\n“physical  feature”  includes  the  height,  weight,  shape  and  size,  and  any\n\ndistinguishing mark or peculiarity, of a person;\n\n“respondent” means a person against whom a complaint is made;\n\n“Tribunal” means the Employment Rights Tribunal established by section 6 of\n\nthe Employment Rights Act, 2012 (Act 2012-9).\n\nThis  Act  shall  be  read  together  with  the  Employment  Rights  Act,  2012\n(2)\n(Act 2012-9) and words defined in that Act and used in this Act have, unless a\ncontrary intention is expressed in this Act, the same meaning.\n\nWhere in applying or administering this Act a conflict arises between this\n(3)\nAct and the Employment Rights Act, 2012 (Act 2012-9) this Act shall prevail and\n\n\f11\n\nthe  Employment  Rights  Act  shall  be  construed  with  such  modifications  and\nadaptations as may be necessary for the purpose of giving effect to this Act.\n\nPART II\n\nDISCRIMINATION\n\nMeaning of discrimination\n\n3.(1)\nperson where\n\nFor the purposes of this Act, a person discriminates against another\n\n(a)\n\nthe  person,  on  a  ground  specified  in  subsection  (2),  directly  or\nindirectly, whether intentionally or not, makes a distinction, creates an\nexclusion  or  shows  a  preference,  the  intent  or  effect  of  which  is  to\nsubject  the  other  person  to  any  disadvantage,  restriction  or  other\ndetriment; or\n\n(b)\n\nthe person, directly or indirectly, whether intentionally or not, subjects\nthe other person to any disadvantage, restriction or other detriment in\nthe following circumstances:\n\n(i)\n\n(ii)\n\n(iii)\n\na ground specified in subsection (2) applies to the other person;\n\nas a consequence of the ground the other person does not comply,\nor is not able to comply, with a particular requirement of the first-\nmentioned person;\n\nthe nature of the requirement is such that a substantially higher\nproportion  of  persons  to  whom  the  ground  does  not  apply\ncomplies, or is able to comply, with the requirement; and\n\n(iv)\n\nthe requirement is not reasonable in the circumstances.\n\n(2)\n\nThe grounds referred to in subsection (1) are:\n\n(a)\n\nrace;\n\n\f12\n\n(b)\n\norigin;\n\n(c)\n\npolitical opinion;\n\n(d)\n\ntrade union affiliation;\n\n(e)\n\ncolour;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\ncreed;\n\nsex;\n\nsexual orientation;\n\nsocial status;\n\nmarital status;\n\n(k)\n\ndomestic partnership status;\n\n(l)\n\npregnancy;\n\n(m)\n\nmaternity;\n\n(n)\n\n(o)\n\n(p)\n\n(q)\n\n(r)\n\n(s)\n\nfamily responsibility;\n\nmedical condition;\n\ndisability;\n\nage;\n\nphysical feature; and\n\nany characteristic which appertains generally or is generally imputed\nto a person on the basis of any ground referred to in paragraphs (a) to\n(r).\n\n(3)\n\nFor the purposes of this Act,\n\n(a)\n\nwhere a person acts on several grounds including a ground referred to\nin subsection (2), the person acts on the ground referred to in subsection\n(2) if the ground is a substantial reason for the person’s action;\n\n\f13\n\n(b)\n\n(c)\n\na person shall be taken to have discriminated against another person\neven though the person acts on the basis of a mistaken assumption; and\n\nit is not necessary to show that a ground referred to in subsection (2)\napplies to the person discriminated against where it is shown that the\nground, whether on a mistaken assumption or not, was thought to apply\nto a relative or associate of the person discriminated against and that\nfact was a substantial reason for the discrimination.\n\nFor  the  avoidance  of  doubt  and  without  prejudice  to  the  generality  of\n(4)\nsubsections (1) and (2)(f), a person discriminates on the ground of creed where\nthe person\n\n(a)\n\n(b)\n\ndirectly  or  indirectly,  whether  intentionally  or  not,  subjects  another\nperson to any disadvantage, restriction or other detriment because of\nthe other person’s appearance or dress and that appearance or dress is\nrequired by, or symbolic of, the other person’s creed; or\n\nrequires  another  person  to  alter  his  appearance  or  dress  and  that\nappearance or dress is required by, or symbolic of, the other person’s\ncreed.\n\nPrevention of discrimination in relation to job creation and\nrecruitment\n\n4.(1)\n\nAn employer shall not discriminate against a person\n\n(a)\n\n(b)\n\nin the creation of jobs;\n\nin the making of arrangements for determining who should be offered\nemployment;\n\n(c)\n\nin the advertisement of employment;\n\n(d)\n\nin determining who should be offered employment; or\n\n(e)\n\nin the terms or conditions on which employment is offered.\n\n\f14\n\n(2)\n\nAn employment agency shall not discriminate against a person\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nby refusing to provide the person with its services;\n\nin the terms or conditions on which it offers to provide the person with\nits services;\n\nin the manner in which it provides the person with its services; or\n\nin  any  other  manner  in  which  it  facilitates  the  employment  of  the\nperson.\n\nSubsection (2) does not require an employment agency to ensure that an\n\n(3)\nemployer complies with this Act.\n\nPrevention of discrimination in employment\n\n5.\n\nAn employer shall not discriminate against an employee\n\n(a)\n\n(b)\n\n(c)\n\nin the terms or conditions of employment that the employer affords the\nemployee;\n\nin the provision of facilities or services related to or connected with\nemployment;\n\nby the denial or restriction of access to opportunities for promotion,\ntransfer  or  training  or  to  any  other  benefits  associated  with\nemployment;\n\n(d)\n\nby disciplinary action or dismissal; or\n\n(e)\n\nby subjection to any other detriment.\n\nProhibition against testing for medical condition\n\n6.\nSubject to section 8, an employer shall not require a person to answer\nquestions  in  relation  to,  or  undergo  a  test  for,  a  medical  condition  as  a\nprecondition to entering into a contract of employment or as a condition for the\ncontinuance of employment.\n\n\f15\n\nEmployer to make reasonable adjustment\n\n7.(1)\nAn  employer  shall,  upon  the  request  of  an  employee,  make  such\nadjustment for the employee as may be reasonable in the circumstances, where\n\n(a)\n\n(b)\n\nany ground referred to in section 3(2)(f), (g), (h), (l), (m), (n), (o), (p)\nand (r) applies in respect of the employee; and\n\nthe  failure  to  make  the  adjustment  results  or  would  result  in  the\nemployee, because of the ground, being treated less favourably than a\nperson  to  whom  the  ground  does  not  apply  would  be  treated  in\ncircumstances that are not materially different.\n\n(2)\n\nFor the purpose of subsection (1) “adjustment” includes\n\n(a)\n\n(b)\n\n(c)\n\nallocating some of the duties of the employee to another person;\n\naltering the hours of work of the employee;\n\nallowing  the  employee  to  be  absent  during  hours  of  work  for  the\npurpose of assessment, rehabilitation or other treatment;\n\n(d)\n\nproviding the employee with alternative employment;\n\n(e)\n\nassigning the employee to a different place of work;\n\n(f)\n\n(g)\n\nmodifying procedures for testing or assessment of the employee;\n\nmodifying instructions or reference manuals with which the employee\nis required to comply;\n\n(h)\n\nacquiring or modifying equipment for the use of the employee;\n\n(i)\n\n(j)\n\nmaking adjustments to premises to be used by the employee;\n\ntraining the employee or arranging for the employee to be trained;\n\n(k)\n\nproviding a reader or interpreter to the employee; and\n\n(l)\n\nproviding supervision for the employee.\n\n\f16\n\nPART III\n\nEXCEPTIONS\n\nGenuine occupational qualification\n\nA distinction made, exclusion created or preference shown shall not\n8.(1)\nbe taken to be discrimination where the reason for the distinction, exclusion or\npreference is the existence of a genuine occupational qualification.\n\nNotwithstanding section 6, a person may be required to answer questions\n(2)\nin relation to, or undergo a test for, a medical condition where the result of the\ntest is necessary to determine whether the person satisfies, or continues to satisfy,\na genuine occupational qualification.\n\nFor  the  purposes  of  this  Act,  a  qualification  is  a  genuine  occupational\n\n(3)\nqualification where it is an inherent requirement of a particular position.\n\nWithout prejudice to the generality of subsection (3), being of a particular\n\n(4)\nsex shall be taken to be a genuine occupational qualification where\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe job can only be performed by a person who has physical attributes,\nother than stamina and strength, which only a person of a particular sex\npossesses;\n\nit is necessary, in order to preserve decency or privacy, for the job to\nbe performed by a person of a particular sex;\n\nthe nature of the undertaking or establishment within which the job is\nto be performed requires the job to be held by a person of a particular\nsex; or\n\nthe job involves providing persons of a particular sex with personal\nservices  concerning  their  welfare,  health  or  education  and  those\nservices can most effectively be performed by a person of a particular\nsex.\n\n\f17\n\nUnjustifiable hardship\n\n9.(1)\n4, 5 or 7 for a person to show that, in the case of\n\nIt is a defence to a complaint in respect of a contravention of section\n\n(a)\n\n(b)\n\nsection 4 or 5, avoiding the discrimination; or\n\nsection 7, making the adjustment,\n\nwould impose an unjustifiable hardship on the person.\n\nFor the purpose of subsection (1), in determining whether an unjustifiable\n(2)\nhardship would be imposed on a person, all of the relevant circumstances of the\nparticular case shall be taken into account including\n\n(a)\n\n(b)\n\nthe  nature  of  the  benefit  or  detriment  likely  to  accrue  to,  or  to  be\nsuffered by, any person concerned;\n\nthe  financial  circumstances  of,  and  the  estimated  amount  of\nexpenditure required to be made by, the person on whom the hardship\nwould be imposed; and\n\n(c)\n\nthe availability of financial and other assistance to the person on whom\nthe hardship would be imposed.\n\nMeasures intended to achieve equality\n\n10.(1)\nshall not be taken to be discrimination.\n\nThe adoption by an employer of a measure described in subsection (2)\n\n(2)\n\nThe measure referred to in subsection (1) is one that is\n\n(a)\n\n(b)\n\n(c)\n\ndesigned to promote equality of opportunity for disadvantaged groups;\n\na  fair  and  proportionate  means  of  achieving  such  equality  of\nopportunity; and\n\nused  only  for  so  long  as  it  is  necessary  for  the  attainment,  in  the\ncircumstances, of such equality of opportunity.\n\n\f18\n\nCare of minors\n\n11.\n\nSections 4 and 5 do not render discrimination unlawful where\n\n(a)\n\n(b)\n\nthe employment involves the care, instruction or supervision of minors;\nand\n\nthe  discrimination  is  reasonably  necessary  to  protect  the  physical,\npsychological or emotional well being of such minors.\n\nReligious bodies\n\n12.\n\nSections 4 and 5 do not apply to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe  ordination  or  appointment  of  priests,  ministers  of  religion  or\nmembers of a religious order;\n\nthe training or education of persons seeking ordination or appointment\nas priests, ministers of religion or members of a religious order;\n\nthe  administration  of  a  body  established  for  religious  purposes  in\naccordance with the precepts of that religion; or\n\nany  other  practice  of  a  body  established  for  religious  purposes  that\nconforms  with  the  precepts  of  that  religion  or  is  necessary  to  avoid\ninjury to the religious susceptibilities of the adherents of that religion.\n\nEducational institutions administered in accordance with particular\nreligious beliefs\n\n13.\nan educational institution where\n\nSections 4 and 5 do not render unlawful discrimination in the case of\n\n(a)\n\n(b)\n\nthe  institution  is  administered  in  accordance  with  the  precepts  of  a\nparticular religion; and\n\nthe  discrimination  is  founded  on  the  precepts  of  the  religion  or  is\nnecessary  to  avoid  injury  to  the  religious  susceptibilities  of  the\nadherents of that religion.\n\n\f19\n\nReligious appearance or dress\n\n14.\nreligious appearance or dress where\n\nSections 4 and 5 do not render unlawful discrimination in the case of\n\n(a)\n\nthe discrimination arises as a consequence of a person refusing to reveal\nhis face in circumstances in which the person has been requested to do\nso for the purpose of verifying the identity of the person, and the request\nwas reasonable in the circumstances;\n\n(b)\n\nby  reason  of  the  person's  appearance  or  dress,  the  person  is  not,  or\nwould not be, able to\n\n(i)\n\n(ii)\n\nperform  adequately,  and  without  endangering  himself  or  other\npersons,  the  work  genuinely  and  reasonably  required  for  the\nemployment or position in question; or\n\nrespond  adequately  to  situations  of  emergency  that  may\nreasonably be anticipated in connection with the employment or\nposition in question; or\n\n(c)\n\nthe  discrimination  is  for  the  purposes  of  enforcing  a  standard  of\nappearance or dress reasonably required for the employment.\n\nCharities\n\n15.\n\nSections 4 and 5 do not\n\n(a)\n\naffect  a  provision  in  a  charitable  instrument  for  conferring  benefits\nwholly or mainly on\n\n(i)\n\npersons  of  a  particular  sex,  race,  creed,  disability,  medical\ncondition, age or age group;\n\n(ii)\n\npersons of a particular marital or domestic partnership status;\n\n(iii)\n\npregnant women;\n\n(iv)\n\nspouses or domestic partners of a particular category;\n\n\f20\n\n(v)\n\npersons  with  family  responsibilities  or  particular  family\nresponsibilities; or\n\n(b)\n\nrender unlawful an act done to give effect to such a provision.\n\nSport\n\nSections 4 and 5 do not render unlawful the exclusion of persons from\n16.(1)\nparticipation  in  a  competitive  sporting  activity  on  the  ground  of  sex  in  the\nfollowing circumstances:\n\n(a)\n\n(b)\n\nwhere  the  sporting  activity  is  one  in  which  the  strength,  stamina  or\nphysique  of  the  competitor  is  relevant  to  the  outcome  of  the\ncompetition;\n\nwhere the exclusion is genuinely intended to facilitate or increase the\nparticipation of persons, or a category of persons, of a particular sex in\nthe sporting activity and\n\n(i)\n\nit is unlikely that those persons will participate, or that there will\nbe an increase in participation by those persons, in the sporting\nactivity if the exclusion is not made (having regard to all of the\ncircumstances of the persons or category of persons); and\n\n(ii)\n\nthere  are  reasonable  opportunities  for  excluded  persons  to\nparticipate in the sporting activity in another competition;\n\n(c)\n\nwhere\n\n(i)\n\nthe exclusion is reasonably required to enable participants in the\nsporting activity to advance to competitions at a level higher than\nthat in which the exclusion is to occur (being a requirement that\nis  due  to  the  structure  of,  or  restrictions  in,  the  higher  level\ncompetitions); and\n\n(ii)\n\nthere  are  reasonable  opportunities  for  excluded  persons  to\nparticipate in the sporting activity in another competition; or\n\n\f21\n\n(d)\n\nin such other circumstances as may be prescribed by the Minister by\nOrder.\n\nSections 4 and 5 do not render unlawful the exclusion of a person who has\n\n(2)\na disability from participation in a sporting activity where\n\n(a)\n\n(b)\n\nthe activity requires physical or intellectual attributes that the person\ndoes not possess; or\n\nin the case of a sporting activity conducted wholly or mainly for persons\nwho have a particular disability, the person's disability is not of that\nkind.\n\nSections  4  and  5  do  not  render  unlawful  the  exclusion  of  persons  of\n\n(3)\nparticular age groups from participation in a competitive sporting activity.\n\nSections 4 and 5 do not render unlawful the exclusion of persons from\n(4)\nparticipation in a competitive sporting activity on the ground of physical feature\nwhere the sporting activity is one in which the strength, stamina or physique of\nthe competitor is relevant to the outcome of the competition.\n\nVisual and performing arts\n\n17.(1)\nSections 4 and 5 do not render unlawful discrimination in relation to\nvisual and performing arts on the ground of age, race, sex or colour where the\ndiscrimination  is  reasonable  or  necessary  for  reasons  of  authenticity  or\ncredibility.\n\nSections 4 and 5 do not render unlawful discrimination in relation to visual\n\n(2)\nand performing arts on the ground of physical feature.\n\nFor  the  purpose  of  this  section  “visual  and  performing  arts”  includes\n\n(3)\nmodelling.\n\nEmployment other than in connection with a business\n\n18.\na business of the employer.\n\nThis Act does not apply where the employment is not connected with\n\n\f22\n\nInsurance\n\nSections 4 and 5 do not render unlawful discrimination on the ground\n19.\nof  sex,  age  or  medical  condition  in  respect  of  the  terms  on  which  medical\ninsurance or any other form of insurance is offered or may be obtained as a term\nor condition of employment where the discrimination is\n\n(a)\n\nbased  on  actuarial  or  statistical  data  from  a  source  on  which  it  is\nreasonable to rely; and\n\n(b)\n\nreasonable having regard to that data.\n\nException regarding identity of family member in certain cases\n\nSections 4 and 5 do not render unlawful discrimination on the ground\n20.\nof the identity of a family member where the discrimination is, having regard to\nall  the  circumstances  of  the  particular  case,  reasonably  necessary  to  preserve\nconfidentiality, avoid conflicts of interest or nepotism or protect the health or\nsafety of persons.\n\nException regarding pregnancy\n\n21.\nSections 4 and 5 do not render unlawful the granting to women of\nrights or privileges in connection with pregnancy or childbirth, whether pursuant\nto an enactment or otherwise.\n\nActs done in compliance with court order or pursuant to enactment\n\n22.\n\nAn act done\n\n(a)\n\n(b)\n\nin compliance with an order of a court; or\n\npursuant to any enactment,\n\nshall not be taken to be discrimination.\n\n\f23\n\nPART IV\n\nENFORCEMENT\n\nComplaint of discrimination in relation to job creation and\nrecruitment\n\nA  person  who  alleges  that  he  has  been  discriminated  against  in\n23.\ncontravention of section 4 may, within 3 months of the date of the occurrence of\nthe discrimination, make a written complaint to the Tribunal.\n\nComplaint of discrimination by fellow employee\n\nAn employee who alleges that he has been discriminated against by\n24.(1)\nanother  employee  may,  within  3  months  of  the  date  of  the  occurrence  of  the\ndiscrimination, make a written complaint to the employer.\n\n(2)\n\nAn employer shall, upon receipt of a complaint under subsection (1),\n\n(a)\n\ninform  the  employee  against  whom  the  complaint  is  made,  of  the\nsubstance of the complaint in writing; and\n\n(b)\n\ninvestigate the complaint.\n\n(3)\n\nWhere after conducting an investigation an employer finds that\n\n(a)\n\n(b)\n\nan employee has been discriminated against, the employer shall take\nsuch disciplinary action as is appropriate against the employee against\nwhom the complaint is made; or\n\ndiscrimination has not been committed, the employer shall in writing\nnotify the complainant and the employee against whom the complaint\nis made of his decision and the reason for it.\n\nWhere discrimination continues after a complaint is made to, or action is\n(4)\ntaken by, an employer under this section, an employee may, within 3 months of\nthe  date  of  the  occurrence  of  the  event  that  constitutes  a  continuation  of  the\ndiscrimination, make a written complaint to the Tribunal.\n\n\f24\n\n(5)\nWhere an employee is aggrieved by the decision or action of an employer\nunder this section, the employee may, within 3 months of the date of notification\nof  the  decision  or  the  taking  of  the  action,  make  a  written  complaint  to  the\nTribunal.\n\nComplaint of discrimination by employer\n\nAn employee who alleges that he has been discriminated against by\n25.\nhis employer in contravention of section 5 may, within 3 months of the date of\nthe occurrence of the discrimination, make a written complaint to the Tribunal.\n\nComplaint in relation to questions on or testing for medical conditions\n\nA person who alleges that he has been required to answer questions\n26.\nin relation to, or to undergo a test for, a medical condition as a precondition to\nentering into a contract of employment or as a condition for the continuance of\nemployment in contravention of section 6 may, within 3 months of the date on\nwhich the person was required to answer the questions or was informed of the\nrequirement for the test, make a written complaint to the Tribunal.\n\nComplaint in relation to failure to make reasonable adjustment\n\n27.(1)\nAn employee who alleges that an employer has contravened section\n7  in  relation  to  him  may,  within  3  months  of  the  date  on  which  the  matter\ncomplained of arose, make a written complaint to the Tribunal.\n\nA matter shall not be taken to have arisen for the purposes of making a\n(2)\ncomplaint under subsection (1) unless an employee allows an employer, having\nregard to the particular circumstances, a reasonable period within which to make\nan adjustment under section 7.\n\nComplaints by representative organisations and group complaints\n\n28.(1)\nanother representative group on behalf of a person.\n\nA complaint may be made by another person or by a trade union or\n\n\f25\n\n(2)\nWhere  a  group  of  persons,  having  the  same  or  substantially  the  same\ninterests,  has  a  complaint,  one  complaint  may  be  made  in  a  representative\ncapacity.\n\nTribunal may extend time for making complaint\n\nNotwithstanding sections 23 to 27, where the Tribunal is satisfied that\n29.\nit was not reasonably practicable for a complaint to be presented within a period\nprescribed in those sections, the Tribunal may hear and determine the complaint\nwhere  the  complaint  is  presented  within  such  further  period  as  the  Tribunal\nconsiders reasonable in the circumstances.\n\nComplaint to Tribunal to be made through Chief Labour Officer\n\n30.(1)\nthrough the Chief Labour Officer.\n\nA complaint to be made to the Tribunal under this Act shall be made\n\nA complaint shall be taken to have been made to the Tribunal on the date\n\n(2)\nthat it is presented to the Chief Labour Officer.\n\nAction by Chief Labour Officer and Tribunal upon receipt of a\ncomplaint\n\nSections  43  and  44  of\n\n31.\nthe  Employment  Rights  Act,  2012\n(Act  2012-9)  apply,  with  such  modifications  and  adaptations  as  may  be\nnecessary, to a complaint under this Act in the same manner as those sections\napply to a complaint under that Act.\n\nDetermination of complaint by Tribunal\n\n32.\nfounded, the Tribunal\n\nWhere  the  Tribunal  finds  that  a  complaint  under  this  Act  is  well\n\n(a)\n\n(b)\n\nshall make a declaration to that effect;\n\nmay order the respondent to\n\n(i)\n\npay compensation to the complainant;\n\n\f26\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\n(vi)\n\nmake such adjustment for the complainant as may be reasonable\nin the circumstances;\n\nmake  available  to  the  complainant,  specific  opportunities  and\nprivileges unfairly denied to the complainant;\n\nimplement such policies or measures as the Tribunal may order\nto eliminate discrimination or terminate any policies or measures\nthat facilitate discrimination;\n\nundertake  counselling  or\ndiscrimination;\n\ntraining  designed\n\nto  eliminate\n\nprovide to the Tribunal such reports as the Tribunal may require\nregarding the implementation by the respondent of the order of\nthe Tribunal; and\n\n(c)\n\nmay,  where  the  complaint  involved  the  dismissal  of  the  employee,\nproceed with the case under Part VI of the Employment Rights Act,\n2012 (Act 2012-9) as if the case were a case in which the Tribunal had\nfound that a complaint of unfair dismissal was well founded.\n\nFunctions of Chief Labour Officer generally in relation to\nadministration and enforcement of Act\n\nSections 5 and 45 of the Employment Rights Act, 2012 (Act 2012-9)\n33.\napply to the administration and enforcement of this Act, with such modifications\nand adaptations as may be necessary, as those sections apply to that Act.\n\n\f27\n\nPART V\n\nMISCELLANEOUS\n\nRegister of complaints\n\n34.(1)\ncomplaints made under this Act.\n\nThe  Chief  Labour  Officer  shall  cause  to  be  kept  a  register  of  all\n\n(2)\n\nThe Chief Labour Officer shall cause to be recorded in the register\n\n(a)\n\n(b)\n\nthe name and address of the person who made the complaint;\n\nthe ground of discrimination alleged and a brief statement of the facts\ngiving rise to the complaint; and\n\n(c)\n\nsuch other information as may be appropriate.\n\n(3)\n\nThe register shall be maintained in a confidential manner.\n\nPolicy against discrimination\n\n35.(1)\n\nAn employer shall\n\n(a)\n\nhave a clear, written policy against discrimination within the workplace\nwhich\n\n(i)\n\nmust contain the terms set out in the First Schedule; and\n\n(ii)\n\nmay contain any term that is consistent with this Act; and\n\n(b)\n\npresent a copy of the policy to each employee within 6 months of the\ncommencement of this Act or upon the commencement of employment\nby the employee.\n\nAn  employer  may  consult  with  employees  and  their  representatives  in\n\n(2)\nrelation to the establishment of the policy.\n\n\f28\n\n(3)\nA person who contravenes subsection (1) is guilty of an offence and is\nliable on summary conviction to a fine of $5 000 or to imprisonment for 6 months\nor both.\n\n(4)\n\nThe Minister may by Order amend the First Schedule.\n\nConfidentiality\n\n36.(1)\nemployee shall\n\nAn  employer  who  keeps  or  handles  the  medical  records  of  an\n\n(a)\n\n(b)\n\nensure that the records are kept and handled confidentially; and\n\nnot divulge the contents of the records to any person except\n\n(i)\n\nwith  the  consent  of  the  employee  and  in  accordance  with  the\nterms of that consent;\n\n(ii)\n\nin accordance with an order of the Tribunal or a court; or\n\n(iii)\n\nin accordance with an enactment.\n\nAn employer who contravenes subsection (1) is guilty of an offence and\n(2)\nis liable on summary conviction to a fine of $10 000 or to imprisonment for one\nyear or both.\n\nProhibition of victimization of employees\n\n37.(1)\nopportunities and terms and conditions of service of an employee who has\n\nNo employer shall carry out any action which adversely affects the\n\n(a)\n\n(b)\n\n(c)\n\nmade a complaint under this Act;\n\ngiven testimony with respect to any investigation conducted or hearing\nheld under this Act in connection with a complaint; or\n\notherwise participated in an investigation, procedure or hearing under\nthis Act.\n\n\f29\n\nNo  person  shall  subject  or  threaten  to  subject  another  person  to  any\n\n(2)\ndetriment on the ground that the other person has\n\n(a)\n\n(b)\n\n(c)\n\nmade or proposes to make a complaint under this Act;\n\nfurnished or proposes to furnish any information or any documents to\na person exercising or performing any function under this Act; or\n\nattended or proposes to attend a hearing under this Act in which he has\na direct interest or to appear at the hearing as a witness.\n\nA person who contravenes subsection (1) or (2) is guilty of an offence and\n(3)\nis liable on summary conviction to a fine of $20 000 or to imprisonment for 2\nyears or both.\n\nRegulations\n\n38.\n\nThe Minister may make Regulations for giving effect to this Act.\n\nConsequential amendments\n\n39.\namended to the extent specified opposite thereto in the second column.\n\nThe enactment set out in the first column of the Second Schedule is\n\nCommencement\n\n40.\n\nThis Act comes into operation on a date to be fixed by Proclamation.\n\n\f30\n\nFIRST SCHEDULE\n\nCONTENT OF POLICY STATEMENT AGAINST DISCRIMINATION\n\nThe policy statement against discrimination referred to in section 35 must contain the following\nprovisions:\n\n(Section 35)\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\na definition of discrimination that is substantially the same as the definition in section\n3;\n\na  statement  to  the  effect  that  every  employee  is  entitled  to  employment  free  of\ndiscrimination;\n\na statement to the effect that the employer will make every reasonable effort to ensure\nthat no employee is subjected to discrimination;\n\na statement to the effect that the employer will take such disciplinary measures as\nthe employer deems appropriate against any person under the employer’s direction\nwho subjects an employee to discrimination;\n\na  statement  explaining  how  complaints  of  discrimination  may  be  brought  to  the\nattention of the employer;\n\na statement to the effect that the employer will not disclose the name of a complainant\nor respondent or the circumstances related to a complaint to any person except where\ndisclosure  is  necessary  for  the  purposes  of  investigating  the  complaint  or  taking\ndisciplinary measures in relation thereto; and\n\na statement informing employees of the provisions in this Act which give them a\nright to make a complaint where discrimination is committed against them and the\nrelevant authority to whom the complaint may be made.\n\n\f31\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosSECOND SCHEDULE(Section 39)CONSEQUENTIAL AMENDMENTSColumn 1EnactmentEmployment Rights Act, 2012 (Act 2012-9).Column 2Amendments1.In section 2, delete the definitions of \"disability\",\"family member\" and \"spouse\".   2.Delete section 7(2) and substitute the following:\"(2) The jurisdiction of the Tribunal is to determinecomplaints made to it under this Act or under any other enactment that provides for enforcementby the Tribunal, and subject to section 48, to make awards and other decisions in relation to thosecomplaints in accordance with its powers.\".3.In section 11, insert after the word \"harassment\",the words \"or a contravention of the Employment (Preventionof Discrimination) Act, 2020 (Act 2020-  )\". 4.In section 30(1)(a) in paragraph (c)(i) delete sub-paragraph (vii);(ii) in sub-paragraph (ix), insert after the semicolon, the word \"or\"; and (iii) delete sub-paragraphs (x) and (xi); and(b) insert after paragraph (c), the following:\"(d) the reason for the dismissal constitutes a contravention of the Employment (Prevention of Discrimination) Act, 2020 (Act 2020-  ).\".\f32\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n\fEMPLOYMENT (PREVENTION OF DISCRIMINATION) BILL, 2020\n\nEXPLANATORY MEMORANDUM\n\nThe Bill would protect persons from discrimination related to employment.\n\nPART I - PRELIMINARY\n\nClause 1:\n\nprovides the short title.\n\nClause 2:\n\nprovides definitions for certain terms used in the Bill.\n\nPART II - DISCRIMINATION\n\nClause 3:\n\nexplains the concept of discrimination.\n\nClause 4:\n\nClause 5:\n\nClause 6:\n\nClause 7:\n\nprohibits  discrimination  in  relation  to  job  creation  and\nrecruitment.\n\nprohibits discrimination in relation to employment, including\nin terms of promotion, transfer and training.\n\nprevents  employers  from  testing  an  employee  or  potential\nemployee for a medical condition unless the issue relates to a\ngenuine occupational qualification of the job\n\nrequires  an  employer  to  make  reasonable  adjustment  for\nemployees in relation to certain issues including disability and\nfamily responsibility.\n\nPART III - EXCEPTIONS\n\nClause 8:\n\nexplains the concept of a genuine occupational qualification.\n\ni\n\n\fEmployment (Prevention of\nDiscrimination) Bill, 2020\n\nClause 9:\n\nrelieves an employer from making certain adjustments for an\nemployee where to do so would cause unjustifiable hardship.\n\nClauses 10 to 22:\n\nClause 23:\n\nClause 24:\n\nClause 25:\n\nClause 26:\n\nClause 27:\n\nClause 28:\n\nprovides certain exceptions to the rules against discrimination.\nThese include measures to achieve equality, for the care of\nminors,  by\ninstitutions\nreligious  bodies,  educational\nadministered  in  accordance  with  religious  beliefs  and\ncharities, in the area of sports and visual and performing arts,\nwhere  employment  is  not  connected  with  an  employer’s\nbusiness, for the purpose of insurance and measures to comply\nwith court orders and other laws.\n\nPART IV - ENFORCEMENT\n\nprovides for a person to make a complaint to the Employment\nRights Tribunal where he is discriminated against in respect\nof the creation of jobs or recruitment.\n\nrequires an employee to first complain to his employer where\na fellow employee discriminates against him and, where the\ndiscrimination continues, to complain to the Tribunal.\n\nprovides for an employer to complain to the Tribunal where\nhis employer discriminates against him.\n\npermits the making of a complaint where a person is required\nto  be  tested  for  a  medical  condition  as  a  condition  of\nemployment or continued employment.\n\nallows for an employee to also complain where an employer\nfails to make reasonable adjustment for him.\n\nprovides  for  complaints  by  employee  representatives  and\ngroup complaints.\n\nii\n\n\fEmployment (Prevention of\nDiscrimination) Bill, 2020\n\nClause 29:\n\nClause 30:\n\nClause 31:\n\nClause 32:\n\nempowers  the  Tribunal  to  extend  the  time  for  making  a\ncomplaint in appropriate cases.\n\nrequires that a complaint to the Tribunal be made through the\nChief Labour Officer.\n\nexplains the role of the Chief Labour Officer and the Tribunal\nupon receipt of a complaint.\n\nprovides for the determination of complaints by the Tribunal\nand the remedies that may be awarded.\n\nClause 33:\n\nsets out the functions of the Chief Labour Officer.\n\nClause 34:\n\nClause 35:\n\nClause 36:\n\nClause 37:\n\nPART V - MISCELLANEOUS\n\nrequires  the  Chief  Labour  Officer  to  keep  a  register  of\ncomplaints.\n\nrequires  an  employer  to  establish  and  distribute  a  policy\nstatement against discrimination. The mandatory terms of the\nstatement are set out in the First Schedule.\n\nimposes a duty of confidentiality on an employer who handles\nthe medical records of his employees.\n\nproscribes, among other things, victimization of employees\nwho make complaints.\n\nClause 38:\n\nempowers the Minister to make regulations.\n\nClause 39:\n\nrequires  the  making  of  consequential  amendments  to  the\nEmployment Rights Act, 2012 (Act 2012-9). The amendments\nare set out in the Second Schedule.\n\niii\n\n\fEmployment (Prevention of\nDiscrimination) Bill, 2020\n\nClause 40:\n\nprovides  for  the  commencement  of  the  legislation  upon\nProclamation.\n\niv\n\n"
}