{
  "bill_id": 484,
  "slug": "remediation-agreements-deferred-prosecution-bill-2020",
  "title": "Remediation Agreements (Deferred  Prosecution) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/76096dad5b54009f4ca6efeafd19f02a.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2020-03-20",
  "first_reading": "2020-03-20",
  "gazette_date": "2020-03-23",
  "markdown": "Explanatory Memorandum at page 24\n\n2020-02-27\n\nOBJECTS AND REASONS\n\nThis Bill would provide for a prosecutor, in relation to certain offences, to enter\ninto an agreement to defer prosecution of an alleged offender and impose certain\nobligations on the offender, where such an agreement would be in the interest of\njustice.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nObjectives of Act\n\nMaking of remediation agreement\n\nEffect of remediation agreement on court proceedings\n\nEligibility to enter into remediation agreement\n\nNotice regarding negotiation of remediation agreement\n\nContent of remediation agreement\n\nCode on remediation agreements\n\n10.\n\nPreliminary hearing for court approval of remediation agreement\n\n11.\n\nFinal hearing for court approval of remediation agreement\n\n12.\n\nBreach of remediation agreement\n\n13.\n\nVariation of remediation agreement\n\n14.\n\nProceedings not to be instituted on expiry of remediation agreement\n\n15.\n\nPostponement of publication of information by prosecutor\n\n\f3\n\n16.\n\nUse of material in criminal proceedings\n\n17.\n\nLimitation periods\n\n18.\n\nMoney received by prosecutor under remediation agreement\n\n19.\n\nReports to Parliament\n\n20.\n\nApplication of Act\n\n21.\n\nAlteration of Constitution\n\n22.\n\nAmendment of Schedule\n\n23.\n\nRegulations\n\n24.\n\nTransitional provision\n\n25.\n\nCommencement\n\nSCHEDULE\n\nOFFENCES IN RESPECT OF WHICH REMEDIATION AGREEMENTS\nMAY BE MADE\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  provide  for  a  prosecutor  to  enter  into  an  agreement  to  defer\nprosecution  of  an  alleged  offender  and  impose  certain  obligations  on  the\noffender, where such an agreement would be in the interest of justice.\n\nENACTED by the Parliament of Barbados in accordance with section 49 of\n\nthe Constitution as follows:\n\n\f6\n\nShort title\n\n1.\nProsecutions) Act, 2020.\n\nThis  Act  may  be  cited  as  the  Remediation  Agreements  (Deferred\n\nInterpretation\n\n2.\n\nIn this Act\n\n“alleged offence” means an offence specified in paragraph 1 of the Schedule;\n\n“alleged offender” means a person whom a prosecutor is considering prosecuting\n\nfor an alleged offence;\n\n“expiry date”, in relation to a remediation agreement, means the date on which\nthe agreement ceases to have effect where it has not already been terminated\nunder section 12;\n\n“prosecutor” means the Director of Public Prosecutions or the Director General\nof the Major Organised Crime, Anti-Corruption and Anti-Terrorism Agency\nestablished by section 4 of the Major Organised Crime, Anti-Corruption\nand Anti-Terrorism Act, 2020 (Act 2020- ), as the case may be;\n\n“publish” means to publish in the Official Gazette;\n\n“remediation agreement” has the meaning assigned to it by section 4.\n\nObjectives of Act\n\n3.\n\nThe objectives of this Act are\n\n(a)\n\n(b)\n\n(c)\n\nto encourage the voluntary disclosure of wrongdoing;\n\nto  hold  persons  accountable  for  wrongdoing  through  effective,\nproportionate and dissuasive penalties;\n\nto  impose  an  obligation  on  persons  who  engage  in  wrongdoing  to\nimplement corrective measures and promote a culture of compliance;\n\n\f7\n\n(d)\n\nto reduce the negative consequences of wrongdoing for persons such\nas employees and customers who did not engage in the wrongdoing;\nand\n\n(e)\n\nto provide reparation for harm done as a result of wrongdoing.\n\nMaking of remediation agreement\n\n4.(1)\nagreement between a prosecutor and an alleged offender in which\n\nFor  the  purposes  of  this  Act,  a  remediation  agreement  means  an\n\n(a)\n\n(b)\n\nthe alleged offender agrees to comply with the requirements imposed\nby the agreement; and\n\nthe prosecutor agrees that, upon approval of the agreement by the High\nCourt pursuant to section 11, section 5 shall apply in relation to the\nprosecution of the alleged offender for the alleged offence.\n\nIn determining whether to enter into a remediation agreement, a prosecutor\n\n(2)\nshall have regard to the objectives of this Act.\n\nA prosecutor shall not enter into a remediation agreement with an alleged\n\n(3)\noffender unless the prosecutor is of the opinion that\n\n(a)\n\nthere is a reasonable prospect of conviction with respect to the alleged\noffence;\n\n(b)\n\nthe act that forms the basis of the alleged offence\n\n(i)\n\ndid not cause, and was not likely to have caused, serious bodily\nharm or death;\n\n(ii)\n\ndid not prejudice national defence or national security;\n\n(iii)\n\nwas not committed for the benefit of, at the direction of, or in\nassociation with, a terrorist or terrorist organisation; and\n\n(c)\n\nentering into the agreement with the alleged offender is likely to be in\nthe interest of justice.\n\n\f8\n\nIn  determining  whether  a  remediation  agreement  is  likely  to  be  in  the\n\n(4)\ninterest of justice, the following factors shall be taken into account:\n\n(a)\n\nthe circumstances in which the act that forms the basis of the alleged\noffence was brought to the attention of the investigative authorities;\n\n(b)\n\nthe nature and gravity of the act and its impact on any victim;\n\n(c)\n\nthe degree of involvement of senior officers of the alleged offender in\nthe act;\n\n(d)\n\nwhether the alleged offender has\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\ntaken disciplinary action, including termination of employment,\nagainst any person who was involved in the act;\n\nmade  reparation  or  taken  other  measures  to  remedy  the  harm\ncaused by the act and to prevent the commission of similar acts;\n\nidentified,  or  expressed  a  willingness  to  identify,  any  person\ninvolved in wrongdoing related to the act; or\n\nentered  into  a  previous  remediation  agreement  or  other\nsettlement, in Barbados or elsewhere, for similar acts;\n\n(e)\n\nwhether the alleged offender, or any of its representatives\n\n(i)\n\n(ii)\n\nwas  convicted  of  an  offence  or  sanctioned  by  a  regulatory\nauthority; or\n\nis  alleged  to  have  committed  any  other  offences,  including\noffences not listed in the Schedule; and\n\n(f)\n\nany other relevant factor.\n\nA  prosecutor  may  enter  into  a  remediation  agreement  with  an  alleged\n(5)\noffender at any time before the institution of criminal proceedings for an alleged\noffence.\n\nFor the purpose of subsection (5), proceedings shall be taken to have been\n\n(6)\ninstituted for an alleged offence when a person is charged with the offence.\n\n\f9\n\nEffect of remediation agreement on court proceedings\n\nWhere a prosecutor and an alleged offender enter into a remediation\n5.\nagreement, no person shall prosecute the alleged offender for the alleged offence\nat any time when the agreement is in force.\n\nEligibility to enter into remediation agreement\n\nAn  alleged  offender  that  is  a  body  corporate,  a  partnership  or  an\n6.(1)\nunincorporated association may enter into a remediation agreement but an alleged\noffender who is an individual is not eligible to enter into such an agreement.\n\n(2)\n\nWhere a remediation agreement is to be entered into by\n\n(a)\n\na partnership\n\n(i)\n\n(ii)\n\nthe agreement must be entered into in the name of the partnership,\nand not in that of any of the partners; and\n\nany money payable under the agreement must be paid out of the\nfunds of the partnership;\n\n(b)\n\nan unincorporated association\n\n(i)\n\n(ii)\n\nthe agreement must be entered into in the name of the association,\nand not in that of any of the members; and\n\nany money payable under the agreement must be paid out of the\nfunds of the association.\n\nNotice regarding negotiation of remediation agreement\n\n7.(1)\nWhere a prosecutor wishes to negotiate a remediation agreement, the\nprosecutor shall give the alleged offender written notice of the offer to enter into\nnegotiations.\n\n\f(2)\n\nA notice referred to in subsection (1) shall include\n\n10\n\n(a)\n\na brief description of the alleged offence to which the agreement would\napply;\n\n(b)\n\nan indication of the voluntary nature of the negotiation process;\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\na statement on the legal effect of the agreement;\n\nan indication that, by agreeing to the terms of the notice, the alleged\noffender explicitly waives the inclusion of the negotiation period and\nthe period during which the agreement is in force in any assessment of\nthe  reasonableness  of  the  delay  in  instituting  proceedings  for  the\nalleged offence;\n\nan indication that negotiations must be carried out in good faith and\nthat the alleged offender must provide all information requested by the\nprosecutor that the alleged offender is aware of or can obtain through\nreasonable efforts, including information enabling the identification of\nany person involved in the act that forms the basis of the alleged offence\nor any wrongdoing related to that act;\n\nan indication of how the information disclosed by the alleged offender\nduring the negotiations may be used in accordance with section 16;\n\na  warning  that  knowingly  providing  inaccurate,  misleading  or\nincomplete  information  during  the  negotiations  may  lead  to  the\ninstitution of proceedings for the alleged offence or prosecution for\nobstruction of justice;\n\nan indication that either party may withdraw from the negotiations by\nproviding written notice to the other party;\n\nan indication that reasonable efforts must be made by both parties to\nidentify any victim of the alleged offence as soon as practicable; and\n\na deadline to accept the offer to negotiate in accordance with the terms\nof the notice.\n\n\f11\n\nContent of remediation agreement\n\n8.(1)\n\nA remediation agreement shall include\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\na statement of facts relating to the alleged offence, which may include\nadmissions made by the alleged offender, and an undertaking by the\nalleged  offender  not  to  make  or  condone  any  public  statement  that\ncontradicts those facts;\n\nan indication of the use that can be made of information obtained as a\nresult of the agreement in accordance with section 16;\n\na statement on the legal effect of the agreement;\n\nan indication of the obligation of the alleged offender to report on the\nimplementation  of  the  agreement  to  the  prosecutor,  or  such\nindependent monitor as the prosecutor may appoint for the purpose,\nand an indication of the manner in which the report is to be made, and\nany other terms with respect to reporting;\n\na  statement  that  the  agreement  may  be  varied  in  accordance  with\nsection 13;\n\na warning that the breach of any term of the agreement may lead to an\napplication by the prosecutor for termination of the agreement and the\ninstitution of proceedings against the alleged offender for the alleged\noffence; and\n\n(g)\n\nan expiry date.\n\nA  remediation  agreement  may  include  a  requirement  for  an  alleged\n\n(2)\noffender to\n\n(a)\n\n(b)\n\n(c)\n\npay a financial penalty to the Court;\n\ncompensate victims of the alleged offence;\n\ndonate money to a charity or other third party;\n\n\f12\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\ndisgorge  any  profits  made  by  the  alleged  offender  from  the  alleged\noffence;\n\nimplement a compliance programme or make changes to an existing\ncompliance programme relating to the policies of the alleged offender\nor to the training of the employees of the alleged offender or both;\n\nco-operate in any investigation related to the alleged offence;\n\npay  any  reasonable  costs  associated  with  the  alleged  offence  or  the\nagreement; or\n\n(h)\n\ncomply with any other appropriate obligation.\n\nA remediation agreement may provide time limits within which the alleged\n\n(3)\noffender must comply with the requirements imposed.\n\nCode on remediation agreements\n\n9.(1)\n\nThe Minister may by Order issue a code giving guidance on\n\n(a)\n\n(b)\n\nthe  general  principles  to  be  applied  in  determining  whether  a\nremediation agreement is likely to be appropriate in a given case; and\n\nthe disclosure of information by a prosecutor to an alleged offender in\nthe course of negotiations for a remediation agreement and after such\nan agreement has been made.\n\nThe code may, in addition to the matters set out in subsection (1), provide\n\n(2)\nguidance on any other relevant matter including\n\n(a)\n\nthe  use  of  information  obtained  by  a  prosecutor  in  the  course  of\nnegotiations for a remediation agreement;\n\n(b)\n\nvariation of the agreement;\n\n(c)\n\n(d)\n\ntermination  of  the  agreement  and  the  steps  that  may  be  taken  by  a\nprosecutor following such termination; and\n\nthe  steps  that  may  be  taken  by  a  prosecutor  where  the  prosecutor\nsuspects that the agreement has been breached.\n\n\f13\n\nA  prosecutor  shall  take  account  of  the  code  in  exercising  his  functions\n\n(3)\nunder this Act.\n\nPreliminary hearing for court approval of remediation agreement\n\n10.(1)\nAfter the commencement of negotiations between a prosecutor and an\nalleged offender in respect of a remediation agreement but before the terms of\nthe  agreement  are  agreed,  the  prosecutor  shall  apply  to  the  High  Court  for  a\ndeclaration that\n\n(a)\n\n(b)\n\nentering  into  a  remediation  agreement  with  the  alleged  offender  is\nlikely to be in the interest of justice; and\n\nthe  proposed  terms  of  the  agreement  are  fair,  reasonable  and\nproportionate to the gravity of the alleged offence.\n\nThe court shall give reasons for its decision to make, or not to make, a\n\n(2)\ndeclaration under subsection (1).\n\nThe prosecutor may make a further application to the court for a declaration\n(3)\nunder subsection (1) where, following the previous application, the court declined\nto make a declaration.\n\nA hearing at which an application under this section is determined shall be\n(4)\nheld, any declaration under subsection (1) shall be made, and the reasons referred\nto in subsection (2) shall be given, in camera.\n\nFinal hearing for court approval of remediation agreement\n\n11.(1)\nWhere a prosecutor and an alleged offender have agreed the terms of\na  remediation  agreement,  the  prosecutor  shall  apply  to  the  High  Court  for  a\ndeclaration that\n\n(a)\n\n(b)\n\nthe remediation agreement is in the interest of justice; and\n\nthe terms of the agreement are fair, reasonable and proportionate to the\ngravity of the alleged offence.\n\n\f14\n\n(2)\nNotwithstanding  subsection  (1),  the  prosecutor  shall  not  make  an\napplication under subsection (1) unless the court has made a declaration under\nsection 10(1).\n\nA remediation agreement comes into force only when it is approved by the\n\n(3)\ncourt making a declaration under subsection (1).\n\nThe court shall give reasons for its decision to make, or not to make, a\n\n(4)\ndeclaration under subsection (1).\n\nA hearing at which an application under this section is determined may be\n\n(5)\nheld in camera.\n\nNotwithstanding  subsection  (5),  where  the  court  decides  to  approve  a\n(6)\nremediation agreement and make a declaration under subsection (1) the court\nshall do so, and give its reasons, in open court.\n\nWhere the court approves a remediation agreement, the prosecutor shall\n\n(7)\npublish\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe fact that the agreement has been made;\n\nthe declaration of the court under section 10 and the reasons for its\ndecision to make the declaration;\n\nwhere the court initially declined to make a declaration under section\n10, the reasons for that decision; and\n\nthe declaration of the court under this section and the reasons for its\ndecision to make the declaration,\n\nunless the prosecutor is prevented from doing so by any other enactment or by\nan order of the court under section 15.\n\nBreach of remediation agreement\n\nWhere a remediation agreement is in force and the prosecutor believes\n12.(1)\nthat the alleged offender has failed to comply with the terms of the agreement,\n\n\f15\n\nthe prosecutor may make an application to the High Court for it to determine the\nmatter.\n\nThe  court  shall,  on  an  application  referred  to  in  subsection  (1),  decide\n(2)\nwhether, on the balance of probabilities, the alleged offender has failed to comply\nwith the terms of the agreement.\n\nWhere the court finds that the alleged offender has failed to comply with\n\n(3)\nthe terms of the remediation agreement, the court may\n\n(a)\n\ninvite  the  prosecutor  and  the  alleged  offender  to  agree  proposals  to\nremedy the failure of the alleged offender to comply; or\n\n(b)\n\nterminate the agreement.\n\n(4)\n\nThe court shall give reasons for its decisions under subsections (2) and (3).\n\nWhere the court decides that the alleged offender has not failed to comply\n(5)\nwith the terms of the remediation agreement, the prosecutor shall publish the\ndecision of the court and its reasons for that decision, unless the prosecutor is\nprevented from doing so by any other enactment or by an order of the court under\nsection 15.\n\nWhere the court invites the prosecutor and the alleged offender to agree\n(6)\nproposals to remedy the failure of the alleged offender to comply with the terms\nof the remediation agreement, the prosecutor shall publish the decisions of the\ncourt under subsections (2) and (3) and the reasons for those decisions, unless\nthe prosecutor is prevented from doing so by any other enactment or by an order\nof the court under section 15.\n\nWhere the court terminates a remediation agreement under subsection (3)\n\n(7)\n(b), the prosecutor shall publish\n\n(a)\n\nthe  fact  that  the  remediation  agreement  has  been  terminated  by  the\ncourt following a failure by the alleged offender to comply with the\nterms of the agreement; and\n\n(b)\n\nthe reasons of the court for its decisions under subsections (2) and (3),\n\n\f16\n\nunless the prosecutor is prevented from doing so by any other enactment or by\nan order of the court under section 15.\n\nWhere the prosecutor believes that an alleged offender has failed to comply\n(8)\nwith the terms of a remediation agreement but decides not to make an application\nto the court under this section, the prosecutor shall publish details relating to that\ndecision, including the reasons for\n\n(a)\n\nthe  belief  of  the  prosecutor  that  the  alleged  offender  has  failed  to\ncomply; and\n\n(b)\n\nthe decision of the prosecutor not to make an application to the court,\n\nunless the prosecutor is prevented from doing so by any other enactment or by\nan order of the court under section 15.\n\nVariation of remediation agreement\n\n13.(1)\na remediation agreement where\n\nA prosecutor and an alleged offender may agree to vary the terms of\n\n(a)\n\n(b)\n\nthe  High  Court  has  invited  the  parties  to  vary  the  agreement  under\nsection 12(3)(a); or\n\nvariation of the agreement is necessary to avoid a failure by the alleged\noffender to comply with its terms in circumstances that were not, and\ncould not have been, foreseen by the prosecutor or the alleged offender\nat the time that the agreement was made.\n\nWhere a prosecutor and an alleged offender have agreed to vary the terms\n(2)\nof a remediation agreement, the prosecutor shall apply to the High Court for a\ndeclaration that\n\n(a)\n\n(b)\n\nthe variation is in the interest of justice; and\n\nthe  terms  of  the  agreement  as  varied  are  fair,  reasonable  and\nproportionate to the gravity of the alleged offence.\n\n\f17\n\nA  variation  of  a  remediation  agreement  only  takes  effect  when  it  is\n\n(3)\napproved by the court making a declaration under subsection (2).\n\nThe court shall give reasons for its decision on whether or not to make a\n\n(4)\ndeclaration under subsection (2).\n\nA hearing at which an application under this section is determined may be\n\n(5)\nheld in camera.\n\nNotwithstanding subsection (5), where the court decides to approve the\n(6)\nvariation of a remediation agreement and make a declaration under subsection\n(2) it shall do so, and give its reasons, in open court.\n\nWhere the court decides not to approve the variation, the prosecutor shall\n(7)\npublish the decision of the court and the reasons for it, unless the prosecutor is\nprevented from doing so by any other enactment or by an order of the court under\nsection 15.\n\nWhere  the  court  decides  to  approve  the  variation  of  a  remediation\n(8)\nagreement, the prosecutor shall publish the declaration of the court under this\nsection  and  the  reasons  for  its  decision  to  make  the  declaration,  unless  the\nprosecutor is prevented from doing so by any other enactment or by an order of\nthe court under section 15.\n\nProceedings not to be instituted on expiry of remediation agreement\n\n14.(1)\nWhere a remediation agreement remains in force until its expiry date,\nafter the expiry of the agreement, subject to subsection (2), no proceedings shall\nbe instituted against the alleged offender for the alleged offence.\n\nSubsection (1) does not prevent proceedings from being instituted against\n(2)\nan  alleged  offender  where,  after  a  remediation  agreement  has  expired,  the\nprosecutor finds that, during the course of the negotiations for the agreement\n\n(a)\n\nthe  alleged  offender  provided  inaccurate,  misleading  or  incomplete\ninformation to the prosecutor; and\n\n\f18\n\n(b)\n\nthe alleged offender knew or ought to have known that the information\nwas inaccurate, misleading or incomplete.\n\n(3)\nA  remediation  agreement  shall  not  be  treated  as  having  expired  for  the\npurposes of subsection (1) where, on the expiry date specified in the agreement\n\n(a)\n\n(b)\n\n(c)\n\nan application made by the prosecutor under section 12 has not yet been\ndecided by the court;\n\nfollowing  an  application  under  section  12  the  court  has  invited  the\nparties to agree proposals to remedy the failure of the alleged offender\nto comply with the remediation agreement, but the parties have not yet\nreached an agreement; or\n\nthe parties have agreed proposals to remedy the failure of the alleged\noffender to comply with the agreement following an invitation of the\ncourt  under  section  12(3)(a)  but  the  alleged  offender  has  not  yet\ncomplied.\n\n(4)\n\nIn the case referred to in\n\n(a)\n\nsubsection (3)(a), where the court\n\n(i)\n\n(ii)\n\n(iii)\n\ndecides that the alleged offender has not failed to comply with\nthe  terms  of  the  remediation  agreement  or  that  the  alleged\noffender  has  failed  to  comply,  but  does  not  take  action  under\nsection 12(3), the agreement shall be treated as expiring when the\napplication is decided;\n\nterminates  the  remediation  agreement,  the  agreement  shall  be\ntreated as not having remained in force until its expiry date, and\nsubsection (1) therefore does not apply;\n\ninvites the parties to agree proposals to remedy the failure of the\nalleged  offender  to  comply  the  remediation  agreement,  the\nremediation  agreement  shall  be  treated  as  expiring  when  the\nparties have reached such an agreement and the alleged offender\nhas complied with it;\n\n\f19\n\n(b)\n\nsubsection  (3)(b),  the  remediation  agreement  shall  be  treated  as\nexpiring when the parties have reached an agreement and the alleged\noffender has complied with it; and\n\n(c)\n\nsubsection  (3)(c),  the  remediation  agreement  shall  be  treated  as\nexpiring when the alleged offender complies with the agreement.\n\nWhere, by virtue of subsection (1), no proceedings can be instituted against\n\n(5)\nthe alleged offender for the alleged offence, the prosecutor shall publish\n\n(a)\n\n(b)\n\nthe fact that the remediation agreement has expired; and\n\ndetails of the compliance of the alleged offender with the agreement,\n\nunless the prosecutor is prevented from doing so by any other enactment or by\nan order of the court under section 15.\n\nPostponement of publication of information by prosecutor\n\nThe High Court may order that the publication of information by the\n15.\nprosecutor  under  section  11(7),12(5),  (6),  (7)  or  (8),  13(7)  or  (8)  or  14(5)  be\npostponed for such period as the court considers necessary if it appears to the\ncourt that postponement is necessary for avoiding a substantial risk of prejudice\nto the administration of justice in any legal proceedings.\n\nUse of material in criminal proceedings\n\n16.(1)\nWhere a remediation agreement between a prosecutor and an alleged\noffender has been approved by the High Court under section 11, the statement of\nfacts  contained  in  the  agreement  shall,  in  any  criminal  proceedings  brought\nagainst the alleged offender for the alleged offence, be treated as an admission\nby the alleged offender.\n\nWhere  the  prosecutor  and  an  alleged  offender  have  entered  into\n(2)\nnegotiations  for  a  remediation  agreement  but  the  agreement  has  not  been\n\n\f20\n\napproved by the court under section 11, material described in subsection (4) shall\nonly be used in evidence against the alleged offender on a prosecution for\n\n(a)\n\n(b)\n\nan  offence  consisting  of  the  provision  of  inaccurate,  misleading  or\nincomplete information; or\n\nsome  other  offence  where  in  giving  evidence  the  alleged  offender\nmakes a statement inconsistent with the material.\n\nNotwithstanding subsection (2)(b), material shall not be used against an\n(3)\nalleged offender by virtue of subsection (2)(b) unless evidence relating to it is\nadduced,  or  a  question  relating  to  it  is  asked,  by  or  on  behalf  of  the  alleged\noffender in the proceedings arising out of the prosecution.\n\n(4)\n\nThe material referred to in subsection (2) is\n\n(a)\n\nmaterial that shows that the alleged offender entered into negotiations\nfor a remediation agreement, including in particular\n\n(i)\n\n(ii)\n\nany draft of the agreement;\n\nany draft of a statement of facts intended to be included in the\nagreement; and\n\n(iii)\n\nany statement indicating that the alleged offender entered into\nsuch negotiations; and\n\n(b)\n\nmaterial  that  was  created  solely  for  the  purpose  of  preparing  the\nagreement or statement of facts.\n\nLimitation periods\n\n17.\na remediation agreement applies is suspended while the agreement is in force.\n\nThe running of a limitation period in respect of any offence to which\n\nMoney received by prosecutor under remediation agreement\n\nAny money received by a prosecutor under a term of a remediation\n18.\nagreement that provides for an alleged offender to pay a financial penalty to the\n\n\f21\n\nCourt or to disgorge profits made from an alleged offence shall be paid into the\nConsolidated Fund.\n\nReports to Parliament\n\n19.\nThe Minister shall, within 3 months of the end of each year, cause to\nbe  laid  in  Parliament  a  report  of  the  remediation  agreements  made,  varied,\nbreached and terminated during the year.\n\nApplication of Act\n\nThis  Act  applies  in  relation  to  conduct  occurring  before  the\n20.\ncommencement of this Act as if an alleged offence included any corresponding\noffence under the law in force at the time of the conduct.\n\nAlteration of Constitution\n\n21.\neffect to this Act.\n\nSection 79 of the Constitution is altered to the extent necessary to give\n\nAmendment of Schedule\n\n22.\nSchedule by\n\nThe Minister may by Order subject to negative Resolution amend the\n\n(a)\n\n(b)\n\nadding an offence; or\n\nremoving an offence.\n\nRegulations\n\n23.\n\nThe Minister may make Regulations for giving effect to this Act.\n\nTransitional provision\n\n24.(1)\nConduct  constituting  an  alleged  offence  that  occurred  before  the\nrelevant commencement day may be taken into account for the purposes of this\nAct.\n\n\f22\n\n(2)\n\nIn this section, “relevant commencement day” means\n\n(a)\n\n(b)\n\nwhere  the  alleged  offence  is  an  offence  that  is  specified  in  the\nSchedule when this Act comes into effect, the day on which this Act\ncomes into effect;\n\nwhere the alleged offence is an offence that is subsequently added to\nthe Schedule, the day on which the enactment adding the offence to the\nSchedule comes into effect.\n\nCommencement\n\n25.\n\nThis Act comes into effect on a day to be fixed by Proclamation.\n\n\f23\n\nSCHEDULE\n\nOFFENCES IN RESPECT OF WHICH REMEDIATION AGREEMENTS\nMAY BE MADE\n\n(Sections 2, 22 and 24)\n\n1.\nfollowing:\n\nA  remediation  agreement  may  be  entered  into  in  respect  of  the\n\n(a)\n\nan  offence  under  Part  II  of  the  Prevention  of  Corruption  Act,  2020\n(Act 2020-);\n\n(b)\n\nan offence under section 3, 15 or 18 of the Theft Act, Cap. 155;\n\n(c)\n\nany ancillary offence relating to an offence specified in this paragraph.\n\n2.\nan offence specified in paragraph 1 means\n\nFor the purpose of paragraph 1(c), “ancillary offence” in relation to\n\n(a)\n\naiding,  abetting,  counselling  or  procuring  the  commission  of  the\noffence; or\n\n(b)\n\nattempting or conspiring to commit the offence.\n\n\f24\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n\fREMEDIATION AGREEMENTS (DEFERRED PROSECUTIONS) BILL, 2020\n\nEXPLANATORY MEMORANDUM\n\nThe Bill would provide for a prosecutor to enter into an agreement to defer\nprosecution of an alleged offender and impose certain obligations on the offender,\nwhere such an agreement would be in the interest of justice.\n\nClause 1:\n\nprovides the short title.\n\nClause 2:\n\nprovides definitions for certain terms used in the Bill.\n\nClause 3:\n\nstates the objectives of the Bill.\n\nClause 4:\n\nClause 5:\n\nClause 6:\n\nClause 7:\n\nexplains  what  a  remediation  agreement  is  and  provides\nguidance to a prosecutor as to when it would be appropriate\nto enter into such an agreement.\n\nprecludes prosecution of an alleged offender for an alleged\noffence where it has entered into a remediation agreement.\n\nspecifies  that  individuals  are  not  eligible  to  enter  into\nremediation agreements.\n\noutlines the contents of the notice that a prosecutor must give\nan  alleged  offender  where  he  wishes  to  enter  into  a\nremediation agreement.\n\nClause 8:\n\noutlines the contents of the remediation agreement itself.\n\nClause 9:\n\nprovides that a code may be issued to give guidance, among\nother things, on general principles to be applied in determining\nwhether a remediation agreement would be appropriate.\n\nClause 10:\n\nrequires that a preliminary court hearing be held to determine\nwhether entering into a remediation agreement is likely to be\n\ni\n\n\fRemediation Agreements (Deferred\nProsecutions) Bill, 2020\n\nin  the  interest  of  justice  and  whether  the  terms  of  the\nagreement are fair, reasonable and proportionate to the gravity\nof the offence.\n\nClause 11:\n\nClause 12:\n\nprovides  for  a  final  hearing  for  the  court  to  approve  the\nremediation agreement.\n\nspeaks  to  breach  of  a  remediation  agreement  and  the\nprocedure to be followed in such a case.\n\nClause 13:\n\nprovides for variation of a remediation agreement.\n\nClause 14:\n\nClause 15:\n\nClause 16:\n\nClause 17:\n\nClause 18:\n\nClause 19:\n\nprohibits  the  institution  of  criminal  proceedings  against  an\nalleged offender upon expiry of the remediation agreement,\nprovided  there  was  no  breach  resulting  in  premature\ntermination.\n\nprovides that the court may order the prosecutor to postpone\npublication of any information that he is required to publish\nin relation to the agreement.\n\nspeaks to the use that may be made of any statements of facts\nmade by an alleged offender in relation to an alleged offence\nduring negotiations for the remediation agreement or in the\nagreement itself.\n\nprovides  for  the  suspension  of  limitation  periods  where  a\nremediation agreement is in effect.\n\nrequires  money  received  by  a  prosecutor  pursuant  to  a\nremediation agreement to be paid into the Consolidated Fund.\n\nprovides for the responsible Minister to report to Parliament\nannually on the remediation agreements made during the year.\n\nii\n\n\fRemediation Agreements (Deferred\nProsecutions) Bill, 2020\n\nClause 20:\n\nClause 21:\n\nstates that the legislation applies to certain conduct occurring\nbefore its commencement.\n\nprovides for the Minister to amend the Schedule of alleged\noffences to which the legislation applies.\n\nClause 22:\n\nempowers the Minister to make regulations.\n\nClause 23:\n\nmakes transitional provision.\n\nClause 24:\n\nprovides for the commencement of the legislation.\n\niii\n\n"
}