{
  "bill_id": 486,
  "slug": "emergency-managment-amendment-bill-2020",
  "title": "Emergency Managment (Amendment)  Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/d9099a83cfa18d0598d3372b4c3e8009.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-03-27",
  "first_reading": "2020-03-27",
  "gazette_date": null,
  "markdown": "2020/03/27\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Emergency Management Act, Cap. 160A to make\n\nprovision for the declaration and management of a public health emergency.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\nShort title\n\nAmendment of section 2 of Cap. 160A\n\nInsertion of section 28A into Cap. 160A\n\nAmendment of section 33 of Cap. 160A\n\nAmendment of section 35 of Cap. 160A\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  amend  the  Emergency  Management  Act,  Cap.  160A  to  make\nprovision for the declaration and management of a public health emergency.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment)Act, 2020.\n\nThis  Act  may  be  cited  as\n\nthe  Emergency  Management\n\nAmendment of section 2 of Cap. 160A\n\n2.\nreferred to as the principal Act is amended by\n\nSection 2 of the Emergency Management Act, Cap. 160A, in this Act\n\n(a)\n\ndeleting  the  definition  of  “emergency”  and  substituting  the\nfollowing:\n\n“ “emergency” means\n\n(a)\n\n(b)\n\n(c)\n\na public emergency declared under section 28(1) on account\nof the threat or occurrence of a disaster;\n\na  serious  occurrence  that  takes  place  unexpectedly  and\ndemands an urgent response or attention; or\n\na  public  health  emergency  declared  under  section\n28A(1);”; and\n\n(b)\n\ninserting in the appropriate alphabetical order the following:\n\n“ “communicable disease” has the meaning assigned to it by the Heath\nServices  (Communicable  and  Notifiable  Diseases)  Regulations,\n1969 (S.I. 1969 No. 179);\n\n“notifiable  disease”  has  the  meaning  assigned  to  it  by  the  Heath\nServices  (Communicable  and  Notifiable  Diseases)  Regulations,\n1969 (S.I. 1969 No. 179);\n\n“public health emergency” means an emergency declared under section\n28A(1) as a result of a person or an animal having a communicable\ndisease or a notifiable disease;”.\n\n\f5\n\nInsertion of section 28A into Cap. 160A\n\n3.\n28 the following:\n\nThe principal Act is amended by inserting immediately after section\n\n“Public Health Emergency\n\n28A.(1)\nWhere the Governor-General is satisfied that an emergency\nhas arisen as a result of a person or an animal having a communicable\ndisease  or  a  notifiable  disease,  the  Governor-General  may  by\nproclamation,  on  the  advice  of  the  Prime  Minister  after  the  Prime\nMinister  has  consulted  or  has  been  advised  by  the  Chief  Medical\nOfficer, declare that a public health emergency exists.\n\nA  proclamation  issued  under  subsection  (1)  shall,  unless\n(2)\npreviously revoked, remain in force for one month or for such longer\nperiod,  not  exceeding  6  months,  as  the  House  of  Assembly  may\ndetermine by a resolution supported by the votes of a majority of all the\nmembers of that House but may be extended from time to time for a\nfurther  period  not  exceeding  6  months  by  resolution  passed  in  like\nmanner and may be revoked at any time by resolution supported by the\nvotes of a majority of all members of the House of Assembly.\n\nThe  Governor-General  shall,  immediately  after  making  a\n(3)\nproclamation of a public health emergency referred to in subsection (1),\ncommunicate the fact to both Houses and if Parliament is prorogued or\neither  House  is  adjourned  to  a  day  more  than  5  days  thereafter,  the\nGovernor-General  shall  summon  both  Houses  or  the  House  so\nadjourned,  as  the  case  may  be,  within  5  days  and  the  Houses  so\nsummoned shall accordingly meet and sit upon the day appointed by\nthe Governor-General acting in accordance with the advice of the Prime\nMinister and shall continue to sit and act in like manner as if they had\nstood prorogued or adjourned to that day.\n\n\f6\n\n(4)\nWhen a proclamation of a public health emergency referred to in\nsubsection (1) is in force, it shall be lawful for the Cabinet to make any\nOrders whatsoever it considers desirable in the public interest.\n\nOrders  made  under  this  section  may  make  provision  for  such\n\n(5)\nmatters that are provided for under\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nsection 3 of the Emergency Powers Act, Cap. 161;\n\nsection 6 and 7 of the Quarantine Act, Cap. 53;\n\nsection 3 of the Miscellaneous Controls Act , Cap. 329; and\n\nregulation  11,  12,  13,  14,  15  of  the  Heath  Services\n(Communicable  and  Notifiable  Diseases)  Regulations,\n1969 (S.I. 1969 No. 179).\n\nIn an Order made pursuant to subsections (4) and (5) the Cabinet\n(6)\nmay delegate to the Prime Minister the power to make such directives\nas may be required in the public interest.\n\nNotwithstanding  anything  contained  in  this  Act  or  any  other\n(7)\nenactment,  the  Chief  Medical  Officer  shall  be  charged  with  the\nresponsibility  for  emergency  management  during  a  public  health\nemergency.”.\n\nAmendment of section 33 of Cap. 160A\n\n4.\n(5).\n\nSection 33 of the principal Act is amended by deleting subsection\n\nAmendment of section 35 of Cap. 160A\n\n5.\nSection  35  of  the  principal  Act  is  amended  by  deleting  the  word\n“regulations”  wherever  it  appears  and  substituting  the  words  “statutory\ninstruments”.\n\n"
}