{
  "bill_id": 487,
  "slug": "queen-elizabeth-hospital-amendment-bill-2020",
  "title": "Queen Elizabeth Hospital (Amendment) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/54d12c084864149392fbb80c9ef565a1.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-03-27",
  "first_reading": "2020-03-27",
  "gazette_date": null,
  "markdown": "2020/03/24\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Queen Elizabeth Hospital Act, Cap. 54 to make for\nprovision for the designation of appropriate lands or building to be considered to\nbe a part of the Queen Elizabeth Hospital.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nSection 2 of Cap. 54\n\nInsertion of section 2A into Cap. 54\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Queen Elizabeth Hospital Act, Cap. 54 to make for\nprovision for the designation of appropriate lands or building to be considered\nto be a part of the Queen Elizabeth Hospital.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nAct, 2020.\n\nThis Act may be cited as the Queen Elizabeth Hospital (Amendment)\n\nSection 2 of Cap. 54\n\n2.\nreferred to as the principal Act is amended by\n\nSection 2 of the Queen Elizabeth Hospital Act, Cap. 54, in this Act\n\n(a)\n\n(b)\n\ndeleting the full stop after the definition of the word “Minister” and\nsubstituting a semi-colon; and\n\ninserting immediately after the definition of the word “Minister” the\nfollowing:\n\n“ “Queen Elizabeth Hospital” means\n\n(a)\n\n(b)\n\nthe  premises  situate  at  Martindale’s  Road  in  the  parish  of\nSaint Michael; and\n\nany  lands  or  building  designated  as  a  part  of  the  Hospital\npursuant to section 2A.”.\n\nInsertion of section 2A into Cap. 54\n\n3.\n2 the following:\n\nThe principal Act is amended by inserting immediately after section\n\n“Designation\n\n2A.\nThe Minister may by order designate as a part of the Hospital\nany lands or buildings that he may think fit to be used as such and any\nlands or buildings so designated shall be subject to this Act.”.\n\n"
}