{
  "bill_id": 488,
  "slug": "planning-and-development-amendment-act-2020",
  "title": "Planning and Development (Amendment) Act, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3d71ddfae8d0355b3faf75086001a0d6.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-06-03",
  "first_reading": "2020-06-10",
  "gazette_date": "2020-04-27",
  "markdown": "2020-03-24\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Planning  and  Development  Act,  2019\n\n(Act 2019-5).\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 2 of Act 2019–5\n\nAmendment of Act 2019–5\n\nAmendment of section 6 of Act 2019-5\n\nAmendment of section 7 of Act 2019-5\n\nAmendment of section 8 of Act 2019-5\n\nAmendment of section 10 of Act 2019-5\n\nAmendment of section 14 of Act 2019-5\n\nAmendment of section 30 of Act 2019-5\n\n10.\n\nAmendment of section 34 of Act 2019-5\n\n11.\n\nRepeal and replacement of section 44 of Act 2019–5\n\n12.\n\nInsertion of new sections 44A to 44I into Act 2019-5\n\n13.\n\nAmendment of section 87 of Act 2019-5\n\n14.\n\nAmendment of section 93 of Act 2019-5\n\n15.\n\nAmendment of section 94 of Act 2019-5\n\n\f3\n\n16.\n\nAmendment of section 95 of Act 2019-5\n\n17.\n\nAmendment of section 98 of Act 2019-5\n\n18.\n\nAmendment of section 104 of Act 2019-5\n\n19.\n\nAmendment to section 105 of Act 2019-5\n\n20.\n\nAmendment to section 106 of Act 2019-5\n\n21.\n\nAmendment of section 107 of Act 2019-5\n\n22.\n\nAmendment of section 108 of Act 2019-5\n\n23.\n\nInsertion of new Schedules into the Act 2019-5\n\nSCHEDULE\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Planning and Development Act, 2019 (Act 2019-5)\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\nAct, 2020.\n\nThis Act may be cited as the Planning and Development (Amendment)\n\n\f6\n\nAmendment of section 2 of Act 2019–5\n\n2.\n(Act 2019-5), in this Act referred to as “the principal Act”, is amended\n\nthe  Planning  and  Development  Act,  2019\n\nSection  2  of\n\n(a)\n\nby  deleting  the  definitions  of  “building  operations,  Chief  Town\nPlanner,  registered  professional  architect,  registered  professional\nengineer”;\n\n(b)\n\nby inserting the following definitions in the appropriate alphabetical\norder\n\n“ “Building Code” means the Code of engineering, design and public\nhealth  standards  applicable  to  the  construction  of  buildings\nprovided for by the building regulations;\n\n“building  operations”  includes  demolition  operations,  rebuilding\noperations, structural alterations of or additions to buildings and\nother  operations  normally  undertaken  by  a  person  carrying  on\nbusiness as a builder;\n\n“building  permit”  means  a  permit  for  the  purpose  of  carrying  out\n\nbuilding works granted under section 44A;\n\n“building regulations” means regulations made under section 44H;\n\n“Director” means the Director of Planning and Development referred\n\nto in section 8;\n\n“occupancy certificate” means a certificate granted under section 44E\nin relation to the occupation of a building after the completion of\nbuilding works;\n\n“professional governing body” means the body established by an Act\nlisted  in  the  First  Schedule  for  the  purpose  of  regulating  the\npractice of the profession governed by that legislation;\n\n\f7\n\n“registered  professional”  includes  a  professional  architect,  engineer,\nland surveyor or planner registered by the professional governing\nbody for that profession;”.\n\nAmendment of Act 2019–5\n\n3.\nPlanner” wherever they appear and substituting the word “Director”.\n\nThe principal Act is amended by deleting the words “Chief Town\n\nAmendment of section 6 of Act 2019-5\n\n4.\n\nSection 6 of the Act is amended\n\n(a)\n\nby  deleting  subsection  (10)  and  substituting  the  following  new\nsubsection:\n\n“(10)\n\nThe Board shall appoint\n\n(a)\n\n(b)\n\n(c)\n\na “Design and Engineering Committee”;\n\nan “Environmental Impact Assessment Committee”; and\n\nsuch other ad hoc committees or working groups as it thinks\nfit to assist in the performance of its functions.”; and\n\n(b)\n\nby  inserting  immediately  after  subsection  (10)  the  following  new\nsubsection:\n\n“(10A\nThe  constitution,  functions  and  procedures  of  the  Design  and\n)\nImpact\nEngineering  Committee  and\nAssessment Committee are set out in the Second Schedule and Third\nSchedule respectively.”.\n\nthe  Environmental\n\n\f8\n\nAmendment of section 7 of Act 2019-5\n\nSection  7  of  the  principal  Act  is  amended  in  subsection  (2)  by\n5.\ndeleting  the  words  “First  Schedule”  and  substituting  the  words  “Fourth\nSchedule”.\n\nAmendment of section 8 of Act 2019-5\n\n6.\n\nSection 8 of the principal Act is amended\n\n(a)\n\nby deleting subsection (1) and substituting the following:\n\nThere shall be a department of Government to be known as the\n\n“(1)\nPlanning and Development Department\n\n(a)\n\n(b)\n\nheaded  by  a  Director  of  Planning  and  Development,  who\nshall be a public officer; and\n\nsuch  number  of  planning  officers,  building  officers,\nenforcement officers and other staff as may be appointed to\nassist  the  Minister  and  Board  in  the  administration  and\nenforcement of this Act.”;\n\n(b)\n\nin subsection (2), by\n\n(i)\n\n(ii)\n\n(iii)\n\ndeleting the words “The Chief Town Planner, planning officers\nand  staff”  appearing  at  the  beginning  of  the  subsection  and\nsubstituting the words “The Director and staff”;\n\nrenumbering paragraphs (e), (f) and (g) as paragraph (f), (g)\nand (h) respectively;\n\ninserting  the  following  new  paragraph  immediately  after\nparagraph (d):\n\n\f9\n\n“(e)\n\nmake  recommendations  to  the  Board  with  respect  to  the\nissuance  of  building  permits  and  occupancy  certificates\npursuant to Part V;”; and\n\n(iv)\n\ndeleting paragraph (f) and substituting the following:\n\n“(f)\n\ncarry  out  inspections  for  the  purpose  of  detecting  and\ninitiating  enforcement  action  with  respect  to  breaches  of\nplanning and building control;”.\n\nAmendment of section 10 of Act 2019-5\n\n7.\nand substituting the following:\n\nSection 10 of the principal Act is amended by deleting subsection (3)\n\nSubject to the prior approval of the Board, any functions assigned\n“(3)\nto the Director by or under this Act, may be performed either generally\nor specifically by any planning officer, building officer or enforcement\nofficer so authorised in writing by the Director.”.\n\nAmendment of section 14 of Act 2019-5\n\n8.\ndeleting paragraph (c) and substituting the following:\n\nSection  14  of  the  principal  Act  is  amended  in  subsection  (2)  by\n\n“(c)\n\nprescribe  for  any  of  the  matters  set  out  in  the  Fifth\nSchedule.”.\n\nAmendment of section 30 of Act 2019-5\n\n9.\nand substituting the following:\n\nSection 30 of the principal Act is amended by deleting subsection (2)\n\n\f10\n\n“(2)\nUnless the Minister directs otherwise, the Director shall require\nan environmental impact assessment in respect of an application for a\ndevelopment of any kind mentioned in the Sixth Schedule.”.\n\nAmendment of section 34 of Act 2019-5\n\n10.\ndeleting paragraph (b) and substituting the following:\n\nSection  34  of  the  principal  Act  is  amended  in  subsection  (1)  by\n\n“(b)\n\nin  the  case  of  an  application  classified  in  the  Fourth\nSchedule as a complex application, other than an application\nfor  which  an  environmental  impact  assessment  has  been\nsubmitted,  within  a  period  of  10  weeks,  from  the  date  of\nsubmission of the application;”.\n\nRepeal and replacement of section 44 of Act 2019–5\n\n11.\nsubstituted:\n\nSection  44  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Building permit\n\n44.(1)\n\nA person shall not carry out any building operations unless\n\n(a)\n\n(b)\n\na building permit in respect of the building works is in force;\nand\n\nthe building works are being carried out in accordance with\nthe building permit.\n\nWhere planning permission has been granted for the carrying out\n(2)\nof building operations, the applicant shall submit to the Board detailed\nbuilding plans, together with\n\n(a)\n\nthe form specified by the Board;\n\n\f11\n\n(b)\n\nany  documents,  designs,  calculations  and  like  materials\nrelated thereto; and\n\n(c)\n\nproof of payment of the prescribed building permit fee.\n\n(3)\nDetailed building plans submitted pursuant to subsection (1) shall\nbe drawn to the scale specified by the Board and shall include, but not\nbe limited to\n\n(a)\n\n(b)\n\n(c)\n\nfloor plans;\n\nelevations and sections;\n\nfoundation details;\n\n(d)\n\nstructural details, including roof design details;\n\n(e)\n\nelectrical layout;\n\n(f)\n\nmechanical, air-conditioning and ventilation layout; and\n\n(g)\n\nplumbing layout.\n\nExcept  for  simple  building  applications,  all  building  plans\n\n(4)\nsubmitted to the Board shall be\n\n(a)\n\n(b)\n\nprepared  and  submitted  by  a  competent\nprofessional;\n\nregistered\n\nstamped  with  the  name  and  address  of  the  registered\nprofessional; and\n\n(c)\n\nsigned by that registered professional.\n\nAll documents, designs, calculations and like material submitted\n(5)\npursuant to subsection (2) for a building permit shall be stamped with\nthe  name  and  address  of  the  competent  registered  professional\nresponsible  for  preparing  the  material  and  signed  by  that  registered\nprofessional.\n\n\f12\n\n(6)\nThe  building  plans  and  specifications  submitted  to  the  Board\nshall be accompanied by a design certificate in the form set out in the\nSeventh Schedule.\n\nIn  this  section,  “simple  building  application”  means  an\n\n(7)\napplication to construct\n\n(a)\n\n(b)\n\n(c)\n\na dwelling house or duplex dwelling of not more than two\nstoreys, the gross floor area of which does not exceed 232.5\nsquare metres;\n\na building of not more than two storeys in height containing\nmore than two dwelling units, the gross floor area of which\ndoes not exceed 465 square metres; or\n\na commercial building of not more than two storeys in height,\nthe  gross  floor  area  of  which  does  not  exceed  465  square\nmetres.\n\nIn accordance with the provisions of the Engineers (Registration)\n(8)\nAct, Cap. 368B, a certificate signed by a competent registered engineer\nis  required  with  respect  to  the  structural,  mechanical  and  electrical\naspects of any building\n\n(a)\n\n(b)\n\n(c)\n\nconsisting of or designed for more than two storeys;\n\nconstructed  or  used  for  the  purposes  of  carrying  on  a\nbusiness; or\n\nbeing  a  place  to  which  the  public  have  or  may  have\naccess.”.\n\nInsertion of new sections 44A to 44I into Act 2019-5\n\n12.\nimmediately after section 44:\n\nThe principal Act is amended by inserting the following new sections\n\n\f13\n\n“Issuance of building permits\n\n44A.(1)\nOn the submission of building plans and all the documents,\ndesigns,  calculations  and  like  material  required  in  support  of  a\nsubmission  for  a  building  permit,  the  Board  shall  issue  a  building\npermit, except where\n\n(a)\n\n(b)\n\nthe building plans are not in accordance with the terms and\nconditions subject to which planning permission was granted\nfor the building operations under Part IV;\n\nthe  building  operations  constitute  permitted\nwhen\ndevelopment under a Development Order, the building plans\nare not in accordance with the conditions subject to which\nsuch development is permitted by the Order;\n\n(c)\n\nthe building plans contravene the Building Code or building\nregulations or any other written law; or\n\n(d)\n\nany fees due are unpaid.\n\nWhere  the  building  plans,  specifications  and  other  documents\n(2)\nsubmitted  are  signed  and  stamped  by  a  competent  registered\nprofessional pursuant to section 44(4) and (5), the Board shall issue, no\nlater than 7 calendar days after the date of submission, a building permit\nshowing  that  it  is  issued  in  reliance  on  the  design  certificate  of  the\nregistered professional, without prejudice to its right to cause any such\nbuilding  plans,  specifications  and  other  documents  to  be  reviewed\nthereafter and to revoke the building permit pursuant to section 44F(1)\n(a).\n\nWhere  the  building  plans,  specifications  and  other  documents\n(3)\nsubmitted  to  the  Board  are  not  signed  and  stamped  by  a  registered\nprofessional, the Director shall cause the building plans, specifications\nand  other  documents  submitted  to  be  reviewed,  and  the  Board  shall\n\n\f14\n\nissue or refuse to issue a building permit within 28 working days after\nreceiving the submission.\n\nWhere the Board refuses to issue a building permit, the notice of\n\n(4)\nrefusal shall give reasons for the refusal.\n\nThe  Crown  is  exempt  from  any  liability  in  negligence  arising\n(5)\nfrom  the  grant  of  planning  permission  for  building  operations  and\nissuance of a building permit, whether or not the plans submitted in\napplication for planning permission or a building permit were prepared\nby a competent registered professional or any other person.\n\nBuilding Inspections\n\nThe holder of a building permit shall give to the Director\n44B.(1)\nnotice in writing of the date on which building works will commence,\nat least 14 days prior to the commencement of building operations.\n\nDuring the carrying out of such works, the following building\n\n(2)\ninspections shall be conducted\n\n(a)\n\n(b)\n\n(c)\n\nsetting out;\n\nfootings and slabs before concreting;\n\nstructural frame and roof;\n\n(d)\n\nring beams, casting and reinforcement;\n\n(e)\n\nplumbing and drains;\n\n(f)\n\n(g)\n\n(h)\n\nelectrical work (in association with the electrical inspector);\n\nall mechanical installations;\n\nsuch other inspections as the Board may reasonably require;\nand\n\n(i)\n\nfinal inspection for an occupancy certificate.\n\n\f15\n\n(3)\nBuilding works at an inspection stage shall not be covered up\nprior to being inspected and further building works shall not proceed\nunless the works completed up to that stage have been inspected and\napproved.\n\nSubject to subsection (5), all such inspections shall be conducted\n(4)\nby  an  independent  consultant  engaged  by  the  holder  of  the  building\npermit to conduct such inspections.\n\nNotwithstanding  subsection  (4),  where  a  building  permit  is\n(5)\nissued in relation to a simple building application, the required building\ninspections  maybe  carried  out  by  a  building  officer  from  the\nDepartment,  at  the  request  of  the  holder  of  the  building  permit,  on\npayment of the prescribed fee for such inspections.\n\nWhere inspections are to be carried out by a building officer, the\n(6)\nbuilder may cover up uninspected building works where an inspection\nis not carried out by a building officer within a period of 4 complete\nworking days after notice in writing has been given to the Director that\nthe uncovered building work will be ready for inspection in 3 working\ndays.\n\nWhere the holder of a building permit appoints an independent\n(7)\nconsultant  to  conduct  the  required  inspections,  notice  of  such\nappointment shall be included in the notice of intention to commence\nworks given to the Director pursuant to subsection (1).\n\nWhere  building  inspections  are  conducted  by  an  independent\n(8)\nconsultant, the cost of the services of independent consultant engaged\nby the holder of the building permit shall be borne by the holder of the\nbuilding  permit,  and  the  holder  of  the  building  permit  shall  submit\nreports  on  the  building  inspections  to  the  Board  in  a  format  to  be\ndetermined by the Director.\n\nWhere, at any stage in the course of a building inspection, the\n(9)\nindependent  consultant  or  building  officer  identifies  defects  in  the\n\n\f16\n\nworks being inspected, the defects shall be pointed out immediately to\nthe person charged with carrying out the building works and notice in\nwriting of the defects shall be given to holder of the building permit\nwithin 24 hours thereafter.\n\nWhere, in the opinion of the Director, based on the inspection\n(10)\nreports, the building works do not comply with the Building Code or\nthe  approved  plans  and  specifications,  the  Board  may  by  notice  in\nwriting direct the person charged with carrying out the building works\nto  take  such  steps  as  are  necessary  to  bring  the  building  works  into\ncompliance, within the time specified in the notice.\n\nWhere the person charged with carrying out the building works\n(11)\nrefuses or fails to take such steps as are necessary to bring the building\nworks into compliance within the time specified in the notice, the Board\nmay revoke the building permit pursuant to section 44F(1).\n\nIn  this  section  “independent  consultant”  means  a  registered\n(12)\nprofessional  other  than  the  registered  professional  who  certified  the\nplans  and  specifications  submitted  to  the  Board  and  who  is  not  an\nemployee of the holder of the building permit.\n\nVariations in building works\n\nWhere any material alteration or modification to the design\n44C.(1)\nof a building occurs in course of carrying out building works, revised\nplans  showing  the  variations  from  the  original  plans,  including  the\naddition, omission or substitution of any works, shall be submitted to\nthe Board as soon as may be practicable after the variation has occurred.\n\nThe  Board  may  amend  the  building  permit  to  authorise  any\n(2)\nvariations to the original plans and the retention of the building as built\nbefore the date of submission of the revised plans.\n\nWhere variations have occurred, no occupancy certificate shall\n(3)\nbe issued for the building pursuant to section 44E until after the revised\nplans have been submitted and the building permit has been amended.\n\n\f17\n\n(4)\nWhere revised plans are duly submitted to the Board, the Director\nshall issue the amended building permit within 28 calendar days from\nthe date of submission of the revised plans.\n\n(5)\nThe provisions of this section do not apply to the retention of\nbuilding works carried out without the grant of planning permission,\nfor which an application to regularise unauthorised development shall\nbe made pursuant to section 31.\n\nClarification of technical requirements\n\nWhere  any  question  arises  as  to  whether  technical\n44D.(1)\nrequirements of the Building Code or any regulations are satisfied, a\nregistered professional shall consult with the Board and the views of\nthe Director shall be considered in all circumstances.\n\nWhere there is a dispute, between the Director and a registered\n(2)\nprofessional, with respect to the technical requirements of the Building\nCode or any regulations, or as to whether there has been substantial\ncompliance with such requirements, any party to dispute may apply to\nthe Tribunal for a determination of the matter.\n\nThe  Tribunal  may  determine  any  dispute  brought  under\n(3)\nsubsection  (2)  on  the  basis  of  written  submissions  alone,  but  shall\nprovide an opportunity for the parties to make oral representations on\na request in writing by either party.\n\nThe Tribunal may appoint an independent expert to advise it on\n(4)\nanalysing the submissions made by the parties to any dispute, orally or\nin writing, and in determining the question.\n\nOccupancy Certificates\n\n44E.(1)\n\nNo person shall\n\n(a)\n\noccupy\n\n(i)\n\na new or renovated building; or\n\n\f18\n\n(ii)\n\na new extension to a building; or\n\n(b)\n\npermit any such new, renovated or extended building, to be\noccupied\n\nuntil  an  occupancy  certificate  has  been  issued  with  respect  to  the\nbuilding.\n\nThe  Board  shall  within  7  days\n\nissue  an  occupancy\n(2)\ncertificate  upon  the  completion  of  any  building  works  in  substantial\ncompliance with the terms of a building permit, and upon payment of\nthe prescribed fee.\n\nAn application for an occupancy certificate shall be made to the\n(3)\nBoard in such form as is specified by the Board, accompanied by proof\nof payment of the prescribed fee, and shall be submitted to the Director\nby the owner of the building or by an agent for the owner, after the\ncompletion of the building works.\n\nThe  Board  shall  not  grant  an  occupancy  certificate  unless  the\n(4)\napplication is accompanied by a final inspection certificate duly signed\nby  an  independent  consultant  or  a  building  officer  stating  that  the\nbuilding work to which it relates has been carried out in accordance\nwith the building permit, this Act and the building regulations, and is\nfit for occupation.\n\nAn owner of a building or an agent for the owner may apply for\n(5)\na temporary certificate of occupancy for part of a building which may\nbe safely occupied prior to completion of the rest of the building.\n\nA temporary certificate of occupancy shall be granted subject to\n(6)\nsuch terms and conditions as the Director sees fit and remain valid for\nsuch period from the date of issue as is specified therein.\n\nIn  subsection  (2),  “substantial  compliance”  means  a  level  of\n(7)\ncompliance in which any deficiencies in the building works pose no\nthreat  to  the  safety,  health  and  welfare  of  persons  within  or  in  the\n\n\f19\n\nvicinity of the building greater than the potential for causing minimal\nharm.\n\nEnforcement of building control\n\n44F.(1)\nwhere\n\n(a)\n\nThe Board may by notice in writing revoke a building permit\n\nafter  a  building  permit  is  issued  in  reliance  of  the  design\ncertificate of a registered professional, the building plans are\nfound  to  contravene  the  Building  Code  or  building\nregulations;\n\n(b)\n\n(c)\n\nthe  permit  was  issued  based  upon  the  submission  of\nmaterially false or misleading information;\n\nthe building works authorized by the building permit have\nnot, in the opinion of the Director, substantially commenced\nbefore the lapse of the planning permission; or\n\n(d)\n\nthe  building  works  are  being  carried  out  in  breach  of  the\nbuilding permit.\n\nThe Board shall not revoke a building permit under subsection\n\n(2)\n(1) on the grounds of any such default unless the Board has\n\n(a)\n\n(b)\n\nby notice served on the holder of the permit, given not less\nthan 14 days notice of its intention to revoke the permit on\nthe grounds specified therein;\n\nin  the  notice  referred  to  in  paragraph  (a)  specified  a\nreasonable date before which the holder of the permit may\nsubmit any written representations to the Board; and\n\n(c)\n\ntaken into account\n\n(i)\n\nany action taken by the holder of the permit to remedy\nsuch default, if it can be remedied, and to prevent the\nreoccurrence of similar defaults; and\n\n\f20\n\n(ii)\n\nany representations submitted to the Board pursuant to\nparagraph (b).\n\n(3)\nWhere  any  building  or  other  structure  is  commenced  or\ncompleted without a building permit, or after a building permit has been\nrevoked, the Board may serve the owner of the premises or the builder,\nor both of them, with a notice in writing specifying the contravention\nand  requiring  the  person  served,  on  or  before  a  day  specified  in  the\nnotice,  to  show  cause  why  such  building  or  structure  should  not  be\nremoved, altered or demolished.\n\nWhere an owner or builder upon whom a notice has been served\n(4)\npursuant  to  subsection  (3)  fails  to  show  sufficient  cause  why  the\nbuilding  or  other  structure  should  not  be  removed,  altered  or\ndemolished,  the  Board  may  cause  such  building  or  structure  to  be\nremoved, altered or pulled down.\n\nNotice  in  writing  of  the  Board’s  decision  with  respect  to  the\n(5)\nremoval, alteration or demolition of the building or structure, shall be\ngiven to the owner of the premises at least 28 days before any such\naction is undertaken.\n\nAll  expenses  incurred  by  the  Board  in  removing,  altering  or\n(6)\npulling down a building or structure under this section shall be a civil\ndebt due to the Crown, recoverable in a court of competent jurisdiction,\nand a charge upon the premises.\n\nA person who is aggrieved by a notice served upon them under\n(7)\nsubsection (1) or subsection (5) may appeal to the Tribunal within 14\ndays of the date of service of a notice.\n\nNothing  in  this  section  shall  be  construed  to  prevent  any\n(8)\nenforcement proceedings for a breach of planning control being taken\nagainst any person under Part VIII of this Act, provided that no one\nshall be punished twice for the same offence.\n\n\f21\n\nEngineering Operations\n\n44G.\n\nThe provisions of this Part with respect to\n\n(a)\n\n(b)\n\nthe submission of detailed plans and supporting documents;\n\nissuance  of  building  permits  before  works  are\n\nthe\ncommenced;\n\n(c)\n\nthe inspection works at appropriate stages of construction;\n\n(d)\n\nthe certification of completion of works;\n\n(e)\n\nthe submission of revised plans showing any variations; and\n\n(f)\n\nthe enforcement of building control,\n\napply mutatis mutandis to the carrying out of engineering operations.\n\nBuilding Regulations\n\n44H.(1)\nCode\n\n(a)\n\nThe Minister may make regulations providing for a Building\n\nconsisting of engineering, design and public health standards\napplicable  to  the  construction  of  buildings  as  appear  to  be\ndesirable for the structural and fire safety of buildings; and\n\n(b)\n\nfor the safety, health and general welfare of persons within\nor in the vicinity of buildings.\n\nRegulations  made  under  this  section  may  adopt,  by  reference\n(2)\nwith  necessary  changes,  any  code,  standard,  or  practice  set  by  an\nappropriate institution, association or other body.\n\nExcept as provided for in subsection (4), the building regulations\n(3)\nshall govern any new construction of buildings and new additions to\nexisting buildings, but shall not be applied to existing buildings or parts\nof buildings at the time of renovations or alterations to such buildings,\nexcept where any such renovation or alteration results in an existing\n\n\f22\n\nbuilding being further out of compliance with the building standards\nthan was the case before the renovation or alteration was undertaken.\n\n(4)\n\nThe Minister may make regulations\n\n(a)\n\n(b)\n\nproviding  for  retrofitting  standards  designed  to  bring  any\nprescribed  class  or  classes  of  existing  buildings  up  to\nacceptable levels of sanitation and safety from fire or natural\nhazards;\n\nrequiring  renovations  or  alterations  to  be  made  to  the\nbuildings  referred  to  in  paragraph  (a)  in  order  to  achieve\ncompliance to be undertaken; and\n\n(c)\n\nprescribing periods within which buildings of any class are\nrequired to be retrofitted to conform with the standards.\n\nRegulations made under this section may provide for different\n\n(5)\nbuilding standards governing\n\n(a)\n\n(b)\n\nthe  construction  or  retrofitting  of  buildings  to  be  used  as\nhurricane shelters; or\n\nthe  carrying  out  of  building  works  in,  on,  over  or  under\ncultural heritage buildings, monuments and sites.\n\nRegulations  made  under  this  section  may  provide  for  the\n(6)\ncertification,  of  building  products,  construction  methods  or  design\ncomponents  or  systems  by\nthe  Barbados  National  Standards\nInstitution or any accredited independent person or institution.\n\nFor  the  purpose  of  this  section  “Barbados  National  Standards\n(7)\nInstitution”  means  the  institution  referred  to  in  the  Standards  Act,\nCap. 326A.\n\n\f23\n\nRegistered professionals\n\n44I.(1)\n\nA professional governing body shall\n\n(a)\n\n(b)\n\nestablish,  in  relation  to  the  profession  that  it  regulates,\nminimum levels of professional competence required for the\npreparation of such categories of building plans as may be\nappropriate,  so  as  to  assure  that  detailed  building  plans\nsubmitted to the Board meet the standards prescribed in the\nbuilding regulations;\n\nissue a certificate of competence stating whether the person\nto whom it is issued is competent to certify that building plans\nsubmitted  with  respect  to  any  development  satisfy  the\nstandards prescribed in the building regulations.\n\nThe Board shall accept a design certificate as conclusive of the\n(2)\nfacts  to  which  it  relates,  provided  that  the  registered  professional\ncertifying  the  design  certificate  is  the  holder  of  a  certificate  of\ncompetence  issued  by  the  professional  governing  body  pursuant  to\nsubsection (1)(b).\n\nThe Board shall maintain a comprehensive register of all certified\n(3)\nregistered  professionals,  showing\nthe  nature  and  category  of\napplications  for  which  each  person  was  granted  a  certificate  of\ncompetence  as  well  as  the  limitations  or  restrictions  to  which  such\ncertificate is subject, including the period for which the certificate is\nvalid.\n\nThe Board shall, after consulting with any relevant professional\n(4)\ngoverning  body,  by  Order  prescribe  the  minimum  amount  of\nprofessional  liability  insurance  coverage  required  to  be  provided  in\nrespect  of  professional  certification  of  building  plans  by  registered\nprofessionals  for  all  the  categories  of  applications,  except  simple\nbuilding applications.\n\n\f24\n\n(5)\nA registered professional shall file and maintain with the Board\nproof of financial responsibility as evidenced by professional liability\ninsurance coverage in an amount sufficient to satisfy their obligations\nunder this Act.\n\nWhere the Board finds that any building plans or specifications\n(6)\nare not in accordance with the requirements of the building regulations\nand the Building Code as certified, or have not been prepared by the\nregistered  professional  who  signed  the  design  certificate,  the  Board\nshall\n\n(a)\n\n(b)\n\n(c)\n\nreport  the  registered  professional  who  signed  the  design\ncertificate  to  the  relevant  professional  governing  body  for\nprofessional misconduct;\n\nsuspend  the  acceptance  of  building  plans  bearing  a  design\ncertificate signed by the registered professional referred to in\nparagraph  (a)  until  notified  by  the  relevant  professional\ngoverning body of its decision with respect to the misconduct\nof the registered professional; and\n\nwhere  the  registered  professional  is  found  guilty  of\nprofessional misconduct, take such action as is necessary on\nits part to implement any sanctions imposed on the registered\nprofessional by the relevant governing body.”.\n\nAmendment of section 87 of Act 2019-5\n\n13.\n\nSection 87 of the principal Act is amended in subsection (2) by\n\n(a)\n\n(b)\n\n(c)\n\ndeleting the word “and” appearing at the end of paragraph (c);\n\nrenumbering paragraph (d) as paragraph (e); and\n\ninserting immediately after paragraph (c) the following paragraph\nas paragraph (d):\n\n\f25\n\n“(d)\n\nany decision with respect to the issue or to the withholding\nof a building permit or an occupancy certificate; and”.\n\nAmendment of section 93 of Act 2019-5\n\n14.\ndeleting the word “14” and substituting the word “28”.\n\nSection  93  of  the  principal  Act  is  amended  in  subsection  (2)  by\n\nAmendment of section 94 of Act 2019-5\n\n15.\n\nSection 94 of the principal Act is amended\n\n(a)\n\n(b)\n\n(c)\n\nin  the  shoulder  note  by  deleting  the  words  “High  Court”  and\nsubstituting the words “Court of Appeal”;\n\nin subsection (2), by deleting the words “Judge in chambers” and\nsubstituting the words “Court of Appeal”; and\n\nin  subsection  (3),  by  deleting  the  words  “High  Court”  and\nsubstituting the words “Registration Office”.\n\nAmendment of section 95 of Act 2019-5\n\n16.\n\nSection 95 of the principal Act is amended in subsection (1) by\n\n(a)\n\n(b)\n\nrenumbering paragraphs (d) and (e) as paragraphs (e) and (f); and\n\ninserting the following paragraph immediately after paragraph (c)\nas paragraph (d):\n\n“(d)\n\nto carry out any building inspection in accordance with the\nprovisions of section 44B;”.\n\nAmendment of section 98 of Act 2019-5\n\n17.\n\nSection 98 of the principal Act is amended in subsection (1) by\n\n(a)\n\nrenumbering paragraphs (e) and (h) as (g) to (j); and\n\n\f26\n\n(b)\n\ninserting the following paragraphs immediately after paragraph (d):\n\n“(e)\n\nevery building permit issued under section 44A;\n\n(f)\n\nevery occupancy certificate issued under section 44E;”.\n\nAmendment of section 104 of Act 2019-5\n\n18.\n\nSection 104 of the principal Act is amended\n\n(a)\n\nin subsection (1) by\n\n(i)\n\ndeleting paragraph (c) and substituting the following:\n\n“(c)\n\nthe  qualifications  required  of  persons  signing  forms,  plans\nand  drawings  on  behalf  of  any  applicant  for  planning\npermission or a building permit;”;\n\n(ii)\n\nrenumbering paragraphs (d) to (h) as paragraphs (e) to (i); and\n\n(iii)\n\ninserting  immediately  after  paragraph  (c)  the  following  as\nparagraph (d):\n\n“(d)\n\nthe procedures with respect to entering into agreements for\nplanning obligations under section 36;”; and\n\n(b)\n\nby  inserting  immediately  after  subsection  (1)  the  following  new\nsubsection:\n\nRegulations  made  under  this  Act  are  subject  to  negative\n\n“(1A)\nresolution.”.\n\nAmendment to section 105 of Act 2019-5\n\n19.\nsubstituting the following:\n\nThe  principal  Act  is  amended  by  deleting  section  105  and\n\n\f27\n\n“105.(1)\nexcept the Eighth Schedule.\n\nThe Minister may by order amend the Schedules to this Act\n\nThe  Order  referred  to  in  subsection  (1)  is  subject  to  negative\n\n(2)\nresolution.\n\nThe  enactments  specified  in  the  first  column  of  the  Eighth\n(3)\nSchedule  are  amended  in  the  respects  set  out  in  the  second  column\nthereto.”.\n\nAmendment to section 106 of Act 2019-5\n\n20.\nfollowing new subsection immediately after subsection (2)\n\nSection  106  of  the  principal  Act  is  amended  by  inserting  the\n\n“(3)\nAll  references  in  other enactments  to  the  Chief  Town  Planner\nshall be construed mutatis mutandis as references to the Board or the\nDirector as the context allows.”.\n\nAmendment of section 107 of Act 2019-5\n\n21.\n\nSection 107 of the principal Act is amended by\n\n(a)\n\n(b)\n\nrenumbering subsection (3) as subsection (5); and\n\ninserting the following new subsections immediately after subsection\n(2):\n\n“(3)\nThe Health Services (Building) Regulations, 1969 (S.I. 1969 No.\n233), are deemed to be made under this Act and continue in force until\nrepealed  and  replaced  by  building  regulations  made  under  section\n44H.\n\nThe Barbados National Building Code (2013 Edition) issued as\n(4)\nStandard  BNS  SPI:  Parts  1-18:2013,  and  declared  as  a  voluntary\n\n\f28\n\nstandard  by  the  Barbados  National  Standards  Institution  on  5th\nSeptember 2013, pursuant to the Standards Act, Cap. 326A, is deemed\nto be adopted under this Act and continued in force until repealed and\nreplaced by a Building Code made or adopted under section 44H.”.\n\nAmendment of section 108 of Act 2019-5\n\nSection  108  of  the  principal  Act  is  amended  at  subsection  (1)  by\n22.\ndeleting the words “is to” and substituting the words “may, at the option of the\napplicant,”.\n\nInsertion of new Schedules into the Act 2019-5\n\n23.\n\nThe principal Act is amended\n\n(a)\n\n(b)\n\nby renumbering the First, Second, Third and Fourth Schedules as\nthe Fourth, Fifth, Sixth and Eighth Schedules; and\n\nby inserting the First, Second, Third and Seventh Schedules as set\nout in the Schedule to this Act.\n\n\f29\n\nSCHEDULE\n\n“FIRST SCHEDULE\n\n(Section 24)\n\n(Section 2)\n\nLEGISLATION GOVERNING REGISTERED PROFESSIONALS\n\n1.\n\n2.\n\n3.\n\nThe Architects Registration Act, Cap. 366.\n\nThe Engineers (Registration) Act, Cap. 368B.\n\nThe Land Surveyors Act, Cap. 370.\n\n\f30\n\nSECOND SCHEDULE\n\nDESIGN AND ENGINEERING COMMITTEE\n\n(Section 6(10))\n\n1.\nnot be limited to, persons with expertise and experience in\n\nThe Design and Engineering Committee shall include, but\n\n(a)\n\n(b)\n\n(c)\n\nArchitectural design;\n\nUrban design;\n\nLandscape design;\n\n(d)\n\nPhysical planning;\n\n(e)\n\nHeritage conservation;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nAccessibility and disability issues;\n\nStructural engineering;\n\nCivil engineering;\n\nTransportation engineering;\n\nCoastal engineering;\n\n(k)\n\nMechanical and electrical engineering;\n\n(l)\n\nFire safety;\n\n(m)\n\nDisaster management; and\n\n(n)\n\nPublic health.\n\n2.\nthe Minister with respect to\n\nThe function of the Committee is to advise the Board and\n\n(a)\n\n(b)\n\nthe design of major or sensitive development;\n\ndesign standards;\n\n\f31\n\n(c)\n\naccess standards;\n\n(d)\n\nconstruction and structural standards;\n\n(e)\n\nthe consideration of building permit applications;\n\n(f)\n\n(g)\n\nthe adoption and regular review of the Building Code;\n\nthe registration of Certified Registered Professionals for the\npurposes of this Act.\n\n3.\nbut is eligible for re-appointment.\n\nA member of the Committee shall serve for a term of 3 years\n\n4.\nCommittee to act as Chairperson.\n\nThe  Board  shall  designate  one  of  the  members  of  the\n\n5.\nDevelopment Department to serve as Secretary to the Committee.\n\nThe Director shall assign an officer from the Planning and\n\nThe  Committee  may  appoint  from  amongst  its  members\n6.\nsuch working groups as are necessary or expedient to carry out specific\ntasks.\n\n7.\nMinutes in proper form of each meeting of the Committee\nand of any working group shall be kept by the Secretary and confirmed\nby the Committee at its next meeting and the Chairman shall sign the\nminutes once confirmed.\n\n8.\nThe approved Minutes of each meeting of the Committee\nand of any working group shall be submitted to the Board at its next\nmeeting.\n\n9.\nThe approved Minutes of the Committee and of any working\ngroup are public documents and shall be made available for perusal by\n\n\f32\n\nany  member  of  the  public  in  documentary  form  at  the  office  of  the\nDepartment and in electronic form on the internet.\n\n10.\nThe provisions of subsections (9) and (12) of section 6 and\nof section 103 of the Act apply mutatis mutandis to the Committee and\nany working group and members thereof as they apply to the Board.\n\n11.\n\nThe Committee shall regulate its own proceedings.\n\n\f33\n\nTHIRD SCHEDULE\n\nENVIRONMENTAL IMPACT ASSESSMENT COMMITTEE\n\n(Section 6(10))\n\n1.\ninclude persons with expertise in\n\nThe  Environmental  Impact  Assessment  Committee  shall\n\n(a)\n\n(b)\n\n(c)\n\nEcology;\n\nGeology, hydrology and soil conservation;\n\nEnvironmental, coastal and civil engineering;\n\n(d)\n\nMarine science;\n\n(e)\n\nDisaster risk mitigation and management;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\nPublic health;\n\nEconomics;\n\nSociology; and\n\nPhysical planning.\n\n2.\nthe Minister, with respect to EIA studies and for this purpose to\n\nThe function of the Committee is to advise the Board and\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nscreen  applications  for  planning  permission  to  determine\nwhether an EIA is required in any case;\n\nwhere an EIA is required, scope the development proposal to\nspecify the TOR for the EIA;\n\nreview  the  EIS  submitted  by  the  applicant  and  public\ncomments on the EIS; and\n\nmake  recommendations  to  the  Board  with  respect  to  the\nenvironmental  impacts  of  proposed  development  projects,\n\n\f34\n\nincluding  the  imposition  of  conditions  on  the  grant  of\nplanning permission for the purposes of avoiding, mitigating\nor offsetting adverse environmental impacts.\n\n3.\nis eligible for re-appointment as often as the Board sees fit.\n\nA member of the Committee serves for a term of 3 years but\n\n4.\nCommittee to act as Chairperson.\n\nThe  Board  shall  designate  one  of  the  members  of  the\n\n5.\nDevelopment Department to serve as Secretary to the Committee.\n\nThe  Director  assign  an  officer  from  the  Planning  and\n\nThe Committee may appoint from amongst its member such\n6.\nworking groups as are necessary or expedient to carry out specific tasks.\n\n7.\nMinutes in proper form of each meeting of the Committee\nand of any working group shall be kept by the Secretary and confirmed\nby the Committee at its next meeting; and the Chairman shall sign the\nminutes once confirmed.\n\n8.\nThe provisions of subsections (9) and (12) of section 6 and\nof section 103 of the Act apply mutatis mutandis to the Committee and\nmembers thereof as they apply to the Board.\n\n9.\nCommittee has the power to regulate its own proceedings.\n\nSubject  to  the  foregoing  provisions  of  this  Schedule,  the\n\n\f35\n\n L.R.O. 1998Planning and Development Act(Act 2019-5)FORMDESIGN CERTIFICATEI  hereby declare that the plans andspeciﬁ cations for the building works have been properly prepared by me in accordance with therequirements of the Building Regulations, 2020 (S.I. 2020 No.       ) and the Building Code.Name of Registered ProfessionalSignature of Registered ProfessionalDay/Month/YearSEVENTH SCHEDULE(Section 44(6))\f36\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n"
}