{
  "bill_id": 489,
  "slug": "control-of-disposable-plastic-bill-2020",
  "title": "Control of Disposable Plastic Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/37d41c0c85b5866ad0a6a943355abaee.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-04-25",
  "first_reading": "2020-04-27",
  "gazette_date": null,
  "markdown": "2020-04-27\n\nBill as amended\n\nOBJECTS AND REASONS\n\nThis Bill would revise the law relating to the prohibition of the manufacture,\nimportation, distribution and sale of certain single-use plastic items, authorise\nthe sale and use of certain types of disposable plastic materials and would provide\nfor related matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nDefinitions\n\nApplication\n\nProhibition\n\nProhibition on importation or manufacture of single-use plastic bags\n\nLicence for the importation\n\nExemption for certain single-use plastic items\n\nOffence of misrepresentation\n\nUnavailabiltiy of bio-based alternatives to plastics\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nCommittee\n\n11.\n\nSchedules\n\n12.\n\nRegulations\n\n13.\n\nRepeal of Act 2019-11\n\n\f3\n\nFIRST SCHEDULE\n\nPROHIBITED GOODS\n\nSECOND SCHEDULE\n\nGOODS PROHIBITED FROM IMPORTATION AND MANUFACTURE\n\nTHIRD SCHEDULE\n\nEXEMPTED SINGLE-USE PLASTIC ITEMS\n\nFOURTH SCHEDULE\n\nLICENCE FEE\n\nFIFTH SCHEDULE\n\nCONSTITUTION AND PROCEDURE OF COMMITTEE\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  revise  the  law  relating  to  the  prohibition  on  the  importation,\nmanufacture, distribution and sale of certain single-use plastic items, authorise\nthe use of certain types of disposable plastic items and to provide for related\nmatters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n2020.\n\nThis  Act  may  be  cited  as  the  Control  of  Disposable  Plastics  Act,\n\nDefinitions\n\n2.\n\nFor the purposes of this Act,\n\n“bio-based items” mean items made of plastic that contain materials wholly or\n\npartially of biogenic origin;\n\n“biogenic”  means  produced  in  natural  processes  by  living  organisms  but  not\n\nfossilized or derived from fossil resources;\n\n“environmentally sustainable” means a material that is made from a biological\n\nbased resource and that is compostable in a facility or garden;\n\n“Minister” means the Minister responsible for Maritime Affairs;\n\n“petroleum-based material” means any material that wholly or partially consists\n\nof petroleum;\n\n“polyethylene” means a polymer prepared by the polymerization of ethylene as\n\nthe sole monomer;\n\n“polypropylene” means a polymer prepared by the polymerization of propylene\n\nas the sole monomer;\n\n“polystyrene” means a polymer prepared by the polymerization of styrene as the\n\nsole monomer;\n\n“single-use plastic bag” means any bag made wholly or in part of polyethylene,\n\npolypropylene or any other petroleum-based material;\n\n“single-use plastic item” means\n\n(a)\n\n(b)\n\nsingle-use plastic bags;\n\npackaging;\n\n\f7\n\n(c)\n\ndrinking straws manufactured for single-use;\n\n(d)\n\ncups, plates, forks, knives, spoons and stirers;\n\n(e)\n\nlids, caps, stoppers and other closures used as food service products\n\nmade  wholly  or  in  part  of  polyethylene,  polypropylene  or  any  other\npetroleum-based material.\n\nApplication\n\n3.\nin the Returnable Containers Act, Cap. 395.\n\nThis Act shall not apply to any plastic beverage container referred to\n\nProhibition\n\nWith effect from the 1st day of May, 2020 the goods set out in the First\n4.(1)\nSchedule are prohibited goods within the meaning of section 89(1) of the Customs\nAct, Cap. 66 and shall not be imported into Barbados.\n\nWith effect from the 1st day of May, 2020 no person shall distribute, offer\n\n(2)\nfor sale, sell or use any prohibited goods set out in the First Schedule.\n\nSubject to section 6, with effect from the 1st day of May, 2020 no person\n\n(3)\nshall manufacture, distribute or offer for sale any single-use plastic bags.\n\nSubject to section 6, with effect from the 1st day of May, 2020 no person\n\n(4)\nshall use single-use plastic bags.\n\nA person who contravenes subsections (1), (2) or (3) is guilty of an offence\n(5)\nand is liable on summary conviction to a fine of $100 000 or to imprisonment for\na term of one year or to both and in the case of a continuing offence, to a further\nfine of $1 000 for each day or part thereof, during which the offence continues\nafter which a conviction was first obtained.\n\nAn individual who contravenes subsection (4) is guilty of an offence and\n\n(6)\nis liable on summary conviction to a fine of $5 000.\n\n\f8\n\nProhibition on importation or manufacture of single-use plastic bags\n\nSubject  to  section  6,  with  effect  from  the  1st  day  of  May,  2020  no\n5.\nperson shall import or manufacture any single-use petroleum-based plastic bag\nset out in the Second Schedule.\n\nLicence for the importation\n\n6.(1)\n\nWith effect from the 1st day of May, 2020 no person shall\n\n(a)\n\nimport  any  single-use  plastic  item  that  is  labelled  or  marketed  as\nenvironmentally sustainable; or\n\n(b)\n\nimport any item set out in the Third Schedule\n\nunless  that  person  has  applied  for  and  has  obtained  a  licence  issued  by  the\nMinister  responsible  for  Commerce  under  section  10  of  the  Miscellaneous\nControls Act, Cap. 329.\n\nAn application for a licence made pursuant to subsection (1) shall be in\n\n(2)\nsuch form as the Minister responsible for Commerce approves.\n\nThe Minister responsible for Commerce may, on receipt of an application\n(3)\nmade pursuant to subsection (1) and on payment of the fee set out in the Fourth\nSchedule,  grant  a  licence  for  the  importation  of  any  single-use  plastic  item\nreferred to in that subsection.\n\nA  licence  granted  pursuant  to  subsection  (3)  is  valid  for  a  period  of  3\n\n(4)\nmonths from the date of issue and is not transferable.\n\nAny person who contravenes subsection (1) is guilty of an offence and is\n(5)\nliable on summary conviction to a fine of $100 000 or to imprisonment for a term\nof one year or to both and, in the case of a continuing offence, to a further fine\nof $1 000 for each day or part thereof during which the offence continues after a\nconviction is first obtained.\n\n\f9\n\nExemption for certain single-use plastic items\n\n7.\n\nA person may\n\n(a)\n\n(b)\n\nmanufacture, distribute, offer for sale, sell or use; or\n\nsubject to section 6(1)(b) and (2), import\n\nany  single-use  plastic  bag,  plastic  wrap  or  tray  made  of  polystyrene  which  is\nrequired for a purpose specified in the Third Schedule.\n\nOffence of misrepresentation\n\nA  person  who  makes  a  false  or  misleading  claim  or  statement  and\n8.(1)\nrepresents that the single-use plastic items that are imported or offered for sale\nby him are environmentally sustainable is guilty of an offence.\n\nA manufacturer, wholesaler or retailer who makes a false or misleading\n(2)\nclaim  or  statement  and  represents  that  the  single-use  plastic  items  imported,\noffered  for  sale,  manufactured  or  distributed  by  him  are  environmentally\nsustainable is guilty of an offence.\n\nA person who is guilty of an offence under subsection (1) or (2) is liable\n(3)\non summary conviction to a fine of $100 000 or to imprisonment for a term of\none  year  or  to  both,  and  in  the  case  of  a  continuing  offence  to  a  further\nfine of $1 000 for each day or part thereof during which the offence continues\nafter which a conviction is first obtained.\n\nUnavailabiltiy of bio-based alternatives to plastics\n\n9.\n\nNotwithstanding any provision of this Act, where there\n\n(a)\n\n(b)\n\nis no suitable material for the manufacture of bio-based items; or\n\nare no bio-based items available for sale by a wholesaler or a retailer\n\nthe Minister, may on application made to him in writing setting out the reasons\nfor the unavailability of such materials or items grant to the applicant permission\n\n\f10\n\nto  manufacture  or  import  items  from  petroleum-based  materials  or  to  sell  by\nwholesale or retail such items, as the case may be.\n\nCommittee\n\n10.(1)\nInnovation Committee in this Act called the “Committee”.\n\nThere  is  established  a  committee  to  be  known  as  the  Bio-Based\n\n(2)\n\nThe purpose of the Committee is to\n\n(a)\n\n(b)\n\nrecommend, monitor and oversee the development of plastic pollution\nprevention programmes;\n\nrecommend,  monitor  and  oversee  the  development  of  bio-based\ninnovations, and promote the development of the bio-based economy;\nand\n\n(c)\n\nmake recommendations and develop proposals for public education on\nplastics and bio-based alternatives to plastics.\n\nThe Fifth Schedule has effect with respect to the constitution and procedure\n\n(3)\nof the Committee and otherwise in relation thereto.\n\nSchedules\n\n11.\n\nThe Minister may, by order, amend, vary or revoke the Schedules.\n\nRegulations\n\n12.\nthe Environment, make regulations\n\nThe Minister may, after consultation with the Minister responsible for\n\n(a)\n\n(b)\n\nfor the conservation, management and protection of the environment\nincluding the marine environment, from pollution by plastics;\n\nfor prescribing anything that is authorised or required by this Act to be\nprescribed; and\n\n(c)\n\ngenerally, for giving effect to the provisions of this Act.\n\n\f11\n\nRepeal of Act 2019-11\n\n13.\nrepealed.\n\nThe  Control  of  Disposable  Plastics  Act,  2019,  Act  2019-11  is\n\n\f12\n\nFIRST SCHEDULE(Section 4(1) and (2)) PROHIBITED GOODSTariff Heading Number Description of Goodsex 3923 Egg boxesex 3923 Food service products  (namely, lids, caps, stoppers  and other closures)ex 3923 Cupsex 3924 Drinking strawsex 3924 Forks ex 3924 Knivesex 3924 Platesex 3924 Spoonsex 3924 Stirrers\f13\n\nSECOND SCHEDULE(Section 5) GOODS PROHIBITED FROM IMPORTATION AND MANUFACTURETariff Heading Number Description of Goodsex 3923 Sacks and bags of polymers of  ethylene and other plastics\f14\n\nTHIRD SCHEDULE\n\nEXEMPTED SINGLE-USE PLASTIC ITEMS\n\n(Sections 6(1)(b) and 7)\n\nSingle-use  plastic  items  used  to  maintain  public  health  and  in\n1.\ncompliance with food safety standards, including packaging used by wholesalers\nand  retailers  to  distribute  raw  meat  (fresh,  chilled  or  frozen),  raw  fish  (fresh,\nchilled or frozen), flour, sugar, rice or baked goods.\n\n2.\nequipment and protective gear.\n\nSingle-use  plastic  items  used  for  medical  purposes,  inclusive  of\n\n3.\nequipment and protective gear.\n\nSingle-use  plastic  items  used  for  veterinary  purposes,  inclusive  of\n\nSingle-use plastic bags designed, packaged and retailed specifically\n4.\nfor the disposal of waste from households, public places, business places, offices\nor industrial plants.\n\n5.\nSingle-use plastic bags distributed by airport authorities for health,\nsafety and security purposes and contained in the luggage of a person travelling\ninto or out of Barbados.\n\n6.\nSingle-use  plastic  bags  or  plastic  wrap  designed  for  storage  of\nagricultural products, fresh fruit and vegetables, bags containing samples used\nfor analytical and scientific purposes.\n\n7.\npreservation of food.\n\nSingle-use  plastic  bags  or  wrap  used  for  perishables  or  for  the\n\n8.\nSingle-use  plastic  bags  that  are  transparent,  low  density  of  25-30\nmicrons, including bags used by vendors in the sale and distribution of produce\nsuch as fruits (e.g. nuts, grapes, plums, coconut slices, golden apple slices, mango\n\n\f15\n\nslices, pineapple slices, watermelon slices, sugar cane, tamarinds, ackees, berries,\ncherries, dunks, ‘fat pork’, cashews).\n\n9.\nmicrons used to package fresh, chilled or frozen meat.\n\nSingle-use  plastic  bags  that  are  transparent,  low  density  of  60-70\n\nTrays made of polystyrene used for packaging fresh, chilled or frozen\n10.\nmeat,  fish  or  processed  fruit  and  vegetables,  whether  fresh,  chilled,  frozen  or\nprocessed.\n\n11.\n\n12.\n\n13.\n\n14.\n\nDrinking straws to be used only by persons with disabilities.\n\nPlastic bags manufactured for export.\n\nPlastic straws attached to small tetra-pak boxes until 1st January 2023.\n\nCoin and currency bags used by financial institutions.\n\n\f16\n\nFOURTH SCHEDULE(Section 6(3)) LICENCE FEEFee for the import licence $25.00 \f17\n\nFIFTH SCHEDULE\n\nCONSTITUTION AND PROCEDURE OF COMMITTEE\n\n(Section 10(3))\n\n1.\n\nThe Committee shall comprise\n\n(a)\n\n(b)\n\n(c)\n\nthe  Permanent  Secretary  in  the  Ministry  responsible  for  Maritime\nAffairs, ex officio, who shall be the chairman;\n\nthe Permanent Secretary in the Ministry responsible for Commerce, ex\nofficio, or his nominee;\n\nthe  Permanent  Secretary  in  the  Ministry  responsible  for  the\nEnvironment, ex officio, or his nominee;\n\n(d)\n\nthe Comptroller of Customs, ex officio, or his nominee;\n\n(e)\n\n(f)\n\n(g)\n\nthe  Director  of  the  Barbados  National  Standards  Institution,  ex\nofficio, or his nominee;\n\nthe Director of the Coastal Zone Management Unit, ex officio, or his\nnominee;\n\nthe Director of the Department of Commerce and Consumer Affairs,\nex officio or his nominee;\n\n(h)\n\na representative of the Barbados Chamber of Commerce and Industry;\n\n(i)\n\n(j)\n\n(k)\n\na representative of the Barbados Manufacturer’s Association;\n\na representative of the Barbados Private Sector Association; and\n\na representative from the Faculty of Science and Technology of the\nUniversity of the West Indies, Cave Hill Campus.\n\n2.\nSubject to the right to resign his office, a person appointed under sub-\nparagraph (h), (i), (j) and (k) of paragraph 1 shall hold office for a term of 3 years.\n\n\f18\n\n3.\nexcept with the approval of the Cabinet.\n\nNo remuneration shall be payable to the members of the Committee\n\n4.\nIn the case of the absence of the chairman, or his inability to act as\nsuch, the senior Permanent Secretary shall exercise the functions of the chairman.\n\n5.\nresponsible for Maritime Affairs shall be the Secretary of the Committee.\n\nA public officer assigned by the Permanent Secretary in the Ministry\n\n6.\nthe Minister.\n\nA member of the Committee may resign by letter in writing sent to\n\n7.\nprocedure.\n\nSubject  to  this  Schedule,  the  Committee  shall  regulate  its  own\n\n8.\nnecessary or expedient for the transaction of its business.\n\nThe  Committee  shall  meet  at  such  times  and  places  as  may  be\n\n9.(1)\nThe chairman may at any time call a special meeting of the Committee,\nand shall call such a meeting if required so to do by 5 members of the Committee.\n\nThe  chairman  and  5  other  members  of  the  Committee  shall  form  a\n\n(2)\nquorum.\n\nIn the case where the voting is equal, the chairman shall have a second or\n\n(3)\ncasting vote.\n\n\f19\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n"
}