{
  "bill_id": 48,
  "slug": "tourism-development-amendment-bill-2014",
  "title": "Tourism Development (Amendment) Bill, 2014",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/6a190c84ce5fa38e17b51034c72aa24b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2014-10-22",
  "first_reading": "2014-10-29",
  "second_reading": "2014-10-21",
  "gazette_date": "2014-10-20",
  "passed_date": "2014-10-29",
  "markdown": "Explanatory Memorandum after page 10\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Tourism Development Act, Cap. 341 to provide\n\n(a)\n\nfor hotels to be granted an exemption from the duties and taxes payable\nfor the local purchase or importation of supplies not listed in the Second\nSchedule,  including  stores  of  food,  alcoholic  and  non-alcoholic\nbeverages,  where  the  supplies  are  required  for  the  operation  or\ndevelopment of the tourism product or tourism project; and\n\n(b)\n\nfor related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nShort title\n\nAmendment of section 2 of Cap. 341\n\nAmendment of section 3 of Cap. 341\n\nAmendment of section 15 of Cap. 341\n\nAmendment of section 17 of Cap. 341\n\nInsertion of section 19A into Cap. 341\n\nAmendment of Cap. 341\n\nAmendment of the enactment set out in the Schedule\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Tourism Development Act.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2014.\n\nThis Act may be cited as the Tourism Development (Amendment) Act,\n\n\f4\n\nAmendment of section 2 of Cap. 341\n\n2.\nreferred to as the principal Act, is amended by\n\nSection  2  of  the  Tourism  Development  Act,  Cap.  341,  in  this  Act\n\n(a)\n\ninserting the following definition in alphabetical order:\n\n“  “Authority”  means  the  Barbados  Tourism  Product  Authority,  as\nestablished  by  section  3  of  the  Barbados  Tourism  Product\nAuthority Act (Act 2014 - );”\n\n(b)\n\ndeleting the definition of “supplies” and substituting the following:\n\n“ “supplies” means\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nbuilding  materials,  items  or  goods  that  are  imported,\npurchased from a bonded warehouse or that are purchased\nlocally for the construction, development and operation of a\ntourism project;\n\nthe  provision  of  services  that  directly  relate  to  the\nconstruction of the tourism project;\n\nitems listed in the Second Schedule; or\n\nitems  approved  for  exemption  from  custom  duty  by  the\nMinister under section 15(4).”.\n\nAmendment of section 3 of Cap. 341\n\n3.\n\nSection 3 of the principal Act, is amended by\n\n(a)\n\ndeleting subsection (1) and substituting the following:\n\n\f5\n\n“(1)\n\nA person who\n\n(a)\n\n(b)\n\nwishes to own or operate a tourism product may apply to the\nMinister to have the tourism project necessary to develop the\ntourism product approved for the purposes of this Act; or\n\noffers a service or facility, or operates a company or entity\nwhich contributes to the development of tourism may apply\nto the Minister to have the service, facility, company or entity\napproved  as  a  tourism  project  or  tourism  product  for  the\npurposes of this Act.”; and\n\n(b)\n\ndeleting subsection (3) and substituting the following:\n\nNotwithstanding  subsection  (2),  the  Minister  may,  with  the\n\n“(3)\napproval of the Cabinet, declare by order any\n\n(a)\n\n(b)\n\nservice or facility to be a tourism project or tourism product\nfor the purposes of this Act; or\n\ncompany or entity to be a tourism project or tourism product\nfor the purposes of this Act\n\nwhere  the  Minister  is  satisfied  that  the  service,  facility,  company  or\nentity is making a contribution to the development and sustainability\nof tourism in Barbados.”.\n\nAmendment of section 15 of Cap. 341\n\n4.\nthe following:\n\nThe principal Act is amended by deleting section 15 and substituting\n\n“Exemption\n\n15.(1)\nThe  owner  or  operator  of  a  tourism  project  or  tourism\nproduct for which interim approval has been granted shall be exempt\n\n\f6\n\nfrom the payment of customs duty on the supplies listed in the Second\nSchedule where the supplies are purchased out of a bonded warehouse,\npurchased locally or imported.\n\nFor the purposes of refurbishing a tourism product, the owner or\n\n(2)\noperator of the tourism product who\n\n(a)\n\n(b)\n\nhas a valid licence issued pursuant to section 10; or\n\nis registered with the Authority,\n\nshall be exempt from the payment of customs duty in respect of the\nsupplies listed in the Second Schedule where they are purchased out of\na bonded warehouse, purchased locally or imported.\n\nNotwithstanding subsections (1) and (2), any owner or operator\n\n(3)\nof a hotel, for which interim approval has been granted,\n\n(a)\n\n(b)\n\nwho needs to import, purchase locally or purchase out of a\nbonded  warehouse,  for  the  exclusive  use  of  the  tourism\nproduct or tourism project, any item or supplies not specified\nin the Second Schedule; or\n\nwith  a  restaurant  on  the  premises,  who  needs  to  import,\npurchase  locally  or  purchase  out  of  a  bonded  warehouse,\nstores of food, alcoholic or non-alcoholic beverages, which\nare required for the operation or development of the tourism\nproduct or tourism project for that hotel\n\nshall  submit  a  letter  of  application  to  the  Minister,  and  the  letter  of\napplication shall include the name and cost of the item, supplies, stores\nof food, alcoholic or non-alcoholic beverages, where the item, supplies,\nstores of food, alcoholic or non-alcoholic beverages will be sourced,\nand such further details as the Minister may require.\n\n\f7\n\n(4)\nWhere the Minister is satisfied that the item, supplies, stores of\nfood, alcoholic or non-alcoholic beverages, stated or listed in the letter\nof application which was submitted in accordance with subsection (3)\n\n(a)\n\n(b)\n\n(c)\n\nare not specified in the Second Schedule;\n\nare required for the operation or development of the tourism\nproduct or tourism project for that hotel; and\n\nwill contribute to the sustainability and development of vital\naspects of tourism in Barbados\n\nhe may grant an exemption, in respect of the item, supplies, stores of\nfood, alcoholic or non-alcoholic beverages, by an instrument in writing.\n\nThe  medical  supplies  specified  in  Part  VI  of  the  Second\n(5)\nSchedule shall only be imported or purchased locally by the owner or\noperator of a tourism product or tourism project who\n\n(a)\n\n(b)\n\n(c)\n\nis  a  medical  doctor,  who  specializes  in  obstetrics  and\ngynaecology or a related field;\n\nis licensed under the Medical Profession Act (Act 2014 - ) to\npractise medicine in Barbados; and\n\nprovides  medical  services  dealing  with  infertility,  the\ntransplantation  of  embryos  and  other  related  or  ancillary\nprocedures.\n\nThe exemptions referred to in subsections (1), (2), (4) and (5)\n(6)\nshall be for a period of 15 years commencing from the date that approval\nis granted to be an approved tourism project or tourism product, as the\ncase may be.\n\nThe exemptions referred to in subsections (1), (2), (4) and (5)\n(7)\nshall be subject to such conditions as the Minister or Comptroller of\nCustoms may impose.”.\n\n\f8\n\nAmendment of section 17 of Cap. 341\n\n5.\nthe following:\n\nThe principal Act is amended by deleting section 17 and substituting\n\n“Prohibited uses\n\n17.(1)\nEvery operator or owner of a tourism project who imports\nor purchases locally supplies, without the payment of customs duty, in\naccordance  with  the  provision  of  this  Act,  and  who  without\nauthorisation from the Minister disposes of the supplies otherwise than\nin the manner provided for in the permit or contrary to the terms and\nconditions imposed under section 15(7), is guilty of an offence and is\nliable on conviction on indictment to a fine equivalent to the sum of\nwhichever of the following amounts is of the highest monetary value:\n\n(a)\n\n(b)\n\n(c)\n\n$100 000;\n\n10 times the monetary value of the items, supplies, stores of\nfood,  alcoholic  or  non-alcoholic  beverages  which  was\nimported or purchased locally; or\n\n10  times  the  sum  payable  as  customs  duty  on  the  items,\nsupplies,  stores  of  food,  alcoholic  or  non-alcoholic\nbeverages.\n\nWhere a person convicted of an offence under this section fails\n(2)\nto comply and pay the amount required in the time period ordered by\nthe court, that person shall be liable to a further fine of $10 000 for each\nday for which that failure to comply continues.”.\n\nInsertion of section 19A into Cap. 341\n\n6.\nsection 19:\n\nThe principal Act is amended by inserting the following section after\n\n\f9\n\n“Power to revoke or suspend tourism project status\n\n19A.\nThe  Minister  may  where  a  tourism  project  or  tourism\nproduct contravenes section 15(7), section 17, section 18 or section 19\nrevoke the declaration made under section 9, revoke the licence issued\nunder section 10, or suspend the application of the Act in respect of that\ntourism  project  or  tourism  product  for  such  a  period  of  time  as  the\nMinister may determine. ”.\n\nAmendment of Cap. 341\n\nThe  principal  Act  is  amended  by  deleting  the  words  “  Barbados\n7.\nTourism  Authority”  wheresoever  they  appear  and  substituting  therefor  the\nword “ Authority” .\n\nAmendment of the enactment set out in the Schedule\n\n8.\nthe manner specified opposite thereto in Column 2 of the Schedule.\n\nThe enactment set out in Column 1 of the Schedule is amended in\n\n\f10\n\nSCHEDULE\n\n( section 7 )\n\nColumn 1\n\nEnactment\n\nTourism Development Order, 2013\n(S.I. 2013 No. 88)\n\nColumn 2\n\nAmendment\n\nDeleting paragraph 3.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2014.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2014.\n\nPresident\n\n\fTOURISM DEVELOPMENT (AMENDMENT) ACT, 2014\n\nEXPLANATORY MEMORANDUM\n\nThe Tourism Development Act, Cap. 341 regulates the very dynamic tourism\nindustry and it is imperative that this legislative framework is able to respond\nrapidly to the dynamism of the industry. The Tourism Development (Amendment)\nAct, 2014 amends the Tourism Development Act, Cap. 341 to ensure that it would\nbe better able to respond to the changing needs of the tourism industry in a timely\nmanner.\n\nClause 1:\n\nClause 2:\n\nClause 3:\n\nClause 4:\n\nThis clause gives the short title of the amending Act. It may\nbe cited as Tourism Development (Amendment) Act, 2014.\n\nThis clause amends section 2 of the Tourism Development Act,\nCap.  341,  hereinafter  referred  to  as  the  principal  Act,  to\ninclude  a  definition  of  “Authority”  and  to  expand  the\ndefinition of “supplies” in order to improve the efficacy of the\nAct.\n\nThis clause amends subsections (1) and (3) of section 3 of the\nprincipal Act. It amends subsection (1) to provide for a wider\ncross-section of entities to apply to be considered as tourism\nproducts or tourism projects. Further, it amends subsection (3)\nto provide for the Minister to declare by order any service,\nfacility,  company  or  entity  as  a  tourism  project  or  tourism\nproduct.\n\nThis clause amends section 15 of the principal Act to provide\ngreater  flexibility  for  the  granting  of  exemptions  from\ncustoms  duty  in  order  to  facilitate  the  rapid  changes  in  the\nindustry. Subsection (3) is amended to provide for hotels to\nmake  an  application  to  the  Minister  where  the  hotel  needs\nsupplies, items or food or beverages which are not listed in\n\ni\n\n\fTourism Development (Amendment) Act,\n2014\n\nthe  Second  Schedule  and  subsection  (4)  provides  for  the\nMinister  to  grant  an  exemption  where  it  contributes  to  the\ndevelopment  of  the  tourism  project  or  tourism  product  and\nwill contribute to sustainability and development of tourism\nin Barbados. Subsection (5) clarifies the intended use of the\nsupplies listed in Part VI of the Second Schedule, as it makes\nit clear that these supplies are to be used by qualified medical\npractitioners who deal with infertility.\n\nThis clause amends section 17 to provide for stricter penalties\nfor  violation  of  section  15  or  the  misuse  of  the  supplies\npurchased or imported free of custom duty under the Act.\n\nThis clause inserts a new section, section 19A into the Act.\nThis new section gives the Minister the power to suspend or\nrevoke the license issued to a tourism project. He may also\nsuspend the application of the Act for a violation of the Act.\n\nThis  clause  deletes  all  references  to  the  former  “Barbados\nTourism Authority” and replaces them with references to the\nnew “Barbados Tourism Product Authority”.\n\nThis  Clause  deletes  a  substantive  provision  inserted  in  the\nTourism  Development  Order,  2013,  as  better  provision  has\nbeen made for the intent of this provision by the insertion of\na subsection (5) in the current amendment of section 15.\n\nClause 5:\n\nClause 6:\n\nClause 7:\n\nClause 8:\n\nii\n\n"
}