{
  "bill_id": 495,
  "slug": "resolution-re-loan-from-scotiabank-to-repay-overdraft-facility-held-by-cbc",
  "title": "Resolution re loan from Scotiabank to repay overdraft facility held by CBC",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/5c4e33b4be729794979abf161cf07f26.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-06-10",
  "first_reading": "2020-06-17",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\n2020-03-17\n\nPARLIAMENT\n\nWHEREAS by virtue of section 2 of the Special Loans Act, Cap. 105 the Government\n\nis authorised from time to time to borrow from another government, any bank, corporation, company\n\nor other institution sums of money not exceeding in the aggregate BBD 2,500,000,000 on such\n\nterms as may be agreed upon between the Government and the lender of any such sum of money;\n\nAND  WHEREAS  by  section  3  of  the  said Act  it  is  provided  that  any  money\n\nborrowed  under  the  authority  of  the Act  shall  be  appropriated  and  applied  to  such  purposes\n\nas  Parliament  may  approve  by  resolution  and  that  such  money  and  any  interest\n\npayable  thereon  is  charged  upon  the  general  revenues  and  assets  of  Barbados;\n\nAND  WHEREAS  the  Government  considers  it  necessary  to  borrow  the  sum\n\nof  BBD  2,493,271  from  Scotiabank  (Barbados)  Limited  to  repay  an  existing  overdraft\n\nfacility held by the Caribbean Broadcasting Corporation;\n\nAND  WHEREAS  the  said  sum  of  BBD  2,493,271  is  borrowed  on  the  terms\n\nand  conditions  contained  in  the  Commitment  Letter,  the  main  provisions  of  which  are  set  out\n\nin the Schedule;\n\nAND  WHEREAS  the  said  sum  of  BBD  2,493,271  is  within  the  authorised\n\nborrowing limit given to the Government under section 2 of the said Act;\n\n\f2\n\nBE  IT  RESOLVED  therefore  that  Parliament  approve  the  borrowing  of  the  said  sum  of\n\nBBD  2,493,271  from  Scotiabank  (Barbados)  Limited  to  repay  an  existing  overdraft  facility  held  by\n\nthe  Caribbean  Broadcasting  Corporation  on  the  terms  and  conditions  contained  in  the\n\nCommitment Letter, the main provisions of which are set out in the Schedule.\n\nAPPROVED by the House of Assembly this            day of                               , Two thousand and\n\ntwenty.\n\nSpeaker\n\nAPPROVED by the Senate this           day of                   , Two thousand and twenty.\n\nPresident\n\n\f3\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nGovernment of Barbados\n\nScotiabank (Barbados) Limited\n\nBBD 2,493,271\n\nNon revolving term loan\n\nTo fully repay and close the operating facility availed to the Caribbean\nBroadcasting Corporation\n\nBarbados dollars (BBD)\n\nBorrower:\n\nLender:\n\nAmount:\n\nType:\n\nPurpose:\n\nCurrency:\n\nTerm and repayment:\n\nThe term of the loan is 18 months.\n\nThe loan shall be repaid by 18 monthly blended principal and interest\npayments of BBD 144,062.08 each.\n\nThe balance of the loan together with all accrued interest and amounts\noutstanding shall be paid on or before the date which is 18 months from\nthe date of the initial advance.\n\nInterest Rate:\n\nFixed at 5 per cent per annum.\n\nInterest payable monthly.\n\nInterest  is  calculated  on  the  basis  of  a  calendar  year  for  the  actual\nnumber of days elapsed, divided by 365.\n\nInterest  on  overdue  interest  shall  be  calculated  at  the  same  rate  as\ninterest on the loan in respect of which interest is overdue plus 2 per cent.\nInterest  shall  be  compounded  monthly  and  be  payable  on  demand.\n\nProvided  all  terms  and  conditions  are  met,  the  loan  may  be  drawn\ndown upon presentation of a drawdown notice at least 2 days prior to\nthe requested drawdown date.\n\nDrawdown:\n\n\fSchedule - (Concl'd)\n\n4\n\nTERMS AND CONDITIONS - (Concl'd)\n\nGeneral Security:\n\nUnsecured\n\nConditions precedent:\n\nThe  right  of  the  Borrower  to  obtain  any  advance  under  the  loan  is\nsubject to:\n\n(1)\n\n(2)\n\nperformance by the Borrower of all its obligations set out in\nthe Commitment Letter which are to be performed prior to any\ndisbursement; and\n\nthe following documents have been provided and the following\nconditions have been complied with, each in form and substance\nsatisfactory to the Lender:\n\n(a)\n\n(b)\n\nexecution  of  the  Commitment  Letter  by  authorised\nparties  of  the  Borrower  and  delivery  to  the  Lender;\n\na certiﬁ cate of an authorised signatory of the Borrower\nto the effect that the requisite legislative approvals have\nbeen obtained to authorise\n\n(i)\n\n(ii)\n\nthe  execution,  delivery  and  performance  of  the\nCommitment Letter and any ancillary documents\nto which the Borrower is a party;\n\na named person or persons speciﬁ ed therein and\nwhose  specimen  signatures  appear  thereon  to\nsign on behalf of the Borrower, the Commitment\nLetter and any ancillary documents to which the\nBorrower is a party, and to give any notices or\ncertiﬁ cates required in connection therewith and\nconﬁ rming that (such resolutions) are still in effect\nand have not been varied or rescinded.\n\nGoverning Law:\n\nThe Commitment Letter and the loan shall be governed by and construed\nin accordance with the Laws of Barbados.\n\n\f5\n\nADDENDUM\n\nThis Resolution seeks the approval of Parliament for the borrowing of BBD 2,493,271\n\nby way of a non revolving term loan from Scotiabank (Barbados) Limited.\n\nThe sum of BBD 2,493,271 is within the limit of the Special Loans Act, Cap. 105.\n\nThe  proceeds  of  the  loan  will  be  used  to  repay  an  existing  overdraft  facility\n\nheld by the Caribbean Broadcasting Corporation.\n\n"
}