{
  "bill_id": 496,
  "slug": "catastrophe-fund-bill-2020",
  "title": "Catastrophe Fund Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/e0215f0c7b25f89026cab9e9b51ea271.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-06-02",
  "first_reading": "2020-06-10",
  "gazette_date": null,
  "markdown": "Explanatory Memorandum after page 16\n\n2020-05-29\n\nOBJECTS AND REASONS\n\nThis Bill would provide for a fund, to be known as the Catastrophe Fund, to\nprovide financial aid to eligible persons and qualifying businesses in need of such\naid as a result of a catastrophe.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nCatastrophe Fund\n\nPurpose of Fund\n\nClaim for financial aid\n\nCommittees\n\nManagement of Fund\n\nAccounts\n\nReports\n\n10.\n\nLaying of reports\n\n11.\n\nOffence\n\n12.\n\nRegulations\n\n13.\n\nAmendment of Schedules\n\n14.\n\nRepeal\n\n\f3\n\nFIRST SCHEDULE\n\nCLAIMS FOR FINANCIAL AID\n\nSECOND SCHEDULE\n\nCATASTROPHE COMMITTEES\n\nTHIRD SCHEDULE\n\nINVESTMENTS FROM FUND\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  provide  for  a  fund,  to  be  known  as  the  Catastrophe  Fund,  to\nprovide financial aid to eligible persons and qualifying businesses in need of\nsuch aid as a result of a catastrophe.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n\nThis Act may be cited as the Catastrophe Fund Act, 2020.\n\nInterpretation\n\n2.\n\nIn this Act\n\n“catastrophe”  means  an  event,  whether  natural  or  not,  that  has  a  significant,\n\nadverse impact on the economy or a part of the economy including\n\n(a)\n\na fire, an earthquake, a storm, a hurricane, a storm surge, a sea surge,\nflooding, lightning or another force of nature;\n\n(b)\n\na pandemic;\n\n(c)\n\na breach of cybersecurity; and\n\n(d)\n\nan act of terrorism;\n\n“Committee”  means  the  Physical  Catastrophes  Committee  or  the  Economic\nCatastrophes Committee, as the case may be, established by section 6;\n\n“financial aid” includes grants and loans;\n\n“financial  year”  has  the  meaning  assigned  to  it  by  section  39(8)  of  the\n\nInterpretation Act, Cap. 1;\n\n“former Act” means the Catastrophe Fund Act, Cap. 39D;\n\n“Fund” means the Catastrophe Fund referred to in section 3;\n\n“member”  means  a  member  of  the  Physical  Catastrophes  Committee  or  the\n\nEconomic Catastrophes Committee, as the case may be.\n\n\f7\n\nCatastrophe Fund\n\nThe Catastrophe Fund established under the former Act shall, on the\n3.\nrepeal of the former Act, continue in existence under this Act and continue to\nconsist of\n\n(a)\n\n(b)\n\nannual contributions with effect from financial year 2006-2007 in the\nsum of $2.5 million voted by Parliament for the purposes of the Fund\nfor a period of not less than 5 years;\n\nmonthly  contributions  payable  with  effect  from  financial  year\n2006-2007 by every employed person and self-employed person in the\namount of 0.1% of the earnings on which that person pays national\ninsurance;\n\n(c)\n\namounts realised from investment proceeds;\n\n(d)\n\nmoneys that may accrue from the operations of the Fund.\n\nPurpose of Fund\n\n4.\nand qualifying businesses in need of such aid as a result of a catastrophe.\n\nThe purpose of the Fund is to provide financial aid to eligible persons\n\nClaim for financial aid\n\n5.\n\nA person described in the First Schedule\n\n(a)\n\n(b)\n\nmay, in the circumstances described in that Schedule, make a claim for\nfinancial aid under this Act; and\n\nshall,  where  he  desires  to  make  such  a  claim,  apply  to  the  relevant\nCommittee in such form as the Committee may approve.\n\n\f8\n\nCommittees\n\n6.(1)\nCatastrophes  Committee  and\nrespectively.\n\nThere shall be established two committees, to be called the Physical\nthe  Economic  Catastrophes  Committee,\n\nThe  Second  Schedule  has  effect  with  respect  to  the  constitution  of  the\n\n(2)\nCommittees and otherwise in relation thereto.\n\nThe  Physical  Catastrophes  Committee  shall  be  responsible  for  the\n(3)\nconsideration  and  assessment  of  claims  by,  and  the  grant  of  financial  aid  to,\npersons described in paragraph 1 of the First Schedule.\n\nThe  Economic  Catastrophes  Committee  shall  be  responsible  for  the\n(4)\nconsideration  and  assessment  of  claims  by,  and  the  grant  of  financial  aid  to,\npersons described in the First Schedule other than those described in paragraph\n1 of that Schedule.\n\nEach Committee shall, upon receipt of a claim, conduct an investigation\n(5)\ninto  the  circumstances  relating  to  the  claim  in  order  to  determine  whether\nfinancial aid should be granted.\n\nEach Committee may employ such agents as it thinks fit for the purpose\n\n(6)\nof subsection (5).\n\nManagement of Fund\n\n7.(1)\nInsurance Office.\n\nThe contributions referred to in section 3 shall be paid to the National\n\nThe National Insurance Board shall be responsible for the management\n\n(2)\nand investment of the Fund.\n\n(3)\n\nThe following payments may be made from the Fund:\n\n(a)\n\n(b)\n\nthe payment of financial aid pursuant to section 5;\n\nrefunds of any payment paid in excess or in error;\n\n\f9\n\n(c)\n\nexpenses incurred in respect of the administration of this Act.\n\n(4)\nAll contributions payable pursuant to section 3(2)(b) are recoverable in the\nmanner specified in section 43 of the National Insurance and Social Security\nAct, Cap. 47 as if the contributions were national insurance contributions.\n\nThe Third Schedule has effect with respect to investment of moneys from\n\n(5)\nthe Fund.\n\nAccounts\n\n8.(1)\n\nThe Director, National Insurance shall\n\n(a)\n\n(b)\n\n(c)\n\nkeep proper accounts of the Fund and proper records in relation thereto;\n\nprepare a monthly statement of the accounts of the Fund; and\n\nnot  later  than  2  weeks  after  the  end  of  each  month,  submit  the\nstatements to\n\n(i)\n\nthe Chairman of the National Insurance Board; and\n\n(ii)\n\nthe Director of Finance and Economic Affairs.\n\nThe accounts of the Fund shall be audited at least once every financial year\n\n(2)\nby the Auditor-General.\n\nReports\n\n9.(1)\nthe end of a financial year, submit to the Minister in respect of the year\n\nThe Director, National Insurance shall, not later than 3 months after\n\n(a)\n\n(b)\n\na statement of the accounts of the Fund; and\n\na report on the investment portfolio and other economic activity of the\nFund.\n\nEach Committee shall, not later than 3 months after the end of a financial\n(2)\nyear, submit to the Minister in respect of the year, a general report on the discharge\nof the Committee's functions during the year.\n\n\f10\n\nLaying of reports\n\nThe Minister shall, not later than 4 weeks after receiving the reports\n10.\nand  statements  submitted  under  section  9,  lay  the  reports  and  statements  in\nParliament.\n\nOffence\n\nAny person who for the purposes of obtaining financial aid under this\n11.(1)\nAct gives false or incomplete information, is guilty of an offence and is liable on\nsummary conviction to a fine of $50 000 or to imprisonment for 5 years or to\nboth.\n\nWhere a person is convicted of an offence under subsection (1) and the\n(2)\nperson obtained financial aid under this Act, the person shall repay the full sum\nof the aid that was paid to him within such time as is fixed by the court.\n\nWhere a person fails to repay the sum referred to in subsection (2) within\n(3)\nthe time fixed by the court, the person is guilty of an offence and is liable on\nsummary conviction to a fine of $50 000 or to imprisonment for 5 years or to\nboth.\n\n(4)\n\nW here an amount paid to a person as financial aid under this Act\n\n(a)\n\n(b)\n\nwas not payable to the person; or\n\nexceeds the amount that was payable to the person,\n\nthe person to whom the amount was so paid shall be given notice in writing of\nthe fact and shall be directed to repay the sums within such time as is fixed in the\nnotice.\n\nWhere a person fails to repay a sum that was paid in error or a sum that\n(5)\nwas paid in excess in the circumstances mentioned in subsection (4), the person\nis guilty of an offence and is liable on summary conviction to a fine of $25 000\nor to imprisonment for 3 years or to both.\n\n\f11\n\nRegulations\n\n12.\n\nThe Minister may make regulations\n\n(a)\n\n(b)\n\n(c)\n\nproviding for the management and investment of the Fund;\n\nproviding for the manner in which claims may be made; and\n\ngenerally for the proper administration of this Act.\n\nAmendment of Schedules\n\n13.(1)\nSchedules.\n\nThe  Minister  may  by  Order  amend  the  First,  Second  and  Third\n\n(2)\n\nAn order made under subsection (1) is subject to negative resolution.\n\nRepeal\n\n14.\n\nThe Catastrophe Fund Act, Cap. 39D is repealed.\n\n\f12\n\nFIRST SCHEDULE\n\nCLAIMS FOR FINANCIAL AID\n\n(Sections 5 and 13)\n\nDestruction of homes by catastrophe\n\nAn owner of a chattel house valued at not more than $150 000 who\n1.(1)\noccupies the house and who earns less than $25 000 annually is, from 1st April\n2008,  entitled  to  a  grant  in  such  amount  as  is  determined  by  the  Physical\nCatastrophes  Committee,  where  the  house  is  damaged  or  destroyed  by  a\ncatastrophe.\n\n(2)\n\nWhere a house is constructed of both wood and brick\n\n(a)\n\nthe house shall be regarded as a chattel house for the purposes of this\nparagraph if the house is, in the opinion of the Physical Catastrophes\nCommittee, substantially constructed of wood; and\n\n(b)\n\nthe house shall be regarded as substantially constructed of wood if at\nleast 75% of the house is wooden.\n\nA grant under this paragraph shall be such amount as is required to replace\n(3)\nor repair, as the case may be, the chattel house in respect of which the claim is\nmade, but the grant shall in no case exceed $150 000.\n\nWhere the Physical Catastrophes Committee determines that a grant should\n(4)\nbe made, a deduction shall be made with respect to any sum that is paid under an\ninsurance  policy  in  respect  of  the  chattel  house  that  has  been  destroyed  or\ndamaged.\n\n(5)\n\nWhere with the approval of the Physical Catastrophes Committee\n\n(a)\n\n(b)\n\na house has been provided by an agency to a person who is entitled to\na grant under this paragraph; or\n\nrepairs have been effected by an agency to a house owned by a person\nwho is entitled to a grant under this paragraph,\n\n\f13\n\nthe Committee shall, instead of paying the grant to the person entitled, pay the\namount of the grant to the agency, if the work was carried out to the satisfaction\nof the Committee.\n\n(6)\n\nFor the purposes of this paragraph “agency” means\n\n(a)\n\n(b)\n\n(c)\n\nthe  Urban  Development  Commission  established  under  the  Urban\nDevelopment Commission Act, Cap. 241;\n\nthe  Rural  Development  Commission  established  under  the  Rural\nDevelopment Commission Act, Cap. 238; or\n\nany  ministry  or  department  of  Government  charged  with  providing\nsocial services.\n\nDisruption of business by a pandemic and related containment\nmeasures\n\n2.(1)\n\nA person who\n\n(a)\n\n(b)\n\n(c)\n\nis registered under the Value Added Tax Act, Cap. 87;\n\npays value added tax; and\n\ncan show that his cash flow has been severely disrupted by a pandemic\nand the measures taken to contain the pandemic,\n\nis entitled to claim financial aid in such amount and on such terms as is determined\nby the Economic Catastrophes Committee.\n\nA self-employed person who makes national insurance contributions and\n(2)\nwho can show that his cash flow has been severely disrupted by a pandemic and\nthe measures taken to contain the pandemic, is entitled to claim financial aid in\nsuch amount and on such terms as is determined by the Economic Catastrophes\nCommittee.\n\n\f14\n\nSECOND SCHEDULE\n\nCATASTROPHE COMMITTEES\n\n(Sections 6 and 13)\n\n1.\n\nThe Physical Catastrophes Committee shall comprise\n\n(a)\n\nex officio\n\n(i)\n\nthe Chief Executive Officer, Financial Services Commission or\nhis nominee;\n\n(ii)\n\nthe Director, National Insurance or his nominee;\n\n(iii)\n\nthe Chief Fire Officer or his nominee; and\n\n(iv)\n\nthe  Director,  Department  of  Emergency  Management  or  his\nnominee; and\n\n(b)\n\ntwo persons appointed by the Minister by instrument in writing.\n\n2.\n\nThe Economic Catastrophes Committee shall comprise\n\n(a)\n\nex officio\n\n(i)\n\nthe Revenue Commissioner, Barbados Revenue Authority or his\nnominee;\n\n(ii)\n\nthe Director, National Insurance or his nominee;\n\n(iii)\n\n(iv)\n\nthe Permanent Secretary, Ministry of Finance, Economic Affairs\nand Investment or his nominee; and\n\nthe  Permanent  Secretary,  Ministry  of  Small  Business,\nEntrepreneurship and Commerce or his nominee; and\n\n(b)\n\n2 persons appointed by the Minister by instrument in writing.\n\n3.(1)\nChairman of the Committee and another to be Deputy Chairman.\n\nThe  Minister  shall  appoint  a  member  of  each  Committee  to  be\n\n\f15\n\nThe Chairman shall preside at meetings of the Committee and, where the\n\n(2)\nChairman is absent, the Deputy Chairman shall preside.\n\n(3)\n\nThree members of each Committee constitute a quorum of the Committee.\n\nEach Committee shall meet at such times as it considers necessary for the\n\n(4)\ntransaction of its business.\n\nMinutes of each meeting shall be kept in proper form by the Secretary or\n(5)\nsuch other person as each Committee may appoint for the purpose and shall be\nconfirmed in writing at the next meeting.\n\n4.(1)\nin the event of an equality of votes, the Chairman shall have a casting vote.\n\nThe decisions of each Committee shall be by a majority of votes and,\n\nAll  decisions  made  by  each  Committee,  and  all  documents  of  each\n(2)\nCommittee,  shall  be  signed  by  the  Chairman  or  the  Deputy  Chairman  of  the\nCommittee.\n\n5.\n\nThe seal of each Committee shall be\n\n(a)\n\nkept  in  the  custody  of  the  Chairman  or  such  other  member  as  the\nCommittee  may  approve,  and  may  be  affixed  to  documents  or\ninstruments in the presence of the Chairman and the Secretary to the\nCommittee; and\n\n(b)\n\nauthenticated by the signature of the Chairman or Deputy Chairman\nand the Secretary to the Committee.\n\n6.(1)\nThe Chairman of each Committee may invite any person to attend a\nmeeting of the Committee where the Committee considers it necessary to do so.\n\nA person referred to in subparagraph (1) may take part in the deliberations\n\n(2)\nof the Committee but may not vote on any matter.\n\n7.\n\nSubject to this Act, each Committee may regulate its own proceedings.\n\n\f16\n\nTHIRD SCHEDULE\n\nINVESTMENTS FROM FUND\n\n(Sections 7 and 13)\n\n1.\n\nIn this Schedule\n\n“CARICOM Single Market and Economy” has the meaning assigned to it by\n\nsection 2 of the Caribbean Community Act, Cap. 15;\n\n“Government  securities”  means  securities  issued  or  guaranteed  by  the\n\nGovernment of\n\n(a)\n\n(b)\n\n(c)\n\nBarbados;\n\nany state within the CARICOM Single Market and Economy;\n\nthe Republic of Ireland;\n\n(d)\n\nthe United States of America;\n\n(e)\n\nany state within the Commonwealth; or\n\n(f)\n\nany other country approved by the Minister.\n\n2.(1)\nin Government securities.\n\nSubject to subparagraph (2), moneys from the Fund may be invested\n\nWhere an investment is made outside the CARICOM Single Market and\n\n(2)\nEconomy\n\n(a)\n\n(b)\n\nthe investment shall not exceed 40 per cent of the total Fund; and\n\nthe  moneys  payable  in  respect  of  Government  securities  must  be\npayable in the currency of the United States of America.\n\n\fCATASTROPHE FUND BILL, 2020\n\nEXPLANATORY MEMORANDUM\n\nThe Bill would provide for a fund, to be known as the Catastrophe Fund, to\nprovide financial aid to eligible persons and qualifying in need of such aid as a\nresult of a catastrophe.\n\nClause 1:\n\nprovides the short title.\n\nClause 2:\n\ndefines certain terms used in the Bill.\n\nClause 3:\n\nClause 4:\n\nClause 5:\n\nClause 6:\n\nClause 7:\n\nprovides for the continued existence of the Catastrophe Fund\nestablished under the Catastrophe Fund Act, Cap. 39D which\nis to be repealed.\n\nexplains that the purpose of the Catastrophe Fund is to provide\nfinancial  aid  to  eligible  persons  and  qualifying  businesses\naffected by a catastrophe.\n\ndescribes, by reference to the First Schedule, the persons who\ncan make a claim for financial aid, and provides for making\nof claims\n\nestablishes two committees to consider claims for financial\naid and provides for the composition of the committees in the\nSecond Schedule.\n\nprovides for the management of the fund and the investment\nof  money  from  the  fund  in  accordance  with  the  Third\nSchedule.\n\nClause 8:\n\nmandates the keeping of proper accounts and other records on\nthe fund.\n\ni\n\n\fCatastrophe Fund Bill, 2020\n\nClause 9:\n\nrequires reports to be prepared on the accounts and activities\nof the fund.\n\nClause 10:\n\nprovides for the reports to be laid in Parliament.\n\nClause 11:\n\nmakes it an offence to supply false or incomplete information\nto obtain financial aid.\n\nClause 12:\n\nprovides for the making of Regulations.\n\nClause 13:\n\nallows for the Minister to amend the Schedules.\n\nClause 14:\n\nrepeals the Catastrophe Fund Act, Cap. 39D.\n\nii\n\n"
}