{
  "bill_id": 497,
  "slug": "income-tax-amendment-no2-bill-2020",
  "title": "Income Tax (Amendment) (No.2) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/6a36f8b75a34e1bae6fedf29e58717b9.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-06-10",
  "first_reading": "2020-06-10",
  "gazette_date": "2020-06-04",
  "markdown": "2020-05-27\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Income Tax Act, Cap. 73 to make provision for\n\nchanges in the taxation of life insurance companies.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of section 8 of Cap. 73\n\nAmendment of section 10 of Cap. 73\n\nAmendment of section 19 of Cap. 73\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Income Tax Act, Cap. 73 to make provision for changes\n\nin the taxation of life insurance companies.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n2020.\n\nThis Act may be cited as the Income Tax (Amendment) (No. 2) Act,\n\nAmendment of section 8 of Cap. 73\n\n2.\nthe principal Act, is amended in subsection (1) by\n\nSection 8 of the Income Tax Act, Cap. 73, in this Act referred to as\n\n(a)\n\ndeleting  the  full  stop  appearing  at  the  end  of  paragraph  (p)  and\nsubstituting a semi-colon; and\n\n(b)\n\ninserting immediately after paragraph (p) the following:\n\n“(q)\n\nwith  effect  from  income  year  2020,  in  the  case  of  a  life\ninsurance company, the amount of a decrease in the actuarial\nreserves stated in the accounts of that life insurance company\nin the income year.”.\n\nAmendment of section 10 of Cap. 73\n\n3.\n\nSection 10 of the principal Act is amended\n\n(a)\n\nin subsection (1) by\n\n(i)\n\ndeleting the full stop appearing at the end of paragraph (q) and\nsubstituting a semi-colon; and\n\n(ii)\n\ninserting immediately after paragraph (q) the following:\n\n“(r)\n\nwith  effect  from  income  year  2020,  in  the  case  of  a  life\ninsurance company, the amount of an increase in the actuarial\nreserves stated in the accounts of that life insurance company\nin the income year, where that amount does not exceed the\nappropriate amount;\n\n\f5\n\n(s)\n\nwith effect from income year 2020, where the amount of an\nincrease in the actuarial reserves claimed by a life insurance\ncompany in an income year exceeds the appropriate amount\nthen,  in  calculating  the  assessable  income  of  that  life\ninsurance company no amount shall be taken of the amount\nof the excess claimed.”; and\n\n(b)\n\nby inserting immediately after subsection (3) the following:\n\n“(4)\nFor  the  purposes  of  paragraphs  (r)  and  (s)  of  subsection  (1),\n“appropriate amount” means the amount of an increase in the actuarial\nreserves in the income year that is not excessive.\n\n(5)\nIn determining the “appropriate amount” referred to in subsection\n(4), an actuary appointed in accordance with section 45 of the Insurance\nAct, Cap. 310 shall support the determination with a written opinion\nthat\n\n(a)\n\n(b)\n\n(c)\n\nfollows the actuarial standards recognised in Barbados;\n\nstates the circumstances prevailing at the time at which the\nopinion was adopted; and\n\nincludes  no  more  than  a  reasonable  margin  that  takes  the\nfollowing into account:\n\n(i)\n\n(ii)\n\nthe nature or type of risks to which the actuarial reserves\nof a life insurance company are exposed; and\n\nthe uncertainty associated with the risks referred to in\nsubparagraph (i).”.\n\nAmendment of section 19 of Cap. 73\n\n4.\n\nSection 19 of the principal Act is amended\n\n(a)\n\nby deleting subsection (4) and substituting the following:\n\n\f6\n\n“(4)\nWith  effect  from  income  year  2020,  in  the  case  of  the  life\ninsurance  business  of  a  resident  insurance  company,  the  assessable\nincome  of  that  company  shall  be  calculated  on  the  basis  of  its  net\nincome.”;\n\n(b)\n\nby deleting subsection (5) and substituting the following:\n\nWith  effect  from  income  year  2020,  in  the  case  of  the  life\n“(5)\ninsurance  business  of  a  non-resident  company  carried  on  through  a\nbranch in Barbados, the assessable income of that company shall be\ncalculated on the basis of its net income attributable to the branch.”;\n\n(c)\n\nby inserting immediately after subsection (5) the following:\n\n“(5A)\nWith effect from income year 2020, where an insurance company\nseeks  to  make  a  mark-to-market  election  for  securities,  equities  and\nlong  term  derivative  contracts  that  company  shall  notify  the\nCommissioner in writing on or before its filing due date for the taxation\nyear in respect of which such election is applicable.\n\n(5B)\nWhere an insurance company makes a mark-to-market election\nfor securities, equities and long term derivative contracts pursuant to\nsubsection  5(A),  that  election  shall  be  irrevocable  unless  otherwise\nagreed by the Minister.\n\nA life insurance company may be irrevocably categorised as a\n(5C)\nClass  1  or  a  Class  2  licensee  as  defined  by  the  Insurance  Act,\nCap. 310, subject to the approval of the Financial Services Commission,\nunless the business undertaken changes significantly.”; and\n\n(d)\n\nin subsection (13) by inserting in the appropriate alphabetical order\nthe following:\n\n“ “derivative contract” means an agreement or an instrument that is\n\n(a)\n\na swap agreement;\n\n\f7\n\n(b)\n\na forward purchase or a sale agreement;\n\n(c)\n\na forward rate agreement;\n\n(d)\n\na futures agreement;\n\n(e)\n\nan option agreement;\n\nor any other similar agreement and includes an agreement or an\ninstrument which derives its value from derivatives.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n"
}