{
  "bill_id": 502,
  "slug": "barbados-optional-savings-scheme-bill-2020-amended-20200617",
  "title": "Barbados Optional Savings Scheme Bill, 2020 (Amended 2020-06-17)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b8ad907a1d36f0089f9df1fdd80722b8.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-06-16",
  "first_reading": "2020-06-17",
  "gazette_date": "2020-06-15",
  "markdown": "2020-06-17\n\nBill as amended\n\nOBJECTS AND REASONS\n\nThis  Bill  would  provide  for  the  establishment  of  the  Barbados  Optional\nSavings Scheme for public officers, Members of Parliament, Members of the\nSenate and Government Consultants.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nEstablishment of Scheme\n\nApplication of the Act\n\nPurpose of Scheme, issuance of bonds and rate of interest\n\nPayment of Interest\n\nMonetary value of bonds\n\nMaximum value of bonds to pay public officers\n\nBonds to be tradeable and negotiable\n\n10.\n\nBank to be fiscal agent for the Government\n\n11.\n\nPublic Officer may opt to receive bonds\n\n12.\n\nBonds to be redeemable\n\n13.\n\nCentral Bank allowed to purchase bonds\n\n14.\n\nIssue of bonds to public officers\n\n15.\n\nPart payment of emoluments in bonds\n\n\f3\n\n16.\n\nPersons to whom this Act does not apply\n\n17.\n\nCommencement and duration\n\nFIRST SCHEDULE\n\nTerms and conditions for the issue of the bonds\n\nSECOND SCHEDULE\n\nTrading Terms\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to establish the Barbados Optional Savings Scheme.\n\nENACTED by the Parliament of Barbados in accordance with section 49 of\n\nthe Constitution as follows:\n\n\f6\n\nShort title\n\n1.\n2020.\n\nThis Act may be cited as the Barbados Optional Savings Scheme Act,\n\nInterpretation\n\n2.\n\nFor the purposes of this Act,\n\n“Bank”  means the Central Bank of Barbados;\n\n“bonds” means the Barbados Optional Savings Bonds issued under this Act;\n\n“emoluments” means in the case of\n\n(a)\n\n(b)\n\n(c)\n\npublic officers, salaries or wages, as the case may be;\n\nMembers of Parliament, salaries;\n\nMembers of the Senate, including the President and Deputy President,\nsalaries; and\n\n(d)\n\nGovernment Consultants on contract, monies paid as remuneration;\n\n“public  officer”  has  the  meaning  assigned  to  it  by  section  117(1)  of  the\n\nConstitution and includes\n\n(a)\n\nemployees of bodies corporate established by law for public purposes\nwhich are funded by money voted by Parliament;\n\n(b)\n\nMembers of Parliament;\n\n(c)\n\nMembers of the Senate, including the President and Deputy President;\n\n(d)\n\nGovernment Consultants;\n\n(e)\n\ntemporary employees;\n\n(f)\n\nAmbassadors,  High  Commissioners\nand\nrepresentatives of Barbados in any other country;\n\nother\n\nprincipal\n\n(g)\n\nall hourly, daily or weekly paid employees of the Crown;\n\n\f7\n\n(h)\n\nall contract officers in the service of the Crown;\n\n(i)\n\n(j)\n\nmembers of the Barbados Defence Force;\n\nthe Clerk, Deputy Clerk, Staff and other employees of Parliament; and\n\n(k)\n\nthe Ombudsman;\n\n“temporary employee” means a person other than a public officer who holds a\n\ntemporary office in the Public Service.\n\nEstablishment of Scheme\n\n3.\n\nThe Barbados Optional Savings Scheme is hereby established.\n\nApplication of the Act\n\n4.\n\nSubject to section 16, this Act applies to all public officers.\n\nPurpose of Scheme, issuance of bonds and rate of interest\n\nThe  purpose  of  the  Scheme  is  to  provide  a  vehicle  through  which\n5.(1)\npublic officers, may save a portion of their monthly emoluments, for a period of\n18 months by means of bonds.\n\nThe bonds referred to in subsection (1) shall be issued upon the terms and\n\n(2)\nconditions set out in the First Schedule.\n\n(3)\n\nThe bonds shall mature 4 years after the date of issue of each bond.\n\nPayment of Interest\n\n6.\nJuly.\n\nInterest accrued on the bonds is payable semi-annually in January and\n\nMonetary value of bonds\n\n7.\n$8.5 million.\n\nThe monetary value of bonds to be issued monthly shall be limited to\n\n\f8\n\nMaximum value of bonds to pay public officers\n\nThe maximum value of bonds to be issued for the purpose of paying\n8.\na portion of the emoluments of public officers or temporary employees shall be\n25 per cent.\n\nBonds to be tradeable and negotiable\n\n9.(1)\nsubject to the terms and conditions set out in the Second Schedule.\n\nA bond shall be a tradeable and negotiable instrument and shall be\n\nNothing in the Income Tax Act, Cap. 73, the Stamp Duty Act, Cap. 91 or\n(2)\nany enactment relating to the imposition of a tax or any impost on bonds, shall\napply to bonds issued under this Act.\n\nBank to be fiscal agent for the Government\n\nThe Bank shall be the fiscal agent of the bonds and shall perform all\n10.\nfunctions  necessary  in  relation  to  dealing  with  bonds,  including  trading  in\nsecondary markets.\n\nPublic Officer may opt to receive bonds\n\n11.(1)\nindicate whether he wishes the bonds for 18 months or for a shorter period.\n\nA public officer on signing the form referred to in section 14 may\n\nA public officer referred to in subsection (1) who wishes to vary the period\n(2)\nstated in the form referred to in that subsection may, at least 14 days but no more\nthan 28 days prior to the date on which his emolument is due to be paid in any\nmonth, advise the Accountant General through his head of department that he\nwishes to receive his full bond allocation in cash or a stated portion of the bond\nallocation in cash for that month or for the shorter period.\n\nNotwithstanding subsection (1), a public officer who is paid at a period\n(3)\nother  than  monthly  shall  advise  the  Accountant  General  through  his  head  of\ndepartment at least 14 days but no more than 28 days prior to the date on which\n\n\f9\n\nhis  emolument  is  due  to  be  paid  that  he  wishes  to  receive  his  full  bond\nallocation in cash or a stated portion of the bond allocation in cash.\n\nBonds to be redeemable\n\n12.\nthe date of first issue.\n\nA bond may be redeemed at par by the bondholder 24 months after\n\nCentral Bank allowed to purchase bonds\n\n13.(1)\nCentral Bank of Barbados Act, Cap. 323C,\n\nNotwithstanding  any  provision  to  the  contrary  contained  in  the\n\n(a)\n\n(b)\n\nthe Bank may purchase and otherwise trade in bonds; and\n\nany person approved by the Bank may purchase from and otherwise\ntrade in bonds with the Bank.\n\nPurchase of bonds by the Bank pursuant to subsection (1) shall cease no\n\n(2)\nlater than December 31st 2021.\n\nIssue of bonds to public officers\n\n14.(1)\nevery public officer.\n\nEvery month or other pay period a bond will be issued in the name of\n\nEvery public officer who wishes to receive his bond allocation shall so\n\n(2)\nindicate in writing in the form approved by the Minister.\n\nEvery public officer who does not wish to receive his bond allocation shall\n\n(3)\nso indicate in writing in the form approved by the Minister.\n\nFor the avoidance of doubt and in the interest of clarity, where a public\n(4)\nofficer fails or refuses to indicate in writing whether he wishes to receive a bond\nallocation or not he shall be deemed to have chosen to receive his bond allocation\nin cash.\n\n\f10\n\nPart payment of emoluments in bonds\n\n15.\nNotwithstanding any enactment to the contrary, for the purposes of\nthis Act a portion of a public officers emoluments may be paid in bonds with the\nconsent of the public officer.\n\nPersons to whom this Act does not apply\n\n16.(1)\nThis Act does not apply to a public officer whose annual emoluments\nafter deduction of income tax and national insurance is $36 000 or less, unless\nhe indicates in writing in the form approved by the Minister that he wishes to\nreceive a stated portion of his emoluments in bonds and section 11(2) shall apply\naccordingly.\n\n(2)\nThis Act does not apply to a Government pensioner unless he advises the\nAccountant General in writing that he wishes to receive a stated portion of his\npension in bonds.\n\n(3)\nA public officer and a Government pensioner mentioned in subsections (1)\nand (2) respectively shall not receive bonds where the limit of $8.5 million as\nstated in section 7 has been fully subscribed.\n\n(4)\n\nAny request for an allocation of bonds\n\n(a)\n\n(b)\n\nby a public officer in excess of his bond allocation;\n\nby a person referred to in subsection (1) or (2)\n\nshall be allotted on a pro rata basis.\n\n(5)  For  the  purposes  of  this  Act,“Government  pensioner”  means  a  public\nofficer who has retired from the public service and who is in receipt of a pension\nfrom the Consolidated Fund.\n\nCommencement and duration\n\n17.(1)\nshall cease to have effect on the 31st day of January, 2022.\n\nThis Act shall come into operation on the 1st day of July, 2020 and\n\n\f(2)\n\nNotwithstanding subsection (1),\n\n11\n\n(a)\n\n(b)\n\nany right, privilege, obligation or liability acquired, accrued or incurred\nunder this Act;\n\nany investigation, legal proceeding or remedy in respect of any such\nright, privilege, obligation or liability, as aforesaid\n\nis  not  affected  by  the  cessation  of  this  Act  and  any  such  investigation,  legal\nproceeding  or  remedy  may  be  instituted,  continued  or  enforced  and  any  such\npenalty, forfeiture or punishment may be imposed, as if this Act did not cease to\nhave effect.\n\n\f12\n\n L.R.O. 1998FIRST SCHEDULE(Section 5(2))Terms and conditions for the issue of the bondsThe terms of the Bond are as follows:1. A 4-year bond with a 5 per cent interest rate per annum.2. Interest accrued shall be payable semi-annually in January and July and principal paid 4 years from date of issuance of bond.3. No withholding tax on the interest earned.4. Stamp duty shall not be payable.5. Bonds are fully tradable in the Secondary Bond Market.6. Protected bonds - As with the domestic debt restructuring of 2018 in which savings bonds issued pursuant to the Debt Holder (Approval of Debt Restructuring) Act, 2018 (Act 2018-24) were not restructured, these bonds are protected from any restructuring.7. Bonds will have an early redemption feature (after 24 months of date of issue) which will allow individuals to redeem their bonds early.Annual Net SalaryUnder $36,000$36,001 - $50,000$50,001 - $100,000Over $100,000Government PensionersPercentage of net takehome pay given in bonds0%(Can choose any percentage up to 25%)7%12%17%0%(Can choose any percentage up to 25%)\f13\n\nSECOND SCHEDULE\n\nTrading Terms\n\n(Section 9)\n\n1.\nThereafter, market conditions apply.\n\nBonds  are  to  be  traded  at  par  during  each  month  of  issuance.\n\n2.\n\nEach public officer may\n\n(a)\n\n(b)\n\ndetermine who can purchase his bonds, provided the buyer is registered\nat the Central Bank; or\n\nopt to place the bonds in a pool held by the Central Bank for onward\ntrading in the secondary bond market.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n"
}