{
  "bill_id": 503,
  "slug": "severance-payments-amendment-bill-2020",
  "title": "Severance Payments (Amendment)  Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/c333b630ecad838f87ebf4682620ca65.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-06-16",
  "first_reading": "2020-06-17",
  "gazette_date": null,
  "markdown": "Amended 2020-06-12 @11:35\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Severance Payments Act, Cap. 355A.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nApplication of Act\n\nAmendment of the Severance Payments Act\n\nAmendment of Cap. 355A\n\nAmendment of Fifth Schedule to Cap. 355A\n\nNon-application of Tribunal\n\nSuspension of sections 6 and 7 and paragraph 7 of the Fifth Schedule to\nCap. 355A\n\nPreservation of rights\n\nRevival of sections 6 and 7 and paragraph 7 of the Fifth Schedule to Cap.\n355A\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nCommencement and duration of amendments to Cap. 355A\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Severance Payments Act, Cap. 355A.\n\nENACTED by the Parliament of Barbados in accordance with section 49 of\n\nthe Constitution as follows:\n\n\f4\n\nShort title\n\n1.\n2020.\n\nThis Act may be cited as the Severance Payments (Amendment) Act,\n\nApplication of Act\n\nThe  amendments  herein  made  to  the  Severance  Payments  Act,\n2.\nCap. 355A, are in consequence of the public health emergency declared by the\nProclamation made by the Governor General on 28th day of March, 2020.\n\nAmendment of the Severance Payments Act, Cap. 355A\n\nThe Severance Payments Act, Cap. 355A, in this Act referred to as\n3.\nthe  principal  Act,  is  amended  by  inserting  immediately  after  section  6  the\nfollowing new sections:\n\n“Temporary right to severance payment for lay-off or short-\ntime\n\n6A.(1)\n\nWhere an employee has been laid off or kept on short-time\n\n(a)\n\ncommencing at any time between the 1st day of March, 2020\nand  the  30th  day  of  April,  2020  that  employee  will  not  be\nentitled to claim severance payment, unless he had been laid\noff or kept on short-time for 22 consecutive weeks; or\n\n(b)\n\nfor a series of 18 or more weeks within a period of 24 weeks,\n\nthen,  if  the  employee,  within  4  weeks  after  the  relevant  date,  gives\nnotice in writing to his employer indicating (in whatsoever terms) his\nintention to claim a severance payment in respect of the lay-off or short-\ntime (in this section and section 7 referred to as \"a notice of intention\nto claim\") the employee is, subject to this section, entitled to a severance\npayment for being laid off or kept on short-time.\n\n\f5\n\nWhere an employee had been laid off or kept on short-time before\n\n(2)\nthe 1st day of June, 2020 as a result of\n\n(a)\n\n(b)\n\nthe restrictions on international travel due to the declaration\nof a public health emergency; and\n\nthe  consequent  restriction  in  the  operation  of  business\nimposed  by  the  making  of  the  Emergency  Management\n(Covid-19) Curfew (Nos. 1-5) Directives, 2020\n\nthat employee shall not be entitled to claim severance, unless he had\nbeen laid off or kept on short-time for 22 consecutive weeks or for a\nseries of 18 or more weeks within a period of 24 weeks.\n\nFor the purposes of this section“the relevant date” in relation to\n(3)\na notice of intention to claim the right to a severance payment pursuant\nto such notice means the date on which the last of the 22 consecutive\nweeks or the series of 18 or more weeks referred in subsection (2), as\nthe case may be, came to an end.\n\n(4)\n\nWhere an employee has given notice of intention to claim\n\n(a)\n\n(b)\n\nhe is not entitled to a severance payment in pursuance of that\nnotice unless he terminated his contract of employment by a\nweek's notice which (whether given before or after or at the\nsame time as the notice of intention to claim) is given before\nthe  end  of  the  period  allowed  for  the  purposes  of  this\nparagraph (as specified in subsection (5) of section 7); and\n\nhe is not entitled to a severance payment in pursuance of the\nnotice of intention to claim if he is dismissed by his employer\n(but without prejudice to any right to a severance payment\nbecause of the dismissal).\n\nIf an employee is required by his contract of employment to give\n(5)\nmore than a week's notice to terminate the contract, the reference in\nparagraph (a) of subsection (4) to a week's notice shall be construed as\na reference to the minimum notice which is so required to give.\n\n\f6\n\n(6)\nSubject  to  subsection  (7),  an  employee  is  not  entitled  to  a\nseverance payment in pursuance of a notice of intention to claim if, on\nthe date of service of that notice, it was reasonably to be expected that\nthe employee (if he continued to be employed by the same employer)\nwould, not later than 4 weeks after that date, enter upon a period of\nemployment of not less than 24 weeks during which he would not be\nlaid off or kept on short-time for any week.\n\nSubsection  (6)  shall  not  apply  unless,  within  7  days  after  the\n(7)\nservice of the notice of intention to claim, the employer gives to the\nemployee  notice  in  writing  (in  section  7  referred  to  as  a  \"counter-\nnotice\")  that  he  will  contest  any  liability  to  pay  to  him  a  severance\npayment in pursuance of the notice of intention to claim.\n\nFor the purposes of this section and section 7, \"week\" in relation\n(8)\nto an employee whose remuneration is calculated weekly by a week\nending on a day other than Saturday, means a week ending on that other\nday, and, in relation to any other employee, means a week ending with\nSaturday.\n\nMinister may make Order\n\n6B.\ninvestigating and settling claims.”.\n\nThe  Minister  may  by  order  prescribe  the  procedure  for\n\nAmendment of Cap. 355A\n\n4.\n7 the following new section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Temporary supplementary provisions as to severance\npayments in respect of lay-off or short-time\n\n7A.(1)\nWhere, in a case where an employee gives notice of intention\nto  claim  and  the  employer  gives  a  counter-notice,  the  employee\n\n\f7\n\ncontinues or has continued, during the next 4 weeks after the date of\nservice of the notice of intention to claim, to be employed by the same\nemployer, and he is or has been laid off or kept on short-time for each\nof those weeks, it shall be conclusively presumed that the condition\nspecified in subsection (6) of section 6A was not fulfilled.\n\nFor  the  purposes  of  section  6A(1)  and  subsection  (1),  it  is\n(2)\nimmaterial whether the 22 consecutive weeks referred to in paragraph\n(a) of section 6A(1) or the series of 18 or more weeks referred to in\nparagraph  (b)  of  that  section  consist  wholly  of  weeks  for  which  the\nemployee is laid off or wholly of weeks for which he is kept on short-\ntime or partly of one and partly of the other.\n\nFor the purposes mentioned in subsection (2), no account shall\n(3)\nbe taken of any week for which an employee is laid off or kept on short-\ntime where the lay-off or short-time is wholly or mainly attributable to\na strike or a lock-out, whether the strike or lock-out is in the trade or\nindustry in which the employee is employed or not and whether it is in\nBarbados or elsewhere.\n\nWhere the employer gives a counter-notice within 7 days after\n(4)\nthe service of a notice of intention to claim and does not withdraw the\ncounter-notice by a subsequent notice in writing, the employee shall\nnot be entitled to a severance payment in pursuance of the notice of\nintention to claim except in accordance with a decision of a tribunal.\n\nThe  period  allowed  for  the  purposes  of  paragraph  (a)  of\n\n(5)\nsubsection (4) of section 6A is as follows, that is to say\n\n(a)\n\n(b)\n\nif the employer does not give a counter-notice within 7 days\nafter the service of the notice of intention to claim, that period\nis 3 weeks after the end of those 7 days;\n\nif the employer gives a counter-notice within those 7 days,\nbut withdraws it by a subsequent notice in writing, that period\nis 3 weeks after the service of the notice of withdrawal;\n\n\f8\n\n(c)\n\nif the employer gives a counter-notice within those 7 days\nand does not so withdraw it and a question as to the right of\nthe  employee  to  a  severance  payment  in  pursuance  of  the\nnotice of intention to claim is referred to a tribunal, that period\nis 3 weeks after the tribunal has notified to the employee its\ndecision on that reference.\n\nFor the purposes of paragraph (c) of subsection (5), no account\n(6)\nshall be taken of any appeal against the decision of the tribunal or of\nany proceedings or decision in consequence of such an appeal.”.\n\nAmendment of Fifth Schedule to Cap. 355A\n\n5.\nimmediately after paragraph 7 the following new paragraph:\n\nThe  Fifth  Schedule  to  the  principal  Act  is  amended  by  inserting\n\n“7A.\nWhere the employee has before the death of the deceased\nemployer been laid off or kept on short-time for one or more weeks,\nbut has not given to the deceased employer notice of intention to claim,\nthen if after the death of the deceased employer\n\n(a)\n\n(b)\n\nhis contract of employment is renewed, or he is re-engaged\nunder a new contract, as mentioned in sub-paragraphs (a) and\n(b) of paragraph 3; and\n\nafter the renewal or re-engagement, he is laid off or kept on\nshort-time  for  one  or  more  weeks  by  the  personal\nrepresentative of the deceased employer,\n\nsections 6A and 7A shall apply as if the week in which the deceased\nemployer died and the first week of the employee’s employment by the\npersonal representative were consecutive weeks, and any reference in\nthose sections, except in subsection (6) of section 6A, to 22 weeks or\n24 weeks shall be construed accordingly.”.\n\n\f9\n\nNon-application of Tribunal\n\n6.\nthese amendments.\n\nSection 38 of the principal Act does not apply to claims made under\n\nSuspension of sections 6 and 7 and paragraph 7 of the Fifth Schedule\nto Cap. 355A\n\n7.\n\nThe amendments made to Cap. 355A\n\n(a)\n\nshall suspend the operation of section 6, section 7 and paragraph 7\nof the Fifth Schedule for the duration of the amendments, that is to\nsay,  from  the  1st  day  of  June,  2020  to  the  31st  day  of  July,  2020,\ninclusive; and\n\n(b)\n\nmentioned in section 5, shall apply and operate in place of and in the\nstead of the suspended provisions of Cap. 355A.\n\nPreservation of rights\n\n8.\nNotwithstanding  section  7,  where  the  right  of  an  employee  other\nthan an employee referred to in section 6A(1) and 6A(2), to make a claim for\nseverance payment accrued during the period mentioned in section 7 the right\nis not affected by anything contained in this amendment, but is preserved and\nmay be exercised at any time after the 31st day of July, 2020.\n\nRevival of sections 6 and 7 and paragraph 7 of the Fifth Schedule to\nCap. 355A\n\nWith effect from the day immediately succeeding the 31st day of July,\n9.\n2020, section 6, section 7 and paragraph 7 of the Fifth Schedule shall resume\ntheir operation and shall continue to operate with the same force and to the\nsame effect as they had operated on the day immediately preceding the 1st day\nof June, 2020.\n\n\f10\n\nCommencement and duration of amendments to Cap. 355A\n\n10.\nThe  amendments  made  by  this  Act  to  the  principal  Act  shall  be\ndeemed to have come into operation on the 1st day of June, 2020 and shall cease\nto have effect on the 31st day of July, 2020.\n\n"
}