{
  "bill_id": 506,
  "slug": "resolution-re-land-at-belleplaine-st-andrew",
  "title": "Resolution re Land at Belleplaine St. Andrew",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/9e1b1ea85a4236ccf99175c9dcc7db79.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-08-04",
  "first_reading": "2020-08-05",
  "gazette_date": null,
  "markdown": "2020-04-21\n\nPARLIAMENT\n\nRESOLVED  that  Parliament,  in  accordance  with  section  5  of  the  Land\n\nAcquisition  Act,  Cap.  228  approve  the  compulsory  acquisition  by  the  Crown  of  the  parcel  of\n\nland  together  with  the  building  thereon,  the  property  of  Valerie Angelique  Hamblin,  situate\n\nat  Belleplaine  in  the  parish  of  Saint Andrew  in  this  Island,  more  particularly  described  in  the\n\nSchedule hereto, for the public purposes of establishing a site of historic and heritage interest.\n\nAPPROVED by the House of Assembly this   day of\n\n  , Two\n\nThousand and Twenty.\n\nSpeaker\n\nAPPROVED by the Senate this\n\nday of\n\n , Two\n\nThousand and Twenty.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL THAT land the property of Valerie Angelique Hamblin situate at Belleplaine\n\nin  the  parish  of  Saint Andrew  in  this  Island  formerly  said  to  contain  by  estimation  4007.3\n\nsquare metres but by recent survey found to contain by admeasurement 4007.9 square metres or\n\nthereabouts Abutting and Bounding on lands now or formerly of Advance Technological Services,\n\non  lands  now  or  formerly  of  James  Foster,  on  the  public  road  known  as  Boys  School  Road\n\nleading to a cul-de-sac in one direction and to East Coast Road in another direction, on lands now\n\nor formerly of Gloria Moore and on another public road known as Highway 2 (Belleplaine) leading\n\nto East Coast Road in one direction and to St. Andrews Church in another direction or however\n\nelse the same may abut and bound as shown and delineated on a Plan certiﬁ ed on the 18th day\n\nof February, 2020 by Kevin R. Belgrave, Land Surveyor and recorded in the Lands and Surveys\n\nDepartment on the 5th day of March, 2020 as Plan No. 305/2020 together with the building thereon.\n\n\f3\n\nADDENDUM\n\nOn the 6th day of June,  2019, the Cabinet agreed to the acquisition of 4007.3 square\n\nmetres of land together with the building thereon, formerly the property of the late Dame Edna\n\nErmyntrude Bourne, as a place of historic interest.\n\nBy a recent survey, the said land is now found to contain by admeasurement 4007.9\n\nsquare metres as shown on a Plan certiﬁ ed on the 18th day of February, 2020 by Kevin R. Belgrave,\n\nLand Surveyor and recorded in the Lands and Surveys Department on the 5th day of March, 2020\n\nas Plan No. 305/2020.\n\nIn  accordance  with  the  provisions  of  section  5  of  the  Land  Acquisition  Act,\n\nCap. 228, the approval of Parliament is now sought for the compulsory acquisition of the parcel\n\nof  land  together  with  the  building  thereon  described  in  the  Schedule  to  this  Resolution  in\n\norder  that  the  public  purpose  set  out  in  the  Resolution  may  be  effected  and  that  the  Crown\n\nmay acquire an indefeasible title to the said parcel of land together with the building thereon.\n\n"
}