{
  "bill_id": 507,
  "slug": "utilities-regulation-amendment-bill-2020",
  "title": "Utilities Regulation (Amendment) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/97e268a1d188040b7f6a974b0118f51f.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-07-08",
  "first_reading": "2020-07-08",
  "gazette_date": "2020-07-13",
  "markdown": "26-05-2020\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Utilities Regulation Act, Cap. 282 to make provision\nfor  renewable  energy,  to  extend  the  functions  of  the  Commission  to  include\nrenewable energy producers and for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of section 2 of Cap. 282.\n\nAmendment of section 3 of Cap. 282\n\nInsertion of new Part IV A into Cap. 282\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Utilities Regulation Act, Cap. 282, to make provision\nfor renewable energy, to extend the functions of the Commission to include\nrenewable energy producers and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n2020.\n\nThis Act may be cited as the Utilities Regulation (Amendment) Act,\n\nAmendment of section 2 of Cap. 282.\n\nSection 2 of the Utilities Regulation Act, Cap. 282 in this Act referred\n2.\nto as the principal Act, is amended by deleting the definition of “rates” and\nsubstituting the following:\n\n“  “rates” include\n\n(a)\n\n(b)\n\nevery rate, fare, toll, charge, rental or other compensation of\na service provider or renewable energy producer;\n\na rule, practice, measurement, classification or contract of a\nservice provider or renewable energy producer relating to a\nrate; and\n\n(c)\n\na schedule or tariff respecting a rate;”.\n\nAmendment of section 3 of Cap. 282\n\n3.\nnew subsection immediately after subsection (2):\n\nSection 3 of the principal Act is amended by inserting the following\n\n“(2A)\nIn performing its functions under subsection (1), the Commission\nmay  request  a  service  provider  to  provide  the  Commission  with\ninformation  relating  to  its  operations,  finances  or  such  other\ninformation as the Commission may consider necessary to perform its\nfunctions.”.\n\n\f5\n\nInsertion of new Part IV A into Cap. 282\n\n4.\nimmediately after Part IV:\n\nThe principal Act is amended by inserting the following new Part\n\n“PART IV A\n\nRenewable energy\n\nInterpretation\n\n24A.\n\nFor the purposes of this Part,\n\n“interconnection agreement” means an agreement which establishes the\nterms and conditions under which a distributed generation system\nthat produces or stores energy from a renewable energy resource\nconnects to the public grid;\n\n“public  grid”  means  the  grid  to  which  the  public  has  access  for  the\n\nsupply of electricity;\n\n“renewable energy producer” includes a generator, distributor or person\nwho  stores  and  supplies  electricity  generated  from  a  renewable\nenergy resource for sale to the public grid;\n\n“renewable  energy  resource”  means  an  energy  resource  other  than\nfossil fuel that is naturally replenished on a human timescale and\nincludes but is not limited to wave and ocean energy, wind, solar\nand biomass.\n\n\f6\n\nFunctions of the Commission in respect of renewable energy\nand energy storage\n\n24B.(1)\nThe functions of the Commission, in relation to a renewable\nenergy producer entering into an interconnection agreement or other\nagreement to supply electricity to the public grid, are to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nestablish principles for arriving at the rates to be charged;\n\nset the terms and conditions of the agreements;\n\nset the maximum rates to be charged under the agreements;\nand\n\ndirect renewable energy producers to submit the proposals\nfor  the  rates  and  terms  and  conditions  relating  to  their\nagreements.\n\nIn performing its functions under subsection (1), the Commission\n(2)\nshall  consult  with  renewable  energy  producers,  representatives  of\nconsumer  interest  groups  and  other  interested  parties  and  shall  have\nregard to\n\n(a)\n\n(b)\n\n(c)\n\nthe national energy policy;\n\nthe national environmental policy;\n\nthe requirement to promote renewable energy and to enhance\nthe security, affordability, safety and reliability of the supply\nof electricity.\n\nIn  establishing  the  principles  referred  to  in  paragraph  (a)  of\n\n(3)\nsubsection (1) the Commission shall have regard to\n\n(a)\n\nthe promotion of efficiency on the part of renewable energy\nproducers;\n\n\f7\n\n(b)\n\nensuring that an efficient renewable energy producer will be\nable to finance its functions by earning a reasonable return\non capital;\n\n(c)\n\nsuch  other  matters  as  the  Commission  may  consider\nappropriate.\n\nThe  functions  of  the  Commission,  in  relation  to  a  renewable\n\n(4)\nenergy producer storing energy that is produced by its plant, are to\n\n(a)\n\n(b)\n\nset the maximum rates to be charged; and\n\nestablish guidelines for interconnection.\n\nIn  performing  its  functions  under  subsections  (1)  and  (4),  the\n(5)\nCommission shall request a renewable energy producer to provide the\nCommission  with  information  relating  to  its  operations,  finances  or\nsuch other information as the Commission may consider necessary to\nperform its functions.”.\n\n\f8\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n"
}