{
  "bill_id": 508,
  "slug": "fair-trading-commission-amendment-bill-2020",
  "title": "Fair Trading Commission (Amendment) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/7b82aa8c6767abb84e297430eccbe4fe.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-07-08",
  "first_reading": "2020-07-08",
  "gazette_date": "2020-07-13",
  "markdown": "26-05-2020\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Fair Trading Commission Act, Cap. 326B to extend\n\nthe functions of the Commission to include renewable energy producers.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of the long title of Cap. 326B\n\nAmendment of section 2 of Cap. 326B\n\nAmendment of section 4 of Cap. 326B\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Fair Trading Commission Act, Cap. 326B, to extend\n\nthe functions of the Commission to include renewable energy producers.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nAct, 2020.\n\nThis Act may be cited as the Fair Trading Commission (Amendment)\n\nAmendment of the long title of Cap. 326B\n\nThe Fair Trading Commission Act, Cap. 326B, in this Act referred\n2.\nto as the principal Act is amended by deleting the long title and substituting the\nfollowing:\n\n“An Act to provide for the establishment of a Fair Trading Commission\nto  safeguard  the  interests  of  consumers,  to  regulate  utility  services\nsupplied by service providers, to monitor and investigate the conduct\nof  service  providers,  renewable  energy  producers  and  business\nenterprises,  to  promote  and  maintain  effective  competition  in  the\neconomy, and for related matters.”.\n\nAmendment of section 2 of Cap. 326B\n\n3.\n\nSection 2 of the principal Act is amended by\n\n(a)\n\ndeleting the definition of “rates” and substituting the following:\n\n“ “rates” include\n\n(a)\n\n(b)\n\nevery rate, fare, toll, charge, rental or other compensation of\na service provider or renewable energy producer;\n\na rule, practice, measurement, classification or contract of a\nservice provider or renewable energy producer relating to a\nrate; and\n\n(c)\n\na schedule or tariff respecting a rate;”;\n\n\f5\n\n(b)\n\ninserting  in  the  appropriate  alphabetical  order  the  following\ndefinitions:\n\n“ “independent power producer” means a commercial entity other than\n\nan electric utility, which\n\n(a)\n\n(b)\n\nproduces or stores; and\n\nsupplies\n\nelectricity using renewable energy resources for sale to the public\ngrid;\n\n“public grid ” means the grid to which the public has access for the\n\nsupply of electricity;\n\n“renewable energy producer” includes a generator, distributor or person\nwho  stores  and  supplies  electricity  generated  from  a  renewable\nenergy resource for sale to the public grid;”.\n\nAmendment of section 4 of Cap. 326B\n\n4.\n\nSection 4 of the principal Act is amended\n\n(a)\n\nin  subsection  (2)  by  inserting  the  words  “,renewable  energy\nproducers” immediately after the words “service providers”;\n\n(b)\n\nby deleting subsection (3) and substituting the following:\n\nThe Commission shall, in the performance of its functions and\n\n“(3)\nin pursuance of the objectives set out in subsections (1) and (2),\n\n(a)\n\n(b)\n\nestablish principles for arriving at the rates to be charged by\nservice providers and renewable energy producers;\n\nset the maximum rates to be charged by service providers and\nrenewable energy producers;\n\n\f6\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(i)\n\nmonitor the rates charged by service providers and renewable\nenergy producers to ensure compliance;\n\ndetermine  the  standards  of  service  applicable  to  service\nproviders and independent power producers;\n\nmonitor  the  standards  of  service  supplied  by  service\nproviders  and  independent  power  producers  to  ensure\ncompliance;\n\ncarry  out  periodic  reviews  of  the  rates  and  principles  for\nsetting  rates  of  service  providers  and  renewable  energy\nproducers;\n\ncarry out periodic reviews of standards of service of service\nproviders and independent power producers;\n\nhear  and  determine  complaints  by  consumers  regarding\nbillings  and  the  standards  of  service  supplied  by  service\nproviders;\n\n(j)\n\nkeep commercial activities under review;\n\n(k)\n\nreceive and evaluate consumer complaints;\n\n(l)\n\neducate and assist consumers in resolving complaints; and\n\n(m)\n\ninvestigate whether business enterprises are engaging in anti-\ncompetitive business practices.”;\n\n(c)\n\nby deleting subsection (4) and substituting the following:\n\n“(4)\nThe  Commission  shall,  in  performing  its  functions  under\nsubsection (3)(a), (b), (d), (f) and (g), consult with service providers,\nrenewable  energy  producers,  representatives  of  consumer  interest\ngroups and other parties that have an interest in the matter before it.”.\n\n(d)\n\nby  inserting  the  following  new  subsection  immediately  after\nsubsection (4):\n\n\f7\n\nThe  Commission  shall,  in  performing  its  functions  under\n\n“(4A)\nsubsection (3)(a), (b),(c), (d), (e),(f) and (g), request\n\n(a)\n\n(b)\n\n(c)\n\na service provider;\n\na renewable energy producer; or\n\na licensee under the Telecommunications Act, Cap. 282B or\nthe Electric Light and Power Act (2013-21)\n\nto provide the Commission with information relating to its operations,\nfinances or such other information as the Commission may consider\nnecessary to perform its functions.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n"
}