{
  "bill_id": 509,
  "slug": "resolution-re-land-at-friendship-st-michael",
  "title": "Resolution re Land at Friendship, St. Michael",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/23bc58c0673ae78a112648e58c015494.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-08-04",
  "first_reading": "2020-08-05",
  "gazette_date": null,
  "markdown": "2020-02-04\n\nPARLIAMENT\n\nRESOLVED that Parliament in accordance with section 5 of the Land Acquisition\n\nAct, Cap. 228, approve the compulsory acquisition by the Crown of the parcels of land situate\n\nat  Friendship  in  the  parish  of  Saint  Michael  in  this  Island  more  particularly  described  in  the\n\nSchedules hereto for the public purpose, namely the development of a National Botanical Garden.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and Twenty.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                                               , Two\n\nthousand and Twenty.\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL  THAT  land  the  property  of  Beryl  Padmore  c/o  Norman  Padmore  situate  at\n\nWaterford and Friendship Plantation in the parish of Saint Michael in this Island  containing by\n\nadmeasurement 2133.4 square metres or thereabouts Abutting and Bounding on lands now or\n\nlate of Royston Gill on lands now or formerly of Double “O” Limited (Lot 21) and on lands now\n\nor formerly of the Barbados Government (Botanical Gardens) on two sides or however else the\n\nsame may abut and bound as shown and delineated on a Plan certiﬁ ed on the 30th day of August,\n\n2019 by Anderson R. Alleyne, Land Surveyor and recorded in the Lands and Surveys Department\n\non the 3rd day of September, 2019 as Plan No. 1099/2019.\n\n\f3\n\nSECOND SCHEDULE\n\nALL  THAT  land  the  property  of  Royston  Gill  situate  at  Waterford  and  Friendship\n\nPlantation in the parish of Saint Michael in this Island containing by admeasurement 2529.3\n\nsquare metres or thereabouts Abutting and Bounding on lands now or late of Valorie Padmore\n\nc/o Margaret Best on lands now or formerly of Double “O” Limited (Lot 21) on lands now or late\n\nof Beryl Padmore c/o Norman Padmore on lands now or formerly of the Barbados Government\n\n(Botanical Gardens) or however else the same may abut and bound as shown and delineated on a\n\nPlan certiﬁ ed on the 30th day of August, 2019 by Anderson R. Alleyne, Land Surveyor and recorded\n\nin the Lands and Surveys Department on the 3rd day of September, 2019 as Plan No. 1099/2019.\n\n\f4\n\n THIRD SCHEDULE\n\nALL  THAT  land  the  property  of  Valorie  Padmore  c/o  Margaret  Best  situate  at\n\nWaterford and Friendship Plantation in the parish of Saint Michael in this Island containing by\n\nadmeasurement 2133.4 square metres or thereabouts Abutting and Bounding on lands now or\n\nformerly of Friendship Plantation c/o Fred Bethell on lands now or formerly of Double “O”\n\nLimited (Lot 21) on lands now or late of Royston Gill and on lands now or formerly of the Barbados\n\nGovernment (Botanical Gardens) or however else the same may abut and bound as shown and\n\ndelineated on a Plan certiﬁ ed on the 30th day of August, 2019 by Anderson R. Alleyne, Land Surveyor\n\nand recorded in the Lands and Surveys Department on the 3rd day of September, 2019 as Plan\n\nNo. 1099/2019.\n\n\f5\n\n FOURTH SCHEDULE\n\nALL THAT land the property of Friendship Plantation c/o Fred Bethell situate at Waterford\n\nand Friendship Plantation in the parish of Saint Michael in this Island containing by admeasurement\n\n1066.7 square metres or thereabouts Abutting and Bounding on lands now or late of Percy Wiles\n\nc/o Michael Searles on lands now or formerly of Double “O” Limited (Lot 21) on lands now or late\n\nof Valerie Padmore c/o Margaret Best and on lands now or formerly of the  Barbados Government\n\n(Botanical Gardens) or however else the same may abut and bound as shown and delineated on a\n\nPlan certiﬁ ed on the 30th day of August, 2019 by Anderson R. Alleyne, Land Surveyor and recorded\n\nin the Lands and Surveys Department on the 3rd day of September, 2019 as Plan No. 1099/2019.\n\n\f6\n\n FIFTH SCHEDULE\n\nALL THAT land the property of Percy Wiles c/o Michael Searles situate at Waterford and\n\nFriendship Plantation in the parish of Saint Michael in this Island containing by admeasurement\n\n4266.8 square metres or thereabouts Abutting and Bounding on lands now or formerly of Friendship\n\nPlantation c/o Fred Bethell on lands now or formerly of Double “O” Limited (Lot 21) on lands now\n\nor formerly of Friendship Plantation c/o Fred Bethell and on lands now or formerly of the  Barbados\n\nGovernment (Botanical Gardens) or however else the same may abut and bound as shown and\n\ndelineated on a Plan certiﬁ ed on the 30th day of August, 2019 by Anderson R. Alleyne, Land\n\nSurveyor and recorded in the Land Registry Department on the 3rd day of September, 2019 as\n\nPlan No. 1099/2019.\n\n\f7\n\nSIXTH SCHEDULE\n\nALL  THAT  land  the  property  of  Friendship  Plantation  c/o  Fred  Bethel  situate  at\n\nWaterford and Friendship Plantation in the parish of Saint Michael in this Island containing by\n\nadmeasurement 4266.8 square metres or thereabouts Abutting and Bounding on lands now or late\n\nof Cameron Hewitt c/o Gloria Hewitt on lands now or formerly of Double “O” Limited (Lot 21) on\n\nlands now or late of Percy Wiles c/o Michael Searles and on lands now or formerly of the Barbados\n\nGovernment (Botanical Gardens) or however else the same may abut and bound as shown and\n\ndelineated on a Plan certiﬁ ed on the 30th day of August, 2019 by Anderson R. Alleyne, Land Surveyor\n\nand recorded in the Lands and Surveys Department on the 3rd day of September, 2019 as Plan\n\nNo. 1099/2019.\n\n\f8\n\nSEVENTH SCHEDULE\n\nALL  THAT  land  the  property  of  Cameron  Hewitt  c/o  Gloria  Hewitt  situate  at\n\nWaterford and Friendship Plantation in the parish of Saint Michael in this Island containing by\n\nadmeasurement 1204.2 square metres or thereabouts Abutting and Bounding on lands now or\n\nlate of Goulbourne Lashley c/o Vernon Lashley on lands now or formerly of Double “O” Limited\n\n(Lot 21) on lands now or formerly of Friendship Plantation c/o Fred Bethell and on lands now\n\nor formerly of the Barbados Government (Botanical Gardens) or however else the same may\n\nabut and bound as shown and delineated on a Plan certiﬁ ed on the 30th day of August, 2019 by\n\nAnderson R. Alleyne, Land Surveyor and recorded in the Lands and Surveys Department on the\n\n3rd day of September, 2019 as Plan No. 1099/2019.\n\n\f9\n\nEIGHTH SCHEDULE\n\nALL  THAT  land  the  property  of  Goulbourne  Lashley  c/o  Vernon  Lashley  situate  at\n\nWaterford and Friendship Plantation in the parish of Saint Michael in this Island containing by\n\nadmeasurement 2133.4 square metres or thereabouts Abutting and Bounding on lands now or late of\n\nWilfred Brathwaite on lands now or formerly of Double “O” Limited (Lot 21) on lands now or late\n\nof Cameron Hewitt c/o Gloria Hewitt and on lands now or formerly of the Barbados Government\n\n(Botanical Gardens) or however else the same may abut and bound as shown and delineated on a\n\nPlan certiﬁ ed on the 30th day of August, 2019 by Anderson R. Alleyne, Land Surveyor and recorded\n\nin the Lands and Surveys Department on the 3rd day of September, 2019 as Plan No. 1099/2019.\n\n\f10\n\n NINTH SCHEDULE\n\nALL THAT land the property of William Boyce situate at Lot 17, Friendship in the parish\n\nof Saint Michael in this Island containing by admeasurement 3680.2 square metres or thereabouts\n\nAbutting and Bounding on lands now or formerly of Barbados Government (Botanical Gardens)\n\nand on lands now or late of Patrick Bethel (Lot 19) and on a road or however else the same may\n\nabut and bound as shown and delineated on a Plan certiﬁ ed on the 14th day of November, 2016\n\nby Anderson R. Alleyne, Land Surveyor and recorded in the Lands and Surveys Department on\n\nthe 17th day of November, 2016 as Plan No. 1106/2016.\n\n\f11\n\nTENTH SCHEDULE\n\nALL  THAT  land  the  property  of  Collis  Smith  c/o  Ottaline  Smith  situate  at  Lot  20,\n\nFriendship in the parish of Saint Michael in this Island containing by admeasurement 650.1 square\n\nmetres or thereabouts Abutting and Bounding on lands now or formerly of Double “O” Limited\n\n(Lot 21) and on lands now or late of Wilfred Brathwaite and on a verge or however else the same\n\nmay abut and bound as shown and delineated on a Plan certiﬁ ed on the 4th day of April, 2019 by\n\nAnderson R. Alleyne, Land Surveyor and recorded in the Lands and Surveys Department on the\n\n4th day of April, 2019 as Plan No. 409/2019.\n\n\f12\n\nELEVENTH SCHEDULE\n\nALL  THAT  land  the  property  of  Double  “O”  Limited  situate  at  Lot  21,  Friendship\n\nPlantation in the parish of Saint Michael in this Island containing by admeasurement 1.87 hectares\n\nor 18,744.2 square metres or thereabouts Abutting  and Bounding on lands now or late of Patrick\n\nBethel (Lot 19) on lands now or formerly of Barbados Government (Botanical Gardens) on lands\n\nnow or late of Beryl Padmore c/o Norman Padmore on lands now or late of Roystone Gill on\n\nlands now or late of Valorie Padmore c/o Margaret Best on lands now or formerly of Friendship\n\nPlantation c/o Fred Bethell on lands now or late of Percy Wiles c/o Michael Searles on lands\n\nnow or formerly of Friendship Plantation c/o Fred Bethell on lands now or late of Goulbourne\n\nLashley c/o Vernon Lashley on lands now or late of Cameron Hewitt c/o of Gloria Hewitt on\n\nlands now or late of Wilfred Brathwaite on lands now or late of Collis Smith (Lot 20) and on a\n\nroad or however else the same may abut and bound as shown and delineated on a Plan certiﬁ ed\n\non the 4th day of April, 2019 by Anderson R. Alleyne, Land Surveyor and recorded in the Lands\n\nand Surveys Department on the 4th day of April, 2019 as Plan No. 410/2019.\n\n\f13\n\nTWELFTH SCHEDULE\n\nALL  THAT  land  the  property  of  Wilfred  Brathwaite  situate  at  Lot  23,  Friendship\n\nPlantation, Friendship in the parish of Saint Michael in this Island containing by admeasurement\n\n2.035 hectares or 20356.0 square metres or thereabouts Abutting and Bounding on lands now or\n\nlate of Collis Smith (Lot 20) and on lands now or formerly of Double “O” Limited (Lot 21) on\n\nlands now or late of Goulbourne Lashley c/o Vernon Lashley on lands now or formerly of the\n\nBarbados Government (Botanical Gardens) on lands now or formerly of Rayside Construction\n\nLimited (Lots 26 and 24) on lands now or late of Eloise Taylor (Lot 22) and on a road or however\n\nelse the same may abut and bound as shown and delineated on a Plan certiﬁ ed on the 3rd day of\n\nOctober, 2019, by Anderson R. Alleyne, Land Surveyor and recorded in the Lands and Surveys\n\nDepartment on the 3rd day of October, 2019 as Plan No. 1229/2019.\n\n\f14\n\nTHIRTEENTH SCHEDULE\n\nALL THAT land the property of Patrick Bethell situate at Lot 19, Friendship Plantation,\n\nFriendship in the parish of Saint Michael in this Island containing by admeasurement 1.13 hectares\n\nor 11269.2 square metres or thereabouts Abutting and Bounding on lands now or late of William\n\nBoyce (Lot 17) on lands now or formerly of Barbados Government (Botanical Gardens) on lands\n\nnow or formerly of Double “O” Limited (Lot 21) and on a road or however else the same may\n\nabut and bound as shown and delineated on a Plan certiﬁ ed on the 14th day of November, 2016\n\nby Anderson R. Alleyne, Land Surveyor and recorded in the Lands and Surveys Department on\n\nthe 17th day of November, 2016 as Plan No. 1114/2016.\n\n\f15\n\nADDENDUM\n\nThe Cabinet at its meeting held on the 12th day of July, 2018 agreed inter alia to the\n\nacquisition of land at Waterford in the parish of Saint Michael and more particularly described\n\nin  the  Schedules  to  this  Resolution  for  the  public  purpose  of  a  National  Botanical  Garden.\n\n  In accordance with the provisions of section 5 of the Land Acquisition Act, Cap.\n\n228, the approval of Parliament is now sought for the compulsory acquisition of the parcels of\n\nland described in the Schedules hereto in order that the public purpose set out in the Resolution\n\nmay be effected and that the Crown may acquire an indefeasible title to the said parcels of land.\n\n"
}