{
  "bill_id": 50,
  "slug": "penal-system-reform-amendment-bill-2014",
  "title": "Penal System Reform (Amendment) Bill, 2014",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/afdc3be1356913a10c1f03c48c78711b.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2014-11-03",
  "first_reading": "2014-11-07",
  "second_reading": null,
  "gazette_date": "2014-11-24",
  "passed_date": null,
  "markdown": "Explanatory Memorandum after page 6\n\n2014-09-01\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Penal System Reform Act, Cap. 139 to improve\n\n(a)\n\nthe guidelines applicable to the mitigation of an offender’s sentence;\nand\n\n(b)\n\nthe general judicial sentencing guidelines.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nAmendment of section 39 of Cap. 139\n\nAmendment of section 41 of Cap. 139\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Penal System Reform Act, Cap. 139.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2014.\n\nThis Act may be cited as the Penal System Reform (Amendment) Act,\n\n\f4\n\nAmendment of section 39 of Cap. 139\n\nSection 39 of the Penal System Reform Act, in this Act referred to\n2.\nas the principal Act, is amended by deleting subsection (1) and substituting the\nfollowing:\n\n“Consideration of mitigating factors\n\n39.(1)\nNothing  in  this  Act  prevents  a  court  from  mitigating  an\noffender’s  sentence  by  taking  into  account  such  matters  as,  in  the\nopinion  of  the  court,  are  relevant  considerations  with  respect  to  the\nmitigation of a sentence, including\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe age of the offender;\n\nthe particular circumstances of the offender such as his social\nor economic circumstances;\n\nwhether the offender pleaded guilty and the point at which\nthe guilty plea was made;\n\nthe circumstances or facts of the offence and the degree of\nthe offender’s involvement in the offence;\n\nany  attempt  by  the  offender  to  make  reparation  for  the\noffence.”.\n\nAmendment of section 41 of Cap. 139\n\n3.\nsubstituting the following:\n\nThe  principal  Act  is  amended  by  repealing  section  41  and\n\n\f5\n\n“Judicial sentencing guidelines.\n\n41.(1)\nWithout prejudice to sections 33 to 40, a court in sentencing\nan  offender  convicted  by  the  court  shall  observe  the  sentencing\nguidelines in subsection (2).\n\nIn sentencing an offender, the court shall take into account such\n(2)\nmatters as, in the opinion of the court are relevant considerations with\nrespect to the sentencing of that offender, including\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nthe gravity of the offence and the need to hold the offender\naccountable  for  the  harm  done  to  the  victim  and  the\ncommunity by the offence;\n\nany written representation made by a spouse or relative of the\ndeceased, in respect of murder or manslaughter and in any\nother case any written representation from the victim;\n\nensuring  that  the  gravity  of  the  sentence  is  commensurate\nwith the nature of the offence committed by the offender;\n\nthe need to deter the offender and others from committing\nsimilar offences;\n\nthe manner in which the offender executed the offence and\nthe  nature  and  duration  of  the  relationship  between  the\noffender and the victim;\n\nthe  degree  of  culpability  of  the  offender  and  maximum\npenalty prescribed for the offence;\n\nany attempt on the part of the offender to make reparation to\nthe victim or the victim’s family;\n\nthe need for the rehabilitation of the offender, and the need\nto promote a sense of responsibility on the part of the offender\nfor the harm done to the victim;\n\n\f6\n\n(i)\n\n(j)\n\nthe need for consistency in sentencing in respect of similar\noffences; and\n\nthe possibility of providing restitution for the harm done by\nthe offender.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2014.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2014.\n\nPresident\n\n\fPENAL SYSTEM REFORM (AMENDMENT) BILL, 2014\n\nEXPLANATORY MEMORANDUM\n\nIn light of the decision of the Inter-American Court of Human Rights in Case\n\n12645: Tyrone Dacosta Cadagon v. Barbados, the Cabinet1 determined that\n\n(a)\n\n(b)\n\nthe mandatory imposition of death penalty in respect of the offence of\nmurder should be abolished; and\n\nsection 2 of the Offences Against the Person Act, Cap. 141 be amended\nspecifically  to  abolish  the  mandatory  imposition  of  the  sentence  of\ndeath for offence of murder; and\n\nIt has been determined that section 26 of the Constitution will not be repealed\n\nat this time.\n\nIt is important to note that the Cabinet did not express any intention to abolish\n\nthe death penalty.\n\nIn order to facilitate the decision made by the Cabinet and, in particular, to\nlend support to the new sentencing guidelines for the offence of murder under\nthe new Offences Against the Person (Amendment) Bill, 2014, it was determined\nthat it was necessary to amend sections 39 and 41 of the Penal System Reform\nAct, Cap. 139.\n\nThe Penal System Reform Act applies generally to offences, the sentencing for\nwhich  is  discretionary  in  nature,  in  that  a  Judge  has  discretion  to  impose  a\nsentence which addresses the specific circumstances of the offender and the case.\nSection  39  which  deals  with  the  consideration  of  mitigating  circumstances  in\nrelation  to  sentencing  offenders  and  section  41  which  deals  with  judicial\nsentencing guidelines, allows judges to facilitate that discretion.\n\nThe new Offences Against the Person (Amendment) Bill, 2014 has changed\nthe status of the sentence for the offence of murder from one that is fixed by a\nmandatory sentence to one that is discretionary in nature, where the sentence can\n\n1\n\nCabinet Note (2014) 73/AG.2, M.P. No. 28000/8/9/8 Vol. I, January 30, 2014.\n\ni\n\n\fPENAL SYSTEM REFORM\n(AMENDMENT) BILL, 2014\n\nbe tailored to fit the circumstances of the case and individuality of the offender.\nThus it is forseen that sections 39 and 41 of the Penal System Reform Act would\nnow as a result of the Offences Against the Person (Amendment) Bill, 2014 apply\nto the offence of murder.\n\nThe Inter-American Court of Human Rights in Case 12645: Tyrone Dacosta\nCadagon v. Barbados also emphasised the fact that a sentence that is applicable\nto  the  offence  of  murder  must  be  individualized  to  address  the  particular\ncircumstances of the offence and the offender.2 Sections 39 and 41 of the Penal\nSystem Reform Act were amended to improve the guidelines for sentencing and\nthereby better facilitating the decision of the Inter-American Court.\n\nIn summary, the Penal System Reform (Amendment) Bill, 2014 would amend\n\nthe Penal System Reform Act, Cap. 139 to improve\n\n(a)\n\nthe guidelines applicable to the mitigation of an offender’s sentence;\nand\n\n(b)\n\nthe judicial sentencing guidelines in general.\n\nClause 1:\n\nClause 2:\n\nClause 3:\n\nClause 1 states that the Act should be cited as the Penal System\nReform (Amendment) Act, 2014.\n\nClause 2 repeals and replaces section 39 of the Penal System\nReform Act, Cap. 139 to provide for the improvement of the\nguidelines  applicable  to  the  mitigation  of  an  offender’s\nsentence.\n\nClause 2 repeals and replaces section 41 of the Penal System\nReform Act, Cap. 139 to provide for the improvement of the\ngeneral judicial sentencing guidelines.\n\n2\n\nCase 12645: Tyrone Dacosta Cadagon v. Barbados, paragraphs 53 to 57.\n\nii\n\n"
}