{
  "bill_id": 510,
  "slug": "resolution-re-land-at-bush-hall-yard-gap-st-michael",
  "title": "Resolution re Land at Bush Hall, Yard Gap, St. Michael",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3068840bfac42f8d2f8f41e05b43e66e.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-08-04",
  "first_reading": "2020-08-05",
  "gazette_date": null,
  "markdown": "2020-04-27\n\nPARLIAMENT\n\nRESOLVED that Parliament in accordance with section 5 of the Land Acquisition\n\nAct, Cap. 228, approve the compulsory acquisition by the Crown of the parcel of land situate at\n\nLot 1, Bush Hall Yard Gap in the parish of Saint Michael in this Island more particularly described\n\nin the Schedule hereto for the public purpose of youth participation in community improvement\n\nprojects known as the Building Blocks Project.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and Twenty.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                                               , Two\n\nthousand and Twenty.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  the  property  of  Corine  Howard  situate  at  Lot  1,  Bush  Hall Yard\n\nGap in the parish of Saint Michael in this Island containing by admeasurement 358.2 square\n\nmetres or thereabouts Abutting and Bounding on lands now or late of Merton Richards on a\n\nroad leading to a cul-de-sac and on another road and on a public road known as Bush Hall Yard\n\nGap  which  leads  to  Highway  2  in  one  direction  and  Spooners  Hill  in  the  other  direction  or\n\nhowever else the same may abut and bound as shown and delineated on a Plan certiﬁ ed on the\n\n12th day of February, 2020 by Kevin R. Belgrave, Land Surveyor and recorded in the Lands and\n\nSurveys Department on the 2nd day of March, 2020 as Plan No. 292/2020.\n\n\f3\n\nADDENDUM\n\nThe  Cabinet  at  its  meeting  held  on  the  6th  day  of  September,  2019  agreed  to\n\nthe acquisition of approximately 589.5 square metres of land at Bush  Hall Yard Gap in the\n\nparish of Saint Michael and more particularly described in the Schedule to this Resolution for the\n\npublic  purpose  of  facilitating  the  construction  of  kiosks  to  foster  youth  participation  in\n\ncommunity empowerment as part of the Building Blocks Project.\n\nBy  a  recent  survey  the  parcel  of  land  was  found  to  contain  by  admeasurement\n\n358.2 square metres or thereabouts.\n\nIn  accordance  with  the  provisions  of  section  5  of  the  Land  Acquisition  Act,\n\nCap. 228, the approval of Parliament is now sought for the compulsory acquisition of the parcel\n\nof land described in the Schedule hereto in order that the public purpose set out in the Resolution\n\nmay be effected and that the Crown may acquire an indefeasible title to the said parcels of land.\n\n"
}