{
  "bill_id": 512,
  "slug": "remote-employment-bill-2020",
  "title": "Remote Employment Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/1060cadd77eb3b54bb81b5b5b7ba1177.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-07-22",
  "first_reading": "2020-07-22",
  "gazette_date": null,
  "markdown": "2020-07-21\n\nOBJECTS AND REASONS\n\nThis Bill would provide for non-nationals who work remotely from Barbados\nfor a period of 12 months to be deemed non-resident for income tax purposes and\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nDefinitions\n\nGrant of Barbados Welcome Stamp\n\nIndividual may work remotely\n\nBarbados Welcome Stamp\n\nEffect of grant of a Stamp\n\nNo employment to be taken in Barbados\n\nRevocation of Welcome Stamp\n\nBarbados Welcome Stamp Register\n\nSCHEDULE\n\nAPPLICATION FOR 12 MONTH BARBADOS WELCOME STAMP\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for non-nationals who work remotely from Barbados for\na period of 12 months to be deemed non-resident for income tax purposes and\nprovide for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n\nThis Act may be cited as the Remote Employment Act, 2020.\n\nDefinitions\n\n2.\n\nFor the purposes of this Act,\n\n“non-national” means a person who is not a citizen of Barbados;\n\n“Barbados  Welcome  Stamp”  or  “Stamp”  means  a  visa  granted  by  the  Chief\nImmigration  Officer  with  the  approval  of  the  Minister  responsible  for\nImmigration to a person to whom this Act applies.\n\nGrant of Barbados Welcome Stamp\n\nA  non-national  who  is  employed  in  a  country  other  than  Barbados\n3.\nmay, upon making application to the Minister responsible for Immigration in the\nform set out in the Schedule, be granted a Barbados Welcome Stamp to work in\nBarbados for a period of 12 months, subject to the following conditions:\n\n(a)\n\n(b)\n\nhe possess a valid passport;\n\nhe can show proof\n\n(i)\n\nof annual income of $100 000 or more; and\n\n(ii)\n\nthat the income is generated outside Barbados; and\n\n(c)\n\nhe is the holder of valid health insurance for the period for which the\nStamp was granted.\n\nIndividual may work remotely\n\n4.\nA non-national who has been granted a Barbados Welcome Stamp to\nwork remotely from Barbados shall be deemed not to be resident in Barbados for\nthe purposes of section 85(5) of the Income Tax Act, Cap. 73.\n\n\f5\n\nBarbados Welcome Stamp\n\n5.(1)\n\nA Stamp shall be granted for a period of 12 months only.\n\n(2)\n\nThe fee for the grant of a Stamp shall be\n\n(a)\n\n(b)\n\n$4 000 in the case of an individual; and\n\nwhere the individual is accompanied by his family, $6 000.\n\nEffect of grant of a Stamp\n\nFor the purposes of section 16 of the Income Tax Act, Cap. 73 income\n6.\nderived from Barbados shall not include income received by an individual who\nis in receipt of a Stamp.\n\nNo employment to be taken in Barbados\n\n7.\nAn individual to whom a Stamp has been granted shall not engage in\nemployment  in  Barbados  other  than  employment  for  which  the  Stamp  was\ngranted.\n\nRevocation of Welcome Stamp\n\n8.\nor fails to comply with the provisions of this Act.\n\nThe Minister may revoke the Stamp of an individual who contravenes\n\nBarbados Welcome Stamp Register\n\n9.\nA register of all individuals issued with a Barbados Welcome Stamp\nshall be kept by the Chief Immigration Officer and shall contain such information\nas may be determined by the Minister responsible for Immigration.\n\n\f6\n\nL.R.O. 1998SCHEDULE(Section 3)Remote  Employment Act, 2020(Act 2020-   )FORMAPPLICATION FOR 12 MONTH BARBADOS WELCOME STAMPApplicants wishing to apply for the 12 Month Barbados Welcome Stamp are required tocomplete and submit the following documents electronically:• Bio data page of passport (self/spouse/partner/children/dependant)• Birth certiﬁ cate (self/spouse/partner/children/dependant)• Proof of relationship of dependants (birth certiﬁ cate, marriage certiﬁ cate, adoption documents)• Entry visa (where applicable)Upon approval the following non-refundable fees are applicable:• Individual Fee - BDS $4,000.00• Family Fee - BDS $6,000.00\f7\n\n L.R.O. 1998APPLICANTPersonal InformationName (Mr.*/Mrs.*/Miss*):   Sex: Male FemaleMarital Status: Single Married Divorced WidowedDate of Birth: Country of Birth:Country of citizenship:Former nationality (if applicable):Email address:Name of Employer:Brief description of type of work/nature of business in which applicant will be engaged:First NameMonth/Day/YearMiddle NameLast NameNationalityEmail addressEmployer's NameCountrySchedule - (Cont'd)Name of Country\f8\n\n L.R.O. 1998Contact InformationPermanent Address:Street Address:City:  State/Province/Region:Zip/Postal Code: Country:Email address:Telephone No.:Emergency Contact:Passport DetailsPassport Number:Date of Issue: Date of Expiry:Place of Issue:Proposed date of entry into Barbados:Month/Day/YearMonth/Day/YearCountryMonth/Day/YearSchedule - (Cont'd)(Area code)-(Telephone number)Full Name\f9\n\n L.R.O. 1998Spouse/Partner Information (if applicable)Name of Spouse/Partner (Mr.*/Mrs.*/Miss*):Sex: Male Female Date of Birth: Country of Birth:Country of citizenship:Former nationality (if applicable):Passport Number:Dependants information (if applicable)Is there any person(s) in the family group that would be deﬁ ned as a dependant? Yes No(see deﬁ nition in General Information – Deﬁ nition of Terms )Schedule - (Cont'd)Month/Day/YearCountryName of CountryNationalityNameDate of BirthPassportNumberCountry ofCitizenship(Month/Day/Year)First NameMiddle NameLast Name\f10\n\n L.R.O. 1998Will dependants be attending school in Barbados? Yes NoIf \"Yes\" choose Public school (link to student visa application) Private school (link to student visa application) Home schoolHave you ever been convicted of a serious criminal offence? Yes NoDeclarationI hereby declare that I, my spouse, partner or dependants will not accept any employment from or offer any services to a citizen, permanent resident, immigrant, work permit holder or any personor entitiy carrying on business in Barbados. I certify that I expect to earn an income of $100 000 or more over the next 12 months and thatI have the means to support myself, my spouse, partner and dependants accompanying me,during my stay in Barbados. I hereby certify that the information given by me in this application is true and correct to thebest of my knowledge. I understand and agree that any false information, misrepresentation,or omission of facts in this application and the application process, may be justiﬁ cationfor refusal of the grant of a Barbados Welcome Stamp.Signature: Date of Submission:Month/Day/YearSignatureSchedule - (Cont'd)\f11\n\n L.R.O. 1998INSTRUCTIONSDEFINITION OF TERMS Applicant:  Individual who will be engaging in remote work in Barbados.Family:  Applicant, spouse, partner and dependant(s).Dependant: (a) a child or step-child under the age of 26 years;(b) any other relative who is, by reason of age or any inﬁ rmity of body or mind, wholly dependent on that person for his/her subsistence.Duration of Stay:  Maximum 12 months from date of approval.Schedule - (Concl'd)\f12\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n"
}