{
  "bill_id": 518,
  "slug": "resolution-re-land-at-sayes-court-holders-hill-and-durants-village-to-maria-holder-trust-inc",
  "title": "Resolution re Land at Sayes Court, Holders Hill and Durants Village to Maria Holder Trust Inc",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/41f1daf93d0ba5be655bca9e21c5dee3.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-10-28",
  "first_reading": "2020-12-09",
  "gazette_date": null,
  "markdown": "2020-07-30\n\nPARLIAMENT\n\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands\n\n(Vesting and Disposal) Act, Cap. 225 approve the lease to The Maria Holder Memorial Trust\n\nof certain parcels of land, the properties of the Crown, and more particularly described in the\n\nFirst and Second Schedules to this Resolution on the terms and conditions set out in the Third\n\nSchedule to this Resolution for the purpose of the construction of nursery schools.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and twenty.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and twenty.\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL THAT certain piece or parcel of land, the property of the Crown, situate at\n\nSayes Court in the parish of Christ Church in this Island containing by admeasurement 6270.3\n\nsquare  metres  (inclusive  of  a  road  reserve  of  230.5  square  metres)  or  thereabouts Abutting\n\nand Bounding on lands now or formerly of the Barbados Government on other lands now or\n\nformerly of the Barbados Government (Skills Training) on two sides and on a public road known\n\nas Highway U leading to Oistins in one direction and to Ealing Grove in the other direction or\n\nhowever else the same may abut and bound as delineated and shown on a Plan certiﬁ ed on the\n\n2nd day of April, 2019 by Michael L. Banﬁ eld, Land Surveyor and recorded in the Lands and\n\nSurveys Department on the 11th day of April, 2019 as Plan No. 446/2019.\n\n\f3\n\nSECOND SCHEDULE\n\nALL  THAT  certain  piece  or  parcel  of  land,  the  property  of  the  Crown,\n\nsituate at Holders Hill and Durants Village in the parish of Saint James in this Island containing\n\nby  admeasurement  5785.3  square  metres  (inclusive  of  46.7  square  metres  in  sidewalk)  or\n\nthereabouts Abutting and Bounding on a private road (which is on lands now or formerly of\n\nWilfred Harewood and on lands now or formerly of Dennis Worrell) on lands now or formerly\n\nof  Cecil  Browne  on  lands  now  or  formerly  of  James  Wilson  on  lands  now  or  formerly  of\n\nSamuel Brathwaite on lands now or formerly of Lisetta Vaughn on lands now or formerly of\n\nMary Allamby on lands now or formerly of Stevenson Headley on lands now or formerly of\n\nGeorge Bellamy on lands now or formerly of Victor Johnson on lands now or formerly of Helena\n\nHarewood on a public road known as Durants Village Road leading to Holders Hill on lands now\n\nor formerly of Fitz Blenman on lands now or formerly of Charles Coward (Lot 2) on a car park\n\non a driveway on lands now or formerly of Owen Coward (Lot 1) and on a sidewalk which is\n\non a public road known as Holders Hill leading to Highway #1 in one direction and to Thorpes\n\nin the other direction or however else the same may abut and bound as delineated and shown on\n\na Plan certiﬁ ed on the 9th day of July, 2019 by Samuel N. Taylor, Land Surveyor and recorded\n\nin the Lands and Surveys Department on the 15th day of July, 2019 as Plan No. 887/2019.\n\n\f4\n\nTHIRD SCHEDULE\n\nTerms and Conditions\n\n(a)\n\nThe lease of 2 parcels of Crown land at Sayes Court, in the parish of Christ Church\n\nand Holders Hill and Durants Village in the parish of Saint James containing by\n\nadmeasurement 6,720.3 square metres and 5,785.3 square metres respectively to the\n\nMaria Holder Memorial Trust (the Trust) under the following terms and conditions:\n\n(i)\n\neach lease to be for a term of 30 years;\n\n(ii)\n\nthe rent for each site shall be a one-time payment of  $200.00  plus  Value\n\nAdded Tax, payable in advance;\n\n(iii)\n\nthe premises are being leased for the purpose of the construction of nursery\n\nschools;\n\n(iv)\n\nthe lands, together with all improvements shall be handed over and licensed\n\nto the Crown for operation by the Ministry responsible for Education and\n\nTechnological and Vocational Training as nursery schools;\n\n(v)\n\nthe lessee shall be responsible for the costs of development of the site;\n\n(vi)\n\nthe lessee shall comply with the requirements of all   planning,  building,\n\nsafety and health and related legislation throughout the term;\n\n(vii)\n\nthe lessee shall indemnify the Crown from all actions arising from its use of\n\nthe premises;\n\n(viii)\n\nthe lessee shall not assign, mortgage, demise, underlet or otherwise part with\n\npossession of the demised premises or any part thereof without the lessor’s\n\nconsent;\n\n(ix)\n\nthe lessee reserves the right to surrender its lease with improvements thereon\n\nat any time by giving 8 months’ notice;\n\n\f5\n\n(x)\n\neach lease shall terminate on the transfer of the Trust’s interests in the devel-\n\noped nursery school to the Crown;\n\n(xi)\n\nthe premises with improvements thereon shall revert to the Crown for nil\n\nconsideration at the end of the lease or its sooner determination; and\n\n(xii)\n\nthe lessee shall not use, permit or suffer the demised premises or any part\n\nthereof to be used for any purpose other than a nursery school.\n\n(b)\n\n The licences of the land from the Trust shall be to the Crown for the purpose of\n\nallowing the Ministry responsible for Education and Technological and Vocational\n\nTraining to operate nursery schools developed by The Maria Holder Memorial Trust\n\non the following terms and conditions:\n\n(i)\n\n the licence to be for a term of 30 years less one day;\n\n(ii)\n\nthe licence fee shall be $1 500.00 plus Value Added Tax per annum per site,\n\npayable annually in advance;\n\n(iii)\n\nthe Crown as licencee shall be responsible for keeping the demised premises\n\ninsured for their full re-instatement value under a comprehensive policy in\n\nthe joint names of the Crown and the Trust;\n\n(iv)\n\nthe Crown as licencee shall keep the interior and exterior of the premises,\n\ninclusive of drains, sanitary and water apparatus, gates and fences in good\n\nand tenable repair;\n\n(v)\n\nthe Trust shall be responsible for the repair of any latent defect in the structure\n\nof the premises or repairs arising therefrom;\n\n(vi)\n\nthe Crown as licencee shall not carry out any additions or extensions to the\n\ndemised premises without the approval of the Trust;\n\n\f6\n\n(vii)\n\nthe Crown as licencee shall use the demised premises as nursery schools and\n\nfor ancillary education purposes, unless written consent by the Trust is given\n\nto do otherwise;\n\n(viii)\n\nthe Crown as licencee shall not share nor part with possession of the demised\n\npremises or any part thereof;\n\n(ix)\n\nthe  Crown  as  licencee  shall  permit  the Trust  with  2  days’  written  notice,\n\nto  inspect  the  premises,  and  thereafter  giving  the  licencee  written  notice\n\nspecifying any repairs, maintenance and replacement necessary to be done\n\nand require the licencee to execute said repairs within 21 days;\n\n(x)\n\nif the licencee is unable to execute the repairs within 21 days as set out in\n\nparagraph (ix), the Trust will execute the repairs and the costs thereof are to\n\nbe treated as a debt due to the Trust that is to be settled within 2 months of\n\nthe date of the Trust’s invoice for the work undertaken;\n\n(xi)\n\nthe Crown as licencee through the occupying agency shall be responsible\n\nfor maintaining Public Liability Insurance of not less than $2 000 000.00\n\nper site, subject to an annual review by the Trust’s Brokers and indemnify\n\nthe Trust in the event of any liability;\n\n(xii)\n\nthe  Crown,  through  the  occupying  agency  shall  be  responsible  for  all\n\noutgoings arising from the use of the sites as nursery schools;\n\n(xiii)\n\nthe Crown is bound to give 8 months’ notice should it wish to terminate the\n\nlicence of any nursery school site before its expiry date; and\n\n(xiv)\n\nthe  Crown,  through  the  occupying  agency  shall  be  responsible  for  the\n\nmaintenance and upkeep of the premises.\n\n\f7\n\nADDENDUM\n\n  On  the  18th  day  of  July,  2019  the  Cabinet  agreed  to  the  lease  of  the  parcels  of  land\n\nsituate at Sayes Court in the parish of Christ Church and Holders Hill and Durants Village in the\n\nparish of Saint James respectively, in this Island and mentioned in the First and Second Schedules\n\nto this Resolution for the construction of nursery schools.\n\n  The  construction  of  the  nursery  schools  will  be  ﬁ nanced  through  The  Maria  Holder\n\nMemorial Trust including the development, lease and transfer of the nursery schools to the Crown\n\nat the end of the lease period.\n\n  It  is  proposed,  subject  to  the  approval  of  Parliament,  to  lease  to  The  Maria  Holder\n\nMemorial Trust for a period of 30 years the parcels of land described in the First and Second\n\nSchedules to this Resolution subject to the terms and conditions set out in the Third Schedule\n\nhereto for the development of nursery schools for public use.\n\n"
}