{
  "bill_id": 51,
  "slug": "criminal-procedure-amendment-bill-2014",
  "title": "Criminal Procedure (Amendment) Bill, 2014",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/ba6f18d48d4901ba7cc48ee719a4cecc.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2014-11-03",
  "first_reading": "2014-11-07",
  "second_reading": null,
  "gazette_date": "2014-11-24",
  "passed_date": null,
  "markdown": "Explanatory Memorandum after page 5\n\n2014-09-01\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Criminal Procedure Act, Cap. 127 to\n\n(a)\n\nmake provision for a person who is to be arraigned upon indictment\nfor  the  offence  for  murder  to  undergo  a  psychiatric  evaluation  to\ndetermine whether that person is fit to plead; and\n\n(b)\n\nallow judges to intervene where a defence should be raised in relation\nto an accused.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nInsertion of section 6A into Cap. 127\n\nInsertion of section 7A into Cap. 127\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Criminal Procedure Act, Cap. 127.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2014.\n\nThis Act may be cited as the Criminal Procedure (Amendment) Act,\n\n\f4\n\nInsertion of section 6A into Cap. 127\n\nThe Criminal Procedure Act, in this Act referred to as the principal\n2.\nAct, is amended by inserting immediately after section 6 the following section:\n\n“Psychiatric evaluation\n\n6A.(1)\nThe High Court shall order a person who is to be arraigned\nupon  indictment  for  the  offence  of  murder  to  undergo  a  psychiatric\nevaluation  the  results  of  which  shall  be  used  to  assist  the  Court  in\ndetermining whether that person is fit to plead.\n\nWhere a person has been found to be unfit to plead, the High\n(2)\nCourt may order that person to be admitted to a mental hospital for a\nperiod not exceeding 8 weeks.\n\nA person admitted to a mental hospital under subsection (2) may\n(3)\nbe discharged only after the approval of the High Court and the Court\nmay specify conditions of his discharge.\n\nThe High Court in specifying the conditions of the discharge of\n(4)\na  person  under  subsection  (3),  shall  order  that  that  person  undergo\nfurther  psychiatric  evaluations  at  intervals  to  be  determined  by  the\nCourt.\n\nWhere a person is found to be fit to plead under subsections (1)\n(5)\nand (4), he shall enter the plea in the manner specified in section 7.”.\n\nInsertion of section 7A into Cap. 127\n\n3.\n7, the following section:\n\nThe principal Act is amended by inserting immediately after section\n\n\f5\n\n“Intervention of the judge\n\n7A.(1)\nWhere  a  judge  determines  from  the  circumstances  of  the\ncase  before  him  that  the  defences  of  diminished  responsibility  or\ninsanity should be raised in relation to an accused, the judge shall order\nthat the accused undergo a psychiatric evaluation to determine whether\nthe mental status of the accused person would support the submission\nof arguments for diminished responsibility or insanity in relation to that\naccused person.\n\n(2)\nWhere the results of the psychiatric evaluation indicate that the\ndefences of diminished responsibility or insanity should be raised in\nrespect of the accused, the judge shall make that psychiatric evaluation\navailable to defence counsel.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2014.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2014.\n\nPresident\n\n\fCRIMINAL PROCEDURE (AMENDMENT) BILL, 2014\n\nEXPLANATORY MEMORANDUM\n\nIn light of the decision of the Inter-American Court of Human Rights in Case\n\n12645: Tyrone Dacosta Cadagon v. Barbados, the Cabinet1 determined that\n\n(a)\n\n(b)\n\nthe mandatory imposition of death penalty in respect of the offence of\nmurder should be abolished; and\n\nsection 2 of the Offences Against the Person Act, Cap. 141 be amended\nspecifically  to  abolish  the  mandatory  imposition  of  the  sentence  of\ndeath for offence of murder.\n\nIt  has  been  determined  that  section  26  of  the  Constitution  known  as  the\n\n\"existing law clause\" will not be repealed at this time.\n\nIt is important to note that the Cabinet did not express any intention to abolish\n\nthe death penalty.\n\nThe Inter-American Court of Human Rights in Case 12645: Tyrone Dacosta\nCadagon v. Barbados, raised concerns about the assessment of the mental state\nof the accused as it relates to the following:\n\n(a)\n\n(b)\n\n(c)\n\na person’s fitness to plead;\n\nraising defences such as diminished responsibility; or\n\nthe trial judge’s responsibility in ensuring that assessments are made\nto facilitate the raising of such defences.2\n\nIn  a  separate  judgment,  Judge  Sergio  García  Ramírez,  asserted  that  judges\nshould intervene in trials to raise the submission of evidence to support defences\nlike diminished responsibility, especially in circumstances where the penalty to\nbe imposed is death.3  Judge Ramírez insisted that the adverserial nature of a\n\n1\n\n2\n\nCabinet Note (2014) 73/AG.2, M.P. No. 2800/8/9/8 Vol. I, January 30, 2014.\n\nCase 12645: Tyrone Dacosta Cadagon v. Barbados, paragraphs 79-88.\n\ni\n\n\fCRIMINAL PROCEDURE\n(AMENDMENT) BILL, 2014\n\ncriminal  procedural  system  does  not  prohibit  a  judge  from  assuming  such\nprobative measures where necessary.\n\nIt  was  determined  that  the  Criminal  Procedure  Act,  Cap.  127  should  be\namended to address the afore-mentioned concerns of the Inter-American Court.\n\nThe  Criminal  Procedure  (Amendment)  Bill,  2014  will  amend  the  Criminal\n\nProcedure Act, Cap. 127 to\n\n(a)\n\nmake provision for a person who is to be arraigned upon indictment\nfor  the  offence  of  murder  to  undergo  a  psychiatric  evaluation  to\ndetermine whether that person to fit to plead; and\n\n(b)\n\nallow judges to intervene where a defence should be raised in relation\nto an accused.\n\nClause 1:\n\nClause 2:\n\nClause 3:\n\nClause  1  states  that  the  Act  may  be  cited  as  the  Criminal\nProcedure (Amendment) Act, 2014.\n\nClause 2 inserts into the Criminal Procedure Act, Cap. 127 a\nnew section 6A which makes provision for a person who is to\nbe arraigned upon indictment for the offence for murder to\nundergo  a  psychiatric  evaluation  to  determine  whether  that\nperson is fit to plead.\n\nClause 3 inserts into the Criminal Procedure Act, Cap. 127\ninserts a new section 7A to allow judges to intervene where\nthe defenses of insanity and diminished responsibility should\nbe raised in relation to an accused.\n\n3\n\nCase 12645: Tyrone Dacosta Cadagon v. Barbados, Separate Opinion of Judge Sergio García Ramírez in relation to the Judgement\n\nof the Inter-American Court of Human Rights of September 24, 2009, in the case of Case of Dacosta Cadagon (Barbados),\n\nparagraphs 18.\n\nii\n\n"
}