{
  "bill_id": 520,
  "slug": "public-service-appointments-bill-2020",
  "title": "Public Service (Appointments) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/869fa6010d008b5765b614f55144fffb.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-09-30",
  "first_reading": "2020-09-30",
  "gazette_date": null,
  "markdown": "Corrected Copy: 2020-09-29\n\nOBJECTS AND REASONS\n\nThis Bill would alter the Constitution to make provision for the appointment\nor  promotion,  as  the  case  may  be,  of  persons  who  have  been  temporarily\nemployed or acting in a post in the Public Service for a period of 3 years or more\non the date immediately preceding 1st October, 2020.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nAlteration of Part 2 of Chapter VIII of the Constitution\n\nAppointment of persons employed in the Public Service for a period of 3\nyears or more\n\nEstablishment of offices at 1st October, 2020\n\nIneligibility for appointment under section 5\n\nExceptions to sections 4 and 5\n\nStatus of officers appointed pursuant to this Act\n\nCommencement\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to alter the Constitution to make provision for the appointment or\npromotion,  as  the  case  may  be,  of  persons  who  have  been  temporarily\nemployed or acting in a post in the Public Service for a period of 3 years or\nmore on the date immediately preceding 1st October, 2020.\n\nENACTED by the Parliament of Barbados in accordance with the provisions\n\nof section 49 of the Constitution as follows:\n\n\f4\n\nShort title\n\n1.\n2020.\n\nThis  Act  may  be  cited  as  the  Public  Service  (Appointments)  Act,\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Chief Medical Officer” means a person who holds the office of Chief Medical\nOfficer which is established in accordance with the Public Service (General)\nOrder, 2020 (S.I. 2020 No. 41);\n\n“Director General”  means the Director General, Human Resources, referred to\n\nin section 6A of the Public Service Act, Cap. 29;\n\n“established office”  has the meaning assigned to it by section 2 of the Public\n\nService Act, Cap. 29;\n\n“Medical Board” means a Board\n\n(a)\n\nwhich is appointed by\n\n(i)\n\n(ii)\n\nthe Chief Medical Officer, in respect of an officer in the Public\nService in Barbados; or\n\nan agency which represents Barbados and is authorised to appoint\na Medical Board, in respect of an officer in the Public Service who\nis serving outside of Barbados,\n\nto determine whether the officer is physically or mentally fit to perform the\nduties of his office or any other office in the Public Service; and\n\n(b)\n\nwhich comprises 2 or 3 registered medical practitioners;\n\n“Medical Officer” means a person who holds the office of Medical Officer of\nHealth which is established in accordance with the Public Service (General)\nOrder, 2020 (S.I. 2020 No. 41);\n\n\f5\n\n“public  officer”  or  “officer”    has  the  meaning  assigned  to  it  by  section  2  of\n\nthe Public Service Act, Cap. 29;\n\n“Public Service”  has the meaning assigned to it by section 2 of the Public Service\n\nAct, Cap. 29;\n\n“temporary  office”  has  the  meaning  assigned  to  it  by  section  2  of  the  Public\n\nService Act, Cap. 29.\n\nAlteration of Part 2 of Chapter VIII of the Constitution\n\n3.\nnecessary to give effect to the provisions of this Act.\n\nPart 2 of Chapter VIII of the Constitution is hereby altered to the extent\n\nAppointment of persons employed in the Public Service for a period\nof 3 years or more\n\nNotwithstanding  the  provisions  of  Part  2  of  Chapter  VIII  of  the\n4.\nConstitution, sections 13, 18, 19 and 20 of the Public Service Act, Cap. 29, the\nRecruitment and Employment Code of the First Schedule to the Public Service\nAct  and  paragraph  3  of  the  Public  Service  (Qualifications)  Order,  2016\n(S.I. 2016 No. 92),\n\n(a)\n\nsection 5(1) shall apply to any person who is not appointed to the Public\nService and who has been employed in\n\n(i)\n\na temporary office;\n\n(ii)\n\nan established office; or\n\n(iii)\n\na combination of a temporary office and an established office;\n\n(b)\n\nsection 5(2) shall apply to any person who is a public officer and who\nhas been acting in a post,\n\nfor 3 years or more immediately before 1st October, 2020.\n\n\f6\n\nEstablishment of offices at 1st October, 2020\n\n5.(1)\n\nAny person who at 1st October, 2020\n\n(a)\n\n(b)\n\nis not appointed to the Public Service; and\n\nhas been employed in\n\n(i)\n\na temporary office; or\n\n(ii)\n\nan established office;\n\n(iii)\n\na combination of a temporary office and an established office,\n\nfor 3 years or more immediately before 1st October, 2020 shall be entitled to be\nappointed to the office with effect from 1st October, 2020 and shall be deemed to\nbe so appointed.\n\nA  public  officer  who  has  been  acting  in  a  post  for  3  years  or  more\n(2)\nimmediately  before  1st  October,  2020  shall  be  deemed  to  be  appointed  to  the\noffice with effect from 1st October, 2020.\n\nFor the purposes of this Act and subject to subsections (1) and (2), where\n(3)\nno  vacancy  or  relevant  office  exists,  a  supernumerary  office  is  deemed  to  be\nestablished.\n\n(4)\n\nThis section does not apply to the Police Force or the Prison Service.\n\nIneligibility for appointment under section 5\n\n6.(1)\nsection 5 where the person\n\nA  person  shall  not  be  eligible  for  appointment  to  an  office  under\n\n(a)\n\nis  the  subject  of  a  disciplinary  matter  commenced  pursuant  to  the\nprovisions  of  the  Public  Service  Act,  Cap.  29  or  any  other  relevant\nenactment;\n\n(b)\n\nis the subject of an ongoing criminal matter;\n\n\f7\n\n(c)\n\n(d)\n\n(e)\n\nhas a conviction which may not have been expunged from his criminal\nrecord;\n\nis on medical leave for a period of at least 3 months  accumatively  in\nany one calendar year  and who has been processed by the Director\nGeneral  for  referral  to  a  Medical  Officer  or  a  Medical  Board  for\nexamination;\n\nhas in his personnel records a negative report or a report of conduct\n  which  contravenes  the  Public  Service  Act,  Cap.  29  and  any  other\nrelevant enactment.\n\n(2)\n\nNotwithstanding subsection (1), where, as the case may be,\n\n(a)\n\n(b)\n\na person is exonerated in respect of a disciplinary matter or a criminal\nmatter; or\n\na Medical Officer or a Medical Board examines a person who has been\non medical leave for a period of at least 3 months accumatively in any\none  calendar  year  and  who  was  referred  to  a  Medical  Officer  or  a\nMedical Board by the Director General and the Medical Officer or the\nMedical Board deems that the person is fit for employment within the\nPublic Service,\n\nthat person shall be retroactively appointed to the relevant office in accordance\nwith the provisions of section 5.\n\nNotwithstanding  subsection  (1)  and  paragraph  21(1)  of  the  Second\n(3)\nSchedule to the Public Service Act, Cap. 29, where a person has a criminal record\nand  it  has  been  expunged,  that  person  shall  be  retroactively  appointed  to  the\nrelevant office in accordance with the provisions section 5.\n\nExceptions to sections 4 and 5\n\n7.(1)\nSections 4 and 5 shall not apply to temporary offices that were created\nin respect of a specific project; and the determination as to whether a temporary\noffice is a project office shall be made by the Ministry responsible for the Public\nService.\n\n\f8\n\n(2)\nWhere an officer to whom section 4 or section 5 refers is prejudiced by the\noperation of either section, in respect of an appointment to an office by virtue of\nthe provisions of either section, the Governor-General may appoint the officer to\nan office, the appointment of which results in the remedying of the prejudice.\n\nStatus of officers appointed pursuant to this Act\n\nFor the avoidance of doubt, notwithstanding that the persons to whom\n8.\nthis Act applies were appointed by this Act and not by the Governor-General,\nacting  in  accordance  with  the  advice  of  the  Administrative,  General  and\nProfessional Service Commission, the Judicial and Legal Service Commission\nand the Protective Services Commission, as the case may be, those persons are\nnonetheless public officers and are subject to the disciplinary procedure and other\nprovisions of the Constitution and every statute relating to public officers to the\nsame extent and in the same manner as public officers who are appointed by the\nGovernor-General acting in accordance with the advice of the Administrative,\nGeneral and Professional Service Commission, the Judicial and Legal Service\nCommission and the Protective Services Commission.\n\nCommencement\n\n9.\n\nThis Act shall come into operation on the 1st day of October, 2020.\n\n"
}