{
  "bill_id": 522,
  "slug": "pesticides-control-amendment-bill-2020",
  "title": "Pesticides Control (Amendment) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/c6940aea52cdee8db25b0de3bf7c9c64.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-12-09",
  "first_reading": "2020-12-09",
  "gazette_date": "2020-10-13",
  "markdown": "2020-07-14\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Pesticides Control Act, Cap. 395.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of section 2 of Cap. 395\n\nInsertion of section 3A into Cap. 395\n\nAmendment of Schedule to Cap. 395\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Pesticides Control Act.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2020.\n\nThis Act may be cited as the Pesticides Control (Amendment) Act,\n\n\f4\n\nAmendment of section 2 of Cap. 395\n\n2.\nto as the principal Act, is amended by\n\nSection 2 of the Pesticides Control Act, Cap. 395, in this Act referred\n\n(a)\n\ndeleting  the  definition  of  “approved  analyst”  and  substituting  the\nfollowing:\n\n“ “approved analyst” means the Director, Analytical Services or any\nother  analyst  approved  by  the  Minister  for  the  purpose  of  this\nAct;”; and\n\n(b)\n\ninserting in alphabetical order, the following definition:\n\n“ “Registrar” means any public officer appointed or designated as the\n\nRegistrar of Pesticides for the purpose of this Act;”.\n\nInsertion of section 3A into Cap. 395\n\n3.\nfollowing:\n\nThe  principal  Act  is  amended  by  inserting  after  section  3,  the\n\n“Functions of Registrar\n\n3A.(1)\n\nThe Registrar of Pesticides shall\n\n(a)\n\nbe the secretary of the Board and shall perform such functions\nas are assigned to the secretary by this Act and by the Board;\n\n(b)\n\nbe responsible for the general supervision of inspectors;\n\n(c)\n\ngive to inspectors, on behalf of the Board, such information,\ninstructions  and  directions  as  may  be  necessary  for  the\noperation of this Act;\n\n\f5\n\n(d)\n\n(e)\n\nkeep  and  maintain  a  register,  to  be  called  the  Register  of\nPesticides, in accordance with subsection (2); and\n\nperform such other duties as may be assigned to him by this\nAct and by the Board.\n\nThe  Registrar  shall  enter  in  the  Register  of  Pesticides  such\n\n(2)\ninformation as may be prescribed.\n\n(3)\n\nThe Register of Pesticides shall be open for public inspection.”.\n\nAmendment of Schedule to Cap. 395\n\n4.\n\nThe Schedule to the principal Act is amended by\n\n(a)\n\ndeleting paragraph 1(1) and substituting the following:\n\nThe  Pesticides  Control  Board,  to  which  section  20(1)  of  the\n\n“(1)\nInterpretation Act, Cap. 1 shall apply, shall consist of\n\n(a)\n\nthe Chief Agricultural Officer or his nominee, who shall be\nthe Chairman of the Board;\n\n(b)\n\nthe Chief Medical Officer or his nominee;\n\n(c)\n\n(d)\n\nthe Director, Analytical Services or his nominee; and\n\ntwo other persons, one of whom may be a public officer, to\nbe appointed by the Minister.”; and\n\n(b)\n\ndeleting paragraphs 5, 6 and 7 and substituting the following:\n\n“5.\nThe Board may, in the performance of its functions, seek\nadvice from such persons, whether or not in the Public Service, as it\nmay  consider  appropriate  and  may,  for  the  purpose,  establish  such\nadvisory committees as it considers necessary.\n\n\f6\n\n6.\nAll documents made by, and all decisions of, the Board may\nbe signified under the hand of the Chairman or any member of the Board\nauthorised to act in that behalf or by the secretary of the Board.\n\n7.\nprocedure.”.\n\nSubject  to  this  Schedule,  the  Board  may  regulate  its  own\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n"
}