{
  "bill_id": 523,
  "slug": "appropriation-amendment-bill-2020",
  "title": "Appropriation (Amendment) Bill 2020.",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/22a357b2f7f11d397bb308035c019944.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-10-16",
  "first_reading": "2020-10-16",
  "gazette_date": null,
  "markdown": "2020-10-13\n\nBill as amended\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Appropriation  Act,  2020  to  provide  for  a\nreallocation of the expenditure appropriated for the year ending 31st March, 2021\nconsequent on the reorganization of services provided in the public service.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\nShort title\n\nAmendment of Schedule to the Act\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Appropriation Act, 2020 to provide for a reallocation\nof  the  expenditure  appropriated  for  the  year  ending  31st  March,  2021\nconsequent on the reorganization of services provided in the public service.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n\nThis Act may be cited as the Appropriation (Amendment) Act, 2020.\n\nAmendment of Schedule to the Act\n\n2.\nthereto and substituting the Schedule contained in the Schedule to this Act.\n\nThe Appropriation Act, 2020 is amended by deleting the Schedule\n\n\f5\n\n L.R.O. 1998\"SCHEDULE(Section 2)ABSTRACTS OF THE APPROPRIATION GRANTS10. Governor-General11. Ministry of the Public Service12. Parliament13. Prime Minister's Ofﬁ ce15. Cabinet Ofﬁ ce17. Ombudsman18. Audit19. Treasury27. Ministry of Tourism and International Transport29. Director of Public Prosecutions30. Attorney General31. Ministry of Innovation, Science and Smart  Technology $   1,988,865   8,759,327   9,200,000 125,319,624  15,598,529    457,265    944,249  54,000,000   7,338,095    816,688  74,724,405  14,141,075ServiceAppropriated for2020-2021\f6\n\n L.R.O. 1998ServiceABSTRACTS OF THE APPROPRIATION GRANTS - (Cont'd)Appropriated for2020-202132. Ministry of Foreign Affairs and Foreign Trade33. Ministry of Home Affairs, Information and Public Affairs34. Ministry of Finance, Economic Affairs and Investment 35. Ministry of People Empowerment and Elder Affairs39. Ministry of International Business and Industry 46. Ministry of Maritime Affairs and the Blue Economy50. Post Ofﬁ ce81. Ministry of Transport, Works and Water Resources82. Ministry of Environment and National Beautiﬁ cation83. Ministry of Agriculture and Food Security84. Ministry of Labour and Social Partnership Relations $  72,720,650  36,436,210 181,770,247  71,775,745  17,602,241  16,979,613   9,338,896  89,717,377  39,113,756  52,328,342   7,127,896Schedule - (Cont'd)\f7\n\n L.R.O. 1998ServiceAppropriated for2020-202186. Ministry of Health and Wellness87. Ministry of Education, Technological and Vocational Training91. Ministry of Youth, Sports and Community Empowerment92. Ministry of Energy, Small Business and Entrepreneurship93. Ministry of Housing, Lands and Maintenance $ 207,796,658 320,425,740  36,487,191  36,499,383  88,119,660 $1,597,527,727.\".ABSTRACTS OF THE APPROPRIATION GRANTS - (Concl'd)Schedule - (Concl'd)\f8\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n"
}