{
  "bill_id": 525,
  "slug": "resolution-re-emergency-health-management-extension-to-27th-march-2021-20201023",
  "title": "Resolution re Emergency Health  Management Extension to 27th March 2021 (2020-10-23)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/44410b5e46d0410074e8218830ff8eb1.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2020-10-23",
  "first_reading": "2020-10-27",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\n2020-10-23\n\nHOUSE OF ASSEMBLY\n\nWHEREAS by virtue of section 28A(1) of the Emergency Management Act,\n\nCap. 160A the Governor-General is satisﬁ ed that an emergency has arisen as a result of a\n\nperson or an animal having a communicable or a notiﬁ able disease, the Governor-General\n\nmay by Proclamation, on the advice of the Prime Minister after the Prime Minister has\n\nconsulted, or has been advised by, the Chief Medical Ofﬁ cer, declare that a public health\n\nemergency exists;\n\nAND WHEREAS by section 28A(2) of the said Act a Proclamation is issued\n\nunder section 28(1) and shall, unless previously revoked, remain in force for one month or\n\nfor such longer period, not exceeding 6 months, as the House of Assembly may determine\n\nby  a  resolution  supported  by  the  votes  of  a  majority  of  all  the  members  of  that  House;\n\nAND WHEREAS a Proclamation was issued on the 28th day of September,\n\n2020;\n\nAND WHEREAS the Proclamation has not been revoked and is due to expire\n\non the 27th day of October, 2020;\n\n\f2\n\nAND WHEREAS  the  House  of Assembly  has  by  a  vote  of  the  majority  of  all  the\n\nmembers thereof, determined by resolution to extend the said Proclamation;\n\nBE  IT  RESOLVED  that  the  Proclamation  aforesaid  is  hereby  extended  until  the\n\n27th day of March, 2021.\n\nAPPROVED by the House of Assembly this              day of                                                   ,\n\nTwo thousand and twenty.\n\nSpeaker\n\n"
}