{
  "bill_id": 52,
  "slug": "offences-against-the-person-amendment-bill-2014",
  "title": "Offences Against the Person (Amendment) Bill, 2014",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/1db7913f60c1ddf530d7c97c20edbd0f.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2014-11-03",
  "first_reading": "2014-11-07",
  "second_reading": "2015-01-27",
  "gazette_date": "2014-11-24",
  "passed_date": null,
  "markdown": "2014-09-01\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Offences  Against  the  Person  Act,  Cap.  141  to\nabolish  the  mandatory  imposition  of  the  penalty  of  death  for  the  offence  of\nmurder.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nAmendment of section 2 of Cap. 141\n\nInsertion of section 2A into Cap. 141\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Offences Against the Person Act, Cap. 141 to abolish\n\nthe mandatory imposition of the penalty of death for the offence of murder.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment) Act, 2014.\n\nThis  Act  may  be  cited  as  the  Offences  Against  the  Person\n\nAmendment of section 2 of Cap. 141\n\nThe Offences Against the Person Act, in this Act referred to as the\n2.\nprincipal Act, is amended by deleting section 2 and substituting the following:\n\n“Penalties for the offence of murder\n\n2.(1)\n\nA person who is convicted of murder shall be sentenced to\n\n(a)\n\n(b)\n\ndeath; or\n\nimprisonment for life.\n\nA  Court  may  sentence  a  person  convicted  of  murder  to  death\n\n(2)\nwhere\n\n(a)\n\nthe  murder  was  committed  with  a  high  level  of  brutality,\ncruelty, depravity, or callousness;\n\n(b)\n\nthe murder involved calculated or lengthy planning;\n\n(c)\n\n(d)\n\nthe deceased was a Judge, a Magistrate, the Director of Public\nProsecutions or a legal officer in the Department of Public\nProsecutions and the office of the deceased was a factor in\nthe commission of the offence;\n\nthe  deceased  was  a  member  of  the  Royal  Barbados  Police\nForce, a member of the Barbados Defence Force, a member\nof the Special Constabulary or a prison officer and the office\nof the deceased was a factor in the commission of the offence;\n\n(e)\n\nthe deceased was a member of a group of persons who have\na common characteristic such as race, nationality, ethnicity\n\n\f5\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\nor  religion  and  this  was  a  factor  in  the  commission  of  the\noffence;\n\nthe  deceased  was  a  witness  or  a  juror  in  a  pending  or\nconcluded trial and this was a factor in the commission of the\noffence;\n\nthe deceased was particularly vulnerable because of his age,\nhealth or disability or because of any other factor;\n\nthe person convicted was convicted of 2 or more offences of\nmurder, whether or not arising from the same circumstances;\nor\n\nin the opinion of the Court, there are any other exceptional\ncircumstances which must be taken into account and which\njustify the imposition of a sentence of death.\n\nWhere  the  Court,  having  considered  the  circumstances  of  the\n(3)\ncase, elects to sentence a person convicted of murder to imprisonment\nfor life the Court may order\n\n(a)\n\nthe term of imprisonment for life shall be served without the\npossibility of the grant of a release order where the Court is\nsatisfied that the person poses a serious danger to the public;\nor\n\n(b)\n\nthe term of imprisonment with the possibility for the grant of\na release order.\n\nWhere the Court sentences a person to death, and the sentence of\n(4)\ndeath is not executed within a period of 5 years from the date of the\nsentence, the sentence shall be commuted, by order of the Court, to a\nsentence of imprisonment for life without the possibility of the grant of\na release order.\n\nIn this section and in section 2A \"release order\" has the meaning\n\n(5)\nassigned to it by section 2 of the Prisons Act, Cap. 168 .”.\n\n\f6\n\nInsertion of section 2A into Cap. 141\n\n3.\n2, the following section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Review of existing sentences\n\n2A.(1)\nA person who, prior to the commencement of the Offences\nAgainst the Person (Amendment) Act, 2012, was convicted of murder\nand sentenced to death and\n\n(a)\n\nwhose sentence was not commuted under section 78 of the\nConstitution, 1966/1455 shall have\n\n(i)\n\nhis sentence set aside by the Chief Justice; and\n\n(ii)\n\na new sentence imposed, in accordance with section 2,\nby the Chief Justice; and\n\n(b)\n\nwhose  sentence  was  commuted  under  section  78  of  the\nConstitution, 1966/1455 shall have\n\n(i)\n\n(ii)\n\nhis sentence and the instrument by which the sentence\nwas commuted, set aside; and\n\na new sentence imposed, in accordance with section 2,\nby the Chief Justice.\n\nNotwithstanding  section  2(1),  a  person  whose  sentence  is\n(2)\nreviewed  under  subsection  (1)  shall  not  be  subject  to  a  sentence  of\ndeath.\n\nA judge shall, in imposing a new sentence under subsection (1),\n\n(3)\nconsider\n\n(a)\n\nthe circumstances or facts of the offence and degree of the\ninvolvement of the offender in the offence;\n\n\f7\n\n(b)\n\nthe age of the offender;\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nthe personal circumstances of the offender such as his social\nor economic circumstances;\n\nwhether the offender pleaded guilty and the point at which\nthe guilty plea was made;\n\nany  attempt  by  the  offender  to  make  reparation  for  the\noffence;\n\nany written representation made by a spouse or a relative of\nthe  deceased  who  has  suffered  physically,  emotionally,\npsychologically or financially as a result of the commission\nof the offence;\n\n(g)\n\nany representations made on the behalf of the offender by his\nattorney-at-law;\n\n(h)\n\nany representations made by the prosecution; and\n\n(i)\n\nany other circumstances which, in the opinion of the judge,\nmust be taken into account.”.\n\n\f8\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2014.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2014.\n\nPresident\n\n"
}