{
  "bill_id": 530,
  "slug": "drug-abuse-prevention-and-control-amendment-bill-2020",
  "title": "Drug Abuse (Prevention and Control) (Amendment) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/0ea7e3e8e12c3a619708f6b1f889679f.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-03-08",
  "first_reading": "2021-03-26",
  "gazette_date": "2020-12-07",
  "markdown": "2021-03-05\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Drug  Abuse  (Prevention  and  Control)  Act,\nCap.  131,  to  provide  for  the  payment  of  a  fixed  penalty  for  persons  found  in\npossession of small quantities of cannabis.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nInsertion of sections 6A and 6B into Cap. 131\n\nAmendment of the principal Act\n\nSCHEDULE\n\nNotice of Fixed Penalty\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Drug Abuse (Prevention and Control) Act, Cap. 131,\nto provide for the payment of a fixed penalty for persons found in possession\nof small quantities of cannabis.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment) Act, 2021.\n\nThis Act may be cited as the Drug Abuse (Prevention and Control)\n\nInsertion of sections 6A and 6B into Cap. 131\n\nThe Drug Abuse (Prevention and Control) Act, Cap. 131, in this Act\n2.\nreferred  to  as  the  principal  Act,  is  amended  by  inserting  immediately  after\nsection 6 the following new sections:\n\n“Fixed penalty\n\n6A.(1)\nNotwithstanding section 6(2), a member of the Police Force\nmay serve on a person whom he has reasonable cause to believe has no\nmore than 14 grammes of cannabis in his possession, a notice in the\nform set out in Part I of the Third Schedule, offering him an opportunity\nof discharging any liability that would arise out of a conviction for that\noffence by payment of a fixed penalty, in the amount set out in Part II\nin the Third Schedule.\n\nWhere a person referred to in subsection (1) is under the age of\n(2)\n18 years he shall, in addition to paying the fixed penalty referred to in\nthat subsection, within 14 days of the service on him of the fixed penalty\nnotice,  attend  the  National  Council  on  Substance  Abuse  for  an\nassessment  and  undergo  counselling  for  such  period  as  the  Council\nrecommends.\n\n(3)\n\nWhere a person referred to in subsection (1) is\n\n(a)\n\n(b)\n\n18 years of age or older; and\n\nthe  member  of  the  Police  Force  issuing  the  notice  has\nreasonable cause for believing that he is addicted to cannabis\n\n\f5\n\nthe member of the Police Force may direct that person to attend the\nNational Council on Substance Abuse for assessment and counselling.\n\nA notice referred to in subsection (1) shall be served personally\n\n(4)\non the person alleged to have committed the offence and shall\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\ncontain a statement of the offence alleged;\n\ncontain such particulars of the offence as are necessary for\ngiving reasonable information of the allegation;\n\nspecify  a  period  of  30  days  for  the  payment  of  the  fixed\npenalty;\n\nspecify that it is required for the person to attend the National\nCouncil on Substance Abuse for assessment and counselling\nin accordance with subsection (2) or (3), as the case may be;\n\n(e)\n\ncontain the amount of the fixed penalty; and\n\n(f)\n\nspecify the magistrate's court to the clerk of which the fixed\npenalty is to be paid;\n\nWhere a person referred to in subsection (1) disputes that he is\n\n(5)\nin possession of cannabis, he may be prosecuted under section 6(2).\n\nThe fixed penalty under this section shall be paid to the clerk of\n(6)\nthe magistrate’s court stated in the notice given pursuant to subsection\n(1).\n\nIn any criminal proceedings for an offence under this section, a\n(7)\ncertificate that payment of a fixed penalty was or was not made to the\nclerk of the magistrate’s court by the date specified in the certificate\nsigned by the clerk is prima facie evidence of the facts stated therein.\n\n(8)\n\nA person who is under the age of 18 years who fails to\n\n(a)\n\npay the fixed penalty; and\n\n\f6\n\n(b)\n\nattend  the  National  Council  on  Substance  Abuse  for\nassessment and counselling\n\nin the time specified in the notice is guilty of an offence and is liable\non summary conviction to a fine of $1 000.\n\n(9)\n\nA person who is 18 years of age or older who fails to\n\n(a)\n\n(b)\n\npay the fixed penalty; or\n\nattend  the  National  Council  on  Substance  Abuse  for\nassessment and counselling\n\nin the time specified in the notice is guilty of an offence and is liable\non summary conviction to a fine of $1 000.\n\nWhere the Court acts in accordance with subsection (7), the Court\n(10)\nmay, where it considers it appropriate in the circumstances, deal with\nthe  offender  in  accordance  with  the  provisions  of  the  Penal  System\nReform Act, Cap. 139.\n\nA person who, defaces, destroys or mutilates a notice referred to\n(11)\nin  subsection  (1)  is  guilty  of  an  offence  and  is  liable  on  summary\nconviction to a fine of $1 000 or to imprisonment for a term of one\nmonth.\n\nThe  Minister  may,  by  order,  amend,  vary  or  revoke  the Third\n\n(12)\nSchedule.\n\nExpungement of conviction\n\n6B.\nNotwithstanding  the  provisions  of  the  Criminal  Records\n(Rehabilitation of Offenders) Act, Cap. 127A, a person convicted for\nthe offence of possession of not more than 14 grammes of cannabis who\nhas served his sentence, whether custodial or non-custodial,\n\n(a)\n\n(b)\n\nshall be deemed to be rehabilitated; and\n\nhis conviction shall be deemed to be expunged.”.\n\n\f7\n\nAmendment of the principal Act\n\n3.\n\nThe principal Act is amended by\n\n(a)\n\nrenumbering  the  Third  Schedule,  Fourth  Schedule  and  Fifth\nSchedule  as  the  Fourth  Schedule,  Fifth  Schedule  and  Sixth\nSchedule, respectively; and\n\n(b)\n\ninserting as the Third Schedule, the Third Schedule contained in the\nSchedule to this Act.\n\n\f8\n\nL.R.O. 1998SCHEDULE(Section 3)\"THIRD SCHEDULE(Section 6A(1))PART IDrug Abuse (Prevention and Control) ActCap. 131NOTICE OF FIXED PENALTYSection  AName:Address:National Registration No.:                                            Telephone No.:Name of Parent/Guardian (if applicable):Place apprehended:on the                         day of  20             in circumstances \f9\n\n L.R.O. 1998giving me reasonable cause to believe that you committed an offence, to wit, possessionof cannabis, contrary to section 6(2) of the Drug Abuse (Prevention and Control) Act, Cap. 131, in that you had in your possession       grammes of cannabis, contrary to section 6(2) of the said Act.Instructions to OffenderIf before the end of THIRTY (30) DAYS from the above date, the sum of $200.00 (being the ﬁ xed penalty for the offence) is paid to the Clerk at District     Magistrate's Court, the Police will not take proceedings for the offence, and any liability to conviction for the offence will be discharged. Cash should be paid to the Clerk. Cheques, postal orders or money orders may be sent by post and made payable to the Clerk of the Magistrate's Court of  District        . A receipt for the payment will be given. Part payment will not be accepted by the Clerk. The person paying the ﬁ xed penalty must forward with the remittance, Section B of this notice or identify this notice by quoting its serial number. If the ﬁ xed penalty is not paid, further action may be taken.Third Schedule - (Cont'd)(Signature of Police Ofﬁ cer)(Number)\f10\n\n L.R.O. 1998Section B Serial No.(of notice)To: Clerk of District          Magistrate's Court I enclosed the sum of $200.00 as payment of the ﬁ xed penalty for the offence mentioned in Part A of this notice.Name:Address:(If the offender is a minor this section shall be completed by the parent or guardian of the minor.)Third Schedule - (Cont'd)(Signature)(Date)\f11\n\n L.R.O. 1998Section CTo: Manager National Council on Substance Abuse 'The Armaira Building' Cnr. 1st Avenue and Pine Road  Belleville St. MichaelThe undermentioned person,Name:Address:Name of Parent/Guardian (if applicable):Date of Birth:       , who was in possession of no more  than14 grammes of cannabis being under the age of 18 years being 18 years of age or over and who I have reasonable cause to believe to be addicted to cannabisis referred for assessment and counselling.Third Schedule - (Cont'd)(Signature of Police Ofﬁ cer)(Number)\f12\n\n L.R.O. 1998Instructions to OffenderThe offender shall report to the National Council on Substance Abuse within FOURTEEN DAYS of receipt of this Notice. If the offender is under the age of 18 years, the offender should be accompanied by their parent or guardian.The National Council on Substance Abuse is located at 'The Amaira Building', Corner of 1st Avenue and Pine Road, Belleville, St. Michael, telephone number (246) 535-6272. The ofﬁ ce is open to the public between 8:00 am to 4:30 pm Mondays to Fridays, excepton public holidays.  \f13\n\n L.R.O. 1998PART IIFIXED PENALTYFixed penalty $200.00\".Third Schedule - (Concl'd)\f14\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2021.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2021.\n\nPresident\n\n"
}