{
  "bill_id": 531,
  "slug": "barbados-humanitarian-service-award-bill-2020",
  "title": "Barbados Humanitarian Service  Award Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/f46d128126aaaa02fd3affe41bf1965b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-12-16",
  "first_reading": "2020-12-18",
  "gazette_date": "2020-12-14",
  "markdown": "2020/12/03\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the conferment of an award, to be known as the\n“Barbados  Humanitarian  Service  Award”,  on  persons  who  are  deserving  of\nrecognition for their meritorious humanitarian service to Barbados and for related\nmatters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nShort title\n\nInterpretation\n\nEstablishment of Award\n\nConferment of Award\n\nEligibility for conferment of Award\n\nPublication\n\nInsignia\n\nRegulations\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  provide  for  the  conferment  of  an  award,  to  be  known  as  the\n“Barbados Humanitarian Service Award”, on persons who are deserving of\nrecognition  for  their  meritorious  humanitarian  service  to  Barbados  and  for\nrelated matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nAct, 2020.\n\nThis Act may be cited as the Barbados Humanitarian Service Award\n\nInterpretation\n\n2.\n\nIn this Act, “Award” means the award established by section 3.\n\nEstablishment of Award\n\n3.\nService Award”.\n\nThere is established an award entitled the “Barbados Humanitarian\n\nConferment of Award\n\n4.(1)\nunder the Public Seal confer the Award upon a person referred to in section 5.\n\nSubject to subsection (3), the Governor-General may by instrument\n\nThe power conferred on the Governor-General by subsection (1), shall be\n\n(2)\nexercised by him on the advice of the Prime Minister.\n\nThe conferment of the Award shall take effect from the date of the affixing\n(3)\nof  the  Public  Seal  or  from  such  other  date  as  may  be  specified  in  the\ninstrument.\n\nThe Award may be conferred on an eligible person at a time determined\n\n(4)\nby the Cabinet of Barbados.\n\nEligibility for conferment of Award\n\n5.\nis eligible for the conferment of the Award.\n\nA person who renders outstanding humanitarian service to Barbados\n\n\f5\n\nPublication\n\nThe Prime Minister shall by order published in the Official Gazette\n6.\npublish  the  names  of  those  persons  upon  whom  the  “Barbados  Humanitarian\nService Award” is conferred.\n\nInsignia\n\nA  person  referred  to  in  section  5  upon  whom  the  Award  has  been\n7.\nconferred  is  entitled  to  wear  as  a  decoration  the  prescribed  insignia  of  the\nBarbados Humanitarian Service Award.\n\nRegulations\n\n8.(1)\n\nThe Governor-General may make regulations providing for\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe insignia of the Award;\n\ninvestitures in relation to the Award;\n\nthe wearing of insignia issued in relation to the Award;\n\nthe prevention of abuses in the wearing of insignia issued in relation\nto the Award; and\n\n(e)\n\ngenerally giving effect to the provisions of this Act.\n\nAll  regulations  made  under  this  section  shall  be  subject  to  affirmative\n\n(2)\nresolution.\n\n"
}