{
  "bill_id": 533,
  "slug": "resolution-re-vesting-of-land-at-bay-street-to-barbados-tourism-investment-inc",
  "title": "Resolution re vesting of land at Bay Street to Barbados Tourism Investment Inc",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/fd44c573f827d31c6653bd08b38db34c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-12-09",
  "first_reading": "2020-12-18",
  "gazette_date": null,
  "markdown": "                                                                                                                                2020-11-27\n\nPARLIAMENT\n\nRESOLVED that Parliament, in accordance with section 5 of the Crown Lands (Vesting\n\nand  Disposal) Act,  Cap.  225,  approve  the  vesting  in  the  Barbados Tourism  Investment  Inc.,  a\n\ncompany incorporated under the Companies Act, Cap. 308 of the parcel of land, the property of\n\nthe Crown situate at Bay Street in the parish of Saint Michael in this Island, more particularly\n\ndescribed  in  the  Schedule  to  this  Resolution  for  the  public  purpose  of  tourism  development.\n\nAPPROVED by the House of Assembly this            day of                               , Two\n\nthousand and twenty.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                          , Two\n\nthousand and twenty.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL THAT land the property of the Crown situate at Bay Street in the parish of\n\nSaint Michael in this Island containing by admeasurement 24.5 square metres or thereabouts in\n\nbeach Abutting and Bounding on lands now or formerly of the Barbados Government on lands\n\nnow or formerly of Barbados Tourism Investment Inc. on the sea and on lands now or formerly\n\nof Vision Development Inc. or however else the same may abut and as shown and delineated on a\n\nPlan certiﬁ ed on the 4th day of December, 2019 by Camille Belgrave, Land Surveyor and recorded\n\nin the Lands and Surveys Department on the 6th day of December, 2019 as Plan No. 1512/2019.\n\n\f3\n\nADDENDUM\n\nThe  Cabinet  at  its  meeting  on  the  25 th  day  of  April,  2019  agreed  to\n\nvest  69.0  square  metres  of  land  (in  drain),  situate  at  Bay  Street  in  the  parish  of\n\nSaint Michael, in this Island, in the Barbados Tourism Investment Inc. a company incorporated\n\nunder the Companies Act, Cap. 308.\n\nIn  accordance  with  section  5  of  the  Crown  Lands  (Vesting  and  Disposal)  Act,\n\nCap.  225,  Parliament  approved  the  vesting  of  69.0  metres  of  land  (in  drain)  in  Barbados\n\nTourism  Investment  Inc.  by  Resolution  12/2019.    However,  with  beach  accretion,  the  area  of\n\nland (in drain) has increased by 24.5 square metres.\n\nThe  Cabinet,  at  its  meeting  held  on  the  26th  day  of  November,  2020,  agreed  to\n\nvest  the  additional  24.5  square  metres  of  land  (in  beach)  the  property  of  the  Crown  situate  at\n\nBay  Street  in  the  parish  of  Saint  Michael  in  this  Island  in  Barbados  Tourism  Investment  Inc.\n\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and\n\nDisposal) Act, Cap. 225, the approval of Parliament is now sought for the vesting in Barbados\n\nTourism  Investment  Inc.  of  the  additional  parcel  of  land  more  particularly  described  in  the\n\nSchedule to this Resolution.\n\n"
}