{
  "bill_id": 534,
  "slug": "resolution-re-the-abandonment-of-acquisition-of-land-at-harrismith-st-philip",
  "title": "Resolution re the abandonment of  acquisition of Land at Harrismith, St. Philip",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/4cb3957cba4708cd359f92d6fb4aa52a.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-01-13",
  "first_reading": "2021-03-26",
  "gazette_date": null,
  "markdown": "2020-10-13\n\nPARLIAMENT\n\nRESOLVED that Parliament approve the publication, in the Ofﬁ cial Gazette of a\n\nnotiﬁ cation under section 9(1) of the Land Acquisition Act, Cap. 228 declaring the abandonment\n\nof the compulsory acquisition of the parcel of land situate at Harrismith in the parish of Saint\n\nPhilip in this Island more particularly described in the Schedule hereto.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and Twenty.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                                               , Two\n\nthousand and Twenty.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  the  property  of  the  Crown  situate  at  Harrismith  in  the  parish  of\n\nSaint Philip in this Island formerly said to contain by estimation 10.5 hectares but by a recent\n\nsurvey  found  to  contain  by  admeasurement  10.9041  hectares  (or  109041.0  square  metres)\n\nmade up of two parcels namely, Parcel “A” being 8.4108 hectares (or 84108.0 square metres)\n\nand Parcel “B” being 2.4933 hectares (or 24933.0 square metres) or thereabouts Abutting and\n\nBounding on lands now or formerly of Samuel Waithe (Lot 330), on lands now or formerly of\n\nPeter  Waterman  (Lot  331),  on  lands  now  or  formerly  of  Simon  and  Charmaine  Griffith\n\n(Lot 338), on lands now or formerly of Leo F. Brewster (Lot 339), on an Open Space, on lands\n\nnow or formerly of Terry K. Clarke (Lot 346), on lands now or formerly of Carlos H. S. and\n\nWayne A. Hunte (Lot 347), on lands now or formerly of Trebla Inc., on a right of way 3.66\n\nmetres wide leading to a public road in one direction, on lands now or formerly of Barlow and\n\nPauline Lynch, on lands now or formerly of Edward B. Bowring on three sides, on the sea with an\n\n undercut of 3.0 metres from the cliff’s edge, on an Open Space, on lands now or formerly of\n\nWellhouse Villas Limited (Lot 1), on lands now or formerly of Garvey Corporation (Lot 5), on\n\nlands now or formerly of Michael L. Rose (Lot 7), on lands now or formerly of Victor Carter\n\n(Lot 9), on lands now or or formerly of Richard J. Rawlinson (Lot 9A), on lands now or formerly\n\nof Buzinec & Co. (Lot 11), on lands now or formerly of Dawn Marie Greenidge (Lot 13), on\n\nlands now or formerly of Denise A Miller (Lot 15), on lands now or formerly of Randolph and\n\n\f3\n\nSCHEDULE - (Concl'd)\n\nMiriam Bradshaw (Lot 17), on lands now or formerly of Vova Khavin (Lot 19), on lands now or\n\nformerly of Learie F. Scott (Lot 21), on lands now or formerly of Harold D. Johnson (Lot 23),\n\non lands now or formerly of Caston D. Marshall (Lot 25), on lands now or formerly of Caren\n\nRawlins (Lot 27), on lands now or formerly of Kendrick L. Forde (Lot 29), on lands now or\n\nformerly  of  Laura  Beckles-Cragwell  (Lot  31),  on  lands  now  or  formerly  of  David  S.  Clarke\n\n(Lot  33),  on  lands  now  or  formerly  of  Charles  E.U.  Ledette  (Lot  35),  on  a  road  leading  to\n\nWellhouse in one direction and to Highway 5 in another direction, on Lots 1 and 6, on a road,\n\non Lots 5, 4, 3 and 2, on a road leading to Wellhouse in one direction and to Highway 5 in\n\nanother direction or however else the same may abut and bound as shown and delineated on a Plan\n\ncertiﬁ ed on the 12th day of September, 2017 by Camille Belgrave, Land Surveyor and recorded\n\nin the Lands and Surveys Department on the 12th day of October, 2017 as Plan No. 996/2017.\n\n\f4\n\nADDENDUM\n\nThe  Cabinet  at  its  meeting  held  on  the  21st  day  of  July,  2016  agreed  to  the\n\nacquisition of a parcel of land from Marriott Barbados Limited totalling approximately 10.5\n\nhectares at Harrismith in the parish of Saint Philip for housing and tourism development.\n\n  In  accordance  with  the  provisions  of  section  3  of  the  Land  Acquisition  Act,\n\nCap. 228, a Notice pertaining to the parcel of land described in the Schedule herein was published\n\nby Statutory Instrument on the 19th day of September, 2016, the 22nd day of September, 2016\n\nand the 26th day of September, 2016.\n\nThe  Resolution  to  acquire  the  parcel  of  land  described  in  the  Schedule  herein\n\nwas approved by the House of Assembly on the 28th day of January, 2020, approved by the\n\nSenate on the 5th day of February, 2020, assented to by the Governor-General on the 11th day of\n\nFebruary, 2020 and published in the Ofﬁ cial Gazette as Resolution No. 4/2020 on the 13th day\n\nof February, 2020.\n\nThe Cabinet at its meeting held on the 3rd day of September, 2020 agreed to the\n\nabandonment of the said acquisition on the land described in the Schedule herein at Harrismith,\n\nin the parish of Saint Philip.\n\n\f5\n\nADDENDUM - (Concl'd)\n\nIn accordance with the provisions of section 9 of the Land Acquisition Act, Cap. 228\n\nthe approval of Parliament is now sought for the publication of the Notice of Abandonment as\n\nrequired by section 9(1) of the Land Acquisition Act, Cap. 228 for the parcel of land mentioned\n\nin the Schedule herein.\n\n"
}