{
  "bill_id": 535,
  "slug": "resolution-re-lease-to-the-duke-of-edinburghs-international-award-barbados-charity",
  "title": "Resolution re Lease to the Duke  of Edinburghs International Award Barbados Charity",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/f76ab5e98d044c0de7fa21b138c12920.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-01-13",
  "first_reading": "2021-03-26",
  "gazette_date": null,
  "markdown": "2020-11-18\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the  Crown\n\nLands  (Vesting  and  Disposal)  Act,  Cap.  225  approve  the  lease  to  the  Duke  of  Edinburgh's\n\nInternational Award  Barbados  Charity,  a  charity  registered  as  Charity  No.  214  under  the\n\nCharities  Act,  Cap.  243,  of  the  parcel  of  land,  the  property  of  the  Crown,  namely  Lot  2,\n\nbeing  part  of  the  property  known  as  Culloden  Farm  in  the  parish  of  Saint  Michael  in  this\n\nIsland and more particularly described in the First Schedule to this Resolution on the terms and\n\nconditions set out in the Second Schedule, to be used as a headquarters-base to house the Duke of\n\nEdinburgh's International Award Barbados Charity and to facilitate its development programmes.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and twenty.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                            day  of                                                    ,\n\nTwo thousand and twenty.\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL THAT land the property of the Crown, namely Lot 2, being part of the property\n\nknown  as  Culloden  Farm  in  the  parish  of  Saint  Michael  in  this  Island  containing  by\n\nadmeasurement  15634.3  square  metres  or  thereabouts  abutting  and  bounding  on  Hugh\n\nJohnson Link Road, on lands of the Barbados Government, on lands now or late of Perl Goodridge\n\n(Lot 13), on lands now or formerly of the National Housing Corporation (Lot 12), on lands now or\n\nlate of Roger Butcher (Lot 11), Clive Roberts (Lot 10), Reuben Briggs (Lot 9), Noel Christie (Lot 8),\n\nAlbert Callendar (Lot  7), Doreen Grant (Lot 6), Ricardo King (Lot 5), Leomie Herbert (Lot 4),\n\nJoyce Prince (Lot 3), Eastmond Shepherd (Lot 2) and  Johann Holder (Lot 1), on lands now or\n\nformerly of the Diocesan Trustees of the Anglican Church, on lands now or formerly of the National\n\nInsurance Board, on lands of the Barbados Government (Lot 1), on a right of way 4.20 metres wide\n\nand  on  Frederick  Lane  Drive  or  however  else  the  same  may  abut  and  bound  together\n\nwith  the  buildings  thereon  as  shown  and  delineated  on  a  plan  certified  on  the  12th  day\n\nof  August,  2019  by  Anderson  R.  Alleyne,  Land  Surveyor  and  recorded  in  the  Lands\n\nand  Surveys  Department  on  the  29th  day  of  October,  2019  as  Plan  No.  1345  of  2019.\n\n\f3\n\nSECOND SCHEDULE\n\nTERMS AND CONDITIONS\n\nThe lease to the Duke of Edinburgh's International Award Barbados Charity of the parcel\n\nof land, the property of the Crown, namely Lot 2, being part of the property known as\n\nCulloden Farm in the parish of Saint Michael in this Island and more particularly described\n\nin the First Schedule is on the following terms and conditions:\n\n(a)\n\nthe lease shall be for a period of twenty-ﬁ ve (25) years with an option to renew\n\nfor a further period of twenty-ﬁ ve (25) years;\n\n(b)\n\nan initial concessionary rate of one thousand, two hundred dollars ($1,200.00)\n\nper annum shall be paid by the Duke of Edinburgh's International Award Barbados\n\n(c)\n\n(d)\n\n(e)\n\nCharity during the ﬁ rst ﬁ ve (5) years of the lease;\n\nrent reviews shall take place at ﬁ ve-yearly intervals;\n\nthe premises shall revert  to the Crown for nil consideration at the end of the lease;\n\nthe  lease  shall  have  a  five-year  notice  break  clause  exercisable  after  the\n\nsecond rent review, allowing either party to bring it to an end;\n\n(f)\n\nthe  Crown shall  compensate  the  Duke of  Edinburgh's International Award\n\nBarbados Charity with the market renovated costs less any depreciation at the date of\n\nresumption should the lease be brought to an end by the Crown;\n\n(g)\n\nthe  Duke  of  Edinburgh's  International  Award  Barbados  Charity  shall  be\n\nresponsible for insurance of the buildings, public liability and occupiers' liability\n\nat  the  premises,  the  repairs  and  maintenance  of  the  buildings,  the  payment  of\n\nutilities and other outgoings arising out of the use of the site;\n\n(h)\n\nthe Duke of Edinburgh's International Award Barbados Charity shall  bear the cost\n\nof  development  of  the  site  and  shall  comply  with  Town  Planning  and  other\n\nstatutory requirements;\n\n\f4\n\nSecond Schedule - (Concl'd)\n\n(i)\n\nthe  Duke  of  Edinburgh's  International  Award  Barbados  Charity  shall  be\n\nresponsible for the full restoration of the \"main house\" to its original architectural\n\nform within the ﬁ rst ﬁ ve (5) years of the initial lease period;\n\n(j)\n\nthe  Duke  of  Edinburgh's  International  Award  Barbados  Charity  shall\n\nadvise  the Ministry of Housing, Lands and Maintenance of the replacement cost\n\nof  the  buildings  and  plant  on  site  on  completion  of  the  refurbishment  or\n\nimprovements;\n\n(k)\n\nthe Duke of Edinburgh's International Award Barbados Charity shall not assign\n\nor  otherwise  dispose  of  the  property  by  lease  or  part  with  possession  without\n\nthe  prior  written  consent  of  the  Crown;  such  consent  not  to  be  unreasonably\n\nwithheld.\n\n\f5\n\nADDENDUM\n\n  By Conveyance dated the 25th day of September, 1964 between Courtnay D. Marshall of the\n\nOne Part and the Crown of the Other Part two parcels of land situate in Saint Michael were purchased\n\nby the Crown: (a) 8 acres 2 perches of land together with the building known as \"Culloden\n\nHouse\";  and  (b)15,150  square  feet  of  land  together  with  the  building  known  as  \"Flodden\".\n\n  The Ministry of Housing, Lands and Maintenance by Application No. 0163/02/2018B\n\ndated  the  12th  day  of  February,  2018,  applied  for  permission  to  subdivide  lands  situate  at\n\nCulloden  Farm  in  the  parish  Saint  Michael  into  two  lots,  Lots  1  and  2,    for  commercial\n\npurposes.  The Chief Town Planner granted permission for the subdivision subject to attached\n\nconditions  under  Permission  Ref.  No.  0163/02/2018B  dated  the  28th  day  of  June,  2018.  In\n\ncompliance with Condition No. 2 of the Permission, a plan of the subdivision of 16900.4 square\n\nmetres of Crown land was approved by the Chief Town Planner on the 11th day of  September, 2019.\n\nBy Certiﬁ cate of Compliance Reference No. 0163/02/2018B dated the 28th day of February,\n\n2020, the Chief Town Planner certiﬁ ed that Condition No. 2 attached to the Permission was\n\nsatisfactorily discharged and that there were no objections to the sale, lease or other disposal of the lots.\n\n  The Cabinet at its meeting held on the 7th day of March, 2019, considered Note (19)\n\n245/MHLR 08 and agreed to the lease of Lot 2 of the sub-divided lots, which is described in\n\nthe First Schedule to this Resolution to the Duke of Edinburgh's International Award Barbados\n\nCharity to be used as a headquarters-base to house the charity and to facilitate its development\n\nprogrammes under the terms and conditions set out in the Second Schedule.\n\n  In  accordance  with  the  provisions  of  section  5  of  the  Crown  Lands  (Vesting  and\n\n Disposal) Act, Cap. 225, the approval of Parliament is now sought for the lease to the Duke of\n\nEdinburgh's International Award Barbados Charity of the Crown lands described in the First\n\nSchedule on the terms and conditions set out in the Second Schedule.\n\n"
}