{
  "bill_id": 537,
  "slug": "companies-amendment-bill-2020",
  "title": "Companies (Amendment) Bill, 2020",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/14ad9ce305d6dd0d28e49f2c3b4d4997.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2020-12-16",
  "first_reading": "2020-12-18",
  "gazette_date": "2020-12-14",
  "markdown": "2020-12-08\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Companies Act, Cap. 308.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nAmendment of section 175 of Cap. 308\n\nInsertion of section 448A into Cap. 308\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Companies Act, Cap. 308.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Companies (Amendment) Act, 2020.\n\n\f4\n\nAmendment of section 175 of Cap. 308\n\n2.\nSection 175 of the Companies Act, Cap. 308, in this Act referred to\nas the principal Act, is amended by inserting immediately after subsection (4),\nthe following new subsections:\n\n“(5)\n\nThe Registrar may require a company to produce\n\n(a)\n\n(b)\n\nany books, records or other documents required to be kept by\nthe company under any provision of this Act; and\n\nsuch other information as the Registrar may require for the\nproper administration and enforcement of this Act.\n\nNotwithstanding subsection (4), the Registrar may examine, or\n(6)\nby instrument in writing, appoint, at the expense of a company, a person\nto examine, any books, records and other documents required to be kept\nby the company under any provision of this Act\n\n(a)\n\n(b)\n\n(c)\n\nin order to ascertain whether the company is in compliance\nwith this Act;\n\nwhere the Registrar has reasonable grounds to suspect that\nthe company may be in contravention of this Act; or\n\nwhere the examination is otherwise necessary for the proper\nadministration and enforcement of this Act.\n\nFor the purposes of subsection (6), the Registrar or the person\n(7)\nappointed by the Registrar may, in connection with an examination,\nrequire an auditor, director, officer or affiliate of a company or a person\nwho, whether alone or in association with others, owns or controls the\ncompany to\n\n(a)\n\nfurnish  such  information  as  the  Registrar  or  the  person\nappointed by him may consider necessary for the purpose of\nthe examination; and\n\n\f5\n\n(b)\n\nproduce  for  examination  any  books,  records  or  other\ndocuments relating to the business of the company that are in\nhis  possession  and  contain,  or  are  likely  to  contain,  such\ninformation.\n\nThe Registrar may require a company to pay the expenses of any\n(8)\nexamination  carried  out  by  or  on  behalf  of  the  Registrar  under  this\nsection.\n\nA person who is required to make a disclosure to the Registrar\n(9)\nor to a person appointed by the Registrar under subsection (6) shall not,\nby reason of making the disclosure, be regarded as being in breach of\na duty to the company.\n\nThe Registrar may give directions to a company for the purpose\n\n(10)\nof compliance with this section.\n\nWhere  a  company  fails  to  pay  the  expenses  referred  to  in\n(11)\nsubsection  (8),  the  expenses  may  be  recovered  as  a  debt  due  to  the\nCrown before a magistrate for District ‘A’.\n\nA  person  who,  without  reasonable  cause,  is  in  default  in\n(12)\ncomplying  with  a  requirement  under  subsection  (5),  (6)  or  (7)  or  a\ndirection given under subsection (10)\n\n(a)\n\n(b)\n\nis liable to a penalty of $5,000 payable to the Registrar; and\n\nif  the  penalty  is  not  paid  on  the  due  date,  is  liable  to  an\nadditional  penalty  of  $500  for  everyday  during  which  the\ndefault continues not exceeding $15 000.\n\nA  person  who,  without  reasonable  cause,  continues  to  be  in\n(13)\ndefault in complying with a requirement or a direction referred to in\nsubsection (12) after the maximum additional penalty referred to in that\nsubsection  becomes  payable,  is  guilty  of  an  offence  and  liable,  on\nsummary conviction, to a fine of $100,000 or to imprisonment for a\nterm of 5 years or to both.\n\n\f6\n\n(14)\nWhen an offence under subsection (13) is committed by a body\ncorporate and a director or officer of that body corporate knowingly\nauthorised, permitted or acquiesced in the commission of the offence,\nthe director or officer is also guilty of the offence and liable on summary\nconviction, to a fine of $100,000 or to imprisonment for a term of 5\nyears or to both.”.\n\nInsertion of section 448A into Cap. 308\n\n3.\n448 the following new section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Guidelines on beneficial ownership etc.\n\n448A.(1)\nThe Registrar may, in furtherance of paragraphs (e) and\n(e.1) of section 448, issue guidelines on the application or interpretation\nof the term “beneficial ownership” and the identification of beneficial\nowners whether by reference to thresholds in respect of ownership or\ncontrol or otherwise.\n\n(2)\nAny person who fails to comply with a guideline issued under\nsubsection  (1)  is  guilty  of  an  offence  and  is  liable  on  summary\nconviction to a fine of $100,000 or to imprisonment of a term of 5 years\nor to both.”.\n\n\f7\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2020.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2020.\n\nPresident\n\n"
}