{
  "bill_id": 53,
  "slug": "constitution-amendment-bill-2014",
  "title": "Constitution (Amendment) Bill, 2014",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/bd5e1e248c53f832b937f5554c3ab874.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2014-11-03",
  "first_reading": "2014-11-07",
  "second_reading": null,
  "gazette_date": "2014-11-24",
  "passed_date": null,
  "markdown": "Explanatory Memorandum after page 7\n\n2014-09-30\n\nOBJECTS AND REASONS\n\nThis Bill would alter the Constitution of Barbados in order to\n\n(a)\n\n(b)\n\n(c)\n\nremove  the  provision  authorising  a  mandatory  sentence  of  death  in\nsection 15;\n\namend section 26 to redefine the effect of existing law in relation to\nthe fundamental rights provisions; and\n\nrefine  the  exercise,  by  the  Governor-General,  of  the  Prerogative  of\nMercy.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nRepeal and replacement of section 15 of the Constitution\n\nRepeal and replacement of section 26 of the Constitution\n\nRepeal and replacement of section 78 of the Constitution\n\n1.\n\n2.\n\n3.\n\n4.\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to alter the Constitution of Barbados.\n\nENACTED by the Parliament of Barbados in accordance with the provisions\n\nof section 49 of the Constitution as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Constitution (Amendment) Act, 2014.\n\n\f4\n\nRepeal and replacement of section 15 of the Constitution\n\n2.\nsubstituted:\n\nSection  15  of  the  Constitution  is  deleted  and  the  following  is\n\n“Protection from inhuman treatment\n\n15.(1)\ndegrading punishment or other treatment.\n\nNo  person  shall  be  subjected  to  torture  or  to  inhuman  or\n\n(2)\nNothing contained in or done under the authority of any law shall\nbe held to be inconsistent with or in contravention of this section to the\nextent that the law in question authorises\n\n(a)\n\n(b)\n\nthe imposition of a sentence of death or the execution of that\nsentence; or\n\nthe holding of a person who is in prison or otherwise lawfully\ndetained under conditions or arrangements prescribed by or\nunder  the  Prisons  Act,  Cap.  168,  or  under  any  other  law,\npending the execution of a sentence of death or in accordance\nwith any other sentence of the court.”.\n\nRepeal and replacement of section 26 of the Constitution\n\n3.\nsubstituted:\n\nSection  26  of  the  Constitution  is  deleted  and  the  following  is\n\n“Existing law\n\n26.(1)\nThe existing law shall continue to be in force but shall be\nconstrued  with  such  modifications,  adaptations,  qualifications  and\nexceptions as may be necessary to bring it into conformity with sections\n12 to 23 of this Constitution.\n\n\f5\n\n(2)\nThe Attorney-General may, within 5 years of the date of the 1st\nday of December, 2014, make such amendments to any existing law as\nmay be necessary or expedient to bring that law into conformity with\nsections 12 to 23 of this Constitution or otherwise for giving effect or\nenabling effect to be given to those sections.\n\nFor the purpose of this section “existing law” means a law that\n(3)\nwas enacted or made before 30th November, 1966 and has continued to\nbe part of the law of Barbados at all times since that day and includes\na law\n\n(a)\n\n(b)\n\nthat  repeals  and  re-enacts  law  that  was  enacted  or  made\nbefore 30th November, 1966 without alteration; or\n\nthat  alters  a  law  that  was  enacted  or  made  before  30th\nNovember,  1966  and  does  not  thereby  render  that  law\ninconsistent with sections 12 to 23 of this Constitution in a\nmanner  in  which,  or  to  an  extent  to  which,  it  was  not\npreviously so inconsistent.\n\nIn  subsection  (3)(b),  the  reference  to  altering  a  law  that  was\n(4)\nenacted  or  made  before  30th  November,  1966  includes  references  to\nrepealing it and re-enacting it with modifications or making different\nprovisions in lieu thereof, and to modifying it.”.\n\nRepeal and replacement of section 78 of the Constitution\n\n4.\nsubstituted:\n\nSection  78  of  the  Constitution  is  deleted  and  the  following  is\n\n\f6\n\n“Prerogative of Mercy\n\n78.(1)\nHer Majesty’s behalf\n\nThe Governor-General may, in Her Majesty’s name and on\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\ngrant to any person convicted of an offence against the law\nof  Barbados  a  pardon,  either  free  of  or  subject  to  lawful\nconditions;\n\ngrant  to  any  person  a  respite,  either  indefinitely  or  for  a\nspecified  period  of  time,  from  the  execution  of  any\npunishment imposed on that person for any offence;\n\nsubstitute a less severe form of punishment for that imposed\non a person for any offence; or\n\nremit  the  whole  or  part  of  any  punishment  imposed  on  a\nperson for an offence, a penalty or forfeiture otherwise due\nto the Crown on account of such an offence.\n\nThe  Governor-General  shall,  in  the  exercise  of  the  powers\n(2)\nconferred on him by subsection (1), or of any power conferred on him\nby any other law to remit any penalty or forfeiture due to any person,\nother than the Crown, act in accordance with the advice of the Privy\nCouncil.\n\nWhere  a  person  makes  a  submission  in  accordance  with\n(3)\nsubsection (5) in respect of an offence against the law of Barbados, the\nGovernor-General shall cause a written report of the case from the trial\njudge, together with such other information derived from the record of\nthe  case  or  elsewhere  as  the  Governor-General  may  require,  to  be\nforwarded to the Privy Council so that the Privy Council may advise\nhim on the exercise of the powers conferred on him by subsection (1)\nin relation to that person.\n\nThe  power  of  requiring  information  conferred  upon  the\n(4)\nGovernor-General by subsection (3) shall be exercised by him on the\n\n\f7\n\nrecommendation of the Privy Council or, in any case in which in his\njudgment the matter is too urgent to admit of such recommendation\nbeing obtained by the time within which it may be necessary for him\nto act, in his discretion.\n\n(5)\nA person has a right to submit directly or through a legal or other\nrepresentative, written representation in relation to the exercise by the\nGovernor-General  or  the  Privy  Council,  of  any  of  their  respective\nfunctions under this section.\n\n(6)\nA person may, in the appropriate circumstances as determined\nby  the  Governor-General  or  the  Privy  Council,  be  granted  an  oral\nhearing and may make oral submissions directly or through a legal or\nother representative, in relation to the exercise by the Governor-General\nor  the  Privy  Council,  of  any  of  their  respective  functions  under  this\nsection.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2014.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2014.\n\nPresident\n\n\fCONSTITUTION (AMENDMENT) BILL, 2014\n\nEXPLANATORY MEMORANDUM\n\nIn light of the decision of the Inter-American Court of Human Rights in Case\n\n12645: Tyrone Dacosta Cadagon v. Barbados, the Cabinet1 determined that\n\n(a)\n\n(b)\n\nthe mandatory imposition of death penalty in respect of the offence of\nmurder should be abolished; and\n\nsection 2 of the Offences Against the Person Act, Cap. 141 be amended\nspecifically  to  abolish  the  mandatory  imposition  of  the  sentence  of\ndeath for offence of murder.\n\nIt is important to note that the Cabinet did not express any intention to abolish\n\nthe death penalty.\n\nThe  Constitution  (Amendment)  Bill,  2014  would  alter  the  Constitution  of\n\nBarbados to\n\n(a)\n\n(b)\n\n(c)\n\ndelete the provision authorising a mandatory imposition of death for\nthe offence of murder in section 15; and\n\namend section 26 to redefine the effect of existing law in relation to\nthe fundamental rights provisions;\n\nrefine  the  exercise  by  the  Governor-General  of  the  Prerogative  of\nMercy.\n\nClause 1:\n\nClause 2:\n\nClause 1 states that this Act may be cited as the Constitution\n(Amendment) Act, 2014.\n\nClause  2  repealed  and  replaced  section  15  to  remove  the\nprovision authorising a mandatory imposition of death for the\noffence of murder.\n\n1\n\nCabinet Note (2014) 73/AG.2, M.P. 2800/8/9/8 Vol. I, January 30, 2014\n\ni\n\n\fClause 3:\n\nClause 4:\n\nConstitution (Amendment) Bill, 2014\n\nClause 3 redefine the effect of existing law in relation to the\nfundamental rights provisions.\n\nClause  4  repealed  and  replaced  section  78  to  remove  the\nGovernor-General’s  capacity  to  direct  that  there  should  be\ntime limits within which person may appeal to, or consult, any\nperson or body of persons (other than Her Majesty in Council)\noutside Barbados in relation to an offence. This alteration was\nnecessary since it is the policy of the Government to allow\npersons to appeal or consult with entities outside of Barbados\nin  relation  to  offences  particularly  that  of  murder.  The\nimposition of a time limit on this right to appeal or consult\nwould operate as an unfair restriction of that right.\n\nii\n\n"
}