{
  "bill_id": 540,
  "slug": "barbados-identity-management-bill-2021",
  "title": "Barbados Identity Management Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/f25dfb139df85f3bf105920e50c55761.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-02-24",
  "first_reading": "2021-02-24",
  "gazette_date": null,
  "markdown": "2021/01/30\n\nOBJECTS AND REASONS\n\nThis Bill would provide for\n\n(a)\n\nthe establishment, maintenance and regulation of a National Identity\nManagement System that facilitates\n\n(i)\n\nthe  enrollment  and  re-registration  of  citizens  of  Barbados  and\npersons  who  are  not  citizens  of  Barbados  but  who  are  legally\nresident in Barbados for a period of 6 months or more; and\n\n(ii)\n\nthe compilation and maintenance of a database of such persons to\nbe known as the National Register;\n\n(b)\n\n(c)\n\n(d)\n\nthe issue of new identification cards and national identity credentials\nto each person registered in the National Register;\n\nthe  facilitation  of  the  verification  and  authentication  of  identity\ninformation for all persons registered in the National Register;\n\nthe  preservation,  protection,  security  and  confidentiality  of  the\nNational Identity Management System; and\n\n(e)\n\nmatters related to paragraphs (a) to (d).\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\nPART II\n\nREGISTRATION\n\nShort title\n\nInterpretation\n\nAdministration\n\nNational Register\n\nObligation to register\n\nRegistration of a minor\n\nProcedure for registration\n\nPower to correct recorded information\n\nChange in information relevant to registration\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n\f3\n\nPART III\n\nIDENTIFICATION CARDS\n\n10.\n\nIssuance of identification card\n\n11.\n\nIdentification card\n\n12.\n\nUse of an identification card\n\n13.\n\nReplacement of an identification card\n\n14.\n\nProvision of an identification card in certain circumstances\n\n15.\n\nPower to order the surrender of an identification card\n\nPART IV\n\nNATIONAL IDENTITY CREDENTIALS\n\n16.\n\nNational Identity Credential\n\n17.\n\nIssuance of a national identity credential\n\n18.\n\nUse of a national identity credential\n\nPART V\n\nSECURITY, CONFIDENTIALITY, VERIFICATION, INFORMATION\nSHARING AND CONFIRMATION SERVICE\n\n19.\n\nSecurity\n\n20.\n\nDisclosure of information\n\n21.\n\nConfirmation service request\n\n\f22.\n\nComplaint\n\n23.\n\nAppeal\n\n4\n\nPART VI\n\nCOMPLAINTS\n\nPART VII\n\nOFFENCES\n\n24.\n\nImpersonation\n\n25.\n\nUnauthorised disclosure of identity information\n\n26.\n\nUnauthorised access to National Register\n\n27.\n\nTampering with data in National Register\n\n28.\n\nManipulation of biometric data\n\nPART VIII\n\nMISCELLANEOUS\n\n29.\n\nPower to waive fees\n\n30.\n\nExemption from the payment of fees\n\n31.\n\nPower to amend Schedules\n\n32.\n\nConsequential Amendments\n\n33.\n\nRegulations\n\n\f5\n\n34.\n\nSavings and Transitional provision\n\nFIRST SCHEDULE\n\nContents of National Register\n\nSECOND SCHEDULE\n\nCertificate of Registration\n\nTHIRD SCHEDULE\n\nFees for Identification Cards\n\nFOURTH SCHEDULE\n\nNotice of Change of Residence\n\nFIFTH SCHEDULE\n\nParticulars and features in respect of Identification Cards and National\nIdentification Credentials\n\nSIXTH SCHEDULE\n\nConsequential Amendments\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to make provision for the establishment, maintenance and regulation\n\nof a National Identity Management System and matters related thereto.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f8\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n2021.\n\nThis  Act  may  be  cited  as  the  Barbados  Identity  Management  Act,\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“authentication” means the process by which biographic information, biometric\ndata and any other information of an individual is proved to be accurate or\ninaccurate;\n\n“biographic information” means personal data collected pursuant to section 7 and\n\nthe  First Schedule;\n\n“biometric data” means personal data resulting from specific technical processing\nrelating to the physical, physiological or behavioural characteristics of an\nindividual,  which  allow  or  confirm  the  unique  identification  of  that\nindividual;\n\n“certificate  for  electronic  identification”  means  a  certificate,  issued  by  the\nCommission, unique data, including codes or private cryptographic keys,\nthat is used to verify an individual’s electronic identity;\n\n“certificate  for  electronic  signature”means  a  certificate,  issued  by  the\nCommission,  with  unique  data,  including  codes  or  private  cryptographic\nkeys, which is used by the signatory in creating an electronic signature;\n\n“Certificate  of  Registration”  means  the  certificate  set  out  in  the  Second\n\nSchedule;\n\n“Chief Registering Officer” has the meaning assigned to it by section 2 of the\n\nRepresentation of the People Act, Cap. 12;\n\n\f9\n\n“citizen”  means  a  person  who  has  citizenship  of  Barbados  by  virtue  of  the\nprovisions of the Constitution or the Barbados Citizenship Act, Cap. 186;\n\n“Commission” means the Electoral and Boundaries Commission established by\n\nsection 41A of the Constitution;\n\n“compulsory  school  age”  has  the  meaning  assigned  to  it  by  section  2  of  the\n\nEducation Act, Cap. 41;\n\n“documentary  evidence”  means  electronic  data,  printed  or  written  material,  a\nphotograph or any other material which records or shows information which\ncan be used to establish or confirm\n\n(a)\n\n(b)\n\nthe identity of a person; or\n\nwhether that person qualifies for registration,\n\nincluding  the  supporting  documents  set  out  in  Part  III  of  the  First\nSchedule;\n\n“electronic signature” has the meaning assigned to it by section 2 of the Electronic\n\nTransactions Act, Cap. 308B;\n\n“father” means the biological or adopted father of a minor;\n\n“guardian” means a person other than a mother or father of a minor who has\ncustody  and  is  responsible  for  the  minor  in  accordance  with  the  laws  of\nBarbados;\n\n“identification  card”  means  an  identification  card  issued  by  the  Commission\n\npursuant to section 20;\n\n“legitimate  non-immigrant  purposes”  includes  such  purposes  as  touring,\n\nrecreation, sports, health, family reasons or business;\n\n“minor” means a person who is under 16 years of age and includes an adopted\n\nminor;\n\n“mother” means the biological or adopted mother of a minor;\n\n\f10\n\n“national identity credential” means an authenticated record kept in electronic\nform  that  facilitates  the  verification  of  an  individual’s  identity  in  an\nelectronic environment;\n\n“National Identity Management System” includes the\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nNational Register;\n\nnational identity credentials;\n\nnational identification card; and\n\nthe  processes  and  procedures,  networks,  services,  software\nprogrammes,  automated  retrieval  and  storage,  interconnectivity  and\nother associated elements for the enrollment and re-registration of a\nperson qualified to be in the National Register and the verification and\nauthentication of a person’s identity;\n\n“National Register” means the register established, kept and maintained by the\n\nCommission pursuant to section 4;\n\n“national identification number” means the number issued by the Commission\nto  a  person  registered  in  the  National  Register  and  affixed  to  the\nidentification card or embedded in a national identity credential issued to\nthat person;\n\n“permanent  resident”  has  the  meaning  assigned  to  it  by  section  2  of  the\n\nImmigration Act, Cap. 190;\n\n“public institution” means\n\n(a)\n\n(b)\n\n(c)\n\na Government Children’s Home;\n\nthe Geriatric Hospital;\n\nthe Psychiatric Hospital;\n\n(d)\n\na District Hospital;\n\n(e)\n\nthe Welfare Department;\n\n(f)\n\nDodds Prison or any other correctional facility;\n\n\f11\n\n(g)\n\n(h)\n\na Government Industrial School; and\n\nQueen Elizabeth Hospital;\n\n“registering  officer”  has  the  meaning  assigned  to  it  by  section  2  of  the\n\nRepresentation of the People Act, Cap. 12;\n\n“resident” means a person who derives an income in Barbados or elsewhere, and\n\nwho\n\n(a)\n\n(b)\n\n(c)\n\nis legally living in Barbados;\n\nis domiciled in Barbados; and\n\nhas a permanent home in Barbados which he considers his settled or\nusual place of abode;\n\n“signatory” means a natural person who creates an electronic signature;\n\n“student” includes a person attending a tertiary institution;\n\n“supporting documents” means the documents set out in the Part III of the First\nSchedule  used  to  aid  in  the  verification  of  a  person’s  information  to  be\nrecorded in the National Register;\n\n“tertiary  institution”  has  the  meaning  assigned  to  it  by  section  9(f)  of  the\n\nEducation Act, Cap. 41;\n\n“verification”  means  the  process  of  establishing  the  accuracy  of  information\nreceived by the Commission where the information received is compared\nwith reliable documents and or other information; and\n\n“visitor” means a person who\n\n(a)\n\nenters Barbados for legitimate non-immigrant purposes, in the course\nof duty, or for purposes connected with their employment for a period\nof 6 months or more but not exceeding 12 consecutive months; and\n\n(b)\n\nis not resident in Barbados for the purposes of section 85 of the Income\nTax Act, Cap. 73.\n\n\f12\n\nAdministration\n\n3.\nof the provisions of this Act.\n\nThe Commission shall be responsible for the general administration\n\nPART II\n\nREGISTRATION\n\nNational Register\n\n4.(1)\n\nThe Commission shall register\n\n(a)\n\n(b)\n\nall citizens of Barbados; and\n\npersons  who  are  not  citizens  of  Barbados  but  who  are  resident  in\nBarbados for a period of 6 months or more.\n\nThe Commission shall, for the purposes of subsection (1), establish, keep\n\n(2)\nand maintain a register to be known as the National Register to\n\n(a)\n\n(b)\n\nregister and record the persons referred to in subsection (1);\n\nprovide information to facilitate the issuing of identification cards and\nnational identity credentials to the persons registered in the National\nRegister; and\n\n(c)\n\nprovide information to facilitate the preparation of a register of electors\nfor the purposes of the Representation of the People Act, Cap. 12.\n\nThe National Register shall be in such form as the Commission deems fit\n\n(3)\nand shall contain such particulars as set out in Part I of the First Schedule.\n\nThe Registrar with responsibility for the registration of deaths, under the\n(4)\nVital Statistics Act, Cap. 192A, shall no later than the last day of each month of\nthe year provide the Commission with a list of the names of persons whose deaths\nhave occurred during the preceding month.\n\n\f13\n\n(5)\nThe Chief Immigration Officer shall no later than the last day of each month\nof the year provide the Commission with a list of the names of persons who were\nresident in Barbados for 6 months or more and have left Barbados with no return\ndate or an open ended ticket.\n\nThe Commission shall review the National Register and where necessary\n\n(6)\ndelete any entry in respect of any person\n\n(a)\n\n(b)\n\nwho is deceased;\n\nwho  is  not  a  citizen  of  Barbados  and  who  is  no  longer  resident  in\nBarbados and has not been resident in Barbados for a continuous period\nof more than 5 years; or\n\n(c)\n\nwhere the Commission considers that that person ought not to have\nbeen registered in the National Register.\n\nInformation deleted from the National Register pursuant to subsection (6)\n\n(7)\nshall be archived in a manner determined by the Chief Registering Officer.\n\nThe Commission may, for the purpose of registering a person specified in\n(8)\nsection  5,  publish  at  least  once  in  the  Official  Gazette  and  at  least  twice,  at\nintervals of not less than 7 days apart, by electronic means, a notice requiring a\nperson or a group of persons to appear before the Chief Registering Officer for\nregistration in the National Register.\n\nThe Commission may, for the purpose of removing a person specified in\n(9)\nsubsections  (4)  and  (5)  or  sections  10(2)  and  (3)  from  the  National  Register,\npublish at least once in the Official Gazette and at least twice, at intervals of not\nless than 7 days apart, by electronic means, a notice of the removal and where\nrelevant, the notice may require a person or a group of persons to attend before\nthe Chief Registering Officer.\n\nThe National Register shall not be open to inspection by members of the\n\n(10)\npublic.\n\n\f14\n\nObligation to register\n\n5.(1)\n\nA person who\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\n(k)\n\nis born in Barbados;\n\nis a citizen of Barbados;\n\nhas  an  immigrant  status  certificate  issued  in  accordance  with  the\nprovisions of the Immigration Act, Cap. 190;\n\nhas permanent resident status in accordance with the provisions of the\nImmigration Act, Cap. 190;\n\nis  in  Barbados  for  a  period  of  6  months  or  more  as  a  student,  in\naccordance with the provisions of the Immigration Act, Cap. 190;\n\nis resident in Barbados for a period of 6 months or more as a worker,\nin accordance with the provisions of the Immigration Act, Cap. 190;\n\nis employed by the Caribbean Development Bank under the provisions\nof the Caribbean Development Bank Act, Cap. 323A;\n\nhas a Right of Establishment Certificate issued in accordance with the\nprovisions of the Immigration Act, Cap. 190;\n\nhas  a  CARICOM  Skilled  National  Certificate,  issued  in  accordance\nwith the Caribbean Community (Movement of Skilled Nationals) Act,\nCap. 186A;\n\nis  the  spouse  of  a  person  who  has  a  CARICOM  Skilled  National\nCertificate  issued  in  accordance  with  the  Caribbean  Community\n(Movement of Skilled Nationals) Act, Cap. 186A;\n\nis the spouse of a person who is resident in Barbados for a period of 12\nmonths or more as a worker in accordance with the provisions of the\nImmigration Act, Cap. 190;\n\n\f15\n\n(l)\n\n(m)\n\n(n)\n\nis  entitled  by  virtue  of  any  other  provision  of  the  Immigration  Act,\nCap. 190 to remain as a resident in Barbados for a period of 6 months\nor more;\n\nis permitted to remain in Barbados permanently under any other law;\nor\n\nis a minor and the child of a person to whom paragraphs (c) to (m)\napplies where that minor is under compulsory school age,\n\nshall be registered in the National Register.\n\nA  person  who  is  eligible  for  registration  in  the  National  Register  shall\n(2)\nprovide  the  registering  officer  with  such  documentary  evidence  as  the\nCommission may require in order to establish the truth of the information to be\nrecorded in relation to that person in the National Register.\n\nWhere the person referred to in subsection (1)(b) is a minor, that minor\n(3)\nshall be registered by his mother, father, guardian or any other person authorised\nto register a minor under section 6.\n\nWhere the person referred to in paragraphs (b), (c), (d),(e), (l), (m) or (n)\n(4)\nof subsection (1) is a minor, that minor shall be registered by his mother, father,\nguardian or any other person authorised to register a minor under section 6.\n\nA minor shall, on attaining 16 years of age, register in accordance with\n\n(5)\nsection 7 for an identification card.\n\nNotwithstanding  subsection  (2),  where  a  person  is  unable  to  produce\n\n(6)\ndocumentary evidence to satisfy the registering officer of his\n\n(a)\n\n(b)\n\n(c)\n\nfull name;\n\ncorrect date of birth; or\n\ncorrect place of birth,\n\nthe  registering  officer  shall  request  that  the  person  produce  to  the  Chief\nRegistering Officer a sworn affidavit with supporting exhibits, where relevant,\ndeposing his full name, as well as his correct date of birth and place of birth in\n\n\f16\n\naddition to stating the reason for the unavailability of the required documentary\nevidence.\n\nThe Commission shall take such reasonable steps as may be required to\n(7)\nverify the contents of an affidavit submitted in accordance with subsection (6).\n\nThe Commission, with the consent of a person mentioned in subsection\n(8)\n(1), may collect the fingerprints of that person for the purpose of assisting with\nthe confirmation of their identity and the person may elect to submit the prints\nof all fingers or some fingers of their choosing.\n\nA person who is a visitor shall not be eligible for registration in the National\n\n(9)\nRegister unless that person is a person to whom subsection (1) applies.\n\n(10)\n\nA person who is not registered under this Act shall not\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nbe added to the National Register;\n\nbe assigned a national registration number;\n\nbe issued with an identification card or a national identity credential;\n\nqualify to be added to the register of electors or the revised register of\nelectors  prepared  under  the  Representation  of  the  People  Act,\nCap. 12;\n\n(e)\n\nqualify to obtain a driver’s permit or licence; or\n\n(f)\n\nqualify to access any service or goods which require the presentation\nof an identification card to obtain such services or goods.\n\nRegistration of a minor\n\n6.(1)\nThe mother or father of a minor who is born in Barbados or any other\nperson authorised to register that minor shall, within 45 days of the birth of that\nminor, register the minor with the Chief Registering Officer.\n\nWhere a minor is registered by a person other than the mother or father of\n(2)\nthe minor, the mother or father of the minor shall give to that person an instrument\nin writing stating that the person has permission to register the minor and the\n\n\f17\n\ninstrument may include the national identification number of the mother or father\nof the minor.\n\nWhere a minor is adopted, the person who has adopted the minor shall, on\n(3)\nproducing the relevant documents showing the evidence of the adoption to the\nChief Registering Officer, register the minor with the Chief Registering officer.\n\nWhere a person other than the mother or father is the guardian of the minor\n(4)\nthat person shall produce such documentation as the Chief Registering Officer\nmay require in order to register that minor.\n\nUpon  registering  the  minor  the  Chief  Registering  Officer  shall  issue  in\n\n(5)\nrespect of that minor an identification card designated for that minor.\n\nA person who is required to register a minor in accordance with this section\n(6)\nand who fails to do so shall pay a penalty of $100, as well as any fee which may\nbe required.\n\nProcedure for registration\n\n7.(1)\n\nA person required to register pursuant to section 5 may do so\n\n(a)\n\n(b)\n\nin person in accordance with subsections (2) to (7); or\n\nelectronically as determined by the Commission.\n\n(2)\nA registering officer, in seeking to obtain finger prints pursuant to section\n5(8), shall obtain the consent of the person seeking to so register and that person\nshall indicate in the applicable field set for the purpose in the National Register\nwhether he is submitting all or some of his finger prints as selected by that person.\n\nThe consent obtained pursuant to subsection (2) shall be indicated in the\n\n(3)\napplicable field set out for that purpose in the National Register by\n\n(a)\n\n(b)\n\naffixing his name, signature or mark; or\n\nwhere  a  person  is  unable  to  affix  his  name,  signature  or  mark  the\nregistering officer shall indicate on the Certificate of Registration that\nthe person is unable to sign.\n\n\f18\n\nThe  registering  officer  shall,  where  consent  is  obtained  pursuant  to\n\n(4)\nsubsection (2), collect the relevant fingerprints.\n\n(5)\nWhere a person refuses to consent to submitting fingerprints, that refusal\nshall be indicated in the applicable field set out for that purpose in the National\nRegister\n\n(a)\n\n(b)\n\nby affixing his name, signature or mark; or\n\nwhere  a  person  is  unable  to  affix  his  name,  signature  or  mark  the\nregistering officer shall indicate on the Certificate of Registration that\nthe person is unable to sign,\n\nand the person shall not be subject to any penalty, fine or term of imprisonment.\n\nA person required to register pursuant to section 5 who decides to register\n\n(6)\nin person\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nshall in the presence of a registering officer, supply the information\nspecified in Part I of the First Schedule  so that the registering officer\nmay record the information in the National Register;\n\nshall  comply  with  the  requirements  set  out  in  Part  II  of  the  First\nSchedule  for  an  officer  assigned  by  the  Commission  to  take  a\nphotograph of him;\n\nshall submit his signature;\n\nmay submit his fingerprints once his consent is obtained pursuant to\nsubsections (2) and (3);\n\nshall  supply  such  additional  information  as  the  Chief  Registering\nOfficer or a registering officer may require\n\n(i)\n\nin  respect  of  the  particulars  specified  in  Part  I  of  the  First\nSchedule; or\n\n(ii)\n\nto ensure the proper identification and registration of a person;\n\n\f19\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\n(k)\n\nshall produce such documentary evidence or other information, as the\nChief  Registering  Officer  or  a  registering  officer  may  consider\nnecessary to support the accuracy of any information submitted;\n\nshall, where required, surrender any previous identification card issued\nto the person;\n\nshall comply with such procedures or requirements as the Commission\nimplements or requires for the completion of the registration process;\n\nshall  read  or  have  read  to  him  the  contents  of  the  Certificate  of\nRegistration,  and  where  he  is  certain  that  the  information  is  correct\naffix  his  name,  signature,  or  mark  to  verify  that  the  information\ncontained in the Certificate of Registration is true and accurate to the\nbest of his knowledge;\n\nshall obtain a copy of the Certificate of Registration; and\n\nshall,  where  relevant,  pay  the  relevant  fee  set  out  in  the  Third\nSchedule.\n\nThe  registering  officer  shall  sign  and  stamp  a  copy  of  the  completed\n(7)\nCertificate  of  Registration  and  issue  that  copy  to  the  person  as  proof  of  his\nregistration pursuant to this Act.\n\nWhere a person affixes his mark in accordance with subsection (6)(i) the\n(8)\nregistering officer shall sign and stamp the completed Certificate of Registration,\nand affix to the form\n\n(a)\n\nwords  stating  that  the  mark  was  made  by  the  person  to  whom  the\nCertificate of Registration belongs; or\n\n(b)\n\nwords of like effect,\n\nbefore issuing a copy of the completed Certificate of Registration to that person\nas proof of his registration.\n\n\f20\n\n(9)\nWhere  a  person  is  unable  to  affix  his  name,  signature  or  mark  the\nregistering officer will indicate on the Certificate of Registration that the person\nis unable to sign.\n\n(10)\nA person required to register pursuant to section 5 who decides to register\nelectronically pursuant to subsection (1) shall do so in the manner determined by\nthe Commission and subsections (2) to (9) shall apply with such modifications\nas are deemed necessary by the Commission for facilitating the registration of\npersons.\n\nNotwithstanding subsections (2) and (6), a person who is under 16 years\n\n(11)\nof age shall not be required to\n\n(a)\n\n(b)\n\n(c)\n\nappear before a registering officer;\n\ntake a photograph for an identification card; or\n\nsupply any signature or fingerprints.\n\nThe Chief Registering Officer shall ensure that the supporting documents\n(12)\nset out in Part III of the First Schedule for each person registered in the National\nRegister  are  recorded  and  stored  in  an  electronic  format  or  otherwise  for  the\npurposes of the Commission under this Act.\n\nPower to correct recorded information\n\n8.(1)\nThe Chief Registering Officer or an officer designated by the Chief\nRegistering Officer shall ensure that each registration is complete and accurate,\nand where necessary request further or additional information from the person to\nwhom the registration relates.\n\nThe Chief Registering Officer, a registering officer or any other officer\n(2)\ndesignated  by  the  Chief  Registering  Officer  may  correct  any  error  made  in\nNational Register or Certificate of Registration in respect of any person registered\nin the National Register.\n\n\f21\n\n(3)\nWhere a correction is made in accordance with subsection (2), the officer\nmaking the correction shall make a record of his name, position, date and time\nof the correction and shall indicate the nature of the correction.\n\nChange in information relevant to registration\n\n9.(1)\n\nA person shall, where\n\n(a)\n\n(b)\n\nthere  is  any  change  in  the  information  previously  given  to  the\nCommission notify the Chief Registering Officer of the change; or\n\nhe is satisfied that his personal appearance has changed so as to make\nit likely that his identity as certified by the identification card may be\nquestioned,\n\nappear before a registering officer to obtain a replacement of an identification\ncard,  and  pay  to  the  Commission  the  replacement  fee  specified  in  the  Third\nSchedule.\n\nWhere a person pursuant to subsection (1)(a) appears before a registering\n(2)\nofficer to record a change in the information previously given to the Commission,\nthe  registering  officer  shall  have  the  change  reflected  in  the  national  identity\ncredential.\n\nThe Chief Registering Officer shall, where he is satisfied that the change\n(3)\nmaterially affects the proper identification of the person, cancel that identification\ncard  or  national  identity  credential  and  shall  issue  the  person  with  a  new\nidentification card and a national identity credential.\n\nWhere the Chief Registering Officer considers that the circumstances do\n(4)\nnot  require  the  replacement  of  the  identification  card  or  national  identity\ncredential,  he  shall  require  that  the  person  continue  to  use  the  existing\nidentification card or national identity credential.\n\nA person who has been issued with an identification card or an national\n(5)\nidentity credential shall notify the Chief Registering Officer of any change in his\nplace of residence within 30 days of the change of address by submitting the\n\n\f22\n\nNotice  of  Change  of  Residence  Form  set  out  in  the  Fourth  Schedule  to  a\nregistering officer.\n\nA person who contravenes subsections (1) and (5)  is liable to pay to the\n\n(6)\nCommission an administrative penalty of $500.\n\nPART III\n\nIDENTIFICATION CARDS\n\nIssuance of identification card\n\n10.(1)\nRegister an identification card for which he is eligible upon\n\nThe  Commission  shall  issue  to  a  person  registered  in  the  National\n\n(a)\n\n(b)\n\npresentation  of  the  Certificate  of  Registration  or  such  other\ndocumentation as may be required by the Commission; and\n\npayment  of  the  relevant  fee  set  out  in  the  Third  Schedule  where\napplicable,\n\nto the Chief Registering Officer.\n\nWhere the Commission is satisfied that a person does not qualify for an\n(2)\nidentification card under subsection (1), the Commission shall direct the Chief\nRegistering  Officer  not  to  issue  an  identification  card  to  that  person  and  that\nperson shall be removed from the National Register.\n\nThe Commission may revoke or suspend an identification card where the\n(3)\nholder contravenes the provisions of this Act and that person may be removed\nfrom the National Register.\n\nThe  Commission  shall  inform  a  person  affected  by  a  decision  made\n\n(4)\npursuant to subsections (2) or (3) in writing.\n\n\f23\n\nIdentification card\n\n11.(1)\n\nAn identification card shall\n\n(a)\n\n(b)\n\ndisplay the information set out in Part I of the Fifth Schedule as well\nas such other information as the Commission considers necessary on\nthe card;\n\nbe  equipped  with  a  digital  chip  which  shall  contain  personal  data\nenabling  digital  identification  as  set  out  in  Part  II  of  the  Fifth\nSchedule; and\n\n(c)\n\ncontain such security features as the Commission determines necessary\nto protect the personal data set out in Part II of the Fifth Schedule.\n\nSubject  to  section  10(2)  and  (3)  and  section  15,  an  identification  card\n(2)\nreferred to in subsection (1) shall be valid for a period of 10 years or for such\nperiod  as  the  Commission  may  prescribe  by  order  with  the  approval  of  the\nMinister.\n\n(3)\n\nAn identification card referred to in subsection (1)\n\n(a)\n\n(b)\n\nshall be collected by the person to whom the card belongs or by a person\nwho that person has authorised to collect the card by an instrument in\nwriting; or\n\nwhich is issued to a minor shall be collected by the mother, father or\nguardian of the minor or by the person permitted to register the minor\nunder section 6.\n\nThe Commission shall be responsible for the issue and maintenance of the\n(4)\ncertificate for electronic identification and the certificate for electronic signature\nembedded in the identification card referred to in subsection (1).\n\n\f24\n\nUse of an identification card\n\n12.(1)\nproduce his identification card\n\nA  person  who  is  issued  an  identification  card  may  be  required  to\n\n(a)\n\nto  the  Chief  Registering  Officer,  a  registering  officer  or  any  other\nofficer designated by the Commission;\n\n(b)\n\nto a police officer, an immigration officer or a customs officer;\n\n(c)\n\n(d)\n\n(e)\n\nfor the purpose of voting in an election in Barbados;\n\nfor  the  purpose  of  accessing  goods  or  services  provided  by  the\nGovernment or the private sector; or\n\nfor  any  other  purpose  for  which  the  verification  of  his  identity  is\nrequired,\n\nand that identification card shall be prima facie evidence of the identity of the\nperson shown on the identification card and the information set out in section\n11(1)(b).\n\nWhere a person is unable to produce his identification card for the purposes\n(2)\nmentioned in subsection (1), the person authorised to require such identification\nshall,  unless  another  form  of  identification  is  authorised  by  law,  defer\nconsideration  of  the  person  or  refuse  access  until  such  time  as  the  relevant\nidentification card is produced.\n\nAll identification cards issued by the Commission are the property of the\n(3)\nGovernment of Barbados and shall be for the use of the person to whom the card\nis issued, and any person who finds, or comes into possession of an identification\ncard  which  was  not  issued  to  him  shall  return  that  identification  card  to  the\nCommission.\n\nReplacement of an identification card\n\n13.(1)\nA person whose identification card is lost, stolen, damaged, destroyed,\ntampered with or defaced shall attend before a registering officer to be registered\n\n\f25\n\nfor the replacement of the identification card and pay to the Chief Registering\nOfficer the replacement fee specified in the Third Schedule.\n\nWhere an identification card is lost, stolen, damaged, destroyed, tampered\n(2)\nwith or defaced, the holder of that identification card shall submit a report to the\nChief Registering Officer.\n\nA person who has his identification card replaced or whose card is expired\n(3)\nshall return or surrender his previous or expired identification card to the Chief\nRegistering Officer before he is issued with a new identification card, unless that\nidentification card has been lost, stolen or destroyed.\n\nProvision of an identification card in certain circumstances\n\nNotwithstanding section 7, where a person is incapacitated or is in the\n14.(1)\ncare and custody of a public institution and cannot appear before a registering\nofficer, that person or any person authorised to act on the behalf of that person\nby  an  instrument  in  writing  shall  inform  the  Commission  and  the  Chief\nRegistering  Officer,  on  direction  from  the  Commission,  shall  instruct  a\nregistering officer to\n\n(a)\n\nregister  the  incapacitated  person  or  institutionalised  person  in  the\nNational Register and facilitate the issuance of an identification card\nto the incapacitated person or institutionalised person or\n\n(b)\n\nreplace an identification card that is lost, stolen, damaged, destroyed,\ntampered with or defaced.\n\nAn  incapacitated  person,  an  institutionalised  person  or  any  person\n(2)\nauthorised to act on the behalf of such persons by an instrument in writing, who\nhas  his  identification  card  replaced  or  whose  card  is  expired  shall  return  or\nsurrender  the  previous  or  expired  identification  card  to  the  Chief  Registering\nOfficer  before  being  issued  with  a  new  identification  card,  unless  that\nidentification card has been lost, stolen or destroyed.\n\nWhere a registering officer has been instructed to visit an incapacitated\n(3)\nperson pursuant to subsection (1), the registering officer shall visit that person\n\n\f26\n\nfor  the  purpose  of  photographing  that  person  and  collecting  the  information\nnecessary for effecting the registration and issuance of an identification card to\nthat person and the registering officer shall take all the necessary materials to\nensure that he will accurately obtain\n\n(a)\n\nall  the  information  specified  in  accordance  with  Part  I  of  the  First\nSchedule; and\n\n(b)\n\na photograph in accordance with Part II of the First Schedule.\n\nA registering officer shall take such steps as may be necessary to ensure\n(4)\nthat  all  information  required  for  the  replacement  of  the  identification  card  is\ncollected and recorded in respect of any person to whom subsection (1) applies.\n\nA person registered under this section shall obtain a copy of the Certificate\n\n(5)\nof Registration.\n\nWhere relevant, a person registered in accordance with this section shall\n\n(6)\npay the relevant fee set out in the Third Schedule.\n\n(7)\n\nFor the purposes of this section,\n\n“incapacitated  person”  means  a  person  with  a  temporary  or  permanent\nimpediment  or  impairment  which  is  a  mental  or  physical  deficiency,\ndisability or illness;\n\n“institutionalised  person”  means  person  in  the  care  or  custody  of  a  public\n\ninstitution.\n\nPower to order the surrender of an identification card\n\n15.(1)\nThe  Commission  may  require  holders  of  an  identification  card  to\nsurrender that identification card to the Commission for substitution of a new\nidentification card for the purpose of facilitating updates to\n\n(a)\n\n(b)\n\nthe appearance of the card; or\n\nthe technology related to\n\n(i)\n\ndigital identification;\n\n\f27\n\n(ii)\n\nsecurity features referred to in section 11(1)(c);\n\n(iii)\n\ncertificate for electronic identification; or\n\n(iv)\n\ncertificate for electronic signature.\n\n(2)\nWhere  the  Commission  orders  the  surrender  of  an  identification  card\npursuant to subsection (1), no fee shall be imposed for the replacement of that\nidentification card.\n\nPART IV\n\nNATIONAL IDENTITY CREDENTIALS\n\nNational Identity Credential\n\nA  national  identity  credential  is  an  authenticated  record  kept  in\n16.(1)\nelectronic form that facilitates the verification of an individual’s identity in an\nelectronic environment and shall contain\n\n(a)\n\n(b)\n\nthe information set out in Part III of the Fifth Schedule; and\n\nsuch  security  features  as  the  Commission  determines  necessary  to\nprotect the information set out in Part III of the Fifth Schedule.\n\nSubject  to  subsections  (2)  and  (3)  of  section  17,  a  national  identity\n(2)\ncredential shall be valid for 10 years or for such period as the Commission may\nby order prescribe with the approval of the Minister.\n\nThe Commission shall be responsible for the issue and maintenance of the\n(3)\ncertificate for electronic identification and the certificate for electronic signature\nembedded in the national identity credential in accordance with subsection (1).\n\nNo  more  than  one  national  identity  credential  shall  be  issued  for  each\n\n(4)\nindividual at any given time.\n\n\f28\n\n(5)\nAn national identity credential is personal to the individual to whom it has\nbeen issued and may not be transferred or vested by operation of law in any person\nother than that individual.\n\n(6)\nThe Commission may revoke a national identity credential and substitute\nnew national identity credentials for the purpose of facilitating updates to the\ntechnology related to\n\n(a)\n\n(b)\n\n(c)\n\ndigital identification;\n\nsecurity features referred to in subsection (1)(b);\n\na certificate for electronic identification; or\n\n(d)\n\na certificate for electronic signature.\n\nIssuance of a national identity credential\n\n17.(1)\nRegister a national identity credential upon\n\nThe  Commission  shall  issue  to  a  person  registered  in  the  National\n\n(a)\n\n(b)\n\npresentation of the Certificate of Registration; and\n\npayment  of  the  relevant  fee  set  out  in  the  Third  Schedule  where\napplicable,\n\nto the Chief Registering Officer.\n\nThe  Commission  may  revoke  or  suspend  a  national  identity  credential\n(2)\nwhere the holder contravenes the provisions of this Act and that person may be\nremoved from the National Register.\n\nThe Commission may require a holder of a national identity credential to\n(3)\nsurrender that national identity credential to the Commission for substitution of\na new national identity credential for the purpose of facilitating updates to the\ntechnology  in  respect  of  digital  identification  or  security  features  designed  to\nprotect the information set out in section 16(1)(a).\n\nThe  Commission  shall  inform  a  person  affected  by  a  decision  made\n\n(4)\npursuant subsections (2) or (3) in writing.\n\n\f29\n\nUse of a national identity credential\n\n18.\nof verifying his identity by electronic means for\n\nAn individual may use a national identity credential for the purpose\n\n(a)\n\nthe purpose of accessing goods or services provided by the Government\nor the private sector;\n\n(b)\n\nany other purpose for which the verification of his identity is required,\n\nin an electronic environment.\n\nPART V\n\nSECURITY, CONFIDENTIALITY, VERIFICATION, INFORMATION\nSHARING AND CONFIRMATION SERVICE\n\nSecurity\n\n19.(1)\nrecords of a person registered pursuant to Part II.\n\nThe Commission shall ensure the security and confidentiality of the\n\n(2)\nThe  Commission  shall  take  measures  including  security  safeguards  to\nensure  that  the  information  in  the  possession  or  control  of  the  Commission,\nincluding information recorded in the National Register or embedded in the chip\nof  the  identification  card  or  the  national  identity  credential,  is  secured  and\nprotected against any loss, unauthorised access or use or unauthorised disclosure\nthereof.\n\nDisclosure of information\n\n20.(1)\nA Commissioner, an officer or an employee of the Commission or an\nexpert retained to assist the Commission shall comply with the provisions of the\nData  Protection  Act,  2019  (Act  2019-29)  and  shall  keep  confidential  all\ninformation coming to his knowledge during the performance of his functions\n\n\f30\n\nunder this Act or any enactment which relates to the private affairs of a person\nexcept insofar as disclosure is necessary for\n\n(a)\n\n(b)\n\n(c)\n\nthe administration of this Act or any regulations made thereunder;\n\ncompliance with the provisions of any enactment; or\n\ncompliance with an order of a court.\n\nInformation collected about a person registered in the National Register\n(2)\npursuant to section 7 may be disclosed where such disclosure facilitates the use\nof the card pursuant to section 12 or the national identity credential pursuant to\nsection 18\n\nA person who contravenes subsection (1) is guilty of an offence and is\n(3)\nliable  on  summary  conviction  to  a  fine  of  $40  000  or  to  imprisonment  for  6\nmonths or to both.\n\nConfirmation service request\n\nA confirmation service request is a request made to the Commission\n21.(1)\nto facilitate the use of the identification card pursuant to section 12 or the national\nidentity credential pursuant to section 18.\n\nA person may make a confirmation service request referred to in subsection\n(2)\n(1) in order to confirm identity of a person or particulars related to the identity\nof a person in order to facilitate the use of the identification card pursuant to\nsection 12 or the national identity credential pursuant to section 18.\n\nFor  the  purposes  of  this  section  “particulars  related  to  the  identity  of  a\n(3)\nperson” means the particulars set out in section 11(1)(b) in the relation to the\nidentification  card  or  section  16(1)(a)  in  relation  to  the  national  identity\ncredential.\n\n\f31\n\nPART VI\n\nCOMPLAINTS\n\nComplaint\n\nA person who is aggrieved by an act performed or a decision made by\n22.(1)\nthe Commission may make a complaint to the Data Protection Commissioner\nwithin 14 days of the act performed or the decision made by the Commission.\n\nA complaint made pursuant to subsection (1) shall set out the nature of the\n\n(2)\nact or decision which is in breach of this Act or any other relevant enactment.\n\nPart  VIII  of  the  Data  Protection  Act,  2019  (Act  2019-29)  shall  apply\n\n(3)\nmutatis mutandis to this Act and any statutory instruments made thereunder.\n\nAppeal\n\nA  person  who  is  aggrieved  by  the  decision  of  the  Data  Protection\n23.\nCommissioner pursuant to section 22 shall appeal to the High Court within 14\ndays of the decision.\n\nPART VII\n\nOFFENCES\n\nImpersonation\n\n24.(1)\nA  person  who  impersonates  or  attempts  to  impersonate  another\nperson,  whether  dead  or  alive,  real  or  imaginary,  by  providing  any  false\ninformation, is guilty of an offence and is liable on summary conviction to a fine\nof $40 000 or to imprisonment for 6 months or to both.\n\n\f(2)\n\nWhere\n\n32\n\n(a)\n\n(b)\n\na person with the intention of causing harm or mischief to a person\nregistered in the National Register; or\n\nwith the intention of appropriating the identity of a person registered\nin the National Register\n\nchanges or attempts to change any information kept in the National Register,\nrecorded on an identification card or recorded in a national identity credential by\nimpersonating or attempting to impersonate another person, dead or alive, real\nor  imaginary,  that  person  is  guilty  of  an  offence  and  is  liable  on  summary\nconviction to a fine of $40 000 or to imprisonment for 6 months or to both.\n\nA  person  who  impersonates  or  attempts  to  impersonate  any  person\n(3)\nauthorised under this Act to collect information pursuant to the provisions of this\nAct is guilty of an offence and is liable on summary conviction to a fine of $40\n000 or to imprisonment for 6 months or to both.\n\nUnauthorised disclosure of identity information\n\n25.\nA person who, intentionally discloses, transmits, copies or otherwise\ndisseminates any identity information collected in the course of registration or\nauthentication to any person not authorised under this Act is guilty of an offence\nand is liable on summary conviction to a fine of $40 000 or to imprisonment for\n6 months or to both.\n\nUnauthorised access to National Register\n\n26.\n\nWhoever, not being authorised by the Commission, intentionally\n\n(a)\n\n(b)\n\n(c)\n\naccesses or secures access to the National Register;\n\ndownloads, copies or extracts any data from the National Register or\nstored in any removable storage medium\n\nintroduces  or  causes  to  be  introduced  any  virus  or  other  computer\ncontaminant in the National Register;\n\n\f33\n\n(d)\n\ndamages or causes to be damaged the data in the National Register;\n\n(e)\n\ndisrupts or causes disruption of the access to the National Register;\n\n(f)\n\n(g)\n\n(h)\n\ndenies or causes a denial of access to any person who is authorised to\naccess the National Register;\n\ndestroys,  deletes  or  alters  any  information  stored  in  any  removable\nstorage media or in the National Register or diminishes its value or\nutility or effects it injuriously by any means;\n\nsteals,  conceals,  destroys  or  alters  or  causes  any  person  to  steal,\nconceal,  destroy  or  alter  any  computer  source  code  used  by  the\nCommission with an intention to cause damage; or\n\n(i)\n\nprovides any assistance to any person to do any of the acts referred to\nin paragraphs (a) to (h),\n\nis guilty of an offence and is liable on summary conviction to a fine of $100 000\nor to imprisonment for 3 years, or to both.\n\nTampering with data in National Register\n\n27.\nA  person  who,  not  being  authorised  by  the  Commission,  uses  or\ntampers  with  the  data  in  the  National  Register  or  in  any  removable  storage\nmedium with the intent of modifying information relating to a person registered\nin the National Register or discovering any information on that person is guilty\nof an offence and is liable on summary conviction to a fine of $40 000 or to\nimprisonment for 6 months or to both.\n\nManipulation of biometric data\n\n28.\nA person who gives or attempts to give any biometric data which does\nnot pertain to him for the purpose of getting a national identification number or\nauthentication or updating his data is guilty of an offence and is liable on summary\nconviction to a fine of $40 000 or to imprisonment for 6 months or to both.\n\n\f34\n\nPART VIII\n\nMISCELLANEOUS\n\nPower to waive fees\n\nThe Commission may by order exempt a person or a group of persons\n29.(1)\nfrom  the  payment  of  any  fee  specified  in  the  Third  Schedule  for  the  issue  or\nreplacement of an identification card.\n\n(2)\n\nAn order made under subsection (1) is subject to negative resolution.\n\nExemption from the payment of fees\n\nA person who is 65 years of age or older shall be exempt from the\n30.(1)\npayment of any fee specified in the Third Schedule for the issue or replacement\nof an identification card.\n\nA person under 65 years of age who is in the care and custody of a public\n(2)\ninstitution shall be exempt from the payment of any fee specified in the Third\nSchedule for the issue or replacement of an identification card where the person\nin charge of the public institution issues a certificate to that effect to the Chief\nRegistering Officer.\n\n(3)\n\nA disabled person who is\n\n(a)\n\n(b)\n\n(c)\n\nunder 65 years of age;\n\nnot in the care and custody of a public institution; and\n\nunable to pay the fee for the issue or replacement of an identification\ncard,\n\nshall be exempt from the payment of any fee specified in the Third Schedule for\nthe  issue  or  replacement  of  an  identification  card  where  the  Director  of  the\nNational Disabilities Unit issues a certificate to that effect to the Chief Registering\nOfficer.\n\n\f35\n\n(4)\n\nA person in the care and custody of the Queen Elizabeth Hospital who\n\n(a)\n\n(b)\n\n(c)\n\nis under 65 years of age;\n\nis incapacitated as defined in section 14; and\n\nis unable to pay the prescribed fee for the issue or replacement of an\nidentification card,\n\nshall be exempt from the payment of any fee specified in the Third Schedule  for\nthe replacement of an identification card where the person in charge of the Queen\nElizabeth  Hospital  issues  a  certificate  to  that  effect  to  the  Chief  Registering\nOfficer.\n\nPower to amend Schedules\n\n31.\namend the First, Second, Third, Fourth and Fifth Schedules.\n\nThe  Commission,  with  the  approval  of  the  Minister,  may  by  order\n\nConsequential Amendments\n\n32.\nin the manner specified in Column 2 of the Sixth Schedule.\n\nThe enactments set out in Column 1 of the Sixth Schedule are amended\n\nRegulations\n\n33.\nregulations for giving effect to the provisions of the Act.\n\nThe  Commission  may,  with  the  approval  of  the  Minister,  make\n\nSavings and Transitional provision\n\nAn\n\nidentification  card  authorised  under  section  25  of\n\n34.(1)\nthe\nRepresentation of the People Act, Cap. 12 or under the Statistics Act, Cap. 192\nshall remain valid for a period of 12 months from the date of the commencement\nof this Act.\n\nA person who is an existing holder shall appear before a registering officer\n(2)\nto  register  with  the  Commission  before  the  end  of  the  period  specified  in\nsubsection (1).\n\n\f36\n\n(3)\nWhere an incapacitated person or an institutionalised person cannot appear\nbefore a registering officer, that person or any person authorised to act on the\nbehalf of that person, shall inform the registering officer of the condition of the\nperson.\n\nWhere  a  registering  officer  has  been  informed  in  accordance  with\n(4)\nsubsection (3), the registering officer shall visit that person for the purpose of\nphotographing and effecting the registration of that person and the registering\nofficer  shall  take  all  the  necessary  materials  to  ensure  that  he  will  accurately\nobtain  the  required  information  for  the  registration  of  the  person  and  the\nphotograph of the person.\n\nA registering officer shall take such steps as may be necessary to ensure\n(5)\nthat all information required for the registration of a person in accordance with\nthis Act is collected and recorded in respect of any person to whom this section\napplies.\n\nA person registered under this section shall obtain a copy of the Certificate\n\n(6)\nof Registration.\n\nA new identification card issued under this Act to any person who is an\n\n(7)\nexisting holder of a valid identification card\n\n(a)\n\n(b)\n\nauthorised under section 25 of the Representation of the People Act,\nCap.  12  and  issued  under  the  Representation  of  the  People\n(Registration of Electors) Regulations, 1990 (S.I. 1990 No. 8); or\n\nauthorised  under  the  Statistics  Act,  Cap.  192  and  issued  under  the\nStatistics (Registration Census of Barbadian Residents) Regulations,\n1979 (S.I. 1979 No. 47),\n\nshall be issued free of cost during the period referred to in subsection (1).\n\nSubsection (7) shall not apply to a person who is an existing holder who\n(8)\ndoes not register with the Commission before the end of the period specified in\nsubsection (1), and that person shall thereafter pay the cost of the replacement\nidentification card specified in the Third Schedule.\n\n\f(9)\n\nFor the purposes of this section,\n\n37\n\n“existing holder” means a person who was registered with the Commission or\nunder the Statistics Act, Cap. 192 and issued with an identification card by\nthe Commission prior to the commencement this Act;\n\n“incapacitated  person”  means  a  person  with  a  temporary  or  permanent\nimpediment  or  impairment  which  is  a  mental  or  physical  deficiency,\ndisability or illness; and\n\n“institutionalised  person”  means  person  in  the  care  or  custody  of  a  public\n\ninstitution.\n\n\f38\n\nFIRST SCHEDULE\n\nContents of National Register\n\n(Sections 2,4 and 14)\n\nPART I\n\nParticulars of a Person to be Recorded in the National Register\n\nFull name [First Name(s), Middle Name(s) and Surname Name].\n\nOther names by which the person is or has been known - Aliases.\n\nDate of birth.\n\nPlace of birth.\n\nSex, height, eye colour.\n\nPhysical abnormalities or distinguishing marks, if any.\n\nAddress of the ordinary place of residence in Barbados.\n\nNational identification number.\n\nDisability, if any.\n\nFull name of biological or adopted father.\n\nFull name of biological or adopted mother.\n\nPart of a twin or multiple birth.\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\n11.\n\n12.\n\n\f39\n\nName of guardian, where relevant, and the nature of relationship to\n13.\nthe minor, where a minor is being registered by a person who is not the parent of\nthe minor.\n\n14.\nA passport size photograph of the person which shall include the head\nand  shoulders  in  a  single  frame,  and  the  photograph  must  clearly  show  the\nfeatures of the face (not required for minors).\n\n15.\n\nSignature (not required for minors).\n\n16.\nminors).\n\n17.\n\n18.\n\n19.\n\n20.\n\n21.\n\n22.\n\nFingerprint  where  consent  has  been  obtained.  (not  required  for\n\nNationality.\n\nStatus.\n\nResidential status.\n\nMarital status.\n\nTelephone numbers.\n\nEmail address.\n\n23.\nof any of the armed forces of Barbados or another country).\n\nOccupation, profession, trade or employment (including membership\n\n24.\nDetails of documentary evidence and any other particulars that the\nChief Registering Officer or registering officer may consider necessary to ensure\ncorrect identification.\n\n25.\n\nOther relevant information required by the Commission.\n\n\f40\n\nPART II\n\nProcedure for a person to be photographed by the Commission\n\nA  person  seeking  registration  under  the  Act  shall,  as  a  part  of  the\n1.\napplication process, have his photograph taken by an officer of the Commission\nand that person shall comply with the requirements necessary for the officer of\nthe Commission to take his photograph.\n\n2.\nor an image selected and approved by the Commission.\n\nThe photograph will be taken against a background which has a colour\n\nThe officer of the Commission who is taking the photograph of the\n3.\nperson  shall  explain  how  the  photograph  will  be  taken  including  information\nregarding the number of shots to be taken and the position or direction from which\nthe person will be photographed.\n\n4.\nThe photograph shall be taken, framed and portrayed in such a manner\nthat shows the head and shoulders of the person with the face clearly visible. The\nface of the person in the photograph shall be clearly discernible from the hairline\nto the chin, and the photograph shall include the ears of the person.\n\n5.\nThe photograph of the person shall clearly show the centre of the face\nfacing forward and show all the facial features of the person being photographed\nsuch as the forehead, eyebrows, eyes, nose, cheeks, lips, chin and ears.\n\n6.\nThe photograph shall clearly show all the facial features of the person\nbeing  photographed  with  no  flaws  or  marks  obscuring  the  face  of  the  person\nunless the facial flaws or marks are genetic or a birth defect due to illness or a\nform of permanent cosmetic enhancement.\n\n7.\nshall be closed while being photographed.\n\nA person must exhibit or show a neutral expression and his mouth\n\n\f41\n\n8.\ncovering while being photographed except for religious purposes.\n\nA person shall not cover his ears with his hair or any other form of\n\n9.\ncovering for the head or face while being photographed, unless\n\nA person shall not wear a hat, cap, shawl, scarf or any other form of\n\n(a)\n\nthat  person  is  a  practicing  member  of  a  religion  which  requires  the\nwearing of a head covering as an expression of the religious faith of\nthat person. In that case the person is permitted to wear a covering for\nthe  head,  but  such  a  covering  must  permit  the  person  to  be\nphotographed in a manner which will capture the centre of the face\nfrom the hairline to the chin, and the photograph may include the ears\nof the person; or\n\n(b)\n\npermitted to do so by the Commission.\n\n10.\nor any other thing obscuring the eyes of the person in a photograph.\n\nThe eyes must be open and clearly visible and there must be no hair\n\n11.\nA  person  who  wears  prescription  spectacles  or  glasses  may  be\nphotographed in his prescription spectacles or glasses but the photograph must\nclearly show the eyes with no light reflecting in the prescription spectacles or\nglasses. It must be ensured that the spectacles or glasses do not obscure the eyes.\nThe eyes of the person must be clearly seen in the photograph.\n\n12.\nA person shall not wear tinted spectacles or glasses, shades or any\nother form of tinted or cosmetic eye covering which obscure or change the eyes\nwhile being photographed.\n\n13.\nA person shall not wear a garment which does not cover the shoulders\nwhile being photographed, as the shoulders of a person must be covered while\nbeing photographed .\n\n\f42\n\nPART III\n\nSupporting\nDocuments*\n\nNumber Date of\n\nIssue\n\nEffective\nDate\n\nPlace of\nIssue\n\nExpiry\nDate\n\nAdoption Order\nBirth Certificate\nCertificate of Change\nof Name\nPassport\nImmigrant Status\nCertificate\nWork Permit\nStudent Visa\nCARICOM Skilled\nNational\nRights of\nEstablishment\nPermanent\nResidence Certificate\nRegistered Deed Poll\nMarriage Certificate\nDecree Absolute\nSworn Affidavit\nOther relevant\ndocument(s)\n*This  list  of  supporting  documents  will  vary  depending  on  the  personal\ninformation of each person and, accordingly, barring certain commonalities, the\ncompleted National Registration Form will reflect the specific details of each\napplicant.\n\n\f43\n\nL.R.O. 1998SECOND SCHEDULE(Section 2)Barbados Identity Management Act(Act 2021-    )Certiﬁ cate of Registration  File NumberNational Identiﬁ cation Number Marital Status Phone (Home)Status Eye Colour Phone (Mobile)Residential Status Height Phone (Ofﬁ ce)Surname Occupation DisabilityFirst Name Place of Birth Receipt Number\f44\n\n L.R.O. 1998Second Schedule - (Cont'd)Certiﬁ cate  of  Registration - (Cont'd)Middle Name  Nationality Date of Birth SexAlias  Parish  Polling District Father's name  Email Address Constituency Mothers's name  Twin or multiple birth   Consent given for submission of finger prints for the purposes of identification card ornational identiﬁ cation credentialsGuardian ID House/Lot Number Delivery DateGuardian Name House Name Reason Change CardNature of the Guardian Any Other Particulars NotesExpiry dateYesNo\f45\n\n L.R.O. 1998Second Schedule - (Concl'd)Certiﬁ cate of Registration - (Concl'd)Supporting DocumentsType   Name Country Issue Date Expiry Date Effective DateOfﬁ cial's SignatureSignature and Name of Witness Reason for Placed Mark or Printed NameSignature or Mark of ApplicantPlease note that the information recorded in the National Register may be shared with other Government entities.  Kindly bring thiscertificate when you come to collect youridentiﬁ cation card.\f46\n\nL.R.O. 1998THIRD SCHEDULE(Sections 7, 9, 10, 13, 14, 17, 29, 30 and 34)Barbados Identity Management Act(Act 2021-    )Fees for Identiﬁ cation Cards$No chargeNo charge60.00  60.00No charge  60.00100.00100.00 Barbados Identiﬁ cation Card(a) Adult Barbados Identiﬁ cation Card: First Issue(b) Minor Barbados Identiﬁ cation Card: First Issue(c) Adult Barbados Identiﬁ cation Card: Replacement(d) Minor Barbados Identiﬁ cation Card: Replacement(e) Change from Minor Barbados Identiﬁ cation Card to Adult Barbados Identiﬁ cation Card(i) if the Minor Barbados Identiﬁ cation Card is returned to the Commission(ii) if the Minor Barbados Identiﬁ cation Card is lost or not returned to the Commission(f) Emergency (same day):(i) Issue of Adult Barbados Identiﬁ cation Card(ii) Issue of Minor Barbados Identiﬁ cation Card\f47\n\nL.R.O. 1998FOURTH SCHEDULE(Section 9)Barbados Identity Management Act(Act 2021-   )Notice of Change of ResidenceNOTICE OF CHANGE OF RESIDENCE FORMTo: The Chief Registering Ofﬁ cer1. Take notice that I have changed my place of residence as follows: From:  in the constituency of     . To:  in the constituency of     .2. The date of the change of my residence is the day of , 20 .3. My name is    and my National Identiﬁ cation Number is    .4. I do declare that the information given by me in this form is to the best of my knowledge and belief true and correct in all respects. Dated this day of  , 20 .(Full name in capital letters)(Insert the National Identiﬁ cation Number)Signature or mark of applicant.\f48\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of Barbados.R.O. 1998FIFTH  SCHEDULE(Sections 11 and 16)Barbados Identity Management Act(Act 2021-    )PART IParticulars and features to be displayed on the Identiﬁ cation Card1. Full name of person.2. Date of birth.3. Sex.4. Nationality.5. Disability (where applicable).6. National identiﬁ cation number.7. Signature of person (where the person is a minor, signature of parent or guardian of the minor is required).8. Photograph of holder (not applicable to minors).9. Expiry date (where applicable).10. Residential status (where applicable).11. Q R Code and other relevant encoding for usage of relevant authority.12. Machine readable zone.13. Digital chip.\f49\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of Barbados.R.O. 1998PART IIParticulars contained in the digital chip of the identiﬁ cation card1. Full name of person.2. Date of birth.3. Sex.4. Nationality.5. Place of birth.6. National identiﬁ cation number.7. Address.8. Photo or facial image.9. Type of disability (where applicable).10. Electronic signature.11. Password.12. Certiﬁ cate for electronic identiﬁ cation.13. Certiﬁ cate for electronic signature.14. Other representations or unique identiﬁ ers that may be stored electronically.15. Other personal data required pursuant to(a) a relevant enactment; or(b) an international convention to which Barbados is a party.Fifth Schedule - (Cont'd)\f50\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of Barbados.R.O. 1998PART IIIParticulars contained in the national identity credential1. Full name.2. Date of birth.3. Sex.4. Nationality.5. Place of birth.6. National identiﬁ cation number.7. Address.8. Photo or facial image.9. Type of disability (where applicable).10. Electronic signature.11. Password.12. Certiﬁ cate for electronic identiﬁ cation.13. Certiﬁ cate for electronic signature.14. Other representations or unique identiﬁ ers that may be stored electronically.15. Other personal data required pursuant to(a) a relevant enactment; or(b) an international convention to which Barbados is a party.Fifth Schedule - (Concl'd)\f51\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosSIXTH SCHEDULE(Section 32)CONSEQUENTIAL AMENDMENTSColumn 2Amendments1. Section 2 is amended by (a) inserting in the appropriate alphabetical  order, the following:“ “electronic signature” means a digital or electronic method used to identify an  individual and indicate that individual's  approval;\"; and(b) deleting the deﬁ ntion of the word \"signature\".2. Section 19 is amended by deleting subsection (3) and substituting the following: \"(3) The Minister may, by notice publishedin the Ofﬁ cial Gazette, revoke any recognitionaccorded under subsection (1), but, before doingso, the Minister shall(a) advise the certiﬁ cate service provider  affected of his intention to do so;(b) indicate his reasons for the proposed  revocation; and(c) invite the certiﬁ cate service provider referred to in paragraph (a)Column 1Enactments1. Electronics Transactions Act, Cap. 308B\f52\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosCONSEQUENTIAL AMENDMENTS - (Cont'd)Column 2Amendmentswithin 14 days of the notice, to submit representations in writing as to why the recognition should not be revoked, and shall consider those representations.\".3. Section 22 is amended by deleting subsections (6), (7), (8) and (9). 1. Section 6(4)(c) is deleted and the following is  substituted: \"(c)  at any election, vote without ﬁ rst producing  the identification card issued to him   pursuant to the Barbados Identity   Management Act, 2021 (Act 2021-   )   unless he proves to the satisfaction of the   presiding ofﬁ cer that he has not been   issued with an identiﬁ cation card or that   he has been issued with an identiﬁ cation   card that such card has been lost or   destroyed.\".2. Section 25 is deleted. 3. Section 68(1)(e) is deleted.1. Paragraphs (1)(b) and (2) of regulation 14 are deleted.2. Regulation 16(c) is deleted.3. Regulation 24 is deleted.4. Paragraphs (4) and (5) of regulation 28 are deleted.Column 1Enactments1. Electronics Transactions Act, Cap. 308B - (Concl'd)2. Representation of the People Act, Cap. 123. Representation of the  People (Registration of Electors) Regulations, 1990, (S.I. 1990 No. 8)Sixth Schedule - (Cont'd)\f53\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosColumn 1Enactments3. Representation of the  People (Registration of Electors) Regulations, 1990, (S.I. 1990 No. 8)  - (Concl'd)4. Representation of the  People (Identification Cards Replacement Fees) Regulations, 2007, (S.I. 2007 No. 10)5. Statistics Act, Cap. 192Column 2Amendments5. Regulation 29(c) is deleted.6. Regulation 36(3) is deleted and the following is substituted: \"(3) Where the registering officer or anenumerator is satisﬁ ed that the applicant is qualiﬁ edas an elector for the constituency in which the electoral revising centre is established, he shall cause the applicant's name, and address to be entered in the appropriate register or list,as the case may be, for that constituency.\".7. Form 6 of the First Schedule is deleted.The Representation of the People (Identification Cards Replacement Fee) Regulations, 2007 (S.I. 2007 No. 10) are revoked. Section 9 is amended by deleting subsection (3) and substituting the following: \"(3) Notwithstanding subsection (1)(a) the Chief Electoral Ofﬁ cer may in order to perform his functions under the Representation of the People Act, Cap. 12; and(b) the Chief Registering Ofﬁ cer may inorder to perform his functions under the Barbados Indentity Management Act, 2021 (Act 2021-  ),have access to the information obtained for or inany census.\".CONSEQUENTIAL AMENDMENTS - (Concl'd)Sixth Schedule - (Concl'd)\f54\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2021.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2021.\n\nPresident\n\n"
}