{
  "bill_id": 546,
  "slug": "resolution-re-house-of-assembly-to-allow-for-the-examination-of-the-estimates-to-be-made-from-the-committee-room-of-parliament-20210305",
  "title": "Resolution re House of Assembly  to allow for the Examination of the Estimates to be made from the Committee  Room of Parliament - 2021-03-05",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/5b30e9d27ae3c083f8625c5ccadff79f.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2021-03-09",
  "first_reading": "2021-03-09",
  "gazette_date": null,
  "markdown": "1    L.R.O.\n\n2021-03-05\n\nHOUSE OF ASSEMBLY\n\nWHEREAS  by  Proclamation  dated  the  26th  day  of  October,  2020  being\n\nS. I. 2020 No. 69 Parliament was empowered to meet from the 27th day of October, 2020 with\n\nsome  members  present  in  the  Chambers  and  others  participating  virtually  for  the  purpose  of\n\ncomplying with the physical distancing and related protocols made in consequence of the existence\n\nin Barbados of a state of public health emergency which renders it impracticable for all members\n\nof the House of Assembly and the Senate to meet physically;\n\nAND WHEREAS in accordance with Standing Order 65(2) of the Standing Orders\n\nof the House of Assembly a Minister, from the Lower House or from the Other Place, for the\n\npurposes of being questioned by the Committee, is permitted to leave his place and sit with his\n\nPermanent Secretary in a place designated by the Chairman of Committees;\n\nAND WHEREAS it is expedient that the designated place be the Committee Room\n\nof Parliament;\n\nAND  WHEREAS  in  accordance  with  Standing  Order  28(21)  of  the  Standing\n\nOrders of the House of Assembly a Member moving a motion or speaking in reply is required to\n\nbe physically present in the Chamber;\n\nAND WHEREAS it is expedient for the duration of the examination of the Estimates\n\nby the Standing Finance Committee for the member moving the particular Head and speaking in\n\nreply to make his presentation virtually;\n\nTHE LAWS OF BARBADOS\nPrinted by the Government Printer, Bay Street, St. Michael\nby the authority of the Government of Barbados\n\n\fL.R.O. 1998    2\n\n2\n\nBE  IT  RESOLVED  that  this  House  empowers  the  Chairman  of  Committees  to\n\ndesignate the Committee Room of Parliament as the place where examination by the Standing\n\nFinance Committee of the Head of the relevant Ministry is to be conducted;\n\nAND BE IT FURTHER RESOLVED that for the purpose of the examination of\n\nthe Estimates that the Member moving the particular Head and speaking in reply be allowed to\n\nmake that presentation virtually from the said Committee Room.\n\nDated this                         day of March, Two Thousand and twenty-one.\n\nSpeaker\n\n"
}