{
  "bill_id": 548,
  "slug": "anticorruption-and-antiterrorism-agency-bill-2021",
  "title": "Anti-Corruption and Anti-Terrorism Agency Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/87b2c37492286eacf72208222e34fc5e.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-03-10",
  "first_reading": "2021-03-26",
  "gazette_date": "2020-12-14",
  "markdown": "2021-03-09\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the establishment of an Anti-Corruption and Anti-\nTerrorism  Agency  to  investigate  acts  of  corruption  and  terrorism  and  would\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\nPART 1\n\nPreliminary\n\nPART II\n\nShort title\n\nDefinitions\n\nAnti- Corruption and Anti-Terrorism Agency\n\nPrincipal objects of Act\n\nEstablishment of the Agency\n\nFunctions of the Agency\n\nInvestigation and prosecution\n\nAcceptance of responsibility for investigation by Agency\n\nAgency’s investigation powers\n\nSearch warrant: documents\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nApplication of the Proceeds and Instrumentalities of Crime Act, 2019\n\n11.\n\nCo-operation with other bodies\n\n12.\n\nAgency subject to oversight by Committee\n\n\f13.\n\nMinisterial direction\n\n3\n\nPART III\n\nAdministration\n\n14.\n\nAppointment of Director-General\n\n15.\n\nDisqualification for appointment as Director-General\n\n16.\n\nFunctions of the Director-General\n\n17.\n\nDelegation of functions\n\n18.\n\nRemoval of Director-General\n\n19.\n\nResignation\n\n20.\n\nFilling of vacancy in office of Director-General\n\n21.\n\nAppointment and remuneration of staff and persons contracted ad hoc\n\n22.\n\nProcedures relating to appointment\n\n23.\n\nOaths\n\nPART IV\n\nFinancial Provisions, Plans and Reports\n\n24.\n\nFunds and resources of the Agency\n\n25.\n\nAccounts and audit\n\n26.\n\nExpenses and remuneration\n\n\f4\n\n27.\n\nAnnual plan\n\n28.\n\nDirector-General to consult in preparing annual plan\n\n29.\n\nEstimates and operating plan\n\n30.\n\nReturns\n\n31.\n\nAnnual and other reports\n\n32.\n\nReport\n\nPART V\n\nAgreements and Arrangements\n\n33.\n\nAgreements and arrangements with other agencies\n\nPART VI\n\nAnti- Corruption and Anti-Terrorism Agency Oversight Committee\n\n34.\n\nEstablishment and objectives of Committee\n\n35.\n\nFunctions of the Committee\n\n36.\n\nPowers of the Committee\n\n37.\n\nComplaint and conduct of investigation\n\n38.\n\nSteps after conduct of investigation\n\nPART VII\n\nProtection of Officers\n\n39.\n\nProtection of intelligence officers\n\n\f5\n\n40.\n\nProtection of other person exercising functions under this Act\n\nPART VIII\n\nOffences\n\n41.\n\nOffences\n\n42.\n\nGeneral penalty\n\n43.\n\nOffences committed by a body corporate\n\nPART IX\n\nGeneral\n\n44.\n\nCode of Conduct\n\n45.\n\nRecords\n\n46.\n\nMinister may vary monetary fines\n\n47.\n\nRegulations\n\n48.\n\nEnactments not affected\n\n49.\n\nCommencement\n\n\f6\n\nFIRST SCHEDULE\n\nForm of Oaths\n\nSECOND SCHEDULE\n\nContents of Report of Agency\n\nTHIRD SCHEDULE\n\nConstitution and Procedure of Committee\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the establishment of an Anti-Corruption and Anti-\nTerrorism  Agency  to  investigate  acts  of  corruption  and  terrorism  and  to\nprovide for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f8\n\nPART 1\n\nPreliminary\n\nShort title\n\n1.\nAgency Act, 2021.\n\nThis  Act  may  be  cited  as  the  Anti-Corruption  and  Anti-Terrorism\n\nDefinitions\n\n2.\n\nIn this Act,\n\n“Agency” means the Anti-Corruption and Anti-Terrorism Agency established by\n\nsection 4;\n\n“annual plan”  means the plan referred to in section 27;\n\n“Committee” means the Anti-Corruption and Anti-Terrorism Agency Oversight\n\nCommittee established by section 34;\n\n“complaint” means a complaint made under section 37;\n\n“corruption” means an offence under any enactment relating to corruption;\n\n“Director-General” means the Director-General of the Agency appointed under\n\nsection 14;\n\n“document” includes\n\n(a)\n\n(b)\n\n(c)\n\nanything on which there is writing;\n\na map, plan, drawing or photograph; and\n\nany  information  recorded  or  stored  by  means  of  any  tape  recorder,\ncomputer or other device, and any material subsequently derived from\nthe information so recorded or stored;\n\n“foreign  intelligence  department”  means  the  body  in  a  country,  other  than\nBarbados, which performs in that country, functions similar to those of the\nAgency;\n\n\f“functions” includes powers and duties;\n\n9\n\n“intelligence  officer”  means  an  officer  who  is  involved  in  the  collection,\ncompilation, analysis, processing and dissemination of information relevant\nto activities to combat corruption and terrorism;\n\n“law enforcement agency” means a person or authority with functions relating\nto the investigation and prosecution of offences of corruption and terrorism\nand includes a foreign intelligence department;\n\n“officer” means an employee or agent of the Agency;\n\n“positive vetting” means an investigation of the background and character of an\napplicant for a post in the public service where that post involves access to\nsecret information;\n\n“strategic partners” means\n\n(a)\n\n(b)\n\n(c)\n\nthe Director of Public Prosecutions;\n\nthe Chief of Staff, Barbados Defence Force;\n\nthe Commissioner of Police;\n\n(d)\n\nthe Revenue Commissioner;\n\n(e)\n\nthe Comptroller of Customs;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nthe Chief Immigration Officer;\n\nthe Director of the Financial Intelligence Unit;\n\nthe Chairman of the Integrity Commission;\n\nthe Registrar of the Supreme Court; and\n\nthe Superintendent of Prisons; and\n\n“terrorism”  means  any  offence  under  the  Anti-Terrorism  and  Counter-\n\nProliferation of Weapons of Mass Destruction Act, Cap. 158.\n\n\f10\n\nPART II\n\nAnti- Corruption and Anti-Terrorism Agency\n\nPrincipal objects of Act\n\n3.\n\nThe principal objects of this Act are to\n\n(a)\n\n(b)\n\n(c)\n\nestablish  an  Agency  which  will  have  sufficient  operational\nindependence and autonomy and be dedicated to combating corruption\nand  terrorism  in  collaboration  with  strategic  partners  and  law\nenforcement agencies, whether within or outside Barbados;\n\npromote  and  strengthen  measures  for  the  prevention,  detection,\ninvestigation and prosecution of corruption and terrorism;\n\nenhance  public  confidence  so  that  perpetrators  of  corruption  and\nterrorism will be brought to justice without undue delay; and\n\n(d)\n\npromote and protect public safety and national security.\n\nEstablishment of the Agency\n\n4.(1)\nestablished.\n\nThe  Anti-Corruption  and  Anti-Terrorism  Agency\n\nis  hereby\n\nThe  Agency  shall  be  a  body  corporate  to  which  section  21  of  the\n\n(2)\nInterpretation Act, Cap. 1 shall apply.\n\nFunctions of the Agency\n\n5.\nbe to\n\nSubject to the provisions of this Act, the functions of the Agency shall\n\n(a)\n\ncarry  out  efficient  and  effective  activities  to  combat  corruption  and\nterrorism whether by itself or in collaboration with strategic partners\nand law enforcement agencies, whether within or outside Barbados;\n\n\f11\n\n(b)\n\n(c)\n\n(d)\n\nimplement  measures  for  the  prevention,  detection,  reduction  and\nmitigation of the consequences of corruption and terrorism;\n\nreceive complaints in relation to alleged or suspected acts involving\ncorruption and terrorism;\n\ninvestigate  alleged  or  suspected  acts  involving  corruption  and\nterrorism;\n\n(e)\n\nprosecute offences relating to corruption and terrorism;\n\n(f)\n\n(g)\n\ngather,  store,  process,  analyse  and  disseminate  information  that  is\nrelevant to activities to combat corruption and terrorism;\n\ncollaborate,  co-operate,  and  co-ordinate  intelligence  and  other\nactivities with any other person or authority, whether within or outside\nBarbados, in order to prevent, detect, reduce or investigate corruption\nand terrorism; and\n\n(h)\n\ncarry out such other functions as may be conferred on the Agency by\nthis Act or any other enactment.\n\nInvestigation and prosecution\n\n6.\nand prosecution under this Act.\n\nThe same individual shall not perform the functions of investigation\n\nAcceptance of responsibility for investigation by Agency\n\n7.\nWhere, either before or after the commencement of an investigation,\nthe Commissioner of Police or the head of a law enforcement agency, other than\nthe Director-General, forms a view that the investigation should be conducted by\nthe Agency, the Commissioner of Police or the head of that law enforcement\nagency may refer the investigation to the Agency and the Director-General shall\ndetermine whether to accept responsibility for the investigation and inform the\nCommissioner of Police or the head of the law enforcement agency, as the case\nmay be, of his decision.\n\n\f12\n\nAgency’s investigation powers\n\n8.(1)\nThe  Agency  may  investigate  any  corruption  and  terrorism  or  any\nsuspected offence which appears to the Agency on reasonable grounds to involve\ncorruption  or  terrorism  or  to  relate  thereto  where  it  appears  to  the  Director-\nGeneral\n\n(a)\n\nthat the crime\n\n(i)\n\nis transnational in nature; or\n\n(ii)\n\nposes a significant threat to national security or public safety; or\n\n(b)\n\nthat there is good reason to do so for the purposes of investigating the\naffairs, or any aspect of the affairs, of a person.\n\nThe Director-General may, by notice in writing, require the person under\n(2)\ninvestigation or any other person to produce at such place as may be specified in\nthe notice\n\n(a)\n\n(b)\n\nany specified documents; or\n\nany documents of a specified description,\n\nwhich  appear  to  the  Director-General  to  relate  to  any  matter  relevant  to  the\ninvestigation.\n\n(3)\n\nWhere documents referred to in subsection (2)\n\n(a)\n\nare produced, the Director-General may\n\n(i)\n\ntake copies or extracts from them; and\n\n(ii)\n\nrequire the person who produced them to provide an explanation\nof any of them; or\n\n(b)\n\nare not produced, the Director-General may require the person who\nwas required to produce them to state, to the best of his knowledge and\nbelief, where they are.\n\n\f13\n\n(4)\nA  person  who,  without  reasonable  excuse,  fails  to  comply  with  a\nrequirement imposed on him under this section is guilty of an offence and liable\non summary conviction to a fine of $25 000 or to imprisonment for a term of 2\nyears or to both.\n\nSearch warrant: documents\n\n9.(1)\nany documents, that there are reasonable grounds to believe\n\nWhere a magistrate is satisfied by information on oath, in relation to\n\n(a)\n\nthat\n\n(i)\n\n(ii)\n\na person has failed to comply with an obligation under this section\nto produce such documents;\n\nit  is  not  practicable  to  serve  a  notice  on  the  person  under\ninvestigation; or\n\n(iii)\n\nthe service of such a notice in relation to the documents would\nseriously prejudice the investigation; and\n\n(b)\n\nthat the documents are on premises specified in the information,\n\nthe  magistrate  may  issue  a  warrant  authorising  any  constable  to  enter  any\npremises specified in the warrant, using such force as may be necessary for the\npurpose,  and  search  such  premises,  and  take  possession  of  any  documents\nappearing to be documents of the description specified in the information, or to\ntake in relation to any documents so appearing, any other steps necessary for\npreserving, and for preventing interference with, the documents.\n\nUnless it is not practicable in the circumstances, a constable executing a\n(2)\nwarrant  issued  under  subsection  (1)  shall  be  accompanied  by  an  appropriate\nperson.\n\nAn  appropriate  person  who  accompanies  a  constable  may,  under\n(3)\nsupervision  of  the  constable,  exercise  the  powers  conferred  on  the  constable\nunder subsection (1).\n\n\f14\n\n(4)\n\nIn this section “appropriate person” means\n\n(a)\n\n(b)\n\na member of the staff of the Agency; or\n\nsome  other  person,  not  being  a  member  of  the  staff  of  the  Agency,\nauthorised by the Director-General to accompany the constable.\n\nA statement made by a person in response to a requirement imposed by\n\n(5)\nvirtue of this section may only be used in evidence against him\n\n(a)\n\n(b)\n\non a prosecution for an offence under subsection (14); or\n\non a prosecution for some other offence where in giving evidence he\nmakes a statement inconsistent with it.\n\nThe statement referred to in subsection (5) may not be used against that\n\n(6)\nperson by virtue of paragraph (b) of that subsection, unless\n\n(a)\n\n(b)\n\nevidence relating to it is adduced; or\n\na question relating to it is asked,\n\nby or on behalf of that person in the proceedings arising out of the prosecution.\n\nAny  evidence  obtained  by  the  Director-General  for  use  by  a  foreign\n(7)\nintelligence department shall be given to the Minister responsible for Foreign\nAffairs for forwarding to the foreign intelligence department.\n\nWhere any evidence obtained by the Director-General for use by a foreign\n\n(8)\nintelligence department consists of\n\n(a)\n\n(b)\n\na document, the original or a copy shall be forwarded; and\n\nany  other  article,  the  article  or  a  description,  photograph  or  other\nrepresentation of it, shall be forwarded,\n\nas may be necessary in order to comply with the request of the  foreign intelligence\ndepartment.\n\nThe  references  in  subsections  (7)  and  (8)  to  evidence  obtained  by  the\n(9)\nDirector-General include references to evidence obtained by him by virtue of the\n\n\f15\n\nexercise by a constable, or by an appropriate person, in the course of a search\nauthorised by a warrant issued under subsection (1).\n\nA  person  shall  not  under  this  section  be  required  to  disclose  any\n(10)\ninformation or produce any document which he would be entitled to refuse to\ndisclose or produce on grounds of legal professional privilege in proceedings in\nthe High Court, except that an attorney-at-law may be required to furnish the\nname and address of his client.\n\nA person shall not under this section be required to disclose information\n(11)\nor produce a document in respect of which he owes an obligation of confidence\nby virtue of carrying on any banking business, unless the person to whom the\nobligation of confidence is owed consents to the disclosure or production.\n\nWithout prejudice to the power of the Director-General to assign functions\n(12)\nto members of the staff of the Agency, the Director-General may authorise any\ncompetent  investigator,  other  than  a  constable,  who  is  not  a  member  of  the\nAgency to exercise on his behalf all or any of the powers conferred by this section,\nbut no such authority shall be granted except for the purpose of investigating the\naffairs, or any aspect of the affairs, of a person specified in the authority.\n\nNo person shall be bound to comply with any requirement imposed by a\n(13)\nperson exercising powers by virtue of any authority granted under subsection\n(12) unless he has, if required to do so, produced evidence of his authority.\n\nA  person  who,  in  purported  compliance  with  a  requirement  under  this\n\n(14)\nsection,\n\n(a)\n\n(b)\n\nmakes  a  statement  which  he  knows  to  be  false  or  misleading  in  a\nmaterial particular; or\n\nrecklessly makes a statement which is false or misleading in a material\nparticular,\n\nis guilty of an offence.\n\n\f16\n\n(15)\n\nA person guilty of an offence under subsection (14) is liable\n\n(a)\n\n(b)\n\nsummary conviction, to a fine of $50 000 or to imprisonment for a term\nof 3 years or to both; and\n\non conviction on indictment, to a fine of $150 000 or to imprisonment\nfor a term of 5 years or to both.\n\n(16)\n\nWhere a person\n\n(a)\n\n(b)\n\nknows  or  suspects  that  an  investigation  by  the  Agency  or  by  a  law\nenforcement agency into corruption or terrorism is being or is likely to\nbe carried out; and\n\nfalsifies,  conceals,  destroys  or  otherwise  disposes  of,  or  causes  or\npermits  the  falsification,  concealment,  destruction  or  disposal  of\ndocuments which he knows or suspects are or would be relevant to such\nan investigation,\n\nhe is guilty of an offence, unless he proves that he had no intention of concealing\nthe  facts  disclosed  by  the  documents  from  persons  carrying  out  such  an\ninvestigation.\n\nA person guilty of an offence under subsection (16) is  liable on conviction\n(17)\non indictment, to a fine of $250 000 or to imprisonment for a term of 10 years or\nto both.\n\nApplication of the Proceeds and Instrumentalities of Crime Act, 2019\n(Act 2019-17)\n\nThe  Proceeds  and\n\n10.\nInstrumentalities  of  Crime  Act,  2019\n(Act 2019-17) shall apply to this Act with such modifications and adaptations as\nare necessary to give effect to this Act; and references in that Act to\n\n(a)\n\n(b)\n\n“prosecutor”  and  “senior  police  officer”  shall  be  construed  as\nreferences to the “Director-General”;\n\n“Recovery Agency” shall be construed as references to “the Agency”;\nand\n\n\f17\n\n(c)\n\n“money laundering” shall be construed as references to “corruption”\nor “terrorism” as the case may require.\n\nCo-operation with other bodies\n\n11.(1)\ncooperate with the Agency in the exercise of its functions under this Act.\n\nA law enforcement agency in Barbados shall take reasonable steps to\n\nSubject  to  subsection  (3),  the  Agency  shall  take  reasonable  steps  to\n(2)\ncooperate with any strategic partner or law enforcement agency in the exercise\nof any function conferred on the strategic partner or law enforcement agency\nunder this Act or any other enactment.\n\nWhere,  after  consultation  with  the  Director-General,  it  appears  to  the\n(3)\nMinister that it is appropriate for the Agency to provide specified assistance to\nanother law enforcement agency, the Minister may direct the Director-General\nto provide specified assistance to that law enforcement agency and the Director-\nGeneral shall take reasonable steps to comply with the directions of the Minister.\n\nAgency subject to oversight by Committee\n\n12.(1)\nCommittee.\n\nThe  Agency  shall  be  subject  to  the  authority  and  directions  of  the\n\n(2)\n\nThe Committee shall have oversight of the Agency.\n\nMinisterial direction\n\n13.(1)\nSubject  to  the  provisions  of  this  Act,  the  Minister  may,  after\nconsultation with the Director-General, give to the Director-General such policy\ndirections relating to the exercise of his functions as appear to the Minister to be\nin  the  public  interest,  and  the  Director-General  shall  give  effect  to  those\ndirections.\n\nSubject to subsection (3), the Minister shall approve the strategic plan for\n\n(2)\nthe Agency.\n\n\f(3)\n\nIn approving the strategic plan for the Agency, the Minister shall consult\n\n18\n\n(a)\n\n(b)\n\n(c)\n\nthe Committee;\n\nthe Director-General;\n\nthe strategic partners; and\n\n(d)\n\nany other person whom the Minister considers it appropriate to consult.\n\nPART III\n\nAdministration\n\nAppointment of Director-General\n\n14.(1)\n\nThe Director-General shall administer the Agency.\n\nThe  Director-General  shall  be  appointed  by  the  Governor-General  by\n(2)\ninstrument  in  writing  on  the  recommendation  of  the  Prime  Minister  after\nconsultation with the Leader of the Opposition.\n\nThe Director-General shall be appointed for a period of three years and\n\n(3)\nshall be eligible for reappointment.\n\nDisqualification for appointment as Director-General\n\n15.(1)\nDirector-General if the person\n\nSubject  to  section  22,  a  person  is  not  qualified  for  appointment  as\n\n(a)\n\nis a member of\n\n(i)\n\nthe Senate; or\n\n(ii)\n\nthe House of Assembly;\n\n(b)\n\nis bankrupt; or\n\n(c)\n\nhas  been  convicted  of  an  offence  involving  dishonesty  or  moral\nturpitude.\n\n\f19\n\n(2)\nA Director-General shall vacate his office if any circumstance arises that,\nif he were not Director-General, would, by virtue of subsection (1), cause him to\nbe disqualified for appointment as Director-General.\n\nFunctions of the Director-General\n\n16.(1)\n\nThe Director-General\n\n(a)\n\n(b)\n\n(c)\n\nis responsible for the day to day administration and operation of the\nAgency  and  shall  have\nthe  sole  operational  command  and\nsuperintendence of the Agency;\n\nshall determine the policy priorities of the Agency in accordance with\nthe strategic plan and the annual plan;\n\nshall  determine  the  operational  priorities  for  the  Agency  and  those\npriorities may relate to\n\n(i)\n\nmatters to which current strategic priorities also relate; or\n\n(ii)\n\nother similar matters;\n\n(d)\n\nshall  establish  and  implement  practices  for  internal  disciplinary\nprocedures.\n\n(2)\n\nThe Director-General shall consider ,\n\n(a)\n\n(b)\n\noperational priorities referred to in subsection (1)(c);\n\nthe strategic priorities referred to in sub-paragraph (i) of subsection (1)\n(c); and\n\n(c)\n\nthe strategic plan.\n\n(3)\n\nThe Director-General may decide\n\n(a)\n\n(b)\n\nwhich operations are to be conducted by the Agency; and\n\nhow the operations are to be conducted.\n\n\f20\n\n(4)\nWhen executing duties under this Act, the Director-General and any officer\ndesignated by him shall, for that limited purpose only, be vested with the powers,\nprivileges and immunities of a member of the Royal Barbados Police Force.\n\nThe Director-General shall not designate an officer under subsection (4),\n\n(5)\nunless the Director-General is satisfied that the officer\n\n(a)\n\n(b)\n\nis capable of effectively exercising the powers; and\n\nhas  received  adequate  training  in  respect  of  the  exercise  of  those\npowers.\n\nThe Director-General may modify or withdraw a designation of an officer\n\n(6)\nby giving notice in writing of the modification or withdrawal to the officer.\n\nFor the purposes of the exercise of the powers conferred under subsection\n(7)\n(4) on the Director-General or an officer designated by him, the Director-General\nmay  make  arrangements  for  the  Agency  to  use  premises  or  facilities  used  in\nconnection with those functions.\n\nDelegation of functions\n\n17.(1)\nThe Director-General may delegate, in writing, the exercise of any\nfunction  conferred  upon  him  by  or  under  this  Act,  other  than  the  power  of\ndelegation, to such officer of the Agency, hereinafter called \"the delegate\", as he\nthinks fit.\n\n(2)\n\nA delegation under subsection (1) shall not affect\n\n(a)\n\n(b)\n\nthe exercise of the delegated function by the Director-General; or\n\nthe  responsibility  of  the  Director-General  in  relation  to  acts  of  the\ndelegate carried out in lawful exercise of the delegated function.\n\nAny act done by or in relation to the delegate pursuant to the delegated\n(3)\nfunction shall have the same effect as if it were done by or in relation to the\nDirector-General.\n\n\f21\n\n(4)\nFor  the  avoidance  of  doubt,  a  delegation  under  subsection  (1)  shall,  in\naddition to conferring authority to exercise the delegated function, also subject\nthe delegate to the same obligations as would apply under this Act to the Director-\nGeneral’s exercise of such function, and accordingly, the delegate shall be liable\nfor any wrongful act or omission of the delegate occurring in the exercise of that\nauthority.\n\nThe  Director-General  may,  in  writing,  revoke  a  delegation  made  under\n\n(5)\nsubsection (1).\n\nRemoval of Director-General\n\n18.\n\nThe Director-General may be removed from office\n\n(a)\n\nfor inability to discharge the functions of the office, whether arising\nfrom infirmity of body or mind;\n\n(b)\n\nfor incompetence;\n\n(c)\n\nfor misconduct;\n\n(d)\n\nif he becomes bankrupt;\n\n(e)\n\nif  he  is  convicted  of  any  offence  involving  dishonesty  or  moral\nturpitude;\n\n(f)\n\nif he fails,\n\n(i)\n\nwithout reasonable excuse, to carry out any function conferred or\nimposed on him under this Act; or\n\n(ii)\n\nbreaches his contract of employment.\n\nResignation\n\n19.\nThe Director-General may at any time resign his office by notice in\nwriting addressed to the Governor-General and transmitted through the Minister,\nand the resignation shall take effect from the date on which the Minister receives\nthe instrument or the date specified in the instrument, whichever is earlier.\n\n\f22\n\nFilling of vacancy in office of Director-General\n\n20.(1)\nWhere a vacancy arises in the office of Director-General, a suitable\nperson  may  be  designated  to  act  in  that  office  during  such  vacancy  until  an\nappointment is made.\n\nWhere,  by  reason  of  illness,  absence  from  Barbados  or  other  sufficient\n(2)\ncause, the Director-General is unable to perform his functions under this Act, the\nGovernor-General  shall,  on  the  recommendation  of  the  Prime  Minister  after\nconsultation with the Leader of the Opposition, appoint a person to act in the\noffice of Director-General.\n\nAppointment and remuneration of staff and persons contracted ad hoc\n\n21.(1)\nfor the efficient operation of the Agency.\n\nThe Director-General, shall appoint such staff as may be necessary\n\n(2)\n\nStaff appointed under subsection (1) shall include\n\n(a)\n\n(b)\n\ninvestigating officers, who shall investigate, in the manner specified\nby  or  under  this  Act,  any  allegation  that  involves  corruption  or\nterrorism; and\n\nprosecuting officers, who shall, subject to the powers conferred on the\nDirector  of  Public  Prosecutions  by  section  79  of  the  Constitution,\ninstitute,  undertake  and  have  the  conduct  of  prosecutions  in  respect\nof corruption and terrorism.\n\nThe  Director-General  may  contract  ad  hoc  such  persons  as  may  be\n(3)\nnecessary to provide technical services as the Agency may require from time to\ntime.\n\nExcept as provided in subsection (2)(b), any prosecuting officer appointed\n(4)\nthereunder, shall not be subject to the direction or control of any person in relation\nto the conduct of his prosecutorial functions under this Act.\n\n\f23\n\nNo salary in excess of the prescribed rate of salary shall be assigned to any\n\n(5)\npost within the Agency without the prior approval of the Minister.\n\n(6)\nNo appointment shall be made to any post within the Agency to which a\nsalary  in  excess  of  the  prescribed  rate  of  salary  is  assigned  without  the  prior\napproval of the Minister.\n\n[For the purposes of subsections (5) and (6), the \"prescribed rate\" means\n(7)\nsuch  rate  as  the  Minister  responsible  for  the  Public  Service  may,  by  order,\nprescribe.]\n\nThe Governor General may, subject to such conditions as he may impose,\n(8)\napprove the appointment of any public officer to any office within the Agency\nand a public officer so appointed shall, while so employed, in relation to any\npension, gratuity or other allowance and in relation to any other rights as a public\nofficer, be treated as continuing in the service of the Crown.\n\n(9)\n\nThe Agency may, with the approval of the Minister,\n\n(a)\n\n(b)\n\nenter  into  arrangements  respecting  schemes,  whether  by  way  of\ninsurance policies or otherwise; and\n\nmake regulations, for medical benefits, pensions, gratuities and other\nretiring benefits or disability or death benefits relating to staff of the\nAgency, and\n\nsuch arrangements or regulations may include provisions for the grant of benefits\nto the dependants of the staff.\n\nProcedures relating to appointment\n\n22.(1)\nThe  Director-General,  officers  of  the  Agency  and  members  of  the\nCommittee  shall  be  subject  to  positive  vetting  procedures  before  they  are\nappointed.\n\n\f24\n\nA person shall not be eligible to be appointed to the office of Director-\n\n(2)\nGeneral or any other office under section 21 unless the person\n\n(a)\n\nhas  received  adequate  training  in  respect  of  the  performance  of  the\nduties of the office;\n\n(b)\n\nis capable of effectively performing the duties of the office; and\n\n(c)\n\nis competent, diligent, of integrity, of sound judgment and impartial.\n\nOaths\n\nThe  Director-General  shall,  before  assuming  office,  take  and\n23.(1)\nsubscribe, before the Governor-General, the oath of office and oath of secrecy\nset out in Form 1 and Form 2, respectively, of the First Schedule.\n\nEvery person, other than the Director-General having an official duty under\n(2)\nthis Act or being employed or otherwise connected with the administration of\nthis  Act  shall,  before  assuming  duty,  take  and  subscribe  before  the  Director-\nGeneral the oath of office and oath of secrecy set out in Form 3 and Form 4,\nrespectively of the First Schedule.\n\nEvery person who had an official duty under this Act or was employed in\n(3)\nthe administration of this Act shall maintain, after such duty or employment is\nterminated, the confidentiality of all information or documents relating to the\nfunctions of the Agency.\n\nAny person to whom information is communicated pursuant to this Act\n\n(4)\nshall regard and deal with the information as secret and confidential.\n\nEvery person referred to in subsection (1), (2) or (3), having possession of\n(5)\nor control over any information or document  and who at any time communicates\nor attempts to communicate any such information or any thing contained in the\ndocument to any person, otherwise than pursuant to\n\n(a)\n\n(b)\n\nhis functions under this Act or any other enactment;\n\na court order; or\n\n\f25\n\n(c)\n\nan  arrangement  entered  into  for  the  exchange  of  information  under\nsection 33,\n\nis guilty of an offence.\n\n(6)\nFor the purposes of this section, \"information\" includes information from\nwhich a person can be identified and which is acquired by the Agency in the\ncourse of carrying out its functions.\n\nPART IV\n\nFinancial Provisions, Plans and Reports\n\nFunds and resources of the Agency\n\n24.\nas may be appropriated for the purposes of the Agency by Parliament.\n\nThe Funds and the resources of the Agency shall consist of such funds\n\nAccounts and audit\n\n25.(1)\nThe  Agency  shall  keep  proper  records  of  its  receipts,  expenditure,\nassets  and  liabilities  and  its  accounts  shall  be  audited  annually  by  an  auditor\nappointed  by  the  Director-General  with  the  approval  of  the  Minister  and  a\nstatement of accounts so audited shall form part of the annual report submitted\npursuant to section 29.\n\nThe Director-General shall, at such time within each year as the Minister\n(2)\nmay  direct,  submit  to  the  Minister  a  statement  of  accounts  of  the  Agency  in\naccordance with the provisions of subsection (1).\n\nExpenses and remuneration\n\n26.\nThe  expenses  of  the  Agency,  including  the  remuneration  of  the\nDirector-General, officers and members of the Committee, shall be paid out of\nthe funds of the Agency.\n\n\f26\n\nAnnual plan\n\n27.(1)\nBefore the beginning of each financial year, the Director-General shall\nsubmit  an  annual  plan  to  the  Minister  setting  out  how  the  Director-General\nintends that the functions of the Agency are to be exercised during that year.\n\n(2)\n\nThe annual plan for a financial year shall include\n\n(a)\n\n(b)\n\na statement of the strategic priorities for the Agency;\n\na statement of the operational priorities for the Agency and in relation\nto each of the strategic and operational priorities, an explanation of how\nthe Director-General intends that effect may be given to the priority;\n\n(c)\n\nways in which the Agency is to operate, including\n\n(i)\n\narrangements for publishing information about the exercise of the·\nfunctions of the Agency and other matters relating to the Agency,\nincluding requirements about the type of information that should\nnot be published; and\n\n(ii)\n\nways in which the Agency is to be administered, including with\nrespect to governance and finance.\n\nDirector-General to consult in preparing annual plan\n\n28.\n\nIn preparing an annual plan, the Director-General shall consult\n\n(a)\n\n(b)\n\nthe strategic partners; and\n\nany other persons whom the Director-General considers it appropriate\nto consult.\n\nEstimates and operating plan\n\n29.\nthe Minister, submit to the Minister for his approval\n\nThe Agency shall, in each financial year, before a date specified by\n\n(a)\n\nestimates of income and expenditure for the ensuing financial year; and\n\n\f(b)\n\nthe annual plan required by section 27.\n\n27\n\nReturns\n\n30.\nThe Agency shall furnish the Minister with such returns, accounts and\nother information as he may require with respect to the activities of the Agency,\nand  shall  afford  him  facilities  for  verifying  the  returns,  accounts  and  other\ninformation in such manner and at such times as he may reasonably require.\n\nAnnual and other reports\n\nA  copy  of  the  annual  report  and  audited  financial  statement  of  the\n31.(1)\nAgency,  approved  by  the  Minister,  shall  be  submitted  to  the  Minister  of\nFinance, no later than four months after the end of each financial year.\n\nThe Minister of Finance shall cause a copy of the report together with the\n(2)\nannual statement of accounts and the Auditor-General's report thereon to be laid\nin Parliament.\n\nReport\n\n32.(1)\nThe Director-General shall, not later than 3 months after the end of\neach  financial  year,  submit  to  the  Minister  a  report  relating  generally  to  the\nexecution of the functions of the Agency during the preceding financial year.\n\nThe report referred to in subsection (1) shall contain the information set\n\n(2)\nout in the Second Schedule.\n\nThe Director-General may, at any time, submit to the Minister a report\n(3)\nrelating to any particular matter which in the opinion of the Director-General\nrequires the special attention of the Minister.\n\nThe  report  referred  to  in  subsection  (3)  shall  exclude  any  matter  that\n\n(4)\nwould, if it were included, prejudice proceedings referred to therein.\n\nThe  Minister  shall,  not  later  than  one  month  after  receipt  of  a  report\n\n(5)\nsubmitted to him under subsection (1) or (3), lay the report in Parliament.\n\n\f28\n\nPART V\n\nAgreements and Arrangements\n\nAgreements and arrangements with other agencies\n\nSubject to the provisions of this Act, the Director-General may, with\n33.(1)\nthe approval of the Minister, enter into a contract, memorandum of understanding\nor other agreement or arrangement with a strategic partner or a law enforcement\nagency,  whether  within  or  outside  Barbados,  regarding  the  exchange  of\ninformation  with  the  agency  relevant  to  the  investigation  or  prosecution  of\noffences relating to corruption or terrorism.\n\nSubject  to  subsection  (1),  the  Director-General  may  exchange  with  a\n(2)\nforeign intelligence department, information necessary to enable that department\nto  exercise  regulatory  functions,  including  the  conduct  of  civil,  criminal  or\nadministrative investigations and proceedings to enforce laws administered by\nthe department.\n\nThe Director-General may decline to facilitate the exchange of information\n(3)\nunless  the  strategic  partner,  foreign  intelligence  department,  or  the  law\nenforcement agency, as the case may be, undertakes to make such contribution\ntowards the costs of the exchange as the Director-General considers appropriate.\n\nNothing in subsections (1) to (3) authorises a disclosure by the Director-\n\n(4)\nGeneral, unless he is satisfied that the\n\n(a)\n\nstrategic  partner,  the  foreign  intelligence  department,  or  law\nenforcement agency is subject to adequate legal restrictions on further\ndisclosures,  including  the  provision  to  the  Director-General  of  an\nundertaking of confidentiality on the part of the strategic partner, the\nforeign intelligence department, or the law enforcement agency not to\ndisclose the information provided without the consent of the Director-\nGeneral; or\n\n\f29\n\n(b)\n\nassistance requested by the strategic partner, the foreign intelligence\ndepartment or the law enforcement agency is required for the purposes\nof the functions of the department or agency, including the conduct of\ncivil,  criminal  or  administrative  investigations  or  proceedings  to\nenforce laws administered by the department or the Agency.\n\nWhere  in  the  opinion  of  the  Director-General,  it  appears  necessary,  in\n(5)\nrelation  to  any  request  for  information  received  from  a  foreign  intelligence\ndepartment, a strategic partner or a law enforcement agency to obtain an order\nof the High Court, the Director-General shall\n\n(a)\n\n(b)\n\nimmediately  notify  the  Attorney-General  of  the  particulars  of  the\nrequest; and\n\nsend to the Attorney-General copies of all documents relating to the\nrequest\n\nand the Attorney-General is entitled to appear or take part in any proceedings in\nBarbados, or in any appeal from such proceedings, arising directly or indirectly\nfrom any such request.\n\nWhere pursuant to a request for the exchange of information, the Director-\n(6)\nGeneral in accordance with this Act supplies information to a requesting party,\nthe information shall be deemed to have been lawfully given under this Act.\n\nSubject  to  this  Act  the  Government  may  enter  into  any  agreement  or\n\n(7)\narrangement in writing with\n\n(a)\n\n(b)\n\n(c)\n\nthe Government of a foreign State;\n\nan international organisation; or\n\na foreign intelligence department,\n\nregarding the exchange of information relevant to the investigation or prosecution\nof an offence relating to corruption or terrorism.\n\nFor the purpose of an agreement or arrangement under subsection (7), the\n(8)\nMinister shall be satisfied, in relation to the entity or party to such agreement or\n\n\f30\n\narrangement,  as  to  the  like  matters  as  those  of  which  the  Director-General  is\nrequired to be satisfied in relation to an agreement or arrangement with a foreign\nintelligence department under subsection (4).\n\nThe  Minister  may  make  regulations  concerning  the  exchange  of\n(9)\ninformation relevant to the investigation or prosecution of an offence relating to\ncorruption or terrorism.\n\nPART VI\n\nAnti- Corruption and Anti-Terrorism Agency Oversight Committee\n\nEstablishment and objectives of Committee\n\n34.(1)\nCorruption and Anti-Terrorism Agency Oversight Committee.\n\nThere is hereby established a Committee to be known as the  Anti-\n\n(2)\n\nThe objectives of the Committee are to\n\n(a)\n\n(b)\n\nhold the Director-General and other officers of the Agency accountable\nto the public in the performance of their functions under this Act; and\n\nprovide  independent  oversight  in  relation  to  the  handling  of\ncomplaints made by any person pursuant to section 37.\n\nThe Third Schedule shall have effect with respect to the constitution of the\n\n(3)\nCommittee and otherwise in relation thereto.\n\nFunctions of the Committee\n\n35.\n\nThe functions of the Committee are to\n\n(a)\n\ninvestigate  any  complaint  relating  to  misconduct,  abuse  of  power,\nbreach of disciplinary procedures or unlawful conduct in respect of any\nact or omission by the Director-General or any other officer in relation\nto his functions under this Act;\n\n(b)\n\nmonitor and investigate operations affecting members of the public;\n\n\f31\n\n(c)\n\n(d)\n\nreview generally the performance by the Agency and its functions, and\nmake recommendations to the Minister thereon;\n\ncooperate with or seek assistance from other government institutions\nor entities on issues of intelligence oversight or on any matter under\ninvestigation; and\n\n(e)\n\nperform such other functions as may be necessary for promoting the\nobjectives under section 34(2) for which the Committee is established.\n\nPowers of the Committee\n\n36.(1)\n\nThe Committee\n\n(a)\n\n(b)\n\n(c)\n\nmay  investigate  any  aspect  of  the  operations  of  the  Agency  or  the\nconduct of the Director-General or any other officer of the Agency in\nrelation to his functions under this Act;\n\nis entitled to have access to the records of the Agency and to make\ncopies of such records;\n\nmay  require  the  Director-General  to  supply  information  or  provide\ndocuments in respect of any matter relating to the operations of the\nAgency or the conduct of an officer.\n\nNotwithstanding  the  provisions  of  any  enactment  to  the  contrary  and\n(2)\nsubject to subsection (3), the Committee shall be the sole body responsible for\nreceiving and investigating any complaint made pursuant to section 37 of this\nAct.\n\nWithout prejudice to subsection (2), the Minister acting on the advice of\n(3)\nthe Committee may, in such manner as he deems appropriate, seek the assistance\nof any law enforcement agency in the investigation of a complaint made pursuant\nto section 37 or any other matter which may be relevant to the investigation.\n\n\f32\n\nComplaint and conduct of investigation\n\n37.(1)\nA person may make a complaint to the Committee in respect of any\nmatter relating to the conduct of the Director-General or an officer carrying out\nfunctions under this Act.\n\nA complaint under subsection (l) may be made orally, subject to subsection\n(2)\n(3), in writing, or in such form or manner as may be prescribed and shall be lodged\nwith the Secretary of the Committee.\n\nWhere a complaint is made orally it shall be reduced into writing by the\n(3)\nSecretary not later than three days from the date on which the complaint was\nmade.\n\nA complaint made under subsection (1) shall contain such particulars as\n\n(4)\nmay be prescribed.\n\n(5)\n\nUpon receipt of a complaint the Committee shall forthwith\n\n(a)\n\n(b)\n\nrequest  information  or  reports  regarding  the  complaint  from  the\nAgency within a specified period; or\n\nwithout prejudice to paragraph (a), initiate such investigation as it may\nconsider necessary, having regard to the nature of the complaint.\n\nFor the purposes of an investigation under this section, the Committee shall\n(6)\nhave  the  powers,  privileges  and  immunities  conferred  upon  a  Commissioner\nunder the Commissions of Enquiry Act, Cap. 112 and the provisions of that Act\nshall apply to any person summoned by or appearing before the Committee as if\nthe Committee were a commission of enquiry constituted under that Act.\n\nWhere the Committee considers a complaint to be frivolous or vexatious,\n(7)\nthe  Committee  may  refuse  to  conduct  an  investigation  and  shall,  where\npracticable, state its refusal in writing to the complainant.\n\nThe  Committee  may,  upon  receipt  of  new  evidence,  re-open  any\n(8)\ninvestigation  which  has  been  concluded,  and  may  amend  or  withdraw  any\nprevious findings and recommendations.\n\n\f33\n\nSteps after conduct of investigation\n\n38.\n37, the Committee may,\n\nAfter conducting an investigation into a complaint made under section\n\n(a)\n\n(b)\n\n(c)\n\nwhere in its opinion the investigation discloses evidence of a criminal\noffence by any officer of the Agency, recommend the prosecution of\nthe officer concerned to the Director of Public Prosecutions;\n\nwhere  the  investigation,  in  the  opinion  of  the  Committee,  discloses\nmisconduct, malfeasance or negligence in the performance of a duty\nby an officer, proceed in accordance with the prescribed disciplinary\nprocedures;\n\nwhere the investigation discloses any shortcomings in the processes or\nprocedures  employed  by  the  Agency,  recommend  improvement  or\nrectification thereof to the Minister.\n\nPART VII\n\nProtection of Officers\n\nProtection of intelligence officers\n\n39.\nThe Director-General may take such action as may be necessary to\nensure the security, secrecy, safety, accommodation and financial requirements\nof an intelligence officer.\n\nProtection of other person exercising functions under this Act\n\n40.(1)\nNo civil or criminal action, suit or other proceedings for breach of\nconfidentiality may be brought nor any professional sanction for such breach may\nbe  taken  against  any  person  who  in  good  faith,  under  this  Act  or  any  other\nenactment, provides or transmits information requested by the Agency or submits\na report to the Agency.\n\n\f34\n\n(2)\nNo  suit  or  other  proceedings  may  be  brought  or  instituted  personally\nagainst any officer in respect of any lawful act done or omission made in good\nfaith, in the course of carrying out the provisions of this Act.\n\nSubsection (2) applies to persons contracted in accordance with section\n\n(3)\n21(3).\n\nPART VIII\n\nOffences\n\nOffences\n\n41.\n\nA person is guilty of  an offence who,\n\n(a)\n\nwilfully threatens or assaults an officer or any other person performing\nany function under this Act;\n\n(b)\n\nwithout lawful justification or excuse\n\n(i)\n\n(ii)\n\nobstructs or hinders an officer or any other person performing any\nfunction under this Act; or\n\nwilfully refuses or neglects to carry out any duty required to be\nperformed by him under this Act;\n\n(c)\n\n(d)\n\n(e)\n\nwilfully makes any false statement to mislead or attempts to mislead\nan officer or any other person performing any function under this Act;\n\nknowingly makes any false declaration or false statement of a material\nnature in any information provided to an officer or any other person\nperforming any function under this Act;\n\nknowingly furnishes to any officer or any other person performing any\nfunction under this Act a document that contains information which is\nfalse or misleading in any material particular;\n\n\f35\n\n(f)\n\nwithout reasonable excuse fails to keep any record or other document\nrequired under this Act;\n\n(g)\n\nwith intent to deceive\n\n(i)\n\n(ii)\n\n(iii)\n\nimpersonates an officer;\n\nmakes any statement or does any act calculated falsely to suggest\nthat the person is an officer;\n\nmakes any statement or does any act calculated falsely to suggest\nthat the person has powers as an officer that exceed the powers\nthe person actually has.\n\nGeneral penalty\n\n42.\n\nA person guilty of an offence under section 23 or 41 is liable\n\n(a)\n\nin the case of an individual,\n\n(i)\n\n(ii)\n\non summary conviction to a fine of $100 000 or to imprisonment\nfor a term of 5 years or to both; and\n\non  conviction  on  indictment  to  a  fine  of  $250  000  or  to\nimprisonment for a term of 10 years or to both; and\n\n(b)\n\nin the case of a body corporate,\n\n(i)\n\non summary conviction to a fine of $150 000; and\n\n(ii)\n\non conviction on indictment to a fine of $500 000.\n\nOffences committed by a body corporate\n\n43.\nand is proved\n\nWhere an offence under this Act is committed by a body corporate\n\n(a)\n\nto have been committed with the consent or connivance of any director,\nmanager, secretary or other similar officer of the body corporate or any\nperson who purported to act in that capacity; or\n\n\f36\n\n(b)\n\nto be attributable to the failure of any such director, manager, secretary\nor other officer to exercise all such reasonable diligence as he ought in\nthe  circumstances  to  have  exercised  to  prevent  the  offence,  having\nregard to the nature of his functions and all the circumstances,\n\nsuch director, manager, secretary or other officer, as well as the body corporate,\nis guilty of that offence and is liable to be proceeded against and punished in\naccordance with paragraph (a) or (b) of section 42, as the case requires.\n\nPART IX\n\nGeneral\n\nCode of Conduct\n\nThe Director-General and other officers of the Agency shall comply\n44.\nwith such Code of Conduct as may be prescribed and a person who fails to comply\nwith the Code of Conduct shall be liable to such disciplinary proceedings as may\nbe prescribed.\n\nRecords\n\n45.\nrelating to the functions of the Agency as may be prescribed.\n\nThe Director-General may require any person to keep such documents\n\nMinister may vary monetary fines\n\n46.\nmonetary fines specified in this Act.\n\nThe Minister may by order, subject to negative resolution, vary any\n\nRegulations\n\n47.(1)\nadministration of and for giving effect to the provisions of this Act.\n\nThe  Minister  may  make  regulations  generally  for  the  proper\n\n\f37\n\nWithout  prejudice  to  the  generality  of  subsection  (1),  regulations  made\n\n(2)\nunder this section may make provision\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nrequiring equipment used by the Agency to satisfy specifications as to\ndesign and performance;\n\nsetting out the practices and procedures to be adopted in relation to the\ninvestigation or prosecution of corruption and terrorism under this Act;\n\nprescribing a Code of Conduct for officers; and\n\nprescribing  such  other  matters  as  are  required  by  this  Act  to  be\nprescribed.\n\n(3)\n\nFor the purposes of subsection (2)(a), \"equipment\" includes\n\n(a)\n\n(b)\n\nvehicles; and\n\nheadgear and any other protective clothing.\n\n(4)\n\nRegulations made under this section shall be subject to negative resolution.\n\nEnactments not affected\n\n48.\n\nNothing in this Act shall affect\n\n(a)\n\n(b)\n\nthe  provisions  of  the  Mutual  Assistance  in  Criminal  Matters  Act,\nCap. 140A; or\n\nthe  Official  Secrets  Act,  1911,  1  &  2  Geo.  5,  c.  28  and  the  Official\nSecrets  Act,  1920,  10  &  11  Geo.  5,  c.  75  of  the  United  Kingdom\nParliament in so far as they are applicable to Barbados.\n\nCommencement\n\n49.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f38\n\nL.R.O. 1998FIRST SCHEDULE(Section 23(1) and (2))FORM OF OATHSForm 1Anti-Corruption and Anti-Terrorism Agency Act, 2021(Act 2021-  )OATH OF OFFICE I  do swear/afﬁ rm that I will exercise the functions of Director-General of the Anti-Corruption and Anti-Terrorism Agency  without fear or favour, affection or ill-will according to the Laws of Barbados.  So Help Me God.Dated this day of  , 20 .Signature\f39\n\nL.R.O. 1998First Schedule - (Cont'd)Form 2Anti-Corruption and Anti-Terrorism Agency Act, 2021 (Act 2021-  )OATH OF SECRECY I  Director-General of the Anti-Corruption and Anti-Terrorism Agency do swear/afﬁ rm that I will treat all documents, information and records of the Anti-Corruption and Anti-Terrorism Agency as secret and conﬁ dential and I shall not disclose or communicate to any unauthorised person or allow any unauthorised person to have access to any such documents, information or records.  So Help Me God.Dated this day of  , 20 .Signature\f40\n\nL.R.O. 1998First Schedule - (Cont'd)Form 3Anti-Corruption and Anti-Terrorism Agency Act, 2021 (Act 2021-  )OATH OF OFFICE I  do swear/afﬁ rm that I will exercise my functions as an employee/a person performing functions for the Anti-Corruption and Anti-Terrorism Agency without fear or favour, affection or ill-will according to the Laws of Barbados.  So Help Me God.Dated this day of  , 20 .Signature\f41\n\nL.R.O. 1998First Schedule - (Concld)Form 4Anti-Corruption and Anti-Terrorism Agency Act, 2021 (Act 2021-  )OATH OF SECRECY I  employee/person performing a function for the Anti-Corruption and Anti-Terrorism Agency do swear/afﬁ rm that I will treat all documents, information and records of the Anti-Corruption and Anti-Terrorism Agency as secret and conﬁ dential and I shall not disclose or communicate to any unauthorised person or allow any unauthorised person to have access to any such documents, information or records.  So Help Me God.Dated this day of  , 20 .Signature\f42\n\nSECOND SCHEDULE\n\nContents of Report of Agency\n\n(Section 32(2))\n\n1.\n\nThe information referred to in section 32\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nis a general description of the matters referred to the Agency;\n\nis  subject  to  section  32(2),  a  general  description  of  the  matters\ninvestigated by the Agency;\n\ncontains the following details with respect to matters investigated by\nthe Agency;\n\n(i)\n\n(ii)\n\nthe  number  of  investigations  commenced  but  not  completed\nduring the financial year in question;\n\nthe average time taken to deal with complaints and the actual time\ntaken to investigate any matter in respect of which a report is made.\n\ncontains any recommendations for changes in the laws of Barbados, or\nfor administrative action that the Agency considers should be made as\na result of the exercise of its functions;\n\nstates the general nature and extent of any information submitted under\nthis Act by the Agency during the year to any other public body;\n\nincludes the number of matters investigated by the Agency which have\nresulted in prosecutions or disciplinary action in that year;\n\nlists a description of its activities during that year in relation to any of\nits functions;\n\nstates the number of convictions and acquittals, and where a charge is\nlaid, the time taken to dispose of each matter;\n\n(i)\n\ncontains such other information as the Agency thinks relevant.\n\n\f43\n\n2.\nNotwithstanding  paragraph  (1),  no  details  shall  be  provided  by  the\nAgency in relation to any matter under investigation by the Agency, or for which\ncriminal proceedings have been instituted.\n\n\f44\n\nTHIRD SCHEDULE\n\nConstitution and Procedure of Committee\n\n(Section 34(3))\n\nAppointment of members and tenure\n\nThe  Governor-General  shall  on  the  recommendation  of  the  Prime\n1.(1)\nMinister after consultation with the Leader of the Opposition appoint 7 persons\nto be members of the Committee.\n\nThe members of the Committee shall be appointed by instrument in writing\n\n(2)\nand shall comprise\n\n(a)\n\n(b)\n\n(c)\n\na retired Judge;\n\na retired officer of the Royal Barbados Police Force, not below the rank\nof Assistant Commissioner of Police;\n\na retired officer of the Barbados Defence Force, not below the rank of\nColonel; and\n\n(d)\n\na minister of religion\n\neach of whom shall hold office for a term of 5 years; and\n\n(e)\n\n3  other  members  recommended  by  the  Minister  responsible  for\nDefence  and  Security  selected  from  persons  with  expertise  in  the\nfollowing areas:\n\n(i)\n\nfinancial matters;\n\n(ii)\n\nanti-corruption matters; and\n\n(iii)\n\npublic procurement matters,\n\neach of whom shall hold office for a term of 3 years.\n\n(3)\n\nAll members of the Committee are eligible for reappointment.\n\n\f45\n\nAppointment of Chairman\n\n2.(1)\nmembers of the Committee.\n\nThe Governor-General shall appoint the Chairman from amongst the\n\nWhere the Chairman is absent or unable to act, the Governor-General may\n\n(2)\nappoint another member to act temporarily as Chairman.\n\nRemoval of Chairman and members of the Committee\n\n3.\nThe Chairman and other members of the Committee shall be removed\nfrom  office  by  the  Governor-General  upon  the  recommendation  of  the  Prime\nMinister after consultation with the Leader of the Opposition, if any of them is\nabsent from three consecutive meetings of the Committee\n\n(a)\n\nwithout the leave of\n\n(i)\n\nthe Governor-General, in the case of the Chairman; or\n\n(ii)\n\nthe Chairman, in the case of any other member, or\n\nwithout reasonable excuse; or\n\n(b)\n\nbecomes  incapable  of  satisfactorily  discharging  the  functions  of  his\noffice whatever the cause.\n\nResignation of members of the Committee\n\n4.\nA member may resign by giving written notice of resignation to the\nChairman,  and  in  the  case  of  the  Chairman,  by  giving  written  notice  of\nresignation to the Governor-General.\n\nVacancy\n\n5.(1)\n\nA vacancy in the membership of the Committee arises on\n\n(a)\n\n(b)\n\nthe death or resignation of a member; or\n\nthe removal from office of a member.\n\n\f46\n\n(2)\nWhere a vacancy is created pursuant to sub-paragraph (1) a person may be\nappointed in accordance with paragraph 1(1) to fill the vacancy and the person\nso appointed shall hold office only for the unexpired portion of the term of the\nformer member.\n\nGazetting of appointment etc.\n\n6.\nmember shall be published in the Official Gazette.\n\nThe  appointment,  resignation,  death  or  removal  from  office  of  a\n\nAppointment of secretary and staff\n\n7.(1)\n\nThe Committee shall appoint a secretary whose duties shall be\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nto receive complaints made pursuant to section 37 of the Act;\n\nto attend the meetings of the Committee;\n\nto record the proceedings of the Committee and keep the minutes of\nsuch meetings in proper form;\n\ngenerally  to  perform  such  duties  connected  with  the  work  of  the\nCommittee as the Committee may require.\n\nThe Committee may arrange for the use of the services of any officer or\n(2)\nfacilities of the Agency as it deems necessary for the performance of its functions.\n\nProcedure\n\n8.(1)\nThe Committee shall meet as often as it considers necessary for the\nproper conduct of the affairs of the Committee, but shall meet not less than once\nper month.\n\nThe  Chairman  or  any  other  person  appointed  to  act  temporarily  as\n\n(2)\nChairman shall preside at a sitting of the Committee.\n\n(3)\n\nA quorum of the Committee shall be three members.\n\n\f47\n\nDecisions of the Committee shall be by a majority of votes of the members\n(4)\nand the Chairman shall have an original vote and a casting vote in any case in\nwhich the voting is equal.\n\nThe Committee is not bound by rules of evidence and may inform itself in\n\n(5)\nany way it considers appropriate but shall observe the rules of natural justice.\n\n(6)\n\n(7)\n\nProper records of all proceedings of the Committee shall be kept.\n\nThe Committee shall regulate its procedure.\n\nProtection of members\n\nNo action, suit, prosecution or other proceedings shall be brought or\n9.\ninstituted personally against any member of the Committee in respect of an act\ndone bona fide in pursuance, or execution, or intended execution of the provisions\nof this Act.\n\nDisclosure of interest\n\n10.\nindirectly, in any matter brought before the Committee shall\n\nAny  member  of  the  Committee  who  has  any  interest,  directly  or\n\n(a)\n\n(b)\n\nas soon as possible after the relevant facts have come to his knowledge,\ndisclose the nature of his interest at a sitting of the Committee; and\n\nnot be present during the deliberations of the Committee on the matter\nor take part in the decision of the Committee with respect thereto.\n\nAuthentication of documents\n\n11.\nAll documents made by, and all decisions of the Committee, may be\nsigned  under  the  hand  of  the  Chairman  or  any  member  of  the  Committee\nauthorised to act in that behalf.\n\nRemuneration\n\n12.\nThere shall be paid from the funds of the Agency to the Chairman and\nother  members  of  the  Committee,  such  remuneration,  whether  by  way  of\n\n\f48\n\nhonorarium, salary or fees and such allowances as the Minister with responsibility\nfor the Public Service may determine.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2021.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2021.\n\nPresident\n\n"
}