{
  "bill_id": 54,
  "slug": "family-law-amendment-bill-2014",
  "title": "Family Law (Amendment) Bill, 2014",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/46c4c98d0fff31f1fdb777ece4ba7f2a.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2014-11-12",
  "first_reading": "2014-11-12",
  "second_reading": "2014-11-11",
  "gazette_date": "2014-11-24",
  "passed_date": "2014-11-26",
  "markdown": "2014-09-26\n\nOBJECTS AND REASONS\n\nThis Bill would repeal and replace the Family Law (Amendment) Act, 2013,\nAct 2013-9 and amend the Family Law Act, Cap. 214, on the recommendation\nof the Family Law Council, to make provision for the following:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nto enable the courts, when determining maintenance issues, to take into\naccount  relevant  internationally  accepted  principles  and  relevant\nfindings of published research;\n\nto authorise the courts to order the transfer or settlement of property\nfor the maintenance of a child;\n\nto provide that claims, other than claims relating to maintenance, in\nproceedings affecting the property of parties to a marriage or a union\nother than a marriage do not abate if one of those parties dies while the\nproceedings are pending;\n\nto  make  clear  that  rules  may  be  made  for  the  enforcement  of\nmaintenance payments, whether or not the payments in question are in\narrears;\n\nto empower the courts to delay the grant of a divorce until property\nmatters have been settled;\n\nto redefine the period during which the parties to a union other than a\nmarriage are required to have continuously co-habited; and\n\nto expand the enforcement jurisdiction of the courts to include power\nto order arrest and imprisonment in proper cases.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 2(1) of Cap. 214\n\nAmendment of section 12 of Cap. 214\n\nAmendment of section 39 of Cap. 214\n\nAmendment of section 42 of Cap. 214\n\nAmendment of section 54 of Cap. 214\n\nInsertion of new section 55A into Cap. 214\n\nAmendment of section 57 of Cap. 214\n\nAmendment of section 59 of Cap. 214\n\n10.\n\nAmendment of section 87 of Cap. 214\n\n11.\n\nAmendment of section 91 of Cap. 214\n\n12.\n\nInsertion of new section 91A in Cap. 214\n\n13.\n\nAmendment of S.I. 1982 No. 18\n\n14.\n\nRepeal of Act 2013-9\n\n\f3\n\nSCHEDULE\n\nCONSEQUENTIAL AMENDMENTS\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Family Law Act, Cap. 214.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Family Law (Amendment) Act, 2014.\n\n\f6\n\nAmendment of section 2(1) of Cap. 214\n\nSection 2(1) of the Family Law Act, Cap. 214, in this Act referred to\n2.\nas the principal Act, is amended in the definition of \"matrimonial cause\" by\ndeleting paragraph (e) and substituting the following paragraph:\n\n“(e)\n\nproceedings between the parties to a marriage with respect to\nthe  property  of  those  parties,  or  either  of  them,  being\nproceedings\n\n(i)\n\n(ii)\n\n(iii)\n\narising out of the marital relationship;\n\nin  relation  to  concurrent,  pending  or  completed\nproceedings for principal relief between those parties;\nor\n\nin  relation  to  the  dissolution  or  annulment  of  that\nmarriage or the legal separation of the parties to that\nmarriage,  being  a  dissolution,  annulment  or  legal\nseparation  effected  in  accordance  with  the  law  of\nanother jurisdiction, where the dissolution, annulment\nor legal separation of that jurisdiction is recognized as\nvalid in Barbados under this Act;”.\n\nAmendment of section 12 of Cap. 214\n\nSection  12  of  the  principal  Act  is  amended  in  subsection  (7)  by\n3.\ninserting immediately after the words \"that counselling\", appearing in that\nsubsection, the words \"or further counselling\".\n\nAmendment of section 39 of Cap. 214\n\n4.\n\nSection 39 of the principal Act is amended by\n\n(a)\n\nrenumbering that section as subsection (1) of section 39;\n\n\f7\n\n(b)\n\ndeleting the definition of “ “union other than marriage” or “union” ”\nfrom subsection (1) as so renumbered and substituting the following:\n\n“ “union other than a marriage” or “union” ” means the relationship that\n\nsubsists between a man and a woman who\n\n(a)\n\n(b)\n\nare not married to each other; and\n\nsubject  to  subsections  (2)  and  (3),  have  co-habited\ncontinuously for a period of 5 years or more, and have so co-\nhabited  within  the  period  of  12  months  immediately\npreceding the institution of the proceedings.”; and\n\n(c)\n\nadding the following subsections immediately after subsection (1) as\nso renumbered:\n\n“(2)\nNotwithstanding paragraph (b) of the definition of “ “union other\nthan  marriage”  or  “union”  ”,  where  parties  to  a  union  other  than\nmarriage or union have separated and had, prior to becoming separated,\nlived  separately  and  apart  on  one  occasion  only,  but  had  resumed\ncohabitation within the period of 6 months after the separation on that\none occasion, the time during which the parties had lived separately and\napart  on  that  one  occasion  shall  be  disregarded  for  the  purpose  of\nreckoning the continuous period of 5 years or more.\n\nUpon an application of any party to proceedings between parties\n(3)\nto a union other than marriage or a union, the court may extend the\nperiod of 12 months of such a union, mentioned in subsection (1), by\nsuch longer period as the court thinks fit where the court is satisfied that\na party to the proceedings or a child of the union will suffer hardship if\nthe extension is not granted.”.\n\n\f8\n\nAmendment of section 42 of Cap. 214\n\n5.\n\nSection 42 of the principal Act is amended by\n\n(a)\n\ndeleting subsection (1) and substituting the following subsection:\n\nA  decree  nisi  of  dissolution  of  marriage  does  not  become\n\n“(1)\nabsolute unless the court by order declares that it is satisfied\n\n(a)\n\nthat either\n\n(i)\n\n(ii)\n\nthere  are  no  children  of  the  marriage  who  have  not\nattained the age of 18 years; or\n\nthe only children of the marriage who have not attained\nthe age of 18 years are the children specified in the order\nand,  subject  to  subsection  (3),  proper  arrangements,\nincluding  counselling  by  a  psychologist  or  any  other\nspecialist  that  the  court  deems  necessary,  in  all  the\ncircumstances have been made for the welfare of those\nchildren; and\n\n(b)\n\nsubject  to  subsection  (3),  that  any  matter  raised  for\ndetermination by the court under section 56 or 57 has been\nfully disposed of.”; and\n\n(b)\n\nadding the following subsection immediately after subsection (2):\n\n“(3)\nThe  court  may  determine  in  any  particular  case  that  there  are\ncircumstances  by  reason  of  which  the  decree  nisi  should  become\nabsolute  notwithstanding\nthat\narrangements described in paragraph (a)(ii) of subsection (1) have been\nmade or that matters described in paragraph (b) of that subsection have\nbeen fully disposed of; and in such a case the provisions that relate to\nthose arrangements or matters shall not have effect.”.\n\nis  not  satisfied\n\nthe  court\n\nthat\n\n\f9\n\nAmendment of section 54 of Cap. 214\n\n6.\nafter subsection (3) the following subsection:\n\nSection 54 of the principal Act is amended by inserting immediately\n\n“(4)\nIn taking into account the needs of a child pursuant to section 53\nand the preceding provisions of this section, the court, to the extent to\nwhich it considers it appropriate in the circumstances of the case,\n\n(a)\n\nshall have regard to any relevant principles adopted in any\nconventions  or  other  international  instruments  to  which\nBarbados has adopted; and\n\n(b)\n\nmay  have  regard  to  any  relevant  findings  of  published\nresearch conducted by a recognised\n\n(i)\n\nacademic body or academic institution; or\n\n(ii)\n\nhealth institution\n\nin relation to the maintenance of children.”.\n\nInsertion of new section 55A into Cap. 214\n\n7.\nimmediately after section 55:\n\nThe  principal  Act  is  amended  by  inserting  the  following  section\n\n“Register of maintenance orders for spouses\n\n55A.(1)\nmaintenance that it grants to a party to a marriage or union.\n\nThe  court  shall  establish  a  register  to  record  orders  for\n\n\f10\n\nWhere the court makes an order for maintenance in respect of a\n\n(2)\nparty to a marriage or union, the court shall direct the\n\n(a)\n\nclerk of the court to\n\n(i)\n\n(ii)\n\n(iii)\n\nenter the order into the register;\n\ninclude in the register the names of the parties to the\nmarriage or the union;\n\nwhere  applicable,  register  the  collection  of  the\nmaintenance on behalf of the party entitled to receive\nthe maintenance; and\n\n(b)\n\nparty that is ordered by the court to pay the maintenance, to\nprovide his name and address to the clerk of the court for the\npurpose of satisfying the requirements of paragraph (a).\n\nWhere a party referred to in subsection (2) changes his name or\n(3)\naddress, that party shall provide the change of name or address to the\nclerk of the court as soon as possible thereafter and the clerk shall effect\nthat change in the register.\n\nWhere the party fails to comply with paragraph (b) of subsection\n(4)\n(2) or subsection (3), that person is guilty of an offence and liable on\nsummary conviction to a fine of $1000 or to imprisonment for 6 months\nor to both.\n\n(5)\n\nThe content of the register shall be confidential.\n\nNotwithstanding  subsection  (2),  a  party  referred  to  in  that\n(6)\nsubsection may express to the court that party’s unwillingness to have\nthe court collect the maintenance on the party’s behalf.\n\nSection 23 of the Maintenance Act, Cap. 216 applies in respect\n(7)\nof the receipt and enforcement of payments ordered by the court under\nthis section.”.\n\n\f11\n\nAmendment of section 57 of Cap. 214\n\n8.\n\nSection 57 of the principal Act is amended by\n\n(a)\n\ninserting immediately after subsection (1) the following subsections:\n\n“(1A)\nWhere, before proceedings with respect to the property of the\nparties  to  a  marriage  or  union  are  completed,  either  party  to  the\nproceedings dies, the proceedings may be continued by or against the\npersonal representative of the deceased party.\n\nWhere  before  proceedings  with  respect  to  the  property  of  the\n(1B)\nparties  to  a  marriage  or  union  are  completed  either  party  to  the\nproceedings dies and the court is of the opinion that\n\n(a)\n\nit would have made an order with respect to property if the\ndeceased party had not died; and\n\n(b)\n\nit is still appropriate to make an order with respect to property,\n\nthe court may make such order as it considers appropriate, with respect\nto any of the property of the parties to the marriage or the union.\n\nAn order made by the court under subsection (1) or (1B) may\n\n(1C)\nbe enforced on behalf of or against the estate of the deceased party.\n\nIn exercising its powers under this section, the court shall have\n(1D)\nregard to the interest of and shall make an appropriate order for the\nprotection of any purchaser in good faith or any other person interested\nin the property.”;\n\n(b)\n\ndeleting  paragraph  (b)  of  subsection  (3)  and  substituting  the\nfollowing:\n\n“(b)\n\nthe contribution made directly or indirectly by a party to the\nmarriage or the union, including any contribution made in the\n\n\f12\n\ncapacity of homemaker or parent, to the welfare of the family\nwhich constitutes\n\n(i)\n\nthe parties to the marriage or the union; and\n\n(ii)\n\nwhere  applicable,  any  child  of  that  marriage  or\nunion; ”;\n\n(c)\n\ninserting immediately after subsection (3) the following subsection:\n\n“(4)\n\nWhere\n\n(a)\n\nproceedings under this section commenced before the date of\ncommencement  of  subsections  (1A),  (1B),  (1C)  and  (1D);\nand\n\n(b)\n\neither party to the proceedings died and the proceedings had\nnot been completed before that party’s death,\n\nsubsections  (1A),  (1B),  (1C)  and  (1D)  shall  have  effect  with  such\nmodifications or adaptations as may be necessary in relation to those\nproceedings.”.\n\nAmendment of section 59 of Cap. 214\n\n9.\n\nSection 59 of the principal Act is amended by\n\n(a)\n\n(b)\n\nrenumbering that section as subsection (1);\n\ninserting  immediately  after  paragraph  (h)  of  subsection  (1)  as  so\nrenumbered, the following paragraph:\n\n“(ha)\n\n order that a specified transfer or settlement of property be\nmade by way of maintenance for a child;”; and\n\n(c)\n\nadding the following subsection as subsection (2):\n\n\f13\n\n“(2)\nThe making of an order under paragraph (ha) of subsection (1)\nor of any other order under this Part in relation to the maintenance of a\nchild  shall  not  prevent  a  court  from  making  a  subsequent  order  in\nrelation to the maintenance of that child.”.\n\nAmendment of section 87 of Cap. 214\n\n10.\nand substituting the following paragraph:\n\nSection 87 of the principal Act is amended by deleting paragraph (c)\n\n“(c)\n\nthe enforcement of the payment of maintenance, whether or\nnot in arrears, by the attachment of earnings or otherwise;”.\n\nAmendment of section 91 of Cap. 214\n\n11.\n(4) and (5) and substituting the following subsections:\n\nSection 91 of the principal Act is amended by deleting subsections\n\n“(4)\nA  person  who  knowingly  and  without  reasonable  cause\ncontravenes or fails to comply with an injunction or order under this\nsection is liable\n\n(a)\n\n(b)\n\non  conviction  on  indictment,  to  a  fine  of  $20  000  or  to\nimprisonment for 5 years or to both; or\n\non  summary  conviction,  to  a  fine  of  $10  000  or  to\nimprisonment for 12 months or to both.\n\nWhere a person is convicted of an offence under subsection (4),\n(5)\nthe  court  may,  in  addition  to  or  instead  of  imposing  a  sentence\nmentioned in that subsection, exercise any of the following powers in\nrelation to the convicted person:\n\n(a)\n\nrequire him to enter a recognizance, with or without sureties,\nin such reasonable amount as the court thinks fit, that he will\n\n\f14\n\ncomply  with  the  injunction  or  order,  or  order  him  to  be\nimprisoned until he enters into such a recognizance or until\nthe expiration of 3 months, whichever first occurs;\n\norder him to deliver up to the court such documents as the\ncourt thinks fit;\n\nmake such orders as the court considers necessary to enforce\ncompliance with the injunction or order.\n\n(b)\n\n(c)\n\nThe powers conferred by subsections (4) and (5) are in addition\n\n(6)\nto the power of the court to punish for contempt of court.”.\n\nInsertion of new section 91A in Cap. 214\n\n12.\nimmediately after section 91:\n\nThe  principal  Act  is  amended  by  inserting  the  following  section\n\n“Power of arrest\n\n91A.(1)\nSubject  to  section  91,  where  the  court  makes  an  order  or\ngrants an injunction for the personal protection of a party to a marriage\nor union or for the personal protection of a child of the marriage or\nunion, the court, as it thinks proper, may attach a power of arrest to the\norder or the injunction.\n\n(2)\nNotwithstanding  subsection  (1),  no  power  of  arrest  shall  be\nattached to an order or an injunction for personal protection unless the\nperson against whom the order is made is given notice that such a power\nshall be attached to the order or injunction.\n\nWhere a power of arrest is attached to an order or an injunction,\n(3)\na member of the Police Force may arrest, without a warrant, a person\nwho he has reasonable cause for suspecting of being in breach of the\norder or injunction for personal protection.\n\n\f15\n\nWhere  a  member  of  the  Police  Force  arrests  a  person,  in\n\n(4)\naccordance with subsection (3), the person shall\n\n(a)\n\nbe  brought  before  the  court  within  the  period  of  24  hours\nbeginning  at  the  time  of  his  arrest,  or,  as  soon  as  it  is\nreasonable  and  practicable  thereafter,  and  dealt  with  in\naccordance with the law;\n\n(b)\n\nnot be released within that period except on the direction of\nthe court.\n\nNotwithstanding\n\nin  subsection  (4)\n(5)\nauthorizes the detention of the person referred to in that subsection at\nany time after the expiry of the period stated in subsection (4).”.\n\nthis  section,  nothing\n\nAmendment of S.I. 1982 No. 18\n\n13.\nmanner specified in the Schedule.\n\nThe Family Law Rules, 1982 (S.I. 1982 No. 18)  are amended in the\n\nRepeal of Act 2013-9\n\n14.\n\nThe Family Law (Amendment) Act, 2013 (Act 2013-9) is repealed.\n\n\f16\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosSCHEDULE(Section 13)CONSEQUENTIAL  AMENDMENTSAmendments to the Family Law Rules, 1982, (S.I. 1982 No. 18)Rulerule 101:Amendments  (a) replace the full-stop at the end of sub-rule (5) with a semi-colon and add the following paragraph:\"(d) proceedings under the Debtors Act, Cap. 198.\";(b) insert the following sub-rules immediately after sub-rule (10): \"(11) Where a court that(a) is not a court of summary jurisdiction; and(b) has jurisdiction to make an order referred to in paragraph (a) of sub-rule (1)makes such an order, it may directthat the order shall be enforced bya court of summary jurisdictionspeciﬁ ed in the direction. (12) Where a direction is given in accordance with sub-rule (11), the court of summary jurisdiction\f17\n\n Schedule (Concl'd)CONSEQUENTIAL  AMENDMENTS - (Concl'd)Amendments to the Family Law Rules, 1982,(S.I. 1982 No. 18) - (Concl'd)Rulerule 101 (Concl'd):after rule 104:Amendments  so specified in the direction shall have full power to enforce theorder under these Rules as if the order had been made by that courtof summary jurisdiction.\";insert the following rule:\"Alternative procedure for seizurein certain cases. 104A. Notwithstanding rule 104 and rule 2.2 of Part 2 of the Supreme Court Rules, 2008 (S.I. 2008 No. 66) a personor authority entitled under rule 101to enforce a decree of a court underthese Rules may exercise the rightsconferred by Parts 46 and 54 ofthe Rules of the Supreme Court, 2008on persons entitled to relief underthose Parts; and those Parts shallapply accordingly, with suchmodifications or adaptations, as may be necessary, in relation to the ﬁ rst-mentioned person or authority.\".\f18\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2014.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2014.\n\nPresident\n\n"
}