{
  "bill_id": 552,
  "slug": "resolution-re-lease-of-2-parcels-of-land-at-the-pine-st-michael-to-tab-building",
  "title": "Resolution re Lease of 2 parcels  of land at the Pine, St Michael  to TAB Building",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/00183dd1df51f9783ccebae1c80e931c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-05-26",
  "first_reading": "2021-06-25",
  "gazette_date": null,
  "markdown": "                                                                                                                                2021-02-17\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the  Crown  Lands\n\n(Vesting and Disposal) Act, Cap. 225 approve the lease of the two parcels of land the property of the\n\nCrown situate at the Pine in the parish of Saint Michael in this Island and more particularly described\n\nin the First Schedule on the terms and conditions set out in the Second Schedule for use as a car park.\n\nAPPROVED by the House of Assembly this            day of                               , Two\n\nthousand and twenty-one.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                          , Two\n\nthousand and twenty-one.\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nFIRSTLY ALL  THAT  land  the  property  of  the  Crown  situate  at  the  Pine  in  the\n\nparish  of  Saint  Michael  in  this  Island  containing  by  admeasurement  1  901.3  square  metres  or\n\nthereabouts  abutting  and  bounding  on  lands  now  or  formerly  of  the  Barbados  Government\n\non  lands  now  or  late  of  Ethel  Pilgrim  on  lands  now  or  late  of  Violet  Best  on  lands  now  or\n\nformerly of TAB Building Limited on lands now or late of Oscar Chandler and on a road known\n\nas  South  Bend  Road  or  however  else  the  same  may  abut  and  bound  as  shown  and  delineated\n\non  a  plan  certiﬁ ed  on  the  25th  day  of April,  2016  by  Kevin  R.  Belgrave,  Land  Surveyor  and\n\nrecorded in the Lands and Surveys Department on the 4th day of May, 2016 as Plan No. 429/2016.\n\nSECONDLY ALL  THAT  land  the  property  of  the  Crown  situate  at  the  Pine\n\nin  the  parish  of  Saint  Michael  in  this  Island  containing  by  admeasurement\n\n2  014.8  square  metres  or  thereabouts  abutting  and  bounding  on  lands  now  or  formerly  of  the\n\nBarbados Government on lands now or formerly of Corbins Garage Limited on lands now or late\n\nof Rodney Clarke on lands now or late of Garnet Clarke and on other lands now or formerly of the\n\nBarbados Government or however else the same may abut and bound as shown and delineated on\n\na plan certiﬁ ed on the 10th day of April, 2008 by Robert S. Warren, Land Surveyor and recorded\n\nin the Lands and Surveys Department on the 7th day of September, 2009 as Plan No. 1118/2009.\n\n\f3\n\nSECOND SCHEDULE\n\nTERMS AND CONDITIONS\n\nThe  lease  to  TAB  Building  Ltd.  of  the  two  parcels  of  land,  the  property  of  the  Crown,\n\nsituate at the Pine in the parish of Saint Michael in this Island and more particularly described\n\nin the First Schedule is subject to the following terms and conditions:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nThe  lease  shall  be  for  a  period  of  ten  (10)  years  with  an  option  to  renew  for  a\nfurther  period of ten (10) years;\n\nThe lessee shall pay rent at an initial rate of $29 141.80 per annum;\n\nThe lessor shall review the rent every three (3) years;\n\nThe  lessee  shall  bear  and  discharge  all  existing  and  future  rates  and\ntaxes  and  assessments  whatsoever  imposed  upon  the  lands  including  the\npayment of land taxes, insurance premiums and other outgoings arising out of the\nuse of the lands;\n\nThe  lessee  shall  bear  the  cost  of  developing  the  lands  as  a  car  park  and  at  all\ntimes during the continuance of the term hereby granted, comply with any planning\nrequirements  under  any  enactment  relating  to  any  matter  or  things  affecting\nthe lands and indemnify the lessor against all actions and proceedings, damages\npenalties,  costs,  charges,  claims  and  demands  in  respect  of  a  breach  of  such\nrequirements;\n\nThe lessee shall not use and occupy the lands or permit the same to be used or\noccupied otherwise than as a car park;\n\nThe lessee shall maintain and keep the lands in a clean and tidy condition, including\nthe buffer area which shall be kept appropriately landscaped and which shall not\nbe used for the parking of cars;\n\nThe lessee shall not assign or underlet or part with possession of the lands or any\npart thereof without the prior written consent of the lessor;\n\n\f4\n\nSECOND SCHEDULE (Concl'd)\n\n (i)\n\n (j)\n\n(k)\n\n(l)\n\nThe lessee shall not do or suffer on the lands or any part thereof, any act, matter\nor  thing  whatsoever  which  may  be  or  tend  to  annoyance,  nuisance,  damage  or\ndisturbance of the occupiers of any adjoining or neighbouring property;\n\nThe lessee shall  indemnify and keep harmless the lessor and its duly authorized\nagents and each and any of them from all loss, damage, claims, suits and demands\nwhatsoever from all persons whomsoever which may be in any wise sustained or\nbe made for or by reason of or in consequence of the use of the lands for matters\nor  things  authorised  by  the  lease  or  in  consequence  of  any  act  or  omission  of\nthe lessee or its agents in reference to the lease or any other loss or damage or\nliability in respect of or arising out of the use of the lands for the purposes stated\nherein;\n\nThe lessee shall permit the lessor and its authorized agent, after giving the lessee\nforty-eight  hours’  notice,  to  enter  upon  the  lands  and  inspect  and  view  the\ncondition thereof;\n\nThe lessee at the expiration or sooner determination of the said lease hereby granted\nshall quietly yield up the lands for nil consideration.\n\n\f5\n\nADDENDUM\n\nThe  Cabinet  at  its  meeting  held  on  the  12 th  day  of  September,  2019\n\nconsidered  Note  (19)  1184/MHLR  56  and  agreed  to  the  lease  of  two  parcels  of  Crown  land\n\ncontaining  by  admeasurement  1  901.3  square  metres  and  2  014.8  square  metres  respectively,\n\nsituate at the Pine in the parish of Saint Michael in this Island to TAB Building Ltd. for use as a\n\ncar park under the terms and conditions set out in the Second Schedule.\n\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and\n\nDisposal)  Act,  Cap.  225  the  approval  of  Parliament  is  now  sought  for  the  lease  to  TAB\n\nBuilding Ltd.  of the lands described in the First Schedule on the terms and conditions set out in\n\nthe Second Schedule.\n\n"
}