{
  "bill_id": 553,
  "slug": "temporary-right-to-severance-payment-for-layoff-or-short-time-procedure-for-settlement-of-claims",
  "title": "Temporary Right to Severance  Payment for Lay-Off or Short Time (Procedure for Settlement of Claims)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/f6e8aa34ea69125819b20cf8116ffd08.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-05-12",
  "first_reading": "2021-05-17",
  "gazette_date": "2021-05-19",
  "markdown": "2021-05-11\n\nOBJECTS AND REASONS\n\nThis Bill would provide the procedure for investigating and settling claims\nmade pursuant to the provisions of the Severance Payments (Amendment) Act,\n2020  (Act  2020-15)  which  was  enacted  in  consequence  of  the  public  health\nemergency declared by the Proclamation given by the Governor General on the\n28th day of March, 2020.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nProcedure for settlement\n\nValidation of claims\n\nCorrection of error in Severance Payments (Amendment) Act, 2020 (Act\n2020-15)\n\n1.\n\n2.\n\n3.\n\n4.\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide the procedure for investigating and settling claims made\npursuant  to  the  provisions  of  the  Severance  Payments  (Amendment)  Act,\n2020 (Act 2020-15) which was enacted in consequence of the public health\nemergency declared by the Proclamation given by the Governor General on\nthe 28th day of March, 2020.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nfor Lay-Off or Short Time (Procedure for Settlement of Claims) Act, 2021.\n\nThis Act may be cited as the Temporary Right to Severance Payment\n\nProcedure for settlement\n\nThe Minister may by order prescribe the procedure for investigating\n2.(1)\nand settling claims for the purpose of giving effect to the rights of employees to\nwhom section 6A of the Severance Payments Act, Cap. 355A, inserted by the\nSeverance Payments (Amendment) Act, 2020 (Act 2020-15), applied.\n\nAn order under subsection (1) shall be made on or before the 31st day of\n\n(2)\nMay, 2021.\n\nValidation of claims\n\nAny claim referred to in section 2(1), whether made before or after\n3.\nthe  commencement  of  this  Act,  and  any  question  as  to  the  right  of  such  an\nemployee to a severance payment and to the amount of such a payment referred\nto and determined by a tribunal pursuant to section 38 of the Severance Payments\nAct,  Cap.  355A  shall  be  deemed  to  have  been  lawfully  and  validly  referred,\ndetermined and paid.\n\nCorrection of error in Severance Payments (Amendment) Act, 2020\n(Act 2020-15)\n\nIn  subsections  (1),  (4),  (7)  and  (8)  of  section  6A  of  the  Severance\n4.\nPayments Act, Cap. 355A the words “section 7A” shall be substituted for the\nwords “section 7”.\n\n\f5\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2021.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2021.\n\nPresident\n\n"
}