{
  "bill_id": 555,
  "slug": "grantley-adams-international-airport-transfer-of-management-and-vesting-of-assetsamendmentbill-2021",
  "title": "Grantley Adams International Airport (Transfer of Management and Vesting of Assets)(Amendment)Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/8b9421c4c004d4e28b166df2881adaaa.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-06-09",
  "first_reading": "2021-07-21",
  "gazette_date": "2021-05-31",
  "markdown": "2021-02-17\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Grantley Adams International Airport (Transfer of\nManagement and Vesting of Assets)Act, Cap. 286 to provide for the Grantley\nAdams International Airport Inc. to contract with licensed operators in relation\nto  the  management  and  maintenance  of  the  airport  and  to  provide  for  related\nmatters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment to section 2 of Cap. 286\n\nAmendment of section 8 of Cap. 286\n\nInsertion of sections 8A and 8B into Cap. 286\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Grantley Adams International Airport (Transfer of\nManagement and Vesting of Assets) Act, Cap. 286 to provide for the Grantley\nAdams International Airport Inc. to contract with licensed operators in relation\nto the management and maintenance of the airport and to provide for related\nmatters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Transfer of Management and Vesting of Assets)(Amendment) Act, 2021.\n\nThis Act may be cited as the Grantley Adams International Airport\n\nAmendment to section 2 of Cap. 286\n\nSection 2 of the Grantley Adams International Airport (Transfer of\n2.\nManagement and Vesting of Assets) Act, Cap. 286, in this Act referred to as\nthe  principal  Act,  is  amended  by  inserting  in  their  appropriate  alphabetical\norder the following new definitions:\n\n“ “licensed operator” means a person who is an aerodrome operator\nwho  holds  an  aerodrome  certificate  or  temporary  aerodrome\ncertificate  under  the  Civil  Aviation  (Aerodrome  Certificate)\nRegulations, 2016 (S.I. 2016 No. 50);\n\n“transferred  operations”  means  the  transfer  of  any  part  of  the\nmanagement, maintenance or operations of the airport, or any part\nof  the  provision  of  aeronautical  and  related  non-aeronautical\nancillary services;”.\n\nAmendment of section 8 of Cap. 286\n\n3.\nthe following:\n\nThe principal Act is amended by deleting section 8 and substituting\n\n“Business plan\n\n8.\nThe Company shall, no later than 6 months after the end of\neach financial year, submit to the Minister a business plan in respect of\nthe ensuing financial year and for each of the subsequent 4 financial\nyears.”.\n\n\f5\n\nInsertion of sections 8A and 8B into Cap. 286\n\n4.\n8 the following new sections:\n\nThe principal Act is amended by inserting immediately after section\n\n“Transfer to licensed operator\n\n8A.(1)\nThe  Company  may,  with  the  written  approval  of  the\nMinister,  enter  into  an  agreement  for  the  transfer,  lease,  sub-lease,\nassignment or licence, or the grant of any other interest or right whether\nin whole or part of the property, assets or rights of the Company to a\nlicensed operator in order to transfer the operations.\n\n(2)\n\nWhere the Minister is satisfied that the licensed operator is able\n\n(a)\n\nto discharge all of its obligations under the agreement entered\ninto with the Company; and\n\n(b)\n\nto undertake the transferred operations,\n\nthe  Minister  may  by  order  give  permission  for  the  transfer  of  the\noperations.\n\nWhere  the  agreement  between  the  Company  and  the  licensed\n\n(3)\noperator provides that on termination\n\n(a)\n\n(b)\n\nthere is a right of reversion of the transferred operations to\nthe Company; or\n\nthere is a termination of the rights of the licensed operator to\ncarry  on  the  transferred  operations  and  the  right  of  the\nCompany to step-in and continue the transferred operations\n\nany transfer, lease, sub-lease, assignment, licence or any other grant of\ninterests or rights in the whole or any part of the property or any assets\nor rights of the Company to a licensed operator shall be void and the\nright or interest referred to in subsection (1) shall revert to the Company.\n\n\f6\n\nNo transfer of an interest or right referred to in subsection (1)\n\n(4)\nshall\n\n(a)\n\noperate  as  a  breach  of  covenant  or  condition  against\nalienation;\n\n(b)\n\ngive rise to forfeiture; or\n\n(c)\n\ninvalidate or discharge a contract or security.\n\n(5)\n\nSubject to subsection (1), where the operations are transferred\n\n(a)\n\nevery contract to which the Company is a party shall, from\nthe date of the transfer, be construed as if\n\n(i)\n\n(ii)\n\n(iii)\n\nthe licensed operator had been a party thereto instead\nof the Company;\n\nfor  a  reference  to  the  Company,  there  had  been\nsubstituted, in respect of anything falling to be done on\nor  after  the  date  of  the  transfer,  a  reference  to  the\nlicensed operator; and\n\nfor a reference to any director, officer, servant or agent\nof the Company, there had been substituted in respect\nof anything falling to be done on or after the date of the\ntransfer,  a  reference  to  the  directors  of  the  licensed\noperator or, as the case may be, to such director, officer,\nservant or agent of the licensed operator as the licensed\noperator may appoint, or, in default of appointment, to\nthe  director,  officer,  clerk  or  servant  of  the  licensed\noperator  corresponding,  as  nearly  as  may  be,  to  any\ndirector, officer, servant or agent of the Company; and\n\n(b)\n\nany debts or other claims between the Company and a third\nparty  shall  be  construed  as  debts  or  other  claims  of  the\nlicensed operator;\n\n\f7\n\n(c)\n\nany negotiable instrument or order for payment of money that\nis expressed to be\n\n(i)\n\ndrawn on;\n\n(ii)\n\ngiven to;\n\n(iii)\n\naccepted; or\n\n(iv)\n\nendorsed by\n\nthe  Company,  shall  have  effect  as  if  the  action  taken  in\nsubparagraphs  (i)  to  (iv)  had  been  taken  by  the  licensed\noperator;\n\n(d)\n\n(e)\n\nany  security  transferred  to  the  licensed  operator  that\nimmediately before the date of the transfer was held by the\nCompany  as  security  for  the  payment  or  discharge  of  any\ndebt, liability or obligation, whether present or future, actual\nor contingent, shall be held by and shall be available to the\nlicensed operator as security for the payment or discharge of\nsuch debt, liability or obligation;\n\nany  security  transferred  to  the  licensed  operator  that\nimmediately before the date of the transfer was held by the\nCompany  as  security  for  the  payment  or  discharge  of  any\ndebt, liability or obligation, whether present or future, actual\nor contingent, that extends to future advances or liabilities\nshall, from the date of the transfer, be held by and shall be\navailable  to  the  licensed  operator  as  security  for  future\nadvances by, and future liabilities to the licensed operator in\nthe same manner and in all respects as future advances by or\nliabilities  to  the  Company  secured  thereby  immediately\nbefore the date of the transfer;\n\n(f)\n\nany judgment or award obtained by, or against, the Company\nand not fully satisfied before the date of the transfer shall be\nenforceable by or against the licensed operator; and\n\n\f8\n\n(g)\n\nunless an agreement by the parties to the transfer provides to\nthe  contrary,  any  officer,  or  person  employed  by  the\nCompany immediately before the date of the transfer, shall\nbe an officer or employee, as the case may be, of the licensed\noperator  on  terms  and  conditions  no  less  favourable  than\nthose on which he was so employed immediately before the\ndate of the transfer, and such employment with the Company\nand licensed operator respectively shall be deemed, for all\npurposes, to be a single continuous period of employment,\nbut no director, secretary or auditor of the Company shall by\nvirtue  only  of  a  vesting  order  be  a  director,  secretary  or\nauditor, as the case may be, of the licensed operator.\n\n(6)\n\nParagraphs (a)(ii) and (iii) of subsection (5) apply to\n\n(a)\n\n(b)\n\nany statutory provision;\n\nany provision of any contract to which the Company was not\na party; and\n\n(c)\n\nany provision of any other document, not being a contract,\n\nas  they  apply  in  relation  to  a  contract  to  which  paragraph  (a)  of\nsubsection (5) applies.\n\nAny property or rights transferred to the licensed operator that\n(7)\nimmediately before the date of the transfer were held by the Company,\nwhether severally or jointly, with any other person\n\n(a)\n\nas trustee or custodian trustee of any trust, deed, settlement,\ncovenant, agreement, whether originally appointed or not, or\nwhether appointed under hand or seal by order of a court; or\n\n(b)\n\nin any other representative or fiduciary capacity,\n\nshall, from the date of the transfer, be held by the licensed operator,\nwhether severally or jointly, with that other person, in the same capacity\n\n\f9\n\nupon the trust and with, and subject to, the powers, provisions, liabilities\nand obligations, applicable thereto, as the case may be.\n\nExemption from duties and taxes\n\n8B.(1)\n\nThe Company shall be exempt from\n\n(a)\n\nthe  payment  of  property  transfer  tax  under  the  Property\nTransfer Tax Act, Cap. 84A; and\n\n(b)\n\nthe payment of stamp duty under the Stamp Duty Act, Cap. 91\n\npayable  on  the  execution  of  any  instrument  executed  to  transfer  the\ntransferred operations from the Company to the licensed operator.\n\n(2)\n\nA licensed operator shall be exempt from\n\n(a)\n\nthe  payment  of  property  transfer  tax  under  the  Property\nTransfer Tax Act, Cap. 84A; and\n\n(b)\n\nthe payment of stamp duty under the Stamp Duty Act, Cap. 91\n\npayable  on  the  execution  of  any  instrument  executed  to  transfer  the\ntransferred operations from the licensed operator to the Company.”.\n\n\f10\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2021.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2021.\n\nPresident\n\n"
}