{
  "bill_id": 556,
  "slug": "resolution-re-vesting-in-nhc-land-at-white-park-road-for-housing-development",
  "title": "Resolution re vesting in NHC land  at White park Road for housing development",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/7b4c6e2ac4a2bf79376ebc12a386f833.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-06-23",
  "first_reading": "2021-06-25",
  "gazette_date": null,
  "markdown": "PARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 approve the vesting in the National Housing Corporation of the parcel of land situate at Whitepark Road in the parish of Saint Michael in this Island and more particularly described in the Schedule for housing development.\nAPPROVED by the House of Assembly this\nday of\n, Two\nthousand and twenty-one.\nSpeaker\nAPPROVED by the Senate this\nday of\n» Two\nthousand and twenty-one.\nPresident\nSCHEDULE\nALL THAT land the property of the Crown situate at Whitepark Road in the parish of Saint Michael in this Island containing by admeasurement 3380,1 square metres or thereabouts abutting and bounding on lands now or late of Cynthia Alleyne, on lands now or formerly of Western Starr Lodge, on lands now or formerly of Booze Brothers Inc. on a public road known as Whitepark Road which leads to Bank Hall in one direction and to Bridgetown in the other direction and on another public road known as Kings Village Alley or however else the same may abut and bound as shown and delineated on a plan certified on the 18\" day of May, 2012 by Andre P. G. Clarke, Land Surveyor and recorded on the 1\" day of June, 2012 in the Lands and Surveys Department as Plan No. 540/2012.\nADDENDUM\nOn the 7\" day of July, 2014, in accordance with section 5 of the Land Acquisition Act, Cap. 228, notice was given by means of Statutory Instrument No. 43 of 2014, of the acquisition by the Crown of the land described in the Schedule.\nOn the 17\" day of December, 2020 the Cabinet agreed to the vesting of the land in the National Housing Corporation for the public purpose of housing development.\nThe approval of Parliament is now sought, in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, for the vesting of the land in the National Housing Corporation for the public purpose of housing development.\nLANDS AND SURVEYS DEPARTMENT\n.. Survey Order No: 19/2012\nParish of: St. Michael\nCorrespondence No: 0301/894 Vol\n|\nLocality: Whitepark Rood\n(€ 23954.89 m \\k 66818.57 m| Booze Brothers Inc. Western / GRID NORTH Storr =) = 1 «8 pub Lee a I's Ot BY -3 ee 1m “ 12 ae, [3 & 2 (Kings Villoge Alley) eS 2----= > To Bank Hail (Whitepark Road) Road Public To Bridgetown SCALE 1:500\nCynthia\nAlleyne\nPLAN OF LAND\nat\nBordered Grean\nWhitepark Road, St. Michael\nDistances are in metres Bearing are referred to Grid North Derived from DLS control T2480 and 72481\ncontaining\n3380.1 Sq. m\n© Denotes Iron Found\n+) Denotes Iron Put\nSurveyed for\nMinistry of Housing and Lands\né\nDenotes X Found\nCertified\n18th May 2012\nLond Tax # 80/01/07/005\n\nAndre P.G. Clarke Land Surveyor\nFor Lands and Survays Dept. Only iy bed “S 2HS\n"
}