{
  "bill_id": 558,
  "slug": "control-of-inefficient-lighting-bill-2021",
  "title": "Control of Inefficient Lighting  Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/1995512a806aeefe2a7fbe39cb051e4a.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-06-30",
  "first_reading": "2021-07-21",
  "gazette_date": "2021-06-24",
  "markdown": "2021-05-16\n\nOBJECTS AND REASONS\n\nThis  Bill  would  provide  for  the  phased  elimination  of  the  use  and  sale  of\n\ninefficient electrical lamps in Barbados.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\nPART II\n\nADMINISTRATION\n\nShort title\n\nInterpretation\n\nStandards and procedures\n\nInspectors\n\nTesting of samples\n\nImported lamps with certificate of compliance\n\nRequest for electrical lamps\n\nSeizures and warrants\n\nPART III\n\nELECTRICAL LAMPS\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nInvoices, labels and packages\n\n\f3\n\n10.\n\nManufacture of electrical lamps\n\n11.\n\nDefences\n\nPART IV\n\nRESTRICTIONS AND LICENCES\n\n12.\n\nProhibition\n\n13.\n\nExemptions\n\n14.\n\nExempted electrical lamp importation licence\n\n15.\n\nDistribution licence\n\n16.\n\nRecord of licences\n\n17.\n\nProduction of licence\n\n18.\n\nImmunity\n\n19.\n\nSchedules\n\n20.\n\nRegulations\n\nPART V\n\nMISCELLANEOUS\n\n\f4\n\nFIRST SCHEDULE\n\nAPPLIANCES\n\nSECOND SCHEDULE\n\nLICENCE FEES\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the phased elimination of the use and sale of inefficient\n\nelectrical lamps in Barbados.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n2021.\n\nThis  Act  may  be  cited  as  the  Control  of  Inefficient  Lighting  Act,\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“appliance” means an item listed in the First Schedule;\n\n“Barbados  National  Standards  Institution”    has  the  meaning  assigned  to  it  by\n\nsection 2 of the Standards Act, Cap. 326A;\n\n“compliance certificate” means a certificate which a recognized authority issues\nthat verifies that an electrical lamp meets standards which the recognized\nauthority approves in respect of the electrical lamp;\n\n“Director”  means the person who holds the post of Director of Commerce and\nConsumer  Affairs  which  is  established  by  the  Public  Service  (General)\nOrder, 2020 (S.I. 2020 No. 41);\n\n“domestic minimum energy performance standard” means a standard established\nby  the  Barbados  National  Standards  Institution  which  specifies  the\nminimum efficiency performance level for an electrical lamp which is for\n\n(a)\n\n(b)\n\ndistribution, sale or use in Barbados; or\n\nimportation into Barbados;\n\n“electrical lamp” includes a halogen lamp, compact fluorescent lamp, mercury\n\nvapour lamp, sodium vapour lamp and LED lamp;\n\n\f7\n\n“exempted electrical lamp” means an electrical lamp which does not meet the\ndomestic minimum energy performance standard and is operated or used in\nan appliance;\n\n“LED” means light emitting diode;\n\n“minimum energy performance standard” means a standard which specifies the\nminimum  efficiency  performance  level  of  an  electrical  lamp  which\neffectively limits the maximum amount of energy that may be consumed by\nan electrical lamp in performing a specific task;\n\n“recognized  authority”  means  an  agency,  an  entity  or  a  laboratory  which  the\nBarbados National Standards Institution approves as an accredited authority\nin respect of its testing, determination or approval of energy performance\nstandards of electrical lamps;\n\n“trading  standards  inspector”  has  the  meaning  assigned  to  it  by  section  2  of\n\nthe Standards Act, Cap. 326A.\n\nPART II\n\nADMINISTRATION\n\nStandards and procedures\n\n3.(1)\nof the Minister,\n\nThe Barbados National Standards Institution shall, with the approval\n\n(a)\n\n(b)\n\n(c)\n\nestablish  domestic  minimum  energy  performance  standards  for\nimported electrical lamps and electrical lamps for local distribution,\nsale or use;\n\nestablish  energy  efficient  labelling  standards  for  packages  which\ncontain electrical lamps or for labels of electrical lamps; and\n\napprove and establish energy performance test procedures for electrical\nlamps.\n\n\f8\n\n(2)\nWhere the Barbados National Standards Institution establishes a domestic\nminimum energy performance standard or an energy efficient labelling standard\nin accordance with subsection (1), the Barbados National Standards Institution\nshall  cause  to  be  published  in  the  Official  Gazette  and  in  a  daily  newspaper\npublished in Barbados a notice of the standard.\n\nA domestic minimum energy performance standard or an energy efficient\n(3)\nlabelling standard may, with the approval of the Minister, be amended or revoked\nby the Barbados National Standards Institution and a notice to that effect shall\nbe published in the manner specified in subsection (2).\n\nInspectors\n\nA  trading  standards  inspector  shall  investigate  any  complaint  or\n4.(1)\nconduct concerning any allegation of contravention of this Act or regulations\nmade pursuant to this Act.\n\nA trading standards inspector shall, at a reasonable time, enter premises\n(2)\nwhich the trading standards inspector reasonably believes to have electrical lamps\nwhich are for sale or distribution to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nopen and examine any package or receptacle which is found on the\npremises  which  the  trading  standards  inspector  reasonably  believes\ncontains electrical lamps;\n\ninspect  or  examine  any  electrical  lamps  which  are  found  on  the\npremises and take samples, free of any charge;\n\nexamine labels on packages containing electrical lamps or labels of\nelectrical lamps which are found on the premises;\n\nconduct tests on any electrical lamps which are found on the premises\nto determine or verify the energy performance characteristics of the\nelectrical lamps; or\n\nexamine  records  and  documents  which  relate  to  the  acquisition,\nimportation, exportation, manufacture, sale or distribution of electrical\nlamps.\n\n\f9\n\n(3)\nSubject to subsection (2) and section 8, a trading standards inspector shall,\nupon entering premises, produce his certificate of appointment which verifies\nthat he is a trading standards inspector.\n\n(4)\n\nAny person who\n\n(a)\n\nwilfully  obstructs,  hinders,  assaults  or  otherwise  interferes  with  a\ntrading standards inspector engaged in the performance of any duty or\nexercise of any power conferred on him under this Act or regulations\nmade pursuant to this Act; or\n\n(b)\n\nknowingly gives false information to a trading standards inspector,\n\nis guilty of an offence and is liable on summary conviction to a fine of $100 000\nor to imprisonment for a term of one year or to both.\n\nTesting of samples\n\nWhere  a  trading  standards  inspector  obtains  samples  of  electrical\n5.\nlamps pursuant to paragraph (b) of section 4(2), the Barbados National Standards\nInstitution  shall cause tests to be conducted or shall submit the electrical lamps\nto a recognized authority for tests to be conducted to\n\n(a)\n\n(b)\n\ndetermine the energy performance characteristics; or\n\nverify the energy performance standards,\n\nof the electrical lamps within 21 days of obtaining the samples or within any such\nlonger period as the Minister determines.\n\nImported lamps with certificate of compliance\n\n6.\nWhere a person imports an electrical lamp which has a compliance\ncertificate, the electrical lamp shall be tested in accordance with the provisions\nof  this  Act  or  regulations  made  pursuant  to  this  Act,  notwithstanding  the\ncompliance certificate.\n\n\f10\n\nRequest for electrical lamps\n\n7.(1)\nperson who\n\nNotwithstanding  section  4,  the  Director  may,  in  writing,  request  a\n\n(a)\n\n(b)\n\n(c)\n\nimports;\n\nsells or offers for sale;\n\ndistributes; or\n\n(d)\n\nmanufactures,\n\nelectrical lamps to produce, within 30 days of the request, a specified number of\nelectrical lamps to verify that there is compliance with the provisions of this Act\nor regulations made pursuant to this Act.\n\nThe Director, on the recommendation of the Barbados National Standards\n(2)\nInstitution,  shall release any electrical lamps obtained pursuant to subsection (1)\nwhere\n\n(a)\n\n(b)\n\nthere is satisfactory proof that there is compliance with the provisions\nof this Act or regulations made pursuant to this Act; or\n\na  period  of  30  days  has  expired  and  the  results  of  any  tests  to  be\nundertaken in respect of the electrical lamps have not been received.\n\nNotwithstanding paragraph (b) of subsection (2), the Director may, with\n(3)\nthe  approval  of  the  Minister,  extend  the  period  of  detention  for  a  further  15\ndays where the results of tests being undertaken have not been completed within\nthe period specified in paragraph (b) of subsection (2).\n\nSubject to subsection (1), where the Director determines that the electrical\n(4)\nlamps, the packages of the electrical lamps or the labels of the electrical lamps\ndo not comply with the provisions of this Act or regulations made pursuant to\nthis Act,\n\n(a)\n\nthe  Director  shall  detain  the  electrical  lamps  and  commence\nproceedings within 30 days of the detention; and\n\n\f11\n\n(b)\n\nthe  electrical  lamps  shall  be  detained  until  the  conclusion  of  the\nproceedings.\n\n(5)\nSubject  to  subsection  (4),  where  the  Director  fails  to  commence\nproceedings within 30 days of the detention, the electrical lamps shall be returned\nto the owner.\n\nA person who fails to comply with a request made by the Director pursuant\n(6)\nto subsection (1) is guilty of an offence and is liable on summary conviction to\na fine of $100 000 or to imprisonment for a term of one year or to both.\n\nFor  the  purposes  of  this  section  “satisfactory  proof”  includes  a  test\n(7)\ncertificate or test report from a recognized authority in respect of the electrical\nlamps.\n\nSeizures and warrants\n\nWhere a magistrate is satisfied by information on oath that there is\n8.(1)\nreasonable ground for suspecting that an offence under this Act or regulations\nmade pursuant to this Act has been committed or is about to be committed, the\nmagistrate  may  issue  a  search  warrant  authorising  the  trading  standards\ninspector named in the warrant, with or without a member of the Police Force,\nto\n\n(a)\n\n(b)\n\nenter and search premises specified in the information; and\n\nexamine, test or seize any electrical lamp or other item or to examine\nand seize any document.\n\nAny electrical lamp, document or other item seized pursuant to a search\n\n(2)\nwarrant issued under subsection (1) shall\n\n(a)\n\n(b)\n\nwhere proceedings are not commenced within a period of 30 days from\nthe date of seizure, be returned to the owner; or\n\nwhere  legal  proceedings  are  commenced  before  the  expiry  of  the\n30 days, be kept until the conclusion of those proceedings.\n\n\f12\n\n(3)\nWhere a trading inspector seizes an electrical lamp pursuant to subsection\n(1),  the  Barbados  National  Standards  Institution  shall,  within  7  days  of  the\nseizure,  cause  tests  to  be  conducted  or  shall  submit  the  electrical  lamps  to  a\nrecognized authority for tests to be conducted to\n\n(a)\n\n(b)\n\ndetermine the energy performance characteristics; or\n\nverify the energy performance standards,\n\nof the electrical lamps.\n\nA trading standards inspector shall not be personally liable for any loss or\n\n(4)\ndamage arising from the execution of a search warrant under this section.\n\nPART III\n\nELECTRICAL LAMPS\n\nInvoices, labels and packages\n\n9.(1)\nfor sale an electrical lamp unless\n\nSubject to section 11, a person shall not import, distribute, sell or offer\n\n(a)\n\nthe package of the electrical lamp or the label of the electrical lamp\nclearly states\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\nthe country of origin;\n\nthe name and brand;\n\nthe name and address of the manufacturer;\n\nthe lot or batch number;\n\nthe lumens per watt;\n\n(vi)\n\nthe light colour;\n\n(vii)\n\nthe colour temperature;\n\n\f13\n\n(viii)\n\nthe rated voltage;\n\n(ix)\n\nthe frequency;\n\n(x)\n\nthe cap type;\n\n(xi)\n\nthe colour rendering index;\n\n(xii)\n\nthe model number;\n\n(xiii)\n\nwhere applicable, the unique identifier; and\n\n(xiv)\n\nthe minimum energy performance standard,\n\nof the electrical lamp;\n\n(b)\n\n(c)\n\nthe energy performance characteristics information on the package or\nlabel of the electrical lamp corresponds with the energy performance\ncharacteristics of the electrical lamp; and\n\nthe  information  on  the  package  or  the  label  of  the  electrical  lamp\ncomplies with the energy efficient labelling standards established by\nthe Barbados National Standards Institution.\n\n(2)\n\nA person shall not\n\n(a)\n\n(b)\n\nimport an electrical lamp; or\n\ndistribute, sell or offer for sale an electrical lamp which is for local use,\n\nunless  the  energy  performance  characteristics  of  the  electrical  lamp  complies\nwith the domestic minimum energy performance standard.\n\nWhere a person imports, distributes or sells an electrical lamp, the person\n(3)\nshall ensure that the invoice for the electrical lamp clearly states the minimum\nenergy performance standard of the electrical lamp.\n\n(4)\n\nA person shall not\n\n(a)\n\nalter, deface, remove or obscure the label of an electrical lamp or the\ninformation  referred  to  in  paragraph  (a)  of  subsection  (1)  on  the\npackage of an electrical lamp; or\n\n\f14\n\n(b)\n\nknowingly display a label or a package of an electrical lamp which\ndisplays inaccurate, misleading or false information.\n\n(5)\nA person who contravenes this section is guilty of an offence and is liable\non summary conviction to a fine of $100 000 or to imprisonment for a term of\none year or to both.\n\nManufacture of electrical lamps\n\n10.(1)\nlamp, that person\n\nSubject to sections 9 and 11, where a person manufactures an electrical\n\n(a)\n\nshall\n\n(i)\n\nconduct  on the electrical lamp energy performance tests which\nthe  Barbados  National  Standards  Institution  approves  or\nestablishes; or\n\n(ii)\n\nensure  that  energy  performance  tests  are  conducted  by  a\nrecognized authority on the electrical lamp,\n\nbefore the distribution or sale of the electrical lamp;\n\n(b)\n\nshall ensure that\n\n(i)\n\nthe package of the electrical lamp contains information; or\n\n(ii)\n\nthe electrical lamp has a label,\n\nwhich  clearly  states  the  minimum  energy  performance  standard  of  the\nelectrical lamp; and\n\n(c)\n\nshall  ensure  that  the  information  on  the  package  or  the  label  of  the\nelectrical  lamp  is  in  accordance  with  energy  efficient  labelling\nstandards established by the Barbados National Standards Institution.\n\nWhere  a  person  manufactures  electrical  lamps  for  local  use,  the  person\n(2)\nshall  ensure  that  the  electrical  lamps  meet  the  domestic  minimum  energy\nperformance standard.\n\n\f15\n\n(3)\nA person who contravenes this section is guilty of an offence and is liable\non summary conviction to a fine of $100 000 or to imprisonment for a term of\none year or to both.\n\nDefences\n\n11.\n10, it shall be a defence to prove, as the case may be, that the person\n\nWhere a person is charged with an offence under section 9 or section\n\n(a)\n\n(b)\n\n(c)\n\nreasonably  relied  on  information  or  representations  supplied  by  an\noverseas manufacturer or distributor of the electrical lamp;\n\nreasonably  relied  on  results  from  a  person  who  conducted  tests  to\ndetermine  the  energy  performance  characteristics  of  the  electrical\nlamp; or\n\nexercised reasonable care to ascertain whether the energy performance\ncharacteristics  of  the  electrical  lamp  complied  with  the  domestic\nminimum efficiency performance standard.\n\nPART IV\n\nRESTRICTIONS AND LICENCES\n\nProhibition\n\nWith  effect  from  the  1st  day  of  January,  2022,  any  electrical  lamp\n12.(1)\nwhich emits less than 15 lumens per watt is deemed to be a prohibited good within\nthe meaning of the Customs Act, Cap. 66 which has been imported contrary to\nsection 89 (1) of that Act.\n\n(2)\n\nWith effect from the 1st day of July, 2022, no person shall\n\n(a)\n\nmanufacture, offer for sale or sell any electrical lamp which is for local\nuse; or\n\n(b)\n\ndistribute for local retail purposes any electrical lamp,\n\n\fwhich emits less than 15 lumens per watt.\n\n16\n\nWith effect from the 1st day of July, 2022, any electrical lamp which emits\n(3)\nless than 25 lumens per watt is deemed to be a prohibited good within the meaning\nof the Customs Act, Cap. 66 which has been imported contrary to section 89 (1)\nof that Act.\n\n(4)\n\nWith effect from the 1st day of January, 2023, no person shall\n\n(a)\n\nmanufacture, offer for sale or sell any electrical lamp which is for local\nuse; or\n\n(b)\n\ndistribute for local retail purposes any electrical lamp,\n\nwhich emits less than 25 lumens per watt.\n\nWith effect from the 1st day of January, 2023, any electrical lamp which\n(5)\nemits less than 40 lumens per watt is deemed to be a prohibited good within the\nmeaning of the Customs Act, Cap. 66 which has been imported contrary to section\n89 (1) of that Act.\n\n(6)\n\nWith effect from the 1st day of July, 2023, no person shall\n\n(a)\n\nmanufacture, offer for sale or sell any electrical lamp which is for local\nuse; or\n\n(b)\n\ndistribute for local retail purposes any electrical lamp,\n\nwhich emits less than 40 lumens per watt.\n\nWith effect from the 1st day of July, 2023, any electrical lamp which emits\n(7)\nless than 55 lumens per watt is deemed to be a prohibited good within the meaning\nof the Customs Act, Cap. 66 which has been imported contrary to section 89 (1)\nof that Act.\n\n(8)\n\nWith effect from the 1st day of January, 2024, no person shall\n\n(a)\n\nmanufacture, offer for sale or sell any electrical lamp which is for local\nuse; or\n\n(b)\n\ndistribute for local retail purposes any electrical lamp,\n\n\fwhich emits less than 55 lumens per watt.\n\n17\n\nA person who contravenes this section is guilty of an offence and is liable\n(9)\non summary conviction to a fine of $100 000 or to imprisonment for a term of\none year or to both; and in the case of a continuing offence, to a further fine of\n$1 000 for each day or part thereof during which the offence continues after which\na conviction was first obtained.\n\nExemptions\n\n13.(1)\n\nSections 9(2), 10(2) and 12 do not apply to exempted electrical lamps.\n\nNotwithstanding  subsection  (1),  the  Minister  may  by  order  exempt  any\n\n(2)\nelectrical lamp from the provisions of this Act.\n\nExempted electrical lamp importation licence\n\nWith effect from the 1st  day of January, 2022, a person shall not import\n14.(1)\nan exempted electrical lamp without an exempted electrical lamp importation\nlicence.\n\nA person who desires to obtain an exempted electrical lamp importation\n\n(2)\nlicence shall apply to the Minister responsible for Commerce.\n\nAn application for an exempted electrical lamp importation licence shall\n\n(3)\nbe in such form as the Minister responsible for Commerce approves.\n\nThe Minister responsible for Commerce may, on receipt of an application\n(4)\nmade pursuant to subsection (2) and on payment of the fee set out in the Second\nSchedule, grant the applicant an exempted electrical lamp importation licence.\n\nWhere  the  Minister  responsible  for  Commerce  does  not  approve  an\n(5)\napplication, that Minister shall inform the applicant in writing the reasons for not\napproving the application.\n\n(6)\n\nA licence granted pursuant to subsection (4) shall\n\n(a)\n\n(b)\n\nbe in such form as the Minister responsible for Commerce approves;\n\nbe valid for a period of one year from the date of issue;\n\n\f18\n\n(c)\n\nstate the terms and conditions of the licence; and\n\n(d)\n\nnot be transferable.\n\n(7)\nA person who contravenes subsection (1) is guilty of an offence and is\nliable on summary conviction to a fine of $100 000 or to imprisonment for a term\nof one year or to both; and in the case of a continuing offence, to a further fine\nof $1 000 for each day or part thereof during which the offence continues after\nwhich a conviction was first obtained.\n\nA  person  who  is  granted  a  licence  pursuant  to  this  section  and  who\n(8)\ncontravenes the terms or conditions of the licence is guilty of an offence and is\nliable on summary conviction to a fine of $100 000 or to imprisonment for a term\nof one year or to both.\n\nDistribution licence\n\nWith  effect  from  the  30th  day  of  June,  2022,  a  person  shall  not\n15.(1)\nmanufacture, distribute, sell or offer for sale an exempted electrical lamp which\nis for local use without a distribution licence.\n\nA person who desires to obtain a distribution licence shall apply to the\n\n(2)\nMinister responsible for Commerce.\n\nAn  application  for  a  distribution  licence  shall  be  in  such  form  as  the\n\n(3)\nMinister responsible for Commerce approves.\n\nThe Minister responsible for Commerce may, on receipt of an application\n(4)\nmade pursuant to subsection (2) and on payment of the fee set out in the Second\nSchedule, grant a distribution licence.\n\nWhere  the  Minister  responsible  for  Commerce  does  not  approve  an\n(5)\napplication, that Minister shall inform the applicant in writing the reasons for not\napproving the application.\n\n(6)\n\nA licence granted pursuant to subsection (4) shall\n\n(a)\n\nbe in such form as the Minister responsible for Commerce approves;\n\n\f19\n\n(b)\n\nbe valid for a period of one year from the date of issue;\n\n(c)\n\nstate the terms and conditions of the licence; and\n\n(d)\n\nnot be transferable.\n\n(7)\nA person who contravenes subsection (1) is guilty of an offence and is\nliable on summary conviction to a fine of $100 000 or to imprisonment for a term\nof one year or to both and in the case of a continuing offence, to a further fine of\n$1 000 for each day or part thereof during which the offence continues after which\na conviction was first obtained.\n\nA  person  who  is  granted  a  licence  pursuant  to  this  section  and  who\n(8)\ncontravenes the terms or conditions of the licence is guilty of an offence and is\nliable on summary conviction to a fine of $100 000 or to imprisonment for a term\nof one year or to both.\n\nRecord of licences\n\n16.(1)\n\nThe Ministry responsible for Commerce shall\n\n(a)\n\n(b)\n\nmaintain  a  record  of  licences  that  the  Minister  responsible  for\nCommerce issues pursuant to this Act; and\n\nforward  a  copy  of  that  record  to  the  Barbados  National  Standards\nInstitution.\n\nSubject to subsection (1), the Barbados National Standards Institution shall\n(2)\nmaintain a database which reflects the copy of the record that it receives from\nthe Ministry responsible for Commerce.\n\nProduction of licence\n\n17.(1)\nA person who holds a licence issued pursuant to this Act shall produce\nhis licence for inspection when asked to do so by a trading standards inspector\nor a member of the Police Force.\n\n\f20\n\n(2)\nA person who contravenes subsection (1) is guilty of an offence and is\nliable on summary conviction to a fine of $100 000 or to imprisonment for a term\nof one year or to both.\n\nPART V\n\nMISCELLANEOUS\n\nImmunity\n\n18.\nNotwithstanding section 8(4), a person shall not be liable for anything\ndone or omitted in the discharge or the purported discharge of his functions under\nthis Act unless that act or omission was done in bad faith.\n\nSchedules\n\n19.\n\nThe Minister may by order amend, vary or revoke the Schedules.\n\nRegulations\n\n20.\n\nThe Minister may make regulations\n\n(a)\n\n(b)\n\n(c)\n\nrespecting the labelling or packaging of electrical lamps;\n\nprescribing energy performance test procedures for electrical lamps;\n\nprescribing anything that is authorised or required by this Act to be\nprescribed; and\n\n(d)\n\ngiving effect to the provisions of this Act.\n\n\f21\n\nFIRST SCHEDULE\n\nAPPLIANCES\n\n(Section 2)\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\n11.\n\n12.\n\nAirport runway lights\n\nAutomobile lights\n\nFreezers\n\nHeating equipment\n\nLaboratory equipment\n\nLighting equipment\n\nMedical equipment\n\nMicrowaves\n\nOvens\n\nRefrigerators\n\nStoves\n\nStove hoods\n\n\f22\n\nSECOND SCHEDULE\n\nLICENCE FEES\n\n(Sections 14(4) and 15(4))\n\nFee for exempted electrical lamp importation\nlicence\n\nFee for distribution licence\n\n$100.00\n\n$200.00\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2021.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2021.\n\nPresident\n\n"
}