{
  "bill_id": 559,
  "slug": "resolution-re-vesting-of-land-at-whitepark-road-and-country-road-in-nhc",
  "title": "Resolution re vesting of land at Whitepark Road and Country Road in NHC",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/575f4c1cc2c8ff6fd89c8cbed4dae33a.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-07-27",
  "first_reading": "2021-08-18",
  "gazette_date": null,
  "markdown": "2021-06-03\n\nPARLIAMENT\n\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands\n\n(Vesting and Disposal) Act, Cap. 225, approve the vesting in the National Housing Corporation\n\nof the parcel of land situate at Whitepark Road and Country Road in the parish of Saint Michael\n\nin this Island and more particularly described in the Schedule.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and twenty-one.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                            day  of                                                    ,\n\nTwo thousand and twenty-one.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  the  property  of  the  Crown  situate  at  Whitepark  Road  and\n\nCountry  Road  in  the  parish  of  Saint  Michael  in  this  Island  namely  Lot  1  (together  with  the\n\nbuildings  thereon)  containing  by  admeasurement  11400.0  square  metres  (inclusive  of  15.0\n\nsquare metres in road reserve) abutting and bounding on lands now or formerly of The Wesleyan\n\nHoliness Church, on lands now or formerly of the Barbados Government, on lands now or formerly\n\nof Economical Homes Company Ltd. on lands now or formerly of the Barbados Government\n\n(Lot 2) on lands now or formerly of Country Road Investments Ltd. on lands now or formerly\n\nof the National Housing Corporation, on other lands of the Barbados Government (Drain) and\n\non a road known as Whitepark Road which leads to Bridgetown in one direction and Bank Hall\n\nin the other direction or however else the same may abut and bound as shown and delineated\n\non a plan certiﬁ ed on the 13th day of October, 2020 by Samuel N. Taylor, Land Surveyor and\n\nrecorded  on  the  10th  day  of  November,  2020  in  the  Lands  and  Surveys  Department  as  Plan\n\nNo. 1354/2020.\n\n\f3\n\nADDENDUM\n\n  The  Cabinet  at  its  meeting  held  on  the  1st  day  of April,  2021  considered  Note  (21)\n\n275/MHLM 22 and agreed to the vesting in the National Housing Corporation of a parcel of\n\nland containing by admeasurement 11,400.0 square metres (122,709.6 square feet, 2.8 acres)\n\ninclusive of 15 square metres (161.46 square feet) in road reserve being the land of the former\n\nLouis Lynch Secondary School together with the buildings thereon, comprising approximately\n\n41,732 square feet of ﬂ oor space, for sale to The West India Biscuit Company Limited for the\n\nsum of $6,500,000.00.\n\n    The parcel of land, more particularly described in the Schedule, formed part of a larger\n\nparcel of land measuring 120,840 square feet which was acquired by the Crown by Deed of\n\nConveyance dated the 23rd day of September, 1970 between The Sanitary Laundry Company\n\nLimited of the One Part and the Crown of the Other Part recorded in the Land Registry in this\n\nIsland on the 11th day of November, 1970 as Deed No. 05513A of 1970.\n\n      Since the parcel of land is required for a government department, the Town and Country\n\nPlanning Development Order, 1972 (S.I. 1972/75) was invoked to eﬀ ect the subdivision of the\n\n11,400 square metres oﬀ  the larger parcel containing by admeasurement 17,272.1 square metres.\n\n      In accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap.225,\n\nthe approval of Parliament is now sought for the vesting in the National Housing Corporation\n\nof the parcel of land described in the Schedule for the sale to The West India Biscuit Company\n\nLimited for the sum of $6,500,000.00.\n\n"
}