{
  "bill_id": 55,
  "slug": "maintenance-amendment-bill-2014",
  "title": "Maintenance (Amendment) Bill, 2014",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/0cc831ec3f512ed4c0635a2b6dca769f.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2014-11-08",
  "first_reading": "2014-11-12",
  "second_reading": "2014-11-07",
  "gazette_date": "2014-11-24",
  "passed_date": "2014-11-19",
  "markdown": "Explanatory Memorandum after page 16\n\n2014-10-02\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Maintenance Act, Cap. 216 to make provision for\nany parent or guardian who has primary guardianship and custody of a child to\nmake an application for the maintenance of that child from the parent of the child\nwho does not have primary guardianship and custody of the child, and to provide\nfor related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 2 of Cap. 216\n\nAmendment of section 6 of Cap. 216\n\nAmendment of section 7 of Cap. 216\n\nAmendment of section 8 of Cap. 216\n\nAmendment of section 9 of Cap. 216\n\nAmendment of section 10 of Cap. 216\n\nAmendment of section 11 of Cap. 216\n\nAmendment of section 12 of Cap. 216\n\n10.\n\nAmendment of section 13 of Cap. 216\n\n11.\n\nAmendment of section 17 of Cap. 216\n\n12.\n\nAmendment of section 19 of Cap. 216\n\n13.\n\nAmendment of section 20 of Cap. 216\n\n14.\n\nAmendment of section 22 of Cap. 216\n\n15.\n\nAmendment of Section 24 of Cap. 216\n\n\f3\n\n16.\n\nAmendment of section 26 of Cap. 216\n\n17.\n\nAmendment of section 27 of Cap. 216\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Maintenance Act.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Maintenance (Amendment) Act, 2014.\n\n\f6\n\nAmendment of section 2 of Cap. 216\n\n2.\nas the principal Act, is amended by\n\nSection 2 of the Maintenance Act, Cap. 216, in this Act referred to\n\n(a)\n\ndeleting  the  definition  of  the  word  “child”  and  substituting  the\nfollowing:\n\n“ “child” does not include a child of a marriage or union other than\n\nmarriage, or an adopted child;”; and\n\n(b)\n\ninserting the following definitions in alphabetical order:\n\n“ “applicant” means a person entitled to apply for maintenance under\n\nthe Act;\n\n“birth” includes stillbirth;\n\n“DNA” means deoxyribonucleic acid which is a substance occurring\nin the cells of the body of a person which contain the genetic code\nof that person, which is hereditary and passes to the offspring of\nthat person;\n\n“DNA test” means the process of testing a sample of the DNA of a\nperson  to  determine  the  paternity  of  a  child  for  whom  an\napplication for maintenance has been made under this Act;\n\n“father” means the biological father of a child;\n\n“mother” means the biological mother of a child;\n\n“parent” means either the biological mother or father of a child.”.\n\nAmendment of section 6 of Cap. 216\n\n3.\nthe following:\n\nThe principal Act is amended by deleting section 6 and substituting\n\n\f7\n\n“Application for maintenance\n\n6.(1)\n\nSubject to this Act, an applicant, being\n\n(a)\n\n(b)\n\neither the father or mother of a child with guardianship and\ncustody of that child; or\n\nthe  person  granted  custody  of  a  child  under  section  20  or\notherwise,\n\nmay  make  an  application  for  the  maintenance  of  that  child,  to  the\nmagistrate of the district in which that parent or person resides, for a\nsummons to be served on the other parent of the child or the parent of\nthe  child,  as  the  case  may  be,  for  proceedings  in  respect  of  the\napplication for the maintenance of that child.\n\nOn hearing an application under this Act for the maintenance of\n(2)\na  child,  the  magistrate  may  proceed  to  make  an  order  for  the\nmaintenance of the child against the defendant, and the defendant shall\npay\n\n(a)\n\na sum of money for or towards\n\n(i)\n\nthe maintenance of the child; or\n\n(ii)\n\nthe  reasonable  expenses  incidental  to  the  birth  of  the\nchild; or\n\n(b)\n\nsuch a sum of money as the magistrate considers reasonable\nfor or towards the expenses incidental to the funeral of the\nchild, where the child has died before the making of the order.\n\nIn making an order against the defendant for the payment of any\n(3)\nsum under this section, the magistrate shall take into account the matters\nset out in section 14(2).\n\nOn hearing an application under this Act for the maintenance of\n(4)\na child the magistrate shall enquire into the details for the guardianship\n\n\f8\n\nand custody of the child, as well as the arrangements for access and\nvisitation by the parent who does not have guardianship and custody of\nthe child; and the magistrate may, where he considers it necessary in\nthe best interest of the child, in addition to the order for maintenance,\nmake  an  order  for  that  parent  to  have  access  and  visitation  of  the\nchild.”.\n\nAmendment of section 7 of Cap. 216\n\n4.\nthe following:\n\nThe principal Act is amended by deleting section 7 and substituting\n\n“ Period for application\n\n7.\nSubject to section 15, an applicant may make an application\nfor maintenance at anytime after the birth of the child or before the child\nattains the age of 18 years, or sooner marries.”.\n\nAmendment of section 8 of Cap. 216\n\n5.\nthe following:\n\nThe principal Act is amended by deleting section 8 and substituting\n\n“Exception in respect of a void marriage\n\n8.\nthat\n\n(a)\n\nA person who has been delivered of a child may, upon proof\n\nbefore the birth of the child she was a party to a marriage\nwhich was disaffirmed on account of her, or the other party,\nbeing under the marriageable age at the date of the marriage;\nand\n\n\f9\n\n(b)\n\nthe other party had access to her within 12 months before the\nbirth\n\nmake an application against that other party for the maintenance of the\nchild at anytime after the birth of the child or before the child attains\nthe age of 18 years, or sooner marries.”.\n\nAmendment of section 9 of Cap. 216\n\n6.\nthe following:\n\nThe principal Act is amended by deleting section 9 and substituting\n\n“Determination of paternity\n\n9.(1)\nOn hearing an application where the defendant is alleged to\nbe the father of the child, the magistrate shall enquire of the defendant\nwhether he admits to being the father of the child.\n\n(2)\nWhere pursuant to an enquiry under subsection (1) the defendant\ndenies that he is the father of the child, the magistrate may, where he\nconsiders that the circumstances so require it, order that a DNA test be\nperformed  to  ascertain  whether  the  defendant  is  the  father  of  the\nchild.\n\nNotwithstanding  subsection  (2),  as  the  circumstances  may\n(3)\nrequire,  the  defendant  may  be  ordered  by  the  magistrate  to  make\npayments for the maintenance of the child until the results of the DNA\ntest are known, and where it is determined that the defendant is not the\nfather of the child the magistrate shall order that the applicant repay the\ndefendant the sums paid for the maintenance of the child.\n\nWhere the defendant has DNA evidence proving that he is not\n(4)\nthe father of the child, he may make an application to the magistrate for\nthis DNA evidence to be considered by the court, and the magistrate\nshall consider this evidence as well as the other matters before him.\n\n\f10\n\n(5)\nWhere a DNA test proves that a person is the father of a child\nthat  person  shall  be  liable  to  maintain  that  child  in  accordance  with\nsection 4, and where it is proven that the defendant is not the father of\nthe child the magistrate shall make an order that the defendant is not\nthe father of the child and not liable to maintain the child in accordance\nwith section 4.\n\nWhere a father is deceased and the paternity of a child is in issue,\n(6)\nin respect of a challenge to provision made for the maintenance of that\nchild, the magistrate may on application by an applicant, order a DNA\ntest to confirm the paternity of the child.”.\n\nAmendment of section 10 of Cap. 216\n\n7.\n“Where” and substituting therefor the words, “Subject to section 9, where”.\n\nSection 10(1) of the principal Act is amended by deleting the word\n\nAmendment of section 11 of Cap. 216\n\n8.\nthe following:\n\nThe principal Act is amended by deleting section 11 and substituting\n\n“Power to order sum to be calculated from birth\n\n11.\nWhere an application is made within 3 months of the birth\nof  a  child  any  sum  ordered  by  the  magistrate  to  be  paid  for  the\nmaintenance of that child, may if the magistrate thinks fit\n\n(a)\n\n(b)\n\nbe calculated from the date of the birth of the child; and\n\ninclude the reasonable expenses incidental to the birth of the\nchild.”.\n\n\f11\n\nAmendment of section 12 of Cap. 216\n\n9.\n“ under section 10” wherever they appear.\n\nSection  12  of  the  principal  Act  is  amended  by  deleting  the  words\n\nAmendment of section 13 of Cap. 216\n\n10.\nthe following:\n\nThe principal Act is amended by deleting section 13 and substituting\n\n“Defence to an application\n\n13.\napplication if the defendant proves\n\nIn  any  proceedings  under  this  Act,  it  is  a  defence  to  the\n\n(a)\n\nthat in accordance with the Status of Children Reform Act,\nCap.  220,  another  person  has  filed  with  the  Registrar  a\ndeclaration affirming that he is the father of the child; or\n\n(b)\n\nthat under the Vital Statistics Registration Act, Cap. 192A,\nanother person has signed the register as father of the child\n\nunless it has been proven by a DNA test or otherwise that that other\nperson is in fact not the father of the child.”.\n\nAmendment of section 17 of Cap. 216\n\n11.\n\nSection 17(1) of the principal Act is amended by\n\n(a)\n\ndeleting paragraph (b) and substituting the following:\n\n“(b)\n\nthe death of the father or mother, as the case may be;”; and\n\n(b)\n\ndeleting paragraph (d) and substituting the following:\n\n\f12\n\n“(d)\n\nthe child attaining the age of 18 years of age, unless section\n15 applies.”.\n\nAmendment of section 19 of Cap. 216\n\n12.\n\nSection 19 of the principal Act is amended\n\n(a)\n\nin  subsection  (1)  by  deleting  the  words  “or  his  legal  personal\nrepresentative”  and  substituting  the  words,  “,  mother  or  the  legal\nrepresentative of either parent,”; and\n\n(b)\n\nin subsection 2 by inserting the words “or mother, as the case may\nbe,” after the word “father” in paragraph (a)(ii).\n\nAmendment of section 20 of Cap. 216\n\n13.\nand substituting the following:\n\nSection 20 of the principal Act is amended by deleting subsection (7)\n\n“(7)\nWhere a magistrate places a child in the custody of a person other\nthan the mother or father of the child, the magistrate shall make an order\nfor the maintenance of the child requiring that\n\n(a)\n\n(b)\n\nboth parents contribute a sum of money for the maintenance\nof the child; or\n\neither the father or the mother, as the case may be, contribute\na sum of money towards the maintenance of the child.\n\nAny  person  who  fails  to  comply  with  an  order  made  under\n(8)\nsubsections (1), (2), (3), (5), (6) or (7) is liable on summary conviction\nto a fine not exceeding $10,000.”.\n\nAmendment of section 22 of Cap. 216\n\n14.\nthe following:\n\nThe principal Act is amended by deleting section 22 and substituting\n\n\f13\n\n“Application by Chief Welfare Officer or Child Care Board\nin respect of a child who is the charge of the Child Care Board\n\n22.(1)\nWhere any child becomes the charge of Child Care Board,\nthen, subject to subsection (2), the Chief Welfare Officer or Child Care\nBoard, as the case may be, may\n\n(a)\n\nif that officer or the Board thinks fit, having regard to all the\ncircumstances of the case; and\n\n(b)\n\nbefore the child attains the age of 18 years,\n\nmake an application to a magistrate for a summons to be served on the\nparent or guardian of the child to show cause why a maintenance order\nshould not be made for a contribution towards the maintenance of the\nchild.\n\nAn application may not be made under subsection (1) in respect\n\n(2)\nof any child\n\n(a)\n\n(b)\n\nin  relation  to  whom  there  is  in  force  a  maintenance  order\nmade under section 6 or section 10; or\n\nin relation to whom there is in force immediately before 15th\nMarch, 1984, an order made or having effect under, or for the\npurposes of, a former Act.\n\nOn the hearing of an application under this section, the magistrate\n\n(3)\nshall hear\n\n(a)\n\nsuch other evidence as may be adduced by or on behalf of the\napplicant; and\n\n(b)\n\nany evidence tendered by or on behalf of the defendant;\n\nand, where he is satisfied on the evidence that the case for the applicant\nhas been proved, the magistrate shall adjudge the defendant liable to\nmaintain  the  child  in  accordance  with  section  4;  but  where  the\n\n\f14\n\nmagistrate  is  not  so  satisfied,  the  magistrate  shall  dismiss  the\napplication.\n\nWhere the magistrate adjudges the defendant liable to maintain\n(4)\nthe child in accordance with section 4, the magistrate may proceed to\nmake an order against the defendant for the payment to the applicant\nof\n\n(a)\n\na sum of money for or towards\n\n(i)\n\nthe  relief  of  the  child  during  such  time  as  the  child\ncontinues, or afterwards becomes a charge of the Chief\nWelfare Officer or Child Care Board,\n\n(ii)\n\nthe  reasonable  expenses  incidental  to  the  birth  of  the\nchild; and\n\n(b)\n\nif the child has died before the making of the order, such sum\nof  money  as  the  magistrate  considers  reasonable  for  or\ntowards the expenses incidental to the funeral of the child and\nproperly incurred by the Chief Welfare Officer, or Child Care\nBoard, as the case may be.\n\nIn making an order against the defendant for the payment of any\n(5)\nsums under subsection (4), the magistrate shall take into account all or\nany of the matters set out in section 14.\n\nWhere  an  application  under  subsection  (1)  is  made  within\n(6)\n3 months of the birth of the child, any sum ordered to be paid under\nsubsection (4) (a) (i), may, if the magistrate thinks fit, be calculated\nfrom the date of birth, but no sum may be calculated from a date earlier\nthan the date upon which the child became a charge of the Chief Welfare\nOfficer or Child Care Board.\n\nAny  payment  ordered  to  be  made  under  subsection  (4)  is\n(7)\nrecoverable  in  accordance  with  section  23  or  rules  made  under\nsection 29, but no such payment may be recoverable under any such\norder except in respect of the period during which the child is actually\n\n\f15\n\nin  receipt  of  relief  from  the  Chief  Welfare  Officer  or  Child  Care\nBoard.\n\n(8)\nA maintenance order shall not be made under subsection (4), and\nif made, shall cease to have effect except for the recovery of arrears, if\nthe parent or the person who is guardian of the child, as the case may\nbe, obtains a maintenance order under section 6 or section 10 in respect\nof the child.\n\nWhere the parent of a child in relation to whom a maintenance\n(9)\norder has been made, or an order has been made under a former Act,\napplies under section 6 for a maintenance order, the maintenance order,\nmade under this section or the order made under a former Act, as the\ncase may be, shall be prima facie evidence that the man against whom\nthe order was made is the father of the child.\n\nNothing contained in this section shall be deemed to relieve the\n(10)\nmother  or  father  of  a  child  of  his  or  her  liability  to  maintain  the\nchild. ”.\n\nAmendment of Section 24 of Cap. 216\n\n15.\nthe following:\n\nThe principal Act is amended by deleting section 24 and substituting\n\n“Maintenance orders and funeral expenses\n\n24.(1)\nWhere the child in respect of whom a maintenance order has\nbeen made or deemed to have been made under this Act, dies while the\norder is in force, the magistrate of the district in which the order was\nmade may, on the application of the parent or person entitled to the\npayment of money required to be paid under the order, make an order\nfor  the  payment  of  a  sum  of  money  for  or  towards  the  reasonable\n\n\f16\n\nexpenses incidental to the funeral of the child, by the parent obligated\nto maintain the child under the existing order.\n\n(2)\nAny sum of money required to be paid by an order made under\nthis section is recoverable in the manner provided for in section 23 or\nunder rules made under section 29. ”.\n\nAmendment of section 26 of Cap. 216\n\n16.\nSection 26(2) of the principal Act is amended by inserting the words\n“or mother, as the case may be” after the word “father” wherever it appears.\n\nAmendment of section 27 of Cap. 216\n\n17.\nSection 27 of the principal Act is amended by inserting the words\n“or mother, as the case may be” after the word “father” wherever it appears.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2014.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2014.\n\nPresident\n\n\fMAINTENANCE (AMENDMENT) ACT, 2014\n\nEXPLANATORY MEMORANDUM\n\nThe Maintenance Act came into effect on the 15th of March 1984 to provide a\nscheme  for  single  mothers  to  obtain  maintenance  for  children  born  out  of\nwedlock.  The  Act  provides  a  comprehensive  scheme  for  mothers  to  seek\nmaintenance by applying to magistrates’ court for an order against the biological\nfathers of their children. Since the passage of this Act some thirty years ago, the\ncomposition of the single parent family is now varied and as such the person\nneeding to seek maintenance for the child can now also be the father or another\nperson with guardianship of the child. The law must, in the best interest of the\nchild, provide for these changing realities.\n\nClause 1:\n\nClause 2:\n\nClause 3:\n\nThis clause gives the short title of the amending Act. It may\nbe cited as the Maintenance (Amendment) Act, 2014.\n\nThis  clause  amends  the  interpretation  section  of  the\nMaintenance Act, Cap. 216 , hereafter referred to as the Act,\nto define the terms “applicant”, “birth”, “DNA”, “DNA test”,\n“father”, “mother” and “parent” to widen the Act’s scope of\napplication.\n\nThis  clause  amends  section  6  of  the  Act  to  expand  the\ncategories of people who can apply for maintenance to include\nthe  father  of  the  child  and  a  person  granted  custody  of  the\nchild . This section also lists matters that the Magistrate must\ntake into account, and ensures that the Magistrate investigates\nthe living circumstances of the child and where relevant the\nMagistrate  is  empowered  to  make  orders  for  access  and\nvisitation for the child.\n\nClause 4:\n\nThis  clause  amends  section  7  of  the  Act  to  provide  a  time\nframe for an application for maintenance; an application for\n\ni\n\n\fMaintenance (Amendment) Act, 2014\n\nmaintenance can be made anytime after the birth of the child\nand before the child attains 18 years, unless section 15 of the\nAct applies.\n\nThis Clause amends section 8 of the Act to ensure that people\nwho are single as a result of a void marriage may also make\nan application for maintenance under the Maintenance Act.\n\nThis Clause amends section 9 of the Act to provide for DNA\ntests  to  be  ordered  by  the  court  to  establish  paternity;  this\nsection  also  provides  for  paternity  tests  not  ordered  by  the\ncourt to be submitted to the court as evidence.\n\nThis clause amends section 10 to make the provisions of that\nsection, subject to the section 9.\n\nThis clause amends section 11 of the Act to permit the Court\nto make an order for the maintenance of the child to calculated\nfrom the date of the birth of the child and to include reasonable\namounts for the costs of the delivery of the child, where the\napplicant applies for maintenance within 3 months of the birth\nof the child.\n\nThis  clause  amends  section  12  to  delete  the  words  “under\nsection 10” so that the application of the section is no longer\ntied to section 10 but now applies to entire Act.\n\nThis clause amends section 13 to exclude the application of\nthis defence to situations where DNA evidence shows that the\nperson on the record is not the father of the child.\n\nClause 5:\n\nClause 6:\n\nClause 7:\n\nClause 8:\n\nClause 9:\n\nClause 10:\n\nClause 11:\n\nThis  clause  amends  section  17  of  the  Act  to  expand  the\ncircumstances in which a maintenance order ceases to operate.\n\nii\n\n\fClause 12:\n\nClause 13:\n\nClause 14:\n\nClause 15:\n\nClause 16:\n\nClause 17:\n\nMaintenance (Amendment) Act, 2014\n\nThis clause amends section 19 of the Act to ensure that it will\napply to either parent or the guardian of the child, as the case\nmay be, so that any party can apply for a modification of a\nmaintenance order.\n\nThis clause amends section 20 of the Act to ensure that both\nparents are equally liable to maintain the child in accordance\nwith section 4, in circumstances where the child is not in the\ncustody of either parent.\n\nThis amends section 22 of the Act to provide for the Child\nCare Board to seek maintenance from either parent of a child.\n\nThis clause amends section 24 of the Act to ensure that either\nparent is liable for funeral expenses in the event of the death\nof the child.\n\nThis clause amends section 26 of the Act to ensure that section\n26 will now apply to either parent of a child.\n\nThis clause amends section 27 of the Act to ensure that section\n27 applies to either parent of the child.\n\niii\n\n"
}