{
  "bill_id": 560,
  "slug": "needhams-point-holdings-ltd-exchange-and-issue-of-bonds-bill-2021",
  "title": "Needhams Point Holdings Ltd (Exchange and Issue of Bonds) Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/cf6ddca890e3b3db6614635d52d94391.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-06-30",
  "first_reading": "2021-07-21",
  "gazette_date": "2021-07-20",
  "markdown": "NEEDHAM’S POINT HOLDINGS LTD.\n(EXCHANGE AND ISSUE OF BONDS) ACT, 2021\n\n2021-06-17\n\nOBJECTS AND REASONS\n\nThis  Bill  would  make  provision  for  the  exchange  of  bonds  issued  by\nNeedham’s  Point  Holdings  Ltd.  and  the  issuance  of  Series  B  Bonds  by  the\nGovernment of Barbados to those bondholders.\n\n\f2\n\nNEEDHAM’S POINT HOLDINGS LTD.\n(EXCHANGE AND ISSUE OF BONDS) ACT, 2021\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\nShort title\n\nInterpretation\n\nPurpose\n\nExchange and Issuance of Series B Bonds\n\nAmount of bond issue\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to make provision for the exchange of bonds issued by Needham’s\nPoint Holdings Ltd. and the issuance of Series B Bonds by the Government of\nBarbados to those bondholders.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Exchange and Issue of Bonds) Act, 2021.\n\nThis  Act  may  be  cited  as  the  Needham’s  Point  Holdings  Ltd.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“bondholder” means a person who has been issued a bond;\n\n“bonds” mean the fixed rate bonds issued by Needham’s Point Holdings Ltd.\nunder the Trust Deed dated the 7th day of January, 2011 (as amended from\ntime to time) between Needham’s Point Holdings Ltd. and Royal Fidelity\nMerchant  Bank  &  Trust  (Barbados)  Limited  to  raise  $80  million  for  the\npurpose of financing the Hilton (Barbados) Hotel;\n\n“Natural Disaster Clause” has the meaning assigned to it in the Schedule;\n\n“Needham’s  Point  Holdings  Ltd.”  means  a  company  incorporated  under  the\n\nCompanies Act, Cap. 308;\n\n“Series  B  Bonds”  means  the  bonds  described  in  the  Schedule  issued  by  the\n\nGovernment of Barbados.\n\nPurpose\n\n3.\n\nThe purpose of this Act is to provide for\n\n(a)\n\n(b)\n\n(c)\n\nthe exchange of bonds for Series B Bonds;\n\nthe issue of Series B Bonds to a bondholder; and\n\nthe cancellation of the full outstanding amount of the bonds.\n\n\f5\n\nExchange and Issuance of Series B Bonds\n\n4.(1)\n\nThe Government of Barbados shall\n\n(a)\n\nexchange  the  bonds  issued  by  Needham’s  Point  Holdings  Ltd.  for\nSeries B Bonds; and\n\n(b)\n\nissue Series B Bonds to those bondholders,\n\nin the amount set out in section 5 and on the terms and conditions set out in the\nSchedule.\n\nThe Government of Barbados shall cancel the full outstanding amount of\n\n(2)\nthe bonds referred to in subsection (1)(a).\n\nAmount of bond issue\n\n5.\nsum of $83.75 million Barbados dollars.\n\nThe aggregate amount of the issue of Series B Bonds shall be in the\n\n\f6\n\n L.R.O. 1998SCHEDULE(Sections 2 and 4)Series B BondsStructure:Interest Rate:Interest Payments:Principal Repayment:Allocation of Aggregate PrincipalAmount Amongst Strips:Natural Disaster Clause:11 Series B amortising strips issued by the Government of Barbados with maturities of 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, and 15 years.1.0% per annum for ﬁ rst 3 years2.5% per annum for year 43.75% year 5 to maturityQuarterly with ﬁ rst payment on 30th June, 2021. Interest accrued from 1st April, 2021.The principal of each strip will be repaid in four equal quarterly principal instalments commencing one year prior to the maturity date of that strip.5-Year: 7.49% 11-Year: 9.37%6-Year: 7.78% 12-Year: 9.72%7-Year: 8.07% 13-Year: 10.10%8-Year: 8.38% 14-Year: 10.48%9-Year: 8.70% 15-Year: 10.88%10-Year: 9.03%Yes\f7\n\n L.R.O. 1998Natural Disaster Clause(a) Th is natural disaster clause applies following the occurrence of any Caribbean Earthquake Event, Caribbean Tropical Cyclone Event or Covered Area Rainfall Event covered in the Caribbean Catastrophe Risk Insurance Facility (CCRIF) Policy, in respect of which a Policy Payment has been made to Barbados, and subject to paragraph (d) below, Barbados may elect to defer payment of the Deferred Payment Amount on a Deferral Date. Any such Deferred Payment Amount shall remain outstanding and shall continue to accrue interest in accordance with paragraph (c) below.(b) Beginning with the next Payment Date following a Deferral Date, each remaining principal amortization of the Aﬀ ected Series will be increased by an amount equal to a pro rata portion of principal that is being deferred on the Deferral Date, taking into account the  number of remaining principal amortization payments of that Aﬀ ected Series.(c) The portion of a Deferred Payment Amount that is comprised of interest will be capitalized and added to principal as each such interest payment falls due under the terms of the Aﬀ ected Series after the relevant Deferral Date. As such interest is converted into principal, the principal amount of the Aﬀ ected Series shall be increased in the amount  of such deferred interest.(d) Barbados shall be entitled to defer the Deferred Payment Amount following the occurrence of an Event only if all of the following conditions are satisﬁ ed:(i) the CCRIF Policy is in full force and eﬀ ect and CCRIF has issued a written report  conﬁ rming that the Event is an Insured Event in respect of which a Policy Payment has been made to Barbados;(ii) since the 22nd day of April, 2021, neither of the Coverage Limit or the Exhaustion Point applicable to earthquakes, tropical cyclone or excess rainfall has been reduced, unless it has been reduced by CCRIF and CCRIF has declined a request submitted by Barbados to CCRIF to maintain such Coverage Limit or Exhaustion Point, as the case may be; andSchedule - (Cont'd)\f8\n\n L.R.O. 1998Natural Disaster Clause - (Cont'd)(iii) the Modelled Loss (as deﬁ ned below), in the case of a Caribbean Earthquake Event or Caribbean Tropical Cyclone Event, or the Rainfall Index Loss, in the case of a Covered Area Rainfall Event, to Barbados from the Event is greater than U.S.$5 million.Upon electing to defer the Deferred Payment Amount, Barbados shall at its ownexpense provide notice thereof (a \"Deferral Claim\") to the Holders as provided in the Notices provision of the relevant Aﬀ ected Series, describing in reasonable detail theparticulars of the Event giving rise to the right to make such Deferral Claim. Barbados shallbe entitled to make no more than three Deferral Claims under each Aﬀ ected Series.(e) For purposes of this clause:\"Caribbean Earthquake Event\", \"Caribbean Tropical Cyclone Event\", \"Covered Area Rainfall Event\", \"Coverage Limit\", \"Exhaustion Point\", \"Insured Event\", \"Policy Payment\" and \"Rainfall Index Loss\" have the meanings given to those terms in the CCRIF Policy.\"Aﬀ ected Series\" means any series of Government of Barbados BBD-denominated debt securities that incorporates by reference this Natural Disaster Clause.\"CCRIF\" means CCRIF SPC (formerly, the Caribbean Catastrophe Risk Insurance Facility), or any successor thereof, with whom the Government of Barbados has entered into the CCRIF Policy.\"CCRIF Policy\" means the Parametric Insurance Contract dated 1st June, 2020 which the Government of Barbados has entered into with CCRIF to insure against risks of earthquake, tropical cyclone and excess rainfall, including any documents incorporated by reference therein and any attachments, annexes, appendices or supplements thereto (including but not limited to the applicable coverage summary and associated loss curve data spreadsheet), as such CCRIF Policy may be amended or supplemented from time to time.Schedule - (Cont'd)\f9\n\n L.R.O. 1998Natural Disaster Clause - (Concl'd)\"Deferral Claim\", in respect of an Event, has the meaning given to that term in paragraph (d) of this clause.\"Deferral Date\" means the Payment Date under the relevant series next following submission of a Deferral Claim.\"Deferred Payment Amount\" means all principal amortizations and interest payments falling due on an Aﬀ ected Series for the consecutive two-year period immediately following the Deferral Date.\"Modelled Loss\" has the meaning given to that term in the CCRIF Policy, provided that if the Modelled Loss from an Event is more than 10.0% higher than the Reference Modelled Loss, \"Modelled Loss\" for purposes of subclause (d)(iii) and the deﬁ nition of \"Deferral Date\" in this clause will be the Reference Modelled Loss.\"Payment Date\", for any Aﬀ ected Series, means the dates speciﬁ ed for the payments of interest and/or principal thereunder.\"Reference Modelled Loss\" means the Modelled Loss in respect of an Event, calculated under the CCRIF Policy as in eﬀ ect on the Closing Date, using the relevant Return Period (years) applicable to the Event. When calculating the Reference Modelled Loss, the Return Period (years) applicable to the Event, if not divisible by 5, shall be rounded down to the nearest number that is divisible by 5.\"Return Period\", in relation to years, means the return period applicable to the Event as that term is used in the model and formulae detailed in the CCRIF Policy.Schedule - (Concl'd)\f10\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2021.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2021.\n\nPresident\n\n"
}