{
  "bill_id": 561,
  "slug": "resolution-re-land-buildings-thereon-at-station-hill-former-her-majesty-prison-glendairy-to-btii",
  "title": "Resolution re Land & buildings thereon at Station Hill, former Her Majesty Prison Glendairy to BTII",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/e4306b4ad19d014ccdb982e6d858b0aa.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-08-25",
  "first_reading": "2021-09-09",
  "gazette_date": "2021-09-09",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap..225 approve the vesting in Barbados Tourism Investment Inc., a company incorporated under the Companies Act, Cap. 308, of the parcel of land the property of the Crown, situate at Station Hill in the parish of Saint Michael in this Island and more particularly described in the Schedule to this Resolution for the public purpose of tourism development.\nAPPROVED by the House of Assembly this\nday of\nTwo thousand and twenty.\nSpeaker\nAPPROVED by the Senate this\nday of\nTwo thousand and twenty.\nPresident\n:\nSCHEDULE\nALL THAT land the property of the Crown situate at Station Hill in the parish of Saint Michael in this Island containing by admeasurement 9.296 hectares, abutting and bounding on lands now or late of Irene Parris and Grace Clarke, Guy Payne, Rosalind Jones, Erskine Grant, and Grace Clarke, on a public road, on lands now or late of Gladys Codrington, Cherly Holder-Brewster, Anges Payne and Horice Alleyne, Gladys Codrington, Lawrence Pollard, Marcia Oquaye, Jerome Goodridge, Ernestine Belle, Josephine Elson, Coral Whitehall, Edward Oxley and Vernon Mason, Iris Best and Ina Best, and Isreal Cobham (Lots 9, 8 and 7), on lands now or formerly of Belle View Plantation, on lands now or late of Winifred Connell, Joseph Dottin, and Elizabeth Moore, on lands now or formerly of the estate of Dr. M. B. Proverbs, deceased, on lands now or late of Dennis Marsh, and Benny Rowe, on a road known as Glendairy Road, on lands now or late of Denrick Codrington, on lands now or formerly of the Barbados Cooperative Bank, on lands now or late of Leotta Callender, Lawrence Carrington, Sybil Alleyne, and Henry McConney and on a road known as Glendairy Gap or however else the same may abut and bound as shown and delineated on a plan certified on the 12\" day of February, 2018 by Anderson R. Alleyne, Land Surveyor and recorded in the Lands and Surveys\nDepartment on the 15\" day of February, 2018 as Plan No. 182/2018.\n| | | | | | 1 | | 1 | | | i {\n| } 1\n| | l i | 1 | { | i]\n| | } | | | ‘ ij\nADDENDUM\nThe Cabinet at its meeting held on the 4\" day of June, 2020 considered Note (2020) 500/MHLR 41 and agreed to the vesting of 9.296 hectares of Crown land comprising the former Her Majesty's Prison Glendairy together with the buildings thereon situate at Station Hill in the parish of Saint Michael in this Island and more particularly described in the Schedule to this Resolution in Barbados Tourism Investment Inc.\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 the approval of Parliament is now sought for the vesting in Barbados Tourism Investment Inc. of the parcel of land more particularly described in the Schedule to this Resolution.\n| { | | | |\n"
}