{
  "bill_id": 562,
  "slug": "remote-employment-amendment-bill-2021",
  "title": "Remote Employment (Amendment) Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/5cf546de19afb115595baf6a91211d4e.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-06-30",
  "first_reading": "2021-07-21",
  "gazette_date": "2021-07-20",
  "markdown": "2021-06-21\nOBJECTS AND REASONS\nThis Bill would amend the Remote Employment Act (Act 2020-23) to provide for the Barbados Welcome Stamp to be renewed, the fees to be paid for the renewal of the Stamp and for related matters.\nArrangement of Sections\nShort title\nAmendment of Act 2020-23\nAmendment of section 3 of Act 2020-23\nInsertion of new section 7A into Act 2020-23\nAmendment of section 9 of Act 2020-23\nAmendment of Act 2020-23\nSCHEDULE\nAPPLICATION AND RENEWAL FORM FOR BARBADOS WELCOME STAMP\nBARBADOS\nA Bill entitled\nAn Act to amend the Remote Employment Act (Act 2020-23) to provide for the Barbados Welcome Stamp to be renewed and the fees to be paid for the renewal of the Stamp and for related matters.\nENACTED by the Parliament of Barbados as follows:\nShort title\n1. This Act may be cited as the Remote Employment (Amendment) Act, 2021.\nAmendment of Act 2020-23\n2. The Remote Employment Act (Act 2020-23) in this Act referred to as the principal Act is amended by deleting section 2 and substituting the following:\n“Definitions\n25 For the purposes of this Act,\n“Barbados Welcome Stamp” or “Stamp” means a visa granted by the Chief Immigration Officer with the approval of the Minister to a person to whom this Act applies;\n“Minister” means the Minister responsible for Immigration;\n“non-national” means a person who is not a citizen of Barbados.”.\nAmendment of section 3 of Act 2020-23\n3. Section 3 of the principal Act is amended by deleting the words “responsible for Immigration” appearing immediately after the word “Minister”.\nInsertion of new section 7A into Act 2020-23\n4, The principal Act is amended by inserting the following new section immediately after section 7:\n“Renewal of Barbados Welcome Stamp\n7A.(1) Notwithstanding section 5, an individual to whom a Barbados Welcome Stamp has been granted, may renew that Stamp by submitting an application to the Minister in the Form set out in the Schedule.\n(2) The Minister may approve the renewal of the Stamp if the individual to whom the Stamp was granted satisfies the conditions specified in section 3.\n(3) Where the Minister approves the renewal of the Stamp, the fee for the Stamp shall be\n(a) $3000 in the case of an individual; and\n(6) $4500 where the individual is accompanied by his family.\n(4) Where the Minister approves the renewal of the stamp under subsection (3), the Stamp shall be valid for a period of 12 months.”.\nAmendment of section 9 of Act 2020-23\n5, Section 9 of the principal Act is amended by deleting the words “responsible for Immigration” appearing immediately after the word “Minister”.\nAmendment of Act 2020-23\n6. The principal Act is amended by deleting the Schedule and substituting the following:\n\"SCHEDULE\n(Sections 3 and 7A)\n\nRemote Employment Act, 2020 (Act 2020-23)\nAPPLICATION AND RENEWAL FORM FOR BARBADOS WELCOME STAMP\nApplicants wishing to apply for or renew the Barbados Welcome Stamp are required to complete and submit the following documents electronically:\n* Bio data page of passport (self/spouse/partner/children/dependant)\nBirth certificate (self/spouse/partner/children/dependant)\n+\n+ Proof of relationship of dependants (birth certificate, marriage certificate, adoption documents)\n* Entry visa (where applicable)\nOn approval the following non-refundable fees are applicable:\nFor first time issue of Stamp\n* Individual Fee - BDS $4,000.00\n* Family Fee - BDS $6,000.00\nFor renewal of Stamp\n* Individual Fee - BDS $3,000.00\n* Family Fee - BDS $4,500.00\nSchedule - (Cont'd)\n1. Personal Information\nName (Mr.*/Mrs.*/Miss*): First Name Middle Name Last Name Sex: 1] Male (1 Female Marital Status: [ Single 1] Married [1 Divorced [1 Widowed Date of Birthy__ «City Of Birth Month/Day/Year Country Country of citizenship: N F Count Name 0; ountry Former nationality (if applicable): Nanna ationality Email address: Email address Name of Employer: Employer's Name\nBrief description of type of work/nature of business in which applicant will be engaged:\nSchedule - (Cont'd)\n2. Contact Information\nPermanent Address:\nStreet Address:\nCity:\nState/Province/Region:\nZip/Postal Code:_________ Country:\nEmail address:\nTelephone No.:\n(Area code)-(Telephone number)\nEmergency Contact:——__________\nFull Name\n3. Passport Details\nPassport Number:\nDate of Issue:_____ sé atte: off Expiry:\nMonth/Day/Year\nMonth/Day/Year\nPlace of Issue:\nCouniry\nProposed date of entry into Barbados:\nMonth/Day/Year\nSchedule - (Cont'd)\n4. Spouse/Partner Information (if applicable)\nName of Spouse/Partner (Mr.*/Mrs.*/Miss*): First Name Middle Name Last Name Sex: [] Male [] Female Date of Birth: ______LLL__ Country of Birth: Month/Day/Year Country Country of citizenship: Name of Count le O, ountry Former nationality (if applicable): National ationatl Passport Number:\n5. Dependants information (if applicable)\nIs there any person(s) in the family group that would be defined as a dependant?\nOl Yes [1 No\n(see definition in General Information — Definition of Terms )\nPassport Country of Citizenship\n10\nSchedule - (Cont'd)\nWill dependants be attending school in Barbados? O Yes [INo\nIf \"Yes\" choose\n(1 Public school (link to student visa application)\n1 Private school (link to student visa application)\nC1 Home school\nHave you ever been convicted of a serious criminal offence? [] Yes Ol No\n6. Declaration\nThereby declare that I, my spouse, partner or dependants will not accept any employment from or offer any services to a citizen, permanent resident, immigrant, work permit holder or any person or entitiy carrying on business in Barbados.\nI certify that I expect to earn an income of $100 000 or more over the next 12 months and that I have the means to support myself, my spouse, partner and dependants accompanying me, during my stay in Barbados.\nI hereby certify that the information given by me in this application is true and correct to the best of my knowledge. I understand and agree that any false information, misrepresentation, or omission of facts in this application and the application process, may be justification for refusal of the grant of a Barbados Welcome Stamp.\nSignature:____ date of Submission: ——_______\nMonth/Day/Year\nSignature\n11\nSchedule - (Concl'd)\nINSTRUCTIONS\nDEFINITION OF TERMS\nApplicant: Individual who will be engaging in remote work in Barbados.\nFamily: Applicant, spouse, partner and dependant(s).\nDependant:\n(a) achild or step-child under the age of 26 years;\n(b) any other relative who is, by reason of age or any infirmity of body or mind, wholly dependent on that person for his/her subsistence.\nDuration of Stay: Maximum 12 months from date of approval.\".\n"
}