{
  "bill_id": 564,
  "slug": "defence-amendment-act-2021",
  "title": "Defence (Amendment) Act 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/cd9dc05292e244937d4ce555d484c714.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-07-20",
  "first_reading": "2021-07-21",
  "gazette_date": "2021-07-08",
  "markdown": "2021-07-05\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Defence Act, Cap. 159 to broaden the officer corps\nand  make  use  of  the  expertise  of  retired  officers  and  to  provide  for  related\nmatters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nAmendment of Cap. 159\n\nValidation\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Defence Act, Cap. 159 to broaden the officer corps and\nmake use of the expertise of retired officers and to provide for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Defence (Amendment) Act, 2021.\n\n\f4\n\nAmendment of Cap. 159\n\n2.\nafter section 169 the following new section:\n\nThe  Defence  Act,  Cap.  159  is  amended  by  inserting  immediately\n\n“Command of Force during the exigencies of service\n\n169A.(1)\nNotwithstanding  section  169  or  any  enactment  to  the\ncontrary, the Governor-General, acting in accordance with the advice\nof the Defence Board, may appoint, where the exigencies of the service\nso require, a retired officer of the Barbados Defence Force\n\n(a)\n\n(b)\n\nwho held the rank of Lieutenant Colonel or the equivalent\nNaval or Air Force rank; and\n\nwho is over the age of 55 years but has not attained the age\nof 65 years\n\nin whom the command of the Barbados Defence Force will be vested,\nand, subject to the terms of his appointment, that officer has command\nof the Force during the pleasure of the Governor-General.\n\nThe Governor-General may confer on an officer referred to in\n\n(2)\nsubsection (1) such rank as the Defence Board recommends.”.\n\nValidation\n\n3.\nThe continuance in office of any officer or soldier of the Barbados\nDefence Force, or the appointment of such an officer or soldier to any office,\nbefore the commencement of this Act, contrary to the provisions of the Defence\nAct, Cap. 159, the Defence (Officers) Regulations, 1979 (S.I. 1979 No. 162) or\n\n\f5\n\nthe Defence (Barbados Defence Force Reserve) Regulations, 1981 (S.I. 1981 No.\n48)\n\n(a)\n\n(b)\n\nafter  such  officer  or  soldier  had  retired  from  the  Barbados  Defence\nForce; or\n\nafter such officer or soldier had ceased to be a member of the second\nclass of the Barbados Defence Force Reserve,\n\nshall be deemed to have been lawful and valid; and any function performed by\nsuch an officer or soldier before the commencement of this Act shall be deemed\nto have been lawfully and validly performed.\n\n"
}