{
  "bill_id": 565,
  "slug": "constitution-amendment-bill-2021",
  "title": "Constitution (Amendment) Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/d0ae5f31adf5fcde8529b0fa3ac803b2.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-07-27",
  "first_reading": "2021-07-28",
  "gazette_date": "2021-07-22",
  "markdown": "2021-07-19\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Constitution to make provision for the performance\n\nof the functions of the Prime Minister and other Ministers in certain events.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of section 29 of the Constitution\n\nAmendment of section 67 of the Constitution\n\nAmendment of section 68 of the Constitution\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Constitution of Barbados to make provision for the\n\nfunctions of the Prime Minister and other Ministers in certain events.\n\nENACTED by the Parliament of Barbados in accordance with the provisions\n\nof section 49 of the Constitution as follows:\n\n\f4\n\nShort title\n\n1.\n\nThis Act may be cited as the Constitution (Amendment) Act, 2021.\n\nAmendment of section 29 of the Constitution\n\n2.\nimmediately after the word Barbados, the words “or is on vacation leave”.\n\nSection  29(1)  of  the  Constitution  is  amended  by  inserting\n\nAmendment of section 67 of the Constitution\n\n3.\nand substituting the following:\n\nSection 67 of the Constitution is amended by deleting subsection (1)\n\n“(1)\n\nWhenever the Prime Minister is unable, by reason of his\n\n(a)\n\n(b)\n\nillness or absence from Barbados; or\n\nabsence from office on vacation leave\n\nto perform the functions of his office, the Governor-General may, by\ninstrument under the Public Seal, authorise any other Minister who is\na member of the House of Assembly to perform the functions conferred\non  the  Prime  Minister  by  this  Constitution  (other  than  the  functions\nconferred by subsection (3)).”.\n\nAmendment of section 68 of the Constitution\n\n4.\n(1) and substituting the following:\n\nSection 68(1) of the Constitution is amended by deleting subsection\n\nWhenever a Minister, other than the Prime Minister, is unable by\n\n“(1)\nreason of his\n\n(a)\n\n(b)\n\nillness or absence from Barbados; or\n\nabsence from office on vacation leave,\n\n\f5\n\nto perform the functions of his office, the Governor-General may, by\ninstrument under the Public Seal, appoint a member of the Senate or\nthe House of Assembly to act as Minister and authorise him to perform\nthe functions of the office of the absent Minister, or assign the functions\nof the office of the absent Minister to another Minister and authorise\nthe other Minister to perform the functions of the office of the absent\nMinister:\n\nProvided that this subsection shall have effect in relation to any\nperiod between a dissolution of Parliament and the day on which the\nnext  election  of  members  of  the  House  of  Assembly  is  held  as  if\nParliament had not been dissolved.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2021.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2021.\n\nPresident\n\n"
}