{
  "bill_id": 566,
  "slug": "governorgeneral-conditions-of-service-amendment-bill-2021",
  "title": "Governor-General (Conditions of Service) (Amendment) Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/8962bcde547477f79247d35e1e3cbdfc.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-07-27",
  "first_reading": "2021-07-28",
  "gazette_date": "2021-07-22",
  "markdown": "2021-07-19\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Governor-General  (Conditions  of  Service)  Act,\n\nCap. 6.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\nShort title\n\nInsertion of new section 14A into Cap. 6\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  amend  the  Governor-General  (Conditions  of  Service)  Act,\n\nCap. 6.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nService) (Amendment) Act, 2021.\n\nThis  Act  may  be  cited  as  the  Governor-General  (Conditions  of\n\nInsertion of new section 14A into Cap. 6\n\nThe  Governor-General  (Conditions  of  Service)  Act,  Cap.  6  is\n2.\namended by inserting immediately after section 14 the following new section:\n\n“Vacation leave\n\n14A.(1)\nannually.\n\nThe Governor-General is entitled to 4 weeks’ vacation leave\n\nThe annual vacation leave may be given and taken in one period\n\n(2)\nor more, if the Governor-General and the Prime Minister so agree.\n\nSubject  to  the  approval  of  the  Prime  Minister  and  under  such\n(3)\nconditions as the Prime Minister specifies, the Governor-General may\nspend his vacation leave within or outside Barbados.\n\nWhere the Governor-General wishes to spend his vacation leave\n(4)\noutside Barbados he is entitled to the payment of leave passage at first\nclass rates for himself, his spouse and eligible children to any place\noutside Barbados.\n\nWhere the Governor-General wishes to spend his vacation leave\n(5)\nwithin Barbados, he is entitled to the payment of accommodation for\nhimself, his spouse and eligible children at such rates as befit the office.\n\nSection 29 of the Constitution applies whenever the Governor-\n\n(6)\nGeneral is absent from office on vacation leave.”.\n\n"
}