{
  "bill_id": 567,
  "slug": "ministers-and-parliamentary-secretaries-conditions-of-service-amendment-bill-2021",
  "title": "Ministers and Parliamentary Secretaries (Conditions of Service) (Amendment) Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/cf5d12c102adf48b53c1205f80b1f842.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-07-27",
  "first_reading": "2021-07-28",
  "gazette_date": "2021-07-22",
  "markdown": "2021-07-19\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Ministers  and  Parliamentary  Secretaries\n\n(Remuneration and Allowances) Act, Cap. 8.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of long title of Cap. 8\n\nAmendment of short title of Cap. 8\n\nInsertion of new section 4A into Cap. 8\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act\n\nto  amend\n\nthe  Ministers  and  Parliamentary  Secretaries\n\n(Remuneration and Allowances) Act, Cap. 8.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Remuneration and Allowances) (Amendment) Act, 2021.\n\nThis Act may be cited as the Ministers and Parliamentary Secretaries\n\nAmendment of long title of Cap. 8\n\nThe Ministers and Parliamentary Secretaries (Remuneration and\n2.\nAllowances) Act, Cap. 8, in this Act referred to as the principal Act, is amended\nby deleting the long title and substituting the following:\n\n“An Act to revise the conditions of service for Ministers and\n\nParliamentary Secretaries.”.\n\nAmendment of short title of Cap. 8\n\n3.\nsubstituting the following:\n\nThe  principal  Act  is  amended  by  deleting  the  short  title  and\n\n“Short title\n\n1.\nSecretaries (Conditions of Service) Act, 2021.”.\n\nThis Act may be cited as the Ministers and Parliamentary\n\nInsertion of new section 4A into Cap. 8\n\n4.\n4 the following new section:\n\nThe principal Act is amended by inserting immediately after section\n\n\f5\n\n“Vacation leave\n\n4A.(1)\nThe holder of an office set out in column 1 of the Schedule\nis entitled to 4 weeks’ paid vacation leave annually for every complete\nyear of service.\n\nThe annual vacation leave of a Minister, other than the Prime\n(2)\nMinister, may be given and taken in one period or more, if the Prime\nMinister and the other Minister so agree.\n\nWhenever the Prime Minister wishes to be granted vacation leave\n(3)\nhe shall make application in writing to the Governor-General setting\nout the date of commencement and termination of the period of leave.\n\nThe Prime Minister’s annual vacation leave may be given and\n(4)\ntaken  in  one  period  or  more,  if  the  Prime  Minister  and  Governor-\nGeneral so agree.\n\nWhenever the Prime Minister is on vacation leave section 67 of\n\n(5)\nthe Constitution shall apply.\n\nThe  person  referred  to  in  subsection  (1),  other  than  the  Prime\n(6)\nMinister,  who  wishes  to  be  granted  vacation  leave  shall  make\napplication  in  writing  to  the  Prime  Minister  setting  out  the  date  of\ncommencement and termination of the period of leave.\n\nWhenever the person referred to in subsection (2) is absent from\n\n(7)\noffice on vacation leave section 68 of the Constitution shall apply.”.\n\n"
}