{
  "bill_id": 568,
  "slug": "corporate-miscellaneous-provisions-bill-2021",
  "title": "Corporate Miscellaneous Provisions Bill 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/58e2060ee9e92fb3d4cd9cfe5022db99.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-08-10",
  "first_reading": "2021-08-10",
  "gazette_date": "2021-08-18",
  "markdown": "2021-07-19\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  certain  enactments  relating  to  corporate  bodies\n\nprimarily to strengthen the regulatory framework for such bodies.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\nShort title\n\nAmendment of enactments in Schedule\n\nSCHEDULE\n\nAmendments\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend certain enactments relating to corporate bodies primarily\n\nto strengthen the regulatory framework for such bodies.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nAct, 2021.\n\nThis Act may be cited as the Corporate (Miscellaneous Provisions)\n\nAmendment of enactments in Schedule\n\n2.\nthe manner specified in Column 2.\n\nThe enactments set out in Column 1 of the Schedule are amended in\n\n\f5\n\n L.R.O. 1998SCHEDULE(Section 2)AMENDMENTSColumn 1Enactments1. Corporate Affairs and Intellectual Property Oﬃ  ce Act, Cap. 21A2. Companies Act, Cap. 308Column 2AmendmentsDelete section 4(2) and substitute the following: \"(2) The following persons shall have the rights and discharge the duties appertaining to the oﬃ  ce of Notary Public:  (a) Registrar;(b) Deputy Registrar;(c) Assistant Registrar;(d) Legal Examiner; and(e) Legal Oﬃ  cer.\".1. In section 4,(a) delete subsection (1) and substitute the following:  \"(1) Subject to subsection (2), one or more persons may incorporate a company bysigning and sending articles of incorporationto the Registrar together with a statutorydeclaration by each signatory to the articlesthat he is not an individual described insubsection (2).\"; and\f6\n\n L.R.O. 1998Column 1Enactments2. Companies Act, Cap. 308 - (Cont'd)Column 2Amendments(b) delete subsection (3) and substitute the following: \"(3) The statutory declaration referred to in subsection (1) is, for the purposes of this Act, conclusive of the facts therein declared. (4) An incorporator who makes a false declaration under this section is guilty ofan oﬀ ence and is liable on summary convictionto a ﬁ ne of $10 000 or to imprisonment for aterm of 2 years or to both.\".2. Delete section 15A(3) and substitute the following: \"(3) A company that is in default incomplying with the requirements of subsections(1) and (2) is liable to pay to the Registrar a penalty of $10 for every day during which the default continues, up to a maximum of $3 000; and every director and oﬃ  cer of the company who knowingly and wilfully authorises or permits the default is also liable to that penalty.\".3. Delete section 25(1) and substitute the following: \"(1) A company may have a commonseal with its name engraved thereon inlegible characters but may use any form ofseal for the purpose of sealing a document.\".AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f7\n\n L.R.O. 1998Column 1Enactments2. Companies Act, Cap. 308 - (Cont'd)Column 2Amendments4. In section 103, insert after subsection (3), the following: \"(4) Notwithstanding subsection (1),a meeting of shareholders of a company maybe held virtually. (5) For the avoidance of doubt, where ameeting is held virtually, the location,whether within or outside Barbados, of any participant in the meeting shallnot render the meeting unlawful. (6) Where a meeting of shareholders ofa company was held virtually during the periodfrom 1st March, 2020 to the commencementof subsections (4) and (5), the meeting shallnot be rendered unlawful on the ground it washeld virtually. \".5. Insert after section 170, the following section:\"Notiﬁ cation of change in beneﬁ cial ownership 170A. (1) A director of a company shall,within 14 days of a change in the beneficial ownership of the company, notify the Registrarof the change and the date on which the changeoccurred. AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f8\n\n L.R.O. 1998Column 1Enactments2. Companies Act, Cap. 308 - (Cont'd)Column 2Amendments (2) The notification referred to in subsection (1) shall be accompanied by a statutory declaration that(a) veriﬁ es the change; and(b) confirms the fact that the company continues to maintain an up to date and accurate record of the basic and beneficial ownership information of the company at its registered office. (3) A company which fails to complywith subsections (1) and (2) is liable to pay tothe Registrar a penalty of $500 for every dayduring which the failure continues, up to amaximum of $10 000; and every director andofficer of the company who knowingly andwillfully authorises or permits the default isalso liable to that penalty.\". 6. In section 175,(a) in subsection (7)(i) delete the word \"require\" and substitute the word \"direct\"; and(ii) in paragraph (b), delete the words \"and contain, or are likely to contain such information.\". AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f9\n\n L.R.O. 1998Column 1Enactments2. Companies Act, Cap. 308 - (Cont'd)Column 2Amendments(b) delete subsection (12) and substitute the following: \"(12) A person who,without reasonable cause, is in default in complying with a requirement or a directive undersubsection (5), (6) or (7) or a direction under subsection (10) is liable to pay to the Registrar(a) a penalty of $5 000; and(b) where the penalty specified in paragraph (a) is not paid on the due date, an additional penalty of $500 for every day during which the default continues, up to a maximum of $15 000. (12A) For the purposes of subsection (12), a person is not in default in complying with a requirement, directive or direction under this section until a period of 14 days has elapsed since notice of the requirement, directive or direction was served on him.\"; and(c) in subsection (13) delete the words \"or a\" and  substitute the words \", directive or\".  AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f10\n\n L.R.O. 1998Column 1Enactments2. Companies Act, Cap. 308 - (Cont'd)Column 2Amendments7. Delete section 175A and substitute the following:\"Contravention of record keeping requirements 175A. A person who contravenes section 170(1),  (2) or (3) or section 172(1), (2) or (3) is guiltyof an oﬀ ence and is liable on summary convictionto a ﬁ ne of $100 000 or to imprisonment for aterm of 5 years or to both.\".8. In section 330(1),(a) in paragraph (l), delete the word \"and\";(b) in paragraph (m), delete the fullstop and substitute the words \"; and\"; and(c) insert after paragraph (m), the following:\"(n) the full name of any director who holds or has held a prominent public office in Barbados or elsewhere.”.9. Insert after section 392A(2), the following: \"(3) A company that appoints a service provider shall, within 14 days of the date of the appointment, notify the Registrar of the full name and address of the service provider.AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f11\n\n L.R.O. 1998Column 1Enactments2. Companies Act, Cap. 308 - (Cont'd)Column 2Amendments (4) A company that changes itsappointed service provider shall, within 28 days of the date of the appointment of the new service provider, notify the Registrar of the full name and address of the new service provider. (5) A notification given undersubsection (3) or (4) shall be accompanied bya statutory declaration verifying theappointment of the service provider. (6) A company that is in default of complying with the requirements of subsection(3), (4) or (5) is liable to pay to the Registrar a penalty of $10 for every day during which the default continues, up to a maximum of $3 000; and every director and officer of the company who knowingly and wilfully authorises or permits the default is also liable to that penalty.\".10. Delete section 414 and substitute the following:\"Service on company 414. (1) A notice or document may be served on a company by     (a) leaving it at the registered oﬃ  ce of the company;AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f12\n\n L.R.O. 1998Column 1Enactments2. Companies Act, Cap. 308 - (Cont'd)Column 2Amendments   (b) sending it by telex, fax, prepaid, post or cable addressed to the registered oﬃ  ce of the company;(c) serving it personally on an oﬃ  cer or manager of the company at any place of business of the company; or(d) serving it personally on any director, oﬃ  cer, receiver, receiver-manager or liquidator of the company. (2) Notwithstanding subsection (1), the Registrar may apply to the court for an order to serve by a speciﬁ ed method not referred to in that subsection. (3) An application for an order to serve by a speciﬁ ed method must be supported by evidence on aﬃ  davit(a) specifying the method of service proposed; and(b) showing that that method of service is likely to bring the document to the attention of the company being served, and to enable it to ascertain the contents of the notice.\".AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f13\n\n L.R.O. 1998Column 1Enactments2. Companies Act, Cap. 308 - (Cont'd)Column 2Amendments    11. In section 432(1), delete the words \"$10 000 or to  imprisonment for a term of 6 months\" and substitute the words \"$20 000 or to imprisonment for a term of 2 years\".12. In section 434,(a) delete subsection (2) and substitute the following: \"(2) Where a company is guilty of an oﬀ enceunder subsection (1), any director or oﬃ  cer of the company who knowingly authorised, acquiescedin or permitted the contravention is also guilty of an oﬀ ence and is liable on summary convictionto a ﬁ ne of $5 000 or to imprisonment for aterm of 12 months or to both.\"; and(b) delete subsection (4) and substitute the following: \"(4) Where a company is guilty of an oﬀ enceunder subsection (3), any director or oﬃ  cer of the company who knowingly authorised, acquiescedin or permitted the contravention is also guilty of an oﬀ ence and is liable on summaryconviction to a ﬁ ne of $5 000 or to imprisonmentfor a term of 12 months or to both.\".AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f14\n\n L.R.O. 1998Column 1Enactments2. Companies Act, Cap. 308 - (Concl'd)3. Industrial Designs Act,  Cap. 309AColumn 2Amendments13. Insert after section 453, the following new section:\"Extension of time 454. (1) Where in section 15A(2)(a), 74(1), 179A(4A), 237(1A), 316(3), 342(1) or 343(1) a time limit is provided for the doing of anything and the time limit could not be complied with as a result of exceptional circumstancesrelating to public health, national security or a natural or other disaster, the Minister may by order extend the time limit for such period as he thinks ﬁ t. (2) An order made under this section may be given retrospective eﬀ ect.\".Insert after section 48 the following:\"Extension of time 48A. (1) Where the time limit speciﬁ edin(a) section 16(2) relating to furnishing the Registrar with a copy of the earlier application; or  AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f15\n\n L.R.O. 1998Column 1Enactments3.Industrial Designs Act,Cap. 309A - (Concl'd)4.Patents Act, Cap. 314Column 2Amendments(b)section 26(2) relating to thepayment of the prescribed fee torenew a previous registration,could not be complied with as a result of exceptional circumstances relating to public health, national security or a natural or otherdisaster, the Minister may by order extend the time limit for such period as he thinks ﬁ t.(2)An order made under this section maybe given retrospective eﬀ ect.(3)An extension of time granted byan order made under this section does not aﬀ ectthe right of any party.\".Insert after section 73 the following:\"Extension of time 73A. (1) Where the time limit speciﬁ ed in(a)section 29(3) relating to the graceperiod for the late payment of theannual fee on payment of theprescribed surcharge; orAMENDMENTS - (Cont'd)Schedule - (Cont'd)\f16\n\n L.R.O. 1998Column 1Enactments4. Patents Act, Cap. 314  - (Concl'd)5. Societies with Restricted Liability Act, Cap. 318BColumn 2Amendments (b) section 41(1) relating to the filing of an international application designating Barbados,could not be complied with as a result of exceptionalcircumstances relating to public health, nationalsecurity or a natural or other disaster, theMinister may by order extend the time limitfor such period as he thinks ﬁ t. (2) An order made under this sectionmay be given retrospective eﬀ ect. (3) An extension of time granted by anorder made under this section does not aﬀ ectthe right of any party.\". 1. Delete section 24 and substitute the following:\"Records 24. A society shall prepare and maintain at its registered oﬃ  ce(a) its articles and by-laws and any amendments thereto;(b) minutes of its meetings and records of the resolutions of members; andAMENDMENTS - (Cont'd)Schedule - (Cont'd)\f17\n\n L.R.O. 1998Column 15. Societies with Restricted Liability Act, Cap. 318B  - (Cont'd) Column 2Amendments(c) a register of members showing(i) the name and latest known address of each member and whether the person holds or has held a prominent public oﬃ  ce in Barbados or elsewhere;(ii) a statement of the contribution of each member to the capital of the society;(iii) the date on which each person was entered on the register as a member, and the date on which any person ceased to be a member; and(iv) an up to date and accurate record of the basic and beneficial  ownership information of the society.AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f18\n\n L.R.O. 1998Column 1Enactments5. Societies with Restricted Liability Act, Cap. 318B  - (Cont'd)Column 2AmendmentsNotiﬁ cation of change in beneﬁ cial ownership 24A. (1) A manager of a society shall, within 14 days of a change in the beneficialownership of the society, notify the Registrar of the change and the date on which the change occurred. (2) The notification referred to insubsection (1) shall be accompanied by astatutory declaration that(a) veriﬁ es the change; and(b) confirms the fact that the society  continues to maintain an up to date and accurate record of the basic and beneﬁ cial ownership information of the society at its registered oﬃ  ce. (3) A society which fails to comply with subsections (1) and (2) is liable to pay to the Registrar a penalty of $500, for every day duringwhich the failure continues, up to a maximum of$10 000; and every manager and oﬃ  cer of the society who knowingly and willfully authorises or permits the default is also liable to that penalty.\".AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f19\n\n L.R.O. 1998Column 1Enactments5. Societies with Restricted Liability Act, Cap. 318B - (Cont'd)Column 2Amendments2. In section 29,(a) delete subsection (3) and substitute the following: \"(3) The creditors of a society and their agents and legal representatives may, during the usual business hours of the society, with the consent, in writing, of the managers, or as the case may be, any 2 members, and upon payment of a reasonable fee, examine therecords referred to in section 24(a) and (c).\";(b) in subsection (4), delete the word \"person\" and substitute the words \"creditor, agent or legal  representative referred to in that subsection\"; and(c) insert after subsection (6), the following: \"(7) The Registrar may require a society toproduce(a) any of the books, records or documents required to be kept by the society under this Act; and(b) such other information as the Registrar may require for the proper administration and enforcement of this Act.AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f20\n\n L.R.O. 1998Column 1Enactments5. Societies with Restricted Liability Act, Cap. 318B - (Cont'd)Column 2Amendments (8) Notwithstanding subsection (3), the Registrar may examine, or by instrument in writing, appoint, at the expense of a society,a person to examine, any books, records and other documents required to be kept by the society under this Act(a) in order to ascertain whether the society is in compliance with this Act;(b) where the Registrar has reasonable grounds to suspect that the society may be in contravention of this Act; or (c) where the examination is otherwise necessary for the proper administration and enforcement of this Act. (9) For the purposes of subsection (8), the Registrar or the person appointed by the Registrar may, in connection with an examination, direct an auditor, manager, oﬃ  cer or aﬃ  liate of a society or a person who, whether alone or in associationwith others, owns or controls the society to(a) furnish such information as the Registrar or the person appointed by him considers necessary for the purposes of the examination; andAMENDMENTS - (Cont'd)Schedule - (Cont'd)\f21\n\n L.R.O. 1998Column 1Enactments5. Societies with Restricted Liability Act, Cap. 318B - (Cont'd)Column 2Amendments(b) produce for examination any books, records or other documents in respect of the society that are in his possession.  (10) The Registrar may require a society to pay the expenses of any examination carried out by or on behalf of the Registrar under this section.  (11) A person who is required to make adisclosure to the Registrar or to a person appointedby the Registrar pursuant to subsection (9) shall not, by reason of making the disclosure, beregarded as being in breach of a duty to thesociety. (12) The Registrar may give directions to asociety for the purpose of compliance withthis section. (13) Where a society fails to pay the expenses referred to in subsection (10), the expenses may be recovered as a debt due to the Government of Barbados before a magistrate for District 'A'. (14) A person who, without reasonablecause, is in default in complying with arequirement or a directive under subsection (7), (8) or (9) or a direction under subsection (12) is liable to pay to the Registrar(a) a penalty of $5 000; andAMENDMENTS - (Cont'd)Schedule - (Cont'd)\f22\n\n L.R.O. 1998Column 1Enactments5. Societies with Restricted Liability Act, Cap. 318B - (Cont'd)Column 2Amendments(b) where the penalty specified in  paragraph (a) is not paid on the due date, an additional penalty of $500 for every day during which the default  continues, up to a maximum of  $15 000. (15) For the purposes of subsection (14), a person is not in default in complying with a  requirement, directive or direction under this section until a period of 14 days has elapsed sincenotice of the requirement, directive or direction was served on him.  (16) A person who, without reasonable cause, continues to be in default in complying with a requirement, directive or a direction referred to in subsection (14) after the maximum additional penalty referred to in that subsection becomes payable, is guilty of an oﬀ ence and liable, on summary conviction, to a ﬁ ne of $100 000 or to imprisonment for a term of 5 years or to both. (17) Where an oﬀ ence under subsection(16) is committed by a society and a manageror oﬃ  cer of that society knowingly authorised,permitted or acquiesced in the commissionof the oﬀ ence, the manager or oﬃ  cer is also guilty of the offence and liable on summaryconviction, to a fine of $100 000 or toimprisonment for a term of 5 years or to both.”.AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f23\n\n L.R.O. 1998Column 1Enactments5. Societies with Restricted Liability Act, Cap. 318B - (Cont'd)Column 2Amendments3. In Part V, delete section 29A and substitute the following:\"Contravention of record keeping requirements  29.1.  A person who contravenes section 24 or 26 is guilty of an oﬀ ence and is liable on summary conviction to a ﬁ ne of $100 000 or to imprisonment for a term of 5 years or to both.\".4. Insert after Part VI, the following:\"PART VIASOCIETIES REQUIRING SERVICE PROVIDERSCertain societies to have service providers 38A. (1) Any society that has a grossrevenue or holds assets which exceed $1 000 000and (a) does not hold a licence under the Financial Institutions Act, Cap. 324A;(b) is not registered or licensed under the Financial Services Commission Act, 2020 (Act 2020-21); and(c) is not itself a service provider who holds a licence under the Corporate and Trust Service Providers Act, 2015 (Act 2015-12),shall have its corporate services performed by a service provider who holds a licence issuedunder the Corporate and Trust ServiceProviders Act, 2015 (Act 2015-12). AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f24\n\n L.R.O. 1998Column 1Enactments5. Societies with Restricted Liability Act, Cap. 318B - (Concl'd)Column 2Amendments (2) A society that appoints a service provider shall, within 14 days of the date of the appointment, notify the Registrar of the full name and address of the service provider. (3) A society that changes its appointedservice provider shall, within 28 days of the date of the appointment of the new service provider, notify the Registrar of the full name and address of the new service provider. (4) A society which fails to comply with this section is liable to pay to the Registrar a penalty of $10 for every day during which the default continues, up to a maximum of $3 000; and every manager and oﬃ  cer of the society who knowingly and wilfully authorises or permits the default is also liable to that penalty. (5) A notification given undersubsection (2) or (3) shall be accompaniedby a statutory declaration verifying theappointment of the service provider. (6) In this section, \"corporate service\"has the meaning assigned to it by section2 of the Corporate and Trust ServiceProviders Act, 2015 (Act 2015-12).\".AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f25\n\n L.R.O. 1998Column 1Enactments6. Trademarks Act, Cap. 319 Column 2AmendmentsInsert after section 55 the following:\"Extension of time 55A. (1) Where the time speciﬁ ed in (a) section 12(2) relating to furnishing the Registrar with a copy of an earlier application; or(b) section 27(3) relating to an application for renewal of the registration of a mark,could not be complied with as a result of exceptional circumstances relating to a public health, national security or a natural or other disaster, the Minister may by order extend the time limit for such period as he thinks ﬁ t. (2) An order made under this section may be given retrospective eﬀ ect. (3) An extension of time granted by an order made under this section does not aﬀ ect the right of any party.\".AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f26\n\n L.R.O. 1998Column 1Enactments7. Companies Regulations, 1984 (S.I 1984 No. 29)Column 2Amendments1. In the Third Schedule,(a) in Form 28,(i) delete paragraph 7 and substitute the following:\"7. The Directors of the Company are:(a) Full Name:(b) Residential address:(c) Occupation:(d) Holder of a prominent public oﬃ  ce:Yes NoIf yes, state name of oﬃ  ce:  \"; andAMENDMENTS - (Cont'd)Schedule - (Cont'd)\f27\n\n L.R.O. 1998Column 1Enactments7. Companies Regulations, 1984 (S.I 1984 No. 29)  - (Cont'd)Column 2Amendments(ii) in the instructions, delete item 7 and substitute the following:\"Item 7:With respect to each director, set out the ﬁ rst given name, initial and family name, fullresidential address and occupation. Also specify whether each director holds or has held a prominentpublic oﬃ  ce in Barbados or elsewhere, and ifso provide details of the oﬃ  ce.\";(b) in Form 31, insert after paragraph 6, the following:\"7. (a) During the period to which this Annual  Return refers did any director  or beneﬁ cial owner hold a prominent  public oﬃ  ce in Barbados?  Yes No  If yes, state name of oﬃ  ce: AMENDMENTS - (Cont'd)Schedule - (Cont'd)\f28\n\n L.R.O. 1998Column 1Enactments7. Companies Regulations, 1984 (S.I 1984 No. 29)  - (Concl'd) Column 2Amendments (b) During the period to which this Annual  Return refers did any director  or beneficial owner or affiliate of such a person hold a prominent public oﬃ  ce in any other country?  Yes No   If yes, state name of oﬃ  ce:   \"; and(c) in Form 35, delete paragraph 13 and substitute the following:\"13. I certify that the Company has maintained at its registered office the records pertaining to the Company including the records pertaining to beneficial ownership in accordance with sections 170 to 172 of the Companies Act. I also certify that notification of any change in beneficial ownership was submitted to the Registrar in accordance with section 170A of the Companies Act and that all beneficial ownership information maintained at the registered oﬃ  ce has been veriﬁ ed by a director.\".AMENDMENTS - (Concl'd)Schedule - (Concl'd)\f29\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2021.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2021.\n\nPresident\n\n"
}