{
  "bill_id": 56,
  "slug": "prisons-amendment-bill-2014",
  "title": "Prisons (Amendment) Bill, 2014",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/8cb152b9a2f4a3b86e665919b65362ae.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2014-12-03",
  "first_reading": "2014-12-10",
  "second_reading": "2014-12-02",
  "gazette_date": "2015-01-05",
  "passed_date": "2015-01-16",
  "markdown": "2014-09-01\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Prisons Act, Cap. 168 to make provision for\n\n(a)\n\n(b)\n\n(c)\n\nthe abolition of the use of corporal punishment in prisons;\n\nthe establishment of a Prisoners Release Board;\n\nthe conditional release of prisoners; and\n\n(d)\n\nmatters related to (b) and (c).\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 168\n\nRepeal of section 40 of Cap. 168\n\nInsertion of new Part IIIA into Cap. 168\n\nRepeal and replacement of Part VIII of Cap. 168\n\nAmendment of the Schedule to Cap. 168\n\nAmendment of Cap. 168\n\nCommencement\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nFIRST SCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Prisons Act, Cap. 168.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Prisons (Amendment) Act, 2014.\n\n\f4\n\nAmendment of section 2 of Cap. 168\n\n2.\nAct, is amended by inserting in alphabetical order, the following definition:\n\nSection 2 of the Prisons Act, in this Act referred to as the principal\n\n“  “Prisoners  Release  Board”  or  “Release  Board”  means  the  Board\n\nappointed by the Minister under section 9A;\n\n“release order” means an order granted by the Prisoners Release Board\n\nunder Part VIII authorising the release of a prisoner;”.\n\nRepeal of section 40 of Cap. 168\n\n3.\n\nSection 40 of the principal Act, is repealed.\n\nInsertion of new Part IIIA into Cap. 168\n\n4.\nthe following:\n\nThe principal Act is amended by inserting immediately after Part III\n\n“PART IIIA\n\nPRISONERS RELEASE BOARD\n\nEstablishment of Prisoners Release Board\n\n9A.(1)\nBoard\".\n\nThere shall be a Board to be known as the \"Prisoners Release\n\nThe Second Schedule has effect with respect to the constitution\n\n(2)\nof the Prisoners Release Board and otherwise in relation thereto.\n\nFunctions of the Prisoners Release Board\n\n9B.\n\nThe functions of the Prisoners Release Board are to\n\n(a)\n\nhear and consider applications for release orders;\n\n\f5\n\n(b)\n\ngrant, revoke or suspend release orders;\n\n(c)\n\nassign conditions to release orders;\n\n(d)\n\nmaintain a register of its decisions;\n\n(e)\n\nkeep statistical and other records in relation to its work; and\n\n(f)\n\nmake annual reports to the Minister concerning its work.\n\nRemuneration of the members of Release Board\n\n9C.\nremuneration as the Minister of Finance determines.\n\nThe  members  of  the  Release  Board  shall  be  paid  such\n\nSecretarial services\n\n9D.\nshall perform the secretarial services of the Release Board.\n\nA public officer authorised for the purpose by the Minister\n\nConfidentiality\n\nAll  documents,  information  or  matters  disclosed  in  the\n9E.(1)\ndischarge of the functions of the Board shall be regarded as secret and\nconfidential  and  shall  not  be  disclosed  by  a  member  of  the  Release\nBoard or any person concerned with the Release Board except where\nthose disclosures are made in compliance with\n\n(a)\n\n(b)\n\nan Order of the High Court; or\n\nthe laws of Barbados.\n\nA person who contravenes this section is guilty of an offence and\n(2)\nis liable on summary conviction to a fine of $10 000 or to imprisonment\nfor 2 years or to both.\n\nProtection of members of the Release Board\n\n9F.\nNo  action,  suit  prosecution  or  other  proceeding  shall  be\nbrought  or  instituted  personally  against  any  member  of  the  Release\n\n\f6\n\nBoard in respect of any act done bona fide in pursuance or execution\nor intended execution, of the provisions of this Act.”.\n\nRepeal and replacement of Part VIII of Cap. 168\n\n5.\nsubstituted:\n\nPart  VIII  of  the  principal  Act  is  deleted  and  the  following  is\n\nREMISSION, CONDITIONAL RELEASE AND DISCHARGE\n\n“PART VIII\n\nCalculation of term of sentence\n\nIn any sentence of imprisonment the word \"month\" shall,\n51.(1)\nunless the contrary is expressed, be construed as meaning a calendar\nmonth.\n\nA prisoner who, but for this subsection, would be discharged on\n(2)\na Sunday, Christmas Day or Good Friday, shall be discharged on the\nday next preceding.\n\nFor the purposes of this Part, a person committed to prison in\n(3)\ndefault of payment of a sum adjudged to be paid by a conviction shall\nbe treated as undergoing a sentence of imprisonment for the term for\nwhich he is committed; and consecutive terms of imprisonment shall\nbe treated as one term.\n\nRemission\n\n52.(1)\nRules made under section 66 may make provision whereby,\nin  such  circumstances  as  may  be  prescribed  by  such  rules,  a  person\nserving  a  sentence  of  imprisonment  for  such  a  term  as  may  be  so\nprescribed may be granted remission of such part of that sentence as\nmay be prescribed on the ground of his industry and good conduct, and\n\n\f7\n\non  the  discharge  of  a  person  from  prison  in  pursuance  of  any  such\nremission his sentence shall expire.\n\nWhere it appears to the Minister that a person serving a sentence\n(2)\nof imprisonment was under the age of 21 years at the commencement\nof his sentence he may direct that instead of being granted remission of\nhis sentence under such rules he shall, at any time on or after the day\non  which  he  could  have  been  discharged  if  the  remission  had  been\ngranted, be released on a supervision order under this section.\n\nA person released on a supervision order under this section shall,\n(3)\nuntil the expiration of his sentence, be under the supervision of such\nsociety or person as may be specified in the order and shall comply with\nsuch other requirements as may be so specified: but the Minister may\nat any time modify or cancel any such requirements.\n\nWhere  before  the  expiration  of  his  sentence  the  Minister  is\n(4)\nsatisfied  that  a  person  released  on  a  supervision  order  has  failed  to\ncomply with any requirement for the time being specified in the order,\nhe may by order recall him to prison; and thereupon that person shall\nbe liable to be detained in prison until the expiration of his sentence\nand, if at large, shall be deemed to be unlawfully at large.\n\nThe  Minister  may  release  on  a  supervision  order  a  person\n(5)\ndetained  in  a  prison  under  subsection  (4)  at  any  time  before  the\nexpiration of his sentence; and subsections (3) and (4) shall apply in the\ncase of a person released under this subsection as they apply in the case\nof a person released under subsection (2).\n\nWhere the unexpired part of the sentence of a person released\n(6)\nunder subsection (2) is less than 6 months, subsections (3) to (5) shall\napply to him subject to the following modifications\n\n(a)\n\nthe period for which he is under supervision under subsection\n(3) and is liable to recall under subsection (4) shall be a period\nof 6 months from the date of his release under subsection (2);\n\n\f8\n\n(b)\n\nif he is recalled under subsection (4) the period for which he\nmay be detained thereunder shall be whichever is the shorter\nof the following, that is to say\n\n(i)\n\nthe remainder of the said period of 6 months; or\n\n(ii)\n\nthe part of his sentence which was unexpired on the date\nof his release under subsection (2), reduced by any time\nduring which he had been so detained since that date,\n\nand he may be released on a supervision order under subsection (5) at\nany time before the expiration of that period.\n\nFor the purposes of this section, a person committed to prison in\n(7)\ndefault of payment of a sum adjudged to be paid by a conviction shall\nbe treated as undergoing a sentence of imprisonment for the term for\nwhich he is committed, and consecutive terms of imprisonment shall\nbe treated as one term.\n\nEligibility for the grant of a release order\n\n53.(1)\nA  prisoner  serving  a  term  of  imprisonment  of  4  years  or\nmore, who has completed two-thirds of that sentence and has been of\ngood behaviour, shall be eligible for the grant of a release order.\n\nA prisoner who is serving a term of imprisonment for life shall\n(2)\nbe eligible for grant of a release order where that prisoner has completed\ntwo-thirds  of  that  sentence  and  has  been  of  good  behaviour  except\nwhere that prisoner has been sentenced to life imprisonment without\nthe  possibility  of  a  grant  of  a  release  order  under  section  2  of\nthe Offences Against The Persons Act , Cap. 141\n\nThe Superintendent shall, at the end of each month or within such\n(3)\nperiod  as  the  Release  Board  shall  determine,  submit  to  the  Release\nBoard, a list of all prisoners who will be eligible for the grant of a release\norder.\n\n\f9\n\n(4)\nThe Superintendent shall not later than 6 months before the date\nthat a prisoner becomes eligible for the grant of a release order give\nwritten notice of that date to the prisoner.\n\nApplication for a release order\n\nA prisoner who is eligible for the grant of a release order\n54.(1)\nunder section 53, may apply in the prescribed manner to the Release\nBoard for the grant of that order.\n\nAn application under subsection (1) shall contain the following\n\n(2)\nparticulars:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe full name and age of the applicant;\n\nthe nature of the offence of which the applicant was convicted\nand sentenced;\n\nany other information on which the applicant relies in support\nof his application; and\n\nany  other  information  which  may  be  requested  by  the\nPrisoners Release Board.\n\n(3)\n\nThe Superintendent shall furnish to the Release Board\n\n(a)\n\n(b)\n\na  report  prepared  by  him  in  respect  of  the  conduct  of  the\napplicant while in prison; and\n\na copy of a report containing an opinion by a psychiatrist or\npsychologist or any other person as may be designated by the\nRelease  Board  stating  whether  the  applicant  is  fit  to  be\nreleased.\n\n\f10\n\nGrant of release order\n\n55.(1)\nrelease order to an applicant, take into account the following:\n\nThe Release Board shall, in determining whether to grant a\n\n(a)\n\nthe  nature  and  circumstances  of  the  offence  for  which  the\napplicant was convicted and sentenced; and\n\n(b)\n\nthe remarks made by the Judge at the time of sentencing; and\n\n(c)\n\nthe information contained in the reports referred to in section\n54.\n\n(2)\n\nThe Release Board shall grant a release order to an applicant if\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe  applicant  has  derived  maximum  benefit\nfrom\nimprisonment  and  the  applicant  is,  at  the  time  of  his\napplication  for  a  release  order,  fit  to  be  released  from  the\nprison on release order;\n\nthe reform and rehabilitation of the applicant will be aided by\nconditional release;\n\nthe release order to the applicant will not, in the opinion of\nthe Release Board, constitute a danger to society; and\n\nany other information which the Release Board may deem\nnecessary.\n\nWhere  the  Release  Board  decides  to  grant  a  release  order  in\n(3)\nfavour of an applicant the Release Board shall, within 10 days of the\ndate of that decision\n\n(a)\n\n(b)\n\ngive written notice of the decision to the applicant and the\nSuperintendent; and\n\nmake a release order in respect of the applicant and the release\norder shall be sent to the Superintendent.\n\n\f11\n\nRelease order\n\n56.(1)\nA  release  order  shall  have  effect  for  the  period  specified\ntherein and shall require the holder of the release order to submit during\nthat period to the supervision of a probation officer appointed by the\nChief  Probation  Officer  and  shall  contain  such  requirements  as  the\nRelease  Board  considers  necessary  for  securing  the  supervision  and\nfacilitating the rehabilitation of the holder of the release order.\n\nNotwithstanding the generality of subsection (1), release orders\n\n(2)\nshall be granted subject to the following conditions:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe finger-prints of the holder of the order shall be impressed\nthereon and a photograph of his front and side face shall be\naffixed thereto;\n\nthe holder of the order shall possess the order and shall at all\ntimes produce it on demand when called upon to do so by a\nmagistrate or police or person under whose supervision he\nhas been placed;\n\nthe holder of the order shall abstain from any violation of the\nlaw;\n\nthe  holder  of  the  order  shall  not  habitually  associate  with\nnotoriously  bad  characters  such  as  reputed\nthieves,\nhousebreakers, receivers of stolen property and the like;\n\n(e)\n\nthe holder of the order shall notify the Chief Probation Officer\nof any change of address; and\n\n(f)\n\nany other conditions which the Release Board may impose.\n\n\f12\n\nSuspension or revocation of a release order\n\n57.(1)\nwhere the holder of the release order\n\nThe Release Board shall suspend or revoke a release order\n\n(a)\n\n(b)\n\ncommits an offence during the period specified in the release\norder; or\n\nis  in  breach  of  any  of  the  conditions  set  out  in  the  release\norder.\n\nWhere the Release Board intends to suspend a release order, the\n(2)\nRelease Board shall, within a reasonable time, give written notice of\nthat intention to\n\n(a)\n\n(b)\n\nthe Superintendent; and\n\nthe holder of the release order.\n\nWhere  the  release  order  has  been  suspended  or  revoked,  the\n(3)\nrelease order shall cease to have effect and the holder of that release\norder shall upon being notified of that revocation or suspension, as the\ncase may be, return to the prison and if the holder of release order fails\nto do so, the Chairman of the Release Board shall issue a warrant for\nthe arrest of the holder of the release order who shall, upon arrest, be\nreturned to the prison.\n\nWhere  a  holder  of  a  release  order  is  returned  to  prison  in\n(4)\naccordance with subsection (3), the period spent by that holder in prison\nwhile his release order is suspended or revoked, as the case may be,\nshall be counted as a part of the sentence in respect of which the release\nwas granted and shall be taken into account together with any remission\nearned by the holder of the release order for the purpose of determining\nthe date of the expiration of that sentence.\n\n\f13\n\nReapplication for a release order\n\n58.(1)\nA prisoner whose application for a release order has been\nrefused by the Prisoners Release Board, may again apply for a release\norder after the expiration of 12 months from the date of the refusal.\n\nA prisoner in respect of whom a release order has been suspended\n(2)\nor  revoked  may  apply  for  a  release  order  after  the  expiration  of  12\nmonths from the date of such suspension or revocation, as the case may\nbe.\n\nWhere a prisoner in respect of whom a release order has been\n(3)\nsuspended or revoked has one fourth of his sentence to complete he\nshall not be permitted to apply to the Prisoners Release Board for a new\nrelease order.\n\nRelease of prisoner on payment of portion of fine\n\nWhere a person is committed to prison for non-payment of\n59.\nany sum adjudged to be paid by the conviction or order of any Judge\nor on payment of a magistrate or for want of sufficient distress to satisfy\nthe sum, then, on payment to the Officer-in-Charge of part of the sum,\nthe period of detention shall be reduced by such number of days as bears\nto  the  total  number  of  days  in  that  period  less  one  day  the  same\nproportion as the amount so paid bears to so much of the said sum and\nthe costs and charges of any distress levied to satisfy that sum, as was\ndue at the time the period of detention was imposed.\n\nTime for receiving fines or part-payments\n\n60.\nThere shall be no obligation on the part of the Officer-in-\nCharge to receive upon a Sunday, Christmas Day, or Good Friday any\npenalty, fine or payment tendered to obtain the release or reduction of\nthe terms of imprisonment of any prisoner and fines or part-payment\n\n\f14\n\nthereof will only be received between the hours of 10.00 a.m. and 4.00\np.m.\n\nPower of the Minister to discharge prisoners temporarily\n\n61.(1)\nWhere  the  Minister  is  satisfied  that  by  reason  of  the\ncondition of a prisoner’s health it is undesirable to detain him in prison\nbut that, such condition of health being due in whole or in part to the\nprisoner’s own conduct in prison, it is desirable that his release should\nbe temporary and conditional only, the Minister may, if he thinks fit,\nhaving regard to all the circumstances of the case, by order authorise\nthe temporary discharge of the prisoner for such period and subject to\nsuch conditions as may be stated in the order.\n\nWhere an order of temporary discharge is made in the case of a\n(2)\nprisoner not under sentence, the order shall contain conditions requiring\nthe attendance of the prisoner at any further proceedings on his case at\nwhich his presence may be required.\n\nAny prisoner discharged under this section shall comply with any\n(3)\nconditions stated in the order of temporary discharge and shall return\nto prison at the expiration of the period stated in the order or of such\nextended period as may be fixed by any subsequent order of the Minister\nand a prisoner who fails so to comply or return may be arrested without\nwarrant and taken back to prison.\n\nWhere a prisoner under sentence is discharged in pursuance of\n(4)\nan order of temporary discharge, the currency of the sentence shall be\nsuspended from the day on which he is discharged from prison under\nthe order to the day on which he is received back into prison, so that\nthe former day shall be reckoned and the latter shall not be reckoned as\npart of the sentence.\n\nNothing  in  this  section  shall  affect  the  duties  of  the  medical\n(5)\nofficer in respect of a prisoner whom the Minister does not think fit to\ndischarge under this section.\n\n\f15\n\nSupervision order granted by the Superintendant\n\n62.(1)\nThe  Superintendant  may  subject  to  such  conditions  as  he\nmay impose, grant to a prisoner a supervision order where the prisoner\nis required to leave the confines of the prison to perform a particular\ntask or to attend an event.\n\nA prisoner who fails to comply with conditions imposed by the\n(2)\nSuperintendant under subsection (1), may be arrested without warrant\nand returned to prison.\n\nExpenses of return from prison of discharged prisoner\n\nWhen a prisoner is discharged from prison, the Officer-in-\n63.\nCharge may provide him with the means of returning to his home either\nby paying his fare or in any other convenient manner.\n\nExercise of the Minister’s functions\n\n64.\nThe Minister in the exercise of any function conferred upon\nhim by sections 52, 61 or 68 shall act in accordance with the advice of\nthe Board.”.\n\nAmendment of the Schedule to Cap. 168\n\n6.\n\nThe principal Act is amended by\n\n(a)\n\n(b)\n\nrenumbering the Schedule as the \"First Schedule\";\n\ninserting the Schedule to this Act as the “Second Schedule”.\n\nAmendment of Cap. 168\n\n7.\nwherever it appears and substituting the words \"First Schedule\".\n\nThe  principal  Act  is  amended  by  deleting  the  word  \"Schedule\"\n\n\f16\n\nCommencement\n\n8.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f17\n\nFIRST SCHEDULE\n\n“SECOND SCHEDULE\n\n(Section 6)\n\n(Section 9A)\n\nConstitution, Functions and Procedure of the Prisoners Release Board\n\nConstitution of Prisoners Release Board\n\nThe Governor-General, by instrument under the Public Seal\n1.(1)\nacting  on  the  recommendation  of  the  Minister  shall  appoint  the\nmembers of the Prisoners Release Board.\n\nThe  Prisoners  Release  Board  shall  comprise  the  following\n\n(2)\npersons:\n\n(a)\n\n(b)\n\n(c)\n\na present or former member of the Judiciary;\n\na psychiatrist;\n\na psychologist;\n\n(d)\n\na criminologist or penologist;\n\n(e)\n\nthe Chief Probation Officer or his nominee;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nthe Commissioner of Police or his nominee;\n\na representative from a religious institution;\n\na representative from Civil Society;\n\na representative from the business community; and\n\nany other person the Minister considers appropriate.\n\n\f18\n\n(3)\nThe member of the Judiciary referred to in paragraph 2(a) shall\nbe the Chairman and the Deputy chairman shall be elected from among\nthe members of the Prisoners Release Board.\n\nTenure\n\n2.(1)\nfor a period of 3 years and shall be eligible for reappointment.\n\nA member of the Prisoners Release Board shall hold office\n\nWhere a vacancy is created by the death, resignation or removal\n(2)\nfrom office of a member, a person may be appointed in accordance with\nparagraph (1) to fill that vacancy.\n\nResignation\n\nThe Chairman or Deputy Chairman may at any time resign\n3.(1)\nhis office by instrument in writing addressed to the Minister; and upon\nthe date of receipt by the Minister of the instrument, the Chairman or\nDeputy Chairman ceases to be Chairman or Deputy Chairman and a\nmember of the Prisoners Release Board.\n\nA member may at any time resign his office by instrument in\n(2)\nwriting  addressed  to  the  Chairman,  who  shall  forthwith  cause  the\ninstrument to be forwarded to the Minister; and upon the date of the\nreceipt by the Minister of the instrument, that member ceases to be a\nmember of the Prisoners Release Board.\n\nPublication in Official Gazette\n\n4.\nThe names of all members of the Prisoners Release Board\nas first constituted and every change in the membership thereafter shall\nbe published in the Official Gazette.\n\nMeetings\n\n5.\nThe  Prisoners  Release  Board  shall  regulate  its  own\nprocedure and shall meet at least once every quarter and at such other\n\n\f19\n\ntimes  as  may  be  necessary  or  expedient  for  the  transaction  of  the\nbusiness of the Prisoners Release Board.\n\nQuorum\n\n6.\nBoard shall constitute a quorum.\n\nThe Chairman and 5 other members of the Prisoners Release\n\nMinutes\n\n7.\nThe Prisoners Release Board shall submit the minutes of the\nmeetings of the Release Board to the Minister as soon as possible after\nthey have been approved by the Release Board.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2014.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2014.\n\nPresident\n\n"
}