{
  "bill_id": 571,
  "slug": "resolution-re-rescind-upton-christ-church-development-of-a-skate-park",
  "title": "Resolution re Rescind Upton Christ Church Development of a Skate Park",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/c5574def2cc5ff34d89935a616949491.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-08-11",
  "first_reading": "2021-08-18",
  "gazette_date": "2019-06-10",
  "markdown": "PARLIAMENT\n\nWHEREAS a Resolution was passed by the Honourable House of Assembly on\n\nthe 7th day of May, 2019 and by the Honourable Senate on the 31st day of May, 2019, was assented\n\nto by Her Excellency the Governor-General on the 5th day of June, 2019 and was published in\n\nthe Ofﬁ cial Gazette as Resolution No. 10/2019 on the 10th day of June, 2019 approving the lease\n\nto The Maria Holder Memorial Trust of a parcel of land the property of the Crown situate at\n\nUpton in the parish of Christ Church in this Island for the purpose of constructing a skatepark\n\nfor public use;\n\nbe rescinded;\n\nNo. 10/2019.\n\nAND WHEREAS it has been determined that Resolution No. 10/2019 should\n\nBE  IT  RESOLVED  that  Parliament  approve  the  rescission  of  Resolution\n\n\f2\n\nAPPROVED by the House of Assembly this          day of                                     , Two\n\nthousand and twenty-one.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and twenty-one.\n\nPresident\n\n\f3\n\nADDENDUM\n\n  On the 4th day of April, 2019, the Cabinet agreed to the lease to The Maria Holder Memorial\n\nTrust of a parcel of land situate at Upton in the parish of Christ Church in this Island containing\n\nby  admeasurement  9,111.1  square  metres  or  thereabouts  for  the  construction  of  a  skatepark\n\nfor public use.\n\n  On  the  9th day  of  May,  2019,  the  Cabinet  approved  the  introduction  into  Parliament\n\nof a Resolution seeking approval for the lease.\n\n  By Resolution No. 10/2019 published in the Ofﬁ cial Gazette on the 10th day of June, 2019\n\nParliament resolved that the parcel of land be leased to The Maria Holder Memorial Trust for\n\na term of 20 years with an option to renew for a further term of 20 years subject to terms and\n\nconditions which included a lease back to the Crown.\n\n  On the 22nd day of July, 2021, the Cabinet agreed to rescind its decisions of 4th April\n\nand  9th  May,  2019  and  instead  agreed  to  lease  to  The  Maria  Holder  Memorial  Trust  the\n\nparcel of land situate at Upton in the parish of Christ Church subject to terms and conditions\n\nwhich include the grant of a licence to the Crown.\n\nThe approval of Parliament is therefore now sought for the rescission of the Resolution\n\npassed in the House of Assembly on the 7th day of May, 2019 and in the Senate on the 31st day of\n\nMay, 2019 and assented to by the Governor-General on the 5th day of June, 2019 and published\n\nin the Ofﬁ cial Gazette as Resolution No. 10/2019.\n\n"
}