{
  "bill_id": 573,
  "slug": "resolution-re-lease-crown-lands-for-development-of-a-skate-park",
  "title": "Resolution re Lease Crown Lands for Development of a Skate Park",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/0998ff36052ca94f54b7821e95c5c1c2.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-08-11",
  "first_reading": "2021-08-18",
  "gazette_date": null,
  "markdown": "PARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the\n\nCrown  Lands  (Vesting  and  Disposal)  Act,  Cap.  225  approve  the  lease  to  The  Maria  Holder\n\nMemorial Trust of the parcel of land the property of the Crown situate at Upton in the parish of\n\nChrist Church in this Island and more particularly described in the First Schedule on the terms\n\nand conditions set out in the Second Schedule for the purpose of constructing a skatepark for\n\npublic use.\n\nand twenty-one.\n\nAPPROVED by the House of Assembly this          day of\n\n, Two thousand\n\nSpeaker\n\nAPPROVED by the Senate this\n\nday of\n\n, Two\n\nthousand and twenty-one.\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL  THAT  land  the  property  of  the  Crown  situate  at  Upton  in  the  parish\n\nof  Christ  Church  in  this  Island  containing  by  admeasurement  9111.1  square  metres  or\n\nthereabouts abutting and bounding on lands of the Barbados Government (Barbados Hockey\n\nFederation Inc.) on a drain on a right of way to an access road leading to a cul-de-sac in one\n\ndirection on a drain and on a road reserve or however else the same may abut and bound as shown\n\nand  delineated  on  a  plan  certiﬁ ed  on  the  27th day  of  March,  2019  by  Samuel  N.  Taylor,\n\nLand  Surveyor  and  recorded  on  the  28th  day  of  March,  2019  in  the  Lands  and  Surveys\n\nDepartment as Plan No. 368/2019.\n\n\f3\n\nSECOND SCHEDULE\n\nTERMS AND CONDITIONS\n\nThe lease to The Maria Holder Memorial Trust of the parcel of land, the property of the Crown,\n\nsituate at Upton in the parish of Christ Church in this Island and more particularly described\n\nin the First Schedule is subject to the following terms and conditions:\n\n(a)\n\nthe premises are being leased for the purpose of the construction of a skatepark;\n\n(b)  the lease to be for a term of 20 years with an option to renew for a further term of\n\n20 years;\n\n(c)\n\nthe lessee shall pay as a rent a one-time payment of $200.00 plus value added tax,\n\npayable in advance;\n\n(d)  the lessor shall review the rent at the end of the ﬁ rst term;\n\n(e)\n\nthe lessee shall be responsible for the costs of development of the site;\n\n(f)\n\nthe  lessee  shall  comply  with  the  requirements  of  all  planning,  building,  safety\nand health and related legislation throughout the term;\n\n(g)  the  lessee  shall  indemnify  the  lessor  against  all  actions  arising  from  its  use  of\n\nthe premises;\n\n(h)  the lessee shall not use, permit or suffer the demised premises or any part thereof\nto be used for any purpose other than a skatepark except with the permission of the\nlessor ﬁ rst obtained in writing, such permission not to be unreasonably withheld;\n\n(i)\n\nthe  lessee  shall  not  assign,  mortgage,  demise,  underlet  or  otherwise  part  with\npossession of any part of the demised premises without the prior written consent\nof the lessor;\n\n(j)\n\nthe  lessee  reserves  the  right  to  surrender  the  lease  with  improvements  to  the\npremises at any time by giving 8 months’ notice;\n\n(k)  the lease shall terminate on the transfer of the ownership of the skatepark to Crown;\n\n\f4\n\n(l)\n\nthe premises shall revert to the Crown for nil consideration at the end  of  the  lease  or\nits sooner determination; and\n\n(m)  the Maria Holder Memorial Trust shall grant to the Crown, through National Sports\nCouncil,  a  licence  in  respect  of  the  demised  premises  on  the  following  terms  and\nconditions:\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\nthe licence shall be for a term of 20 years less one day with an option to renew\nfor a further term of 20 years less one day;\n\nthe  licence  fee  shall  be  $1,500.00  plus  value  added  tax,  payable  annually  in\nadvance;\n\nthe  Crown  as  licensee  acting  through  National  Sports  Council  shall  be\nresponsible for keeping the premises insured under a comprehensive policy in\nthe joint names of the Crown and the Trust;\n\nthe Crown shall be responsible for the maintenance and upkeep of the premises\nand in particular shall keep the interior and exterior of the premises, inclusive\nof drains, sanitary and water apparatus, gates and fences in good and tenantable\nrepair;\n\n(v)\n\nthe Trust as licensor shall be responsible for the repair of any latent defect in the\nstructure of the premises or repairs arising therefrom;\n\n(vi)\n\nthe Crown shall not carry out any additions or extensions to the premises without\nthe approval of the Trust;\n\n(vii)\n\nthe Crown shall not use, permit or suffer the premises or any part thereof to\nbe  used  for  any  purpose  other  than  as  a  skatepark  or  for  ancillary  sporting\npurposes, except with the written permission of the Trust, such permission not to be\nunreasonably withheld;\n\n(viii)  the Crown shall not assign, sublet or further licence any part of the premises;\n\n(ix)\n\nthe Crown shall permit the Trust or its authorized agent, upon receipt of 2 days’\nwritten notice to inspect the premises and, thereafter, the Trust may give written\nspeciﬁ cations of any repairs, maintenance and replacement necessary and require\nthe Crown to execute the repairs within 21 days;\n\n\f5\n\n(x)  where the Crown is unable to execute the repairs within the time speciﬁ ed in\nsub-paragraph  (ix),  the Trust  shall  execute  the  repairs  and  the  costs  of  those\nrepairs shall be treated as a debt to the Trust as an additional licence fee and\nshall be settled within 2 months of the date of the Trust’s invoice for the work\nundertaken;\n\n(xi)\n\nthe Crown shall be responsible for maintaining public liability insurance of not\nless than $2,000,000.00, subject to an annual review by the Trust’s brokers, and\nindemnify the Trust in the event of any liability;\n\n(xii)\n\nthe Crown shall be responsible for all outgoings arising from the use of the site\nas a skatepark; and\n\n(xiii)  the Crown shall give 8 months’ notice should it wish to terminate the licence\n\nbefore its expiry date.\n\n\f6\n\nADDENDUM\n\n  The  Cabinet  at  its  meeting  held  on  the  22nd  July,  2021  agreed  to  the  lease  of  the\n\nparcel of Crown land containing by admeasurement 9111.1 square metres situate at Upton in the\n\nparish of Christ Church in this Island to The Maria Holder Memorial Trust for the construction\n\nof a skatepark.\n\n  The  development of the skatepark will be ﬁ nanced through The Maria Holder Memorial\n\nTrust who will ﬁ nance, construct, lease, maintain and transfer the skatepark to the Crown at the\n\nend of the lease period.\n\n  In  accordance  with  the  provisions  of  section  5  of  the  Crown  Lands  (Vesting  and\n\nDisposal) Act, Cap. 225 the approval of Parliament is now sought for the lease to The Maria\n\nHolder Memorial Trust of the land described in the First Schedule on the terms and conditions\n\nset out in the Second Schedule.\n\n"
}