{
  "bill_id": 578,
  "slug": "national-vending-bill-2021",
  "title": "National Vending Bill 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/195765820d59d956bd5963850f68700e.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-12-04",
  "first_reading": "2021-12-06",
  "gazette_date": "2021-08-24",
  "markdown": "2021/12/03\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the\n\n(a)\n\n(b)\n\n(c)\n\nregulation of vending in Barbados;\n\nprotection of the rights of vendors; and\n\nmatters related to paragraphs (a) and (b).\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\nPART II\n\nVENDING\n\nPART III\n\n1.\n\n2.\n\nShort title\n\nInterpretation\n\n3.\n\nVending\n\nREGULATION OF VENDING ACTIVITIES\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nLicensing and permit requirements\n\nApplication for the grant of a licence\n\nVending Licence\n\nRegister of Vendors\n\nRevocation, suspension or varying of a licence\n\nNotice of intention to revoke, suspend or vary a licence\n\n\f3\n\n10.\n\nOccasional vending that is not on a beach, an esplanade or in a garden or\na park\n\n11.\n\nOccasional vending on a beach, an esplanade or in a garden or a park\n\n12.\n\nItinerant vending\n\nPART IV\n\nVENDING ZONES\n\n13.\n\nVending zones\n\n14.\n\nDesignation of a vending zone\n\n15.\n\nBeaches, esplanades, gardens and parks\n\n16.\n\nPublic Markets and fish landing sites\n\nPART V\n\nRIGHTS AND OBLIGATIONS OF VENDORS\n\n17.\n\nRights of vendors\n\n18.\n\nGeneral obligations of vendors\n\nPART VI\n\nRELOCATION AND EVICTION OF VENDORS\n\n19.\n\nRelocation or eviction of vendors\n\n20.\n\nSeizing and reclaiming of goods\n\n\f4\n\nPART VII\n\nNATIONAL VENDING COMMITTEE\n\n21.\n\nEstablishment of National Vending Committee\n\n22.\n\nFunctions of the Committee\n\nPART VIII\n\nAPPEALS\n\n23.\n\nAppeal\n\n24.\n\nEstablishment of National Vending Appeals Tribunal\n\n25.\n\nSuspension of decisions pending appeal to Tribunal\n\n26.\n\nPower of Tribunal\n\n27.\n\nAppeal to High Court\n\nPART IX\n\nADMINISTRATIVE PENALTIES\n\n28.\n\nAdministrative penalties\n\n29.\n\nAdministrative penalty notice\n\n30.\n\nProcedure for challenging an alleged administrative contravention\n\n31.\n\nAdministrative penalty to constitute a debt to the State\n\n\f5\n\nPART X\n\nMISCELLANEOUS\n\n32.\n\nFees\n\n33.\n\nTransitional\n\n34.\n\nRegulations\n\n35.\n\nAmendment of Schedules\n\n36.\n\nExpungement\n\n37.\n\nConsequential amendments\n\n38.\n\nCommencement\n\n\f6\n\nFIRST SCHEDULE\n\nApplication Form and Vending Licence\n\nSECOND SCHEDULE\n\nApplication Forms and Permits for Occasional Vending and Itinerant Vending\n\nTHIRD SCHEDULE\n\nFees\n\nFOURTH SCHEDULE\n\nLists and Descriptions\n\nFIFTH SCHEDULE\n\nNotices\n\nSIXTH SCHEDULE\n\nNational Vending Committee\n\nSEVENTH SCHEDULE\n\nAdministrative Penalties\n\nEIGHTH SCHEDULE\n\nConsequential Amendments\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the regulation of vending in Barbados, the protection\n\nof the rights of vendors and matters related thereto.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f8\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the National Vending Act, 2021.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“bakery”  has  the  meaning  assigned  to  it  by  the  Health  Services  (Bakeries)\n\nRegulations (S.I. 1970 No. 111);\n\n“beach” has the meaning assigned to it by the National Conservation Commission\n\nAct, Cap. 393;\n\n“Committee”  means  National  Vending  Committee  established  in  accordance\n\nwith section 21;\n\n“Commission” means the National Conservation Commission established under\n\nthe National Conservation Commission Act, Cap. 393;\n\n“esplanade” means an esplanade listed in Part I of the Fourth Schedule;\n\n“fish landing site” means a site listed in Part III of the Fourth Schedule;\n\n“fish  market”  has  the  meaning  assigned  to  it  by  the  Markets  and  Slaughter-\n\nHouses Regulations, 1958 (L.N. 1958 No. 73);\n\n“food” has the meaning assigned to it by the Health Services (Food Hygiene)\n\nRegulations, 1969 (S.I. 1969 No. 232);\n\n“fresh meat” has the meaning assigned to it by the Markets and Slaughter-Houses\n\nAct, Cap. 265;\n\n“garden” means a garden listed in Part I of the Fourth Schedule;\n\n\f“itinerant vending” means the offering for sale of merchandise or the rendering\n\n9\n\nof services\n\n(a)\n\nfrom a vehicle\n\n(i)\n\nparked in a vending zone; or\n\n(ii)\n\nbeing driven from one customer’s premises to another; or\n\n(b)\n\nin a vending zone or other site for a period of less than 12 hours;\n\n“Manager of Markets” means the manager responsible for the management and\noperation of public markets under the Markets and Slaughter-Houses Act,\nCap. 265;\n\n“Manager of Vending Zones” means\n\n(a)\n\nthe Manager of Markets for the purposes of vending zones that are\n\n(i)\n\n(ii)\n\npublic markets that are not fish markets;\n\nthe areas more particularly described in the Part II of the Fourth\nSchedule;\n\n(iii)\n\na  zone  designated  by  the  Minister  on  consultation  with  the\nNational Vending Committee;\n\n(b)\n\n(c)\n\n(d)\n\nthe National Conservation Commission for the purposes of vending\nzones that are beaches, esplanades, gardens and parks; or\n\nthe Senior Manager of Markets for the purposes of vending zones that\nare fish markets;\n\nthe Chief Fisheries Officer for the purposes of vending zones that are\nfish landing sites;\n\n“merchandise” means fruit, vegetables, ground provisions, poultry, eggs, fresh\nmeat, fish, food, crafts, pieces of clothing or any other small items;\n\n“Minister” means the Minister responsible for Commerce;\n\n\f10\n\n“National Conservation Commission” means the Commission established under\n\nthe National Conservation Commission Act, Cap. 393;\n\n“National  Vending  Policy”  means  the  policy  developed  by  the  Ministry\nresponsible for Commerce to facilitate the enabling environment that would\nallow vendors to operate while ensuring their compliance with the Laws of\nBarbados;\n\n“occasional vending” means\n\n(a)\n\n(b)\n\noffering for sale of merchandise; or\n\nrendering of services\n\nfor  the  duration  of  a  fair,  festival,  carnival  or  a  cultural,  entrepreneurial,\nreligious or recreational event only;\n\n“park” means a garden listed in Part I of the Fourth Schedule;\n\n“Policy” means the National Vending Policy;\n\n“public market” has the meaning assigned to it by the Markets and Slaughter-\n\nHouses Act, Cap. 265;\n\n“retailer”  includes  a  supermarket,  shop  or  other  entity  that  offers  for  sale  or\n\ndisposal merchandise to the public;\n\n“restaurant” has the meaning assigned to it by the Health Services (Restaurants)\n\nRegulations, 1969 (S.I. 1969 No. 234);\n\n“Senior  Manager  of  Markets”  means  the  manager  responsible  for  the\n\nmanagement and operation of fish markets;\n\n“Tribunal” means the National Vending Appeals Tribunal established by section\n\n24;\n\n“vehicle” has the meaning assigned to it by Road Traffic Act, Cap. 295;\n\n“vending” has the meaning assigned to it by section 3;\n\n“vending zone” has the meaning assigned to it by section 13; and\n\n\f11\n\n“vendor” means a person who is engaged in vending and is\n\n(a)\n\n(b)\n\nlicensed to do so pursuant to sections 4 and 5; or\n\ngranted a permit to do so pursuant to sections 4, 10, 11 and 12.\n\nPART II\n\nVENDING\n\nVending\n\n3.(1)\nmerchandise or the rendering of services\n\nFor the purposes of this Act, vending refers to the offering for sale of\n\n(a)\n\n(b)\n\nin a vending zone;\n\nfor the duration of a fair, farmers market, festival, carnival or a cultural,\nentrepreneurial, religious or recreational event only; or\n\n(c)\n\nfrom\n\n(i)\n\na  vehicle  parked  in  a  vending  zone  or  being  driven  from  one\ncustomer’s premises to another; or\n\n(ii)\n\nvending zone or other site for a period of less than 12 hours.\n\nThe following activities are not to be construed as vending for the purposes\n\n(2)\nof this Act:\n\n(a)\n\nthe sale of goods and chattels sold pursuant to the District Auctioneers\nAct, Cap. 114;\n\n(b)\n\nthe sale of merchandise by a retailer;\n\n(c)\n\nthe sale of food or drink in\n\n(i)\n\na bakery;\n\n(ii)\n\na canteen operating in a club, a hospital, an institution or a school;\n\n\f12\n\n(iii)\n\na club;\n\n(iv)\n\na hospital;\n\n(v)\n\nan institution; or\n\n(vi)\n\na restaurant which is not operating on a beach, esplanade, or in a\ngarden or a park;\n\n(vii)\n\na hotel which is not operating on a beach, esplanade or in a garden\nor a park;\n\nwhether carried on for profit or not;\n\n(d)\n\n(e)\n\nthe sale of merchandise where the profits thereof are used solely for a\ncharitable purpose;\n\nthe sale of merchandise or the rendering of services by a person within\nthe curtilage of that person’s residence; or\n\n(f)\n\nthe sale of fish by a fisherman to a vendor.\n\n(3)\n\nThe Minister may by order amend subsection (2).\n\nPART III\n\nREGULATION OF VENDING ACTIVITIES\n\nLicensing and permit requirements\n\n4.(1)\n18 years and obtained a licence or a permit to do so under this Act.\n\nNo person shall operate as a vendor unless he has attained the age of\n\nA person who has attained the age of 16 years may be permitted to operate\n\n(2)\nas a vendor in accordance with regulations made by the Minister.\n\nA person who contravenes subsection (1) shall be subject to the payment\n\n(3)\nof an administrative penalty imposed under section 28.\n\n\f13\n\nApplication for the grant of a licence\n\n5.(1)\nA person who seeks to operate as a vendor in a vending zone that is\nnot a beach, an esplanade, a garden or a park pursuant to section 3(1)(a) shall\napply to the Minister for a licence to do so by\n\n(a)\n\nsubmitting\n\n(i)\n\nan  application  for  the  purpose  set  out  in  Part  I  of  the  First\nSchedule;\n\n(ii)\n\nproof of identification;\n\n(iii)\n\nproof of address;\n\n(iv)\n\nin the case of an applicant who seeks to operate as a food vendor,\n\n(A)\n\n(B)\n\na certificate of good health issued by a registered medical\npractitioner; and\n\na licence to carry on a food business granted pursuant to the\nHealth  Services  (Food  Hygiene)  Regulations,  1969  (S.I.\n1969 No. 232);\n\n(v)\n\nin the case of an applicant who seeks to operate as a meat vendor\nin a shop or premises outside of a public market evidence that the\nlocation of the meat shop or premises has\n\n(A)\n\nwalls and floors that are impervious;\n\n(B)\n\nproper provision for drainage and is properly ventilated; and\n\n(C)\n\na water supply that is adequate for operation as a meat shop;\nand\n\n(b)\n\npaying the relevant fee set out in the Third Schedule.\n\nThe Minister may, on consultation with the Minister responsible for public\n(2)\nmarkets and the Minister responsible for fisheries, grant a licence to an applicant\nreferred to in subsection (1) within 7 days of the receipt of an application.\n\n\f14\n\n(3)\nA person who seeks to operate as a vendor in a vending zone that is a beach,\nesplanade, garden or park pursuant to section 3(1)(a) shall apply to the National\nConservation Commission for a licence to do so by\n\n(a)\n\nsubmitting\n\n(i)\n\nan  application  for  the  purpose  set  out  in  Part  III  of  the  First\nSchedule;\n\n(ii)\n\nproof of identification;\n\n(iii)\n\nproof of address;\n\n(iv)\n\nin the case of an applicant who seeks to operate as a food vendor,\n\n(A)\n\n(B)\n\na certificate of good health issued by a registered medical\npractitioner; and\n\na licence to carry on a food business granted pursuant to the\nHealth  Services  (Food  Hygiene)  Regulations,  1969  (S.I.\n1969 No. 232); and\n\n(b)\n\npaying the relevant fee set out in the Third Schedule.\n\nThe  National  Conservation  Commission  may  grant  a  licence  to  an\n(4)\napplicant  referred  to  in  subsection  (3)  within  7  days  of  the  receipt  of  an\napplication.\n\nA person who provides false or misleading information in an application\n(5)\nreferred  to  in  subsection  (1)  or  subsection  (3)  or  documentation  pursuant  to\nsubsection  (1)  or  subsection  (3)  shall  be  subject  to  the  payment  of  an\nadministrative penalty imposed under section 28.\n\nSubsections  (3)  and  (4)  shall  apply  to  a  person  carrying  on  any  hotel,\n(6)\nrestaurant or other business in respect of which there is in existence a valid licence\ngranted under the Liquor Licences Act, Cap. 182.\n\n\f15\n\nVending Licence\n\n6.(1)\n\nA licence granted pursuant to section 5(2) shall\n\n(a)\n\nbe in the form set out in Part II of the First Schedule and shall specify\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\nthe name of the licensee;\n\nthe sex of the licensee;\n\nthe date of birth of the licensee;\n\nthe national identification number of the licensee;\n\nthe vending licence number assigned by the Minister;\n\n(vi)\n\na photo of the licensee;\n\n(vii)\n\nthe type of vending to be engaged in by the vendor;\n\n(viii)\n\nthe type of service to be rendered by the vendor;\n\n(ix)\n\nthe type of merchandise being sold by the vendor;\n\n(x)\n\nthe vending zone;\n\n(xi)\n\nthe date upon which the licence\n\n(A)\n\nis granted;\n\n(B)\n\ncomes into force;\n\n(C)\n\nis set to expire;\n\n(xii)\n\nany terms or conditions attached to the licence;\n\n(b)\n\nbe valid for one year and may be renewed on the expiration of that\nlicence  upon  the  payment  of  the  relevant  fee  set  out  in  the  Third\nSchedule; and\n\n(c)\n\nnot be transferable.\n\n\f16\n\n(2)\n\nA licence granted pursuant to section 5(4) shall\n\n(a)\n\nbe in the form set out in Part IV of the First Schedule and shall specify\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\nthe name of the licensee;\n\nthe sex of the licensee;\n\nthe date of birth of the licensee;\n\nthe national identification number of the licensee;\n\nthe  vending\nConservation Commission;\n\nlicence  number  assigned  by\n\nthe  National\n\n(vi)\n\na photo of the licensee;\n\n(vii)\n\nthe type of vending to be engaged in by the vendor;\n\n(viii)\n\nthe type of service to be rendered by the vendor;\n\n(ix)\n\nthe type of merchandise being sold by the vendor;\n\n(x)\n\nthe vending zone;\n\n(xi)\n\nthe date upon which the licence\n\n(A)\n\nis granted;\n\n(B)\n\ncomes into force;\n\n(C)\n\nis set to expire;\n\n(xii)\n\nany terms or conditions attached to the licence;\n\n(b)\n\nbe valid for one year and may be renewed on the expiration of that\nlicence  upon  the  payment  of  the  relevant  fee  set  out  in  the  Third\nSchedule; and\n\n(c)\n\nnot be transferable.\n\nNotwithstanding  sections  10  and  11,  a  person  granted  a  licence  under\n(3)\nsection 5(2) or section 5(4) may operate at a fair, festival, carnival or a cultural,\n\n\f17\n\nentrepreneurial,  religious  or  recreational  event  without  obtaining  a  permit\nrequired pursuant to sections 10 and 11.\n\nRegister of Vendors\n\n7.(1)\nThe Minister shall cause to be kept and maintained a register to be\nknown as the Register of Vendors which shall contain the following particulars\nin respect of a licensed vendor or an itinerant vendor:\n\n(a)\n\n(b)\n\n(c)\n\nname;\n\nsex;\n\nthe date of birth;\n\n(d)\n\nthe national identification number;\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nthe vending licence number or itinerant vending permit number where\napplicable;\n\nthe type of vending engaged in;\n\nthe type of service rendered;\n\nthe type of merchandise being sold;\n\nthe vending zone;\n\nthe date upon which the licence or permit\n\n(i)\n\nwas granted;\n\n(ii)\n\ncame into force;\n\n(iii)\n\nis set to expire;\n\n(k)\n\nany terms or conditions attached to the licence or permit;\n\n(l)\n\nany other particulars required by the Minister.\n\n(2)\n\nThe Register of Vendors shall be in electronic and physical form.\n\nThe electronic form of the Register of Vendors shall be made available to\n(3)\nthe public on a website established by the Ministry responsible for Commerce.\n\n\f18\n\nThe physical form of the Register of Vendors may be inspected by any\n\n(4)\nperson during the office hours of the Ministry responsible for Commerce.\n\n(5)\nAny  information  collated  by  the  National  Conservation  Commission\ncollected  pursuant  to  section  5(3)  and  section  6(2)  shall  be  shared  with  the\nMinister for the purpose of assisting the Minister in keeping and maintaining the\nRegister of Vendors pursuant to subsection (1).\n\nRevocation, suspension or varying of a licence\n\nThe  Minister  may,  in  writing,  revoke,  suspend  or  vary  a  licence\n8.(1)\ngranted pursuant to section 5(2) where the Minister is satisfied that the licensee\n\n(a)\n\n(b)\n\nhas provided false or misleading information in an application for a\nlicence or submitted false or misleading documentation; or\n\nhas failed to comply with any condition of the licence or any provision\nof this Act or any regulations made thereunder.\n\nThe National Conservation Commission may, in writing, revoke, suspend\n(2)\nor  vary  a  licence  granted  pursuant  to  section  5(4)  where  the  Commission  is\nsatisfied that the licensee\n\n(a)\n\n(b)\n\nhas provided false or misleading information in an application for a\nlicence or submitted false or misleading documentation; or\n\nhas failed to comply with any condition of the licence or any provision\nof this Act or any regulations made thereunder.\n\nA person who seeks to vary a licence granted pursuant to section 5(2) shall\n(3)\nsubmit a request to do so to the Minister in writing and the Minister shall respond\nin writing within 7 days and\n\n(a)\n\nwhere the request is granted make changes necessary to the licence and\nRegister; or\n\n(b)\n\nwhere the request is refused give reasons for the refusal.\n\n\f19\n\n(4)\nA person who seeks to vary a licence granted pursuant to section 5(4) shall\nsubmit a request to do so to the National Conservation Commission in writing\nand  the  National  Conservation  Commission  shall  respond  in  writing  within  7\ndays and\n\n(a)\n\nwhere the request is granted make changes necessary to the licence and\ncommunicate the changes to the Minister pursuant to the objectives set\nout in section 7(5); or\n\n(b)\n\nwhere the request is refused give reasons for the refusal.\n\nA person who vends with a licence that has been revoked or suspended\n(5)\npursuant to subsection (1) or subsection (2) shall be subject to the payment of an\nadministrative penalty imposed under section 28.\n\nWhere a person vends in contravention to the conditions of a licence varied\n(6)\npursuant to subsection (1) or subsection (2), that person shall be subject to the\npayment of an administrative penalty imposed under section 28.\n\nNotice of intention to revoke, suspend or vary a licence\n\n9.(1)\nunder section 8(1)\n\nThe Minister shall, before revoking, suspending or varying a licence\n\n(a)\n\n(b)\n\n(c)\n\ngive the licensee notice in writing of the grounds on which he intends\nso to do;\n\nafford the licensee an opportunity to object in writing within the period\nof 14 days after the date of issue of the notice;\n\ntake into consideration the objection of the licensee made pursuant to\nparagraph (b).\n\nThe  National  Conservation  Commission  shall,  before  revoking,\n\n(2)\nsuspending or varying a licence under section 8(2)\n\n(a)\n\ngive the licensee notice in writing of the grounds on which he intends\nso to do;\n\n\f20\n\n(b)\n\n(c)\n\nafford the licensee an opportunity to object in writing within the period\nof 14 days after the date of issue of the notice;\n\ntake into consideration the objection of the licensee made pursuant to\nparagraph (b).\n\nOccasional vending that is not on a beach, an esplanade or in a garden\nor a park\n\nA person who seeks to engage in occasional vending in a place that is\n10.(1)\nnot a beach, an esplanade, or in a garden or a park pursuant to section 3(1)(b)\nshall apply to the Minister for a permit to do so and shall\n\n(a)\n\nsubmit an application for the purpose set out in Part I of the Second\nSchedule;\n\n(b)\n\nin the case of an applicant who seeks to operate as a food vendor,\n\n(i)\n\n(ii)\n\na  certificate  of  good  health  issued  by  a  registered  medical\npractitioner; and\n\na licence to carry on a food business granted pursuant to the Health\nServices (Food Hygiene) Regulations, 1969 (S.I. 1969 No. 232);\nand\n\n(c)\n\npay the relevant fee set out in the Third Schedule.\n\nThe Minister may grant a permit to the applicant referred to in subsection\n(2)\n(1) and the permit shall be in the form set out in Part II of the Second Schedule.\n\n(3)\n\nThe permit referred to in subsection (2)\n\n(a)\n\nshall be valid for the duration of a fair, farmers market, festival, carnival\nor a cultural, entrepreneurial, religious or recreational event only; and\n\n(b)\n\nis not transferable.\n\nThe Minister may refuse to grant, revoke, suspend or vary a permit and\n\n(4)\nshall give notice of that decision in writing.\n\n\f21\n\n(5)\nA person who is aggrieved by a decision of the Minister under this section\nshall  appeal  to  a  Judge  in  Chambers  upon  receipt  of  notice  referred  to  in\nsubsection (4).\n\nA person who engages in occasional vending without a permit shall be\n\n(6)\nsubject to the payment of an administrative penalty imposed under section 28.\n\nOccasional vending on a beach, an esplanade or in a garden or a park\n\n11.(1)\nA person who seeks to engage in occasional vending on a beach, an\nesplanade or in a garden or a park pursuant to section 3(1)(b) shall apply to the\nNational Conservation Commission for a permit to do so and shall\n\n(a)\n\nsubmit an application for the purpose set out in Part III of the Second\nSchedule;\n\n(b)\n\nin the case of an applicant who seeks to operate as a food vendor,\n\n(i)\n\n(ii)\n\na  certificate  of  good  health  issued  by  a  registered  medical\npractitioner; and\n\na licence to carry on a food business granted pursuant to the Health\nServices (Food Hygiene) Regulations, 1969 (S.I. 1969 No. 232);\nand\n\n(c)\n\npay the relevant fee set out in the Third Schedule.\n\nThe  National  Conservation  Commission  may  grant  a  permit  to  the\n(2)\napplicant referred to in subsection (1) and the permit shall be in the form set out\nin Part IV of the Second Schedule.\n\n(3)\n\nThe permit referred to in subsection (2)\n\n(a)\n\nshall be valid for the duration of a fair, farmers market, festival, carnival\nor a cultural, entrepreneurial, religious or recreational event only; and\n\n(b)\n\nis not transferable.\n\nThe  National  Conservation  Commission  may  refuse  to  grant,  revoke,\n\n(4)\nsuspend or vary a permit and shall give notice of that decision in writing.\n\n\f22\n\n(5)\nA  person  who  is  aggrieved  by  a  decision  of  the  National  Conservation\nCommission under this section shall appeal to a Judge in Chambers upon receipt\nof notice referred to in subsection (4).\n\nA person who engages in occasional vending without a permit shall be\n\n(6)\nsubject to the payment of an administrative penalty imposed under section 28.\n\nItinerant vending\n\n12.(1)\n3(1)(c) shall apply to the Minister for a permit to do so and shall\n\nA person who seeks to engage in itinerant vending pursuant to section\n\n(a)\n\nsubmit an application for the purpose set out in Part V of the Second\nSchedule;\n\n(b)\n\nin the case of an applicant who seeks to operate as a food vendor,\n\n(i)\n\n(ii)\n\na  certificate  of  good  health  issued  by  a  registered  medical\npractitioner; and\n\na licence to carry on a food business granted pursuant to the Health\nServices (Food Hygiene) Regulations, 1969 (S.I. 1969 No. 232);\nand\n\n(c)\n\npay the relevant fee set out in the Third Schedule.\n\nThe Minister may grant a permit to the applicant referred to in subsection\n(2)\n(1)  and  the  permit  shall  be  in  the  form  set  out  in  Part  VI  of  the  Second\nSchedule.\n\n(3)\n\nThe permit referred to in subsection (2)\n\n(a)\n\nbe valid for one year and may be renewed on the expiration of that\npermit  upon  the  payment  of  the  relevant  fee  set  out  in  the  Third\nSchedule; and\n\n(b)\n\nis not transferable.\n\nThe Minister may refuse to grant, revoke, suspend or vary a permit and\n\n(4)\nshall give notice of that decision in writing.\n\n\f23\n\n(5)\nA person who is aggrieved by a decision of the Minister under this section\nshall  appeal  to  a  Judge  in  Chambers  upon  receipt  of  notice  referred  to  in\nsubsection (4).\n\nA person who engages in occasional vending without a permit shall be\n\n(6)\nsubject to the payment of an administrative penalty imposed under section 28.\n\nNotwithstanding  sections  10  and  11,  a  person  granted  permit  under\n(7)\nsubsection  (2)  may  operate  at  a  fair,  festival,  carnival  or  a  cultural,\nentrepreneurial,  religious  or  recreational  event  without  obtaining  a  permit\nrequired pursuant to sections 10 and 11.\n\nPART IV\n\nVENDING ZONES\n\nVending zones\n\n13.\n\nFor the purposes of this Act, a vending zone refers to\n\n(a)\n\n(b)\n\n(c)\n\na beach;\n\nan esplanade;\n\na fish landing site;\n\n(d)\n\na garden;\n\n(e)\n\na park;\n\n(f)\n\n(g)\n\n(h)\n\na public market;\n\nthe  areas  more  particularly  described  in  Part  II  of  the  Fourth\nSchedule;\n\na zone designated by the Minister on consultation with the National\nVending Committee.\n\n\f24\n\nDesignation of a vending zone\n\n14.\nmay by order designate a vending zone for the purposes of this Act.\n\nThe Minister, on consultation with the National Vending Committee,\n\nBeaches, esplanades, gardens and parks\n\n15.(1)\nmanagement and operation of a vending zone that is\n\nThe National Conservation Commission shall be responsible for the\n\n(a)\n\n(b)\n\n(c)\n\na beach;\n\nan esplanade;\n\na garden; or\n\n(d)\n\na park.\n\nWhere a vendor seeks to operate on a beach, an esplanade or in a garden\n(2)\nor  a  park  he  shall  do  so  in  compliance  with  the  National  Conservation\nCommission Act, Cap. 393.\n\nPublic Markets and fish landing sites\n\n16.(1)\noperation of\n\nThe Manager of Markets shall be responsible for the management and\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\na public market that is not a fish market;\n\nan area more particularly described in Part II of the Fourth Schedule;\n\nthe areas where a person is engaged in itinerant vending;\n\na zone designated by the Minister on consultation with the National\nVending Committee.\n\nThe Senior Manager of Markets shall be responsible for the management\n\n(2)\nand operation of a public market that is a fish market.\n\nThe Chief Fisheries Officer shall be responsible for the management and\n\n(3)\noperation of a fish landing site.\n\n\f25\n\n(4)\nWhere  a  vendor  seeks  to  operate  in  a  public  market,  he  shall  do  so  in\ncompliance  with  the  Markets  and  Slaughter-Houses  Act,  Cap.  265  and  the\nMarkets and Slaughter-Houses Regulations, 1958 (L.N. 1958 No. 73).\n\nPART V\n\nRIGHTS AND OBLIGATIONS OF VENDORS\n\nRights of vendors\n\n17.(1)\n\nA vendor has the right to carry on the business of vending\n\n(a)\n\n(b)\n\nin  accordance  with  the  terms  and  conditions  of  the  licence  granted\nunder this Act;\n\nsubject  to  the  provisions  of  this  Act  or  statutory  instruments  made\nthereunder or any relevant enactment pertaining to the vendors,\n\nwithout fear of harassment or unreasonable impediments.\n\nA vendor who is operating pursuant to section 3(1)(a) is entitled to 30 days’\n\n(2)\nnotice before the imposition of an eviction notice subject to section 19(3).\n\nWhere a vendor who is operating pursuant to section 3(1)(a) is subject to\n\n(3)\na relocation notice pursuant to section 19(2) he is entitled to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n30 days’ notice before the imposition of a relocation notice;\n\nbe consulted in respect of any assignment to a new site or location in\nrelation to the carrying out of his vending business;\n\nbe assigned to a new site or location which is conducive to the carrying\nout of his vending business;\n\nreclaim any merchandise which is seized pursuant to the eviction or\nrelocation notice;\n\nmake a claim for compensation in writing to the Manager of Vending\nZones for any loss, damage or destruction of merchandise pursuant to\n\n\f26\n\na relocation notice issued under section 19 or a seizure notice issued\nunder section 20 subject to paragraph (f);\n\n(f)\n\ncompensation  for  any  loss,  damage  or  destruction  of  merchandise\nseized pursuant to a relocation notice subject to section 20(5).\n\nFor  the  purposes  of  subsection  (3)(b),  “consulted”  shall  entail  that  the\n(4)\nManager of Vending Zones shall within the 30 day notice period write to the\nvendor stating the reasons for the assignment of the new site or location of his\nvending business and the vendor shall respond to the Manager of Vending Zones\nin writing within the 30 day notice period stating his objections to the assignment\nto the day notice period.\n\nThe statement of reasons by the Manager of Vending Zones referred to in\n(5)\nsubsection (4) shall take into account discussions on the subject of relocation of\na vendor with the\n\n(a)\n\n(b)\n\norganisations that represent the interests of vendors generally; and\n\norganisation that represents the interest of the vendor who is the subject\nof the relocation in particular if applicable\n\nand  the  written  record  of  the  result  of  those  discussions  shall  accompany  the\nstatement of reasons.\n\nGeneral obligations of vendors\n\n18.(1)\n\nA vendor shall\n\n(a)\n\n(b)\n\nproduce his licence or permit for inspection where requested to do so\nby a customer, the Manager of Vending Zones or a person authorised\nby the Manager to conduct such inspections;\n\nremove his merchandise and any equipment, materials, wares or goods\nused  in  conducting  his  vending  business  at  the  expiration  of  time\nallotted to him for conducting his business by\n\n(i)\n\ncondition of his licence or permit;\n\n\f27\n\n(ii)\n\nenactment; or\n\n(iii)\n\ncontract;\n\n(c)\n\n(d)\n\nmaintain the cleanliness of a vending zone;\n\nkeep amenities and any other public property, equipment or tools in a\nvending zone in good condition;\n\n(e)\n\nnot, while vending,\n\n(i)\n\nuse threatening, abusive or insulting words or behaviour;\n\n(ii)\n\nintimidate or harass any person;\n\n(iii)\n\nconsume or be under the influence of alcohol or drugs;\n\n(iv)\n\nsell,  serve  or  distribute  alcohol  without  an  appropriate  liquor\nlicence; and\n\n(f)\n\nwhere he sells, offers or exposes for sale food he and his employees\nshall comply with the Health Services (Food Hygiene) Regulations,\n1969 (S.I. 1969 No. 232).\n\nWhere a dispute arises between vendors operating pursuant to section 3(1)\n(2)\n(a), the parties to the dispute may seek the assistance of the Manager of Vending\nZones to resolve the dispute within 14 days after the dispute has been reported\nand where a party is aggrieved by a decision of the Manager in relation to the\nresolution of the dispute he shall appeal to the National Vending Appeals Tribunal\nwithin  14  days  of  the  receipt  of  the  decision  of  the  Manager  which  shall  be\ncommunicated to the parties to the dispute in writing.\n\nThe  Manager  of  Vending  Zones  in  resolving  any  conflict  pursuant  to\n(3)\nsubsection (2) shall give such directions which facilitate the maintenance of order\nor regularity and are conducive with the conducting of business in the interests\nof vending generally and in the interests of the parties to the dispute in particular.\n\nA person who contravenes subsection (1) shall be subject to the payment\n\n(4)\nof an administrative penalty imposed under section 28.\n\n\f28\n\nPART VI\n\nRELOCATION AND EVICTION OF VENDORS\n\nRelocation or eviction of vendors\n\nSubject to subsection (3), no vendor shall be relocated or evicted by\n19.(1)\nthe Manager of Vending Zones from a vending zone specified in the vending\nlicence unless he has been given 30 days’ notice.\n\nThe Manager of Vending Zones may issue an eviction or relocation notice\n\n(2)\npursuant to subsection (1) where\n\n(a)\n\nthe vendor is in breach of\n\n(i)\n\na condition of his licence;\n\n(ii)\n\nthe provisions of this Act, any regulations made thereunder or any\nother relevant enactment;\n\nthe vendor’s vending licence has been suspended or revoked pursuant\nto section 8;\n\nthere is an emergency within the meaning of section 2 of the Emergency\nManagement Act, Cap. 160A;\n\n(b)\n\n(c)\n\n(d)\n\nthere is danger to public safety, public order or public health.\n\n(3)\n\nNotwithstanding subsection (1) where\n\n(a)\n\nthere is an emergency within the meaning of section 2 of the Emergency\nManagement Act, Cap. 160A; or\n\n(b)\n\nthere is danger to public safety, public order or public health\n\nthe Manager of Vending may issue an emergency eviction or relocation notice\nwithout giving 30 days notice as required under subsection (1).\n\nA notice issued under this section shall be in the form set out in the Fifth\n\n(4)\nSchedule.\n\n\f29\n\n(5)\nThe Manager of Vending Zones shall inform a member of the Police Force\nof a notice issued under this section and shall seek the assistance of a member of\nthe Police Force where necessary.\n\nSeizing and reclaiming of goods\n\n20.(1)\nthe Manager of Vending Zones may seize the merchandise of the vendor.\n\nWhere a vendor fails to vacate a vending zone pursuant to section 19,\n\n(2)\n\nThe Manager of Vending Zones shall\n\n(a)\n\nissue a seizure notice, in the form set out in the Fifth Schedule, to the\nvendor  informing  him  of  the  seizure  of  his  merchandise  and  shall\ninclude\n\n(i)\n\nthe time the merchandise was seized;\n\n(ii)\n\nthe location to which the merchandise has been transferred;\n\n(iii)\n\n(iv)\n\na  list  of  the  merchandise  seized  signed  by  the  Manager  of\nVending Zones;\n\na description of the items seized including quantity, weight, size,\ncondition of item and any other descriptor that the Manager of\nVending Zones determines as relevant;\n\n(v)\n\nthe procedure for reclaiming the merchandise seized; and\n\n(b)\n\ninform a member of the Police Force of the notice of the seizure referred\nto in paragraph (a) and shall seek the assistance of a member of the\nPolice Force where necessary.\n\nA  vendor  shall  seek  to  reclaim  the  merchandise  seized  pursuant  to\n(3)\nsubsection (1) within 24 hours of the receipt of the seizure notice referred to in\nsubsection (1) and shall comply with the procedure for reclaiming merchandise\nset out in that seizure notice.\n\n\f30\n\nWhere the merchandise that is the subject of the seizure notice referred to\n\n(4)\nin subsection (1) is\n\n(a)\n\n(b)\n\nnon-perishable  the  Manager  of  Vending  Zones  shall  release  the\nmerchandise to the vendor within 2 working days of the claim of the\nvendor; and\n\nperishable  the  Manager  of  Vending  Zones  shall  release  the\nmerchandise immediately to the vendor on receipt of a claim from the\nvendor.\n\nThe vendor shall be compensated for loss or damage to merchandise where\n(5)\nthe seizure was executed pursuant to the circumstances set out in paragraphs (c)\nand (d) of section 19(2) and the compensation shall not exceed the value of the\nmerchandise seized.\n\nWhere  a  person  does  not  claim  the  merchandise  seized  pursuant  to\n(6)\nsubsection (1), the Manager of Vending Zones shall sell the merchandise or if a\nsale cannot be conducted, dispose of it in an appropriate manner.\n\nThe proceeds of a sale conducted pursuant to subsection (6) shall be paid\n\n(7)\ninto the Consolidated Fund.\n\nPART VII\n\nNATIONAL VENDING COMMITTEE\n\nEstablishment of National Vending Committee\n\n21.(1)\nas the National Vending Committee.\n\nFor the purposes of this Act there is established a body to be known\n\nThe  provisions  of  the  Sixth  Schedule  have  effect  with  respect  to  the\n\n(2)\nconstitution of the Committee and otherwise in relation thereto.\n\n\f31\n\nFunctions of the Committee\n\n22.\n\nThe Committee shall advise\n\n(a)\n\nthe  Minister  responsible  for  Commerce  on  matters  relating  to  the\nNational Vending Policy including\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\noverseeing the implementation of the Policy;\n\nassessing  the  implementation  risks  of  any  one  or  more  of  the\nPolicy recommendations;\n\nmonitoring and evaluating the achievement of the objectives of\nthe Policy;\n\nensuring  that  all  government  related  entities  involved  in  the\nimplementation  of  the  Policy  consider  their  responsibilities\ntherein and design their work plans to suit;\n\n(v)\n\npreparing annual briefings on the status of the implementation of\nthe Policy; and\n\n(b)\n\nthe Minister responsible for Commerce, Minister responsible for public\nmarkets, the Minister responsible for beaches, esplanades, gardens and\nparks and the Minister responsible for fisheries on the following:\n\n(i)\n\n(ii)\n\nmonitoring and ensuring continued upgrade and maintenance of\nvending zones;\n\nmonitoring  the  compliance  of  vendors  with  the  conditions\napplicable  to  the  vending  zone  allocated  to  them  and  the\nconditions under which the zone has been allocated;\n\n(iii)\n\nstandards that should be adhered to by vendors relating to\n\n(A)\n\npersonal hygiene;\n\n(B)\n\nthe cleanliness and public hygiene in the vending zones;\n\n\f32\n\n(iv)\n\nthe amenities that should be made available in vending zones for\nvendors including access to\n\n(A)\n\nwaste disposal;\n\n(B)\n\npublic toilets to maintain cleanliness;\n\n(C)\n\ndrinking water;\n\n(D)\n\nprotective covers to protect against the weather;\n\n(E)\n\nstorage facilities including cold storage;\n\n(v)\n\nthe aesthetic design of stalls.\n\nPART VIII\n\nAPPEALS\n\nAppeal\n\n23.(1)\n\nA person who is aggrieved by\n\n(a)\n\na decision of the Minister to\n\n(i)\n\nrefuse the grant of a licence pursuant to section 5(1);\n\n(ii)\n\nrefuse the renewal of a licence pursuant to section 6(1);\n\n(iii)\n\nrevoke,  suspend  or  vary  a  licence  pursuant  to  section  8(1)  or\nrefuse to vary a licence pursuant to section 8(3);\n\n(b)\n\na decision of the Commission to\n\n(i)\n\nrefuse the grant of a licence pursuant to section 5(4);\n\n(ii)\n\nrefuse the renewal of a licence pursuant to section 6(2);\n\n(iii)\n\nrevoke,  suspend  or  vary  a  licence  pursuant  to  section  8(2)  or\nrefuse to vary a licence pursuant to section 8(4);\n\n\f(c)\n\na decision of the Manager of Vending Zones\n\n33\n\n(i)\n\nin relation to the resolution of disputes pursuant to section 18(2);\n\n(ii)\n\nto issue a relocation or eviction notice pursuant to section 19;\n\n(iii)\n\n(iv)\n\nin relation to the amount of compensation to be paid pursuant to\nsection 17(3)(e) and (f) or section 20(4);\n\nin  relation  to  an  administrative  penalty  imposed  pursuant  to\nsection 28\n\nmay, within 14 days’ of the receipt by him of a notice of the decision, appeal to\nthe National Vending Appeals Tribunal.\n\nWhere a person not granted a licence within the 7 day period referred to\n(2)\nin section 5(2) or (4) he may appeal to the National Vending Appeals Tribunal.\n\nEstablishment of National Vending Appeals Tribunal\n\n24.(1)\nshall hear appeals on the grounds set out in section 23.\n\nThere  is  established  an  National  Vending  Appeals  Tribunal  which\n\n(2)\n\nThe Tribunal shall be comprised of\n\n(a)\n\n(b)\n\n(c)\n\nan attorney-at-law of at least 10 years’ standing;\n\na vendor nominated by an organisation that represents the interests of\nvendors;\n\na person with knowledge and experience in the business of vending\nand the operation of markets or areas designated for vending.\n\nThe members of the Tribunal shall be appointed by Minister responsible\n(3)\nfor judicial affairs by an instrument in writing for a period of 3 years and shall\nbe eligible for re-appointment.\n\nThe  members  of  the  Tribunal  shall  receive  such  remuneration  as  the\n\n(4)\nMinister responsible for finance determines.\n\n\f34\n\nSuspension of decisions pending appeal to Tribunal\n\n25.\n\nThe\n\n(a)\n\n(b)\n\n(c)\n\nMinister;\n\nCommission; or\n\nManager of Vending Zones\n\nshall, pending an appeal under section 23 on the application of the appellant,\nsuspend the operation of their decision until the appeal is determined.\n\nPower of Tribunal\n\n26.\n\nThe Tribunal may on hearing an appeal\n\n(a)\n\nin relation to a refusal to issue a licence, referred to in paragraph (a)(i)\nof  section  23(1)  and  paragraph  (b)(i)  of  section  23(1),  dismiss  the\nappeal or allow the appeal and direct the\n\n(i)\n\nMinister; or\n\n(ii)\n\nCommission\n\nto issue a licence to the appellant;\n\n(b)\n\nbased on the grounds set out in paragraph (a), subparagraphs (ii) and\n(iii), of section 23(1),\n\n(i)\n\ndismiss the appeal and confirm the decision of the Minister;\n\n(ii)\n\nallow the appeal and set aside the decision of the Minister;\n\n(iii)\n\nallow the appeal and direct that the matter in respect of which the\ndecision of the Minister was made be further considered by that\nMinister;\n\n(c)\n\nbased on the grounds set out in paragraph (b), subparagraphs (ii) and\n(iii), of section 23(1),\n\n(i)\n\ndismiss the appeal and confirm the decision of the Commission;\n\n\f35\n\n(ii)\n\nallow the appeal and set aside the decision of the Commission;\n\n(iii)\n\nallow the appeal and direct that the matter in respect of which the\ndecision of the Commission was made be further considered by\nthat Commission;\n\n(d)\n\nbased on the grounds set out in paragraph (c)(i) of section 23(1),\n\n(i)\n\n(ii)\n\n(iii)\n\ndismiss the appeal and confirm the decision of the Manager of\nVending Zones;\n\nallow  the  appeal  and  set  aside  the  decision  of  the  Manager  of\nVending Zones;\n\nallow the appeal and direct that the matter in respect of which the\ndecision of the Manager of Vending Zones was made be further\nconsidered by the Manager of Vending Zones; or\n\n(d)\n\nbased on the grounds set out in paragraph (c)(ii) of section 23(1),\n\n(i)\n\n(ii)\n\n(iii)\n\ndismiss the appeal and confirm the decision of the Manager of\nVending Zones;\n\nallow  the  appeal  and  set  aside  the  decision  of  the  Manager  of\nVending Zones;\n\nallow the appeal and direct that the matter in respect of which the\ndecision of the Manager of Vending Zones was made be further\nconsidered by the Manager of Vending Zones; or\n\n(e)\n\nbased on the ground set out in paragraph (c)(iii) of section 23(1)\n\n(i)\n\n(ii)\n\ndismiss  the  appeal  and  confirm  the  decision  of  the  Manager  of\nVending Zones in respect of compensation;\n\nallow  the  appeal  and  set  aside  the  amount  of  compensation\nprovided  for  by  the  Manager  of  Vending  Zones  and  impose  in\nsubstitution therefor such other amount of compensation pursuant\nto section 17(3)(e)and (f) and section 20(4) that the Tribunal thinks\nfit;\n\n\f36\n\n(f)\n\nbased on the ground set out in paragraph (c)(iv) of section 23(1)\n\n(i)\n\n(ii)\n\ndismiss  the  appeal  and  confirm  the  decision  of  the  Manager  of\nVending Zones in respect of the administrative penalty;\n\nallow the appeal and set aside the administrative penalty imposed\nby  the  Manager  of  Vending  Zones  and  impose  in  substitution\ntherefor such other administrative penalty that the Tribunal thinks\nfit in accordance with the Seventh Schedule; or\n\n(g)\n\nbased on the ground set out in section 23(2) dismiss the appeal or allow\nthe appeal and direct the\n\n(i)\n\nMinister; or\n\n(ii)\n\nCommission\n\nto issue a licence to the appellant.\n\nAppeal to High Court\n\n27.\nfrom the decision of the Tribunal on a point of law to the High Court.\n\nA party to an appeal to the Tribunal pursuant to section 23 may appeal\n\nPART IX\n\nADMINISTRATIVE PENALTIES\n\nAdministrative penalties\n\n28.\nA person who contravenes a provision set out in Part I of the Seventh\nSchedule is liable to pay to the Manager of Vending Zones an administrative\npenalty in the amount so specified in the Seventh Schedule.\n\nAdministrative penalty notice\n\n29.(1)\nThe Manager of Vending Zones shall issue an administrative penalty\nnotice in the form set out in Part II of the Seventh Schedule to any person where\n\n\f37\n\nthe Manager of Vending Zones is satisfied that, that person has contravened a\nprovision set out in Part I of the Seventh Schedule.\n\nAn  administrative  penalty  notice  shall  specify  the  nature  of  the  act\n(2)\nconstituting the contravention, the penalty to be paid and shall require the person\nto whom it is addressed to pay the penalty within 30 days of the date of the notice.\n\nA  person  who  is  in  receipt  of  an  administrative  penalty  notice  issued\n(3)\npursuant to subsection (1) shall pay the amount of the penalty set out in the notice\non or before the date specified in the notice.\n\nNotwithstanding subsection (3) where the Manager of Vending Zones is\n(4)\nsatisfied on grounds of undue hardship or for any other reason that it would be\njust and equitable to do so, he may arrange with the person who is the subject of\nthe penalty notice to pay the penalty set out in the notice in instalments.\n\nProcedure for challenging an alleged administrative contravention\n\nNotwithstanding section 29(3), a person to whom an administrative\n30.\npenalty  notice  is  addressed  and  who  wishes  to  challenge  the  alleged\ncontravention, may instead of paying the amount of the administrative penalty,\napply to the Tribunal in accordance with section 23.\n\nAdministrative penalty to constitute a debt to the State\n\n31.\nThe amount of an outstanding administrative penalty constitutes a debt\nto the State and is recoverable in civil proceedings before a magistrate’s court.\n\nPART X\n\nMISCELLANEOUS\n\nFees\n\n32.(1)\nConsolidated Fund.\n\nThe fees collected by the Minister under this Act shall be paid into the\n\n\f38\n\n(2)\nThe fees collected by the Commission under this Act shall be retained to\nthe Commission and shall constitute the funds of the Commission as set out in\nsection 10 of the National Conservation Commission Act, Cap. 393.\n\nTransitional\n\n33.(1)\n\nAny licence or permit issued under the\n\n(a)\n\n(b)\n\nNational Conservation Commission Act, Cap. 393; or\n\nMarkets and Slaughter-Houses Regulations, 1958 (L.N. 1958 No. 73)\n\nprior  to  the  commencement  of  this  Act  shall  be  valid  for  one  year  after  the\ncommencement of this Act.\n\nAfter the expiration of the period referred to in subsection (1) a person\n(2)\nseeking to operate as a vendor shall apply for the requisite licence or permit to\ndo so under this Act.\n\nRegulations\n\n34.\n\nThe Minister may make regulations generally to give effect to this Act.\n\nAmendment of Schedules\n\n35.\nFifth, Sixth and Seventh Schedules.\n\nThe Minister may by order amend the First, Second, Third, Fourth,\n\nExpungement\n\nNotwithstanding\n\n36.\nthe  Criminal  Records\nthe  provisions  of\n(Rehabilitation of Offenders) Act, Cap. 127A, the record of any sentence of a\nperson convicted of an offence of selling or offering or exposing for sale of goods,\nwares or merchandise in a public place, on a street, a lane, an alley, a road, a\nhighway,  a  beach  or  within  the  curtilage  of  that  person’s  residence  without  a\nlicence,  permit  or  any  other  similar  document  under  any  enactment  shall  be\ndeemed to be expunged with effect from the commencement of this Act.\n\n\f39\n\nConsequential amendments\n\n37.\namended in the manner specified in Column 2 of the Eighth Schedule.\n\nThe  enactments  set  out  in  Column  1  of  the  Eighth  Schedule  are\n\nCommencement\n\n38.\n\nThis Act shall come into operation on a date fixed by proclamation.\n\n\f40\n\nL.R.O. 1998FIRST SCHEDULE(Sections 5 and 6)Part IApplication Form and Licence for Vendor's LicenceNational Vending Act, 2021 (Act 2021-    )     Application for Vendor's Licence for Vendors notoperating on a Beach or an Esplanade or in a Garden or Park1. Name of applicant: 2. Sex:3. Date of birth:4. National identiﬁ cation number:5. Residential address:6. Contact number:7. Email address:\f41\n\n L.R.O. 1998First Schedule - (Cont'd)8. Type of vending to be engaged in:9. Type of merchandise to be sold:                                          10. Type of service to be rendered:                                                                                                                                                                                                                                                                                                                          (a) Car park vending(b) Highway vending(c) Itinerant vending(d) Outdoor market vending(e) Public markets(f) Vending outside of the  premises of a school(g) Street vending(h) Vending of non-essential  and quickly perishable  products(i) Vending unit(j) Vending village(Date of application)(DD/MM/YYYY)(Signature of applicant)\f42\n\n L.R.O. 1998First Schedule - (Cont'd)                             FOR OFFICIAL PURPOSES ONLY  Application: Approved Not Approved                                                                                                                                                                                                                                                                                                                       (Date of approval of application)(DD/MM/YYYY)(Signature of Minister responsible for Commerce)(Signature of Minister responsible for Public Markets)(Signature of Minister responsible for Fisheries)\f43\n\nL.R.O. 1998(Section 6)Part IIVending LicenceNational Vending Act, 2021 (Act 2021-    ) Vending Licence for Vendors not operating on a Beach or an Esplanade or in a Garden or Park  Name:  Sex: Date of birth: National identiﬁ cation number: Type of vending: Vending zone:Photograph(Vending Licence No.)First Schedule - (Cont'd)\f44\n\n L.R.O. 1998        Type of merchandise to be sold:                                                                       Type of service to be rendered: (Date of issue)(DD/MM/YYYY)(Signature of vendor)(Signature of the Minister responsible for Commerce)First Schedule - (Cont'd)(Signature of the Minister responsible for Public Markets)(Signature of the Minister responsible for Fisheries)\f45\n\nL.R.O. 1998(Section 5)Part IIIApplication Form and Licence for Vendor's LicenceNational Vending Act, 2021 (Act 2021-    )     Application for Vendor's Licencefor Vending on a Beach or an Esplanade or in a Garden or Park 1. Name of applicant: 2. Sex:3. Date of birth:4. National identiﬁ cation number:5. Residential address:6. Contact number:7. Email address:First Schedule - (Cont'd)\f46\n\n L.R.O. 1998First Schedule - (Cont'd)8. Type of vending to be engaged in:  (a) Beach vending (b)  Esplanade Vending (c)  Garden vending  (d)  Park vending9. Type of merchandise to be sold:                                          10. Type of service to be rendered:FOR OFFICIAL PURPOSES ONLY  Application: Approved Not Approved                                                                                                                                                                                                                                                                                                                       (Date of approval of application)(DD/MM/YYYY)(Signature of Chairman of National Conservation Commission)(Date of application)(DD/MM/YYYY)(Signature of applicant)\f47\n\nL.R.O. 1998(Section 6)Part IVVending Licence National Vending Act, 2021 (Act 2021-    ) Vending Licence for Vending on a Beach or an Esplanade or a Garden or Park Name:  Sex: Date of birth: National identiﬁ cation number: Type of vending: Vending zone:Photograph(Vending Licence No.)First Schedule - (Cont'd)\f48\n\n L.R.O. 1998        Type of merchandise to be sold:                                                                       Type of service to be rendered: (Date of issue)(DD/MM/YYYY)(Signature of vendor)(Signature of Chairman of the National Conservation Commission)First Schedule - (Concl'd)\f49\n\nL.R.O. 1998SECOND SCHEDULE(Sections 10 and 11)Part IApplication Form and Permit for Occasional VendingNational Vending Act, 2021 (Act 2021-    )     Application Form and Permit for Occasional Vending for Vendorsnot operating on a Beach or an Esplanade or in a Garden or Park1. Name of applicant: 2. Sex:3. Date of birth:4. National identiﬁ cation number:5. Residential address:6. Contact number:7. Email address:8. Type of occasional vending event:(a) Fair (b) Farmers market (c) Festival(d) Carnival(e) Cultural or  (f) Religious event    recreational event  \f50\n\n L.R.O. 1998Second Schedule - (Cont'd)9. Name of occasional vending event:10. Date of occasional vending event:11. Duration of occasional vending event:12. Type of merchandise to be sold (Where applicable):13. Type of service to be rendered (Where applicable):                                          FOR OFFICIAL PURPOSES ONLY  Application: Approved Not Approved                                                                                                                                                                                                                                                                                                                     (Date of approval of application)(DD/MM/YYYY)(Signature of Minister responsible for Commerce)(Date of application)(DD/MM/YYYY)(Signature of applicant)\f51\n\nL.R.O. 1998(Section 10)Part IIPermit for Occasional VendingNational Vending Act, 2021 (Act 2021-    ) Permit for Occasional Vending for Vendorsnot operating on a Beach or an Esplanade or in a Garden or Park 1. Name of applicant: 2. Sex:3. Date of birth:4. National identiﬁ cation number:5. Name of occasional vending event:6. Date of occasional vending event:7. Duration of occasional vending event:8. Type of Merchandise to be sold (Where applicable): Second Schedule - (Cont'd)\f52\n\n L.R.O. 19989.  Type of service to be rendered (Where applicable): Second Schedule - (Cont'd)(Signature of applicant)(Signature of the Minister responsible for Commerce)(Date of application)(DD/MM/YYYY)\f53\n\nL.R.O. 1998(Section 11)Part IIIApplication Form and Permit for Occasional VendingNational Vending Act, 2021 (Act 2021-    )     Application Form for Occasional Vending for Vendingon the Beach or an Esplanade or in a Garden or a Park1. Name of applicant: 2. Sex:3. Date of birth:4. National identiﬁ cation number:5. Residential address:6. Contact number:7. Email address:8. Type of occasional vending event:(a) Fair (b) Farmers market (c) Festival(d) Carnival(e) Cultural or  (f) Religious event    recreational event  Second Schedule - (Cont'd)\f54\n\n L.R.O. 1998Second Schedule - (Cont'd)9. Name of occasional vending event:10. Date of occasional vending event:11. Duration of occasional vending event:12. Type of merchandise to be sold (Where applicable):13. Type of service to be rendered (Where applicable):                                          FOR OFFICIAL PURPOSES ONLY  Application: Approved Not Approved                                                                                                                                                                                                                                                                                                                     (Date of approval of application)(DD/MM/YYYY)(Signature of Chairman of NationalConservation Commission)(Date of application)(DD/MM/YYYY)(Signature of applicant)\f55\n\nL.R.O. 1998(Section 11)Part IVPermit for Occasional VendingNational Vending Act, 2021 (Act 2021-    ) Permit for Occasional Vending for Vendingon a Beach or an Esplanade or in a Garden or a Park 1. Name of applicant: 2. Sex:3. Date of birth:4. National identiﬁ cation number:5. Name of occasional vending event:6. Date of occasional vending event:7. Duration of occasional vending event:8. Type of Merchandise to be sold (Where applicable): Second Schedule - (Cont'd)\f56\n\n L.R.O. 19989. Type of service to be rendered (Where applicable):                                                   Second Schedule - (Cont'd)(Signature of applicant)(Signature of the National Conservation Commission)(Date of application)(DD/MM/YYYY)\f57\n\nL.R.O. 1998(Section 12)Part VApplication Form for Itinerant Vending PermitNational Vending Act, 2021 (Act 2021-    )     Application Form for Itinerant Vending Permit1. Name of applicant: 2. Sex:3. Date of birth:4. National identiﬁ cation number:5. Residential address:6. Contact number:7. Email address:8. Type of merchandise to be sold (Where applicable):Second Schedule - (Cont'd)\f58\n\nL.R.O. 1998Second Schedule - (Cont'd)9. Type of service to be rendered (Where applicable):FOR OFFICIAL PURPOSES ONLY  Application: Approved Not Approved (Date of approval of application)(DD/MM/YYYY)(Signature of Minister responsible for Commerce)(Signature of applicant)(Date of application)(DD/MM/YYYY)\f59\n\nL.R.O. 1998Second Schedule - (Cont'd)(Section 12)Part VIItinerant Vending PermitNational Vending Act, 2021 (Act 2021-    )     Itinerant Vending Permit1. Name of applicant: 2. Sex:3. Date of birth:4. National identiﬁ cation number:5. Itinerant vending permit number:6. Type of merchandise to be sold (Where applicable):\f60\n\n L.R.O. 1998Second Schedule - (Concl'd)7. Type of service to be rendered (Where applicable):(Signature of applicant)(Date of application)(DD/MM/YYYY)(Signature of the Minister responsible for Commerce)\f61\n\nTHIRD SCHEDULE\n\n(Sections 5, 6, 10, 11 and 12)\n\nFees\n\n1. Vending  Licence  for  vendors  not\noperating on a beach or an esplanade\nor in a garden or park\n\n2. Renewal  of  Vending  Licence  for\nvendors not operating on a beach or\nan esplanade or in a garden or park\n\n3 Vending  Licence\n\nfor  vendors\noperating on a beach or an esplanade\nor in a garden or park\n\n4. Renewal  of  Vending  Licence  for\nvendors operating on a beach or an\nesplanade or in a garden or park\n\n5.\n\nItinerant Vending Permit\n\n6. Renewal  of\n\nItinerant  Vending\n\nPermit\n\n7. Occasional Vending permit vendors\noperating on a beach or an esplanade\nor in a garden or park\n\n8. Occasional Vending permit vendors\nnot  operating  on  a  beach  or  an\nesplanade or in a garden or park\n\n$ 50\n\n$ 50\n\n$ 150\n\n$ 100\n\n$ 50\n\n$ 50\n\n$ 50\n\n$ 25\n\n\f62\n\nFOURTH SCHEDULE\n\nLists and Descriptions\n\nPart I\n\nList of Esplanades, Gardens and Parks\n\n(Sections 2 and 13)\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nKing George V Memorial Park\n\nFarley Hill National Park\n\nBay Street Esplanade\n\nFitts Village Esplanade\n\nHastings Esplanade\n\nSpeightstown Esplanade\n\nIndependence Square, Jubilee Gardens\n\nFolkstone Marine Park\n\nQueen’s Park\n\nDescription of certain vending zones pursuant to section 13(g)\n\nPart II\n\n1.\nThe area in the vicinity of the Public Market situate at Fairchild Street, St. Michael,\nfrom and inclusive of the junction of Halls Road and Tweedside Road along the roads Halls Road,\nMartindales Road and Jemmotts Lane in a straight line to the sea, then along the sea coast to the\nPier Head, thence along the south side of the Careenage to the Chamberlain Bridge, thence in a\nstraight line to the junction of High Street and Broad Street, thence along and inclusive of the\nroads High Street, Roebuck Street and Tweedside Road to the junction of Tweedside Road and\nHalls Road.\n\n\f63\n\n2.\nlies within the following boundaries:\n\nThe area in the vicinity of the Public Market situate at Eagle Hall, St. Michael, which\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\non the north-west boundary, within a line along and inclusive of the roads Deacons\nRoad and Fairfield Road from the junction of Deacons Road and Goodlands Road to\nthe junction of Fairfield and Grazettes Road;\n\nOn the north-east boundary, within a line along and inclusive of the roads Grazettes\nRoad, Kew Road, Dash Road, from the junction of Fairfield Road and Grazettes Road\nto the junction of Dash Road and Bank Hall Road;\n\nOn the south-east boundary within a line along and inclusive of the roads Bank Hall\nRoad from the junction of Dash Road and Bank Hall Road to the junction of Bank\nHall Road and Passage Road; and\n\nOn the south and south-west boundary, within a line along and inclusive of the roads\nPassage Road, Westbury Road, Goodlands Road from the junction of Bank Hall Road\nand Passage Road to the junction of Goodlands Road and Deacons Road.\n\n3.\nat Six Roads, St. Philip.\n\nAll that area within a radius of one and one-half miles of the Public Market situate\n\n4.\nThe area in the vicinity of the Public Market situate at Cheapside, Bridgetown, from\nand inclusive of the junction of Roebuck Street and Country Road, thence along and including\nCountry Road and Passage Road to the junction of Passage Road and Baxters Road, thence along\nand including Baxters Road to its junction with Mason Hall Street, thence along and including\nMason Hall Street to its junction with St. Mary’s Row, thence along and including St. Mary’s\nRow and Lakes Folly to the junction of Lakes Folly and Fontabelle Road, thence in a northerly\ndirection along and including Fontabelle Road and Lands End Road, thence along the sea coast\nin a south easterly direction to the Pier Head, thence along the southern side of the Careenage to\nthe Chamberlain Bridge, thence along the western boundary of the area defined in paragraph 1\nof this Schedule to the junction of Roebuck Street and Country Road.\n\nPart III\n\nList of Fish Landing Sites\n\n1.\n\n2.\n\n3.\n\nBath Beach\n\nBay Street\n\nBay Street Esplanade Browne’s Beach\n\n\f64\n\nBrandons\n\nBridgetown Complex (BFC)\n\nBrighton Beach\n\nBrooklyn\n\nBurke’s Beach\n\nCareenage\n\nCholera Bay\n\nCrane Beach\n\nDover\n\nFitts Village\n\nFoul Bay\n\nHalf Moon Fort\n\nHeron Bay or Colony Club\n\nHoletown\n\nLong Bay\n\nMartin’s Bay\n\nMount Standfast\n\nPile Bay\n\nProspect\n\nShallow Draught or Sand Pit\n\nSilver Sands\n\nSix Men’s\n\nSkeete’s Bay\n\nStroud Bay\n\nSt. Lawrence\n\n4.\n\n5.\n\n6.\n\n7\n\n8.\n\n9.\n\n10.\n\n11.\n\n12.\n\n13.\n\n14.\n\n15.\n\n16.\n\n17.\n\n18.\n\n19.\n\n20.\n\n21.\n\n22.\n\n23.\n\n24.\n\n25.\n\n26.\n\n27.\n\n28.\n\n29. White Head Trees\n\n\f30. Worthings or Sandy Beach\n\n65\n\n\f66\n\nL.R.O. 1998FIFTH SCHEDULE(Section 19)Part IRelocation NoticeNational Vending Act, 2021 (Act 2021-    ) Relocation NoticeDue to                                                                                                                                              ,the Manager of Vending Zones has determined that it is necessary to remove and relocate                                                                                  ,                                                                          ,engaged in                                                         from                                                                                                                       ,to   for the period day of                                          ,20              to           day of                                , 20          .This Notice shall be effective at the end of the 30 day period after the date of service on thevendor.(State reason)(Vending Licence No.)(Type of vending)(Former vending zone)(New vending zone)(Name of vendor)(Date of service)(DD/MM/YYYY)(Signature of the Manager of Vending Zones)\f67\n\nL.R.O. 1998         (Section 19)Part IIEviction NoticeNational Vending Act, 2021 (Act 2021-    )     Eviction NoticeDue to                                                                                                                                        ,the Manager of Vending Zones has determined that it is necessary to evict you,                                                                             ,                                                                     ,engaged in                                                     from                                                                                                                                  .     This Notice shall be effective at the end of the 30 day period after the date of service on thevendor.                                                                         (State reason)(Vending Licence No.)(Type of vending)(Vending zone)(Name of vendor)Fifth Schedule - (Cont'd)(Date of service)(DD/MM/YYYY)(Signature of the Manager of Vending Zones)\f68\n\nL.R.O. 1998(Section 19)Part IIIEmergency Relocation NoticeNational Vending Act, 2021 (Act 2021-    )Emergency Relocation NoticeDue to                                                                                                                                        ,the Manager of Vending Zones has determined that it is necessary to remove and relocate                                                                             ,                                                                     ,engaged in                                                        from                                                                                                                        , to     for the period            day of                                                  ,20             to           day of                               ,20          .(State reason)(Vending Licence No.)(Type of vending)(Former vending zone)(New vending zone)(Name of vendor)(Date of service)(DD/MM/YYYY)(Signature of the Manager of Vending Zones)Fifth Schedule - (Cont'd)\f69\n\nL.R.O. 1998(Section 19)Part IVEmergency Eviction NoticeNational Vending Act, 2021 (Act 2021-    )Emergency Eviction NoticeDue to                                                                                                                                        ,the Manager of Vending Zones has determined that it is necessary to evict you,                                                                               ,                                                                       ,engaged in                                                        from                                                                                                                       ,This Notice shall be effective at the end of a 24 hour period after the date of service on thevendor.(State reason)(Vending Licence No.)(Type of vending)(Vending zone)(Name of vendor)(Date of service)(DD/MM/YYYY)(Signature of the Manager of Vending Zones)Fifth Schedule - (Cont'd)\f70\n\nL.R.O. 1998(Section 20)Part VSeizure NoticeNational Vending Act, 2021 (Act 2021-    ) Seizure NoticeTo:,2. 3. 4. 5. The items can be reclaimed from the Manager of Vending Zones on the            day of                                  , 20  at the                                                        .(Vending Licence No.)(Name of vendor)The Manager of Vending Zones served a(Type of Notice)to you on the                     day of                                                                      , 20                    .                                   The Manager of Vending Zones determined that it was necessary to seize the items listed below pursuant to the execution to the Notice.The items seized and the descriptions thereof are listed as follows:1. (Location)(Date of service)(DD/MM/YYYY)(Signature of the Manager of Vending Zones)Fifth Schedule - (Concl'd)\f71\n\nSIXTH SCHEDULE\n\nNational Vending Committee\n\n(Section 21)\n\nConstitution of the Committee\n\n1.(1)\n\nThe National Vending Committee shall comprise the following:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\na representative of the Barbados Chamber of Commerce;\n\na representative of the Barbados National Standards Institution;\n\na representative of the Barbados Association of Vendors, Retailers and\nEntrepreneurs;\n\na  representative  of  the  Barbados  National  Union  of  Fisherfolk\nOrganizations;\n\n(e)\n\na representative of the Association of Wayside Vendors;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\na representative of the Small Business Association;\n\na representative of the Ministry responsible for Commerce;\n\nthe Registrar of Cooperatives;\n\nthe Manager of Markets;\n\nthe Senior Manager of Markets;\n\n(k)\n\na representative of the Ministry responsible for vocational training;\n\n(l)\n\na representative of the Rastafarian community;\n\n(m)\n\na representative of the Ministry responsible for health;\n\n(n)\n\n(o)\n\n(p)\n\na representative of the Ministry responsible for technology;\n\na representative of the Ministry responsible for education;\n\na representative of the Ministry responsible for fisheries;\n\n\f72\n\n(q)\n\na representative of the Ministry responsible for tourism;\n\n(r)\n\n(s)\n\na representative of the Town and Country Planning Department; and\n\na representative of the National Conservation Commission.\n\n(2)\n\nThe Minister shall appoint a Chairman from among the members.\n\nTenure\n\n2.(1)\nby instrument of appointment and is eligible for re-appointment.\n\nA member of the Committee shall be appointed for a period of 3 years\n\nThe Minister may at any time revoke the appointment of any member of\n\n(2)\nthe Committee.\n\nResignation\n\nAny member of the Committee may at any time resign his office by\n3.\ninstrument in writing addressed to the Minister and transmitted to him through\nthe Chairman, and from the date of the receipt by the Minister of the instrument\nthe member ceases to be a member of the Committee.\n\nPublication of membership\n\n4.\nmembership thereof shall be published in the Official Gazette.\n\nThe  Committee  as  first  constituted  and  every  change  in  the\n\nProcedure and meetings\n\n5.(1)\nThe  Committee  shall  meet  at  such  times  as  may  be  necessary  or\nexpedient for the transaction of business, and such meetings shall be held at such\nplaces  and  times  and  on  such  days  as  the  Committee  determines,  but  the\nCommittee shall meet not less than twice a year.\n\nThe Chairman may at any time call a special meeting of the Committee,\n(2)\nand shall call a special meeting to be held within 7 days of a written request for\nthe purpose addressed to him by any 2 members of the Committee.\n\n\f73\n\n(3)\nThe Chairman shall preside at all meetings of the Committee at which he\nis present, and in the case of his absence or inability to act at any meeting the\nmembers  present  at  the  meeting  constituting  a  quorum  shall  elect  one  of  the\nmembers to preside at that meeting.\n\nAt any meeting at which the voting is equal the Chairman or the person\n\n(4)\npresiding has a second or casting vote.\n\nThe  quorum  of  the  Committee  is  a  majority  of  the  total  membership\n\n(5)\nthereof.\n\n(6)\n\nSubject to this Schedule the Committee may regulate its own proceedings.\n\nThe validity of the proceedings of the Committee is not affected by any\n(7)\nvacancy  in  the  membership  thereof  or  by  any  defect  in  the  appointment  of  a\nmember thereof.\n\nRemuneration of members\n\nThere  may  be  paid  to  the  Chairman  and  other  members  of  the\n6.\nCommittee  such  remuneration  and  such  allowances  as  the  Minister  may\ndetermine.\n\n\f74\n\nL.R.O. 1998SEVENTH SCHEDULE(Section 28)Part IAdministrative PenaltiesDescription of ContraventionVending without a licence contrary to section 4(2)Vending with a licence that has been suspended or revokedVending in contravention of the varied conditions of a licenceOccasional Vending without a permit contrary to section 10(1)Occasional Vending without a permit contrary to section 11(1)Itinerant vending without a permit contrary 12(1)Failing to comply with anobligation pursuant to section18(1)Contravention of regulations 4, 6, 7, 10, 18, 34 and 47 Markets and Slaughterhouse Regulations, 1958 L. N. 1958/53)Provision Section 4(2) Section 8(3)  Section 8(4) Section 10(6)  Section 11(6) Section 12(6) Section 18(4) Regulations4, 6(2), 7(2), 10(3),  18(2), 34(2) and   47(2)Penalty   $500    $500    $500    $500 $500   $500     $500   $500\f75\n\nL.R.O. 1998(Section 29)Part IITicketNational Vending Act, 2021(Act 2021-    ) Administrative Penalty NoticeOn the               day of                                                           , 20               , at                                                                 ,                                                                         ,was seen engaging in activity which gave me reasonable cause to believe that there was a contravention of the Act.  The particulars of the contravention are set out as follows:Signature of the Manager of Vending Zones:Date:    (Time)(Name of vendor)(Vending Licence No.)(Location)Seventh Schedule - (Concl'd)\f76\n\n L.R.O. 1998EIGHTH SCHEDULE(Section 37)CONSEQUENTIAL AMENDMENTSColumn 1Enactments1.Markets and Slaughter-Houses Act, Cap. 2652.Markets and Slaughter-Houses Regulations, 1958(L.N. 1958/53)Column 2Amendments1.In section 2 insert in the appropriate alphabetical order thefollowing:\" \"Manager of Markets\" means the manager of any public market or any person acting with the authority of the Manager of Markets;\".2.Delete all references in the Act to the words \"ChiefSupervisor\" and substitute the words \"Manager of Markets\".3.Delete Part III.4.Delete Part VII.1.Delete all references in the Regulations to the words \"ChiefSupervisor\" and substitute the words \"Manager of Markets\".2.Delete regulation 4 and substitute the following:\"Refusal to comply with directions of the Manager of Markets 4. If any person in any public market refuses or neglects to comply with any direction of the Manager of Markets for the maintenance of order or the regularity or for the carrying out of any of the provisions of these Regulations that  person shall be subject to payment of an administrative penalty under section 28 of the National Vending Act, 2021 (Act 2021-    ).\". \f77\n\n L.R.O. 1998Column 1Enactments2.Markets and Slaughter-Houses Regulations, 1958(L.N. 1958/53) (Cont'd)Column 2Amendments3. In regulation 6, delete paragraph (2) and substitute the following: \"(2) If any authorised person is found in a public market during closed hours he shall be subject to the  payment of an administrative penalty under section 28 of the National Vending Act, 2021 (Act 2021-  ).\".4.In regulation 7 delete paragraph (2) and substitute the following: \"(2) If any  person contravenes paragraph (1)he shall be subject to the payment of an administrativepenalty under section 28 of the National Vending Act,2021 (Act 2021-  ).\".5. In  regulation 10  delete paragraph (3) and substitute the following: \"(3) If any  person contravenes paragraphs (1) or (2) he shall be subject to the payment of an administrative penalty under section 28 of the National Vending Act, 2021 (Act 2021-  ).\".6. In regulation 18 delete paragraph (2) and substitute the following: \"(2) If any  person contravenes paragraphs (1)he shall be subject to the payment of an administrativepenalty under section 28 of the National VendingAct,  2021 (Act 2021-  ).\".7.Delete regulation 25 and substitute the following: \"Manager of Markets may let market stalls25. Subject to the provisions of These Regulations,the Manager of Markets may on the payment of the appropriate rent as set out in the First Schedule let to a person  licensed as a vendor pursuant to the  National Vending Act, 2021 (Act 2021-    ) any market stall in anypublic market.\". Eighth Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f78\n\n L.R.O. 1998Column 1Enactments2. Markets and Slaughter-    Houses Regulations, 1958 (L.N. 1958/53) - (Cont'd)Column 2Amendments8. Delete regulation 26 and substitute the following:  \"Tenant of market stall licensed to occupy and use   it for period of tenancy  26. Where a tenant has been let a market stall pursuant to regulation 25, that tenant shall be considered to be licensed to occupy and use the market stall let to him for the period of the tenancy, provided that he complies with the provisions of the Act and these Regulations.\".9. Delete regulations 31, 32 and 33.10. In regulation 34, delete paragraph (2) and substitute the following:      \"(2) A person who contravenes paragraph (1)  shall be subject to an administrative penalty imposed  under section 28 of the National Vending Act, 2021  (Act 2021-  ).\".11. Delete regulation 45.12. Delete regulation 46.13. In regulation 47 delete paragraph (2) and substitute the following: \"(2) A person who evades or attempts to evadeor assists in evading the payment of any toll underparagraph (1) shall be subject to the payment of an administrative penalty under section 28 of theNational Vending Act, 2021 (Act 2021-  ).\".14. Delete regulations 48, 61, 62, 63 and 64.  CONSEQUENTIAL AMENDMENTS - (Cont'd)Eighth Schedule - (Cont'd)\f79\n\n L.R.O. 1998Column 1Enactments2. Markets and Slaughter- Houses Regulations, 1958 (L.N. 1958/53) - (Concl'd)3. National Conservation Commission Act, Cap. 393Column 2Amendments15. In the First Schedule delete the item which refers to   (a) Regulation 31 Fishseller's tickets; (b) Regulation 46 Permit fee;  (c) Regulation 48 Fishseller's licence;  (d) Regulation 61 Meat Shop licences; and   (e) Regulation 64 Meat vendor's licences. 16. Delete the Second Schedule. 17. In the Third Schedule delete the item which refers to (a) Regulation 46 Permit to sell within Prohibited Areas; (b) Regulation 48 Fish Seller's Licence;  (c) Regulation 61 Meat Shop Licenced; and  (d) Regulation 64 Meat Vendor's Licence.\". 1. Delete Part IV. 2. Delete subsections (1) and (1A) of section 31. CONSEQUENTIAL AMENDMENTS - (Cont'd)Eighth Schedule - (Cont'd)\f80\n\n L.R.O. 1998Column 1Enactments3. National Conservation Commission Act, Cap. 393 - (Concl'd)4. National Conservation  Commission (Fees) Regulations, 2015 (S.I. 2015 No. 78)  Column 2Amendments3. Section 32(1) is deleted and the following is substituted:   \"(1) A person employed by the Commission  as a ranger or warden may arrest without a warrant   any person who commits an offence specified in   paragraph (a) or (b) of subsection (2) of section 31.\". The Schedule is amended by deleting all references to Vendor'sLicences and the fees connected thereto.CONSEQUENTIAL AMENDMENTS - (Concl'd)Eighth Schedule - (Concl'd)"
}