{
  "bill_id": 57,
  "slug": "evidence-amendment-bill-2014",
  "title": "Evidence (Amendment) Bill, 2014",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/ddd8df437ac5ebabdfaf83e54898cd2d.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2014-11-29",
  "first_reading": "2014-12-10",
  "second_reading": "2014-11-28",
  "gazette_date": "2015-01-05",
  "passed_date": "2015-01-16",
  "markdown": "2014-10-06\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Evidence Act, Cap. 121 to make provision for\n\n(a)\n\n(b)\n\n(c)\n\nsound recordings;\n\nvideo identifications; and\n\nother related matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 72 of Cap. 121\n\nInsertion of section 72A into Cap. 121\n\nRepeal and replacement of section 73 of Cap. 121\n\nAmendment of section 100 of Cap. 121\n\nRepeal and replacement of section 169 of Cap. 121\n\nRepeal of section 170 of Cap. 121\n\nRepeal of Third Schedule to Cap. 121\n\nCommencement\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Evidence Act, Cap. 121 to make provision for\n\n(a)\n\n(b)\n\n(c)\n\nsound recordings;\n\nvideo identifications; and\n\nother related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n\nThis Act may be cited as the Evidence (Amendment) Act, 2014.\n\nAmendment of section 72 of Cap. 121\n\n2.\nAct, is amended\n\nSection 72 of the Evidence Act, in this Act referred to as the principal\n\n(a)\n\nin subsection (2)\n\n(i)\n\nby deleting paragraph (a) and substituting the following:\n\n“(a)\n\nthe  confession  or  admission  was  made  in  circumstances\nwhere  it  was  reasonably  practicable  to  make  sound\nrecordings of the confession or admission, the questioning of\nthe  person  and  anything  said  by  that  person  during  that\nquestioning were recorded;”; and\n\n(ii)\n\nby  deleting  subparagraphs  (iv)  and  (v)  of  paragraph  (b)  and\nsubstituting the following:\n\n“(iv)\n\na sound recording was made of the reading referred to\nin subparagraph (ii) and of everything said by or to the\nperson questioned or charged as a result of compliance\nwith  subparagraph  (iii);  and  the  requirements  of\nsubparagraph (ii) were also observed in respect of that\nsound recording;\n\n(v)\n\nbefore the reading referred to in subparagraph (ii) was\ncommenced,  an  explanation  was  given  to  the  person\nquestioned of the procedure that would be followed for\nthe purpose of compliance with subparagraphs (ii), (iii)\nand (iv);”;\n\n(b)\n\nby deleting subsection (3)(c) and substituting the following:\n\n\f5\n\n“(c)\n\nif a written record of the sound recording is prepared, make\na copy of the written record available to the person questioned\nor his legal representative within 7 days after the preparation\nof the written record;”; and\n\n(c)\n\nby inserting immediately after subsection (6) the following:\n\n“(7)\nFor  the  purposes  of  this  section,  “in  the  course  of  official\nquestioning” means questioning that occurs where a person is under\narrest in a place of detention, involving a police officer’s questioning\nunder caution that is reasonably likely to elicit incriminating responses\nbeginning with a police officer’s advice of the person’s right under the\nConstitution  of  Barbados,  Cap.  1966/1455  and  ending  when  the\nquestioning is completely finished.”.\n\nInsertion of section 72A into Cap. 121\n\n3.\n72 the following:\n\nThe principal Act is amended by inserting immediately after section\n\n“Effect of accused’s failure to mention facts when questioned\n\n72A.(1)\nWhere,  in  the  course  of  official  questioning,  in  any\nproceedings against a person for an offence, evidence is given that the\naccused\n\n(a)\n\nat any time before he was charged with the offence, on being\nquestioned under caution by an interviewing officer trying to\ndiscover  whether  or  by  whom  the  offence  had  been\ncommitted, failed to mention any fact relied on in his defence\nin those proceedings; or\n\n\f6\n\n(b)\n\non being charged with the offence or officially informed that\nhe might be prosecuted for an offence, failed to mention any\nsuch fact,\n\nbeing a fact which in the circumstances existing at the time the accused\ncould reasonably have been expected to mention when so questioned,\ncharged or informed, as the case may be, subsection (2) applies.\n\nWhere a person fails to mention such facts as are referred to in\n\n(2)\nsubsection (1)\n\n(a)\n\n(b)\n\nthe court, in determining whether there is a case to answer;\nor\n\nthe court or jury, in determining whether the accused is guilty\nof the offence charged,\n\nmay draw such inferences from the failure as appear proper.\n\nWhere the accused was at an authorised place of detention at the\n(3)\ntime of the failure to mention such facts as are referred in subsection\n(1), then subsection (2) shall not apply where he had not been allowed\nan opportunity to consult an attorney-at-law prior to being questioned,\ncharged or informed as mentioned in subsection (1).\n\nSubject  to  any  directions  by  the  court,  evidence  tending  to\n(4)\nestablish the failure maybe given before or after evidence tending to\nestablish the fact which the accused is alleged to have failed to mention.\n\n(5)\n\nThis section does not\n\n(a)\n\nprejudice the admissibility in evidence of the silence or other\nreaction  of  the  accused  in  the  face  of  anything  said  in  his\npresence  relating  to  the  conduct  in  respect  of  which  he  is\ncharged, in so far as evidence thereof would be admissible\napart from this section; or\n\n\f7\n\n(b)\n\npreclude the drawing of any inference from any such silence\nor  other  reaction  of  the  accused  which  could  properly  be\ndrawn apart from this section.\n\n(6)\nFor  the  purposes  of  this  section,  “in  the  course  of  official\nquestioning” means questioning that occurs where a person is under\narrest in a place of detention, involving a police officer’s questioning\nunder caution that is reasonably likely to elicit incriminating responses\nbeginning with a police officer’s advice of the person’s right under the\nConstitution  of  Barbados,  Cap.  1966/1455  and  ending  when  the\nquestioning is completely finished.”.\n\nRepeal and replacement of section 73 of Cap. 121\n\n4.\nsubstituted:\n\nSection  73  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Exclusion of records of oral questioning\n\n73.(1)\nWhere  an  accused  does  not  want  to  subject  himself  to  a\nsound recording, but an oral admission is made by the accused to an\ninvestigating officer in response to a question put or a representation\nmade by an officer, a document prepared by or on behalf of the officer\nis not admissible in criminal proceedings to prove the contents of the\nquestion, representation or response unless the accused has, by signing,\ninitialling or otherwise marking the document, acknowledged that the\ndocument is a true record of the question, representation or response.\n\nIn subsection (1), “document” does not include a sound recording\n\n(2)\nor a transcript of a sound recording. ”.\n\n\f8\n\nAmendment of section 100 of Cap. 121\n\n5.\nsubstituted:\n\nSection  100  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Visual identification excluded unless certain conditions are\nmet\n\n100.(1)\nnot admissible unless\n\nVisual identification evidence adduced by the prosecutor is\n\n(a)\n\neither\n\n(i)\n\nan identification parade was held; or\n\n(ii)\n\na video identification was conducted\n\nwhich included the accused before the identification was made; or\n\n(b)\n\nit would not have been reasonable to have\n\n(i)\n\nheld a identification parade; or\n\n(ii)\n\nconducted a video identification; or\n\n(c)\n\nthe accused refused to take part in an identification parade or\na video identification\n\nand the identification was made without the person who made it having\nbeen intentionally influenced to identify the accused.\n\nWithout limiting subsection (1), in determining whether it was\n(2)\nreasonable  to  hold  an  identification  parade  or  to  conduct  a  video\nidentification, the court shall take into account the following matters:\n\n(a)\n\n(b)\n\nthe kind of offence, and the gravity of the offence, concerned;\n\nthe importance of the evidence;\n\n\f9\n\n(c)\n\nthe  practicality  of  holding  an  identification  parade  or\nconducting the video identification having regard, amongst\nother things\n\n(i)\n\n(ii)\n\nto whether the accused failed to cooperate in the conduct\nof the parade or video identification, and to the manner\nand extent of, and the reason, if any, for, the failure; and\n\nin any case, to whether the identification was made at or\nabout the time of the commission of the relevant offence;\nand\n\n(d)\n\nthe  appropriateness  of  holding  an  identification  parade  or\nconducting a video identification having regard, among other\nthings, to the relationship, if any, between the accused and\nthe other person who made the identification.\n\nIt shall be presumed that it would not have been reasonable to\n(3)\nconduct an identification parade or a video identification if it would\nhave  been  unfair  to  the  accused  for  such  an  identification  parade  or\nvideo identification to be conducted.\n\n(4)\n\nWhere\n\n(a)\n\n(b)\n\nthe  accused  refused  to  take  part  in  the  conduct  of  an\nidentification  parade  or  a  video  identification  unless  an\nattorney-at-law  acting  for  the  accused  or  unless  another\nperson chosen by the accused was present while it was being\nheld; and\n\nthere were, at the time when the identification parade or video\nidentification was to be held, reasonable grounds to believe\nthat it was not reasonably practicable for such attorney-at-\nlaw or other person to be present,\n\nit shall be presumed that it would not have been reasonable to have\nconducted an identification parade or video identification at that time.\n\n\f10\n\n(5)\nIn determining whether it was reasonable to have conducted an\nidentification parade or a video identification, the court shall not take\ninto account the availability of pictures that could be used in making\nidentifications.\n\n(6)\n\nIn this section,\n\n“identification parade” means an identification procedure conducted by\na  police  officer  in  which  a  suspect  and  other  persons  who\nphysically  resemble  that  suspect  are  shown  to  a  person  to\ndetermine whether that suspect can be identified by the person as\nhaving committed an offence;\n\n“picture identification evidence” means identification evidence relating\nto an identification made wholly or partly by the person who made\nthe identification examining pictures or photographs kept for the\nuse by the a police officer;\n\n“video identification” means an identification procedure conducted by\na police officer in which moving images or still images of a suspect\nand other persons who physically resemble that suspect are shown\nto a person to determine whether that suspect can be identified by\nthe person as having committed an offence;\n\n“visual identification evidence” means identification evidence relating\nto an identification based wholly or partly on what a person saw,\nbut does not include picture identification evidence. ”.\n\nRepeal and replacement of section 169 of Cap. 121\n\n6.\nsubstituted:\n\nSection  169  of  the  principal  Act  is  deleted  and  the  following  is\n\n\f11\n\n“Regulations\n\n169.\ngive effect to this Act and, in particular, may make regulations for\n\nThe  Attorney-General  may  make  regulations  generally  to\n\n(a)\n\nthe exercise by police officers of statutory powers\n\n(i)\n\nto search a person without first arresting him; or\n\n(ii)\n\nto search a vehicle without making an arrest;\n\n(b)\n\n(c)\n\n(d)\n\nthe  detention,  treatment,  questioning  and  identification  of\npersons by police officers;\n\nthe search of premises by police officers; and\n\nthe seizure of property found by police officers on persons or\npremises.”.\n\nRepeal of section 170 of Cap. 121\n\n7.\n\nSection 170 of the principal Act is repealed.\n\nRepeal of Third Schedule to Cap. 121\n\n8.\n\nThe Third Schedule to the principal Act is repealed.\n\nCommencement\n\n9.\n\nThis Act comes into operation on a date to be fixed by proclamation.\n\n\f12\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2014.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2014.\n\nPresident\n\n"
}