{
  "bill_id": 580,
  "slug": "prevention-of-corruption-bill-2021",
  "title": "Prevention of Corruption Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/1bba30b5e591989062fa21ed892327dc.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-10-13",
  "first_reading": "2021-10-27",
  "gazette_date": "2021-09-23",
  "markdown": "# Explanatory Memorandum after page 75\n\n2021-09-20\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the prevention, investigation and prosecution of\n\nacts of corruption.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nOffering, soliciting or accepting an advantage\n\nPART II\n\nACTS OF CORRUPTION CONSTITUTING OFFENCES\n\nBribery of persons exercising public functions\n\nBribery of a foreign public official\n\nBribery of an official of a public international organization\n\nTrading in influence\n\nBribery in relation to contracts and tenders\n\nBribery in relation to auctions\n\n10.\n\nCorrupt transactions with agents\n\n11.\n\nBribery in the private sector\n\n\f3\n\n12.\n\nPenalties\n\n13.\n\nDisqualification from holding public office\n\nPART III\n\nINVESTIGATIONS\n\n14.\n\nDisclosure orders\n\n15.\n\nSearch and seizure warrants\n\n16.\n\nOffence of tipping off etc.\n\nPART IV\n\nEVIDENCE\n\n17.\n\nEvidence of unexplained property\n\n18.\n\nPresumption of corruption in certain cases\n\n19.\n\nCertain defences not available\n\nPART V\n\nMISCELLANEOUS\n\n20.\n\nOffences in respect of false complaints\n\n21.\n\nConvention has force of law\n\n22.\n\nJurisdiction\n\n23.\n\nRegulations\n\n\f24.\n\nRepeal\n\n4\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the prevention, investigation and prosecution of acts\n\nof corruption.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Prevention of Corruption Act, 2021.\n\nInterpretation\n\n2.\n\nIn this Act\n\n“advantage” includes\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nmoney and any gift, loan, fee, reward, bonus, commission, discount,\nrebate, valuable security or other property or interest in property of any\ndescription;\n\nany status, honour, office, contract, employment or agreement to render\nservices in any capacity;\n\nany  entry  to  an  academic  institution  or  course  and  any  grant,\nscholarship, favourable academic results or other service, favour, right\nor privilege related to education;\n\nany  forbearance  to  demand  any  money  or  money's  worth  or  other\nvaluable thing;\n\nany avoidance of a loss, liability, penalty, forfeiture, punishment or\nother  disadvantage  or  any  protection  from  any  disability  or  penalty\napprehended  or  incurred  from  any  action  or  proceedings  of  a  civil,\ncriminal or disciplinary nature, whether or not already instituted;\n\n(f)\n\nany discharge, liquidation, payment or release of any loan, obligation\nor other liability, whether in whole or in part;\n\n(g)\n\nany residential or hotel accommodation;\n\n\f7\n\n(h)\n\n(i)\n\n(j)\n\n(k)\n\nany exercise, or forbearance from the exercise, of any duty, power or\nright;\n\nany aid, vote, consent, influence or abstention from voting, whether\nactually or purportedly given or undertaken;\n\nany other service, favour, right or privilege; and\n\nany offer, promise or undertaking, whether conditional or not, of any\nadvantage within the meaning of paragraphs (a) to (j);\n\n“agent” means a person employed by or acting for another and includes a trustee,\n\nan administrator and an executor;\n\n“corruption” means any act which constitutes an offence under Part II;\n\n“disclosure order” means an order made under section 14(1);\n\n“document” includes\n\n(a)\n\n(b)\n\n(c)\n\nanything on which there is writing;\n\na map, plan, drawing or photograph; and\n\nany  information  recorded  or  stored  by  means  of  any  tape  recorder,\ncomputer or other device, and any material subsequently derived from\nthe information so recorded or stored;\n\n“foreign public official” means a person who\n\n(a)\n\n(b)\n\nholds an administrative, executive, judicial or legislative office of a\nforeign state, whether appointed or elected; or\n\nexercises  a  public  function  for  a  foreign  state  including  a  public\nfunction for a public agency or public enterprise of a foreign state;\n\n“foreign state” means a state other than Barbados;\n\n“income” includes\n\n(a)\n\nmoney or money’s worth derived from whatever source or acquired in\nBarbados or elsewhere, whether directly or indirectly; and\n\n\f8\n\n(b)\n\nall receipts by way of salary, fees, wages, requisitions, profits, grants,\nemoluments, rents, interest, commissions, bonuses, pensions, annuities\nor benefits;\n\n“induce” includes to persuade, encourage, coerce, intimidate, threaten or cause\na  person  to  perform  an  act,  and  \"inducement\"  has  the  corresponding\nmeaning;\n\n“investigative officer” means a member of the Police Force or such other person\nas may be authorised by any other enactment to conduct an investigation\ninto an offence under this Act;\n\n“liability” means any obligation of a person to pay money or to provide goods or\n\nservices in Barbados or elsewhere;\n\n“official of a public international organization” means a person who is authorised\n\nby a public international organization to act on its behalf;\n\n“persons exercising public functions” includes\n\n(a)\n\n(b)\n\n(c)\n\npublic officers;\n\nmembers, chief executive officers, managers, directors and employees\nof state-owned enterprises; and\n\nany other person who holds a legislative, executive, administrative or\njudicial office in the Government of Barbados, whether appointed or\nelected, permanent or temporary, paid or unpaid;\n\n“principal” includes an employer;\n\n“private sector entity” means an entity that is not a public authority and is not\n\nunder the direct control of the Government;\n\n“privileged material” means\n\n(a)\n\ncommunications  between  an  attorney-at-law  and  his  client  or  any\nperson representing his client, made in connection with the giving of\nlegal advice to the client;\n\n\f9\n\n(b)\n\ncommunications  between  an  attorney-at-law  and  his  client  or  any\nperson representing his client, or between such an attorney-at-law or\nhis client, or any such representative, and any other person made in\nconnection with or in contemplation of legal proceedings and for the\npurposes of such proceedings; and\n\n(c)\n\nmaterial enclosed with or referred to in such communications and made\n\n(i)\n\nin connection with the giving of legal advice; or\n\n(ii)\n\nin connection with or in contemplation of legal proceedings and\nfor the purposes of such proceedings,\n\nwhen the communications or material are in the possession of a person who\nis entitled to such possession and are not held with the intention of furthering\na criminal purpose;\n\n “property” means\n\n(a)\n\n(b)\n\nassets of every kind, whether situated in Barbados or elsewhere and\nwhether real or personal, tangible or intangible and includes money;\nand\n\nlegal documents or instruments in any form, including electronic or\ndigital, evidencing title to or interest in assets referred to in paragraph\n(a)  such  as  bank  credits,  travellers’  cheques,  bank  cheques,  money\norders, shares, securities, bonds, drafts and letters of credit;\n\n“public authority” includes\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe House of Assembly and the Senate;\n\nthe Cabinet;\n\nthe judiciary;\n\nany  Ministry,  department,  agency,  organ,  unit  or  other  authority  of\nGovernment;\n\n(e)\n\na state-owned enterprise; and\n\n\f10\n\n(f)\n\nany person exercising public functions;\n\n“public international organization” means an organization, the members of which\n\nare\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\ncountries or territories;\n\ngovernments of countries or territories;\n\nother public international organizations; or\n\na combination of countries, territories, governments and other public\ninternational organizations;\n\n“public officer” has the meaning assigned to it by section 2 of the Public Service\n\nAct, Cap. 29;\n\n“state-owned enterprise” means\n\n(a)\n\n(b)\n\na statutory board;\n\na company that is substantially owned and effectively controlled by the\nGovernment.\n\nOffering, soliciting or accepting an advantage\n\n3.\n\nFor the purposes of this Act, a person\n\n(a)\n\n(b)\n\n(c)\n\noffers  an  advantage  where  he,  or  any  person  acting  on  his  behalf,\ndirectly or indirectly gives, affords or holds out, or agrees, undertakes\nor  promises  to  give,  afford  or  hold  out,  any  advantage  to  any  other\nperson;\n\nsolicits  an  advantage  where  he,  or  any  person  acting  on  his  behalf,\ndirectly or indirectly demands, invites, asks for or indicates willingness\nto receive any advantage, whether for himself or for any other person;\n\naccepts  an  advantage  where  he,  or  any  person  acting  on  his  behalf,\ndirectly  or  indirectly  takes,  receives  or  obtains,  or  agrees  to  take,\nreceive or obtain any advantage, whether for himself or for any other\nperson.\n\n\f11\n\nPART II\n\nACTS OF CORRUPTION CONSTITUTING OFFENCES\n\nBribery of persons exercising public functions\n\n4.(1)\nfunctions as an inducement to or reward for or otherwise on account of\n\nA  person  who  offers  an  advantage  to  a  person  exercising  public\n\n(a)\n\n(b)\n\nhis performing or refraining from performing any act in his capacity\nas a person exercising public functions;\n\nhis expediting, delaying, hindering or preventing the performance of\nan  act,  whether  by  himself  or  by  another  person  exercising  public\nfunctions, in his or that other person’s capacity as a person exercising\npublic functions; or\n\n(c)\n\nhis  assisting,  favouring,  hindering  or  delaying  any  person  in  the\ntransaction of any business with a public authority,\n\nis guilty of an offence.\n\nA person exercising public functions who solicits or accepts an advantage\n\n(2)\nas an inducement to or reward for or otherwise on account of\n\n(a)\n\n(b)\n\nhis performing or refraining from performing any act in his capacity\nas a person exercising public functions;\n\nhis expediting, delaying, hindering or preventing the performance of\nan  act,  whether  by  himself  or  by  another  person  exercising  public\nfunctions, in his or that other person’s capacity as a person exercising\npublic functions; or\n\n(c)\n\nhis  assisting,  favouring,  hindering  or  delaying  any  person  in  the\ntransaction of any business with a public authority,\n\nis guilty of an offence.\n\n\f12\n\nBribery of a foreign public official\n\n5.(1)\nA person who offers an advantage to a foreign public official as an\ninducement to or reward for or otherwise on account of his acting or refraining\nfrom acting in the exercise of his official functions in order to obtain or retain\nany business or other advantage is guilty of an offence.\n\nA  foreign  public  official  who  solicits  or  accepts  an  advantage  as  an\n(2)\ninducement to or reward for or otherwise on account of his acting or refraining\nfrom acting in the exercise of his official functions is guilty of an offence.\n\nBribery of an official of a public international organization\n\nA  person  who  offers  an  advantage  to  an  official  of  a  public\n6.(1)\ninternational  organization  as  an  inducement  to  or  reward  for  or  otherwise  on\naccount  of  his  acting  or  refraining  from  acting  in  the  exercise  of  his  official\nfunctions in order to obtain or retain any business or other advantage is guilty of\nan offence.\n\nAn official of a public international organization who solicits or accepts\n(2)\nan advantage as an inducement to or reward for or otherwise on account of his\nacting or refraining from acting in the exercise of his official functions is guilty\nof an offence.\n\nTrading in influence\n\n7.(1)\nA person who offers an advantage to another person as an inducement\nto or reward for or otherwise on account of his using his real or supposed influence\nin order for the first mentioned person or another person to obtain an advantage\nfrom a public authority is guilty of an offence.\n\nA  person  who  solicits  or  accepts  an  advantage  as  an  inducement  to  or\n(2)\nreward for or otherwise on account of his using his real or supposed influence in\norder for another person to obtain an advantage from a public authority is guilty\nof an offence.\n\n\f13\n\nBribery in relation to contracts and tenders\n\n8.(1)\nA  person  who  offers  an  advantage  to  a  person  exercising  public\nfunctions as an inducement to or reward for or otherwise on account of his giving\nassistance or using his real or supposed influence in\n\n(a)\n\nthe promotion, procuring or execution of\n\n(i)\n\n(ii)\n\nany contract with a public authority for the supply of any goods,\nservices or works; or\n\nany subcontract under a contract referred to in subparagraph (i);\nor\n\n(b)\n\nthe payment of the price or other consideration stipulated or otherwise\nprovided for in any contract or subcontract referred to in paragraph\n(a),\n\nis guilty of an offence.\n\nA person exercising public functions who solicits or accepts an advantage\n(2)\nas an inducement to or reward for or otherwise on account of his giving assistance\nor using his real or supposed influence\n\n(a)\n\n(b)\n\nin the promotion, procuring or execution of; or\n\nfor  the  payment  of  the  price  or  other  consideration  stipulated  or\notherwise provided for in,\n\nany contract or subcontract referred to in subsection (1)(a) is guilty of an offence.\n\nA person who offers an advantage to another person as an inducement to\n(3)\nor reward for or otherwise on account of his withdrawal of a tender or refraining\nfrom tendering for a contract with a public authority for the supply of any goods,\nservices or works is guilty of an offence.\n\nA  person  who  solicits  or  accepts  an  advantage  as  an  inducement  to  or\n(4)\nreward for or otherwise on account of his withdrawal of a tender or refraining\nfrom tendering for a contract referred to in subsection (3) is guilty of an offence.\n\n\f14\n\nBribery in relation to auctions\n\n9.(1)\nA person who offers an advantage to another person as an inducement\nto or reward for or otherwise on account of his refraining from bidding at an\nauction conducted by or on behalf of a public authority is guilty of an offence.\n\nA  person  who  solicits  or  accepts  an  advantage  as  an  inducement  to  or\n(2)\nreward for or otherwise on account of his refraining from bidding at an auction\nconducted by or on behalf of a public authority is guilty of an offence.\n\nCorrupt transactions with agents\n\n10.(1)\nreward for or otherwise on account of\n\nA person who offers an advantage to an agent as an inducement to or\n\n(a)\n\n(b)\n\nhis performing or refraining from performing any act in relation to his\nprincipal’s affairs or business; or\n\nhis  showing  or  refraining  from  showing  favour  or  disfavour  to  any\nperson in relation to his principal’s affairs or business,\n\nis guilty of an offence.\n\nAn  agent  who  solicits  or  accepts  an  advantage  as  an  inducement  to  or\n\n(2)\nreward for or otherwise on account of\n\n(a)\n\n(b)\n\nhis performing or refraining from performing any act in relation to his\nprincipal’s affairs or business; or\n\nhis  showing  or  refraining  from  showing  favour  or  disfavour  to  any\nperson in relation to his principal’s affairs or business,\n\nis guilty of an offence.\n\nAn agent who, with intent to deceive his principal, uses any receipt, account\n\n(3)\nor other document\n\n(a)\n\nin respect of which his principal is interested; and\n\n\f(b)\n\nwhich\n\n15\n\n(i)\n\ncontains any statement which is false, erroneous or defective in\nany material particular; and\n\n(ii)\n\nto his knowledge is intended to mislead his principal,\n\nis guilty of an offence.\n\nFor the purposes of subsections (1) and (2), the permission of a principal\n(4)\nto  the  soliciting  or  accepting  of  an  advantage  by  his  agent  shall  constitute  a\ndefence to an offence under this section.\n\nBribery in the private sector\n\nA person who offers an advantage to a person who directs or works\n11.(1)\nin any capacity for a private sector entity as an inducement to or reward for or\notherwise on account of his acting or refraining from acting in the exercise of his\nfunctions in such capacity is guilty of an offence.\n\nA person who directs or works in any capacity for a private sector entity\n(2)\nand who solicits or accepts an advantage as an inducement to or reward for or\notherwise on account of his acting or refraining from acting in the exercise of his\nfunctions in such capacity is guilty of an offence.\n\nPenalties\n\n12.\n\nA person guilty of an offence under this Part is liable\n\n(a)\n\n(b)\n\non conviction on indictment, to a fine of $1 500 000 or to imprisonment\nfor 15 years or to both;\n\non summary conviction, to a fine of $500 000 or to imprisonment for\n10 years or to both.\n\n\f16\n\nDisqualification from holding public office\n\n13.(1)\nA  person  who  is  convicted  of  an  offence  under  this  Part  shall,  in\naddition to any other penalty prescribed by law, be disqualified from holding any\npublic office for a period of 10 years from the date of conviction for the offence.\n\nFor  the  avoidance  of  doubt,  in  subsection  (1)  “public  office”  does  not\n\n(2)\ninclude a position which primarily involves manual work.\n\nPART III\n\nINVESTIGATIONS\n\nDisclosure orders\n\nWhere on an application made by an investigative officer, a Judge in\n14.(1)\nChambers is satisfied that each of the requirements set out in subsection (3) is\nfulfilled, the judge may make an order authorising the officer to give to any person\nthe  officer  considers  has  relevant  information,  notice  in  writing  requiring  the\nperson, with respect to any matter relevant to the investigation for the purposes\nof which the order is sought, to\n\n(a)\n\n(b)\n\n(c)\n\nanswer any question, either at a time and place specified in the notice\nor at once;\n\nprovide  any  information  specified  in  the  notice,  by  a  time  and  in  a\nmanner so specified;\n\nproduce any document specified or described in the notice, either by a\ntime and in a manner so specified or at once.\n\nAn application for a disclosure order shall be made without notice and shall\n(2)\nstate that a person specified in the application is subject to an investigation under\nthis Act.\n\n\f17\n\nThe requirements referred to in subsection (1) are that there are reasonable\n\n(3)\ngrounds for\n\n(a)\n\nsuspecting that the person specified in the application has committed\nan offence under Part II; and\n\n(b)\n\nbelieving that\n\n(i)\n\n(ii)\n\ninformation which may be provided in compliance with the order\nis likely to be of substantial value, whether or not by itself, to the\ninvestigation for the purposes of which the order is sought; and\n\nit is in the public interest for the information to be provided, having\nregard  to  the  benefit  likely  to  accrue  to  the  investigation  if  the\ninformation is obtained.\n\nA person is not bound to comply with a requirement imposed by a notice\n(4)\ngiven under a disclosure order unless evidence of authority to give the notice is\nproduced to him.\n\n(5)\n\nA person who\n\n(a)\n\n(b)\n\nwithout reasonable excuse, fails to comply with a requirement imposed\non him under a disclosure order; or\n\nin purported compliance with a requirement imposed on him under a\ndisclosure order,\n\n(i)\n\n(ii)\n\nmakes a statement which he knows to be false or misleading in a\nmaterial particular; or\n\nrecklessly  makes  a  statement  which  is  false  or  misleading  in  a\nmaterial particular,\n\nis guilty of an offence.\n\n(6)\n\nA person guilty of an offence under subsection (5) is liable\n\n(a)\n\non summary conviction, to a fine of $50,000 or to imprisonment for 3\nyears or to both; and\n\n\f18\n\n(b)\n\non conviction on indictment, to a fine of $150 000 or to imprisonment\nfor 5 years or to both.\n\n(7)\nSubject to subsection (8), a statement made by a person in response to a\nrequirement imposed by a disclosure order may not be used in evidence against\nthe person in criminal proceedings.\n\n(8)\n\nSubsection (7) does not apply in the case of\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nproceedings for contempt of court;\n\na prosecution for an offence under subsection (6);\n\na prosecution for an offence under the Perjury Act, Cap. 142; or\n\na prosecution for another offence where, in giving evidence, the person\nmakes  a  statement  inconsistent  with  the  statement  mentioned  in\nsubsection (7).\n\nA statement may not be used by virtue of subsection (8)(d) against a person\n\n(9)\nunless\n\n(a)\n\n(b)\n\nevidence relating to it is adduced; or\n\na question relating to it is asked,\n\nby or on behalf of the person in the proceedings arising out of the prosecution.\n\nA  disclosure  order  has  effect  notwithstanding  any  obligation  as  to\n(10)\nconfidentiality  or  any  other  restriction  upon  the  disclosure  of  information\nimposed by any enactment, rule of law or otherwise.\n\nA disclosure order does not require a person to provide privileged material,\n(11)\nbut an attorney-at-law may be required to produce the name and address of a\nclient.\n\nAn investigative officer may take copies of or extracts from any documents\n(12)\nproduced  by  a  person  in  connection  with  complying  with  a  requirement  of  a\ndisclosure order.\n\n\f19\n\n(13)\nAny document produced in compliance with a disclosure order may be\nretained for so long as it is necessary to retain it, as opposed to copies of it, in\nconnection with the investigation for the purposes of which the order was made.\n\nNotwithstanding  subsection  (13),  where  an  investigative  officer  has\n\n(14)\nreasonable grounds for believing that the document\n\n(a)\n\nmay need to be produced for the purposes of any legal proceedings;\nand\n\n(b)\n\nmight otherwise be unavailable for those purposes,\n\nthe document may be retained until the proceedings are concluded.\n\nAn investigative officer who applied for a disclosure order or any person\n(15)\naffected by the order may apply to a judge in Chambers to vary or discharge the\norder, and the judge may do so where he considers it appropriate.\n\nFor the purposes of subsection (1), “relevant information” is information,\n(16)\nwhether or not contained in a document, which the investigative officer considers\nto be relevant to the investigation.\n\nSearch and seizure warrants\n\n15.(1)\nWhere on an application made by an investigative officer, a judge in\nChambers is satisfied of the circumstances set out in subsection (3), the judge\nmay issue a warrant authorising the officer to\n\n(a)\n\n(b)\n\nenter  and  search  the  premises  specified  in  the  application  for  the\nwarrant; and\n\nseize and retain any material found on the premises which is likely to\nbe of substantial value, whether or not by itself, to the investigation for\nthe purposes of which the application is made.\n\n(2)\n\nAn application for a search and seizure warrant shall\n\n(a)\n\n(b)\n\nspecify the person subject to investigation;\n\nstate that the warrant is sought for the purposes of the investigation;\n\n\f20\n\n(c)\n\n(d)\n\nspecify the premises in respect of which the warrant is sought; and\n\nspecify the material in respect of which the warrant is sought or, where\nthe material cannot be identified at the time of the application, state\nthat there are reasonable grounds for believing that there is material on\nthe premises that\n\n(i)\n\n(ii)\n\nrelates to the person specified in the application or the question\nwhether that person has committed an offence under Part II; and\n\nis likely to be of substantial value, whether or not by itself, to the\ninvestigation for the purposes of which the warrant is sought.\n\n(3)\n\nThe circumstances referred to in subsection (1) are that\n\n(a)\n\n(b)\n\na disclosure order in relation to material has not been complied with\nand there are reasonable grounds for believing that the material is on\nthe premises specified in the application for the warrant; or\n\nthere are reasonable grounds for suspecting that the person specified\nin the application for the warrant has committed an offence under Part\nII and\n\n(i)\n\nthe conditions specified in subsection (4) are fulfilled; or\n\n(ii)\n\nthe conditions specified in subsection (5) are fulfilled.\n\n(4)\n\nThe conditions referred to in subsection (3)(b)(i) are that\n\n(a)\n\nthere are reasonable grounds for believing that\n\n(i)\n\nany material on the premises specified in the application for the\nwarrant is likely to be of substantial value, whether or not by itself,\nto the investigation for the purposes of which the warrant is sought;\nand\n\n(ii)\n\nit is in the public interest for the material to be obtained, having\nregard  to  the  benefit  likely  to  accrue  to  the  investigation  if  the\nmaterial is obtained; and\n\n\f21\n\n(b)\n\nit would not be appropriate to make a disclosure order because\n\n(i)\n\n(ii)\n\n(iii)\n\nit  is  not  practicable  to  communicate  with  any  person  against\nwhom the disclosure order could be made;\n\nit is not practicable to communicate with any person who would\nbe required to comply with an order to grant entry to the premises;\nor\n\nthe  investigation  might  be  seriously  prejudiced  unless  an\ninvestigative  officer  is  able  to  secure  immediate  access  to  the\nmaterial.\n\n(5)\n\nThe conditions referred to in subsection (3)(b)(ii) are that\n\n(a)\n\nthere are reasonable grounds for believing where the material cannot\nbe identified at the time of the application, that there is material on the\npremises specified in the application for the warrant that\n\n(i)\n\n(ii)\n\nrelates to the person specified in the application or the question\nwhether he has committed an offence under Part II; and\n\nis likely to be of substantial value, whether or not by itself, to the\ninvestigation for the purposes of which the warrant is sought; and\n\n(b)\n\nthere are reasonable grounds for believing that it is in the public interest\nfor the material to be obtained, having regard to the benefit likely to\naccrue to the investigation if the material is obtained; and\n\n(c)\n\none of the following applies:\n\n(i)\n\n(ii)\n\n(iii)\n\nit  is  not  practicable  to  communicate  with  any  person  against\nwhom a disclosure order could be made;\n\nentry  to  the  premises  will  not  be  granted  unless  a  warrant  is\nproduced; or\n\nthe  investigation  might  be  seriously  prejudiced  unless  an\ninvestigative  officer  arriving  at  the  premises  is  able  to  secure\nimmediate entry to them.\n\n\f22\n\nA search and seizure warrant does not confer the right to seize privileged\n\n(6)\nmaterial.\n\nOffence of tipping off etc.\n\n16.\nA person who knows or suspects that an investigation into an offence\nunder Part II has been, is being, or is about to be conducted, or that an order under\nthis Part has been made or may be made and\n\n(a)\n\n(b)\n\ndivulges that fact or other information to another person whereby the\ninvestigation is likely to be prejudiced; or\n\nfalsifies,  conceals,  destroys  or  otherwise  disposes  of,  or  causes  or\npermits the falsification, concealment, destruction or disposal of, any\nmatter or thing that he knows or suspects is or is likely to be relevant\nto the investigation,\n\nis guilty of an offence and is liable, on conviction on indictment to a fine of $250\n000 or to imprisonment for 10 years or to both.\n\nPART IV\n\nEVIDENCE\n\nEvidence of unexplained property\n\n17.(1)\nthat\n\nIn proceedings against a person for an offence under Part II, the fact\n\n(a)\n\nthe person\n\n(i)\n\n(ii)\n\nis  in  possession,  for  which  he  cannot  satisfactorily  account,  of\nproperty disproportionate to his known sources of income; or\n\nwas, at or about the date of the alleged offence or at any time since\nthe date of the alleged offence, in possession, for which he cannot\n\n\f23\n\nsatisfactorily account, of property disproportionate to his known\nsources of income; or\n\n(b)\n\nthe person had, at or about the date of the alleged offence or at any time\nsince the date of the alleged offence, obtained an accretion to property\nfor which he cannot satisfactorily account,\n\nmay be proved and may be taken by the court as corroborating the testimony of\nany  witness  giving  evidence  in  such  proceedings  that  the  person  solicited  or\naccepted an advantage and showing that such advantage was solicited or accepted\nas an inducement or reward.\n\nFor the purposes of subsection (1), a person accused of an offence under\n(2)\nPart II shall be presumed to be or to have been in possession of property, or to\nhave obtained an accretion thereto, where such property is or was held, or such\naccretion was obtained, by any other person who, having regard to his relationship\nto the accused or to any other circumstances, there is reason to believe is or was\nholding  such  property  or  obtained  such  accretion  in  trust  for  or  otherwise  on\nbehalf of the accused or as a gift from the accused.\n\nPresumption of corruption in certain cases\n\n18.\nWhere in any proceedings for an offence under section 4 or section\n8(1)  or  (2),  it  is  proved  that  the  accused  gave  or  accepted  an  advantage,  the\nadvantage shall be presumed to have been given or accepted as such inducement\nor reward as is alleged in the particulars of the offence unless, on a balance of\nprobabilities, the contrary is proved.\n\nCertain defences not available\n\n19.\nit is proved that\n\nWhere, in any proceedings for an offence under any section of Part II,\n\n(a)\n\nthe accused accepted an advantage, believing or suspecting or having\ngrounds  to  believe  or  suspect  that  the  advantage  was  given  as  an\ninducement to or reward for or otherwise on account of his doing or\n\n\f24\n\nrefraining from doing any act referred to in that section, it shall be no\ndefence that\n\n(i)\n\n(ii)\n\nhe did not actually have the power, right or opportunity so to do\nor refrain from doing;\n\nhe accepted the advantage without intending so to do or refrain\nfrom doing; or\n\n(iii)\n\nhe did not in fact so do or refrain from doing;\n\n(b)\n\n(c)\n\nthe accused offered an advantage to another person as an inducement\nto, or reward for, or otherwise on account of, that other person’s doing\nor refraining from doing, or having done or refrained from doing, any\nact referred to in that section, believing or suspecting or having reason\nto  believe  or  suspect  that  the  other  person  had  the  power,  right  or\nopportunity so to do or refrain, it shall be no defence that the other\nperson had no such power, right or opportunity;\n\nthe accused offered an advantage to another person as an inducement\nto or reward for or otherwise on account of that other person’s doing\nor refraining from doing, or having done or refrained from doing, any\nact referred to in that section, it shall be no defence that the advantage\nis customary in any profession, trade, vocation or calling.\n\n\f25\n\nPART V\n\nMISCELLANEOUS\n\nOffences in respect of false complaints\n\nA  person  who  knowingly  makes  a  false  allegation  or  maliciously\n20.\nprovides  false  information  related  to  an  offence  under  Part  II  is  guilty  of  an\noffence and is liable\n\n(a)\n\n(b)\n\non summary conviction, to a fine of $50,000 or to imprisonment for 3\nyears or to both; and\n\non conviction on indictment, to a fine of $150 000 or to imprisonment\nfor 5 years or to both.\n\nConvention has force of law\n\nThe United Nations Convention Against Corruption adopted on 31st\n21.\nOctober, 2003 in New York and set out in the Schedule has the force of law in\nBarbados.\n\nJurisdiction\n\n22.\nif done within Barbados, is an offence for the purpose of this Act.\n\nAny act done by a person outside Barbados which would be an offence\n\nRegulations\n\n23.\n\nThe Minister may make regulations for giving effect to this Act.\n\nRepeal\n\n24.\nCorruption Act, 2012 (Act 2012-31) are repealed.\n\nThe Prevention of Corruption Act, Cap. 144 and the Prevention of\n\n\f26\n\nSCHEDULE\n\n(Section 21)\n\nUNITED NATIONS CONVENTION AGAINST CORRUPTION\n\nThe States Parties to this Convention,\n\nPreamble\n\nConcerned about the seriousness of problems and threats posed by corruption to the stability\nand security of societies, undermining the institutions and values of democracy, ethical values\nand justice and jeopardizing sustainable development and the rule of law,\n\nConcerned also about the links between corruption and other forms of crime, in particular\n\norganized crime and economic crime, including money-laundering,\n\nConcerned further about cases of corruption that involve vast quantities of assets, which may\nconstitute a substantial proportion of the resources of States, and that threaten the political stability\nand sustainable development of those States,\n\nConvinced that corruption is no longer a local matter but a transnational phenomenon that\naffects all societies and economies, making international cooperation to prevent and control it\nessential,\n\nConvinced also that a comprehensive and multidisciplinary approach is required to prevent\n\nand combat corruption effectively,\n\nConvinced further that the availability of technical assistance can play an important role in\nenhancing the ability of States, including by strengthening capacity and by institution-building,\nto prevent and combat corruption effectively,\n\nConvinced  that  the  illicit  acquisition  of  personal  wealth  can  be  particularly  damaging  to\n\ndemocratic institutions, national economies and the rule of law,\n\nDetermined to prevent, detect and deter in a more effective manner international transfers of\n\nillicitly acquired assets and to strengthen international cooperation in asset recovery,\n\nAcknowledging the fundamental principles of due process of law in criminal proceedings and\n\nin civil or administrative proceedings to adjudicate property rights,\n\nBearing in mind that the prevention and eradication of corruption is a responsibility of all\nStates  and  that  they  must  cooperate  with  one  another,  with  the  support  and  involvement  of\nindividuals  and  groups  outside  the  public  sector,  such  as  civil  society,  non-governmental\norganizations  and  community-based  organizations,  if  their  efforts  in  this  area  are  to  be\neffective,\n\n\f27\n\nBearing also in mind the principles of proper management of public affairs and public property,\nfairness, responsibility and equality before the law and the need to safeguard integrity and to\nfoster a culture of rejection of corruption,\n\nCommending the work of the Commission on Crime Prevention and Criminal Justice and the\n\nUnited Nations Office on Drugs and Crime in preventing and combating corruption,\n\nRecalling the work carried out by other international and regional organizations in this field,\nincluding the activities of the African Union, the Council of Europe, the Customs Cooperation\nCouncil (also known as the World Customs Organization), the European Union, the League of\nArab States, the Organisation for Economic Cooperation and Development and the Organization\nof American States,\n\nTaking note with appreciation of multilateral instruments to prevent and combat corruption,\nincluding,  inter  alia,  the  Inter-American  Convention  against  Corruption,  adopted  by  the\nOrganization  of  American  States  on  29  March  1996,*  the  Convention  on  the  Fight  against\nCorruption involving Officials of the European Communities or Officials of Member States of\nthe  European  Union,  adopted  by  the  Council  of  the  European  Union  on  26  May  1997,*  the\nConvention  on  Combating  Bribery  of  Foreign  Public  Officials  in  International  Business\nTransactions, adopted by the Organisation for Economic Cooperation and Development on 21\nNovember 1997,* the Criminal Law Convention on Corruption, adopted by the Committee of\nMinisters of the Council of Europe on 27 January 1999,* the Civil Law Convention on Corruption,\nadopted by the Committee of Ministers of the Council of Europe on 4 November 1999,* and the\nAfrican Union Convention on Preventing and Combating Corruption, adopted by the Heads of\nState and Government of the African Union on 12 July 2003,\n\n*[See E/1996/99.]\n\n*[Official Journal of the European Communities, C 195, 25 June 1997.]\n\n*[See  Corruption  and  Integrity  Improvement  Initiatives  in  Developing  Countries  (United  Nations\n\npublication, Sales No. E.98.III.B.18).]\n\n*[Council of Europe, European Treaty Series, No. 173.]\n\n*[Ibid., No. 174.]\n\nWelcoming  the  entry  into  force  on  29  September  2003  of  the  United  Nations  Convention\n\nagainst Transnational Organized Crime*\n\n*[General Assembly resolution 55/25, annex I.]\n\nHave agreed as follows:\n\n\f28\n\nChapter I\n\nGeneral provisions\n\nArticle 1. Statement of purpose\n\nThe purposes of this Convention are:\n\n(a)\n\n(b)\n\n(c)\n\nTo  promote  and  strengthen  measures  to  prevent  and  combat  corruption  more\nefficiently and effectively;\n\nTo promote, facilitate and support international cooperation and technical assistance\nin the prevention of and fight against corruption, including in asset recovery;\n\nTo promote integrity, accountability and proper management of public affairs and\npublic property.\n\nFor the purposes of this Convention:\n\nArticle 2. Use of terms\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n“Public  official”  shall  mean:  (i)  any  person  holding  a  legislative,  executive,\nadministrative  or  judicial  office  of  a  State  Party,  whether  appointed  or  elected,\nwhether  permanent  or  temporary,  whether  paid  or  unpaid,  irrespective  of  that\nperson’s seniority; (ii) any other person who performs a public function, including\nfor a public agency or public enterprise, or provides a public service, as defined in\nthe domestic law of the State Party and as applied in the pertinent area of law of that\nState Party; (iii) any other person defined as a “public official” in the domestic law\nof a State Party. However, for the purpose of some specific measures contained in\nchapter II of this Convention, “public official” may mean any person who performs\na public function or provides a public service as defined in the domestic law of the\nState Party and as applied in the pertinent area of law of that State Party;\n\n“Foreign  public  official”  shall  mean  any  person  holding  a  legislative,  executive,\nadministrative or judicial office of a foreign country, whether appointed or elected;\nand any person exercising a public function for a foreign country, including for a\npublic agency or public enterprise;\n\n“Official  of  a  public  international  organization”  shall  mean  an  international  civil\nservant or any person who is authorized by such an organization to act on behalf of\nthat organization;\n\n“Property”  shall  mean  assets  of  every  kind,  whether  corporeal  or  incorporeal,\nmovable or immovable, tangible or intangible, and legal documents or instruments\nevidencing title to or interest in such assets;\n\n\f29\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n“Proceeds of crime” shall mean any property derived from or obtained, directly or\nindirectly, through the commission of an offence;\n\n“Freezing” or “seizure” shall mean temporarily prohibiting the transfer, conversion,\ndisposition or movement of property or temporarily assuming custody or control of\nproperty on the basis of an order issued by a court or other competent authority;\n\n“Confiscation”,  which  includes  forfeiture  where  applicable,  shall  mean  the\npermanent deprivation of property by order of a court or other competent authority;\n\n“Predicate offence” shall mean any offence as a result of which proceeds have been\ngenerated that may become the subject of an offence as defined in article 23 of this\nConvention;\n\n“Controlled  delivery”  shall  mean  the  technique  of  allowing  illicit  or  suspect\nconsignments to pass out of, through or into the territory of one or more States, with\nthe knowledge and under the supervision of their competent authorities, with a view\nto the investigation of an offence and the identification of persons involved in the\ncommission of the offence.\n\nArticle 3. Scope of application\n\n1.\nThis  Convention  shall  apply  in  accordance  with  its  terms,  to  the  prevention,\ninvestigation and prosecution of corruption and to the freezing, seizure, confiscation and return\nof the proceeds of offences established in accordance with this Convention.\n\n2.\nFor the purposes of implementing this Convention, it shall not be necessary, except\nas otherwise stated herein, for the offences set forth in it to result in damage or harm to state\nproperty.\n\nArticle 4. Protection of sovereignty\n\n1.\nStates Parties shall carry out their obligations under this Convention in a manner\nconsistent with the principles of sovereign equality and territorial integrity of States and that of\nnon-intervention in the domestic affairs of other States.\n\n2.\nNothing in this Convention shall entitle a State Party to undertake in the territory of\nanother  State  the  exercise  of  jurisdiction  and  performance  of  functions  that  are  reserved\nexclusively for the authorities of that other State by its domestic law.\n\n\f30\n\nChapter II\n\nPreventive measures\n\nArticle 5. Preventive anti-corruption policies and practices\n\n1.\nEach State Party shall, in accordance with the fundamental principles of its legal\nsystem, develop and implement or maintain effective, coordinated anti-corruption policies that\npromote  the  participation  of  society  and  reflect  the  principles  of  the  rule  of  law,  proper\nmanagement of public affairs and public property, integrity, transparency and accountability.\n\n2.\nat the prevention of corruption.\n\nEach State Party shall endeavour to establish and promote effective practices aimed\n\n3.\nEach State Party shall endeavour to periodically evaluate relevant legal instruments\nand  administrative  measures  with  a  view  to  determining  their  adequacy  to  prevent  and  fight\ncorruption.\n\n4.\nStates Parties shall, as appropriate and in accordance with the fundamental principles\nof their legal system, collaborate with each other and with relevant international and regional\norganizations  in  promoting  and  developing  the  measures  referred  to  in  this  article.  That\ncollaboration may include participation in international programmes and projects aimed at the\nprevention of corruption.\n\nArticle 6. Preventive anti-corruption body or bodies\n\n1.\nEach State Party shall, in accordance with the fundamental principles of its legal\nsystem, ensure the existence of a body or bodies, as appropriate, that prevent corruption by such\nmeans as:\n\n(a)\n\nImplementing  the  policies  referred  to  in  article  5  of  this  Convention  and,  where\nappropriate, overseeing and coordinating the implementation of those policies;\n\n(b)\n\nIncreasing and disseminating knowledge about the prevention of corruption.\n\n2.\nEach State Party shall grant the body or bodies referred to in paragraph 1 of this\narticle the necessary independence, in accordance with the fundamental principles of its legal\nsystem, to enable the body or bodies to carry out its or their functions effectively and free from\nany undue influence. The necessary material resources and specialized staff, as well as the training\nthat such staff may require to carry out their functions, should be provided.\n\n\f31\n\n3.\nEach State Party shall inform the Secretary-General of the United Nations of the\nname and address of the authority or authorities that may assist other States Parties in developing\nand implementing specific measures for the prevention of corruption.\n\nArticle 7. Public sector\n\n1.\nEach State Party shall, where appropriate and in accordance with the fundamental\nprinciples  of  its  legal  system,  endeavour  to  adopt,  maintain  and  strengthen  systems  for  the\nrecruitment, hiring, retention, promotion and retirement of civil servants and, where appropriate,\nother non-elected public officials:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nThat are based on principles of efficiency, transparency and objective criteria such\nas merit, equity and aptitude;\n\nThat include adequate procedures for the selection and training of individuals for\npublic  positions  considered  especially  vulnerable  to  corruption  and  the  rotation,\nwhere appropriate, of such individuals to other positions;\n\nThat promote adequate remuneration and equitable pay scales, taking into account\nthe level of economic development of the State Party;\n\nThat  promote  education  and  training  programmes  to  enable  them  to  meet  the\nrequirements for the correct, honourable and proper performance of public functions\nand  that  provide  them  with  specialized  and  appropriate  training  to  enhance  their\nawareness of the risks of corruption inherent in the performance of their functions.\nSuch programmes may make reference to codes or standards of conduct in applicable\nareas.\n\n2.\nEach  State  Party  shall  also  consider  adopting  appropriate  legislative  and\nadministrative measures, consistent with the objectives of this Convention and in accordance\nwith the fundamental principles of its domestic law, to prescribe criteria concerning candidature\nfor and election to public office.\n\n3.\nEach State Party shall also consider taking appropriate legislative and administrative\nmeasures,  consistent  with  the  objectives  of  this  Convention  and  in  accordance  with  the\nfundamental principles of its domestic law, to enhance transparency in the funding of candidatures\nfor elected public office and, where applicable, the funding of political parties.\n\nEach State Party shall, in accordance with the fundamental principles of its domestic\n4.\nlaw, endeavour to adopt, maintain and strengthen systems that promote transparency and prevent\nconflicts of interest.\n\n\f32\n\nArticle 8. Codes of conduct for public officials\n\n1.\nIn  order  to  fight  corruption,  each  State  Party  shall  promote,  inter  alia,  integrity,\nhonesty  and  responsibility  among  its  public  officials,  in  accordance  with  the  fundamental\nprinciples of its legal system.\n\n2.\nIn particular, each State Party shall endeavour to apply, within its own institutional\nand  legal  systems,  codes  or  standards  of  conduct  for  the  correct,  honourable  and  proper\nperformance of public functions.\n\n3.\nFor the purposes of implementing the provisions of this article, each State Party\nshall, where appropriate and in accordance with the fundamental principles of its legal system,\ntake note of the relevant initiatives of regional, interregional and multilateral organizations, such\nas  the  International  Code  of  Conduct  for  Public  Officials  contained  in  the  annex  to  General\nAssembly resolution 51/59 of 12 December 1996.\n\n4.\nEach State Party shall also consider, in accordance with the fundamental principles\nof  its  domestic  law,  establishing  measures  and  systems  to  facilitate  the  reporting  by  public\nofficials of acts of corruption to appropriate authorities, when such acts come to their notice in\nthe performance of their functions.\n\n5.\nEach State Party shall endeavour, where appropriate and in accordance with the\nfundamental principles of its domestic law, to establish measures and systems requiring public\nofficials  to  make  declarations  to  appropriate  authorities  regarding,  inter  alia,  their  outside\nactivities, employment, investments, assets and substantial gifts or benefits from which a conflict\nof interest may result with respect to their functions as public officials.\n\n6.\nEach  State  Party  shall  consider  taking,  in  accordance  with  the  fundamental\nprinciples of its domestic law, disciplinary or other measures against public officials who violate\nthe codes or standards established in accordance with this article.\n\nArticle 9. Public procurement and management of public finances\n\n1.\nEach State Party shall, in accordance with the fundamental principles of its legal\nsystem,  take  the  necessary  steps  to  establish  appropriate  systems  of  procurement,  based  on\ntransparency, competition and objective criteria in decision-making, that are effective, inter alia,\nin preventing corruption. Such systems, which may take into account appropriate threshold values\nin their application, shall address, inter alia:\n\n(a)\n\nThe  public  distribution  of  information  relating  to  procurement  procedures  and\ncontracts, including information on invitations to tender and relevant or pertinent\n\n\f33\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\ninformation on the award of contracts, allowing potential tenderers sufficient time to\nprepare and submit their tenders;\n\nThe establishment, in advance, of conditions for participation, including selection\nand award criteria and tendering rules, and their publication;\n\nThe use of objective and predetermined criteria for public procurement decisions, in\norder to facilitate the subsequent verification of the correct application of the rules\nor procedures;\n\nAn effective system of domestic review, including an effective system of appeal, to\nensure  legal  recourse  and  remedies  in  the  event  that  the  rules  or  procedures\nestablished pursuant to this paragraph are not followed;\n\nWhere appropriate, measures to regulate matters regarding personnel responsible for\nprocurement,  such  as  declaration  of  interest  in  particular  public  procurements,\nscreening procedures and training requirements.\n\n2.\nEach State Party shall, in accordance with the fundamental principles of its legal\nsystem, take appropriate measures to promote transparency and accountability in the management\nof public finances. Such measures shall encompass, inter alia:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nProcedures for the adoption of the national budget;\n\nTimely reporting on revenue and expenditure;\n\nA system of accounting and auditing standards and related oversight;\n\nEffective and efficient systems of risk management and internal control; and\n\nWhere  appropriate,  corrective  action  in  the  case  of  failure  to  comply  with  the\nrequirements established in this paragraph.\n\n3.\nEach  State  Party  shall  take  such  civil  and  administrative  measures  as  may  be\nnecessary, in accordance with the fundamental principles of its domestic law, to preserve the\nintegrity of accounting books, records, financial statements or other documents related to public\nexpenditure and revenue and to prevent the falsification of such documents.\n\nArticle 10. Public reporting\n\nTaking into account the need to combat corruption, each State Party shall, in accordance with\nthe fundamental principles of its domestic law, take such measures as may be necessary to enhance\ntransparency in its public administration, including with regard to its organization, functioning\nand decision-making processes, where appropriate. Such measures may include, inter alia:\n\n\f34\n\n(a)\n\n(b)\n\n(c)\n\nAdopting procedures or regulations allowing members of the general public to obtain,\nwhere appropriate, information on the organization, functioning and decision-making\nprocesses  of  its  public  administration  and,  with  due  regard  for  the  protection  of\nprivacy and personal data, on decisions and legal acts that concern members of the\npublic;\n\nSimplifying  administrative  procedures,  where  appropriate,  in  order  to  facilitate\npublic access to the competent decision-making authorities; and\n\nPublishing information, which may include periodic reports on the risks of corruption\nin its public administration.\n\nArticle 11. Measures relating to the judiciary and prosecution services\n\n1.\nBearing in mind the independence of the judiciary and its crucial role in combating\ncorruption,  each  State  Party  shall,  in  accordance  with  the  fundamental  principles  of  its  legal\nsystem and without prejudice to judicial independence, take measures to strengthen integrity and\nto prevent opportunities for corruption among members of the judiciary. Such measures may\ninclude rules with respect to the conduct of members of the judiciary.\n\n2.\nMeasures to the same effect as those taken pursuant to paragraph 1 of this article\nmay be introduced and applied within the prosecution service in those States Parties where it does\nnot form part of the judiciary but enjoys independence similar to that of the judicial service.\n\nArticle 12. Private sector\n\n1.\nEach State Party shall take measures, in accordance with the fundamental principles\nof its domestic law, to prevent corruption involving the private sector, enhance accounting and\nauditing standards in the private sector and, where appropriate, provide effective, proportionate\nand dissuasive civil, administrative or criminal penalties for failure to comply with such measures.\n\n2.\n\nMeasures to achieve these ends may include, inter alia:\n\n(a)\n\n(b)\n\nPromoting  cooperation  between  law  enforcement  agencies  and  relevant  private\nentities;\n\nPromoting the development of standards and procedures designed to safeguard the\nintegrity  of  relevant  private  entities,  including  codes  of  conduct  for  the  correct,\nhonourable  and  proper  performance  of  the  activities  of  business  and  all  relevant\nprofessions and the prevention of conflicts of interest, and for the promotion of the\nuse of good commercial practices among businesses and in the contractual relations\nof businesses with the State;\n\n\f35\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nPromoting  transparency  among  private  entities,  including,  where  appropriate,\nmeasures  regarding  the  identity  of  legal  and  natural  persons  involved  in  the\nestablishment and management of corporate entities;\n\nPreventing the misuse of procedures regulating private entities, including procedures\nregarding  subsidies  and  licences  granted  by  public  authorities  for  commercial\nactivities;\n\nPreventing  conflicts  of  interest  by  imposing  restrictions,  as  appropriate  and  for  a\nreasonable period of time, on the professional activities of former public officials or\non the employment of public officials by the private sector after their resignation or\nretirement, where such activities or employment relate directly to the functions held\nor supervised by those public officials during their tenure;\n\nEnsuring that private enterprises, taking into account their structure and size, have\nsufficient  internal  auditing  controls  to  assist  in  preventing  and  detecting  acts  of\ncorruption and that the accounts and required financial statements of such private\nenterprises are subject to appropriate auditing and certification procedures.\n\n3.\nIn order to prevent corruption, each State Party shall take such measures as may be\nnecessary, in accordance with its domestic laws and regulations regarding the maintenance of\nbooks  and  records,  financial  statement  disclosures  and  accounting  and  auditing  standards,  to\nprohibit  the  following  acts  carried  out  for  the  purpose  of  committing  any  of  the  offences\nestablished in accordance with this Convention:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nThe establishment of off-the-books accounts;\n\nThe making of off-the-books or inadequately identified transactions;\n\nThe recording of non-existent expenditure;\n\nThe entry of liabilities with incorrect identification of their objects;\n\nThe use of false documents; and\n\nThe intentional destruction of bookkeeping documents earlier than foreseen by the\nlaw.\n\n4.\nEach  State  Party  shall  disallow  the  tax  deductibility  of  expenses  that  constitute\nbribes, the latter being one of the constituent elements of the offences established in accordance\nwith articles 15 and 16 of this Convention and, where appropriate, other expenses incurred in\nfurtherance of corrupt conduct.\n\n\f36\n\nArticle 13. Participation of society\n\n1.\nEach State Party shall take appropriate measures, within its means and in accordance\nwith fundamental principles of its domestic law, to promote the active participation of individuals\nand groups outside the public sector, such as civil society, non-governmental organizations and\ncommunity-based organizations, in the prevention of and the fight against corruption and to raise\npublic awareness regarding the existence, causes and gravity of and the threat posed by corruption.\nThis participation should be strengthened by such measures as:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nEnhancing  the  transparency  of  and  promoting  the  contribution  of  the  public  to\ndecision-making processes;\n\nEnsuring that the public has effective access to information;\n\nUndertaking  public  information  activities  that  contribute  to  non-tolerance  of\ncorruption, as well as public education programmes, including school and university\ncurricula;\n\nRespecting,  promoting  and  protecting  the  freedom  to  seek,  receive,  publish  and\ndisseminate  information  concerning  corruption.  That  freedom  may  be  subject  to\ncertain restrictions, but these shall only be such as are provided for by law and are\nnecessary:\n\n(i)\n\n(ii)\n\nFor respect of the rights or reputations of others;\n\nFor the protection of national security or ordre public or of public health or\nmorals.\n\n2.\nEach State Party shall take appropriate measures to ensure that the relevant anti-\ncorruption bodies referred to in this Convention are known to the public and shall provide access\nto such bodies, where appropriate, for the reporting, including anonymously, of any incidents\nthat may be considered to constitute an offence established in accordance with this Convention.\n\nArticle 14. Measures to prevent money-laundering\n\n1.\n\nEach State Party shall:\n\n(a)\n\nInstitute a comprehensive domestic regulatory and supervisory regime for banks and\nnon-bank financial institutions, including natural or legal persons that provide formal\nor informal services for the transmission of money or value and, where appropriate,\nother bodies particularly susceptible to money-laundering, within its competence, in\norder  to  deter  and  detect  all  forms  of  money-laundering,  which  regime  shall\nemphasize  requirements  for  customer  and,  where  appropriate,  beneficial  owner\nidentification, record-keeping and the reporting of suspicious transactions;\n\n\f37\n\n(b)\n\nWithout  prejudice  to  article  46  of  this  Convention,  ensure  that  administrative,\nregulatory, law enforcement and other authorities dedicated to combating money-\nlaundering (including, where appropriate under domestic law, judicial authorities)\nhave  the  ability  to  cooperate  and  exchange  information  at  the  national  and\ninternational levels within the conditions prescribed by its domestic law and, to that\nend, shall consider the establishment of a financial intelligence unit to serve as a\nnational centre for the collection, analysis and dissemination of information regarding\npotential money-laundering.\n\n2.\nStates Parties shall consider implementing feasible measures to detect and monitor\nthe movement of cash and appropriate negotiable instruments across their borders, subject to\nsafeguards to ensure proper use of information and without impeding in any way the movement\nof legitimate capital. Such measures may include a requirement that individuals and businesses\nreport  the  cross-border  transfer  of  substantial  quantities  of  cash  and  appropriate  negotiable\ninstruments.\n\n3.\nrequire financial institutions, including money remitters:\n\nStates  Parties  shall  consider  implementing  appropriate  and  feasible  measures  to\n\n(a)\n\n(b)\n\n(c)\n\nTo include on forms for the electronic transfer of funds and related messages accurate\nand meaningful information on the originator;\n\nTo maintain such information throughout the payment chain; and\n\nTo  apply  enhanced  scrutiny  to  transfers  of  funds  that  do  not  contain  complete\ninformation on the originator.\n\n4.\nIn establishing a domestic regulatory and supervisory regime under the terms of this\narticle, and without prejudice to any other article of this Convention, States Parties are called\nupon  to  use  as  a  guideline  the  relevant  initiatives  of  regional,  interregional  and  multilateral\norganizations against money-laundering.\n\n5.\nStates Parties shall endeavour to develop and promote global, regional, subregional\nand bilateral cooperation among judicial, law enforcement and financial regulatory authorities in\norder to combat money-laundering.\n\n\f38\n\nChapter III\n\nCriminalization and law enforcement\n\nArticle 15. Bribery of national public officials\n\n4.\nto establish as criminal offences, when committed intentionally:\n\nEach State Party shall adopt such legislative and other measures as may be necessary\n\n(a)\n\n(b)\n\nThe promise, offering or giving, to a public official, directly or indirectly, of an undue\nadvantage, for the official himself or herself or another person or entity, in order that\nthe official act or refrain from acting in the exercise of his or her official duties;\n\nThe solicitation or acceptance by a public official, directly or indirectly, of an undue\nadvantage, for the official himself or herself or another person or entity, in order that\nthe official act or refrain from acting in the exercise of his or her official duties.\n\nArticle 16. Bribery of foreign public officials and officials of public international organizations\n\n1.\nEach State Party shall adopt such legislative and other measures as may be necessary\nto establish as a criminal offence, when committed intentionally, the promise, offering or giving\nto  a  foreign  public  official  or  an  official  of  a  public  international  organization,  directly  or\nindirectly, of an undue advantage, for the official himself or herself or another person or entity,\nin order that the official act or refrain from acting in the exercise of his or her official duties, in\norder  to  obtain  or  retain  business  or  other  undue  advantage  in  relation  to  the  conduct  of\ninternational business.\n\n2.\nEach State Party shall consider adopting such legislative and other measures as may\nbe necessary to establish as a criminal offence, when committed intentionally, the solicitation or\nacceptance by a foreign public official or an official of a public international organization, directly\nor indirectly, of an undue advantage, for the official himself or herself or another person or entity,\nin order that the official act or refrain from acting in the exercise of his or her official duties.\n\nArticle 17. Embezzlement, misappropriation or other diversion of property by a public official\n\nEach  State  Party  shall  adopt  such  legislative  and  other  measures  as  may  be  necessary  to\nestablish  as  criminal  offences,  when  committed\nthe  embezzlement,\nmisappropriation or other diversion by a public official for his or her benefit or for the benefit of\nanother person or entity, of any property, public or private funds or securities or any other thing\nof value entrusted to the public official by virtue of his or her position.\n\nintentionally,\n\n\f39\n\nArticle 18. Trading in influence\n\nEach  State  Party  shall  consider  adopting  such  legislative  and  other  measures  as  may  be\n\nnecessary to establish as criminal offences, when committed intentionally:\n\n(a)\n\n(b)\n\nThe promise, offering or giving to a public official or any other person, directly or\nindirectly, of an undue advantage in order that the public official or the person abuse\nhis or her real or supposed influence with a view to obtaining from an administration\nor public authority of the State Party an undue advantage for the original instigator\nof the act or for any other person;\n\nThe solicitation or acceptance by a public official or any other person, directly or\nindirectly, of an undue advantage for himself or herself or for another person in order\nthat the public official or the person abuse his or her real or supposed influence with\na view to obtaining from an administration or public authority of the State Party an\nundue advantage.\n\nArticle 19. Abuse of functions\n\nEach  State  Party  shall  consider  adopting  such  legislative  and  other  measures  as  may  be\nnecessary to establish as a criminal offence, when committed intentionally, the abuse of functions\nor position, that is, the performance of or failure to perform an act, in violation of laws, by a\npublic official in the discharge of his or her functions, for the purpose of obtaining an undue\nadvantage for himself or herself or for another person or entity.\n\nArticle 20. Illicit enrichment\n\nSubject to its constitution and the fundamental principles of its legal system, each State Party\nshall consider adopting such legislative and other measures as may be necessary to establish as\na criminal offence, when committed intentionally, illicit enrichment, that is, a significant increase\nin the assets of a public official that he or she cannot reasonably explain in relation to his or her\nlawful income.\n\nArticle 21. Bribery in the private sector\n\nEach  State  Party  shall  consider  adopting  such  legislative  and  other  measures  as  may  be\nnecessary  to  establish  as  criminal  offences,  when  committed  intentionally  in  the  course  of\neconomic, financial or commercial activities:\n\n(a)\n\nThe promise, offering or giving, directly or indirectly, of an undue advantage to any\nperson who directs or works, in any capacity, for a private sector entity, for the person\nhimself or herself or for another person, in order that he or she, in breach of his or\nher duties, act or refrain from acting;\n\n\f40\n\n(b)\n\nThe solicitation or acceptance, directly or indirectly, of an undue advantage by any\nperson who directs or works, in any capacity, for a private sector entity, for the person\nhimself or herself or for another person, in order that he or she, in breach of his or\nher duties, act or refrain from acting.\n\nArticle 22. Embezzlement of property in the private sector\n\nEach  State  Party  shall  consider  adopting  such  legislative  and  other  measures  as  may  be\nnecessary  to  establish  as  a  criminal  offence,  when  committed  intentionally  in  the  course  of\neconomic, financial or commercial activities, embezzlement by a person who directs or works,\nin any capacity, in a private sector entity of any property, private funds or securities or any other\nthing of value entrusted to him or her by virtue of his or her position.\n\nArticle 23. Laundering of proceeds of crime\n\n1.\nEach  State  party  shall  adopt,  in  accordance  with  fundamental  principles  of  its\ndomestic law, such legislative and other measures as may be necessary to establish as criminal\noffences, when committee intentionally:\n\n(a)\n\n(i)\n\nThe  conversion  or  transfer  of  property,  knowing  that  such  property  is  the\nproceeds of crime, for the purpose of concealing or disguising the illicit origin\nof the property or of helping any person who is involved in the commission of\nthe predicate offence to evade the legal consequences of his or her action;\n\n(ii)\n\nThe concealment or disguise of the true nature, source, location, disposition,\nmovement or ownership of or rights with respect to property, knowing that such\nproperty is the proceeds of crime;\n\n(b)\n\nSubject to the basic concepts of its legal system:\n\n(i)\n\n(ii)\n\nThe acquisition, possession or use of property, knowing, at the time of receipt,\nthat such property is the proceeds of crime;\n\nParticipation in, association with or conspiracy to commit, attempts to commit\nand aiding, abetting, facilitating and counselling the commission of any of the\noffences established in accordance with this article.\n\n2.\n\nFor purposes of implementing or applying paragraph 1 of this article:\n\n(a)\n\n(b)\n\nEach State Party shall seek to apply paragraph 1 of this article to the widest range of\npredicate offences;\n\nEach State Party shall include as predicate offences at a minimum a comprehensive\nrange of criminal offences established in accordance with this Convention;\n\n\f41\n\n(c)\n\n(d)\n\n(e)\n\nFor the purposes of subparagraph (b) above, predicate offences shall include offences\ncommitted both within and outside the jurisdiction of the State Party in question.\nHowever, offences committed outside the jurisdiction of a State Party shall Constitute\npredicate offences only when the relevant conduct is a criminal offence under the\ndomestic law of the State where it is committed and would be a criminal offence\nunder the domestic law of the State Party implementing or applying this article had\nit been committed there;\n\nEach State Party shall furnish copies of its laws that give effect to this article and of\nany subsequent changes to such laws or a description thereof to the Secretary-General\nof the United Nations;\n\nIf required by fundamental principles of the domestic law of a State Party, it may be\nprovided that the offences set forth in paragraph 1 of this article do not apply to the\npersons who committed the predicate offence.\n\nArticle 24. Concealment\n\nWithout prejudice to the provisions of article 23 of this Convention, each State Party shall\nconsider  adopting  such  legislative  and  other  measures  as  may  be  necessary  to  establish  as  a\ncriminal  offence,  when  committed  intentionally  after  the  commission  of  any  of  the  offences\nestablished in accordance with this Convention without having participated in such offences, the\nconcealment  or  continued  retention  of  property  when  the  person  involved  knows  that  such\nproperty is the result of any of the offences established in accordance with this Convention.\n\nArticle 25. Obstruction of justice\n\nEach  State  Party  shall  adopt  such  legislative  and  other  measures  as  may  be  necessary  to\n\nestablish as criminal offences, when committed intentionally:\n\n(a)\n\n(b)\n\nThe use of physical force, threats or intimidation or the promise, offering or giving\nof  an  undue  advantage  to  induce  false  testimony  or  to  interfere  in  the  giving  of\ntestimony or the production of evidence in a proceeding in relation to the commission\nof offences established in accordance with this Convention;\n\nThe use of physical force, threats or intimidation to interfere with the exercise of\nofficial duties by a justice or law enforcement official in relation to the commission\nof  offences  established  in  accordance  with  this  Convention.  Nothing  in  this\nsubparagraph shall prejudice the right of States Parties to have legislation that protects\nother categories of public official.\n\n\f42\n\nArticle 26. Liability of legal persons\n\n1.\nEach State Party shall adopt such measures as may be necessary, consistent with its\nlegal  principles,  to  establish  the  liability  of  legal  persons  for  participation  in  the  offences\nestablished in accordance with this Convention.\n\n2.\nbe criminal, civil or administrative.\n\nSubject to the legal principles of the State Party, the liability of legal persons may\n\n3.\npersons who have committed the offences.\n\nSuch  liability  shall  be  without  prejudice  to  the  criminal  liability  of  the  natural\n\n4.\nEach  State  Party  shall,  in  particular,  ensure  that  legal  persons  held  liable  in\naccordance with this article are subject to effective, proportionate and dissuasive criminal or non-\ncriminal sanctions, including monetary sanctions.\n\nArticle 27. Participation and attempt\n\n1.\nEach State Party shall adopt such legislative and other measures as may be necessary\nto  establish  as  a  criminal  offence,  in  accordance  with  its  domestic  law,  participation  in  any\ncapacity such as an accomplice, assistant or instigator in an offence established in accordance\nwith this Convention.\n\n2.\nEach State Party may adopt such legislative and other measures as may be necessary\nto establish as a criminal offence, in accordance with its domestic law, any attempt to commit an\noffence established in accordance with this Convention.\n\n3.\nEach State Party may adopt such legislative and other measures as may be necessary\nto establish as a criminal offence, in accordance with its domestic law, the preparation for an\noffence established in accordance with this Convention.\n\nArticle 28. Knowledge, intent and purpose as elements of an offence\n\nKnowledge, intent or purpose required as an element of an offence established in accordance\n\nwith this Convention may be inferred from objective factual circumstances.\n\nArticle 29. Statute of limitations\n\nEach State Party shall, where appropriate, establish under its domestic law a long statute of\nlimitations period in which to commence proceedings for any offence established in accordance\nwith  this  Convention  and  establish  a  longer  statute  of  limitations  period  or  provide  for  the\n\n\f43\n\nsuspension of the statute of limitations where the alleged offender has evaded the administration\nof justice.\n\nArticle 30. Prosecution, adjudication and sanctions\n\n1.\nwith this Convention liable to sanctions that take into account the gravity of that offence.\n\nEach State Party shall make the commission of an offence established in accordance\n\n2.\nEach  State  Party  shall  take  such  measures  as  may  be  necessary  to  establish  or\nmaintain, in accordance with its legal system and constitutional principles, an appropriate balance\nbetween  any  immunities  or  jurisdictional  privileges  accorded  to  its  public  officials  for  the\nperformance of their functions and the possibility, when necessary, of effectively investigating,\nprosecuting and adjudicating offences established in accordance with this Convention.\n\n3.\nEach State Party shall endeavour to ensure that any discretionary legal powers under\nits domestic law relating to the prosecution of persons for offences established in accordance with\nthis Convention are exercised to maximize the effectiveness of law enforcement measures in\nrespect of those offences and with due regard to the need to deter the commission of such offences.\n\n4.\nIn the case of offences established in accordance with this Convention, each State\nParty shall take appropriate measures, in accordance with its domestic law and with due regard\nto the rights of the defence, to seek to ensure that conditions imposed in connection with decisions\non release pending trial or appeal take into consideration the need to ensure the presence of the\ndefendant at subsequent criminal proceedings.\n\n5.\nconsidering the eventuality of early release or parole of persons convicted of such offences.\n\nEach State Party shall take into account the gravity of the offences concerned when\n\n6.\nEach State Party, to the extent consistent with the fundamental principles of its legal\nsystem,  shall  consider  establishing  procedures  through  which  a  public  official  accused  of  an\noffence established in accordance with this Convention may, where appropriate, be removed,\nsuspended or reassigned by the appropriate authority, bearing in mind respect for the principle\nof the presumption of innocence.\n\n7.\nWhere  warranted  by  the  gravity  of  the  offence,  each  State  Party,  to  the  extent\nconsistent  with  the  fundamental  principles  of  its  legal  system,  shall  consider  establishing\nprocedures for the disqualification, by court order or any other appropriate means, for a period\nof  time  determined  by  its  domestic  law,  of  persons  convicted  of  offences  established  in\naccordance with this Convention from:\n\n(a)\n\nHolding public office; and\n\n\f44\n\n(b)\n\nHolding office in an enterprise owned in whole or in part by the State.\n\n8.\npowers by the competent authorities against civil servants.\n\nParagraph 1 of this article shall be without prejudice to the exercise of disciplinary\n\n9.\nNothing contained in this Convention shall affect the principle that the description\nof  the  offences  established  in  accordance  with  this  Convention  and  of  the  applicable  legal\ndefences or other legal principles controlling the lawfulness of conduct is reserved to the domestic\nlaw of a State Party and that such offences shall be prosecuted and punished in accordance with\nthat law.\n\n10.\nconvicted of offences established in accordance with this Convention.\n\nStates Parties shall endeavour to promote the reintegration into society of persons\n\nArticle 31. Freezing, seizure and confiscation\n\n1.\nsystem, such measures as may be necessary to enable confiscation of:\n\nEach State Party shall take, to the greatest extent possible within its domestic legal\n\n(a)\n\n(b)\n\nProceeds  of  crime  derived  from  offences  established  in  accordance  with  this\nConvention or property the value of which corresponds to that of such proceeds;\n\nProperty, equipment or other instrumentalities used in or destined for use in offences\nestablished in accordance with this Convention.\n\n2.\nEach  State  Party  shall  take  such  measures  as  may  be  necessary  to  enable  the\nidentification, tracing, freezing or seizure of any item referred to in paragraph 1 of this article for\nthe purpose of eventual confiscation.\n\n3.\nEach State Party shall adopt, in accordance with its domestic law, such legislative\nand  other  measures  as  may  be  necessary  to  regulate  the  administration  by  the  competent\nauthorities of frozen, seized or confiscated property covered in paragraphs 1 and 2 of this article.\n\n4.\nIf such proceeds of crime have been transformed or converted, in part or in full, into\nother property, such property shall be liable to the measures referred to in this article instead of\nthe proceeds.\n\nIf  such  proceeds  of  crime  have  been  intermingled  with  property  acquired  from\n5.\nlegitimate sources, such property shall, without prejudice to any powers relating to freezing or\nseizure, be liable to confiscation up to the assessed value of the intermingled proceeds.\n\n\f45\n\n6.\nIncome or other benefits derived from such proceeds of crime, from property into\nwhich such proceeds of crime have been transformed or converted or from property with which\nsuch proceeds of crime have been intermingled shall also be liable to the measures referred to in\nthis article, in the same manner and to the same extent as proceeds of crime.\n\n7.\nFor the purpose of this article and article 55 of this Convention, each State Party\nshall empower its courts or other competent authorities to order that bank, financial or commercial\nrecords be made available or seized. A State Party shall not decline to act under the provisions\nof this paragraph on the ground of bank secrecy.\n\n8.\nStates Parties may consider the possibility of requiring that an offender demonstrate\nthe lawful origin of such alleged proceeds of crime or other property liable to confiscation, to the\nextent that such a requirement is consistent with the fundamental principles of their domestic law\nand with the nature of judicial and other proceedings.\n\n9.\nbona fide third parties.\n\nThe provisions of this article shall not be so construed as to prejudice the rights of\n\n10.\nNothing contained in this article shall affect the principle that the measures to which\nit refers shall be defined and implemented in accordance with and subject to the provisions of the\ndomestic law of a State Party.\n\nArticle 32. Protection of witnesses, experts and victims\n\n1.\nEach State Party shall take appropriate measures in accordance with its domestic\nlegal system and within its means to provide effective protection from potential retaliation or\nintimidation for witnesses and experts who give testimony concerning offences established in\naccordance with this Convention and, as appropriate, for their relatives and other persons close\nto them.\n\n2.\nprejudice to the rights of the defendant, including the right to due process:\n\nThe measures envisaged in paragraph 1 of this article may include, inter alia, without\n\n(a)\n\nEstablishing procedures for the physical protection of such persons, such as, to the\nextent necessary and feasible, relocating them and permitting, where appropriate,\nnon-disclosure or limitations on the disclosure of information concerning the identity\nand whereabouts of such persons;\n\n(b)\n\nProviding evidentiary rules to permit witnesses and experts to give testimony in a\nmanner that ensures the safety of such persons, such as permitting testimony to be\n\n\f46\n\ngiven through the use of communications technology such as video or other adequate\nmeans.\n\n3.\nStates for the relocation of persons referred to in paragraph 1 of this article.\n\nStates Parties shall consider entering into agreements or arrangements with other\n\n4.\n\nThe provisions of this article shall also apply to victims insofar as they are witnesses.\n\n5.\nEach State Party shall, subject to its domestic law, enable the views and concerns\nof victims to be presented and considered at appropriate stages of criminal proceedings against\noffenders in a manner not prejudicial to the rights of the defence.\n\nArticle 33. Protection of reporting persons\n\nEach  State  Party  shall  consider  incorporating  into  its  domestic  legal  system  appropriate\nmeasures to provide protection against any unjustified treatment for any person who reports in\ngood faith and on reasonable grounds to the competent authorities any facts concerning offences\nestablished in accordance with this Convention.\n\nArticle 34. Consequences of acts of corruption\n\nWith due regard to the rights of third parties acquired in good faith, each State Party shall take\nmeasures,  in  accordance  with  the  fundamental  principles  of  its  domestic  law,  to  address\nconsequences of corruption. In this context, States Parties may consider corruption a relevant\nfactor in legal proceedings to annul or rescind a contract, withdraw a concession or other similar\ninstrument or take any other remedial action.\n\nArticle 35. Compensation for damage\n\nEach State Party shall take such measures as may be necessary, in accordance with principles\nof its domestic law, to ensure that entities or persons who have suffered damage as a result of an\nact of corruption have the right to initiate legal proceedings against those responsible for that\ndamage in order to obtain compensation.\n\nArticle 36. Specialized authorities\n\nEach State Party shall, in accordance with the fundamental principles of its legal system, ensure\nthe existence of a body or bodies or persons specialized in combating corruption through law\nenforcement. Such body or bodies or persons shall be granted the necessary independence, in\naccordance with the fundamental principles of the legal system of the State Party, to be able to\ncarry out their functions effectively and without any undue influence. Such persons or staff of\nsuch body or bodies should have the appropriate training and resources to carry out their tasks.\n\n\f47\n\nArticle 37. Cooperation with law enforcement authorities\n\n1.\nEach  State  Party  shall  take  appropriate  measures  to  encourage  persons  who\nparticipate or who have participated in the commission of an offence established in accordance\nwith this Convention to supply information useful to competent authorities for investigative and\nevidentiary  purposes  and  to  provide  factual,  specific  help  to  competent  authorities  that  may\ncontribute to depriving offenders of the proceeds of crime and to recovering such proceeds.\n\n2.\nEach State Party shall consider providing for the possibility, in appropriate cases,\nof  mitigating  punishment  of  an  accused  person  who  provides  substantial  cooperation  in  the\ninvestigation or prosecution of an offence established in accordance with this Convention.\n\n3.\nEach State Party shall consider providing for the possibility, in accordance with\nfundamental principles of its domestic law, of granting immunity from prosecution to a person\nwho provides substantial cooperation in the investigation or prosecution of an offence established\nin accordance with this Convention.\n\n4.\nof this Convention.\n\nProtection of such persons shall be, mutatis mutandis, as provided for in article 32\n\n5.\nWhere a person referred to in paragraph 1 of this article located in one State Party\ncan provide substantial cooperation to the competent authorities of another State Party, the States\nParties concerned may consider entering into agreements or arrangements, in accordance with\ntheir domestic law, concerning the potential provision by the other State Party of the treatment\nset forth in paragraphs 2 and 3 of this article.\n\nArticle 38. Cooperation between national authorities\n\nEach State Party shall take such measures as may be necessary to encourage, in accordance\nwith its domestic law, cooperation between, on the one hand, its public authorities, as well as its\npublic  officials,  and,  on  the  other  hand,  its  authorities  responsible  for  investigating  and\nprosecuting criminal offences. Such cooperation may include:\n\n(a)\n\nInforming the latter authorities, on their own initiative, where there are reasonable\ngrounds to believe that any of the offences established in accordance with articles\n15, 21 and 23 of this Convention has been committed; or\n\n(b)\n\nProviding, upon request, to the latter authorities all necessary information.\n\n\f48\n\nArticle 39. Cooperation between national authorities and the private sector\n\n1.\nEach State Party shall take such measures as may be necessary to encourage, in\naccordance with its domestic law, cooperation between national investigating and prosecuting\nauthorities and entities of the private sector, in particular financial institutions, relating to matters\ninvolving the commission of offences established in accordance with this Convention.\n\n2.\nEach State Party shall consider encouraging its nationals and other persons with a\nhabitual residence in its territory to report to the national investigating and prosecuting authorities\nthe commission of an offence established in accordance with this Convention.\n\nArticle 40. Bank secrecy\n\nEach State Party shall ensure that, in the case of domestic criminal investigations of offences\nestablished  in  accordance  with  this  Convention,  there  are  appropriate  mechanisms  available\nwithin its domestic legal system to overcome obstacles that may arise out of the application of\nbank secrecy laws.\n\nArticle 41. Criminal record\n\nEach State Party may adopt such legislative or other measures as may be necessary to take\ninto consideration, under such terms as and for the purpose that it deems appropriate, any previous\nconviction in another State of an alleged offender for the purpose of using such information in\ncriminal proceedings relating to an offence established in accordance with this Convention.\n\nArticle 42. Jurisdiction\n\n1.\njurisdiction over the offences established in accordance with this Convention when:\n\nEach  State  Party  shall  adopt  such  measures  as  may  be  necessary  to  establish  its\n\n(a)\n\n(b)\n\nThe offence is committed in the territory of that State Party; or\n\nThe offence is committed on board a vessel that is flying the flag of that State Party\nor an aircraft that is registered under the laws of that State Party at the time that the\noffence is committed.\n\n2.\nover any such offence when:\n\nSubject to article 4 of this Convention, a State Party may also establish its jurisdiction\n\n(a)\n\n(b)\n\nThe offence is committed against a national of that State Party; or\n\nThe offence is committed by a national of that State Party or a stateless person who\nhas his or her habitual residence in its territory; or\n\n\f49\n\n(c)\n\nThe offence is one of those established in accordance with article 23, paragraph 1\n(b) (ii), of this Convention and is committed outside its territory with a view to the\ncommission  of  an  offence  established  in  accordance  with  article  23,  paragraph  1\n(a) (i) or (ii) or (b) (i), of this Convention within its territory; or\n\n(d)\n\nThe offence is committed against the State Party.\n\n3.\nFor the purposes of article 44 of this Convention, each State Party shall take such\nmeasures  as  may  be  necessary  to  establish  its  jurisdiction  over  the  offences  established  in\naccordance with this Convention when the alleged offender is present in its territory and it does\nnot extradite such person solely on the ground that he or she is one of its nationals.\n\n4.\nEach State Party may also take such measures as may be necessary to establish its\njurisdiction over the offences established in accordance with this Convention when the alleged\noffender is present in its territory and it does not extradite him or her.\n\n5.\nIf a State Party exercising its jurisdiction under paragraph 1 or 2 of this article has\nbeen  notified,  or  has  otherwise  learned,  that  any  other  States  Parties  are  conducting  an\ninvestigation, prosecution or judicial proceeding in respect of the same conduct, the competent\nauthorities  of  those  States  Parties  shall,  as  appropriate,  consult  one  another  with  a  view  to\ncoordinating their actions.\n\n6.\nWithout prejudice to norms of general international law, this Convention shall not\nexclude the exercise of any criminal jurisdiction established by a State Party in accordance with\nits domestic law.\n\nChapter IV\n\nInternational cooperation\n\nArticle 43. International cooperation\n\n1.\nStates Parties shall cooperate in criminal matters in accordance with articles 44 to\n50 of this Convention. Where appropriate and consistent with their domestic legal system, States\nParties  shall  consider  assisting  each  other  in  investigations  of  and  proceedings  in  civil  and\nadministrative matters relating to corruption.\n\nIn matters of international cooperation, whenever dual criminality is considered a\n2.\nrequirement, it shall be deemed fulfilled irrespective of whether the laws of the requested State\nParty place the offence within the same category of offence or denominate the offence by the\nsame terminology as the requesting State Party, if the conduct underlying the offence for which\nassistance is sought is a criminal offence under the laws of both States Parties.\n\n\f50\n\nArticle 44. Extradition\n\n1.\nThis  article  shall  apply  to  the  offences  established  in  accordance  with  this\nConvention where the person who is the subject of the request for extradition is present in the\nterritory of the requested State Party, provided that the offence for which extradition is sought is\npunishable under the domestic law of both the requesting State Party and the requested State\nParty.\n\n2.\nNotwithstanding the provisions of paragraph 1 of this article, a State Party whose\nlaw so permits may grant the extradition of a person for any of the offences covered by this\nConvention that are not punishable under its own domestic law.\n\n3.\nIf the request for extradition includes several separate offences, at least one of which\nis extraditable under this article and some of which are not extraditable by reason of their period\nof imprisonment but are related to offences established in accordance with this Convention, the\nrequested State Party may apply this article also in respect of those offences.\n\n4.\nEach of the offences to which this article applies shall be deemed to be included as\nan extraditable offence in any extradition treaty existing between States Parties. States Parties\nundertake  to  include  such  offences  as  extraditable  offences  in  every  extradition  treaty  to  be\nconcluded between them. A State Party whose law so permits, in case it uses this Convention as\nthe basis for extradition, shall not consider any of the offences established in accordance with\nthis Convention to be a political offence.\n\n5.\nIf  a  State  Party  that  makes  extradition  conditional  on  the  existence  of  a  treaty\nreceives a request for extradition from another State Party with which it has no extradition treaty,\nit may consider this Convention the legal basis for extradition in respect of any offence to which\nthis article applies.\n\n6.\n\nA State Party that makes extradition conditional on the existence of a treaty shall:\n\n(a)\n\n(b)\n\nAt the time of deposit of its instrument of ratification, acceptance or approval of or\naccession to this Convention, inform the Secretary-General of the United Nations\nwhether it will take this Convention as the legal basis for cooperation on extradition\nwith other States Parties to this Convention; and\n\nIf it does not take this Convention as the legal basis for cooperation on extradition,\nseek, where appropriate, to conclude treaties on extradition with other States Parties\nto this Convention in order to implement this article.\n\n\f51\n\n7.\nStates Parties that do not make extradition conditional on the existence of a treaty\nshall recognize offences to which this article applies as extraditable offences between themselves.\n\n8.\nExtradition shall be subject to the conditions provided for by the domestic law of\nthe requested State Party or by applicable extradition treaties, including, inter alia, conditions in\nrelation to the minimum penalty requirement for extradition and the grounds upon which the\nrequested State Party may refuse extradition.\n\n9.\nStates Parties shall, subject to their domestic law, endeavour to expedite extradition\nprocedures and to simplify evidentiary requirements relating thereto in respect of any offence to\nwhich this article applies.\n\n10.\nSubject to the provisions of its domestic law and its extradition treaties, the requested\nState Party may, upon being satisfied that the circumstances so warrant and are urgent and at the\nrequest of the requesting State Party, take a person whose extradition is sought and who is present\nin its territory into custody or take other appropriate measures to ensure his or her presence at\nextradition proceedings.\n\n11.\nA State Party in whose territory an alleged offender is found, if it does not extradite\nsuch person in respect of an offence to which this article applies solely on the ground that he or\nshe is one of its nationals, shall, at the request of the State Party seeking extradition, be obliged\nto submit the case without undue delay to its competent authorities for the purpose of prosecution.\nThose authorities shall take their decision and conduct their proceedings in the same manner as\nin the case of any other offence of a grave nature under the domestic law of that State Party. The\nStates  Parties  concerned  shall  cooperate  with  each  other,  in  particular  on  procedural  and\nevidentiary aspects, to ensure the efficiency of such prosecution.\n\n12.\nWhenever a State Party is permitted under its domestic law to extradite or otherwise\nsurrender one of its nationals only upon the condition that the person will be returned to that State\nParty to serve the sentence imposed as a result of the trial or proceedings for which the extradition\nor  surrender  of  the  person  was  sought  and  that  State  Party  and  the  State  Party  seeking  the\nextradition of the person agree with this option and other terms that they may deem appropriate,\nsuch conditional extradition or surrender shall be sufficient to discharge the obligation set forth\nin paragraph 11 of this article.\n\nIf extradition, sought for purposes of enforcing a sentence, is refused because the\n13.\nperson sought is a national of the requested State Party, the requested State Party shall, if its\ndomestic law so permits and in conformity with the requirements of such law, upon application\nof  the  requesting  State  Party,  consider  the  enforcement  of  the  sentence  imposed  under  the\ndomestic law of the requesting State Party or the remainder thereof.\n\n\f52\n\n14.\nAny person regarding whom proceedings are being carried out in connection with\nany of the offences to which this article applies shall be guaranteed fair treatment at all stages of\nthe proceedings, including enjoyment of all the rights and guarantees provided by the domestic\nlaw of the State Party in the territory of which that person is present.\n\n15.\nNothing  in  this  Convention  shall  be  interpreted  as  imposing  an  obligation  to\nextradite if the requested State Party has substantial grounds for believing that the request has\nbeen made for the purpose of prosecuting or punishing a person on account of that person’s sex,\nrace, religion, nationality, ethnic origin or political opinions or that compliance with the request\nwould cause prejudice to that person’s position for any one of these reasons.\n\n16.\noffence is also considered to involve fiscal matters.\n\nStates Parties may not refuse a request for extradition on the sole ground that the\n\n17.\nBefore  refusing  extradition,  the  requested  State  Party  shall,  where  appropriate,\nconsult with the requesting State Party to provide it with ample opportunity to present its opinions\nand to provide information relevant to its allegation.\n\n18.\narrangements to carry out or to enhance the effectiveness of extradition.\n\nStates  Parties  shall  seek  to  conclude  bilateral  and  multilateral  agreements  or\n\nArticle 45. Transfer of sentenced persons\n\nStates Parties may consider entering into bilateral or multilateral agreements or arrangements\non  the  transfer  to  their  territory  of  persons  sentenced  to  imprisonment  or  other  forms  of\ndeprivation of liberty for offences established in accordance with this Convention in order that\nthey may complete their sentences there.\n\nArticle 46. Mutual legal assistance\n\n1.\nStates Parties shall afford one another the widest measure of mutual legal assistance\nin investigations, prosecutions and judicial proceedings in relation to the offences covered by this\nConvention.\n\n2.\nMutual legal assistance shall be afforded to the fullest extent possible under relevant\nlaws,  treaties,  agreements  and  arrangements  of  the  requested  State  Party  with  respect  to\ninvestigations, prosecutions and judicial proceedings in relation to the offences for which a legal\nperson may be held liable in accordance with article 26 of this Convention in the requesting State\nParty.\n\n\f53\n\n3.\nrequested for any of the following purposes:\n\nMutual  legal  assistance  to  be  afforded  in  accordance  with  this  article  may  be\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\n(k)\n\nTaking evidence or statements from persons;\n\nEffecting service of judicial documents;\n\nExecuting searches and seizures, and freezing;\n\nExamining objects and sites;\n\nProviding information, evidentiary items and expert evaluations;\n\nProviding originals or certified copies of relevant documents and records, including\ngovernment, bank, financial, corporate or business records;\n\nIdentifying or tracing proceeds of crime, property, instrumentalities or other things\nfor evidentiary purposes;\n\nFacilitating the voluntary appearance of persons in the requesting State Party;\n\nAny other type of assistance that is not contrary to the domestic law of the requested\nState Party;\n\nIdentifying, freezing and tracing proceeds of crime in accordance with the provisions\nof chapter V of this Convention;\n\nThe  recovery  of  assets,  in  accordance  with  the  provisions  of  chapter  V  of  this\nConvention.\n\n4.\nWithout prejudice to domestic law, the competent authorities of a State Party may,\nwithout prior request, transmit information relating to criminal matters to a competent authority\nin  another  State  Party  where  they  believe  that  such  information  could  assist  the  authority  in\nundertaking or successfully concluding inquiries and criminal proceedings or could result in a\nrequest formulated by the latter State Party pursuant to this Convention.\n\n5.\nThe  transmission  of  information  pursuant  to  paragraph  4  of  this  article  shall  be\nwithout prejudice to inquiries and criminal proceedings in the State of the competent authorities\nproviding the information. The competent authorities receiving the information shall comply with\na request that said information remain confidential, even temporarily, or with restrictions on its\nuse. However, this shall not prevent the receiving State Party from disclosing in its proceedings\ninformation that is exculpatory to an accused person. In such a case, the receiving State Party\nshall notify the transmitting State Party prior to the disclosure and, if so requested, consult with\nthe transmitting State Party. If, in an exceptional case, advance notice is not possible, the receiving\nState Party shall inform the transmitting State Party of the disclosure without delay.\n\n\f54\n\n6.\nThe provisions of this article shall not affect the obligations under any other treaty,\nbilateral or multilateral, that governs or will govern, in whole or in part, mutual legal assistance.\n\n7.\nParagraphs 9 to 29 of this article shall apply to requests made pursuant to this article\nif the States Parties in question are not bound by a treaty of mutual legal assistance. If those States\nParties are bound by such a treaty, the corresponding provisions of that treaty shall apply unless\nthe States Parties agree to apply paragraphs 9 to 29 of this article in lieu thereof. States Parties\nare strongly encouraged to apply those paragraphs if they facilitate cooperation.\n\n8.\narticle on the ground of bank secrecy.\n\nStates Parties shall not decline to render mutual legal assistance pursuant to this\n\n9.\n\n(a)\nA requested State Party, in responding to a request for assistance pursuant to this\narticle in the absence of dual criminality, shall take into account the purposes of this\nConvention, as set forth in article 1;\n\n(b)\n\nStates Parties may decline to render assistance pursuant to this article on the ground\nof  absence  of  dual  criminality.  However,  a  requested  State  Party  shall,  where\nconsistent with the basic concepts of its legal system, render assistance that does not\ninvolve  coercive  action.  Such  assistance  may  be  refused  when  requests  involve\nmatters of a de minimis nature or matters for which the cooperation or assistance\nsought is available under other provisions of this Convention;\n\n(c)\n\nEach State Party may consider adopting such measures as may be necessary to enable\nit to provide a wider scope of assistance pursuant to this article in the absence of dual\ncriminality.\n\n10.\nA person who is being detained or is serving a sentence in the territory of one State\nParty whose presence in another State Party is requested for purposes of identification, testimony\nor  otherwise  providing  assistance  in  obtaining  evidence  for  investigations,  prosecutions  or\njudicial proceedings in relation to offences covered by this Convention may be transferred if the\nfollowing conditions are met:\n\n(a)\n\n(b)\n\nThe person freely gives his or her informed consent;\n\nThe competent authorities of both States Parties agree, subject to such conditions as\nthose States Parties may deem appropriate.\n\n11.\n\nFor the purposes of paragraph 10 of this article:\n\n\f55\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nThe  State  Party  to  which  the  person  is  transferred  shall  have  the  authority  and\nobligation to keep the person transferred in custody, unless otherwise requested or\nauthorized by the State Party from which the person was transferred;\n\nThe State Party to which the person is transferred shall without delay implement its\nobligation to return the person to the custody of the State Party from which the person\nwas  transferred  as  agreed  beforehand,  or  as  otherwise  agreed,  by  the  competent\nauthorities of both States Parties;\n\nThe State Party to which the person is transferred shall not require the State Party\nfrom  which  the  person  was  transferred  to  initiate  extradition  proceedings  for  the\nreturn of the person;\n\nThe person transferred shall receive credit for service of the sentence being served\nin the State from which he or she was transferred for time spent in the custody of the\nState Party to which he or she was transferred.\n\n12.\nUnless the State Party from which a person is to be transferred in accordance with\nparagraphs 10 and 11 of this article so agrees, that person, whatever his or her nationality, shall\nnot be prosecuted, detained, punished or subjected to any other restriction of his or her personal\nliberty in the territory of the State to which that person is transferred in respect of acts, omissions\nor convictions prior to his or her departure from the territory of the State from which he or she\nwas transferred.\n\n13.\nEach State Party shall designate a central authority that shall have the responsibility\nand power to receive requests for mutual legal assistance and either to execute them or to transmit\nthem  to  the  competent  authorities  for  execution.  Where  a  State  Party  has  a  special  region  or\nterritory with a separate system of mutual legal assistance, it may designate a distinct central\nauthority that shall have the same function for that region or territory. Central authorities shall\nensure the speedy and proper execution or transmission of the requests received. Where the central\nauthority  transmits  the  request  to  a  competent  authority  for  execution,  it  shall  encourage  the\nspeedy and proper execution of the request by the competent authority. The Secretary-General\nof the United Nations shall be notified of the central authority designated for this purpose at the\ntime each State Party deposits its instrument of ratification, acceptance or approval of or accession\nto this Convention. Requests for mutual legal assistance and any communication related thereto\nshall be transmitted to the central authorities designated by the States Parties. This requirement\nshall  be  without  prejudice  to  the  right  of  a  State  Party  to  require  that  such  requests  and\ncommunications be addressed to it through diplomatic channels and, in urgent circumstances,\nwhere the States Parties agree, through the International Criminal Police Organization, if possible.\n\n\f56\n\n14.\nRequests  shall  be  made  in  writing  or,  where  possible,  by  any  means  capable  of\nproducing a written record, in a language acceptable to the requested State Party, under conditions\nallowing that State Party to establish authenticity. The Secretary-General of the United Nations\nshall be notified of the language or languages acceptable to each State Party at the time it deposits\nits instrument of ratification, acceptance or approval of or accession to this Convention. In urgent\ncircumstances and where agreed by the States Parties, requests may be made orally but shall be\nconfirmed in writing forthwith.\n\n15.\n\nA request for mutual legal assistance shall contain:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nThe identity of the authority making the request;\n\nThe subject matter and nature of the investigation, prosecution or judicial proceeding\nto which the request relates and the name and functions of the authority conducting\nthe investigation, prosecution or judicial proceeding;\n\nA summary of the relevant facts, except in relation to requests for the purpose of\nservice of judicial documents;\n\nA description of the assistance sought and details of any particular procedure that the\nrequesting State Party wishes to be followed;\n\nWhere possible, the identity, location and nationality of any person concerned; and\n\nThe purpose for which the evidence, information or action is sought.\n\n16.\nThe  requested  State  Party  may  request  additional  information  when  it  appears\nnecessary for the execution of the request in accordance with its domestic law or when it can\nfacilitate such execution.\n\n17.\nA request shall be executed in accordance with the domestic law of the requested\nState Party and, to the extent not contrary to the domestic law of the requested State Party and\nwhere possible, in accordance with the procedures specified in the request.\n\n18.\nWherever  possible  and  consistent  with  fundamental  principles  of  domestic  law,\nwhen an individual is in the territory of a State Party and has to be heard as a witness or expert\nby the judicial authorities of another State Party, the first State Party may, at the request of the\nother, permit the hearing to take place by video conference if it is not possible or desirable for\nthe individual in question to appear in person in the territory of the requesting State Party. States\nParties may agree that the hearing shall be conducted by a judicial authority of the requesting\nState Party and attended by a judicial authority of the requested State Party.\n\n\f57\n\n19.\nThe  requesting  State  Party  shall  not  transmit  or  use  information  or  evidence\nfurnished by the requested State Party for investigations, prosecutions or judicial proceedings\nother  than  those  stated  in  the  request  without  the  prior  consent  of  the  requested  State  Party.\nNothing  in  this  paragraph  shall  prevent  the  requesting  State  Party  from  disclosing  in  its\nproceedings information or evidence that is exculpatory to an accused person. In the latter case,\nthe requesting State Party shall notify the requested State Party prior to the disclosure and, if so\nrequested, consult with the requested State Party. If, in an exceptional case, advance notice is not\npossible, the requesting State Party shall inform the requested State Party of the disclosure without\ndelay.\n\n20.\nThe  requesting  State  Party  may  require  that  the  requested  State  Party  keep\nconfidential the fact and substance of the request, except to the extent necessary to execute the\nrequest. If the requested State Party cannot comply with the requirement of confidentiality, it\nshall promptly inform the requesting State Party.\n\n21.\n\nMutual legal assistance may be refused:\n\n(a)\n\n(b)\n\n(c)\n\nIf the request is not made in conformity with the provisions of this article;\n\nIf  the  requested  State  Party  considers  that  execution  of  the  request  is  likely  to\nprejudice its sovereignty, security, ordre public or other essential interests;\n\nIf the authorities of the requested State Party would be prohibited by its domestic law\nfrom carrying out the action requested with regard to any similar offence, had it been\nsubject  to  investigation,  prosecution  or  judicial  proceedings  under  their  own\njurisdiction;\n\n(d)\n\nIf it would be contrary to the legal system of the requested State Party relating to\nmutual legal assistance for the request to be granted.\n\n22.\nthat the offence is also considered to involve fiscal matters.\n\nStates Parties may not refuse a request for mutual legal assistance on the sole ground\n\n23.\n\nReasons shall be given for any refusal of mutual legal assistance.\n\n24.\nThe requested State Party shall execute the request for mutual legal assistance as\nsoon as possible and shall take as full account as possible of any deadlines suggested by the\nrequesting State Party and for which reasons are given, preferably in the request. The requesting\nState Party may make reasonable requests for information on the status and progress of measures\ntaken by the requested State Party to satisfy its request. The requested State Party shall respond\nto reasonable requests by the requesting State Party on the status, and progress in its handling,\n\n\f58\n\nof the request. The requesting State Party shall promptly inform the requested State Party when\nthe assistance sought is no longer required.\n\n25.\nthat it interferes with an ongoing investigation, prosecution or judicial proceeding.\n\nMutual legal assistance may be postponed by the requested State Party on the ground\n\n26.\nBefore refusing a request pursuant to paragraph 21 of this article or postponing its\nexecution pursuant to paragraph 25 of this article, the requested State Party shall consult with the\nrequesting State Party to consider whether assistance may be granted subject to such terms and\nconditions as it deems necessary. If the requesting State Party accepts assistance subject to those\nconditions, it shall comply with the conditions.\n\n27.\nWithout prejudice to the application of paragraph 12 of this article, a witness, expert\nor other person who, at the request of the requesting State Party, consents to give evidence in a\nproceeding or to assist in an investigation, prosecution or judicial proceeding in the territory of\nthe requesting State Party shall not be prosecuted, detained, punished or subjected to any other\nrestriction of his or her personal liberty in that territory in respect of acts, omissions or convictions\nprior to his or her departure from the territory of the requested State Party. Such safe conduct\nshall cease when the witness, expert or other person having had, for a period of fifteen consecutive\ndays or for any period agreed upon by the States Parties from the date on which he or she has\nbeen officially informed that his or her presence is no longer required by the judicial authorities,\nan opportunity of leaving, has nevertheless remained voluntarily in the territory of the requesting\nState Party or, having left it, has returned of his or her own free will.\n\n28.\nThe ordinary costs of executing a request shall be borne by the requested State Party,\nunless  otherwise  agreed  by  the  States  Parties  concerned.  If  expenses  of  a  substantial  or\nextraordinary nature are or will be required to fulfil the request, the States Parties shall consult\nto determine the terms and conditions under which the request will be executed, as well as the\nmanner in which the costs shall be borne.\n\n29.\n\nThe requested State Party:\n\n(a)\n\n(b)\n\nShall provide to the requesting State Party copies of government records, documents\nor information in its possession that under its domestic law are available to the general\npublic;\n\nMay, at its discretion, provide to the requesting State Party in whole, in part or subject\nto  such  conditions  as  it  deems  appropriate,  copies  of  any  government  records,\ndocuments  or  information  in  its  possession  that  under  its  domestic  law  are  not\navailable to the general public.\n\n\f59\n\n30.\nStates  Parties  shall  consider,  as  may  be  necessary,  the  possibility  of  concluding\nbilateral  or  multilateral  agreements  or  arrangements  that  would  serve  the  purposes  of,  give\npractical effect to or enhance the provisions of this article.\n\nArticle 47. Transfer of criminal proceedings\n\nStates Parties shall consider the possibility of transferring to one another proceedings for the\nprosecution of an offence established in accordance with this Convention in cases where such\ntransfer is considered to be in the interests of the proper administration of justice, in particular in\ncases where several jurisdictions are involved, with a view to concentrating the prosecution.\n\nArticle 48. Law enforcement cooperation\n\n1.\nStates  Parties  shall  cooperate  closely  with  one  another,  consistent  with  their\nrespective  domestic  legal  and  administrative  systems,  to  enhance  the  effectiveness  of  law\nenforcement action to combat the offences covered by this Convention. States Parties shall, in\nparticular, take effective measures:\n\n(a)\n\nTo enhance and, where necessary, to establish channels of communication between\ntheir competent authorities, agencies and services in order to facilitate the secure and\nrapid exchange of information concerning all aspects of the offences covered by this\nConvention, including, if the States Parties concerned deem it appropriate, links with\nother criminal activities;\n\n(b)\n\nTo cooperate with other States Parties in conducting inquiries with respect to offences\ncovered by this Convention concerning:\n\n(i)\n\n(ii)\n\n(iii)\n\nThe identity, whereabouts and activities of persons suspected of involvement\nin such offences or the location of other persons concerned;\n\nThe movement of proceeds of crime or property derived from the commission\nof such offences;\n\nThe  movement  of  property,  equipment  or  other  instrumentalities  used  or\nintended for use in the commission of such offences;\n\n(c)\n\n(d)\n\nTo  provide,  where  appropriate,  necessary  items  or  quantities  of  substances  for\nanalytical or investigative purposes;\n\nTo exchange, where appropriate, information with other States Parties concerning\nspecific means and methods used to commit offences covered by this Convention,\nincluding  the  use  of  false  identities,  forged,  altered  or  false  documents  and  other\nmeans of concealing activities;\n\n\f60\n\n(e)\n\n(f)\n\nTo facilitate effective coordination between their competent authorities, agencies and\nservices  and  to  promote  the  exchange  of  personnel  and  other  experts,  including,\nsubject to bilateral agreements or arrangements between the States Parties concerned,\nthe posting of liaison officers;\n\nTo exchange information and coordinate administrative and other measures taken as\nappropriate for the purpose of early identification of the offences covered by this\nConvention.\n\n2.\nWith a view to giving effect to this Convention, States Parties shall consider entering\ninto bilateral or multilateral agreements or arrangements on direct cooperation between their law\nenforcement agencies and, where such agreements or arrangements already exist, amending them.\nIn the absence of such agreements or arrangements between the States Parties concerned, the\nStates  Parties  may  consider  this  Convention  to  be  the  basis  for  mutual  law  enforcement\ncooperation in respect of the offences covered by this Convention. Whenever appropriate, States\nParties shall make full use of agreements or arrangements, including international or regional\norganizations, to enhance the cooperation between their law enforcement agencies.\n\n3.\ncovered by this Convention committed through the use of modern technology.\n\nStates Parties shall endeavour to cooperate within their means to respond to offences\n\nArticle 49. Joint investigations\n\nStates Parties shall consider concluding bilateral or multilateral agreements or arrangements\nwhereby,  in  relation  to  matters  that  are  the  subject  of  investigations,  prosecutions  or  judicial\nproceedings  in  one  or  more  States,  the  competent  authorities  concerned  may  establish  joint\ninvestigative bodies. In the absence of such agreements or arrangements, joint investigations may\nbe undertaken by agreement on a case-by-case basis. The States Parties involved shall ensure that\nthe sovereignty of the State Party in whose territory such investigation is to take place is fully\nrespected.\n\nArticle 50. Special investigative techniques\n\n1.\nIn  order  to  combat  corruption  effectively,  each  State  Party  shall,  to  the  extent\npermitted  by  the  basic  principles  of  its  domestic  legal  system  and  in  accordance  with  the\nconditions prescribed by its domestic law, take such measures as may be necessary, within its\nmeans, to allow for the appropriate use by its competent authorities of controlled delivery and,\nwhere it deems appropriate, other special investigative techniques, such as electronic or other\nforms  of  surveillance  and  undercover  operations,  within  its  territory,  and  to  allow  for  the\nadmissibility in court of evidence derived therefrom.\n\n\f61\n\n2.\nFor the purpose of investigating the offences covered by this Convention, States\nParties  are  encouraged  to  conclude,  when  necessary,  appropriate  bilateral  or  multilateral\nagreements  or  arrangements  for  using  such  special  investigative  techniques  in  the  context  of\ncooperation at the international level. Such agreements or arrangements shall be concluded and\nimplemented in full compliance with the principle of sovereign equality of States and shall be\ncarried out strictly in accordance with the terms of those agreements or arrangements.\n\n3.\nIn the absence of an agreement or arrangement as set forth in paragraph 2 of this\narticle, decisions to use such special investigative techniques at the international level shall be\nmade  on  a  case-by-case  basis  and  may,  when  necessary,  take  into  consideration  financial\narrangements and understandings with respect to the exercise of jurisdiction by the States Parties\nconcerned.\n\n4.\nDecisions to use controlled delivery at the international level may, with the consent\nof the States Parties concerned, include methods such as intercepting and allowing the goods or\nfunds to continue intact or be removed or replaced in whole or in part.\n\nChapter V\n\nAsset recovery\n\nArticle 51. General provision\n\nThe return of assets pursuant to this chapter is a fundamental principle of this Convention, and\nStates Parties shall afford one another the widest measure of cooperation and assistance in this\nregard.\n\nArticle 52. Prevention and detection of transfers of proceeds of crime\n\n1.\nWithout prejudice to article 14 of this Convention, each State Party shall take such\nmeasures  as  may  be  necessary,  in  accordance  with  its  domestic  law,  to  require  financial\ninstitutions within its jurisdiction to verify the identity of customers, to take reasonable steps to\ndetermine the identity of beneficial owners of funds deposited into high-value accounts and to\nconduct enhanced scrutiny of accounts sought or maintained by or on behalf of individuals who\nare, or have been, entrusted with prominent public functions and their family members and close\nassociates. Such enhanced scrutiny shall be reasonably designed to detect suspicious transactions\nfor  the  purpose  of  reporting  to  competent  authorities  and  should  not  be  so  construed  as  to\ndiscourage or prohibit financial institutions from doing business with any legitimate customer.\n\nIn order to facilitate implementation of the measures provided for in paragraph 1 of\n2.\nthis  article,  each  State  Party,  in  accordance  with  its  domestic  law  and  inspired  by  relevant\n\n\f62\n\ninitiatives  of  regional,  interregional  and  multilateral  organizations  against  money-laundering,\nshall:\n\n(a)\n\n(b)\n\nIssue  advisories  regarding  the  types  of  natural  or  legal  person  to  whose  accounts\nfinancial  institutions  within  its  jurisdiction  will  be  expected  to  apply  enhanced\nscrutiny, the types of accounts and transactions to which to pay particular attention\nand appropriate account-opening, maintenance and record-keeping measures to take\nconcerning such accounts; and\n\nWhere appropriate, notify financial institutions within its jurisdiction, at the request\nof another State Party or on its own initiative, of the identity of particular natural or\nlegal persons to whose accounts such institutions will be expected to apply enhanced\nscrutiny, in addition to those whom the financial institutions may otherwise identify.\n\n3.\nIn the context of paragraph 2 (a) of this article, each State Party shall implement\nmeasures to ensure that its financial institutions maintain adequate records, over an appropriate\nperiod of time, of accounts and transactions involving the persons mentioned in paragraph 1 of\nthis  article,  which  should,  as  a  minimum,  contain  information  relating  to  the  identity  of  the\ncustomer as well as, as far as possible, of the beneficial owner.\n\n4.\nWith  the  aim  of  preventing  and  detecting  transfers  of  proceeds  of  offences\nestablished in accordance with this Convention, each State Party shall implement appropriate and\neffective  measures  to  prevent,  with  the  help  of  its  regulatory  and  oversight  bodies,  the\nestablishment of banks that have no physical presence and that are not affiliated with a regulated\nfinancial group. Moreover, States Parties may consider requiring their financial institutions to\nrefuse to enter into or continue a correspondent banking relationship with such institutions and\nto guard against establishing relations with foreign financial institutions that permit their accounts\nto be used by banks that have no physical presence and that are not affiliated with a regulated\nfinancial group.\n\n5.\nEach State Party shall consider establishing, in accordance with its domestic law,\neffective  financial  disclosure  systems  for  appropriate  public  officials  and  shall  provide  for\nappropriate  sanctions  for  non-compliance.  Each  State  Party  shall  also  consider  taking  such\nmeasures as may be necessary to permit its competent authorities to share that information with\nthe competent authorities in other States Parties when necessary to investigate, claim and recover\nproceeds of offences established in accordance with this Convention.\n\nEach  State  Party  shall  consider  taking  such  measures  as  may  be  necessary,  in\n6.\naccordance with its domestic law, to require appropriate public officials having an interest in or\nsignature or other authority over a financial account in a foreign country to report that relationship\n\n\f63\n\nto  appropriate  authorities  and  to  maintain  appropriate  records  related  to  such  accounts.  Such\nmeasures shall also provide for appropriate sanctions for non-compliance.\n\nArticle 53. Measures for direct recovery of property\n\nEach State Party shall, in accordance with its domestic law:\n\n(a)\n\n(b)\n\n(c)\n\nTake such measures as may be necessary to permit another State Party to initiate civil\naction in its courts to establish title to or ownership of property acquired through the\ncommission of an offence established in accordance with this Convention;\n\nTake such measures as may be necessary to permit its courts to order those who have\ncommitted  offences  established  in  accordance  with  this  Convention  to  pay\ncompensation  or  damages  to  another  State  Party  that  has  been  harmed  by  such\noffences; and\n\nTake such measures as may be necessary to permit its courts or competent authorities,\nwhen having to decide on confiscation, to recognize another State Party’s claim as a\nlegitimate  owner  of  property  acquired  through  the  commission  of  an  offence\nestablished in accordance with this Convention.\n\nArticle 54. Mechanisms for recovery of property through international cooperation in\nconfiscation\n\n1.\nEach State Party, in order to provide mutual legal assistance pursuant to article 55\nof this Convention with respect to property acquired through or involved in the commission of\nan offence established in accordance with this Convention, shall, in accordance with its domestic\nlaw:\n\n(a)\n\n(b)\n\n(c)\n\nTake such measures as may be necessary to permit its competent authorities to give\neffect to an order of confiscation issued by a court of another State Party;\n\nTake such measures as may be necessary to permit its competent authorities, where\nthey have jurisdiction, to order the confiscation of such property of foreign origin by\nadjudication  of  an  offence  of  money-laundering  or  such  other  offence  as  may  be\nwithin its jurisdiction or by other procedures authorized under its domestic law; and\n\nConsider taking such measures as may be necessary to allow confiscation of such\nproperty  without  a  criminal  conviction  in  cases  in  which  the  offender  cannot  be\nprosecuted by reason of death, flight or absence or in other appropriate cases.\n\nEach State Party, in order to provide mutual legal assistance upon a request made\n2.\npursuant to paragraph 2 of article 55 of this Convention, shall, in accordance with its domestic\nlaw:\n\n\f64\n\n(a)\n\n(b)\n\n(c)\n\nTake such measures as may be necessary to permit its competent authorities to freeze\nor seize property upon a freezing or seizure order issued by a court or competent\nauthority of a requesting State Party that provides a reasonable basis for the requested\nState Party to believe that there are sufficient grounds for taking such actions and\nthat the property would eventually be subject to an order of confiscation for purposes\nof paragraph 1 (a) of this article;\n\nTake such measures as may be necessary to permit its competent authorities to freeze\nor seize property upon a request that provides a reasonable basis for the requested\nState Party to believe that there are sufficient grounds for taking such actions and\nthat the property would eventually be subject to an order of confiscation for purposes\nof paragraph 1 (a) of this article; and\n\nConsider taking additional measures to permit its competent authorities to preserve\nproperty for confiscation, such as on the basis of a foreign arrest or criminal charge\nrelated to the acquisition of such property.\n\nArticle 55. International cooperation for purposes of confiscation\n\n1.\nA State Party that has received a request from another State Party having jurisdiction\nover an offence established in accordance with this Convention for confiscation of proceeds of\ncrime, property, equipment or other instrumentalities referred to in article 31, paragraph 1, of this\nConvention situated in its territory shall, to the greatest extent possible within its domestic legal\nsystem:\n\n(a)\n\n(b)\n\nSubmit the request to its competent authorities for the purpose of obtaining an order\nof confiscation and, if such an order is granted, give effect to it; or\n\nSubmit to its competent authorities, with a view to giving effect to it to the extent\nrequested, an order of confiscation issued by a court in the territory of the requesting\nState Party in accordance with articles 31, paragraph 1, and 54, paragraph 1 (a), of\nthis Convention insofar as it relates to proceeds of crime, property, equipment or\nother instrumentalities referred to in article 31, paragraph 1, situated in the territory\nof the requested State Party.\n\n2.\nFollowing a request made by another State Party having jurisdiction over an offence\nestablished in accordance with this Convention, the requested State Party shall take measures to\nidentify,  trace  and  freeze  or  seize  proceeds  of  crime,  property,  equipment  or  other\ninstrumentalities  referred  to  in  article  31,  paragraph  1,  of  this  Convention  for  the  purpose  of\neventual confiscation to be ordered either by the requesting State Party or, pursuant to a request\nunder paragraph 1 of this article, by the requested State Party.\n\n\f65\n\n3.\nThe provisions of article 46 of this Convention are applicable, mutatis mutandis, to\nthis article. In addition to the information specified in article 46, paragraph 15, requests made\npursuant to this article shall contain:\n\n(a)\n\n(b)\n\n(c)\n\nIn the case of a request pertaining to paragraph 1 (a) of this article, a description of\nthe property to be confiscated, including, to the extent possible, the location and,\nwhere relevant, the estimated value of the property and a statement of the facts relied\nupon by the requesting State Party sufficient to enable the requested State Party to\nseek the order under its domestic law;\n\nIn the case of a request pertaining to paragraph 1(b) of this article, a legally admissible\ncopy  of  an  order  of  confiscation  upon  which  the  request  is  based  issued  by  the\nrequesting State Party, a statement of the facts and information as to the extent to\nwhich execution of the order is requested, a statement specifying the measures taken\nby the requesting State Party to provide adequate notification to bona fide third parties\nand to ensure due process and a statement that the confiscation order is final;\n\nIn the case of a request pertaining to paragraph 2 of this article, a statement of the\nfacts  relied  upon  by  the  requesting  State  Party  and  a  description  of  the  actions\nrequested and, where available, a legally admissible copy of an order on which the\nrequest is based.\n\n4.\nThe decisions or actions provided for in paragraphs 1 and 2 of this article shall be\ntaken by the requested State Party in accordance with and subject to the provisions of its domestic\nlaw and its procedural rules or any bilateral or multilateral agreement or arrangement to which\nit may be bound in relation to the requesting State Party.\n\n5.\nEach State Party shall furnish copies of its laws and regulations that give effect to\nthis article and of any subsequent changes to such laws and regulations or a description thereof\nto the Secretary-General of the United Nations.\n\n6.\nIf a State Party elects to make the taking of the measures referred to in paragraphs\n1  and  2  of  this  article  conditional  on  the  existence  of  a  relevant  treaty,  that  State  Party  shall\nconsider this Convention the necessary and sufficient treaty basis.\n\n7.\nCooperation under this article may also be refused or provisional measures lifted if\nthe requested State Party does not receive sufficient and timely evidence or if the property is of\na de minimis value.\n\n\f66\n\n8.\nBefore lifting any provisional measure taken pursuant to this article, the requested\nState Party shall, wherever possible, give the requesting State Party an opportunity to present its\nreasons in favour of continuing the measure.\n\n9.\nfide third parties.\n\nThe provisions of this article shall not be construed as prejudicing the rights of bona\n\nArticle 56. Special cooperation\n\nWithout prejudice to its domestic law, each State Party shall endeavour to take measures to\npermit  it  to  forward,  without  prejudice  to  its  own  investigations,  prosecutions  or  judicial\nproceedings, information on proceeds of offences established in accordance with this Convention\nto  another  State  Party  without  prior  request,  when  it  considers  that  the  disclosure  of  such\ninformation  might  assist  the  receiving  State  Party  in  initiating  or  carrying  out  investigations,\nprosecutions or judicial proceedings or might lead to a request by that State Party under this\nchapter of the Convention.\n\nArticle 57. Return and disposal of assets\n\n1.\nProperty confiscated by a State Party pursuant to article 31 or 55 of this Convention\nshall be disposed of, including by return to its prior legitimate owners, pursuant to paragraph 3\nof this article, by that State Party in accordance with the provisions of this Convention and its\ndomestic law.\n\n2.\nEach State Party shall adopt such legislative and other measures, in accordance with\nthe  fundamental  principles  of  its  domestic  law,  as  may  be  necessary  to  enable  its  competent\nauthorities to return confiscated property, when acting on the request made by another State Party,\nin accordance with this Convention, taking into account the rights of bona fide third parties.\n\n3.\nthis article, the requested State Party shall:\n\nIn accordance with articles 46 and 55 of this Convention and paragraphs 1 and 2 of\n\n(a)\n\n(b)\n\nIn the case of embezzlement of public funds or of laundering of embezzled public\nfunds as referred to in articles 17 and 23 of this Convention, when confiscation was\nexecuted in accordance with article 55 and on the basis of a final judgement in the\nrequesting State Party, a requirement that can be waived by the requested State Party,\nreturn the confiscated property to the requesting State Party;\n\nIn the case of proceeds of any other offence covered by this Convention, when the\nconfiscation was executed in accordance with article 55 of this Convention and on\nthe basis of a final judgement in the requesting State Party, a requirement that can be\nwaived by the requested State Party, return the confiscated property to the requesting\n\n\f67\n\nState  Party,  when  the  requesting  State  Party  reasonably  establishes  its  prior\nownership  of  such  confiscated  property  to  the  requested  State  Party  or  when  the\nrequested State Party recognizes damage to the requesting State Party as a basis for\nreturning the confiscated property;\n\n(c)\n\nIn all other cases, give priority consideration to returning confiscated property to the\nrequesting  State  Party,  returning  such  property  to  its  prior  legitimate  owners  or\ncompensating the victims of the crime.\n\n4.\nWhere appropriate, unless States Parties decide otherwise, the requested State Party\nmay deduct reasonable expenses incurred in investigations, prosecutions or judicial proceedings\nleading to the return or disposition of confiscated property pursuant to this article.\n\n5.\nWhere appropriate, States Parties may also give special consideration to concluding\nagreements or mutually acceptable arrangements, on a case-by-case basis, for the final disposal\nof confiscated property.\n\nArticle 58. Financial intelligence unit\n\nStates Parties shall cooperate with one another for the purpose of preventing and combating\nthe  transfer  of  proceeds  of  offences  established  in  accordance  with  this  Convention  and  of\npromoting  ways  and  means  of  recovering  such  proceeds  and,  to  that  end,  shall  consider\nestablishing  a  financial  intelligence  unit  to  be  responsible  for  receiving,  analysing  and\ndisseminating to the competent authorities reports of suspicious financial transactions.\n\nArticle 59. Bilateral and multilateral agreements and arrangements\n\nStates Parties shall consider concluding bilateral or multilateral agreements or arrangements\nto enhance the effectiveness of international cooperation undertaken pursuant to this chapter of\nthe Convention.\n\nChapter VI\n\nTechnical assistance and information exchange\n\nArticle 60. Training and technical assistance\n\n1.\nEach State Party shall, to the extent necessary, initiate, develop or improve specific\ntraining programmes for its personnel responsible for preventing and combating corruption. Such\ntraining programmes could deal, inter alia, with the following areas:\n\n(a)\n\nEffective  measures  to  prevent,  detect,  investigate,  punish  and  control  corruption,\nincluding the use of evidence-gathering and investigative methods;\n\n\f68\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\nBuilding  capacity  in  the  development  and  planning  of  strategic  anti-corruption\npolicy;\n\nTraining  competent  authorities  in  the  preparation  of  requests  for  mutual  legal\nassistance that meet the requirements of this Convention;\n\nEvaluation  and  strengthening  of  institutions,  public  service  management  and  the\nmanagement of public finances, including public procurement, and the private sector;\n\nPreventing  and  combating  the  transfer  of  proceeds  of  offences  established  in\naccordance with this Convention and recovering such proceeds;\n\nDetecting  and  freezing  of  the  transfer  of  proceeds  of  offences  established  in\naccordance with this Convention;\n\nSurveillance of the movement of proceeds of offences established in accordance with\nthis  Convention  and  of  the  methods  used  to  transfer,  conceal  or  disguise  such\nproceeds;\n\nAppropriate  and  efficient  legal  and  administrative  mechanisms  and  methods  for\nfacilitating  the  return  of  proceeds  of  offences  established  in  accordance  with  this\nConvention;\n\nMethods  used  in  protecting  victims  and  witnesses  who  cooperate  with  judicial\nauthorities; and\n\n(j)\n\nTraining in national and international regulations and in languages.\n\n2.\nStates Parties shall, according to their capacity, consider affording one another the\nwidest measure of technical assistance, especially for the benefit of developing countries, in their\nrespective plans and programmes to combat corruption, including material support and training\nin the areas referred to in paragraph 1 of this article, and training and assistance and the mutual\nexchange of relevant experience and specialized knowledge, which will facilitate international\ncooperation between States Parties in the areas of extradition and mutual legal assistance.\n\n3.\nStates  Parties  shall  strengthen,  to  the  extent  necessary,  efforts  to  maximize\noperational  and  training  activities  in  international  and  regional  organizations  and  in  the\nframework of relevant bilateral and multilateral agreements or arrangements.\n\nStates  Parties  shall  consider  assisting  one  another,  upon  request,  in  conducting\n4.\nevaluations, studies and research relating to the types, causes, effects and costs of corruption in\ntheir  respective  countries,  with  a  view  to  developing,  with  the  participation  of  competent\nauthorities and society, strategies and action plans to combat corruption.\n\n\f69\n\n5.\nIn order to facilitate the recovery of proceeds of offences established in accordance\nwith this Convention, States Parties may cooperate in providing each other with the names of\nexperts who could assist in achieving that objective.\n\n6.\nStates  Parties  shall  consider  using  subregional,  regional  and  international\nconferences  and  seminars  to  promote  cooperation  and  technical  assistance  and  to  stimulate\ndiscussion  on  problems  of  mutual  concern,  including  the  special  problems  and  needs  of\ndeveloping countries and countries with economies in transition.\n\n7.\nStates  Parties  shall  consider  establishing  voluntary  mechanisms  with  a  view  to\ncontributing financially to the efforts of developing countries and countries with economies in\ntransition to apply this Convention through technical assistance programmes and projects.\n\n8.\nEach  State  Party  shall  consider  making  voluntary  contributions  to  the  United\nNations Office on Drugs and Crime for the purpose of fostering, through the Office, programmes\nand projects in developing countries with a view to implementing this Convention.\n\nArticle 61. Collection, exchange and analysis of information on corruption\n\n1.\nEach State Party shall consider analysing, in consultation with experts, trends in\ncorruption  in  its  territory,  as  well  as  the  circumstances  in  which  corruption  offences  are\ncommitted.\n\n2.\nStates Parties shall consider developing and sharing with each other and through\ninternational and regional organizations statistics, analytical expertise concerning corruption and\ninformation with a view to developing, insofar as possible, common definitions, standards and\nmethodologies, as well as information on best practices to prevent and combat corruption.\n\n3.\ncorruption and making assessments of their effectiveness and efficiency.\n\nEach State Party shall consider monitoring its policies and actual measures to combat\n\nArticle 62. Other measures: implementation of the Convention through economic development\nand technical assistance\n\n1.\nStates Parties shall take measures conducive to the optimal implementation of this\nConvention  to  the  extent  possible,  through  international  cooperation,  taking  into  account  the\nnegative effects of corruption on society in general, in particular on sustainable development.\n\n2.\nwith each other, as well as with international and regional organizations:\n\nStates Parties shall make concrete efforts to the extent possible and in coordination\n\n\f70\n\n(a)\n\n(b)\n\n(c)\n\nTo enhance their cooperation at various levels with developing countries, with a view\nto strengthening the capacity of the latter to prevent and combat corruption;\n\nTo  enhance  financial  and  material  assistance  to  support  the  efforts  of  developing\ncountries to prevent and fight corruption effectively and to help them implement this\nConvention successfully;\n\nTo provide technical assistance to developing countries and countries with economies\nin  transition  to  assist  them  in  meeting  their  needs  for  the  implementation  of  this\nConvention. To that end, States Parties shall endeavour to make adequate and regular\nvoluntary contributions to an account specifically designated for that purpose in a\nUnited  Nations  funding  mechanism.  States  Parties  may  also  give  special\nconsideration,  in  accordance  with  their  domestic  law  and  the  provisions  of  this\nConvention,  to  contributing  to  that  account  a  percentage  of  the  money  or  of  the\ncorresponding value of proceeds of crime or property confiscated in accordance with\nthe provisions of this Convention;\n\n(d)\n\nTo encourage and persuade other States and financial institutions as appropriate to\njoin them in efforts in accordance with this article, in particular by providing more\ntraining programmes and modern equipment to developing countries in order to assist\nthem in achieving the objectives of this Convention.\n\n3.\nTo the extent possible, these measures shall be without prejudice to existing foreign\nassistance commitments or to other financial cooperation arrangements at the bilateral, regional\nor international level.\n\n4.\nStates Parties may conclude bilateral or multilateral agreements or arrangements on\nmaterial and logistical assistance, taking into consideration the financial arrangements necessary\nfor the means of international cooperation provided for by this Convention to be effective and\nfor the prevention, detection and control of corruption.\n\nChapter VII\n\nMechanisms for implementation\n\nArticle 63. Conference of the States Parties to the Convention\n\nA  Conference  of  the  States  Parties  to  the  Convention  is  hereby  established  to\n1.\nimprove the capacity of and cooperation between States Parties to achieve the objectives set forth\nin this Convention and to promote and review its implementation.\n\nThe Secretary-General of the United Nations shall convene the Conference of the\n2.\nStates Parties not later than one year following the entry into force of this Convention. Thereafter,\n\n\f71\n\nregular meetings of the Conference of the States Parties shall be held in accordance with the rules\nof procedure adopted by the Conference.\n\n3.\nThe  Conference  of  the  States  Parties  shall  adopt  rules  of  procedure  and  rules\ngoverning the functioning of the activities set forth in this article, including rules concerning the\nadmission and participation of observers, and the payment of expenses incurred in carrying out\nthose activities.\n\n4.\nmethods of work to achieve the objectives set forth in paragraph 1 of this article, including:\n\nThe  Conference  of  the  States  Parties  shall  agree  upon  activities,  procedures  and\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nFacilitating activities by States Parties under articles 60 and 62 and chapters II to V\nof  this  Convention,  including  by  encouraging  the  mobilization  of  voluntary\ncontributions;\n\nFacilitating the exchange of information among States Parties on patterns and trends\nin corruption and on successful practices for preventing and combating it and for the\nreturn of proceeds of crime, through, inter alia, the publication of relevant information\nas mentioned in this article;\n\nCooperating with relevant international and regional organizations and mechanisms\nand non-governmental organizations;\n\nMaking appropriate use of relevant information produced by other international and\nregional  mechanisms  for  combating  and  preventing  corruption  in  order  to  avoid\nunnecessary duplication of work;\n\nReviewing periodically the implementation of this Convention by its States Parties;\n\nMaking recommendations to improve this Convention and its implementation;\n\nTaking note of the technical assistance requirements of States Parties with regard to\nthe implementation of this Convention and recommending any action it may deem\nnecessary in that respect.\n\n5.\nFor the purpose of paragraph 4 of this article, the Conference of the States Parties\nshall acquire the necessary knowledge of the measures taken by States Parties in implementing\nthis  Convention  and  the  difficulties  encountered  by  them  in  doing  so  through  information\nprovided by them and through such supplemental review mechanisms as may be established by\nthe Conference of the States Parties.\n\nEach State Party shall provide the Conference of the States Parties with information\n6.\non its programmes, plans and practices, as well as on legislative and administrative measures to\n\n\f72\n\nimplement this Convention, as required by the Conference of the States Parties. The Conference\nof  the  States  Parties  shall  examine  the  most  effective  way  of  receiving  and  acting  upon\ninformation, including, inter alia, information received from States Parties and from competent\ninternational organizations. Inputs received from relevant non-governmental organizations duly\naccredited in accordance with procedures to be decided upon by the Conference of the States\nParties may also be considered.\n\n7.\nPursuant to paragraphs 4 to 6 of this article, the Conference of the States Parties\nshall  establish,  if  it  deems  it  necessary,  any  appropriate  mechanism  or  body  to  assist  in  the\neffective implementation of the Convention.\n\nArticle 64. Secretariat\n\n1.\nservices to the Conference of the States Parties to the Convention.\n\nThe Secretary-General of the United Nations shall provide the necessary secretariat\n\n2.\n\nThe secretariat shall:\n\n(a)\n\n(b)\n\n(c)\n\nAssist the Conference of the States Parties in carrying out the activities set forth in\narticle  63  of  this  Convention  and  make  arrangements  and  provide  the  necessary\nservices for the sessions of the Conference of the States Parties;\n\nUpon request, assist States Parties in providing information to the Conference of the\nStates Parties as envisaged in article 63, paragraphs 5 and 6, of this Convention; and\n\nEnsure the necessary coordination with the secretariats of relevant international and\nregional organizations.\n\nChapter VIII\n\nFinal provisions\n\nArticle 65. Implementation of the Convention\n\n1.\nEach  State  Party  shall  take  the  necessary  measures,  including  legislative  and\nadministrative measures, in accordance with fundamental principles of its domestic law, to ensure\nthe implementation of its obligations under this Convention.\n\n2.\nby this Convention for preventing and combating corruption.\n\nEach State Party may adopt more strict or severe measures than those provided for\n\n\f73\n\nArticle 66. Settlement of disputes\n\n1.\napplication of this Convention through negotiation.\n\nStates  Parties  shall  endeavour  to  settle  disputes  concerning  the  interpretation  or\n\n2.\nAny dispute between two or more States Parties concerning the interpretation or\napplication of this Convention that cannot be settled through negotiation within a reasonable time\nshall, at the request of one of those States Parties, be submitted to arbitration. If, six months after\nthe date of the request for arbitration, those States Parties are unable to agree on the organization\nof the arbitration, any one of those States Parties may refer the dispute to the International Court\nof Justice by request in accordance with the Statute of the Court.\n\n3.\nEach State Party may, at the time of signature, ratification, acceptance or approval\nof or accession to this Convention, declare that it does not consider itself bound by paragraph 2\nof this article. The other States Parties shall not be bound by paragraph 2 of this article with\nrespect to any State Party that has made such a reservation.\n\n4.\nAny State Party that has made a reservation in accordance with paragraph 3 of this\narticle may at any time withdraw that reservation by notification to the Secretary-General of the\nUnited Nations.\n\nArticle 67. Signature, ratification, acceptance, approval and accession\n\n1.\nThis Convention shall be open to all States for signature from 9 to 11 December\n2003 in Merida, Mexico, and thereafter at United Nations Headquarters in New York until 9\nDecember 2005.\n\n2.\nThis Convention shall also be open for signature by regional economic integration\norganizations  provided  that  at  least  one  member  State  of  such  organization  has  signed  this\nConvention in accordance with paragraph 1 of this article.\n\n3.\nThis Convention is subject to ratification, acceptance or approval. Instruments of\nratification, acceptance or approval shall be deposited with the Secretary-General of the United\nNations. A regional economic integration organization may deposit its instrument of ratification,\nacceptance or approval if at least one of its member States has done likewise. In that instrument\nof  ratification,  acceptance  or  approval,  such  organization  shall  declare  the  extent  of  its\ncompetence with respect to the matters governed by this Convention. Such organization shall\nalso inform the depositary of any relevant modification in the extent of its competence.\n\n\f74\n\n4.\nThis  Convention  is  open  for  accession  by  any  State  or  any  regional  economic\nintegration  organization  of  which  at  least  one  member  State  is  a  Party  to  this  Convention.\nInstruments of accession shall be deposited with the Secretary-General of the United Nations. At\nthe time of its accession, a regional economic integration organization shall declare the extent of\nits competence with respect to matters governed by this Convention. Such organization shall also\ninform the depositary of any relevant modification in the extent of its competence.\n\nArticle 68. Entry into force\n\n1.\nThis Convention shall enter into force on the ninetieth day after the date of deposit\nof the thirtieth instrument of ratification, acceptance, approval or accession. For the purpose of\nthis paragraph, any instrument deposited by a regional economic integration organization shall\nnot be counted as additional to those deposited by member States of such organization.\n\n2.\nFor each State or regional economic integration organization ratifying, accepting,\napproving or acceding to this Convention after the deposit of the thirtieth instrument of such\naction, this Convention shall enter into force on the thirtieth day after the date of deposit by such\nState or organization of the relevant instrument or on the date this Convention enters into force\npursuant to paragraph 1 of this article, whichever is later.\n\nArticle 69. Amendment\n\n1.\nAfter the expiry of five years from the entry into force of this Convention, a State\nParty may propose an amendment and transmit it to the Secretary-General of the United Nations,\nwho  shall  thereupon  communicate  the  proposed  amendment  to  the  States  Parties  and  to  the\nConference of the States Parties to the Convention for the purpose of considering and deciding\non the proposal. The Conference of the States Parties shall make every effort to achieve consensus\non each amendment. If all efforts at consensus have been exhausted and no agreement has been\nreached, the amendment shall, as a last resort, require for its adoption a two-thirds majority vote\nof the States Parties present and voting at the meeting of the Conference of the States Parties.\n\n2.\nRegional economic integration organizations, in matters within their competence,\nshall exercise their right to vote under this article with a number of votes equal to the number of\ntheir member States that are Parties to this Convention. Such organizations shall not exercise\ntheir right to vote if their member States exercise theirs and vice versa.\n\n3.\nratification, acceptance or approval by States Parties.\n\nAn amendment adopted in accordance with paragraph 1 of this article is subject to\n\nAn amendment adopted in accordance with paragraph 1 of this article shall enter\n4.\ninto force in respect of a State Party ninety days after the date of the deposit with the Secretary-\n\n\f75\n\nGeneral of the United Nations of an instrument of ratification, acceptance or approval of such\namendment.\n\n5.\nWhen an amendment enters into force, it shall be binding on those States Parties\nwhich have expressed their consent to be bound by it. Other States Parties shall still be bound by\nthe provisions of this Convention and any earlier amendments that they have ratified, accepted\nor approved.\n\nArticle 70. Denunciation\n\n1.\nA State Party may denounce this Convention by written notification to the Secretary-\nGeneral of the United Nations. Such denunciation shall become effective one year after the date\nof receipt of the notification by the Secretary-General.\n\n2.\nConvention when all of its member States have denounced it.\n\nA  regional  economic  integration  organization  shall  cease  to  be  a  Party  to  this\n\nArticle 71. Depositary and languages\n\n1.\nConvention.\n\nThe  Secretary-General  of  the  United  Nations  is  designated  depositary  of  this\n\n2.\nThe original of this Convention, of which the Arabic, Chinese, English, French,\nRussian and Spanish texts are equally authentic, shall be deposited with the Secretary-General\nof the United Nations.\n\nIN WITNESS WHEREOF, the undersigned plenipotentiaries, being duly authorized thereto\n\nby their respective Governments, have signed this Convention.\n\n\fPREVENTION OF CORRUPTION BILL, 2021\n\nEXPLANATORY MEMORANDUM\n\nThe Prevention of Corruption Bill, 2021 would provide for the prevention,\n\ninvestigation and prosecution of acts of corruption.\n\nPART I\nPRELIMINARY\n\nClause 1:\n\nprovides the short title.\n\nClause 2:\n\nprovides definitions for certain terms used in the legislation.\n\nClause 3:\n\nexplains the concepts of offering, soliciting and accepting an\nadvantage.\n\nPART II\nACTS OF CORRUPTION CONSTITUTING OFFENCES\n\nClause 4:\n\nmakes  it  an  offence  to  bribe  persons  exercising  public\nfunctions.\n\nClause 5:\n\nmakes it an offence to bribe a foreign public official.\n\nClause 6:\n\nClause 7:\n\nmakes it an offence to bribe an official of a public international\norganization.\n\nmakes it illegal for a person to offer or accept a bribe to use\nhis  influence  in  order  for  another  person  to  obtain  an\nadvantage from a public authority.\n\nClause 8:\n\nmakes it an offence, among other things, to offer or accept a\nbribe in relation to a contract with a public authority.\n\ni\n\n\fPREVENTION OF CORRUPTION\nBILL, 2021\n\nClause 9:\n\nClause 10:\n\nmakes  it  illegal  to  offer  or  accept  a  bribe  in  relation  to\nrefraining from bidding an at auction of a public authority.\n\nmakes it an offence for an agent to accept a bribe as regards\nhis obligations to his principal.\n\nClause 11:\n\nprohibits bribery in the private sector.\n\nClause 12:\n\nspecifies the penalties for acts of corruption.\n\nClause 13:\n\ndisqualifies  a  person  convicted  of  an  offence  from  holding\npublic office for 10 years.\n\nPART III\nINVESTIGATIONS\n\nClause 14:\n\nClause 15:\n\nClause 16:\n\nallows an investigative officer to obtain a disclosure order to\nrequire persons to provide information.\n\nprovides for a warrant to be issued for the search of premises\nand the seizure of material.\n\nmakes it an offence to tip off someone, among other things,\nabout the conduct of an investigation.\n\nPART IV\nEVIDENCE\n\nClause 17:\n\nprovides for evidence that an accused has property for which\nhe  cannot  give  a  satisfactory  account  to  be  used  for\ncorroboration and as evidence that he accepted an advantage.\n\nClause 18:\n\nallows for a presumption of corruption to be made in certain\ncases.\n\nii\n\n\fPREVENTION OF CORRUPTION\nBILL, 2021\n\nClause 19:\n\ndisallows the use of certain defences including that an offer\nor  acceptance  of  an  advantage  is  customary  in  certain\nprofessions or trades.\n\nPART V\nMISCELLANEOUS\n\nClause 20:\n\nClause 21:\n\nmakes it an offence to knowingly make a false allegation of\ncorruption.\n\nprovides explicitly or the United Nations Convention Against\nCorruption to have the force of law in Barbados.\n\nClause 22:\n\nspeaks to the extra-territorial effect of the legislation.\n\nClause 23:\n\nClause 24:\n\nprovides for the Minister to make regulations to give effect to\nthe legislation.\n\nrepeals the Prevention of Corruption Act, Cap. 144 and the\nPrevention of Corruption Act, 2012 (Act 2012-31).\n\niii\n\n"
}