{
  "bill_id": 581,
  "slug": "constitution-amendment-no-2-bill-2021",
  "title": "Constitution (Amendment) (No. 2 ) Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/56f53e308108b4b315d1b367c2914f7a.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-09-29",
  "first_reading": "2021-09-29",
  "gazette_date": "2021-10-06",
  "markdown": "2021-09-28\n\nBill as amended\n\nOBJECTS AND REASONS\n\nThis Bill would alter the Constitution in order\n\n(a)\n\nto provide for Barbados to become a republic with a President who\nshall be Head of State of Barbados; and\n\n(b)\n\nto provide for related matters.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nSAVINGS AND TRANSITIONAL PROVISIONS RELATING TO\nBARBADOS BECOMING A REPUBLIC\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nThe appointed day\n\nConstitution of Barbados\n\nExisting law\n\nPrerogative and privilege\n\nLegal proceedings and other matters\n\nSuccession to property\n\nRights, liabilities and obligations\n\n10.\n\nExisting officers\n\n11.\n\nJudges of the Supreme Court\n\n12.\n\nOaths\n\n\f3\n\n13.\n\nProvisions relating to existing Commissions\n\n14.\n\nElection of first President\n\n15.\n\nSaving for offices of Prime Minister and Ministers\n\n16.\n\nValidation of certain enactments\n\n17.\n\nSaving for prescribed matters\n\n18.\n\nParliament\n\n19.\n\nSaving for Standing Orders\n\nPART II\n\nALTERATION OF THE CONSTITUTION\n\n20.\n\nAmendment of section 4 of the Constitution\n\n21.\n\nRepeal and replacement of Chapter IV of the Constitution\n\n22.\n\nRepeal and replacement of section 35 of the Constitution\n\n23.\n\nAmendment of section 41 of the Constitution\n\n24.\n\nAmendment of section 44 of the Constitution\n\n25.\n\nAmendment of section 49 of the Constitution\n\n26.\n\nAmendment of section 58 of the Constitution\n\n27.\n\nRepeal and replacement of section 63 of the Constitution\n\n28.\n\nAmendment of section 78 of the Constitution\n\n\f4\n\n29.\n\nAmendment of section 117 of the Constitution\n\n30.\n\nAmendment of the Constitution\n\nFIRST SCHEDULE\n\nSECOND SCHEDULE\n\nTHIRD SCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to alter the Constitution in order\n\n(a)\n\nto provide for Barbados to become a republic with a President who\nshall be Head of State of Barbados; and\n\n(b)\n\nto provide for related matters.\n\nWHEREAS section 49 of the Constitution provides that Parliament may, by\n\nan Act of Parliament passed by both Houses, alter the Constitution:\n\n\f6\n\nAND  WHEREAS  that  section  further  provides  that  a  Bill  for  an  Act  of\nParliament under that section that alters certain fundamental provisions of the\nConstitution shall not be passed in either House unless at the final voting in\nthe House the Bill is supported by the votes of not less than two-thirds of all\nthe members of the House:\n\nAND WHEREAS the Parliament of Barbados by this Act intends to alter\n\nthe Constitution, including the fundamental provisions of the Constitution:\n\nENACTED by the Parliament of Barbados in accordance with the provisions\n\nof section 49 of the Constitution as follows:\n\nPART I\n\nSAVINGS AND TRANSITIONAL PROVISIONS RELATING TO\nBARBADOS BECOMING A REPUBLIC\n\nShort title\n\n1.\n2021.\n\nThis Act may be cited as the Constitution (Amendment) (No. 2) Act,\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“appointed day” means the day fixed by Proclamation of the Governor-General\n\nfor the coming into operation of this Act;\n\n“existing  law”  means  any  law  having  effect  as  part  of  the  law  of  Barbados\nimmediately before the appointed day, including any law made before the\nappointed day and coming to operation on or after that day;\n\n“Independence  Order”  means  the  Barbados  Independence  Order,  1966\n\n(L.N. 1966 No. 1455) (UK);\n\n“State” means Barbados.\n\n\f7\n\nThe appointed day\n\n3.\nGazette fix a day for the coming into operation of this Act.\n\nThe  Governor-General  shall  by  proclamation  published  in  the\n\nConstitution of Barbados\n\nThe Independence Order is revoked; but the revocation of that Order\n4.(1)\nshall not affect the validity of the Constitution set out in the Schedule to that\nOrder.\n\nThe Constitution referred to in subsection (1) shall be altered in accordance\n(2)\nwith the provisions of section 49 thereof in the manner and to the extent set out\nin this Act; and on the appointed day the Constitution as so altered shall become\nthe Constitution and supreme law of Barbados.\n\nExisting law\n\nSubject to this section, the operation of the existing law on and after\n5.(1)\nthe appointed day shall not be affected by the revocation of the Independence\nOrder  but  the  existing  law  shall  be  construed  with  such  modifications,\nadaptations, qualifications and exceptions as may be necessary to bring existing\nlaw into conformity with the Constitution.\n\nThe President may, by order made at any time within the period of 3 years\n(2)\nnext  after  the  appointed  day,  make  such  modifications  to  any  existing  law  as\nappears to him to be necessary or expedient for bringing that law into conformity\nwith the Constitution.\n\nSubsection (2) does not affect any power conferred by any law upon any\n\n(3)\nperson or authority, other than the President, to modify any existing law.\n\n(4)\n\nWhere anything\n\n(a)\n\nwas done under an existing law before that law was modified by or\nunder this section; and\n\n\f8\n\n(b)\n\nwould, but for this subsection, cease by virtue of that modification to\nhave effect,\n\nthat thing shall continue to have effect after the modification as if it had been\ndone under the existing law as so modified.\n\nIn subsection (2), “modification” includes amendment, adaptation or other\n\n(5)\nalteration authorised by subsection (1).\n\nWithout prejudice to the generality of subsections (1) to (4) and subject to\n(6)\nany order made under subsection (2), in any existing law which continues in force\nafter the appointed day or in any public document, in relation to any time or any\nperiod commencing on or after the appointed day, unless the context otherwise\nrequires\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nany reference to Her Majesty the Queen, whether or not that expression\nis used, or to the Crown or to the Sovereign shall be read and construed\nas if it were a reference to the State;\n\nany reference to the Governor-General, shall be read and construed as\nif it were a reference to the President;\n\nany reference to Crown lands shall be read and construed as a reference\nto State lands; and\n\nany reference to Her Majesty’s dominions shall be read and construed\nas a reference to the Commonwealth.\n\nPrerogative and privilege\n\n6.(1)\nWhere under any existing law any prerogative or privilege is vested\nin Her Majesty or the Crown or the Sovereign that prerogative or privilege shall,\non the appointed day, vest in the State and, subject to the Constitution and any\nother  law,  the  President  shall  have  power  to  do  all  things  necessary  for  the\nexercise thereof on or after that day.\n\nWhere  under  any  existing  law  any  rights,  powers,  privileges,  duties  or\n(2)\nfunctions  are  conferred  or  imposed  on  the  Governor-General,  those  rights,\n\n\f9\n\npowers, privileges, duties and functions shall, on the appointed day, vest in and\nbe exercisable by the President.\n\nLegal proceedings and other matters\n\n7.(1)\nSubject to subsection (2), all actions, suits and other legal proceedings\npending before any court on the appointed day shall continue before that court,\nincluding the Supreme Court established by the Constitution, and the Caribbean\nCourt  of  Justice  as  if  they  had  been  commenced  in  that  court  under  the\nConstitution.\n\nAny criminal proceedings pending in any court immediately before the\n(2)\nappointed day in which Her Majesty the Queen is a party may be continued after\nthe appointed day with the substitution of the State as a party.\n\nWhere any matter or thing has been commenced before the appointed day\n(3)\nby  the  Governor-General  in  exercise  of  any  power  in  that  behalf  under  any\nexisting  law,  such  matter  or  thing  may  be  continued  and  completed  by  the\nPresident on or after the appointed day.\n\nSuccession to property\n\n8.(1)\nthe Crown, shall, on the appointed day, vest in the State.\n\nAll property which immediately before the appointed day is vested in\n\nAll property which immediately before the appointed day is liable to be\n(2)\nforfeited to the Crown shall, from the appointed day, be liable to be forfeited to\nthe State.\n\nWhere,  immediately  before  the  appointed  day,  any  person  holds  any\n(3)\nproperty  in  trust  for  the  Crown  or  for  the  purposes  of  Barbados  or  for  the\nGovernor-General for the purposes of the Government, that person shall from\nthe appointed day, hold such property on the like trusts for the State with effect\nfrom that day.\n\n\f10\n\nRights, liabilities and obligations\n\n9.(1)\nthe appointed day, be rights, liabilities and obligations of the State.\n\nAll rights, liabilities and obligations of Her Majesty shall, on and after\n\n(2)\nAll rights, liabilities and obligations of the Governor-General or the holder\nof any other office under the Crown in right of the Government of Barbados,\nshall, on and after the appointed day, be rights, liabilities and obligations of the\nPresident or of the holder of that other office, as the case may be, on behalf of\nthe State.\n\nIn this section, rights, liabilities and obligations include rights, liabilities\n(3)\nand obligations arising from contract or otherwise, other than rights mentioned\nin sections 6 or 8.\n\nExisting officers\n\nSubject to the provisions of this Act and of the Constitution, every\n10.(1)\nperson who immediately before the appointed day holds or is acting in a public\noffice shall, as from that day, continue to hold or act in the like office as if he had\nbeen  appointed  to  that  office  in  accordance  with  the  provisions  of  the\nConstitution.\n\nA person who under any existing law would have been required to vacate\n(2)\nhis office at the expiration of any period shall vacate his office at the expiration\nof that period.\n\nJudges of the Supreme Court\n\n11.\nThe Judges of the Supreme Court, holding office immediately before\nthe appointed day shall, as from that day, continue to hold office as if they had\nbeen appointed thereto under the provisions of the Constitution.\n\nOaths\n\n12.(1)\nA  person  who,  on  the  appointed  day  holds  an  office  to  which  this\nsection applies, by virtue of having been the holder of the like office before that\n\n\f11\n\nday,  shall  be  deemed  to  have  complied  with  the  requirements  of  the\nConstitution or any other law relating to the taking of oaths with respect to that\noffice.\n\n(2)\n\nThis section applies to the following offices:\n\n(a)\n\n(b)\n\n(c)\n\nPrime Minister,\n\nMinister,\n\nParliamentary Secretary,\n\n(d)\n\nPresident of the Senate,\n\n(e)\n\nSpeaker of the House of Assembly,\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nLeader of the Opposition,\n\nDirector of Public Prosecutions,\n\nAuditor-General,\n\nChairman or member of a Service Commission,\n\nChairman or a member of the Electoral and Boundaries Commission;\nand\n\n(k)\n\nan office to which section 10 or 11 applies.\n\nProvisions relating to existing Commissions\n\n13.(1)\nAny power of a Commission established by the Constitution before\nthe appointed day, which immediately before that day, was validly delegated to\nany person or authority shall, to the extent that that power could be delegated\nunder  the  Constitution  to  such  person  or  authority,  be  deemed  as  from  the\nappointed day, to have been delegated to that person or authority in accordance\nwith the provisions of the Constitution.\n\nAny matter which immediately before the appointed day is pending before\n(2)\nan existing Commission or, as the case may be, before a person or authority to\nwhom  the  power  to  deal  with  such  matters  has  been  delegated  under  the\n\n\f12\n\nConstitution shall, as from the appointed day continue before the Commission\nor, as the case may be, before the said person or authority where such delegation\nhas been continued under subsection (1).\n\nWhere an existing Commission or, as the case may be, a person or authority\n(3)\nreferred to in subsection (1) has, immediately before the appointed day, partly\ncompleted the hearing of disciplinary proceedings, in this subsection referred to\nas “the original hearing” no person shall take part in the continued hearing unless\nhe  has  also  taken  part  in  the  original  hearing;  and  where  by  virtue  of  this\nsubsection  and  subsection  (2)  the  original  hearing  cannot  be  continued  the\nhearing of the disciplinary proceedings shall be commenced de novo.\n\nExcept in the case of the Judicial and Legal Service Commission, a person\n(4)\nwho immediately before the appointed day holds the office of Chairman or other\nmember of an existing Service Commission, shall, as from the appointed day\ncontinue to hold the like office as if he had been appointed in accordance with\nthe provisions of the Constitution.\n\nThe persons holding the office of Chairman and members of the Electoral\n(5)\nand Boundaries Commission on the day immediately before the appointed day\nshall, as from the appointed day, continue to hold the like office in the Electoral\nand Boundaries Commission under the Constitution as if they had been appointed\nto such offices in accordance with the Constitution.\n\nElection of first President\n\n14.(1)\n\nIn accordance with the provisions of this section,\n\n(a)\n\n(b)\n\nthe Prime Minister shall; and\n\nthe Leader of the Opposition may,\n\nno later than 15th October, 2021, nominate a person to be elected as the President\nof Barbados.\n\nIf the Prime Minister and the Leader of the Opposition make in writing to\n(2)\nthe Speaker a joint nomination of a qualified candidate for election as President,\nbeing  a  nomination  to  which  that  candidate  has  consented,  the  Speaker  shall\n\n\f13\n\nnotify both Houses of the joint nomination and, at a joint meeting of both Houses,\nthe Speaker shall ask the members whether any member has an objection to the\ncandidate  being  declared  duly  elected  and  if  no  member  objects  thereto,  the\nSpeaker shall declare the candidate duly elected.\n\nIf there is an objection under subsection (2) the Speaker shall not declare\n\n(3)\nthe candidate duly elected but shall suspend the joint meeting.\n\nThe members of each House shall immediately following the suspension,\n(4)\nresume in their respective House and the presiding officer of each House shall\nput the question referred to in subsection (2) to a vote.\n\nImmediately upon announcing the result of the vote in each House, the\n(5)\njoint sitting shall resume and the President of the Senate and the Speaker of the\nHouse of Assembly shall each announce the result of the vote.\n\nIf the candidate receives not less than two-thirds of the votes cast in each\n\n(6)\nHouse, the Speaker shall then declare the candidate duly elected.\n\nIf  the  Prime  Minister  and  the  Leader  of  the  Opposition  before  the  15th\n(7)\nOctober, 2021 nominate separate persons for election to the office of President,\nthe Speaker shall notify both Houses of Parliament with a view to the holding of\nan election for an appointment to the office of President.\n\nThe Speaker shall cause adequate notice of the election of a President to\n(8)\nbe published in the Gazette but the period of such notice shall be not less than,\n\n(a)\n\n(b)\n\nif there is only one nominee, seven days; and\n\nif there is more than one nominee, fourteen days.\n\nSubsections (12), (14) and (16) of section 32 of the Constitution apply,\n\n(9)\nmutatis mutandis, to this section.\n\nThe person elected under the provisions of this section shall assume the\n\n(10)\noffice of President on 30th November, 2021.\n\n\f14\n\n(11)\nChapter IV, except sections 32 and 33, of the Constitution shall apply to\nthe person elected to the office of President under this section as if that person\nhad been elected to that office under the provisions of that Chapter.\n\n(12)\nFor the purposes of this section, if the Prime Minister and the Leader of\nthe Opposition each nominate the same person, the nominations shall be deemed\nto be a joint nomination.\n\nSaving for offices of Prime Minister and Ministers\n\nThe person who immediately before the appointed day holds the office\n15.(1)\nof Prime Minister shall as from that day continue to hold office as Prime Minister\nas if he had been appointed to that office under the provisions of section 65(1)\nof the Constitution.\n\nWhere the person who is Prime Minister under subsection (1) is for any\n(2)\nreason unable to act or where the office of Prime Minister is vacant, the President,\nacting on the advice of the Prime Minister, if the Prime Minister is able so to do,\nshall  appoint  a  person  who  is  a  Minister  under  subsection  (3)  to  perform  the\nfunctions of Prime Minister until such time as that person is again able to perform\nhis  functions  as  Prime  Minister  or  until  the  next  general  election  after  the\nappointed day is held, whichever first occurs.\n\nAny person, other than the Prime Minister, who immediately before the\n(3)\nappointed day holds office as a Minister shall as from that day hold the like office\nas if that person had been appointed in accordance with the provisions of section\n65(2) of the Constitution.\n\nAny person holding the office of Prime Minister or other Minister by virtue\n(4)\nof the provisions of subsections (1) to (3) who, immediately before the appointed\nday, was assigned responsibility for any matter or department of Government\nshall, as from that day be deemed to have been assigned responsibility for such\nmatter or department under the Constitution.\n\nA person who, immediately before the appointed day holds the office of\n(5)\nParliamentary Secretary under the Constitution, shall, as from that day, hold the\n\n\f15\n\nlike office as if that person had been appointed in accordance with the provisions\nof the Constitution.\n\nThe person who, immediately before the appointed day, holds the office\n(6)\nof President of the Senate, shall, as from that day, hold the like office as if he had\nbeen appointed in accordance with the provisions of the Constitution.\n\nThe person who, immediately before the appointed day, holds the office\n(7)\nof Speaker, shall, as from that day, continue to hold the like office as if he had\nbeen appointed in accordance with the provisions of the Constitution.\n\nThe person who, immediately before the appointed day, holds the office\n(8)\nof Leader of the Opposition, shall as from that day, continue to hold the like office\nas  if  he  had  been  appointed  in  accordance  with  the  provisions  of  the\nConstitution.\n\nValidation of certain enactments\n\nAn enactment to which this section applies is to be taken to have been\n16.(1)\nvalidly passed or made and to have had full force and effect as part of the law of\nBarbados immediately before the appointed day even if it was inconsistent with\nany provision of the Constitution in force before the appointed day.\n\n(2)\n\nAn enactment is an enactment to which this section applies if\n\n(a)\n\nit was passed or made by Parliament or another person or authority\nunder or by virtue of the Constitution in force before the appointed day;\nand\n\n(b)\n\nbefore the appointed day it had not\n\n(i)\n\n(ii)\n\nlapsed  or  been  repealed  or  become  spent  or  otherwise  had  its\neffect; or\n\nbeen  declared  by  a  competent  court  to  be  void  by  reason  of\ninconsistency with a provision of the Constitution.\n\n\f16\n\nSaving for prescribed matters\n\n17.(1)\nAn  enactment  to  which  this  section  applies  continues  in  full  force\nand effect on and after the appointed day for all purposes of the Constitution until\nsome other matter or thing is prescribed under the Constitution for the purposes\nof the Constitution.\n\nThis section applies to any enactment duly passed or made by Parliament\n(2)\nor another person or authority under or by virtue of the Constitution before the\nappointed day and in force immediately before the appointed day\n\n(a)\n\nprescribing  any  matter  or  thing  required  or  authorised  by  the\nConstitution in force before the appointed day to be prescribed for the\npurposes of that Constitution; and\n\n(b)\n\nthat is correspondingly required or authorised by the Constitution to be\nprescribed for the purposes of the Constitution.\n\nParliament\n\n18.\nNotwithstanding  anything  contained  in  section  61(3)  of  the\nConstitution  (but  subject  to  the  provisions  of  subsections  (4)  and  (5)  of  that\nsection)  Parliament  shall,  unless  sooner  dissolved,  stand  dissolved  on  the\nexpiration of five years from the first sitting of the existing House of Assembly\nafter the general election of members of the House of Assembly last preceding\nthe appointed day.\n\nSaving for Standing Orders\n\n19.\nforce immediately before the appointed day\n\nThe Standing Orders of the Senate and the House of Assembly as in\n\n(a)\n\ncontinue in force on and after that day as the Standing Orders of the\nSenate  and\nthe\nConstitution; and\n\nthe  House  of  Assembly,  respectively  under\n\n\f17\n\n(b)\n\nare  to  be  read  and  construed  with  such  modifications  as  may  be\nnecessary to bring them into conformity with the Constitution.\n\nPART II\n\nALTERATION OF THE CONSTITUTION\n\nAmendment of section 4 of the Constitution\n\n20.\nsubstituted:\n\nSection  4(a)  of  the  Constitution  is  deleted  and  the  following  is\n\n“(a)\n\nhis  father  possesses  such  immunity  from  suit  and  legal\nprocess as is accorded to an envoy of a foreign sovereign State\naccredited to Barbados and neither of his parents is a citizen\nof Barbados; or”\n\nRepeal and replacement of Chapter IV of the Constitution\n\n21.\nsubstituted:\n\nChapter  IV  of  the  Constitution  is  deleted  and  the  following  is\n\n“CHAPTER IV\n\nTHE PRESIDENT\n\nOffice of President and Head of State\n\n28.(1)\n\nThere shall be a President who shall be the Head of State.\n\n(2)\n\nThe President shall be Head of the armed forces.\n\nThe President shall have such functions as are assigned to him\n\n(3)\nby this Constitution or any other law.\n\n\f18\n\nQualification\n\n29.\nPresident if he is a citizen of Barbados by birth or descent.\n\nA  person  is  qualified  to  be  nominated  for  election  as\n\nDisqualifications\n\n30.\nPresident if he\n\nA  person  is  not  qualified  to  be  elected  to  the  office  of\n\n(a)\n\n(b)\n\n(c)\n\nis a member of the House of Assembly or Senate;\n\nwas a member of the House of Assembly or Senate within\nthe period of twelve months immediately preceding the date\nof his nomination; or\n\nis  disqualified  to  be  elected  as  a  member  of  the  House  of\nAssembly  by  virtue  of  section  44  or  any  law  made  under\nsubsection (2) of that section.\n\nDetermination of certain questions\n\nThe Court of Appeal has exclusive jurisdiction to hear and\n31.(1)\ndetermine any question whether a person is qualified to be nominated\nfor election, or to be elected, as President.\n\nAn application to the Court of Appeal for the determination of\n(2)\nsuch  a  question  may  be  made  by  the  Attorney-General  or  by  any\nmember of the House of Assembly and, if the application is not made\nby the Attorney-General, the Attorney-General may intervene and may\nthen appear or be represented in the proceedings.\n\nParliament shall regulate the powers, practice and procedure of\n\n(3)\nthe Court of Appeal in relation to applications under subsection (2).\n\nWithout prejudice to the generality of subsection (3), Parliament\n(4)\nmay  make  provision  regulating  the  time  within  which  and  the\nconditions upon which applications under subsection (2) may be made,\n\n\f19\n\nbut, until such provision has been made, the procedure for moving the\nCourt of Appeal shall be regulated by rules of court.\n\nA  certificate  by  the  Speaker  stating  that  a  person  has  been\n(5)\ndeclared duly elected under section 32 is conclusive evidence of the\nfacts stated in the certificate and shall not be questioned in any court.\n\nElection of President\n\n32.(1)\nWhenever the office of President is vacant, or if the term of\noffice of the President is due to expire within not more than ninety days,\nthe Prime Minister shall consult with the Leader of the Opposition with\na view to their joint nomination of a candidate for election as President.\n\nIf the Prime Minister and the Leader of the Opposition make in\n(2)\nwriting to the Speaker a joint nomination of a qualified candidate for\nelection as President, being a nomination to which that candidate has\nconsented, the Speaker shall notify both Houses of the joint nomination\nand, at a joint meeting of both Houses, shall ask the members whether\nany  member  has  an  objection  to  the  candidate  being  declared  duly\nelected,  if  no  member  objects  thereto,  the  Speaker  shall  declare  the\ncandidate duly elected.\n\nIf there is an objection under subsection (2) the Speaker shall not\n(3)\ndeclare the candidate duly elected but shall suspend the joint meeting.\n\nThe members of each House shall, immediately following the\n(4)\nsuspension, resume in their respective House and the presiding officer\nof each House shall put the question referred to in subsection (2) to a\nvote.\n\nImmediately  upon  announcing  the  result  of  the  vote  in  each\n(5)\nHouse, the joint sitting shall resume and the President of the Senate and\nthe Speaker shall each announce the result of the vote.\n\nIf the candidate receives not less than two-thirds of the votes cast\n(6)\nin each House, the Speaker shall then declare the candidate duly elected.\n\n\f20\n\n(7)\nIf the Prime Minister and the Leader of the Opposition do not\nwithin sixty days of a vacancy occurring in the office of President make\nto the Speaker a joint nomination in accordance with subsection (2), the\nSpeaker  shall  notify  both  Houses  accordingly,  with  a  view  to  the\nholding of an election under this section to fill the vacancy.\n\nIf the Prime Minister and the Leader of the Opposition do not act\n(8)\nin accordance with subsection (7) and the Speaker notifies both Houses\nin accordance with that subsection then,\n\n(a)\n\n(b)\n\n(c)\n\nthe Prime Minister,\n\nthe Leader of the Opposition, and\n\nany ten members of the House of Assembly, jointly,\n\nmay  each,  within  the  period  of  fourteen  days  after  receipt  by  both\nHouses of a notification under that subsection, nominate one qualified\ncandidate, being a person who has consented to be nominated.\n\nThe Speaker shall, after the expiration of the period mentioned\n(9)\nin subsection (8) and before the House proceeds to any other business,\ninform the House of the nominations referred to in that subsection and\nannounce a date for the holding of an election under this section.\n\nThe  members  of  each  House  shall  convene  in  their  respective\n(10)\nHouse for the purpose of an election occasioned by subsection (8) and\nthe members of each House shall immediately upon the announcement\nof the result of the vote resume the joint meeting of the two Houses and\nthe President of the Senate and the Speaker shall each announce the\nresult of the vote.\n\nThe Speaker shall cause adequate notice of such an election to\n(11)\nbe published in the Gazette, but the period of such notice shall not be\nmore than twenty-one days following the date of such publication.\n\nIf on the date duly fixed for an election under this section there\n(12)\nis  only  one  candidate,  the  Speaker  shall,  at  a  joint  meeting  of  both\n\n\f21\n\nHouses, if there is no objection from any of the members, declare that\ncandidate duly elected without putting the question to a vote; but if there\nis an objection subsections (2), (3), (4), (5) and (6) shall apply.\n\nThe method of voting in an election under this section is by secret\n\n(13)\nballot.\n\nWhere  there  is  a  ballot  under  this  section,  the  Speaker  shall\n(14)\ndeclare that candidate duly elected who receives the vote of not less\nthan two-thirds of the votes cast in each House.\n\nSubject to this section and to section 31, the Speaker may regulate\n(15)\nthe procedure of the joint meeting of both Houses and, in particular,\nmay postpone or adjourn the joint meeting of both Houses and take such\nother measures as he may deem necessary or expedient for\n\n(a)\n\n(b)\n\nthe conduct of an election under this section; or\n\ndealing with any difficulties that may arise in connection with\nthe conduct of such an election.\n\nFor the purposes of this section, if the Prime Minister and the\n(16)\nLeader  of  the  Opposition  each  nominate  the  same  person,  the\nnominations shall be deemed to be a joint nomination.\n\nIn  this  section,  the  expression  \"qualified\",  in  relation  to  a\n(17)\ncandidate for election as President, means one in respect of whom the\nprovisions of sections 29 and 30 are, or will be, satisfied in relation to\nthe election.\n\nActing President\n\n33.\nWhere the office of President is vacant or the President is\nincapable of performing the functions of President by reason of illness\nor absence from Barbados or is on vacation leave or for any other reason\nunable to perform the functions of the office, the Prime Minister shall,\nafter consultation with the Leader of the Opposition, appoint a person\n\n\f22\n\nwho is qualified to be elected to the office of President to act during the\nvacancy or as the case may be, during the absence of the President.\n\nTerm of office\n\n34.(1)\nunder section 32 shall assume office\n\nA  person  who  has  been  declared  duly  elected  President\n\n(a)\n\n(b)\n\nif the office is vacant at the time, on the day next after the\ndeclaration; or\n\nif there is an incumbent in office, on the day next after the\nincumbent vacates office.\n\nSubject to this section and to section 34B, the President shall hold\n(2)\noffice for a term of four years beginning on the date of the President’s\nassumption of office and is eligible for re-election.\n\nThe Prime Minister shall, at least six months before the expiry\n(3)\nof  the  term  referred  to  in  subsection  (1)  after  consultation  with  the\nLeader of the Opposition, grant the incumbent President a further term\nnot exceeding four years as may be agreed between the President and\nthe Prime Minister.\n\nIf the Prime Minister and the Leader of the Opposition fail to\n(4)\nagree on the grant of a further term to the incumbent President then, the\nprovisions of section 32 shall take effect.\n\nParliament may by resolution passed by both Houses, extend the\n(5)\nterm  of  office  of  the  President  as  prescribed  by  subsection  (2)  for  a\nperiod not exceeding six months in order to avoid the holding of an\nelection to the office of President\n\n(a)\n\n(b)\n\nduring a period when Parliament is dissolved; or\n\nat  a  time  considered  by  Parliament  to  be  too  close  to  the\nbeginning  or  the  end  of  a  period  when  Parliament  is\ndissolved.\n\n\f23\n\nConditions of office\n\n34A.(1)\nExcept in the case of a person performing the functions of\nPresident under section 33, the President shall not hold any other office\nof emolument or profit, whether in the public service or otherwise.\n\nThe  salary  and  other  allowances  paid  to  the  President  are  not\n\n(2)\nsubject to taxation.\n\nVacation of office\n\nThe office of President becomes vacant before the expiration\n34B.\nof the term of his office as fixed by section 34 if the person holding that\noffice\n\n(a)\n\n(b)\n\ndies;\n\nresigns the office by instrument in writing addressed to the\nHouse of Assembly and delivered to the Speaker; or\n\n(c)\n\nis removed from office under sections 34C and 34D.\n\nRemoval from office\n\n34C.\n\nThe President may be removed from office\n\n(a)\n\n(b)\n\n(c)\n\nif he wilfully violates any provision of the Constitution;\n\nif he behaves in a way that endangers the security of the State;\n\nfor inability to discharge the functions of his office (whether\narising from inability of body or mind or any other cause); or\n\n(d)\n\nfor misbehaviour.\n\n\f24\n\nProcedure for removal from office\n\n34D.(1)\n\nThe President shall be removed from office where\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\na motion that his removal from office should be investigated\nby a tribunal is proposed in the House of Assembly;\n\nthe motion states full particulars of the grounds on which his\nremoval from office is proposed, and is signed by not less\nthan  one-third  of  the  total  membership  of  the  House  of\nAssembly;\n\nthe motion is adopted by the votes of not less than two-thirds\nof the membership of each house;\n\na  tribunal  consisting  of  the  Chief  Justice  and  three  other\nJudges  who  have  held  high  judicial  office  in  a  court  of\nunlimited  jurisdiction  in  a  Commonwealth  country,  other\nthan Barbados, investigate the complaint and report on the\nfacts to the House of Assembly; and\n\nthe  Senate  and  the  House  of  Assembly  sitting  in  their\nrespective  House  on  the  summons  of  the  President  of  the\nSenate and the Speaker consider the report and by resolution\nsupported  by  the  votes  of  not  less  than  two-thirds  of  the\nmembership  of  each  House,  the  Senate  and  the  House  of\nAssembly in joint session declare that he shall be removed\nfrom office.\n\nWhere a motion is adopted as is provided for in subsection (1)(a),\n(2)\n(b),  and  (c)  the  President  shall  cease  to  perform  his  functions  as\nPresident  and  the  President  of  the  Senate  shall  act  temporarily  as\nPresident.\n\n(3)\n\nThe tribunal may regulate its own procedure.\n\n\f25\n\n(4)\nUpon  the  adoption  of  the  resolution  in  accordance  with\nsubsection  (1)(c)  the  office  of  President  becomes  vacant  with\nimmediate effect.\n\nOath\n\nA President shall before entering upon the duties of his office\n34E.(1)\ntake and subscribe the oath of office set out in the First Schedule, such\noath being administered by the Chief Justice or such other Judge as may\nbe designated by the Chief Justice.\n\nSubsection  (1)  shall  apply  to  any  person  required  under  this\n(2)\nConstitution to perform the functions of the office of President as it\napplies to a person elected as President.\n\nPersonal staff of President\n\n34F.(1)\n\nParliament may prescribe the offices\n\n(a)\n\n(b)\n\n(c)\n\nthat are to constitute the personal staff of the President;\n\nsalaries and allowances that are to be paid to the members of\nthe staff; and\n\nother sums that are to be paid in respect of the expenditure\nattaching to the office of President.\n\nAny salaries or other sums prescribed under subsection (1) are\n\n(2)\nhereby charged on and shall be paid out of the Consolidated Fund.\n\nSubject  to  subsections  (4),  (5)  and  (6)  power  to  make\n(3)\nappointments to the offices prescribed under subsection (1) shall be for\nsuch time as the President in his discretion determines.\n\nThe President, acting in his discretion, may appoint to any of the\n(4)\noffices prescribed under subsection (1) such public officers as he may\nselect  from  a  list  submitted  by  the  Administrative,  General  and\nProfessional Service Commission.\n\n\f26\n\n(5)\n\nAn officer referred to in subsection (4)\n\n(a)\n\n(b)\n\nshall  not,  during  his  service  on  the  personal  staff  of  the\nPresident, perform the functions of a public office; and\n\nmay  at  any  time  be  appointed  by  the  President,  if  the\nAdministrative,  General\nand  Professional  Service\nCommission  so  recommends,  to  assume  or  resume  the\nfunctions of a public office and he shall thereupon vacate his\noffice on the personal staff of the President, but the President\nmay, in his discretion, decline to release the officer for that\nappointment.\n\nAll offices prescribed under subsection (1) as offices that are to\n(6)\nconstitute the personal staff of the President shall, for the purposes of\nChapter VIII, be deemed to be public offices.\n\nExercise of President's functions\n\nThe President shall act in accordance with the advice of the\n34G.(1)\nCabinet or a Minister acting under the general authority of the Cabinet\nin the exercise of his functions other than\n\n(a)\n\nany  function  which  is  expressed,  in  whatever  terms,  to  be\nexercisable  by  him  on  or\nthe\nrecommendations or advice of, or with the concurrence of, or\nafter consultation with, any person or authority other than the\nCabinet; and\n\nin  accordance  with\n\n(b)\n\nany  function  which  is  expressed  in  whatever  terms,  to  be\nexercisable by him in his discretion.\n\nSubsection (1) does not apply to the functions conferred upon the\n(2)\nPresident by the following provisions of this Constitution, that is to say\n\n(a)\n\nsection  61(2)  (which  requires  the  President  to  dissolve\nParliament in certain circumstances);\n\n\f27\n\n(b)\n\nsection  66(2)  (which  requires  the  President  to  revoke  the\nappointment of the Prime Minister in certain circumstances);\nand\n\n(c)\n\nsection 84(4) which requires the President to remove a Judge\nfrom office in certain circumstances.\n\nWhere the President is directed to exercise any function on the\n(3)\nrecommendation  of  any  person  or  authority,  he  shall  exercise  that\nfunction in accordance with such recommendation.\n\n(4)\n\nBefore the President acts pursuant to subsection (3)\n\n(a)\n\n(b)\n\nhe  may,  in  his  discretion,  once  refer  that  recommendation\nback  for  reconsideration  by  the  person  or  authority\nconcerned; and\n\nif that person or authority, having reconsidered the original\nrecommendation under paragraph (a), substitutes a different\nrecommendation,\nthis  section  and\nthe  provisions  of\nsubsection (3) shall apply to the different recommendation as\nthey apply to the original recommendation.\n\nWhere  the  President  is  directed  to  exercise  any  function  after\n(5)\nconsultation  with  any  person  or  authority  he  shall  not  be  obliged  to\nexercise that function in accordance with the advice of that person or\nauthority.\n\nWhere  the  President  is  directed  to  exercise  any  function  in\n(6)\naccordance  with  the  recommendation  or  advice  of,  or  with  the\nconcurrence of, or after consultation with, any person or authority, the\nquestion whether he has so exercised that function shall not be enquired\ninto in any court.\n\n\f28\n\n(7)\nWhere the President is directed to exercise any function on the\nrecommendations  of  the  Prime  Minister  after  consultation  with  the\nLeader of the Opposition, the following steps shall be taken\n\n(a)\n\n(b)\n\n(c)\n\nthe  Prime  Minister  shall  first  consult  the  Leader  of  the\nOpposition and thereafter tender his recommendation to the\nPresident;\n\nthe President shall then inform the Leader of the Opposition\nof that recommendation and if the Leader of the Opposition\nconcurs therein the President shall act in accordance with the\nrecommendation;\n\nif  the  Leader  of  the  Opposition  does  not  concur  in  the\nrecommendation  the  President  shall  so  inform  the  Prime\nMinister  and  refer  the  recommendation  back  to  the  Prime\nMinister;\n\n(d)\n\nthe  Prime  Minister  shall  then  advise  the  President  and  the\nPresident shall act in accordance with that advice.\n\nAny  reference  in  this  Constitution  to  the  functions  of  the\n(8)\nPresident shall be construed as a reference to his powers and duties in\nthe exercise of the executive authority of Barbados and to any other\npowers and duties conferred or imposed on him as President by or under\nthis Constitution or any other law.\n\nImmunities of President\n\n34H.(1)\nSubject to section 34D, the President shall not be answerable\nto any court for the performance of the functions of his office or for any\nact done by him in the performance of those functions.\n\n(2)\n\nWhile a person holds office or is acting as President,\n\n(a)\n\ncriminal  proceedings  shall  not  be  instituted  or  continued\nagainst him in respect of anything done or omitted to be done\nby him, whether in his official or his private capacity; and\n\n\f29\n\n(b)\n\ncivil proceedings in which relief is claimed against him in\nrespect of anything done or omitted to be done by him in his\nprivate capacity shall not be instituted or continued against\nhim.\n\nWhere provision is made by law limiting the time within which\n(3)\nproceedings of any description may be brought against a person, the\nperiod during which that person held office or acted as President shall\nnot be taken into account in calculating the time limited by that law\nwithin which any such proceedings may be brought against him.”.\n\nRepeal and replacement of section 35 of the Constitution\n\n22.\nsubstituted:\n\nSection  35  of  the  Constitution  is  deleted  and  the  following  is\n\n“Establishment of Parliament\n\n35.\nof the President, a Senate and a House of Assembly.”.\n\nThere shall be a Parliament of Barbados which shall consist\n\nAmendment of section 41 of the Constitution\n\n23.\nsubstituted:\n\nSection  41(1)  of  the  Constitution  is  deleted  and  the  following  is\n\nThe House of Assembly shall consist of thirty members or such\n\n“(1)\ngreater number of members as Parliament may prescribe.”.\n\n\f30\n\nAmendment of section 44 of the Constitution\n\n24.\nSection 44(1)(i) of the Constitution is amended by deleting the words\n“1957,  in  force  in  Barbados  immediately  before  30th  November  1966”  and\nsubstituting the words  “Cap. 12”.\n\nAmendment of section 49 of the Constitution\n\n25.\nsubstituting the words “34G”.\n\nSection  49(2)(d)  is  amended  by  deleting  the  words  “32”  and\n\nAmendment of section 58 of the Constitution\n\n26.\nand substituting the following:\n\nSection 58 of the Constitution is amended by deleting subsection (1)\n\nA  Bill  shall  not  become  law  until  the  President  has  assented\n\n“(1)\nthereto and has signed it in token of such assent.”.\n\nRepeal and replacement of section 63 of the Constitution\n\n27.\nsubstituted:\n\nSection  63  of  the  Constitution  is  deleted  and  the  following  is\n\n“Executive authority of Barbados\n\n63.(1)\nPresident.\n\nThe  executive  authority  of  Barbados  is  vested  in  the\n\n(2)\nSubject  to  the  provisions  of  this  Constitution,  the  executive\nauthority of Barbados may be exercised by the President either directly\nor through officers subordinate to him.\n\nNothing in this section shall prevent Parliament from conferring\n\n(3)\nfunctions on persons or authorities other than the President.”.\n\n\f31\n\nAmendment of section 78 of the Constitution\n\n28.\nwords and substituting the following:\n\nSection 78 of the Constitution is amended by deleting the opening\n\n“The President may”.\n\nAmendment of section 117 of the Constitution\n\n29.\n\nSection 117 of the Constitution is amended\n\n(a)\n\nin subsection (1),\n\n(i)\n\nby deleting the definition of “Police Force” and substituting the\nfollowing:\n\n“ “Police Service” means the Barbados Police Service established under\n\nthe Police Act, Cap. 167;”; and\n\n(ii)\n\nby deleting the definition of “the public service” and substituting\nthe following:\n\n“ “the public service” means subject to the provisions of subsection (7),\n\nthe service of the State in a civil capacity;”;\n\n(b)\n\nby deleting paragraphs (a) and (b) of subsection (7) and substituting\nthe following:\n\n“(a)\n\nthe  office  of  President,  Prime  Minister,  or  other  Minister,\nParliamentary Secretary, Leader of the Opposition, President\nof  the  Senate,  Deputy  President  of  the  Senate,  or  other\nmember  of  the  Senate,  Speaker,  Deputy  Speaker,  or  other\nmember of the House of Assembly or member of the Privy\nCouncil;\n\n\f32\n\n(b)\n\nthe  office  of  a  member  of  the  Judicial  and  Legal  Service\nCommission,  the  Administrative  General  and  Professional\nService Commission, the Teaching Service Commission or\nthe Protective Services Commission;”; and\n\n(c)\n\nby deleting subsection (11) and substituting the following:\n\n“(11)\nThe  Interpretation  Act,  Cap.  1  shall  apply,  with  the  necessary\nadaptations,  for  the  purpose  of  interpreting  this  Constitution  and\notherwise in relation thereto as it applies for the purpose of interpreting,\nand in relation to an Act of Parliament passed after the commencement\nof the aforesaid Act.”.\n\nAmendment of the Constitution\n\n30.\n\nThe Constitution is amended by deleting\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe  word  “Crown”  wherever  it  appears  and  substituting  the\nword “State”;\n\nthe word “Governor-General” wherever it appears and substituting\nthe word  “President”;\n\nthe words “Her Majesty” wherever they appear and substituting the\nwords  “the State”;\n\nthe words “Police Force” wherever they appear and substituting the\nwords “Police Service”; and\n\nthe First, Second and Third Schedules and substituting the  First,\nSecond and Third Schedules  set out in the First, Second and Third\nSchedules to this Act.\n\n\f33\n\nL.R.O. 1998FIRST SCHEDULE(Section 30(e))\"FIRST SCHEDULE(Sections 34E, 69, 79(7), 83 and 117(1))OATHSOaths of Allegiance I,                                                    , do swear (solemnly aﬃ  rm) that I will be faithful and bear true allegiance to Barbados, according to law. (So help me God. (to be omitted in aﬃ  rmation))Oath for the due execution of the Oﬃ  ce of President I,                                              , do swear (solemnly affi  rm) that I will well and trulyserve Barbados in the offi  ce of President. (So help me God. (to be omitted in affi  rmation))Oath for the due execution of the offi  ce of Prime Ministeror other Minister or Parliamentary Secretary I,                                                       , do swear (solemnly affi  rm) that I will be faithful and loyalto Barbados and I will uphold the Constitution and the law. And I further swear (solemnly affi  rm) that I will conscientiously, impartially and to thebest of my ability discharge my duties as Prime Minister/Minister/Parliamentary Secretary.(So help me God. (to be omitted in affi  rmation))Judicial Oath I,                                      , do swear (solemnly affi  rm) that I will well and truly serve Barbados in the offi  ce of Chief Justice/Justice of Appeal/Judge of the High Court and I will do right to all manner of people aft er the laws and usages of Barbados withoutfear or favour, aff ection or ill will. (So help me God. (to be omitted in affi  rmation)\f34\n\n L.R.O. 1998Oath for the due execution of the Offi  ce of Director of Public Prosecutions I,                                                      , do swear (solemnly affi  rm) that I will well and truly serve Barbados in the off ice of Director of Public Prosecutions. (So help me God. (to beomitted in aﬃ  rmation))Judicial Oath for Judges of the Caribbean Court of Justice I,                                                      , do swear (solemnly aﬃ  rm) that I will faithfully exercisethe oﬃ  ce of the President/Judge of the Caribbean Court of Justice without fear or favour,aﬀ ection or ill will and in accordance with the Code of Judicial Conduct. (So help me God.(to be omitted in aﬃ  rmation)).\"First Schedule - (Concl'd)\f35\n\nSECOND SCHEDULE\n\n(Section 30(e))\n\n“SECOND SCHEDULE\n\n(Sections 84(6) and 105(5))\n\nPROVISIONS RELATING TO CERTAIN TRIBUNALS\n\nIf a member of the tribunal dies or resigns or becomes unable\n1.\nto continue to act as a member, another person qualified to be appointed\nas a member of the tribunal may be appointed in his place.\n\n2.\nThe  President  may  appoint  a  secretary  to  the  tribunal  to\nrecord the proceedings of the tribunal, and generally to perform such\nduties connected with the enquiry as the tribunal may direct.\n\nIf the members of the tribunal are equally divided on any\n3.\nquestion that arises during the proceeding of the tribunal, the chairman\nof the tribunal has and shall exercise a casting vote.\n\n4.\nrules for that purpose.\n\nThe tribunal may regulate its own procedure and may make\n\n5.\nanything done by that member as a member of the tribunal.\n\nNo member of the tribunal is liable to any action or suit for\n\n6.\nThe  tribunal  has  the  powers  of  the  Supreme  Court  to\nsummon  witnesses,  to  call  for  the  production  of  documents  and  to\nexamine persons appearing before it on oath. All summonses for the\nattendance of witnesses or the production of documents shall be signed\nby one of the members of the tribunal, and oaths may be administered\nby one of the members or by the secretary to the tribunal.\n\n\f36\n\n7.(1)\nEvery  person  served  with  a  summons  to  attend  and  give\nevidence or to produce documents at any sitting of the tribunal is bound\nto obey the summons as fully in all respects as witnesses are bound to\nobey subpoenas issued from the Supreme Court, and is entitled to the\nlike expenses (if those expenses are allowed by the tribunal) as if that\nperson had been summoned at the instance of the State to attend the\nSupreme Court on a criminal trial; but the tribunal may disallow the\nwhole  or  any  part  of  such  expenses  in  any  case  if  it  thinks  fit.  The\nprocedure for the payment of such a witness is the same as nearly as\nmay be as it is for the payment of witnesses in the Supreme Court.\n\nThe following are liable to a penalty not exceeding five hundred\n\n(2)\ndollars recoverable summarily before a magistrate:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nevery  person  who,  having  been  so  summoned,  without\nsufficient  cause  refuses  or  omits  to  attend  at  the  time  and\nplace mentioned in the summons;\n\nevery  person  who,  having  been  so  summoned,  without\nsufficient cause refuses or omits to answer, or to answer fully\nand satisfactorily to the best of his knowledge and belief, all\nquestions  put  to  him  by  or  with  the  concurrence  of  the\ntribunal;\n\nevery  person  who,  having  been  so  summoned,  without\nsufficient cause refuses or omits to produce any documents\nin his possession or under his control and mentioned in the\nsummons;\n\nevery person who at any sitting of the tribunal wilfully insults\nany  member,  or  the  secretary,  of  the  tribunal,  or  wilfully\ninterrupts the tribunal's proceedings; and\n\nevery  person  who,  having  been  summoned  to  attend  the\ntribunal, attends but leaves the enquiry without the tribunal's\npermission.\n\n\f37\n\n(3)\nA  person  giving  evidence  before  the  tribunal  shall  not  be\ncompellable to criminate himself; and every such person, in respect of\nany evidence that he gives before the tribunal, shall be entitled to all\nthe privileges to which a witness giving evidence before the Supreme\nCourt is entitled in respect of evidence given by such a witness before\nthat Court.\n\n8.\nThe person to whom the enquiry relates shall be entitled to\nbe represented at the enquiry by a person entitled to practise in Barbados\nas an attorney-at-law; and any other person concerned in the enquiry\nmay, by leave of the tribunal, also be so represented.\n\nThe  President  may  direct  the  Commissioner  of  Police  to\n9.\ndetail constables to attend upon the tribunal to preserve order during\nthe proceedings of the tribunal, and to serve summonses on witnesses,\nand to perform such ministerial duties as the tribunal may direct.\n\n10.(1)\n\nThe President may direct\n\n(a)\n\n(b)\n\nwhat remuneration, if any, shall be paid to the members of\nthe  tribunal  and  to  the  secretary  and  to  any  other  persons\nemployed in connection with the proceedings of the tribunal;\nand\n\npayment of any other expenses attendant upon the carrying\nout of the enquiry or upon any proceedings for any penalty\nunder this Schedule.\n\nAny sums directed to be paid under subparagraph (1) are hereby\n\n(2)\ncharged on the Consolidated Fund.\n\n11.\nNo proceeding shall be commenced for any penalty under\nthis  Schedule  except  by  the  direction  of  the  Director  of  Public\nProsecutions or of the tribunal, which may direct its secretary, or such\n\n\f38\n\nother person as it may think fit, to commence and prosecute any such\nproceeding.”.\n\n\f39\n\nTHIRD SCHEDULE\n\n“THIRD SCHEDULE\n\nConstituency Boundaries\n\n(Section 30(e))\n\n(Section 41D(1))\n\n1.\nThe  number  of  persons  entitled  to  vote  in  any  one\nconstituency  shall,  so  far  as  practicable,  be  equal  to  the  number  so\nentitled in any other constituency.\n\n2.\nThe  number  of  persons  entitled  to  vote  in  any  one\nconstituency shall, so far as practicable, be not more than 110 per cent,\nnor less than 90 per cent, of the total number of persons entitled to vote\nin Barbados, divided by the total number of the constituencies.\n\n3.\nas far as possible.”.\n\nNatural boundaries such as highways and rivers shall be used\n\n\f40\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2021.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2021.\n\nPresident\n\n"
}