{
  "bill_id": 583,
  "slug": "resolution-re-compulsory-acquisition-of-land-at-workmans-st-george",
  "title": "Resolution re Compulsory Acquisition of land at Workmans, St. George",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/0074f44e2852ef4b6e4101a2e59ebcc3.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-10-06",
  "first_reading": "2021-12-08",
  "gazette_date": null,
  "markdown": "2021-08-25\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the  Land\n\nAcquisition Act, Cap. 228 approve the compulsory acquisition by the Crown of the parcel of  land\n\nsituate at Workman's in the parish of Saint George in this Island, more particularly described in\n\nthe Schedule, for the purpose of constructing recreational facilities for public use.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and twenty-one.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                            day  of                                                    ,\n\nTwo thousand and twenty-one.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  the  property  of  Nathaniel  Gill  situate  at  Workman's  in  the\n\nparish  of  Saint  George  in  this  Island  containing  by  admeasurement  1992.9  square  metres  or\n\nthereabouts, abutting and bounding on lands now or formerly of the Christian Mission Church,\n\non lands now or late of James Hoyte, on lands now or late of Randall Hewitt, on lands now or\n\nformerly of the Barbados Government and on a public road leading to Free Hill in one direction\n\nand to Taitt Hill in the other direction or however else the same may abut and bound as delineated\n\nand shown on a plan certiﬁ ed on the 26th day of October, 2018 by Anderson R. Alleyne, Land\n\nSurveyor and recorded in the Lands and Surveys Department on the 1st day of November, 2018\n\nas Plan No. 1319/2018.\n\n\f3\n\nADDENDUM\n\n  The Cabinet at its meeting held on the 7th day of January, 2021 considered Note (21)\n\n07/MHLM  01  and  agreed  to  the  acquisition  of  1,992.9  square  metres  (0.5  acres)  of  land  at\n\nWorkman's in the parish of Saint George, the property of Mr. Nathaniel Gill (c/o Fitz A. Bryan)\n\nand more particularly described in the Schedule for the purpose of constructing recreational\n\nfacilities for public use.\n\n    In accordance with section 5 of the Land Acquisition Act, Cap.228, the approval of\n\nParliament is now sought for the compulsory acquisition of the parcel of land described in the\n\nSchedule in order that the public purpose set out in this Resolution may be eﬀ ected and that the\n\nCrown may acquire an indefeasible title to the said parcel of land.\n\n"
}