{
  "bill_id": 584,
  "slug": "constitution-amendment-no-3-bill-2021",
  "title": "Constitution (Amendment) (No. 3 )  Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b0c8de61c8bcb06907efe1d782b17400.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-12-15",
  "first_reading": "2021-12-20",
  "gazette_date": "2021-09-23",
  "markdown": "2021-09-14\n\nOBJECTS AND REASONS\n\nThis  Bill  would  alter  the  Constitution  to  empower  the  Director  of  Public\nProsecutions  to  enter  into  agreements  with  prescribed  persons  in  prescribed\ncircumstances in lieu of instituting and undertaking criminal proceedings against\nsuch persons.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\nShort title\n\nAmendment of section 79 of the Constitution\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to alter the Constitution of Barbados.\n\nENACTED by the Parliament of Barbados in accordance with the provisions\n\nof section 49 of the Constitution as follows:\n\n\f4\n\nShort title\n\n1.\n2021.\n\nThis Act may be cited as the Constitution (Amendment) (No. ) Act,\n\nAmendment of section 79 of the Constitution\n\n2.\n\nSection 79 of the Constitution is amended\n\n(a)\n\nin subsection (2),\n\n(i)\n\n(ii)\n\nin paragraph (b), by deleting the word “and” appearing at the\nend of the paragraph;\n\nin paragraph (c), by deleting the full-stop appearing at the end\nof the paragraph and substituting the words “; and”; and\n\n(iii)\n\nby inserting after paragraph (c), the following:\n\n“(d)\n\nto enter into an agreement, in such circumstances and on such\nterms and conditions as may be prescribed by or under any\nlaw,  with  such  person  as  may  be  so  prescribed,  in  lieu  of\ninstituting  and  undertaking  any  such  criminal  proceedings\nagainst the person, provided that the High Court considers\nthe agreement to be in the interest of justice.”; and\n\n(b)\n\nin subsection (3), by deleting the words “(b) and (c)” and substituting\nthe words “(b), (c) and (d)”.\n\n\f5\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2021.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2021.\n\nPresident\n\n"
}