{
  "bill_id": 587,
  "slug": "debt-settlement-arrears-bill-2021",
  "title": "Debt Settlement (Arrears) Bill,  2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/791109ac0473b51a1790296dcac36db1.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-11-03",
  "first_reading": "2021-11-24",
  "gazette_date": "2021-10-18",
  "markdown": "2021-12-13\n\nOBJECTS AND REASONS\n\nThis Bill would enable the Government of Barbados to settle its obligations\ndue to certain persons and make provision for the creation and issuance of Series\nJ Bonds to those persons.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\nShort title\n\nInterpretation\n\nPurpose\n\nCreation of Series J Bonds\n\nIssuance of Series J Bonds\n\nPrepayment of principal\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to enable the Government of Barbados to settle its obligations due\nto certain persons and make provision for the creation and issuance of Series\nJ Bonds to those persons.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n\nThis Act may be cited as the Debt Settlement (Arrears) Act, 2021.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Natural Disaster Clause” has the meaning assigned to it in the Schedule;\n\n“Series  J  Bonds”  means  the  bonds  described  in  the  Schedule  issued  by  the\n\nGovernment.\n\nPurpose\n\n3.\nSeries J Bonds in settlement of\n\nThe purpose of this Act is to provide for the creation and issuance of\n\n(a)\n\n(b)\n\n(c)\n\n# obligations of the Government to persons whose lands were acquired\nunder the Land Acquisition Act, Cap. 228;\n\n# obligations of the Government to persons in respect of causes or legal\nclaims instituted against the Government;\n\nBarbados  denominated  arrears\nGovernment; and\n\nincurred  or  assumed  by\n\n# the\n\n(d)\n\n# outstanding liabilities of the Government subject to section 5(2).\n\nCreation of Series J Bonds\n\n4.\nconditions set out in the Schedule.\n\nThe  Government  shall  create  Series  J  Bonds  on  the  terms  and\n\n\f5\n\nIssuance of Series J Bonds\n\n5.(1)\n\nThe bonds created under section 4 shall be issued\n\n(a)\n\n# to  a  person  whose  land  was  acquired  by  the  Government  under  the Land Acquisition Act, Cap. 228 and no compensation has been paid or\nfully satisfied in respect of the compulsory acquisition of the land;\n\n(b)\n\n# to  a  person  whose  cause  or  legal  claim  instituted  against  the\nGovernment has not been satisfied; and\n\n(c)\n\n# in  respect  of  any  outstanding  liabilities  of  the  Government.\n\n(2)\nFor the avoidance of doubt, paragraph (1)(c) does not apply to salaries,\npensions, gratuities or any other emolument payable to public officers or any\nperson employed by the Government.\n\nPrepayment of principal\n\n6.\nto the instrument holder, prepay\n\nThe Government may, with not less than 15 days prior written notice\n\n(a)\n\n(b)\n\npart of; or\n\nall of,\n\nany  unpaid  principal  and  unpaid  accrued  interest  up  to  the  date  of  such\nprepayment on the bonds.\n\n\f6\n\n L.R.O. 1998SCHEDULE(Sections 2 and 4)Series J BondsMaturity:Interest Rate:Principal Repayment:Natural Disaster Clause:42 months from the date of issuanceNonePrincipal will be repaid in 42 equal monthly instalmentsYes\f7\n\n L.R.O. 1998Natural Disaster Clause(a) Th is natural disaster clause applies following the occurrence of any Caribbean Earthquake Event, Caribbean Tropical Cyclone Event or Covered Area Rainfall Event covered in the Caribbean Catastrophe Risk Insurance Facility (CCRIF) Policy, in respect of which a Policy Payment has been made to Barbados, and subject to paragraph (d) below, Barbados may elect to defer payment of the Deferred Payment Amount on a Deferral Date. Any such Deferred Payment Amount shall remain outstanding and shall continue to accrue interest in accordance with paragraph (c) below.(b) Beginning with the next Payment Date following a Deferral Date, each remaining principal amortization of the Aﬀ ected Series will be increased by an amount equal to a pro rata portion of principal that is being deferred on the Deferral Date, taking into account the  number of remaining principal amortization payments of that Aﬀ ected Series.(c) The portion of a Deferred Payment Amount that is comprised of interest will be capitalized and added to principal as each such interest payment falls due under the terms of the Aﬀ ected Series after the relevant Deferral Date. As such interest is converted into principal, the principal amount of the Aﬀ ected Series shall be increased in the amount  of such deferred interest.(d) Barbados shall be entitled to defer the Deferred Payment Amount following the occurrence of an Event only if all of the following conditions are satisfi ed:(i) the CCRIF Policy is in full force and eﬀ ect and CCRIF has issued a written report  confi rming that the Event is an Insured Event in respect of which a Policy Payment has been made to Barbados;(ii) since the 22nd day of April, 2021, neither of the Coverage Limit or the Exhaustion Point applicable to earthquakes, tropical cyclone or excess rainfall has been reduced, unless it has been reduced by CCRIF and CCRIF has declined a request submitted by Barbados to CCRIF to maintain such Coverage Limit or Exhaustion Point, as the case may be; andSchedule - (Cont'd)\f8\n\n L.R.O. 1998Natural Disaster Clause - (Cont'd)(iii)the Modelled Loss (as defi ned below), in the case of a Caribbean Earthquake Event orCaribbean Tropical Cyclone Event, or the Rainfall Index Loss, in the case of a CoveredArea Rainfall Event, to Barbados from the Event is greater than U.S.$5 million.Upon electing to defer the Deferred Payment Amount, Barbados shall at its ownexpense provide notice thereof (a \"Deferral Claim\") to the Holders as provided in the Notices provision of the relevant Aﬀ ected Series, describing in reasonable detail theparticulars of the Event giving rise to the right to make such Deferral Claim. Barbados shallbe entitled to make no more than three Deferral Claims under each Aﬀ ected Series.(e)For purposes of this clause,\"Caribbean Earthquake Event\", \"Caribbean Tropical Cyclone Event\", \"Covered Area Rainfall Event\", \"Coverage Limit\", \"Exhaustion Point\", \"Insured Event\", \"Policy Payment\" and \"Rainfall Index Loss\" have the meanings given to those terms in the CCRIF Policy;\"CCRIF\" means CCRIF SPC (formerly, the Caribbean Catastrophe Risk InsuranceFacility), or any successor thereof, with whom the Government of Barbados has entered into the CCRIF Policy;\"CCRIF Policy\" means the Parametric Insurance Contract dated 1st June, 2020 whichthe Government of Barbados has entered into with CCRIF to insure against risks of earthquake, tropical cyclone and excess rainfall, including any documents incorporated by reference therein and any attachments, annexes, appendices or supplements thereto (including but not limited to the applicable coverage summary and associated loss curve data spreadsheet), as such CCRIF Policy may be amended or supplemented from time to time;Schedule - (Cont'd)\"Aﬀected Series\" means  any  series  of  Government  of  Barbados  BBD-denominateddebt securities that incorporates by reference this Natural Disaster Clause;\f9\n\nL.R.O. 1998Natural Disaster Clause - (Concl'd)\"Deferral Claim\", in respect of an Event, has the meaning given to that term inparagraph (d) of this clause;\"Deferral Date\" means the Payment Date under the relevant series next followingsubmission of a Deferral Claim;\"Deferred Payment Amount\" means all principal amortizations and interest paymentsfalling due on an Aﬀected Series for the consecutive two-year period immediately following the Deferral Date;\"Modelled Loss\" has the meaning given to that term in the CCRIF Policy, provided Schedule - (Concl'd)calculated under the CCRIF Policy as in eﬀect on the Closing Date, using the  relevant Return Period (years) applicable to the Event. When calculating the Reference Modelled Loss, the Return Period (years) applicable to the Event, if not divisible by 5, shall be rounded down to the nearest number that is divisible by 5;that if the Modelled Loss from an Event is more than 10.0% higher than the  Reference Modelled Loss, \"Modelled Loss\" for purposes of subclause (d)(iii) and the deﬁnition of \"Deferral Date\" in this clause will be the Reference Modelled Loss;\"Payment Date\", for any Aﬀected Series, means the dates specified for the payments ofinterest and/or principal thereunder;\"Reference Modelled Loss\" means the Modelled Loss in respect of an Event, \"Return Period\", in relation to years, means the return period applicable to the Event as that term is used in the model and formulae detailed in the CCRIF Policy.\f10\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2021.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2021.\n\nPresident\n\n"
}