{
  "bill_id": 588,
  "slug": "barbados-national-honours-and-decorations-bill-2021",
  "title": "Barbados National Honours and  Decorations Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3aa998d06e316acbd10abfec7c9d2099.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-10-26",
  "first_reading": "2021-10-27",
  "gazette_date": null,
  "markdown": "2021-10-26\n\nBill as amended\n\nOBJECTS AND REASONS\n\nThis Bill makes provision for the conferment of honours and decorations on\n\npersons who are deserving of recognition by virtue of their\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nextraordinary  service  to  Barbados,  the  Caribbean,  the  Caribbean\nDiaspora or to humanity at large;\n\nmeritorious service or achievement in Barbados or a community within\nBarbados;\n\nmeritorious service or achievement in science, the arts, literature, sport,\ncivic duties or any other endeavour worthy of national recognition;\n\nmeritorious work in the public service, fire, military, police, prison or\nother protective services or in any other similar field of endeavour;\n\n(e)\n\nmeritorious humanitarian service to Barbados;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\nhumanitarian,  social,  religious  or  educational  contribution  to  the\ndevelopment of each parish in Barbados;\n\nacts of conspicuous courage in circumstances of extreme peril;\n\nacts of bravery in hazardous circumstances; or\n\nattainment of a leadership position in a school, in respect of students.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nPurpose\n\nPART II\n\nNATIONAL HONOURS AND DECORATIONS\n\nEstablishment of honours and decorations\n\nChancellor\n\nDuties of Secretary\n\nAdvisory Council\n\nSeal for specified honours and decorations\n\nEligibility for specified honours and decorations\n\n10.\n\nNominations for appointment\n\n11.\n\nTime of appointment\n\n\f3\n\n12.\n\nPublication\n\n13.\n\nCancellation of honours and decorations in form of medals\n\n14.\n\nTermination of membership\n\n15.\n\nResignation from the Order\n\n16.\n\nOrder of Freedom of Barbados\n\n17.\n\nGold Award of Achievement\n\n18.\n\nBarbados Humanitarian Service Award\n\n19.\n\nThe Pride of Barbados Award\n\n20.\n\nInsignia\n\n21.\n\nHonours conferred on groups\n\nPART III\n\nIMPERIAL HONOURS AND IMPERIAL DECORATIONS\n\n22.\n\nLetters Patent\n\n23.\n\nRecognition of Imperial Awards\n\nPART IV\n\nMISCELLANEOUS\n\n24.\n\nRegulations\n\n25.\n\nAmendment of Schedules\n\n\f4\n\n26.\n\nAmendment of Order of Freedom of Barbados Act, 2019 (Act 2019-32)\n\n27.\n\nCommencement\n\nFIRST SCHEDULE\n\nOrder of the Republic\n\nSECOND SCHEDULE\n\nTrident of Excellence\n\nTHIRD SCHEDULE\n\nBarbados Service Award\n\nFOURTH SCHEDULE\n\nBarbados Services Medal of Honour\n\nFIFTH SCHEDULE\n\nBarbados Bravery Decorations\n\nSIXTH SCHEDULE\n\nPrime Minister’s Award for Leadership\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to make provision for the conferment of honours and decorations\non persons who are deserving of recognition by virtue of their extraordinary\nand meritorious service to Barbados in various fields of endeavour or acts of\nbravery and for related purposes.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\nDecorations Bill, 2021.\n\nThis  Act  may  be  cited  as  the  Barbados  National  Honours  and\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Advisory  Council”  means  the  National  Honours  and  Decorations  Advisory\n\nCouncil established under section 7;\n\n“imperial award”  means the Knight Grand Cross of the Order of St. Michael and\nSt. George, Dame Grand Cross of the Order of St. Michael and St. George,\nCommander of the Order of the British Empire, Officer of the Order of the\nBritish Empire and Member of the Order of the British Empire;\n\n“Letters Patent” means the Letters Patent Establishing the Order of Barbados,\nLetters  Patent  Instituting  the  Barbados  Services  Medal  of  Honour,  and\nLetters  Patent  Instituting  Barbados  Bravery  Decorations  given  under  the\nPublic Seal of Barbados at Bridgetown on the 25th day of July, 1980;\n\n“Order” means the Order of Barbados constituted under  section 4.\n\nPurpose\n\n3.\nconferred after Barbados becomes a republic.\n\nThis  Act  provides  for  the  national  honours  and  decorations  to  be\n\n\f7\n\nPART II\n\nNATIONAL HONOURS AND DECORATIONS\n\nEstablishment of honours and decorations\n\nThere  shall  be  a  national  Order  of  honours  and  decorations  for\n4.(1)\nBarbados to be known as the “Order of Barbados” which shall consist of the\nfollowing:\n\n(a)\n\n(b)\n\n(c)\n\nOrder of Freedom of Barbados;\n\nOrder of the Republic;\n\nGold Award of Achievement;\n\n(d)\n\nTrident of Excellence;\n\n(e)\n\nBarbados Service Award;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\nBarbados Services Medal of Honour;\n\nBarbados Humanitarian Service Award;\n\nThe Pride of Barbados;\n\nPrime Minister’s Award for Leadership.\n\nThe Order shall comprise persons on whom honours or decorations have\n\n(2)\nbeen conferred pursuant to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe Order of Freedom of Barbados Act, 2019 (Act 2019-32);\n\nthe Gold Award of Achievement Act, Cap. 401;\n\nthe Award of Pride of Barbados Act, 2019 (Act 2019-52);\n\nthe Barbados Humanitarian Service Award Act, 2020 (Act 2020-33);\nand\n\n(e)\n\nsection 8 of this Act.\n\n\f8\n\nChancellor\n\n5.(1)\nresponsible for the administration of the following:\n\nThe  President  shall  be  the  Chancellor  of  the  Order  and  shall  be\n\n(a)\n\n(b)\n\n(c)\n\nOrder of the Republic;\n\nTrident of Excellence;\n\nBarbados Service Award;\n\n(d)\n\nBarbados Services Medal of Honour;\n\n(e)\n\nBarbados Bravery Decorations;\n\n(f)\n\nThe Prime Minister’s Award for Leadership.\n\nIn the absence of the President, the person for the time being performing\n(2)\nthe functions of the office of the President shall discharge the functions of the\nChancellor of the Order.\n\n(3)\n\nThe Chancellor,\n\n(a)\n\n(b)\n\nshall appoint the Secretary to the Cabinet to be the Secretary of the\nOrder; and\n\nmay appoint such other officials to assist in the administration of the\nOrder as he considers necessary.\n\nA person is not a member of the Order by reason of the fact only that he is\n\n(4)\nan official of the Order.\n\nDuties of Secretary\n\n6.(1)\n\nThe Secretary of the Order shall\n\n(a)\n\n(b)\n\n(c)\n\nmaintain the records of the Order;\n\nmaintain a register of all conferred honours and decorations;\n\nmaintain the records of the Advisory Council;\n\n\f(d)\n\narrange investitures; and\n\n9\n\n(e)\n\nperform such other functions in respect of the Order as the Chancellor\nmay from time to time direct.\n\n(2)\n\nThe Secretary of the Order shall be the Secretary of the Advisory Council.\n\nAdvisory Council\n\n7.(1)\nto be known as the “Advisory Council” which shall consist of\n\nThere shall be a National Honours and Decorations Advisory Council,\n\n(a)\n\n(b)\n\n(c)\n\na Chairman, who shall be a Minister nominated by the Prime Minister;\n\nthe Head of the Public Service; and\n\n3 other persons appointed by the Prime Minister, one of whom shall\nbe appointed upon the advice of the Leader of the Opposition.\n\nA  member  of  the  Advisory  Council  shall  hold  office  for  a  period  not\n(2)\nexceeding 3 years from the date of appointment and is eligible for reappointment.\n\nA vacancy in the membership of the Advisory Council shall not preclude\n\n(3)\nthe carrying out of its functions.\n\n(4)\n\nThe Advisory Council shall\n\n(a)\n\nconsider nominations of persons\n\n(i)\n\nfor appointment to the Order of the Republic;\n\n(ii)\n\nto receive the Trident of Excellence;\n\n(iii)\n\nto receive the  Barbados Service Award;\n\n(iv)\n\nto receive the Barbados Services Medal of Honour;\n\n(v)\n\nto receive the Barbados Bravery Decorations;\n\n(vi)\n\nto receive the Prime Minister’s Award for Leadership;\n\n(b)\n\nmake  recommendations  to  the  Prime  Minister  in  relation  to  those\nnominations; and\n\n\f10\n\n(c)\n\nadvise the President on matters concerning the Order as the President\nmay refer for consideration.\n\nSeal for specified honours and decorations\n\n8.(1)\nhonours and decorations:\n\nThe  Order  shall  have  an  official  Seal  in  respect  of  the  following\n\n(a)\n\n(b)\n\n(c)\n\nOrder of the Republic;\n\nTrident of Excellence;\n\nBarbados Service Award;\n\n(d)\n\nBarbados Services Medal of Honour;\n\n(e)\n\nBarbados Bravery Decorations;\n\n(f)\n\nPrime Minister’s Award for Leadership.\n\n(2)\n\nThe Chancellor shall have the custody of the Seal.\n\nEligibility for specified honours and decorations\n\n9.(1)\n\nA person who\n\n(a)\n\n(b)\n\n(c)\n\nwas born in Barbados;\n\nis a citizen of Barbados; or\n\nis entitled to be registered as a citizen of Barbados,\n\nis eligible to be appointed as a member of the Order.\n\nA person other than a citizen of Barbados is eligible to be appointed as an\n\n(2)\nhonourary member of the Order.\n\n(3)\n\nThe criteria for eligibility for the\n\n(a)\n\n(b)\n\n(c)\n\nOrder of the Republic is set out in the First Schedule;\n\nTrident of Excellence is set out in the Second Schedule;\n\nBarbados Service Award is set out in the Third Schedule;\n\n\f11\n\n(d)\n\nBarbados Services Medal of Honour is set out in the Fourth Schedule;\n\n(e)\n\nBarbados Bravery Decorations is set out in the Fifth Schedule;\n\n(f)\n\nPrime  Minister’s  Award  for  Leadership  is  set  out  in  the  Sixth\nSchedule.\n\nNotwithstanding  subsection  (2),  a  person  may  be  conferred  a  Barbados\n(4)\nBravery  Decoration  where  the  person,  not  being  a  citizen  of  Barbados,  has\nperformed an act\n\n(a)\n\n(b)\n\nin Barbados for which the decoration may be conferred under this Act;\nor\n\noutside of Barbados for which the decoration may be conferred under\nthis Act, being an act that merits recognition as an act in the interest of\nBarbados.\n\nNominations for appointment\n\n10.\nAdvisory Council a nomination of\n\nAny  person  may  submit  to  the  Secretary  for  consideration  of  the\n\n(a)\n\n(b)\n\na citizen of Barbados for appointment to the Order; or\n\na  person  other  than  a  citizen  of  Barbados  for  appointment  as  an\nhonourary member to the Order.\n\nTime of appointment\n\n11.(1)\n\nAn appointment to the Order shall be made\n\n(a)\n\n(b)\n\nonce a year, on the 30th day of November; or\n\non such other date as is prescribed by the Chancellor by order.\n\nAn  honourary  appointment  to  the  Order  may  be  made  at  any  time  in  a\n\n(2)\nyear.\n\n\f12\n\nPublication\n\nThe  names  of  those  persons  on  whom  an  honour  or  decoration  is\n12.\nconferred in accordance with this Act shall be published in the Official Gazette.\n\nCancellation of honours and decorations in form of medals\n\n13.(1)\nmedal or clasp, has been conferred\n\nWhere a person on whom an honour or decoration, in the form of a\n\n(a)\n\n(b)\n\nbrings Barbados into disrepute; or\n\nengages in dishonourable conduct,\n\nthe Chancellor may cancel that honour or decoration.\n\n(2)\n\nSubject to subsection (1), where a medal or clasp is cancelled,\n\n(a)\n\n(b)\n\nthe name of the person on whom the medal or clasp was conferred shall\nbe erased from the relevant register; and\n\nthe person shall, where applicable, return the medal or any clasp to the\nSecretary.\n\nNotwithstanding subsection (1), the Chancellor may restore the cancelled\n\n(3)\nhonour or decoration.\n\nWhere the medal or clasp is restored, the Secretary shall re-enter the record\n\n(4)\nof the medal or clasp into the relevant register.\n\nTermination of membership\n\n14.(1)\nA person does not cease to be a member or an honourary member of\nthe Order by reason only of that person ceasing to be eligible to be appointed to\nthe Order.\n\nA person ceases to be a member or an honourary member of the Order\n\n(2)\non\n\n(a)\n\nthe death of that person;\n\n\f13\n\n(b)\n\nresignation from the Order; or\n\n(c)\n\ntermination of the appointment of that person.\n\n(3)\n\nAn appointment that has been terminated may be restored.\n\n(4)\nWhere a person ceases, other than by death, to be a member or an honourary\nmember  of  the  Order,  the  person  shall  immediately  return  the  insignia  to  the\nSecretary.\n\nResignation from the Order\n\n15.(1)\nresignation in writing to the Chancellor.\n\nA  person  who  wishes  to  resign  from  the  Order  shall  submit  a\n\nA person who is an honourary member of the Order and who no longer\n(2)\ndesires to be recognised as an honourary member shall notify the Chancellor in\nwriting of his desire.\n\nA resignation or notice submitted in accordance with this section shall take\n(3)\neffect from the day on which the person is informed of the acceptance of the\nresignation or notice, as the case may be.\n\nOrder of Freedom of Barbados\n\n16.\nThe award of the Order of Freedom of Barbados may be conferred by\nthe President in accordance with the Order of Freedom of Barbados Act, 2019\n(Act 2019-32).\n\nGold Award of Achievement\n\n17.\nThe award of the Gold Award of Achievement may be conferred by\nthe President in accordance with the Gold Award of Achievement Act, Cap. 401.\n\nBarbados Humanitarian Service Award\n\n18.\nThe  award  of  the  Barbados  Humanitarian  Service  Award  may  be\nconferred  by  the  President  in  accordance  with  the  Barbados  Humanitarian\nService Award Act, 2020 (Act 2020-33).\n\n\f14\n\nThe Pride of Barbados Award\n\n19.\nin accordance with the Award of Pride of Barbados Act, 2019 (Act 2019-52).\n\nThe award of The Pride of Barbados may be conferred by the President\n\nInsignia\n\n20.(1)\nthe Order shall be worn.\n\nThe Chancellor shall determine the manner in which the insignia of\n\nA person on whom an honour or a decoration is conferred is entitled to\n\n(2)\nwear the insignia for that honour or decoration.\n\nExcept as provided by regulations, the insignia of the Order shall remain\n\n(3)\nthe property of the Order.\n\nWith effect from the 30th day of November, 2021, insignia for the Order\n\n(4)\nshall not contain any reference to the “Crown”.\n\nHonours conferred on groups\n\n21.\non any group of persons and the provisions of\n\nThe Chancellor may confer any honour or decoration under the Order\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe Order of Freedom of Barbados Act, 2019 (Act 2019-32);\n\nthe Gold Award of Achievement Act, Cap. 401;\n\nthe Award of Pride of Barbados Act, 2019 (Act 2019-52);\n\nthe Barbados Humanitarian Service Award Act, 2020 (Act 2020-33);\nand\n\n(e)\n\nthis Act,\n\nshall apply mutatis mutandis.\n\n\f15\n\nPART III\n\nIMPERIAL HONOURS AND IMPERIAL DECORATIONS\n\nLetters Patent\n\n22.(1)\nawards or decorations shall be conferred pursuant to the Letters Patent.\n\nWith effect from the 30th day of November, 2021, no appointments,\n\n(2)\n\nNotwithstanding subsection (1),\n\n(a)\n\nall appointments, awards or decorations conferred prior to the 30th day\nof November, 2021 pursuant to the Letters Patent shall continue to be\nacknowledged as validly conferred; and\n\n(b)\n\nall holders of appointments, awards or decorations conferred pursuant\nto the Letters Patent shall be deemed to be members of the Order.\n\nRecognition of Imperial Awards\n\nAll imperial awards conferred prior to the 30th day of November, 2021\n23.\nby  Her  Majesty  the  Queen,  Elizabeth  the  Second,  shall  continue  to  be\nacknowledged as validly conferred.\n\nPART IV\n\nMISCELLANEOUS\n\nRegulations\n\n24.(1)\nprovisions of this Act.\n\nThe Chancellor may make regulations to generally give effect to the\n\nRegulations  made  under  subsection  (1)  shall  be  subject  to  affirmative\n\n(2)\nresolution.\n\n\f16\n\nAmendment of Schedules\n\n25.(1)\n\nThe Chancellor may amend the Schedules by order.\n\nAll  orders  made  pursuant  to  this  section  shall  be  subject  to  affirmative\n\n(2)\nresolution.\n\nAmendment of Order of Freedom of Barbados Act, 2019 (Act 2019-32)\n\n26.\ninserting immediately after section 8 the following new section:\n\nThe Order of Freedom of Barbados Act (Act 2019-32) is amended by\n\n“President to be member of Order\n\n8A.(1)\neach President at the commencement of the term of office.\n\nThe Order of Freedom of Barbados shall be conferred on\n\nThe  President  shall  continue  to  be  a  member  of  the  Order\n\n(2)\nnotwithstanding demission or retirement from office.”.\n\nCommencement\n\n27.\n\nThis Act shall come into operation on the 30th day of November, 2021.\n\n\f17\n\nFIRST SCHEDULE\n\nOrder of the Republic\n\n(Section 9(3)(a))\n\n1.(1)\ndistinguished national achievement and merit.\n\nAppointments  to  the  Order  of  the  Republic  may  be  made  for\n\nNotwithstanding  subparagraph  (1),  a  distinguished  person  who  is  not  a\n(2)\ncitizen of Barbados may be conferred an honourary appointment to the Order of\nthe Republic where it is desirable that the person be so honoured by Barbados.\n\n2.(1)\nNot more than 5 persons may be appointed to the Order of the Republic\non the coming into force of this Act, other than as an honourary member of the\nOrder of the Republic, and thereafter, not more than 3 persons may be appointed\nin any year.\n\nThere shall be no more than 50 persons, holding appointments to the Order\n\n(2)\nof the Republic other than honourary members.\n\n3.(1)\n\nA person appointed to the Order of the Republic is entitled\n\n(a)\n\n(b)\n\nto have the letters “OR” placed after his or her name on all occasions\nwhen the use of letters after a name is customary;\n\nto  wear  as  a  decoration  the  prescribed  insignia  for  the  Order  of  the\nRepublic.\n\nA person appointed to the Order of the Republic is entitled to use the title\n(2)\n“The  Honourable”  before  his  or  her  name  immediately  on  publication  of  the\naward.\n\n\f18\n\nSECOND SCHEDULE\n\nTrident of Excellence\n\n(Section 9(3)(b))\n\n1.(1)\nThe Trident of Excellence may be conferred  on a person for highly\nmeritorious  service  or  achievement  in  science,  the  arts,  literature,  sport,  civic\nduties or any other endeavour, worthy of national recognition.\n\nNotwithstanding  subparagraph  (1),  a  distinguished  person  who  is  not  a\n(2)\ncitizen of Barbados may be conferred an honourary Trident of Excellence where\nit is desirable that the person be so honoured by Barbados.\n\n2.\nthe grades, in order of preference, of\n\nThe Trident of Excellence may be conferred  on a person, in either of\n\n(a)\n\n(b)\n\nGold Trident of Excellence; or\n\nSilver Trident of Excellence.\n\n3.\nconferred a Trident of Excellence in each of the 2 grades in any year.\n\nNot  more  than  5  persons,  other  than  honourary  holders,  may  be\n\n4.\n\nA holder of the Trident of Excellence is entitled\n\n(a)\n\nto  have  the  letters  “GTE”,  if  appointed  to  the  Gold  Trident  of\nExcellence, and the letters “STE”, if appointed to the Silver Trident of\nExcellence, placed after his or her name on all occasions when the use\nof the letters after a name is customary; and\n\n(b)\n\nto wear as a decoration the prescribed insignia for holders of the Trident\nof Excellence.\n\n\f19\n\nTHIRD SCHEDULE\n\nBarbados Service Award\n\n(Section 9(3)(c))\n\nThe  Barbados  Service  Award  shall  be    conferred  on  a  person  for\n1.\nmeritorious work in the public, fire, military, police, prison or other protective\nservices or in any other similar field of endeavour.\n\n2.\nof the grades, in order of preference, of\n\nThe Barbados Service Award may be conferred on a person, in either\n\n(a)\n\n(b)\n\nBarbados Service Star; or\n\nBarbados Service Medal.\n\n3.\nAward in each of the 2 grades in any year.\n\nNot  more  than  7  persons  may  be  conferred  the  Barbados  Service\n\n4.\n\nA holder of the Barbados Service Award is entitled to have the letters\n\n(a)\n\n(b)\n\n“BSS”, if appointed to the Barbados Service Star; and\n\n“BSM”, if appointed to the Barbados Service Medal,\n\nplaced after his or her name on all occasions when the use of letters after a name\nis customary.\n\n\f20\n\nFOURTH SCHEDULE\n\nBarbados Services Medal of Honour\n\n(Section 9(3)(d))\n\n1.\nMedal of Honour:\n\nThe following persons are eligible to receive the Barbados Services\n\n(a)\n\n(b)\n\n(c)\n\nmembers of the Barbados Defence Force;\n\nmembers of the Barbados Police Service;\n\nmembers of the Barbados Fire Service;\n\n(d)\n\nmembers of the Barbados Prison Service.\n\n2.\nperson unless that person\n\nThe Barbados Services Medal of Honour may not be conferred on a\n\n(a)\n\n(b)\n\nis 18 years or older; and\n\nhas served diligently and has been of exemplary conduct\n\n(i)\n\n(ii)\n\nfor a continuous period of 15 years in one of the capacities listed\nin paragraph 1; or\n\nin 2 or more of those capacities for successive periods amounting\nin the aggregate to not less than 15 years.\n\n3.\nA  clasp  to  the  Barbados  Services  Medal  of  Honour  may  be\nconferred after the completion of a further continuous period of service of 10\nyears in any of the capacities mentioned in paragraph 1, and an additional clasp\nmay  be  conferred  after  the  completion  of  each  further  period  of  5  years’\ncontinuous service.\n\n\f21\n\n4.\nto the medal may be made by the Chancellor on the recommendation of\n\nThe conferment of the Barbados Services Medal of Honour or a clasp\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe  Chief  of  Staff  of  the  Barbados  Defence  Force,  in  the  case  of  a\nmember of the Barbados Defence Force;\n\nthe Commissioner of Police, in the case of a member of the Barbados\nPolice Service;\n\nthe Chief Fire Officer, in the case of a member of the Barbados Fire\nService; and\n\nthe Superintendant of Prisons, in the case of a member of the Barbados\nPrison Service,\n\nas may be determined by the head of the Ministry responsible for the particular\nservice.\n\n\f22\n\nFIFTH SCHEDULE\n\nBarbados Bravery Decorations\n\n(Section 9(3)(e))\n\n1.\nconspicuous courage in circumstances of extreme peril.\n\nThe  Barbados  Star  of  Gallantry  may  be  conferred  for  acts  of\n\n2.\nhazardous circumstances.\n\nThe Barbados Bravery Medal may be conferred for acts of bravery in\n\n\f23\n\nSIXTH SCHEDULE\n\nPrime Minister’s Award for Leadership\n\n(Section 9(3)(f))\n\nEach Head Boy and Head Girl of a school in Barbados shall be entitled to the\nPrime Minister’s Award for Leadership in recognition of their attainment of a\nleadership position in school.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2021.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2021.\n\nPresident\n\n"
}