{
  "bill_id": 589,
  "slug": "whistleblower-protection-act-2021",
  "title": "Whistleblower Protection Act, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/19aa3a6cd8854f13c0d9dcfde67cd4d5.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-12-15",
  "first_reading": "2021-12-20",
  "gazette_date": "2021-11-11",
  "markdown": "2021-10-15\n\nOBJECTS AND REASONS\n\nThis Bill would deter and combat corruption and other improper conduct by\nencouraging and facilitating disclosures of such conduct, protecting the persons\nwho make such disclosures and regulating the receipt, investigation and other\ntreatment of such disclosures.\n\nAPPENDIX I\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nApplication of Act\n\nPART II\n\nDISCLOSURES\n\nDisclosure to Disclosure Receiving Authority\n\nDisclosure to employer\n\nSpecial procedure for matters relating to national security etc.\n\nLegal professional privilege\n\nContent and form of disclosure\n\nAnonymous disclosures\n\n10.\n\nDisclosure procedures\n\n11.\n\nDisclosure receiving officers\n\n\f12.\n\nProtected disclosures\n\n3\n\nPART III\n\nRECEIVING, INQUIRING INTO AND OTHERWISE DEALING WITH\nDISCLOSURES\n\n13.\n\nDuty to receive and inquire into disclosures\n\n14.\n\nRight to refuse; duty to refer\n\n15.\n\nDisclosure Monitoring Authority\n\nPART IV\n\nPROTECTION OF WHISTLEBLOWERS ETC.\n\n16.\n\nProhibition against detrimental action\n\n17.\n\nPresumption of detrimental action resulting from disclosure\n\n18.\n\nImmunity from civil, criminal and disciplinary proceedings\n\n19.\n\nNo immunity where whistleblower was perpetrator or accomplice\n\n20.\n\nProhibition of disclosure of information to identify whistleblower\n\n21.\n\nCivil remedies for detrimental action\n\n22.\n\nOther remedies not affected\n\n23.\n\nProtection of associated persons, wrongly identified persons etc.\n\n\f4\n\nPART V\n\nMISCELLANEOUS\n\n24.\n\nProvisions for non-disclosure void\n\n25.\n\nConfidentiality\n\n26.\n\nOffences and penalties\n\n27.\n\nAmendment of First Schedule\n\n28.\n\nRegulations\n\n29.\n\nAct binds the Crown\n\n30.\n\nConsequential Amendments\n\n31.\n\nCommencement\n\nFIRST SCHEDULE\n\nDISCLOSURE RECEIVING AUTHORITIES\n\nSECOND SCHEDULE\n\nConsequential Amendments\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  deter  and  combat  corruption  and  other  improper  conduct  by\nencouraging  and  facilitating  disclosures  of  such  conduct,  protecting  the\npersons who make such disclosures and regulating the receipt, investigation\nand other treatment of such disclosures.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Whistleblower Protection Act, 2021.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“appointed day” means the date of commencement of this Act;\n\n“associated person” means a person who\n\n(a)\n\nprovides or attempts to provide supporting information in respect of a\ndisclosure or otherwise assists or attempts to assist a whistleblower; or\n\n(b)\n\nis a member of the family of a whistleblower;\n\n“detrimental action” means any act that results in a person being\n\n(a)\n\n(b)\n\n(c)\n\nharassed, intimidated or victimized;\n\nunfairly denied appointment to any employment, profession or office;\n\nunfairly subjected to disciplinary action;\n\n(d)\n\nunfairly dismissed, suspended or demoted;\n\n(e)\n\ntransferred against his will;\n\n(f)\n\n(g)\n\nunfairly refused transfer or promotion;\n\nsubject  to  a  term  or  condition  of  employment  or  retirement  from\nemployment that has been altered to his disadvantage;\n\n(h)\n\nunfairly provided with an adverse reference or refused a reference;\n\n(i)\n\nthreatened with any of the actions specified in paragraphs (a) to (h); or\n\n\f7\n\n(j)\n\notherwise adversely affected in respect of his employment, profession\nor  office,  including  in  respect  of  employment  opportunities  and  job\nsecurity,\n\nor in a person otherwise suffering injury, loss or damage, whether personally\nor in relation to his family life, career, employment, profession, office, trade\nor business;\n\n“disclosure”  means  a  disclosure  of  information  which  shows,  or  potentially\nshows, that improper conduct has occurred, is occurring or is likely to occur;\n\n“Disclosure Monitoring Authority” means the authority designated as such under\n\nsection 15(1) for the purposes of this Act;\n\n“disclosure procedures” means the procedures described in section 10(1);\n\n“Disclosure  Receiving  Authority”  means  a  person  specified  in  the  First\n\nSchedule;\n\n“document” includes\n\n(a)\n\n(b)\n\n(c)\n\nanything on which there is writing;\n\na map, plan, drawing or photograph; and\n\nany  information  recorded  or  stored  by  means  of  any  tape  recorder,\ncomputer or other device, and any material subsequently derived from\nthe information so recorded or stored;\n\n“employee” has the meaning assigned to it by section 2(1) of the Employment\n\nRights Act, 2012 (Act 2012-9);\n\n“employer” has the meaning assigned to it by section 2(1) of the Employment\n\nRights Act, 2012 (Act 2012-9);\n\n“improper conduct” includes any\n\n(a)\n\ncriminal offence;\n\n\f8\n\n(b)\n\nfailure to carry out a legal obligation, other than one arising under an\nemployee’s contract of employment whereby the employee undertakes\nto perform personally any work or services;\n\n(c)\n\nconduct that is likely to result in a miscarriage of justice;\n\n(d)\n\nconduct that is likely to threaten the health or safety of a person;\n\n(e)\n\nconduct that is likely to threaten or damage the environment;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\n(k)\n\nconduct that shows gross mismanagement, negligence, impropriety or\nmisconduct in the carrying out of any activity that involves the use of\npublic funds;\n\nact  of  reprisal  against,  or  victimization  of,  a  whistleblower,  an\nassociated person or a person mistakenly perceived or identified as a\nwhistleblower or an associated person;\n\nconduct that tends to show unfair discrimination, whether under the\nEmployment (Prevention of Discrimination) Act, 2020 (Act 2020-26)\nor otherwise;\n\nother conduct that represents a significant threat or harm to the public\ninterest;\n\nwilful concealment of any act described in paragraphs (a) to (i); or\n\nwilful concealment or destruction of any information tending to show\nthat  any  act  described  in  paragraphs(a)to(i)  has  been,  is  being  or  is\nlikely to be committed;\n\n“persons exercising public functions” includes\n\n(a)\n\n(b)\n\npublic officers;\n\nmembers, chief executive officers, managers, directors and employees\nof state-owned enterprises; and\n\n\f9\n\n(c)\n\nany other person who holds a legislative, executive, administrative or\njudicial office in the Government of Barbados, whether appointed or\nelected, permanent or temporary, paid or unpaid;\n\n“privileged information” means\n\n(a)\n\n(b)\n\ncommunications  between  an  attorney-at-law  and  his  client  or  any\nperson representing his client, made in connection with the giving of\nlegal advice to the client;\n\ncommunications  between  an  attorney-at-law  and  his  client  or  any\nperson representing his client, or between such an attorney-at-law or\nhis  client  or  any  such  representative  and  any  other  person,  made  in\nconnection with or in contemplation of legal proceedings and for the\npurposes of such proceedings; and\n\n(c)\n\nmaterials  enclosed  with  or  referred  to  in  such  communications  and\nmade\n\n(i)\n\nin connection with the giving of legal advice; or\n\n(ii)\n\nin connection with or in contemplation of legal proceedings and\nfor the purposes of such proceedings,\n\nwhen the communications or materials are in the possession of a person who\nis entitled to such possession and are not held with the intention of furthering\na criminal purpose;\n\n“protected disclosure” means a disclosure described in section 12;\n\n“public body” means\n\n(a)\n\n(b)\n\na Ministry, department, agency or other authority of Government;\n\na state-owned enterprise;\n\n“state-owned enterprise” means\n\n(a)\n\na statutory board;\n\n\f10\n\n(b)\n\na company that is substantially owned and effectively controlled by the\nGovernment;\n\n“whistleblower” means any person who is personally aware of improper conduct\nand who intends or attempts to make, makes or has made, a disclosure.\n\nApplication of Act\n\n3.\nnotwithstanding that\n\nThis  Act  applies  to  any  disclosure  made  after  the  appointed  day,\n\n(a)\n\n(b)\n\nthe conduct to which the disclosure relates may have occurred before\nthe appointed day;\n\nthe whistleblower is not able to identify a particular person to whom\nthe disclosure relates.\n\nPART II\n\nDISCLOSURES\n\nDisclosure to Disclosure Receiving Authority\n\n4.(1)\nAuthority.\n\nA whistleblower may make a disclosure to any Disclosure Receiving\n\nWhere  a  whistleblower  makes  a  disclosure  to  a  Disclosure  Receiving\n(2)\nAuthority, the whistleblower shall ensure, as far as practicable, that the matter to\nwhich  the  disclosure  relates  falls  within  the  area  of  responsibility  of  the\nDisclosure Receiving Authority.\n\nNotwithstanding subsection (2), a whistleblower shall not be denied the\n(3)\nprotection afforded by Part IV merely on the basis that he made a disclosure to\na Disclosure Receiving Authority of a matter that does not fall within the area of\nresponsibility of the Disclosure Receiving Authority.\n\n\f11\n\nDisclosure to employer\n\nWithout prejudice to the generality of section 4, a whistleblower who\n5.\nis an employee may, where the improper conduct he wishes to disclose relates to\nhis employment or to the business of his employer, make the disclosure to his\nemployer.\n\nSpecial procedure for matters relating to national security etc.\n\n6.\nNotwithstanding  sections  4  and  5,  a  whistleblower  who  wishes  to\ndisclose  a  matter  that  would  prejudice  the  national  security,  defence  or\ninternational  relations  of  Barbados  shall  make  the  disclosure  to  the  Minister\nresponsible for the matter or to the Prime Minister or to both.\n\nLegal professional privilege\n\n7.\ndisclosure of information that is protected by legal professional privilege.\n\nFor  the  avoidance  of  doubt,  nothing  in  this  Act  authorizes  the\n\nContent and form of disclosure\n\n8.(1)\nfar as practicable, the following information:\n\nA disclosure may be made orally or in writing and shall contain, as\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe full name, address and occupation of the whistleblower;\n\ndetails of the improper conduct in respect of which the disclosure is\nmade;\n\nthe name of the person alleged to have committed, to be committing\nor to be about to commit the improper conduct;\n\nthe time and place where the improper conduct is alleged to have taken\nplace, to be taking place or to be about to take place;\n\nthe  full  name,  address  and  description  of  a  person,  if  any,  who\nwitnessed the commission of the improper conduct;\n\n\f12\n\n(f)\n\n(g)\n\nwhether the whistleblower made a disclosure of the same or of some\nother improper conduct on a previous occasion and, if so, about whom\nand to whom the disclosure was made; and\n\nwhere the whistleblower is an employee making a disclosure about his\nemployer or a fellow employee, whether the whistleblower remains in\nthe same employment.\n\nWhere a disclosure is made orally, the person who receives the disclosure\n(2)\nshall,  within  24  hours  of  receiving  the  disclosure,  cause  the  disclosure  to  be\nreduced into writing containing the particulars specified in subsection (1).\n\nA disclosure shall be made substantially in accordance with any applicable\n\n(3)\ndisclosure procedure.\n\nA whistleblower shall not be denied the protection afforded by Part IV\n\n(4)\nmerely on the basis of a defect in the form or content of a disclosure.\n\nAnonymous disclosures\n\n9.(1)\nmade anonymously.\n\nNotwithstanding any other provision of this Act, a disclosure may be\n\nA person who receives an anonymous disclosure shall not refuse to act\n\n(2)\nupon the disclosure merely on the basis that it was made anonymously.\n\nDisclosure procedures\n\n10.(1)\nEvery person to whom disclosures may be made under this Act shall\nhave and implement procedures for the making, receipt, inquiry into and other\ntreatment of such disclosures.\n\n(2)\n\nDisclosure procedures shall\n\n(a)\n\n(b)\n\nbe set out in writing; and\n\ninclude as a minimum requirement\n\n(i)\n\na list of the Disclosure Receiving Authorities;\n\n\f13\n\n(ii)\n\na  description,  in  accordance  with  sections  4,  5  and  6,  of  the\noptions available for the making of disclosures; and\n\n(iii)\n\nas far as is practicable, the information specified in section 8,\n\nAn employer shall provide his employees with a copy of the disclosure\n\n(3)\nprocedures.\n\nNothing in this section precludes a person required to establish disclosure\n(4)\nprocedures under this Act from implementing other procedures for disclosure\nthat are not inconsistent with this Act.\n\nDisclosure receiving officers\n\nEvery director, chief executive officer or other head of a Disclosure\n11.(1)\nReceiving Authority and every employer shall identify within his organization,\nat least one individual, to be known as a disclosure receiving officer, who may\nreceive disclosures on behalf of the organization.\n\nNotwithstanding subsection (1), a director, chief executive officer or other\n(2)\nhead of a Disclosure Receiving Authority or an employer may be the disclosure\nreceiving officer.\n\nA disclosure receiving officer shall have the requisite authority and training\n\n(3)\nto receive, inquire into and otherwise deal with disclosures.\n\nProtected disclosures\n\n12.(1)\nwith this Part is a protected disclosure.\n\nA disclosure made or intended or attempted to be made in accordance\n\n(2)\n\nA disclosure that is privileged information is a protected disclosure.\n\nA whistleblower shall enjoy the protection afforded by Part IV in respect\n\n(3)\nof a protected disclosure he makes or intends or attempts to make.\n\n(4)\n\nNotwithstanding subsection (1)\n\n(a)\n\na  disclosure  is  not  a  protected  disclosure  where  the  whistleblower\ncommits an offence by making it;\n\n\f14\n\n(b)\n\na  disclosure  made  anonymously  does  not  become  a  protected\ndisclosure until the whistleblower identifies himself to the recipient of\nthe disclosure.\n\nPART III\n\nRECEIVING, INQUIRING INTO AND OTHERWISE DEALING WITH\nDISCLOSURES\n\nDuty to receive and inquire into disclosures\n\n13.(1)\n\nA person to whom a disclosure is\n\n(a)\n\n(b)\n\nmade in accordance with section 4, 5 or 6; or\n\nreferred in accordance with section 14(4),\n\nshall receive and record the disclosure and take appropriate steps to inquire into\nthe  disclosure  where  he  considers  that  the  circumstances  specified  in  section\n14(2) do not apply and an inquiry should be undertaken.\n\nA person referred to in subsection (1) who determines to inquire into a\n\n(2)\ndisclosure shall\n\n(a)\n\n(b)\n\n(c)\n\ncommence the inquiry forthwith;\n\nensure that the inquiry is carried out fairly;\n\nissue to the whistleblower, periodic updates on the inquiry at intervals\nof no more than 30 days;\n\n(d)\n\nreview the results of the inquiry and report its findings to\n\n(i)\n\n(ii)\n\nthe whistleblower;\n\nany other relevant person having regard to the improper conduct\nand the area of responsibility involved; and\n\n\f15\n\n(iii)\n\nfor the avoidance of doubt, the Commissioner of Police, where\nthe findings suggest that the improper conduct is or involves an\noffence;\n\n(e)\n\nwhere appropriate\n\n(i)\n\n(ii)\n\nmake  recommendations  regarding  the  measures  to  be  taken  to\nremedy the improper conduct;\n\ntake steps to remedy the improper conduct, provide redress and\nreduce any opportunity for recurrence of the conduct; and\n\n(iii)\n\ntake disciplinary action;\n\n(f)\n\n(g)\n\nensure that the rights of the whistleblower, any witness involved and\nthe  person  alleged  to  have  committed  the  improper  conduct  are\nprotected; and\n\nreceive,  record,  review,  inquire  into  and  otherwise  deal  with  any\ncomplaints made in respect of detrimental action suffered as a result\nof the disclosure.\n\nA person who receives, inquires into or otherwise deals with a disclosure\n(3)\nshall not be liable in any civil, criminal or disciplinary proceedings on account\nof  his  receiving,  inquiring  into  or  otherwise  dealing  with  the  disclosure  in\naccordance with this Act.\n\nRight to refuse; duty to refer\n\n14.(1)\nthe circumstances set out in subsection (2)\n\nA person to whom a disclosure is made may, in good faith, in any of\n\n(a)\n\nrefuse to deal with the disclosure or to commence an inquiry into any\nimproper conduct alleged in the disclosure; or\n\n(b)\n\ncease an inquiry into the disclosure.\n\n\f16\n\n(2)\n\nThe circumstances referred to in subsection (1) are\n\n(a)\n\n(b)\n\n(c)\n\nthe  subject  matter  of  the  disclosure  or  the  related  inquiry  has  been\nadequately dealt with, or could more appropriately be dealt with by\nanother person;\n\nthe  subject  matter  of  the  disclosure  is  frivolous  or  not  sufficiently\nimportant to warrant an inquiry; or\n\nthe circumstances surrounding the subject matter of the disclosure have\nchanged, whether by reason of insufficiency of evidence or otherwise,\nso as to render the inquiry unnecessary.\n\nWhere a person refuses to carry out an inquiry, the person shall provide\n(3)\nreasons  for  the  refusal  in  writing  to  the  whistleblower  within  15  days  of  his\ndecision.\n\n(4)\n\nWhere\n\n(a)\n\n(b)\n\na disclosure is made to a Disclosure Receiving Authority; and\n\nthe  Disclosure  Receiving  Authority  is  not  the  appropriate  person  to\ninquire into the matter disclosed,\n\nthe Disclosure Receiving Authority shall forthwith refer the disclosure to such\nother Disclosure Receiving Authority who, in the opinion of the first mentioned\nDisclosure  Receiving  Authority,  is  the  appropriate  person  to  inquire  into  the\nmatter.\n\nDisclosure Monitoring Authority\n\n15.(1)\nMonitoring Authority for the purposes of this Act.\n\nThe  Minister  may  by  Order  declare  a  person  to  be  the  Disclosure\n\nThe Disclosure Monitoring Authority shall be responsible for monitoring\n\n(2)\ncompliance with this Act.\n\n\f17\n\nIn  furtherance  of  his  function  under  subsection  (2),  the  Disclosure\n\n(3)\nMonitoring Authority shall\n\n(a)\n\npublish such procedural guidelines regarding the making, receiving,\ninquiring  into  and  other  treatment  of  disclosures,  as  it  considers\nappropriate;\n\n(b)\n\nprovide such assistance as may be practicable to any person who is\n\n(i)\n\na whistleblower; or\n\n(ii)\n\na  disclosure  receiving  officer,  Disclosure  Receiving  Authority,\nemployer or other person subject to the requirements of this Act;\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\non an ongoing basis, plan, implement and monitor public awareness\nprogrammes  aimed  at  informing  and  educating  the  public,  and\nemployees and employers, in particular, about the making of protected\ndisclosures in a responsible manner and about disclosure procedures;\n\nreview  from  time  to  time  the  disclosure  procedures  required  to  be\nestablished  under  this  Act  and  the  implementation  and  operation  of\nsuch procedures;\n\nmake recommendations to any person arising from any review under\nparagraph (d); and\n\nwhere he considers it appropriate to do so initiate an investigation into\na disclosure.\n\nThe Disclosure Monitoring Authority shall not disclose in any report it\n(4)\nprepares for publication any information that would directly or indirectly identify\na whistleblower or any person about whose conduct a disclosure was made.\n\n\f18\n\nPART IV\n\nPROTECTION OF WHISTLEBLOWERS ETC.\n\nProhibition against detrimental action\n\nNo whistleblower shall be subjected to detrimental action on account\n16.(1)\nof  his  intending  or  attempting  to  make,  making  or  having  made,  a  protected\ndisclosure.\n\nSubsection  (1)  applies  notwithstanding  any  duty  of  secrecy  or\n(2)\nconfidentiality or other prohibition or restriction on the disclosure of information\nunder any enactment, rule of law, contract, oath or practice.\n\nAn employee who is dismissed on account of his intending or attempting\n(3)\nto make, making or having made, a protected disclosure shall, without prejudice\nto  any  other  remedy,  be  treated  as  having  been  unfairly  dismissed  under  the\nEmployment Rights Act, 2012 (Act 2012-9).\n\nPresumption of detrimental action resulting from disclosure\n\n17.\nWhere  a  whistleblower  suffers  detrimental  action  at  or  around  the\nsame time that he makes a protected disclosure, the detrimental action shall be\npresumed to be a consequence of the protected disclosure unless the person who\ntook, authorized or caused the detrimental action to be taken shows that the act\nthat constitutes the detrimental action is otherwise justified.\n\nImmunity from civil, criminal and disciplinary proceedings\n\n18.(1)\nSubject to section 19, a whistleblower shall not be liable in any civil,\ncriminal  or  disciplinary  proceedings  on  account  of  his  making  a  protected\ndisclosure.\n\nSubsection  (1)  applies  notwithstanding  any  duty  of  secrecy  or\n(2)\nconfidentiality or other prohibition or restriction on the disclosure of information\nunder any enactment, rule of law, contract, oath or practice.\n\n\f19\n\nThe  protection  afforded  to  a  whistleblower  by  this  Part  shall  not  be\n\n(3)\ndiminished or denied on the basis that\n\n(a)\n\n(b)\n\n(c)\n\nthe  whistleblower  was  mistaken  about  the  significance  of  the\ndisclosure;\n\nany perceived threat to the public interest on which the disclosure was\nbased has not materialised; or\n\nthe  whistleblower  has  not  fully  complied  with  any  applicable\ndisclosure procedures, guidelines or regulations made under this Act.\n\nNo immunity where whistleblower was perpetrator or accomplice\n\nSubject  to  subsection  (3),  nothing  in  this  Part  shall  prevent  the\n19.(1)\ninstitution  of  criminal  proceedings  against  a  whistleblower  where  the\nwhistleblower was the perpetrator of, or an accomplice in, any improper conduct\n\n(a)\n\n(b)\n\nto which the disclosure relates; and\n\nwhich constitutes an offence.\n\nSubject to subsections (5) and (6), nothing in this Part shall prevent the\n(2)\ninstitution of civil or disciplinary proceedings against a whistleblower where the\nproceedings arise from conduct of the whistleblower, other than the making of a\nprotected disclosure.\n\nIn any criminal proceedings instituted against a whistleblower on the basis\n(3)\nthat the whistleblower was the perpetrator of, or an accomplice in, the improper\nconduct disclosed by the whistleblower, the court shall, in giving its judgment or\ndecision, take into due account\n\n(a)\n\n(b)\n\nthe fact that the disclosure was made by the whistleblower; and\n\nwhether the whistleblower has assisted members of the Police Force\nin apprehending any other person involved in the commission of an\noffence,\n\n\f20\n\nand the punishment of the whistleblower may be mitigated or remitted as the\ncourt thinks fit.\n\nWhere the court acts under subsection (3), the court shall expressly refer\n\n(4)\nto that subsection in its judgment or decision.\n\nIn any civil proceedings instituted against a whistleblower on the basis that\n(5)\nthe whistleblower was the perpetrator of, or was an accomplice in, the improper\nconduct disclosed by the whistleblower, the court may, where it finds that the\nwhistleblower  is  responsible  for  the  payment  of  damages,  only  hold  the\nwhistleblower liable for such part of the damage as he may have caused and not\nhold him liable jointly and severally with others.\n\nWhere a whistleblower is an employee of a public body and disciplinary\n(6)\nproceedings are instituted against him on the basis that he was the perpetrator of,\nor an accomplice in, the improper conduct disclosed by him, the public body shall\n\n(a)\n\n(b)\n\nendeavour to mitigate the effects of any punishment; and\n\nwhere  possible,  not  seek  the  dismissal  of  the  whistleblower  as\npunishment.\n\nProhibition of disclosure of information to identify whistleblower\n\n20.(1)\nNo disclosure receiving officer or Disclosure Receiving Authority to\nwhom a protected disclosure is made or referred shall disclose information that\nidentifies,  or  may  lead  to  the  identification  of,  the  whistleblower,  unless  the\nwhistleblower expressly consents in writing to the disclosure of that information.\n\nA  disclosure  receiving  officer  shall  not  communicate  the  contents  of  a\n(2)\ndisclosure to any other person whether within or outside his organization that is\nnot  directly  involved  in  receiving,  inquiring  into  or  otherwise  dealing  with\ndisclosures, unless he first inquires into the disclosure and establishes that it is\nnecessary or expedient in the public interest for further investigation to be carried\nout by the person or by members of the Police Force or any other body with\ninvestigative,  prosecutorial  or  regulatory  powers  in  relation  to  any  improper\nconduct which constitutes an offence or other breach of law.\n\n\f21\n\n(3)\n\nThe Disclosure Monitoring Authority may issue guidelines setting out\n\n(a)\n\nthe  duties  of  communication  between  Disclosure  Receiving\nAuthorities and whistleblowers and the restrictions thereon; and\n\n(b)\n\nthe rules for disclosure to\n\n(i)\n\npersons  within  Disclosure  Receiving  Authorities  who  are  not\ndirectly involved in receiving, inquiring into or otherwise dealing\nwith disclosures; and\n\n(ii)\n\nother Disclosure Receiving Authorities.\n\nCivil remedies for detrimental action\n\nA  whistleblower  who  believes  that  detrimental  action  has  been,  is\n21.(1)\nbeing or is likely to be taken against him in breach of section 16 may apply to\nthe High Court for\n\n(a)\n\nan order requiring the person who has taken the detrimental action to\nremedy the action;\n\n(b)\n\nan injunction; or\n\n(c)\n\nany other relief that the court thinks fit.\n\nThe High Court may, pending the final determination of an application\n\n(2)\nunder this section\n\n(a)\n\n(b)\n\n(c)\n\nmake an interim order;\n\ngrant an interim injunction; or\n\ngrant any other relief it thinks fit.\n\nWhere, in determining an application under subsection (2), the High Court\n(3)\nis satisfied that a person has taken, is taking or intends to take detrimental action\nagainst a whistleblower in breach of section 16, the High Court may\n\n(a)\n\norder the person who took the detrimental action to remedy the action\nand determine the amount of damages due to the whistleblower;\n\n\f22\n\n(b)\n\ngrant an injunction on such terms as the court considers appropriate;\nor\n\n(c)\n\ngrant any other relief it thinks fit.\n\n(4)\nA whistleblower who suffers detrimental action on account of his intending\nor  attempting  to  make,  making  or  having  made,  a  protected  disclosure  shall,\nwithout  prejudice  to  any  other  right  under  any  other  law,  have  a  right  to\ncompensation  for  any  loss  or  damage  sustained  as  a  consequence  of  the\ndetrimental action.\n\nOther remedies not affected\n\nNothing in this Act affects the right of a whistleblower who believes\n22.\nthat, on account of his intending or attempting to make, making or having made\na  protected  disclosure,  he  has  been,  is  being,  or  is  likely  to  be,  subjected  to\ndetrimental action, to seek redress for such action under any other law.\n\nProtection of associated persons, wrongly identified persons etc.\n\nAn associated person who suffers detrimental action on account of his\n23.(1)\nassociation  with  a  whistleblower  shall  enjoy  the  same  protection  as  a\nwhistleblower under this Part.\n\nA person who suffers detrimental action on account of his being perceived\n(2)\nas or wrongly identified as a whistleblower shall enjoy the same protection as a\nwhistleblower under this Part.\n\nThis  Part  applies  to  a  person  described  in  subsections  (1)  and  (2)  as  it\n\n(3)\napplies to a whistleblower.\n\n\f23\n\nPART V\n\nMISCELLANEOUS\n\nProvisions for non-disclosure void\n\n24.\na protected disclosure or purports to require a person to\n\nAny provision in an agreement which precludes a person from making\n\n(a)\n\nagree not to make a disclosure under this Act during or after his period\nof employment;\n\n(b)\n\nrefrain from instituting any proceedings under this Act; or\n\n(c)\n\nwithdraw or abandon any disclosure made or proceedings instituted\nunder this Act,\n\nis void and of no effect.\n\nConfidentiality\n\n25.(1)\ndisclosure shall regard and treat as secret and confidential\n\nEvery person who receives, inquires into or otherwise deals with a\n\n(a)\n\n(b)\n\nthe disclosure and the identity of the whistleblower; and\n\nany  statement  given,  or  information  or  other  thing  provided,  to  the\nperson in connection with the disclosure.\n\nA person who contravenes subsection (1) is guilty of an offence and is\n(2)\nliable on summary conviction to a fine of $200 000 or to imprisonment for 2 years\nor to both.\n\nFor the avoidance of doubt, any statement given or information or other\n(3)\nthing  provided  in  furtherance  of  an  investigation  or  any  legal  or  disciplinary\nproceedings shall not be regarded as being inconsistent with subsection (1).\n\n\f24\n\nOffences and penalties\n\n26.(1)\n\nA person who\n\n(a)\n\nprevents or restrains another person from making a protected disclosure\nor hinders such a person in the making of such a disclosure;\n\n(b)\n\nsubjects another person to detrimental action on account of\n\n(i)\n\n(ii)\n\nhis  intending  or  attempting  to  make  or  making  a  protected\ndisclosure; or\n\nhis  being  an  associated  person  or  mistakenly  perceived  or\nidentified as a whistleblower;\n\n(c)\n\n(d)\n\nrefuses, in bad faith, to receive a disclosure or to carry out an inquiry\nin relation to a disclosure;\n\npurports to make a disclosure knowing that it contains a statement that\nis false or misleading, or reckless as to whether the statement is false\nor misleading;\n\n(e)\n\ninduces another person by threats, promises or otherwise to\n\n(i)\n\nprevent  or  restrain  another  person  from  making  a  protected\ndisclosure  or  hinder  such  a  person  in  the  making  of  such  a\ndisclosure;\n\n(ii)\n\nsubject  another  person  to  detrimental  action  on  account  of  the\nother person’s\n\n(A)\n\n(B)\n\nhis intending or attempting to make or making a protected\ndisclosure; or\n\nhis being an associated person or mistakenly perceived or\nidentified as a whistleblower;\n\n(f)\n\nknowing that a document or other thing is relevant to a disclosure or\nthe processing of a disclosure under this Act, destroys, mutilates, alters,\nfalsifies or conceals the document or other thing,\n\n\fis guilty of an offence.\n\n25\n\n(2)\n\nA person who is guilty of an offence under subsection (1) is liable on\n\n(a)\n\n(b)\n\nsummary conviction to a fine of $200 000 or to imprisonment for 2\nyears or to both; or\n\nconviction on indictment to a fine of $500 000 or to imprisonment for\n5 years or to both.\n\nAmendment of First Schedule\n\n27.\n\nThe Minister may by Order amend the First Schedule.\n\nRegulations\n\n28.\nin particular, with respect to\n\nThe Minister may make Regulations for giving effect to this Act and,\n\n(a)\n\n(b)\n\ndisclosure procedures; and\n\nthe operations of Disclosure Receiving Authorities in respect of their\nfunctions under this Act.\n\nAct binds the Crown\n\n29.\n\nThis Act binds the Crown.\n\nConsequential Amendments\n\n30.\nto the extent set out opposite thereto in Column 2.\n\nThe enactment set out in Column 1 of the Second Schedule is amended\n\nCommencement\n\n31.\n\nThis Act comes into operation on a day to be fixed by Proclamation.\n\n\f26\n\nFIRST SCHEDULE\n\nDISCLOSURE RECEIVING AUTHORITIES\n\n(Sections 2 and 27)\n\nDisclosure Monitoring Authority\n\nDirector, Anti-Corruption and Anti-Terrorism Agency\n\nPolice Force\n\nFinancial Intelligence Unit\n\nAudit Department\n\nBarbados Revenue Authority\n\nGovernment Procurement Department\n\nCentral Bank of Barbados\n\nFinancial Services Commission\n\nFair Trading Commission\n\nEnvironmental Protection Department\n\nTown Planning Department\n\nLabour Department\n\nOmbudsman\n\nChief Medical Officer\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\n11.\n\n12.\n\n13.\n\n14.\n\n15.\n\n\f27\n\n L.R.O. 1998SECOND SCHEDULE(Section 30)CONSEQUENTIAL AMENDMENTSColumn 1Enactments1. Employment Rights Act, 2012 (Act 2012-9).Column 2Amendments1. In section 2(1), insert in alphabetical order, the following  deﬁ nition:“ “protected disclosure\" has the meaning given by section 2 of the Whistleblower Protection Act, 2021 (Act 2021-  );”. 2. In section 30(1),(a)  in paragraph (d), delete the full-stop and substitute the words “; or”; and(b)  insert after paragraph (d), the following: “(e)  the reason for the dismissal is that the   employee made, or intended or attempted   to make, a protected disclosure under the   Whistleblower Protection Act, 2021  (Act 2021-  ).”.\fWHISTLEBLOWER PROTECTION BILL, 2021\n\nEXPLANATORY MEMORANDUM\n\nThis Bill would deter and combat corruption and other improper conduct by encouraging\nand facilitating disclosures of such conduct, protecting the persons who make such disclosures and\nregulating the receipt, investigation and other treatment of such disclosures.\n\nPART I\nPRELIMINARY\n\nClause 1:\n\nprovides the short title.\n\nClause 2:\n\ndefines the terms used in the legislation.\n\nClause 3:\n\nprovides for the legislation to apply even where a disclosure relates to conduct that\nmight have occurred before it came into effect or the identity of the perpetrator of\nthe conduct is unknown.\n\nPART II\nDISCLOSURES\n\nClause 4:\n\nprovides for a disclosure to be made to any Disclosure Receiving Authority set out\nin the First Schedule.\n\nClause 5:\n\nallows for an employee to disclose to his employer.\n\nClause 6:\n\nmakes  special  provision  for  disclosures  related  to  national  security,  defence  and\ninternational relations.\n\nClause 7:\n\ncreates an exception in relation to  a disclosure of information protected by legal\nprofessional privilege.\n\nClause 8:\n\nspeaks to the content and form of disclosures.\n\nClause 9:\n\nprovides for anonymous disclosures.\n\nClause 10:\n\nrequires persons to have procedures for the receipt and treatment of disclosures.\n\nClause 11:\n\nrequires  both  Disclosure  Receiving  Authorities  and  employers  to  identify\ndisclosure receiving officers to be responsible for dealing with disclosures on their\nbehalf.\n\nClause 12:\n\nexplains the concept of a protected disclosure.\n\ni\n\nAPPENDIX II\n\n\fPART III\nRECEIVING, INQUIRING INTO AND OTHERWISE DEALING WITH DISCLOSURES\n\nClause 13:\n\nspeaks to receiving and inquiring into disclosures.\n\nClause 14:\n\npermits a recipient of a disclosure to refuse to inquire into it on certain grounds, for\ninstance, where the matter is frivolous.\n\nClause 15:\n\nspeaks  to  the  Disclosure  Monitoring  Authority  and  its  function  in  monitoring\ncompliance with the legislation.\n\nPART IV\nPROTECTION OF WHISTLEBLOWERS ETC.\n\nClause 16:\n\nprohibits the taking of detrimental action against a whistleblower.\n\nClause 17:\n\npresumes, where a whistleblower suffers detrimental action around the same time\nthat he makes a disclosure, that the action is related to disclosure.\n\nClause 18:\n\ngives  a  whistleblower  certain immunity,  subject  to  clause  19,  where  he  makes  a\nprotected disclosure.\n\nClause 19:\n\nstipulates  that  a  whistleblower  will  not  be  granted  immunity  where  he  is  the\nperpetrator of the improper conduct disclosed.\n\nClause 20:\n\nprohibits a whistleblower’s identity from being disclosed.\n\nClause 21:\n\nsets  out  the  remedies  available  under  the  Bill  where  a  whistleblower  suffers\ndetrimental action.\n\nClause 22:  makes it clear that the Bill does not prevent a whistleblower who  is subjected to\n\ndetrimental action from seeking redress under any other law.\n\nClause 23:\n\nprotects  persons  associated  with  a  whistleblower  or  wrongly  identified  as  a\nwhistleblower from detrimental action.\n\nPART V\nMISCELLANEOUS\n\nClause 24:  makes void contractual terms seeking to prohibit disclosures.\n\nClause 25:\n\nimposes  a  duty  of  confidentiality  upon  persons  who  receive,  inquire  into  and\notherwise deal with disclosures and makes breach of confidentiality an offence.\n\nii\n\n\fClause 26:  makes certain conduct, such as preventing a person from making a disclosure, an\n\noffence.\n\nClause 27:\n\nempowers the Minister to amend the First Schedule.\n\nClause 28:\n\nprovides for the making of regulations.\n\nClause 29:\n\nstates that the legislation binds the Crown.\n\nClause 30:\n\nprovides for consequential amendments to be made to the Employment Rights Act,\n2012 (Act 2012-9). These are set out in the Second Schedule to the Bill.\n\nClause 31:\n\nprovides for the legislation to come into effect by Proclamation.\n\niii\n\n"
}