{
  "bill_id": 590,
  "slug": "resolution-re-compulsory-acquisition-of-land-at-sargeants-village-christ-church",
  "title": "Resolution re Compulsory  Acquisition of Land at Sargeants Village Christ Church",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/5f103d2ff2e8411ad47d4d1e1116f8b3.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-11-24",
  "first_reading": "2021-12-08",
  "gazette_date": null,
  "markdown": "Appendix II\nPARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Land Acquisition Act, Cap. 228 approve the compulsory acquisition by the Crown of the parcels of land situate at Sargeants Village in the parish of Christ Church in this Island and more particularly described in the Schedules for a public purpose, namely housing development.\nAPPROVED by the House of Assembly this\nday of\n;\nTwo thousand and twenty-one.\nSpeaker\nAPPROVED by the Senate this\nday of\n;\nTwo thousand and twenty-one.\nPresident\nFIRST SCHEDULE\nALL THAT land the property of Marjorie Payne situate at Sargeants Village in the parish of Christ Church in this Island containing by admeasurement 1222.2 square metres or thereabouts (inclusive of 144.0 square metres in road reserve) abutting and bounding on lands now or late of Olric Harewood (Lot 7) on lands now or late of Germaine Atkins on other lands now or late of the said Marjorie Payne on lands now or late of Peter Foster (Lot 2) and on a public road which leads to Highway 6 or however else the same may abut and bound as shown and delineated ona plan certified on the 26\" day of August, 2021 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Surveys Department on the 1\"*day of September, 2021 as Plan No. 1080/2021.\nSECOND SCHEDULE.\nALL THAT land the property of Germaine Atkins situate at Sargeants Village in the parish of Christ Church in this Island containing by admeasurement 5798.8 square metres or thereabouts (inclusive of 149.1 square metres in right-of-way) abutting and bounding on lands now or late of Randolph Sealy (Lot 2) on lands now or late of Marjorie Payne on lands now or late of Olric Harewood (Lot 7) on lands now or late of Kenrick Cox (Lot 6) on lands now or late of Dale Husbands (Lot 5) on lands now or late of Floretta Taylor (Lot 4) on lands now or late of Shawn Hoyte (Lot 3) on lands formerly of Cecil Howard deceased (Lot 2) on lands now or late of Shahida Griffith ef al (Lot 1) on lands now or late of June Moe (Lots 2 and 3) on lands now or late of Maureen Atkins on lands now or late of George Atkins on lands now or late of James Phillips on lands now or late of Veta Payne and on a cart road which leads to No. 1 Browne’s Gap or however else the same may abut and bound as shown and delineated on a plan certified on the 26\" day of August, 2021 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Surveys Department on the 1* day of September, 2021 as Plan No. 1080/2021.\nADDENDUM\nThe Cabinet at its meeting held on the 27\" day of May, 2021 considered Note (21) 438/ MHLM34 and agreed to the acquisition of 1512 square metres and 5665.6 square metres of land situate at Sargeants Village in the parish of Christ Church, the property of Marjorie Payne and Germaine Atkins respectively, for the purpose of housing development.\nIn accordance with section 5 of the Land Acquisition Act, Cap. 228 the approval of Parliament is now sought for the compulsory acquisition of the parcels of land described in the Schedules in order that the public purpose set out in this Resolution may be effected and the Crown may acquire an indefeasible title to the said parcels of land.\nwage po wesw «\nSurvey Order Wo: 13/2021 Correspondence No: 0501/964 Vol, |\nParlsh of: Chris] Church Locality: Sorgeants Yitoge\nReference plana by: ae ' = 4M Petachin carted 1BAQ5-2005 nd emeerded on BL 3. ft 227/200 a (ane Tax ¢: 83/04/03 /018) *, > f = ES Catone seriiied 20-C2-1978, (Land tox pi B8/04/03/012, 075-830) 7 = 4 Kh Petra srfitled 23-09-1967 end resurted os O. LS # 917/87, {Lend Tex #: 09/04/03/015) = GA. PARine certified 23-08-2000 end reserved as 9. LS fi 78/2000. ~ {lend Tex #2 Bts1e/os os} =, SLC. thane certified 07-04-2007 end recorded on BLS pr 645/2007. (lend Tos g: 01/16/08 7056) = MM AL Dati covttied 29-00-1976, (Land Tex g: €9/04/03/017), GRID ~e NORTH Moreen Atkins (ar/10 7087039) George Atkins (ois 18/os/esty a Dole Husband (et 5) ~ tes/os/es/ors) Kenrick Cox (tat ©) Mow or Formerty OW aap (ws foaposzo29) decven te Pate twosoapessort) {vo /04/05/e70) Barbados PLAN OF LARD (bordered green, yelow ond brows} al SARGEANTS VILLAGE, CHRIST CHURCH containing tend 67279 sq. m_ (green) Right Of Woy 149.1 sq.m (yellow) Marjorie Porne Road Reserve 144.0 34. m_ (brown) OW tae {e9704/09/015) Total 7021.0 sa. m surveyed for MINISTRY OF HOUSING. LANDS & MANTENANCE certified 26th August, 2021 Set NOT Somuel N Toylor Land Surveyer\nSCALE\n11450\nDetances ore in metros Beorngs are retorted to Grd North denved from D. LS. control 1725 & T3466.\n© Genctes iron found undens ctherene stated © denotes ton put © Gerster » stone found unless otherwise slated © Gentes 1 shane pl © denotes computed point\nJ. A eAlaken pen, ted, ten wenden ewes alang =i shatn—Bnted fencing and guiventied paling lesing wiioed $0 sales pord epasa encroach ante lands af Now or Farmarty Cormaine Alcina {69/04/05/217).\nMand Tax ff: 89/04/05/016 & 017 Fos Larsda ond Sasveyo Dept only\n"
}