{
  "bill_id": 593,
  "slug": "road-traffic-amendment-act-2022",
  "title": "Road Traffic (Amendment) Act, 2022",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b917e70b3246deb7b06915cad218df4b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-02-22",
  "first_reading": "2022-02-08",
  "gazette_date": "2022-02-10",
  "markdown": "2022-02-07\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Road  Traffic  Act,  Cap.  295  to  adjust  the\nrequirements for the production of a driving licence or an identification card when\nrequested to do so by a member of the Police Force or a transport inspector in\nuniform.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nRepeal and replacement of section 74 of Cap. 295\n\nConsequential amendments\n\nCommencement\n\n1.\n\n2.\n\n3.\n\n4.\n\nSCHEDULE\n\nConsequential Amendments\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Road Traffic Act, Cap. 295 to adjust the requirements\nfor the production of a driving licence or an identification card when requested\nto do so by a member of the Police Force or a transport inspector in uniform.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n\nThis Act may be cited as the Road Traffic (Amendment) Act, 2022.\n\nRepeal and replacement of section 74 of Cap. 295\n\n2.\nfollowing is substituted:\n\nSection  74  of  the  Road  Traffic  Act,  Cap.  295  is  deleted  and  the\n\n“Production of driving licence or identification card\n\n74.(1)\nThe driver of a motor vehicle on a public road shall have his\ndriving licence or an identification card in his possession and produce\nit for examination on being required to do so by a member of the Police\nForce or a transport inspector in uniform, so that the member of the\nPolice Force or transport inspector is able to ascertain\n\n(a)\n\n(b)\n\n(c)\n\nthe name and address of the holder of the driving licence;\n\nthe identity of the driver of the motor vehicle; or\n\nwhether the driver of the motor vehicle is licensed to drive\nthat particular class of motor vehicle.\n\nWhere a driver of a motor vehicle does not produce his driving\n(2)\nlicence or an identification card to a member of the Police Force or a\ntransport  inspector  in  uniform,  that  driver  shall  produce  his  driving\nlicence  or  identification  card  at  the  police  station  designated  by  the\nmember of the Police Force or the transport inspector within 24 hours\nof the date on which he was required to produce it.\n\nA person who contravenes subsection (1) or (2) is guilty of an\n(3)\noffence and is liable on summary conviction to a fine of $1 000 or to\nimprisonment for a term of 12 months or to both.\n\n\f5\n\nIn this section, “identification card” means an identification card\nthe  Barbados  Identity  Management  Act,  2021\n\n(4)\nissued  under\n(Act 2021-3).”.\n\nConsequential amendments\n\n3.\nthe manner specified in Column 2 of the Schedule.\n\nThe enactments set out in Column 1 of the Schedule are amended in\n\nCommencement\n\n4.\nthis Act shall come into operation on a date to be fixed by proclamation.\n\nThe amendments directed to be made by section 2 and section 3 of\n\n\f6\n\n L.R.O. 1998SCHEDULE(Section 3)CONSEQUENTIAL AMENDMENTSColumn 1EnactmentsBarbados Identity Management Act, 2021(Act 2021-3) Column 2Amendments1. In section 2, in the deﬁ nition of \"identiﬁ cation card\", delete  the word \"20\" and substitute the word \"10\".2. In the First Schedule  (a) in Part I insert immediately after paragraph 8 the  following:   \"8A. Driving licence number.\"; and  (b) in Part III in the \"Supporting Documents\" column  insert the following:   \"Driving licence\". 3. In the Second Schedule amend the Certiﬁ cate of Registration to include a ﬁ eld referring to the \"Driving licence number.\". 4. In the Fifth Schedule  (a) in Part I insert immediately after paragraph 6 the  following:    \"6A. Driving licence number.\"; \f7\n\n L.R.O. 1998Column 1EnactmentsBarbados Identity Management Act, 2021(Act 2021-3) - (Concl'd)Column 2Amendments (b) in Part II insert immediately after paragraph 6 the  following:    \"6A. Driving licence number.\"; and  (c) in Part III insert immediately after paragraph 6 the  the  following:   \"6A. Driving licence number.\". CONSEQUENTIAL AMENDMENTS - (Concl'd)Schedule - (Concl'd)\f8\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2022.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2022.\n\nPresident\n\n"
}