{
  "bill_id": 596,
  "slug": "resolution-re-the-approval-of-parliament-of-the-charter-of-barbados-2021",
  "title": "Resolution re the approval of Parliament of the Charter of Barbados 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/4ce7d0e312158c7fd9134f37fe7656d9.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-11-24",
  "first_reading": "2021-11-24",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\nPARLIAMENT\n\nRESOLVED that Parliament take note and approve the CHARTER OF\n\nBARBADOS 2021.\n\nAPPROVED  by\n\nthe  House  of  Assembly\n\nthis\n\n  day  of\n\n, 2021.\n\nSpeaker\n\nAPPROVED by the Senate this             day of                                  ,\n\n2021.\n\nPresident\n\n1\n\n\f2\n\n\fCHARTER OF BARBADOS 2021\n\nWE, THE PEOPLE OF BARBADOS, in this 55th year of our constitutional\nindependence,  reaffirming  our  commitment  to  the  fundamental  rights  and\nfreedoms  won  by  those  who  came  before  us,  vow  to  safeguard  these\nachievements for all Barbadians and make the solemn pledge in this Charter of\nBarbados:\n\nPREAMBLE\n\nUNDERSCORING the sanctity of the pledges we make to one another to ensure\na  peaceful,  just  and  equitable  Barbados  whose  wellbeing  is  grounded  in  the\nenfranchisement of all citizens;\n\nRECOGNISING that we are entering into a new chapter of our Independence,\nhaving taken the decisive step of choosing a Barbadian as our Head of State and\nintent on crafting our own Barbadian Constitution;\n\nUNRELENTING in our support for a democracy in which the sovereign power\nresides  in  the  people  in  whose  name  and  for  whose  benefit  the  powers  of\nGovernment are to be exercised;\n\nRECOGNISING this land, its surrounding waters and its peoples as the uniquely\nunifying elements that nurture the soul of our Bajan society;\n\nCELEBRATING with gratitude the indigenous inhabitants of this island, then\nknown as Ichirouganaim, and vowing to honour their memories and preserve\nthe material evidence of their civilisation in our possession;\n\nRECALLING the different journeys and diverse motives of our ancestors, some\narriving to this land in search of new frontiers and exploits; most by compulsion\nand against their will, the vast majority of whom were uprooted from Africa,\nand having survived the horrors of the Middle Passage were condemned to toil\nunder mass enslavement, one of the greatest crimes against humanity;\n\nEMBRACING our diversity while acknowledging we are one people bound by\nlove, respect and a duty of care for one another and our kinship as Barbadians.\n\n3\n\n\fUNDERSCORING the fact that we are all equal by virtue of our humanity, in\nthe eyes of the Creator and according to the laws of this land, regardless of our\nancestry:\n\nCONSCIOUS that the work of dismantling past and present inequities, and the\nbuilding  and  sustaining  of  strong  communities  in  their  place  requires  us  to\nconfront legislatively, morally and sensibly, the problems and difficulties faced\nby our most vulnerable citizens through our daily choices and actions;\n\nAPPRECIATING the legacy of all those numerous Barbadians whose actions\ndistinguished them as true patriots and whose lives of achievement and service\nenrich our history and continue as examples for us to follow;\n\nCHERISHING the foresight of the Fathers of our Democracy and Independence,\nin securing our right to vote, so that we may claim our destiny as an independent\nnation that affirms the principle that we shall be “friends of all and satellites of\nnone”;\n\nCONVINCED  of  the  critical  role  the  further  integration  and  unity  of  our\nCaribbean community must play in fostering closer ties within our hemisphere\nand peace and friendship with all the peoples of the world;\n\nTAKING  INTO  ACCOUNT  the  growing  interdependence  of  the  global\ncommunity,  and  the  international  collaboration  necessary  for  solving  our\ngreatest challenges;\n\nAnd REAFFIRMING our solidarity in the vision of a truly free, independent,\nfair and just Barbados for all;\n\nRESOLVE to adopt the following:\n\nTHE CHARTER OF BARBADOS\n\nArticle I\n\nAll Barbadians are born free and are equal in human dignity and rights\nregardless  of  age,  race,  ethnicity,  faith,  class,  cultural  and  educational\nbackground, ability, sex, gender or sexual orientation.\n\n4\n\n\fHUMAN RIGHTS\n\nWe must always remember the courageous and long struggle of the indigenous\npeoples of our region and of our enslaved African ancestors who fought against\nthe oppressive and inhumane institution of slavery in which this country was\nsettled.    We  are  grateful  for  the  legacy,  bequeathed  to  us,  of  their  cultural,\nartistic,  entrepreneurial,  and  scientific  achievements  carved  out  of  the  bleak\nwasteland that was colonisation and slavery.\n\nOur  people  have  survived  the  trauma  of  enslavement  and  many  withstood\nextreme brutality so we will never forget that freedom and equality are the most\nfundamental  features  of  our  national  identity.    We  therefore  reject,  in  our\ncommunity,  all  forms  of  oppression,  intolerance,  discrimination  and  abuse,\nwhether  economic,  mental,  verbal or  physical  and  we  commit  to  healing  this\nnation and its people from the shame, pain and injustice of slavery on which it\nwas founded;\n\nTOWARDS A JUST SOCIETY\n\nWe  commemorate  the  courage  and  sacrifice  of  all  those  who,  through  the\ncenturies, fought for freedom and justice, especially those who took part in the\nrebellions of 1675 and 1816 which were instrumental to the emancipation of the\nenslaved in 1834; and those of 1876 and 1937.\n\nWe recognise the contribution of those who came to our shores as indentured\nservants from Britain and Ireland and all those who followed later under other\ncircumstances from Asia, Europe and other parts of the world.\n\nWe commit to working in good faith to heal the wounds inflicted on our people\nthrough centuries of enslavement, racism and oppression, in order to reconcile\nthe fractures such inhumanity produced, and to seek reparatory justice and the\neconomic enfranchisement of the systemically oppressed.\n\nWe reflect the intent and spirit to define our national identity and to guide our\nconduct  towards  the  realization  of  our  social  vision.    This  vision  entails  the\ncreation of a truly just and fair society in which all citizens can find personal\nand  collective  satisfaction  through  empowerment,  in  order  to  develop  their\nindividual talents to the fullest benefit of our nation.\n\n5\n\n\fDIVERSITY\n\nWe acknowledge the multi-faith heritage of our society, and we appreciate the\nvalue  added  to our religious  and spiritual  culture by  the  diversity  of  all  faith\ncommunities and spiritual entities, and their continuing capacity to have a strong\nand lasting influence on the quality of life in Barbados.\n\nWe value the cultural diversity brought to our shores by those people who were\nuprooted  or  those  who  arrived  from  near  and  distant  lands  for  religious,\neconomic and other varying reasons.  Together we stand proudly as an integral\npart of the Caribbean civilisation that has given vibrancy to our own national\nidentity.\n\nWe  recognise  the  many  ways  in  which  languages  and  cultures  were  used\nhistorically as tools to separate the peoples of the Caribbean.  We commit to\nstrengthening  our  connections  throughout  our  region  and  the  wider  world\nthrough  learning  and  embracing  the  many  languages  represented.    We\nacknowledge  that  language  cannot  be  separated  from  the  values  of  respect,\ntolerance and cooperation, and are germane to the national vision of nurturing\nglobal citizens with Barbadian roots.\n\nArticle II\n\nEveryone in Barbados has a duty to care for each other and to ensure that\nour  relationships  are  at  all  times  characterized  by  courtesy,  civility  and\nmutual respect.  We remain conscious that every generation is indebted to\nthose generations that preceded it and is morally obligated to the one that\nfollows.\n\nRESPECT\n\nWe  commit  to  resolve  our  conflicts  in  the  spirit  of  tolerance,  respect  and\nacceptance of the diversity found amongst persons and within institutions.\n\nWe pledge to forge a more humane and inclusive society based on the principles\nof love and respect for our fellow man and understanding that our differences\ncontribute to making us who we are.\n\n6\n\n\fWe affirm that our single greatest responsibility of one to another is to safeguard\nand protect the dignity of our common humanity - to be the true keeper of our\nbrothers  and  sisters,  especially  the  elderly,  youth,  differently  abled,  the\nincapacitated and other vulnerable people in our society.\n\nWe  shall  seek  to  strengthen  ties  between  Barbadians  of  all  ages  in  order  to\nenshrine the dignity of and respect for one another.  Understanding who children\nare and the critical role they have in our present and future, we shall prioritise,\nprotect, guide, nurture, heal and love all our children, confident that raising them\nwith such care would provide them with an example of how to raise their own\nchildren,  and  in  effect  create  the  foundation  for  emotionally  stable  and\nresponsible  citizens  and  residents.    We  uphold  family  as  a  key  institution\nthrough which our present and future generations are and shall be nurtured.\n\nEQUITABLE DEVELOPMENT\n\nOur  progress  shall  be  defined  by  our  duty  of  care  to  one  another  which\nrecognises economic enfranchisement, access to food and nutritional security,\naffordable  and  efficient  public  transport,  water,  sanitation,  universal  quality\neducation,  quality  healthcare,  affordable  housing  and  the  provision  of  social\nprotections aimed at eradicating poverty and providing for the most vulnerable\npeople within our society.  This is integral to ensuring an acceptable standard of\nliving, an enhanced quality of life and affording full participation to all citizens\nin the overall development of our country.  We are each other’s keeper.\n\nWe pledge to ensure that our successive elected governments remain mindful\nthat  the  Barbadian  definition  of  growth  and  progress  must  always  be  people\ncentred.  We therefore commit to eliminating poverty through policies of social\ninclusion,  equality  of  economic  opportunity,  ensuring  access  to  essential\nservices and the provision of social protection for the  most vulnerable in our\nsociety.\n\nWe commit as individual Barbadians, to the giving of time, energy and resources\nto our communities and national organisations so that they may increase their\ninfluence as positive change agents in the society.\n\nWe pledge to make the best use of opportunities for our further education, both\nformal  and  informal.    We  shall  encourage  industry,  a  spirit  of  innovation,\nentrepreneurial  endeavour,  sporting  excellence,  artistic  creativity,  media\nliteracy,  critical thinking,  responsible  use  of  technology,  pluri-lingualism  and\n\n7\n\n\fthe development of a culture of lifelong learning within our society.  We commit\nto taking pride in all that we do.\n\nWe  commit  to  building  a  progressive  and  cohesive  society  through  the\nempowerment and full engagement of our youth and communities in the pursuit\nof personal excellence and the social and economic development of Barbados.\n\nWe  acknowledge  the  critical  role  that  Barbadians  by  birth,  by  descent,  by\nmarriage  and  by  choice  have  played  in  our  national  development  and  we\nrecognise the invaluable contribution of the Barbadian Diaspora.  We reflect,\nwith pride, on the past and present accomplishments of all Barbadians, wherever\nthey may be, who remain rooted in our Bajan values and traditions, and who\ngive life to the character of who we are as a people.  We commit to facilitating\nthe continued development and accomplishments of our people.\n\nSOCIAL PARTNERSHIP\n\nWe  acknowledge  the  invaluable  contribution  of  the  Social  Partnership  of\nworkers, employers and government, and of the Social Justice Committee to the\nstability and good governance of Barbados.   We shall strengthen and expand\nthis form of social consensus as an instrument of policy to protect the interests\nof workers, investors and consumers while improving the competitiveness of the\neconomy as part of our national development.\n\nWe urge that relations within the workplace be based on fairness, mutual respect\nand dignity so as to enhance the goals of the organisation and the wellbeing of\nits constituents.  Workers and the trades unions are indispensable partners in our\neconomic prosperity.  Equally so are those who take the risks to invest in the\nproduction of goods and services.\n\nWe pledge in our employment relationships to strive at all times to create an\nenvironment  of  decent  work,  to  follow  established  industrial  relations  best\npractices, to maintain service excellence, to ensure quality of production and in\ngeneral to work together with pride to increase the productivity and efficiency\nof the enterprises with which we are associated.\n\nWe commit to working towards a more efficient and more transparent public\nsector  that  places  our  citizens,  residents  and  visitors  at  the  centre  of  service\ndelivery, which meets their expectations and facilitates the equitable growth and\ndevelopment of our country.\n\n8\n\n\fArticle III\n\nEvery Barbadian has the right and a duty to participate in the economic,\npolitical and social life of Barbados as an expression of active citizenship.\nEvery Barbadian has the right to vote and seek public office in accordance\nwith the Laws of this country.\n\nDEMOCRACY\n\nWe acknowledge the establishment of a Barbados Parliament in 1639 and the\nCharter of Barbados made at Oistins in 1652.\n\nthe  masses  and\n\nWe affirm the fact that a Parliament has met without interruption since 1639.\nWith its changing composition over the years, it has been a tool of oppression\ninstitution  of  empowerment  and\nagainst\nenfranchisement.  Parliament enacted legislation to end slavery, to give us the\nright to vote, to protect the rights of workers, to undertake an aggressive reform\nof ownership of our tenantries, and to establish our political independence and\nrepublican status.\n\nlater  an\n\nWe  celebrate  the  unique  part  played  in  our  history  by  each  of  our  National\nHeroes for the betterment of some aspect of the lives of Barbadians and for their\ncontribution  to  our  national  development,  through  the  expression  of  courage,\nsacrifice and the attainment of excellence.\n\nWe cherish the legacy of all those numerous Barbadians, heroes in their own\nright,  whose  actions  distinguish  them  as  true  patriots  and  whose  lives  of\nachievement and service enrich our history and continue as examples for us to\nfollow.\n\nWe champion in our nation and across the world democratic freedoms, human\nrights, the rule of law, and the peaceful resolution of all conflicts.\n\nWe affirm, principally by our own self-discipline and respect for the rule of law,\nsupport for our law enforcement agencies as they endeavour to rid our society\nof  all  crime,  whether  of  violence,  human  trafficking,  illegal  drugs,  financial\ncrimes including bribery and other forms of corruption, lawlessness and abuse.\nWe acknowledge our duty as individual Barbadians, to work with and support\nour law enforcement agencies.\n\n9\n\n\fWe shall promote the right of access to information and the right to freedom of\ncommunication  and  expression,  provided  always  that  there  is  protection  of  a\ncitizen’s personal data and that social or other media shall be respectful of the\nrights and reputation of citizens.\n\nWe  agree  to  adhere  to  the  basic  tenets  on  which  the  rights  and  liberties  of  a\nrepresentative  democracy  are  founded  in  order  to  ensure  that  there  is  a  full\nunderstanding of the role and function of civil society and the values that bind\nus as a people.  We commit to active citizenship by participating in aspects of\nnational development.\n\nArticle IV\n\nEveryone has the right to live in a healthy and balanced environment and\nhas a duty to participate in its preservation, conservation, enhancement and\nregeneration.  We appreciate the defining importance of our land and sea\nto our identity and way of life, and therefore also pledge to protect the free\nand unrestricted access to all our beaches and public spaces, which is an\ninalienable right of every Barbadian.\n\nENVIRONMENT, SUSTAINABLE DEVELOPMENT\nAND RESILIENCE\n\nWe  acknowledge  the  climate  crisis  and  our  duty  to  be  world  leaders  in  the\npromotion of and agitation for global recognition of this clear and present danger\nto our lives and livelihood. We pledge to adopt innovative policies and programs\nto adapt and mitigate against our inherently vulnerable circumstances to build\nresilience and ensure our survival as a people and country.\n\nOur  public  policies  shall  promote  sustainable  development  through  the\nprotection and enhancement of the environment in all aspects of our economic\nand social progress.\n\nWe commit to be responsible stewards, to respect and protect our unique and\nvulnerable  natural  and  built  environment,  ensuring  that  the  actions  taken  to\nsecure the needs of our present generations also safeguard the rights of future\ngenerations of Barbadians to meet their own needs.\n\n10\n\n\fAs  a  Small  Island  State,  we  recognise  the  vulnerability  of  our  economy  and\nsociety to external factors.  We therefore commit to expanding our support of\nlocally produced goods and services for our local consumption and exportation.\nWe realise that by establishing ourselves as both creators and consumers of high\nquality products and services, we will secure that level of national development\nwhich will benefit the entire society.\n\nWe acknowledge the historical trauma associated with our relationship to the\nland and sea.  Hence, it is our responsibility to repair this relationship for current\nand future generations of Barbadians,  and to ensure that it is defined through\nownership, enfranchisement and access.  We fully appreciate the importance of\nour  land  and  sea  to  our  livelihoods  and  quality  of  life,  and  we  shall  forever\nembrace the quintessential heritage of our island home.\n\nWe  commit  to  the  protection  of  our  land,  air  and  marine  environment,  in\nparticular our gullies and coral reefs, through progressive public policies which\nsupport education, research and innovation, leading to their regeneration for the\nbenefit of all.\n\nWe  commit  to  expressing  our  Barbadian  culture  and  heritage  and  our  values\nwith  unbridled  confidence,  and  we  acknowledge  that  our  authenticity  as  a\ncaring,  just,  respectful  and  inclusive  people  is  at  the  heart  of  our  social,\nenvironmental and economic development.\n\nArticle V\n\nBarbados is part of a global community and strong international relations with\nother states is vital to national development. As a Small Island State we must\nexist  harmoniously  with  others  and  work  collaboratively  to  preserve  global\npublic goods. We will honour our international obligations while championing\nthe causes that are important to safeguarding the future prosperity and stability\nof Barbados and the Caribbean.\n\n11\n\n\fENGAGING THE WORLD\n\nHistorically Barbados has made significant contributions to global dialogue on\nmatters pertaining to Small Island Developing States, rooting its foreign policy\non the principles of dynamic, moral strategic leadership.  We further commit to\nstrengthening  our  international  relations  recognising  that  the  challenges  and\nsolutions  of  sustainable  development  are  the  collective  responsibility  of  our\nglobal village, and must be addressed through dynamic and ethical leadership,\nglobal action and collaboration among states.\n\nMULTILATERALISM\n\nBarbados reaffirms its commitment to the principles and values enshrined in the\nCharter of the United Nations.  We commit to multilateralism as a platform for\nadvocacy  to  achieve  the  global  public  goods,  and  as  a  platform  to  build\nconsensus on the major challenges confronting the global community.\n\nSOUTH–SOUTH COOPERATION\n\nWe  commit  to  deeper  cooperation  among  countries  of  the  Global  South\nrecognising  that  we  must  move  beyond  our  traditional  North  Atlantic\ndiplomacy.    We  commit  to  creating  mutually  beneficial  relationships  with\ncountries  in  the  developing  world  to  facilitate  technical  cooperation,  market\ndiversification  through  commercial  diplomacy,  and  cultural  and  social\nexchanges.\n\nREGIONALISM\n\nWe  reaffirm  our  support  for  regional  integration  through  the  Caribbean\nCommunity (CARICOM) recognising the critical importance of this institution\nto the advancement of our Caribbean civilisation.\n\nCONCLUSION\n\nWe, the people of this great nation Barbados, encouraged by the resilience and\ningenuity of those who came before us, stand on the threshold of a bright future\nand  we  boldly  embrace  and  solemnly  affirm  the  aspirations  contained  in this\nCharter of Barbados.\n\n12\n\n\fMay the hope it engenders permeate the length and breadth of this nation and\ndistinguish it as a land of equal opportunity and enfranchisement, fairness and\nsocial justice, peace and security, and solidarity and cooperation.\n\nMay the commitment we now champion, progressively foster and nurture the\n‘Soul of our Nation’ from generation to generation.\n\n13\n\n\fAPPENDIX I – REFERENCES\n\nviii.\nix.\nx.\n\ni.\nii.\niii.\niv.\nv.\nvi.\nvii.\n\n1979 Report of the Cox Review Commission\n1998 Report of the Forde Commission\nConstitution of Barbados\n2004 Draft Constitution (Amendment) Bill\n2021 Discussion Draft Constitution (Amendment) Bill\nHuman Rights and Constitution Making, 2018, United Nations, OHCHR\nConcluding  Observations  –  Barbados,  Committee  on  the  Elimination  of  Racial\nDiscrimination (CERD) 2007\nSummary Record 2005 CERD Barbados Session\nBarbados State Party Report, 2004 to CERD\nBorn Free and Equal: Sexual Orientation, Gender Identity and Sex Characteristics in\nInternational Human Rights Law, 2019, United Nations, OHCHR\nxi.\nThe Congenital Eunuch: A Medical Halachic Study, 1995, Barth, J. and Zemer, M.\nxii.\nConstitution of the Cooperative Republic of Guyana\nxiii.  Constitution of the Republic of Trinidad and Tobago\nxiv.  Constitution of the Commonwealth of Dominica\nxv.\nxvi.  Constitution and Environmental Charter of the French Republic\nxvii.  Constitution and Charter of Canada\nxviii.  Constitution of the Republic of India\nxix.  Commonwealth Caribbean Law and Legal Systems, 2008, Belle Antoine, R.\nxx.\n\n Global Excellence: Barbadian Traditions. The National Strategic Plan of Barbados\n2006-2025\n1652 Charter of Oistins IN History of Barbados by Robert Schomburgh\n\nxxi.\nxxii.  Report of the National Commission on Law and Order by Sir Roy Marshall: Chapter\n\nConstitution of the Republic of South Africa\n\n2 -Constitutional Support for a Just Society\n\nxxiii  Public Submissions on the Proposed Charter of Barbados\n\n14\n\n\fAPPENDIX II – PUBLIC SUBMISSIONS\n\nxxiv  The  Supremacy  of  God:  The  first  is  the  complete  removal  of  the  most  important\nsentence  in  our  preamble  to  the  Constitution.    Namely,  that  we  acknowledge  the\nsupremacy of God.  Why have you taken that important sentence out of a document\nthat may replace the preamble?\n\nxxv.  Promotion of False gods: Barbados is not a theocracy.  People can believe what they\nwish and be free to convince others of their beliefs without penalty or discrimination.\nBut the standard of the majority should be set.  If we become a majority of Muslims\nor Hindus, then they will set their standard and the minority Christians will likely be\npersecuted  as  is  happening  in  almost  every  country  where  Christians  are  in  the\nminority.  Why are you facilitating foreseen persecution?\n\nxxvi.  Equal  Rights:  You  plan  to  assign  equal  rights  based  on  age,  gender  and  sexual\norientation.  Clearly a 5-year-old is not allowed to drive in Barbados.  Therefore, they\nare not treated equally.  So, it needs to be rethought.\n\nxxvii.  This is a classic example of what happens when you try to recreate the wheel.  The\nbetter approach would be to present the current preamble to the Constitution, and then\nlet people suggest improvements for discussion, rather than trying to create something\nentirely new – as if the old had no value whatsoever and is irredeemable.  That is a\ndangerously reckless approach to such an important matter.\n\nxxviii.  On the gender and sexual orientation issues, we see what happened in the US, where\nthose provisions were mainly used to  persecute  Christians.   We also  see the Trans\ngender issue is forcing females to compete with males in female sports.  Why would\nyou want to bring that confusion to Barbados at this time?\n\nxxix.  Promoting  Division:  There  is  repetitive  theme  of  social  and  reparatory  justice  and\nhealing the wounds of slavery.  Part of it reads like the communist/socialist manifesto,\nwhich have failed everywhere they have been tried.  So, why are we trying them here?\nThe only way to heal hurt is to forgive.\n\nxxx.  To what extent does economic vulnerability and dependence on foreign aid limit our\n\nability to think and act independently and to forge a unique Barbadian identity?\n\nxxxi.  To what extent does the need for such things as food security, foreign investment and\n\na vibrant tourism industry curb our cultural autonomy?\n\nxxxii.  How do we maintain a pragmatic balance between the often-conflicting realities of\neconomic  dependence,  global  interdependence  and  our  own  independence  as  a\ndeveloping nation?\n\nxxxiii.  Understanding where we were, where we are and where we want to go, will empower\n\nus to work towards a common goal as citizens despite our differences.\n\nxxxiv.  Comments on Preamble:\nxxxv.  Paragraph  7  of  the  Preamble  rightly  affirms  that  we  are  all  created  equal.    The\nreference to ‘The Creator’, suggests a generic theism that is non-aligned.  As a Bible-\nbelieving  Christian  I  would  prefer  the  term  ‘God’  to  characterize  the  country  as  a\ndecidedly Christian nation.   However, since  citizens  adhere to  different  faiths, this\nnon-alignment is understandable within a secular context.\n\n15\n\n\fxxxvi.  Paragraphs  8,  9  and  10  could  be  re-ordered  (10,  8,  9)  so  that  the  final  focus  is  on\n\nBarbados and segues into Paragraph 11 and the Articles that follow.\n\nxxxvii. Comments on Article 1\nxxxviii The preamble to the draft Charter reaffirms our commitment to fundamental rights\nand  freedoms.    In  1948,  when  the  Universal  Declaration  of  Human  Rights  was\ncodified,  there  was  a  tacit  agreement  about  the  rights  and  freedoms  that  were\nfoundational to harmonious living among persons and nations of diverse backgrounds\nand persuasions.  Today however, there is controversy largely between the developed\nand developing countries as to what rights and freedoms are, in fact, ‘fundamental’.\nxxxix  I  fully  agree  that  all  Barbadians  are  born  free  and  equal  despite  any  differences\ncontingent  upon  birth,  beliefs,  fortuitous  circumstances,  background  or  lifestyle.\nHowever,  I  suggest  that  the  term  ‘sexual  orientation’  not  be  included  among  the\nspecific  categories  listed.    Reasons  are  as  follows:  a.  The  term  is  rooted  in  the\nscientifically inaccurate beliefs that: i. sex is non-binary, and gender is fluid; that is,\nthat there is not only male and female but an indeterminate number of sexes and there\nis logically no one-to-one correspondence between sex and gender, ii. it is possible\nfor an individual to change their sex and iii. biological and physical characteristics\nresulting  from  chromosomal  pairs  XY  and  XX  do  not  indicate  sex;  this  is  merely\n‘assigned’ at birth on the basis of genitalia.  As a maturing country, it would be folly\nfor us to embrace this counter evidence-based assumption.  My suggestion is that, in\nconsidering the term ‘sexual orientation’, we adopt the COVID19 approach: follow\nthe science and act out of an abundance of caution.  b. The term ‘sexual orientation’\nis specific to sexual rights philosophy.  Unlike other terms such as sex, gender, age,\nclass,  faith,  ability,  cultural  and  educational  background,  it  is  not  value  neutral.\nInclusion of the term in the proposed Charter suggests that as a nation we embrace\nsexual rights as a guiding philosophy even though we have not yet had any rigorous\nnational dialogue on the matter.  Since 2001 and over the last decade, we have had\nexamples of the litigation, suppression and violation of traditional human rights that\naccompanies acceptance of the notion of ‘sexual orientation’.  We have seen the logic-\ndefying implications for education, labour, health and sports.  For example, in 2019\nthe World’s Women’s Cycling Championship was won by a biological male.  If the\nterm  ‘sexual  orientation’  is  to  be  included  in  the  Charter,  this  should  be  with  full\nunderstanding  of  its  sometimes-bizarre  ramifications.    The  adage,  look  before  you\nleap, is apt in this case.  In Caribbean parlance, I would say, let us not push our heads\nwhere our bodies can’t pass.  c. The term should not be included in the Charter because\nit  sets  a  precedent:  i.  Why  should  sexual  orientation  be  highlighted  as  a  separate\ncategory and not ‘age orientation’, ‘race orientation’ or ‘class’ orientation?  Are there\nboundaries  to  sexual  orientation,  if  so,  what  are  they  and  what  is  the  rationale  for\nsetting such boundaries? ii. The term is loosely defined and ever-evolving.  The World\nHealth  Organization  identifies  3  elements  of  sexual  orientation:  sexual  attraction,\nsexual behaviour and sexual identity.  In some countries, acceptance of the term has\npaved the way for legal incest.  According to a 2018 article written by James Cox and\npublished in the Scottish Sun, “Consensual incest is fully legal in Spain, Russia, and\nis\n\nPortuguese\n\nprohibited\n\nstrictly\n\nunder\n\nnot\n\nlaw.\n\n16\n\n\fxl.\n\nxli.\n\nThere  is  also  no  law  prohibiting  consenting  relatives  from  having  sex  in  France,\nBelgium and Luxembourg.  In Italy, incest is illegal only if it provokes public scandal\n- when it can suddenly become punishable from two to eight years in jail.”  The fluid\nconcept  of  sexual  orientation  can  logically  be  extended  to  include  pedophilia.    In\nAustralia,  Italy,  the  USA,  UK,  Canada,  Switzerland,  Norway  and  a  few  other\ncountries, currently there are groups advocating for the recognition of pedophilia as a\nsexual orientation and therefore a fundamental right and freedom.\nThe inclusion of the term ‘sexual orientation’ in the Charter is prejudicial to that sector\nof society that subscribes to the sanctity of marriage and to those of us who see the\nconcept  as  fodder for the deconstruction of marriage and the family, and the risky\nreconstruction  of  both.    Perhaps  it  can  be  replaced  by  a  neutral,  all-encompassing\nphrase  such  as  ‘or  any  other  distinguishing  feature.’    This  should  be  sufficient  to\nsatisfy those who believe that there is such a thing as sexual orientation and those who\ndo not.  Moreover, it is consistent with the way in which the Charter has tried to be\ninclusive  by  using  the  generic,  non-aligned,  non-committal  term,  ‘Creator’  in\nParagraph 7 of the Preamble.\nComments on Article 11 Paragraph 3 under the topic ‘Respect’ makes mention of the\nfamily as “the key institution … that shall nurture future generations.”  There is no\ndefinition of family and no mention of marriage.  In the current sociopolitical sexual\nrights climate where there is no consensus among nations as to the definition of these\nformerly  straightforward  terms,  it  is  important  in  any  formal  document,  to  clearly\narticulate Barbadian values regarding these two core institutions of society.  I would\nlike to see Barbados, like Hungary, declare itself a family-friendly country and with\n“unbridled  confidence”  define  marriage  as  a  union  between  a  biological  male  and\nbiological female.\n\nxlii.  Comment on Articles 3 and 4: As pointed out by previous submissions, these are well\nconceptualized and with the suggested inclusions and modifications, provide a firm\nbasis for framing laws within the post-Republic Constitution.\nIn  the  spirit  of  this  proposed  Charter,  I  fully  anticipate  that  all  participants  in  this\ndiscussion will have not only an equal voice but also an equal ear.\n\nxliii.\n\nxliv.  All Barbadians are conceived and born free and are equal in human dignity and rights.\nReason: The unborn in the womb is in need of recognition and protection; There is no\nneed for categories listing.  ‘All Barbadians’ is an inclusive statement; The document\nshould close with Thanksgiving to God; Barbadians need to be reminded that we have\nnot gotten where we are without divine help and need to be conscious that preservation\nof  gains  are  in  God’s  hands;  Those  acknowledgements  should  be  acceptable  to\neveryone irrespective of their conceptualization of God.\n\nxlv.  The atheists may object but even he is his own God and based on the document is free\n\nxlvi.\n\nto thank himself.\nI  start  from  the  perspective  that  all  people  are  equal  and  deserve  their  rights  and\ndignity  by  virtue  of  being  human,  and  for  no  other  reason  than  that.    With  that\nperspective,  nothing  in  our  national  aspirational  or  inspirational  documents  or\n\n17\n\n\fsymbols should use language or ideas that exclude or marginalize any person or group\nof persons.  I am an atheist.  My atheism is not an assertion that there is no god because\nlogically, it’s impossible to prove a philosophical negative.\n\nRather, it’s the rejection of the strident but unprovable assertion by most people that\na god or gods exist.  It is rather painful to be treated as a second- or third-class citizen\nin my own country because of my philosophical position.  Unfortunately, our National\nAnthem  refers  to  the  Lord being the people’s  guide.    But,  as an  atheist,  how am  I\nsupposed to feel, other than excluded, by such sentiments being thus enshrined.\n\nxlvii.  It  would  be  very  useful  if  the  paragraphs  were  numbered  appropriately  so  that  the\n\nsections and paragraphs could be easily referenced.\n\nxlviii.  Preamble Paragraph 7 asserts as a fact that “. . . we are all equal in the eyes of the\nCreator”,  but  from  whence  do  we  derive  the  assertion  that  there  is  a  “creator”,  or\nfurther that he sees us all as equal.  The history of religion and the scriptures of most\nreligions prescribe very different treatment for different classes of people based on\ngender,  race,  social  status,  religious  faith,  etc.    Why  is  the  assertion  necessary,\nanyway?\n\nl.\n\nxlix.  Likewise, the same paragraph seems to suggest that we are equal because of the laws\nof the land.  However, our equality derives from our humanity.  In the past, our laws\nallowed slavery, the unequal treatment of women, etc. So, our laws must be crafted to\nensure that our human equality is assured.  The laws must be derived from this fact,\nnot the other way around.\nArticle  1  –  The  preamble  to  this  section  is  a  bit  troubling.    It  mentions  age,  race,\nethnicity,  faith,  class  cultural  and  educational  background,  ability,  sex,  gender,  or\nsexual orientation as the basis for our rights and dignity.\nI have perused the document with meticulous care and every scruple of integrity but\non reading Article 1, I am left in in complete ignorance as to what is sexual orientation\nsince you have itemized sex and gender.\n\nli.\n\nlii.  WHY MUST SUCH AN EXPRESSION BE DRAGGED ALONG SUCCINTLY AT\n\nliii.\n\nTHE END OF THAT SENTENCE.\nThat should be removed with immediate haste for it seems to lessen the quality of our\npeople as we move into the status of becoming a republic.\n\nlv.\n\nliv.  Was such an expression in our original constitution if it was not there before how can\nit be attached now.  Should not our people have a say in such a pertinent matter.\nThe proposed Charter of Barbados is a thoughtful encapsulation of the ideal Barbados\nwhich  citizens  should  work  towards,  both  separately  and  together.    Family-Faith-\nFreedom,  Barbados,  commends  the  Advisory  Committee  for  developing  this\nconceptual framework which can effectively unite us despite our many differences,\nand can steer us on to, and keep us on a firm path of progress.\n\nlvi.  We suggest that the Preamble include the following paragraph: “COGNIZANT of the\nreality that  future  generations of Barbadians  will be shaped by the children of this\ngeneration  and  the  next,  we  will  strive  to  ensure  that  our  children  are  raised  to  be\nrespectful,  civicminded  and  to  uphold  wholesome  values  that  are  grounded  in\ngodliness and truth.”\n\n18\n\n\flvii.  Article  1  speaks  of  intrinsic  human  dignity  and  rights.  We  recommend  that  it  also\nunderscore the sanctity of human life from conception, through birth, life and natural\ndeath.\n\nlviii.  The use of the word ‘Creator’ – as opposed to ‘God’ in Paragraph 7 of the Preamble,\nsignals a departure from a Judeo-Christian anchor and an orientation towards secular\nhumanism.    We  consider  this  unfortunate  and  recommend  that  this  decision  be\nrevisited.  We respectfully ask that the reference to ‘the Creator’ be rephrased as a\nreference to ‘God’ or ‘The Lord’.\n\nlix.  We  acknowledge  the  detailed  explanations  given  by  a  member  of  the  Committee\nregarding the validity of, and the need to protect the values of sex, gender and what\nhas  been  termed  ‘sexual  orientation’  within  the  context  of  human  rights.    We\nrespectfully submit however, that sex and gender are clearly defined values; sex being\nthe  biological  differentiation  between  male  and  female,  and  gender  being  a\nsociological  construct  largely  derived  from  common  sense  responses  to  these\ndifferences.    We  categorically  reject  the  notion  that  sexual  orientation  is  a  human\nright.    No  other  human  right  is  out  of  sync  with  nature.    The  World  Health\nOrganization  identifies  3  elements  of  sexual  orientation,  one  of  these  being  sexual\nattraction.  What if an individual’s ‘sexual orientation’ is towards adult to child sex,\nhuman  to  animal  sex,  child-parent  sex  or  involves  any  other  attraction  such  as\nnecrophilia?  Are there boundaries to sexual orientation?  If so, what circumscribes\nthese  boundaries?    If  an  individual’s  ‘orientation’,  that  is,  their  natural  attraction,\npreferred behaviour and self-identity is to be deemed a fundamental human right, why\nshould  this  be  limited  to  sexual  orientation  and  not  be  extended  to  include  class,\neducational background, ethnicity or any of the other categories listed in Article 1?\nGiven the tenuous definition of the term, we unequivocally request the non-inclusion\nof sexual orientation as an intrinsic value in the Charter and Constitution of Barbados\nand in the related laws and statutes.\nFAMILY:  We  agree  with  the  main  tenets  of  Article  2.    This  Article  addresses  the\nimportance of human capital and, among other things, speaks to the desirability of\nforging  mutual  bonds  of  respect  and  dignity  among  citizens  of  all  ages  and\npersuasions.    We  especially  applaud  the  recognition  of  the  family  as  “the  key\ninstitution  through  which  our  present  and  future  generations  are  and  shall  be\nnurtured.”  Article 16.3 of the Universal Declaration of Human Rights states that “The\nfamily is the natural and fundamental group unit of society and is entitled to protection\nby society and the State.”\n\nlx.\n\nlxi.  We propose that Barbados declare itself a Family-Friendly Country (similar to what\nHungary has done).  As a small island developing state with limited natural resources,\nit is critical that the country provide an enabling environment for the development of\nhuman capital including Government support via the following: a. A family-friendly\nlabour code that considers childcare, job protection for nursing mothers, child welfare\nmeasures and in general, practical, innovative measures for the reconciliation of work\nand  family.    A  sound  educational  system  that  provides  accurate  information  about\nhuman  sexuality  and  sexual  health  as  part  of  the  existing  Health  and  Family  Life\nEducation regional curriculum; b. A deliberate inculcation of civic morality among\nyouth via a national youth service, mandatory to those school leavers who are neither\n\n19\n\n\femployed  nor  enrolled  in  further  vocational  or  academic  education  after  a  year  of\nleaving school.\n\nlxii.\n\nFAITH:  Paragraph  7  of  the  Preamble  subscribes  to  the  notion  of  a  ‘Creator’.    An\nintelligent  Creator  creates  with  design  and  purpose.    However,  there  is  an  internal\ncontradiction in Article 1 which overlooks both design and purpose in creation, by\ninclusion  of  the  term  ‘sexual  orientation’.    This  inclusion  is  far  reaching  and\nundermines  marriage  and  family,  the  two  key  institutions  of  society.    The  social\nbenefits  of  marriage  and  a  stable  family  life  are  values  upheld  by  Christianity  and\nother Faiths within our country.\n\nlxiii.  FREEDOM The Preamble to the Charter reaffirms solidarity in the vision of “a truly\nfree, independent, fair and just Barbados for all”.  The vision is noble and necessary.\nYet,  although the document  speaks liberally about  related concepts  such as human\ndignity, equality, and justice, there is a certain incongruity in the way it promotes the\nauthenticity of one’s mirror image.  What is upheld as desirable in forging a unique\nnational identity is denied as important when it comes to accepting self.  True freedom\nmust be morally and sensibly circumscribed and built on a foundation of truth.  There\nis little difference whether that truth be the legacy of slavery at a national level, or, at\nan individual level, the biological facts of sex and inherent characteristics.\n\nlxiv.  We  should  aspire  to  a  nation  where  respect,  compassion,  care,  fairness  and\ncooperation are evident in all that we do.  A nation where our prisons are empty and\nevery person is fed and sheltered; where the sick and elderly are cared for and every\nperson who is capable of working is working assiduously to preserve the quality of\nlife we have determined for ourselves.\n\nlxv.  To actualize such an aspiration our children must become our priority.\nlxvi.  Children are, not only our offspring, they are the torch bearers of tomorrow that we\n\nbring to this earth.  How we treat them is an indication of our regard for our future.\n\nlxvii.  They each arrive here with a purpose and though, in large measure, we have lost those\npractices that allow us to learn who they are and how they should be guided and taught\nto fulfil their purpose, we are obliged to protect, nurture, guide and truly love them.\nThat is indeed part of our individual obligation as parents and our collective obligation\nas the village, the community and the society.\n\nlxviii.  In their young years they are tender and therefore must be cared for with a reverend\nspirit.  They have only just arrived from the spirit world; there is no disputing that\nidea; it is a fundamental understanding that runs through all spiritual belief systems.\nThat is who children are.\n\nlxix.  Many children come bearing their torches, we see them – if we refer to them as bright,\nold for their  years, wise, even “rude”  – we see them.  There are here to  illuminate\naspects of our lives that we need to examine, correct and enhance.  They are here to\nteach us and assist us in our growth so that we too fulfil our purpose.  We in turn, for\nwhat  we  should  have  learnt  (by  the  time  they  arrive)  must  apply  wisdom  in  our\ndealings with them.  We are to set the example for them to follow and build upon\nbecause they will be the ones stepping into the future.  Their role is critical – we must\nrespect them and be mindful of how we interact with them.\n\n20\n\n\flxx.  Being an example of good and noble character ensures us a responsible and stable\nfuture.   Our  children  – if the right  foundation is  laid, will raise their children with\nrespect and the nobility of character we demonstrated in raising them.\n\n“Specifically religious language is problematic”\n\nlxxi.\nlxxii.  “instead of faith, say belief”\nlxxiii.  “religion or lack thereof”\nlxxiv.   “use creed”\nlxxv.  “remove  creator”:    “Use  of  the  ‘Creator  ‘immediately  alienates  those  who  do  not\nbelieve that humans were not created by any one entity.”  “What about polytheistic\nreligions?”  ‘If the use of ‘Creator’ makes a segment of the population feel excluded,\nwhy include it?  There are other ways to convey the concept of equality.\n\nlxxvi.  There was a general wariness of the family being mentioned without making it explicit\nthat family does not just mean a nuclear heterosexual family.  There needs to be a\nrecognition  of  different  family  types  like  multigenerational  households,  chosen\nfamilies, non-heteronormative families etc.\n\nlxxvii.  All references to ‘brothers and sisters’ throughout the document should be replaced\n\nwith gender-neutral language.\n\nlxxviii. The  reference  to  ‘fathers’  in  the  preamble  is  unnecessarily  gendered  as  those\ncategorised as women contributed, albeit more behind the scenes and uncredited work.\nIf ‘fathers’ is meant to refer to Errol Barrow and Grantley Adams specifically, this\ncould be made explicit.\n\nlxxix.  Not just racial or socio-economic oppression.  Oppression based on sexual orientation\nthrough laws.  No explicit recognition of the marginalization as a result of intersecting\nfactors  e.g.  poor,  undereducated,  transgender  women  with  disabilities  has  very\nspecific vulnerabilities which are inextricably linked.\n\nlxxx.  There  were  strong  feelings  on  this  point.    It  is  factually  incorrect  to  state  in  the\npreamble that we are equal according to the laws of the land.  There are laws which\ndo not reflect the fact that we are equal.  Furthermore, equality does not stem from the\nlaws.  It’s the other way around, the laws should reflect equality.\n\nlxxxi.  All  individuals  and  organizations  consulted  felt  very  strongly  about  the  use  of\n‘tolerance’.    It  was  agreed  that  the  term  ‘inclusion’  should  replace  tolerance  and\naccompany respect  each time it is mentioned because in  order to  earn respect,  one\nmust be included.  While it was understood that the primary definition of ‘tolerate’\nhas neutral to positive connotations, the secondary definition does not.\n\nlxxxii.  “Barbados’  discrimination  against  our  Caribbean  and  Latin  American  neighbours\nespecially  when  it  comes  to  immigration  and  residency  must  end.    We  are  all  too\nwilling to allow citizens from wealthy countries to flout our laws while we replicate\ntheir worst behaviour when it comes to discrimination against those from countries\nwe deem “lesser”.”  “Diversity is a valuable resource”.  “We should uphold equality\nwith immigration laws and protect the rights of citizens and those married to citizens\nas well as the wider global community.”  “I recommend that the leaders of Barbados\n\n21\n\n\fproceed with caution on this issue regardless of sexual orientation, because our system\nis already challenged with how to equitably take care of their own citizens, first”.\n\nlxxxiii. It  was  felt  that  we  as  a  marginalised  community  must  highlight  the  fact  that\nxenophobia is much too common in Barbados.  We must also acknowledge that too\nmany  of  us  seek  refuge  elsewhere  because  they  feel  unable  to  live  full  lives  in\nBarbados.  Therefore, there is consensus that the Charter should explicitly state that\nwe  will  uphold  the  fundamental  equality  and  human  dignity  of  all  within  our\njurisdiction (so inhabitants, Barbadians and residents).\n\nlxxxiv. It  was  felt  that  the  section  that  mentions  the  Social  Partnership  and  Social  Justice\nCommittee should make it clear that it is about protecting the interest of Barbadians\nand those who live here, not just consumers.\n\nlxxxv.  “Right to assessments and fair academic accommodations for children with learning\ndisabilities” “Children didn't choose to be here; they should be protected at all costs”.\nlxxxvi.  “As a nation we have unfortunately normalized  the harsh punishment for children\nmore than we normalize and stride to protect them from discrimination especially on\nthe grounds of their indecisive sexual orientation status.”  “I recommend that human\nchildren be recognized as human children based on their age category by law.\nlxxxvii  “Disabled  children  should  have  access  to  free  primary,  secondary  and  tertiary\n\neducation like other children.”\n\nlxxxviii  “Juvenile  laws  should  be  diverse  and  specific  and  wholly  intent  on  protecting\n\nchildren and not criminalising them.”\n\nlxxxix  “I don't believe children should be raised by same sex couples at all.”\nxc.\n\nThere was concern that children were not explicitly mentioned.   If we are to move\naway  from  “children  must  be  seen  and  not  heard”,  they  must  be  included  in  the\nCharter.  Children must have a voice regarding their wellbeing and their right to also\nparticipate in civic life must be acknowledged.  There was also a concern that if the\nrights of the child are to be mentioned, it should be made clear that LGBTQ+ children\nhave the same rights as other children.  There is also the issue of the assumption that\nLGBTQ+  children  have  been  pressured  or  influenced.    However,  from  our  own\nexperience  as  LGBTQ+  children  and  from  our  interactions  with  LGBTQ+  youth,\nchildren  have  agency  and  are  well  aware  of  who  they  are.    This  should  be\nacknowledged and respected.\nIt was agreed that there was not enough emphasis put on the fact that the environment\nshould be protected whether or not there are direct and easily quantifiable benefits to\nus as human beings.  We have a duty to do as little harm as possible and to preserve\nbiodiversity.  The section on the environment needs to be fleshed out more and the\nfocus should be expanded beyond anthropocentricity.\n\nxci.\n\n22\n\n"
}