{
  "bill_id": 59,
  "slug": "electronic-filing-bill-2014",
  "title": "Electronic Filing Bill, 2014",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/5ddd513a154dda4c701dd125f72b399e.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2014-11-12",
  "first_reading": "2014-11-12",
  "second_reading": "2014-11-11",
  "gazette_date": "2014-11-24",
  "passed_date": "2014-12-17",
  "markdown": "2014/09/25\n\nOBJECTS AND REASONS\n\nThis  Bill  makes  provision  for  information,  forms  and  documents  to  be\n\nelectronically filed with the Registrar in respect of a person or legal entity.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nElectronic filing\n\nFormat for electronic filing\n\nElectronic format of information\n\nOn-line access to electronic database\n\nTime of receipt\n\nRegulations\n\nAmendment of Schedule by Order\n\n10.\n\nCommencement\n\nSCHEDULE\n\nDesignated enactments\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  make  provision  for  information,  forms  and  documents  to  be\n\nelectronically filed with the Registrar in respect of a person or legal entity.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Electronic Filing Act, 2014.\n\n\f4\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“designated enactment” means an enactment listed in the Schedule;\n\n“electronic filing with the Registrar” means the filing of information, forms or\ndocuments that are required to be filed by a person or a legal entity under a\ndesignated  enactment  in  an  electronic  or  other  machine-readable  format\neither by optical scanning, by direct electronic transmission, or by key data\nentry in one or more databases established or operated by the Registrar;\n\n“legal  entity”  means  a  business  or  other  entity  registered  under  the  relevant\n\ndesignated enactment; and\n\n“Registrar” means Registrar of Companies.\n\nElectronic filing\n\nA  person  or  legal  entity  may  electronically  file  with  the  Registrar\n3.(1)\ninformation, forms or documents that are required to be filed by a person or a\nlegal entity under a designated enactment.\n\n(2)\n\nThe Registrar is authorized to\n\n(a)\n\n(b)\n\n(c)\n\naccept;\n\nregister;\n\nmaintain;\n\n(d)\n\nstore; and\n\n(e)\n\nreproduce,\n\nany  information,  forms  or  documents  that  are  required  to  be  filed  with  the\nRegistrar in respect of a designated enactment, in electronic or other machine-\nreadable format either by optical scanning, by direct electronic transmission, or\nby  key  data  entry  in  one  or  more  databases  established  or  operated  by  the\nRegistrar.\n\n\f5\n\n(3)\nAn  electronic  database  established  or  operated  by  the  Registrar  under\nsubsection (2) is deemed to be the register or other official record, if any, required\nto be kept by the Registrar under a designated enactment.\n\nA form filed in an electronic form has the same effect as if the form were\n\n(4)\nsubmitted in paper form.\n\nInformation, forms, or documents filed electronically pursuant to this Act\n\n(5)\nare deemed to be filed for the purpose of the designated enactment.\n\nFormat for electronic filing\n\nAny information, forms, or documents required to be filed with the\n4.\nRegistrar in respect of a designated enactment shall be presented for filing in a\nformat suitable for optical scanning where the Registrar requires a permanent\ndigital optical reproduction of an original document.\n\nElectronic format of information\n\n5.(1)\ncertified copy of any document filed in an electronic format with the Registry.\n\nUpon  payment  of  the  prescribed  fee,  the  Registrar  may  provide  a\n\n(2)\nA document that is a certified copy of information filed in an electronic\nformat has the same probative value and may be used in like manner as a certified\ncopy of a document filed by any other means.\n\nOn-line access to electronic database\n\n6.\nUpon payment of the prescribed fee, the Registrar may permit a person\nto have on-line access to the electronic database for the purpose of examining\nany information, form, or document.\n\nTime of receipt\n\n7.\nWhere information, forms or documents are filed in electronic format\nor by direct electronic transmission they are deemed to be filed with the Registrar\nat  the  time  and  on  the  date  that  the  electronic  system  confirms  receipt  of  the\ninformation, form or document and assigns the time and date of filing.\n\n\f6\n\nRegulations\n\n8.(1)\nThe Minister may, subject to negative resolution, make regulations\nfor  the  proper  carrying  into  effect  of  this  Act,  and,  in  particular,  may  make\nregulations\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\nauthorizing  or  requiring  information  that  is  to  be  filed  under  a\ndesignated enactment to be filed and maintained in an electronic or\nother prescribed format;\n\nauthorizing or requiring information that is required to be filed under\na designated enactment, be filed by direct electronic transmission to an\nelectronic database;\n\nauthorizing  or  requiring  forms  that  are  required  to  be  filed  under  a\ndesignated  enactment,  to  be  signed  by  electronic  signature  or  by\nsignature copied or reproduced in a prescribed manner;\n\nauthorizing or requiring forms required tobe filed under a designated\nenactment, to be filed without signatures;\n\nprescribing fees for filing information or forms that a person or a legal\nentity is required to file under a designated enactment;\n\nprescribing the electronic format that may be used when information\nis filed pursuant to a designated enactment;\n\ngoverning the filing of information by direct electronic transmission;\n\nprescribing the effect of the payment of fees or charges where payment\nis required to accompany an electronic filing;\n\nprescribing  common  dates  or  time  periods  for  filing  information  or\nforms,  the  payment  of  fees  for  other  charges  under  designated\nenactments;\n\n(j)\n\nprescribing methods for the payment of fees or other charges under\ndesignated enactments;\n\n\f7\n\n(k)\n\n(l)\n\n(m)\n\nprescribing methods for allocating payments made under designated\nenactments;\n\nprescribing the format for the filing of information or forms pursuant\nto  any  designated  enactment  from  time  to  time,  with  or  without\nconditions;\n\nprescribing information to be provided by a person or legal entity to\nthe Registrar for the purpose of administering and enforcing this Act;\nand\n\n(n)\n\nprescribing  any  other  matter  which  is  required  for  the  efficient\nadministration of this Act.\n\nWhere  a  form  is  required  to  be  filed,  under  this  Act  or  a  designated\n(2)\nenactment, without signatures, that form has the same effect for all purposes as\nif the form were signed by the party or parties that would have been required to\nsign  the  form,  but  for  a  regulation  made  pursuant  to  this  Act  or  a  designated\nenactment.\n\nAmendment of Schedule by Order\n\n9.\n\nThe Minister may by Order amend the Schedule.\n\nCommencement\n\n10.\n\nThis Act shall come into effect on a date fixed by proclamation.\n\n\f8\n\nSCHEDULE\n\nDesignated enactments\n\n(Section 2)\n\n1. Bills of Sale Act, Cap. 306\n\n2. Charities Act, Cap. 243\n\n3. Companies Act, Cap. 308\n\n4. Companies Regulations, 1984 (S.I. 1984 No. 29)\n\n5. Exempt Insurance Act, Cap. 308A\n\n6. Foundations Act  (Act 2013-2)\n\n7.\n\n8.\n\n9.\n\nInternational Business Companies Act, Cap. 77\n\nInternational Business Companies Regulations (S.I. 1992 No. 21)\n\nLimited Partnership Act, Cap. 312\n\n10. Pharmacy Act, Cap. 372D\n\n11. Private Trust Companies Act (Act 2012-22)\n\n12. Registration of Business Names Act, Cap. 317\n\n13. Business Names Rules, 1940 (S.I. 332 No. 1940)\n\n14. Registration of Newspapers Act, Cap. 302\n\n15. Societies with Restricted Liabilities Act, Cap. 318B\n\n16. Societies with Restricted Liabilities Regulations, 1995  (S.I. 2005 No. 127)\n\n17 . Trade Unions Act, Cap. 361\n\n\f9\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2014.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2014.\n\nPresident\n\n"
}