{
  "bill_id": 602,
  "slug": "planning-development-environmental-impact-assessment-regulations-2021",
  "title": "Planning Development (Environmental Impact Assessment) Regulations, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/0179f618229127d8d28f9ee3dd239511.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2021-12-14",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "S.I. 2021 No.\n\n2021-12-07\n\nPLANNING AND DEVELOPMENT (ENVIRONMENTAL IMPACT\nASSESSMENT) REGULATIONS, 2021\n\nArrangement of Regulations\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nCitation\n\nDefinitions\n\nEnvironmental Impact Assessment Committee\n\nScreening of applications\n\nExemption from environmental impact assessment requirements\n\nPublicity for applications\n\nInitial Environmental Evaluation\n\nScoping of environmental impact assessment\n\nClass Model environmental impact assessment\n\n10.\n\nQualified persons to conduct environmental impact assessment\n\n11.\n\nPublic participation in environmental impact assessment\n\n12.\n\nMinimum contents of environmental impact statement\n\n13.\n\nSubmission of environmental impact statement\n\n\f2\n\n14.\n\nReview of environmental impact statement\n\n15.\n\nProcedure where environmental impact statement is deficient\n\n16.\n\nPublic scrutiny of environmental impact statement\n\n17.\n\nDecision following environmental impact assessment\n\n\fPlanning and Development Act, 2019\n\nAct 2019-5\n\nPLANNING AND DEVELOPMENT (ENVIRONMENTAL IMPACT\nASSESSMENT) REGULATIONS, 2021\n\nThe Minister, in exercise of the powers conferred on him by section 30(4)\n\nand section 104(1A) of the Planning and Development Act, 2019, makes the\nfollowing Regulations:\n\nCitation\n\n1.\n(Environmental Impact Assessment) Regulations, 2021.\n\nThese  Regulations  may  be  cited  as  the  Planning  Development\n\nDefinitions\n\n2.\n\nIn these Regulations,\n\n“application” means an application for planning permission made under Part IV\n\nof the Act;\n\n“Committee”  means  the  Environmental  Impact  Assessment  Committee\n\nestablished by regulation 3;\n\n“scoping” means the process of identifying the scope of work to be carried out\n\nfor an environmental impact assessment;\n\n“screening”  means  a  preliminary  assessment  of  the  proposed  development  to\n\ndetermine whether its environmental impacts are likely to be significant;\n\n“terms of reference” means a document prescribing the nature and extent of the\nenvironmental  information  to  be  provided  and  the  analysis  required  in\ncarrying out an environmental impact assessment.\n\n\f4\n\nEnvironmental Impact Assessment Committee\n\n3.(1)\nThe  Board  shall  appoint  an  Environmental  Impact  Assessment\nCommittee,  pursuant  to  section  6(10)  of  the  Act,  to  carry  out  the  functions\nconferred upon it by these Regulations.\n\nThe  Committee  shall  comprise  persons  who  possess  qualifications  and\n\n(2)\nexperience in the following areas:\n\n(a)\n\n(b)\n\n(c)\n\necology;\n\ngeology, hydrology and soil conservation;\n\nenvironmental, coastal and civil engineering;\n\n(d)\n\nmarine science;\n\n(e)\n\ndisaster risk mitigation and management;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\npublic health;\n\neconomics;\n\nsociology; and\n\nphysical planning.\n\nThe function of the Committee is to advise the Board and the Minister,\n(3)\nwith respect to environmental impact assessment studies and for this purpose\nto\n\n(a)\n\n(b)\n\nscreen applications for planning permission to determine whether an\nenvironmental impact assessment is required in any case;\n\nscope the development proposal to specify the terms of reference for\nthe environmental impact assessment where an environmental impact\nassessment is required;\n\n(c)\n\nreview the environmental impact statement submitted by the applicant\nand public comments on the environmental impact statement; and\n\n\f5\n\n(d)\n\nmake recommendations to the Board with respect to the environmental\nimpacts of proposed development projects, including the imposition of\nconditions  on  the  grant  of  planning  permission  for  the  purposes  of\navoiding, mitigating and offsetting adverse environmental impacts.\n\nA member of the Committee shall serve for a term not exceeding 3 years\n\n(4)\nand is eligible for reappointment. as often as the Board sees fit.\n\nThe Board shall designate one of the members of the Committee to act as\n\n(5)\nChairperson.\n\nThe Director shall assign an officer from the Planning and Development\n\n(6)\nDepartment to serve as Secretary to the Committee.\n\nThe  Committee  may  appoint  from  amongst  its  members  such  working\n\n(7)\ngroups as are necessary or expedient to carry out specific tasks.\n\nMinutes  in  proper  form  of  each  meeting  of  the  Committee  and  of  any\n(8)\nworking group shall be kept by the Secretary and confirmed by the Committee\nat its next meeting; and the Chairman shall sign the minutes once confirmed.\n\nThe provisions of subsections (9) and (12) of section 6 and of section 103\n(9)\nof the Act apply mutatis mutandis to the Committee and members thereof as they\napply to the Board.\n\nThe Committee has the power to regulate its own proceedings subject to\n\n(10)\nthe provisions of this regulation.\n\nScreening of applications\n\nSubject to the approval of the Board, the Committee shall establish\n4.(1)\nguidelines  for  screening  applications,  including  applications  for  approval  in\nprinciple, keep those guidelines under continuous review and revise them from\ntime to time as it considers necessary or expedient.\n\nThe  screening  guidelines  established  under  paragraph  (1)  may  include\n\n(2)\nconsideration of the following:\n\n(a)\n\nthe size and scale of the proposed development;\n\n\f6\n\n(b)\n\n(c)\n\nthe location of the proposed development in relation to sites or areas\nthat are of special importance or vulnerability; and\n\nthe  activities  involved  in  the  proposed  development  that  may\nparticularly activities with complex and potentially adverse impacts,\nincluding  but  not  limited  to  serious  impacts  on  human  beings  and\nvalued  ecosystem  components,  or  which  would  cause  additional\nloading of the environment to unsustainable levels.\n\n(i)\n\n(ii)\n\nseriously  impact  on  human  beings  and  valued  ecosystem\ncomponents; or\n\ncause  additional  loading  of  the  environment  to  unsustainable\nlevels.\n\nThe  Director  shall  make  copies  of  the  approved  screening  guidelines\n(3)\navailable to members of the public on the internet or in hard copy at the cost of\nmaking copies.\n\nWithin 14 days of the submission of an application, the Committee shall\n\n(4)\ncarry out, or cause to be carried out, a screening of the application and\n\n(a)\n\n(b)\n\n(c)\n\nin  the  case  of  an  application  for  approval  in  principle,  where  the\nscreening shows that the adverse impacts of the proposed development\nmay be significant, advise the Board that the applicant is required to\ncarry  out  an  initial  environmental  evaluation  in  relation  to  that\napplication;\n\nin any case where the application is for proposed development of a\nclass listed in the Sixth Schedule to the Act, advise the Minister whether\nthe  application  may  be  exempted  from  the  requirement  that  an\nenvironmental  impact  assessment  shall  be  carried  out,  pursuant  to\nsection 30(2) of the Act, in accordance with regulation 5; and\n\nin the case of any other application, where the screening shows that the\nadverse  impacts  of  the  proposed  development  are  likely  to  be\nsignificant, advise the Director that an initial environmental evaluation\nor an environmental impact assessment shall be carried out in support\n\n\f7\n\nof the application before it is determined, pursuant to section 30(1) of\nthe Act.\n\nThe Director shall give the applicant notice of the decision to require, or\n(5)\nto dispense with the requirement, that an environmental impact assessment be\ncarried out with respect to the proposed development, as the case may be, no later\nthan 28 days after the date of the application, pursuant to section 27 of the Act.\n\nExemption from environmental impact assessment requirements\n\nThe Committee shall advise the Minister that an environmental impact\n5.(1)\nassessment is not required with respect to an application for a development of\nany kind mentioned in the Sixth Schedule to the Act where\n\n(a)\n\n(b)\n\n(c)\n\nthe application had been preceded by an application for approval in\nprinciple;\n\nan initial environmental evaluation was carried out with respect to the\nconceptual plans for the development before approval in principle was\ngranted; and\n\nthe grant of approval in principle was not made subject to a condition\nthat  an  environmental  impact  assessment  be  carried  out  and  an\nenvironmental impact statement submitted in relation to the application\nfor planning permission for the development.\n\nEvery direction given by the Minister pursuant to section 30(2) of the Act,\n(2)\non the advice of the Committee, and published in accordance with section 2(3)\nof the Act, shall contain a statement of reasons for the decision.\n\nPublicity for applications\n\n6.(1)\nWhere  an  applicant  is  notified  that  an  environmental  impact\nassessment  is  required,  the  applicant  shall  publicize  the  application,  in\naccordance to subsection 29(2)(a) of the Act, giving notice of the application to\nthe public in general, and particularly persons whose interests are likely to be\naffected, directly or indirectly, by the proposed development.\n\n\f8\n\nWithout prejudice to the generality of paragraph (1), within 14 days of\n\n(2)\nservice of the notice, the applicant shall\n\n(a)\n\n(b)\n\ncause a notice containing particulars of the application to be published\ntwice in at least one daily newspaper in general circulation in Barbados\nor to be published electronically on the internet;\n\ngive copies of such notice to the owners or occupiers of every parcel\nof land adjacent to the premises on which the proposed development\nis to take place; and\n\n(c)\n\naffix  a  conspicuous  notice  containing  the  same  particulars  to  some\nobject on the land where the proposed development is to take place.\n\n(3)\n\nEvery such notice shall\n\n(a)\n\n(b)\n\ninclude the name of the applicant, the reference number and date of the\napplication and a brief description of the proposed development; and\n\nspecify  that  an  environmental  impact  assessment  is  required  to  be\ncarried out with respect to the proposed development and that members\nof  the  public  shall  be  afforded  the  opportunity  to  scrutinize  the\nenvironmental\nsubmit  objections  or\nstatement  and\nrepresentations with respect to the application in due course.\n\nimpact\n\nInitial Environmental Evaluation\n\n7.(1)\nevaluation\n\nAn  applicant  may  be  required  to  submit  an  initial  environment\n\n(a)\n\n(b)\n\nin support of an application for approval in principle pursuant to section\n25(3) of the Act; or\n\nin  support  of  an  application  for  planning  permission  in  lieu  of  an\nenvironmental  impact  assessment,  where  so  determined  by  the\nCommittee in accordance with the screening guidelines.\n\nIn every case where the Director requires an initial environment evaluation\n(2)\nin respect of an application for approval in principle, the applicant may submit\n\n\f9\n\nin  satisfaction  of  that  requirement  a  report  on  the  initial  environment\nevaluation\n\n(a)\n\n(b)\n\n(c)\n\npredicting  the  main  impacts  of  the  proposed  development  and\nevaluating the importance of those impacts;\n\nindicating the key mitigating actions which would be required if the\ndevelopment is permitted; and\n\nidentifying any significant gaps in knowledge and uncertainties about\nenvironmental impacts which should be addressed by a more rigorous\nenvironmental impact assessment before detailed plans are prepared\nand submitted for planning permission.\n\nAn initial environment evaluation submitted pursuant to subsection (2),\n(3)\nshall assess the predicted environmental impacts of the proposed development\nin sufficient detail to enable the Board to identify any conditions subject to which\napproval in principle may be granted and any matters concerning which the Board\nshall reserve planning permission until detailed plans have been submitted.\n\nWhere the Committee is of the opinion that the available information is\n(4)\nnot adequate for the purposes of conducting an initial environment evaluation,\nthe Director may require any supplementary preliminary studies and information\nthat are reasonably necessary for those purposes to be undertaken or collected by\nthe applicant.\n\nScoping of environmental impact assessment\n\nIn  every  case  where  the  Board  requires  an  environmental  impact\n8.(1)\nassessment with respect to an application, within 7 days of the date of notification\nunder regulation 3(5), the Committee shall consider the scope of works necessary\nto assess the potential impacts of the proposed development on the environment,\nprepare  a  draft  terms  of  reference  for  the  environmental  impact  assessment\nrequired in respect of the proposed development and the Director shall issue the\ndraft terms of reference to the applicant.\n\n\f10\n\n(2)\nIn considering the scope of works to be undertaken for a development listed\nin the Sixth Schedule to the Act, the Committee shall take into account the existing\nclass model for projects of the same class, adopted pursuant to regulation 9, if\nany.\n\n(3)\nIf the applicant wishes to have the draft terms of reference amended, the\napplicant shall conduct consultations with any relevant governmental agencies,\nnon-governmental organisations and members of the public with respect to the\nrequired scope of work for the environmental impact assessment and, within 14\ndays of the date of issue of the draft terms of reference under sub-regulation (1),\nsubmit to the Director a report on the scoping exercise, inclusive of proposals for\nthe revision of the draft terms of reference, if any.\n\nThe  Committee  shall  consider  any  scoping  report  submitted  by  the\n(4)\napplicant pursuant to paragraph (2), if any, and issue final terms of reference for\nthe environmental impact assessment to the applicant within 7 days after the date\nof submission of the scoping report or, if the applicant fails to submit a scoping\nreport, after the expiry of the period allowed by paragraph (3) for the submission\nof a scoping report, whichever is earlier in time.\n\nClass Model environmental impact assessment\n\nWhere  the  Committee  determines  that  an  environmental  impact\n9.(1)\nassessment  can  be  used  as  a  basis  for  carrying  out  environmental  impact\nassessments for other projects of the same class specified in the Sixth Schedule\nto the Act, it may declare the environmental impact statement to be a class model\nreport.\n\nAny declaration made pursuant to paragraph (1) shall be published in the\n(2)\nOfficial Gazette and the environmental impact statement to which it relates shall\nbe made freely available to the public in electronic form on the Department’s\ninternet website.\n\nWhere a project is within a class in respect of which a class model report\n(3)\nhas  been  declared,  the  Committee  may  permit  the  use  of  that  environmental\nimpact statement and the environmental impact assessment on which it is based\n\n\f11\n\nto whatever extent it considers appropriate for the purposes of complying with\nthe requirements of these Regulations.\n\nWhere the Committee permits the use of a class model report, it shall ensure\n(4)\nthat such adjustments are made to the terms of reference of the environmental\nimpact assessment for the proposed development as are necessary to update the\nbaseline  environmental  information  and  take  into  account  the  site  specific\ncircumstances  of  the  development  to  which  the  application  for  planning\npermission relates.\n\nWhere the Committee determines that an environmental impact statement\n(5)\ncan no longer be used as a class model for carrying out environmental impact\nassessments  for  projects  of  the  same  class,  it  may  declare  the  environmental\nimpact statement not to be a class model.\n\nAny declaration made pursuant to paragraph (5) must be published in the\n(6)\nOfficial Gazette and the environmental impact statement to which it relates may\nbe removed from the internet.\n\nQualified persons to conduct environmental impact assessment\n\nThe applicant shall ensure that the environmental impact assessment\n10.(1)\nis  carried  out  by  independent  and  suitably  qualified  persons  with  recognised\nexpertise and experience in the specific areas with respect to which information\nand analysis is required by the terms of reference.\n\nThe environmental impact statement shall include information outlining\n(2)\nthe  relevant  qualifications  and  experience  of  the  experts  who  carried  out  the\nenvironmental impact assessment.\n\nFor the avoidance of doubt, it is declared that the Board, on the advice of\n(3)\nthe Committee, may reject an environmental impact statement on the grounds\nthat it is not satisfied that the environmental impact assessment to which it relates\nhas been carried out in accordance with the provisions of this regulation.\n\n\f12\n\nPublic participation in environmental impact assessment\n\n11.(1)\nThe applicant may be required to provide, during the course of the\nenvironmental impact assessment, an opportunity for the interested members of\nthe  public  to  meet  with  the  person  carrying  out  the  environmental  impact\nassessment on behalf of the applicant in order to\n\n(a)\n\n(b)\n\nprovide  information  concerning  the  proposed  development  to  the\npersons whose environment may be affected by the development; and\n\nrecord  the  concerns  of  the  community  regarding  the  potential\nenvironmental impact of the proposed development and to include the\nrecord of such concerns in the environmental impact statement.\n\nThe procedure for public contact and involvement with the applicant and\n(2)\nenvironmental\nthe\nenvironmental impact assessment shall be prescribed by the Committee in the\nterms of reference.\n\nimpact  assessment  prepared  during\n\nthe  course  of\n\nMinimum contents of environmental impact statement\n\n12.(1)\n\nAn environmental impact statement shall include at a minimum\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\na description of the proposed development;\n\na  description  of  the  potentially  affected  environment,  including\nspecific  information  necessary  for  identifying  and  assessing  the\nenvironmental impacts of the proposed development;\n\na description of practical alternatives, as appropriate;\n\nan assessment of the likely or potential environmental impacts of the\nproposed  development  and  alternatives,  including  direct,  indirect,\ncumulative, short-term and long-term impacts;\n\nan identification and description of measures available to mitigate or\noffset adverse environmental impacts of the proposed development and\nalternatives, and an assessment of those measures;\n\n\f13\n\n(f)\n\n(g)\n\nan indication of gaps in knowledge and uncertainties which may be\nencountered in compiling the required information;\n\nan  indication  of  whether  the  environment  of  any  area  beyond  the\nterritorial  jurisdiction  of  Barbados  is  likely  to  be  affected  by  the\nproposed development or alternatives; and\n\n(h)\n\na  brief  non-technical  summary  of  the  information  provided  under\nsubparagraphs (a) to (g).\n\nThe environmental impacts in an environmental impacts statement should\n(2)\nbe assessed in a degree of detail commensurate with their likely environmental\nsignificance.\n\nSubmission of environmental impact statement\n\nWhen the environmental impact assessment has been completed, the\n13.(1)\napplicant  shall  submit  the  environmental  impact  statement  to  the  Director,\naccompanied by proof of payment of the applicable fee payable at the review\nstage of the environmental impact assessment process.\n\n(2)\nThe environmental impact statement shall be submitted within 3 years of\nthe date of the notice given in accordance with regulation 4(5), or such longer\nperiod as may be agreed upon between the applicant and the Director, failing\nwhich the application to which the environmental impact assessment relates may\nbe cancelled pursuant to section 27(4) of the Act.\n\nReview of environmental impact statement\n\nWithin  28  days  after  submission  of  an  environmental  impact\n14.(1)\nstatement, the Committee shall review it to determine whether the environmental\nimpact assessment substantially complies with the terms of reference and is of a\nsatisfactory standard.\n\nWhere the Committee considers this to be necessary, because expert advice\n(2)\nis required with respect to any aspect of an environmental impact assessment, the\n\n\f14\n\nBoard  may  engage  an  independent  consultant  to  assist  the  Committee  in\nreviewing the environmental impact statement.\n\nOther than in a case to which regulation 15 applies, the Director on the\n(3)\nadvice of the Committee shall notify the applicant that the environmental impact\nstatement is accepted, subject to its submission for public scrutiny in accordance\nwith regulation 16.\n\nProcedure where environmental impact statement is deficient\n\nWhere  the  Committee  considers  that  the  environmental  impact\n15.(1)\nstatement is deficient in any respect, the Director may require the applicant to\nconduct  further  work  and  amend  the  environmental  impact  statement\naccordingly.\n\nWhere the Committee considers that an environmental impact statement\n(2)\nis deficient in terms of paragraph (1) and advises the Director to refer it back for\nfurther work, the Director shall indicate in writing to the applicant the nature of\nthe further work that is required to satisfy the terms of reference.\n\n(3)\nWhere the Board refers an environmental impact statement back for further\nwork,  consideration  of  the  application  to  which  the  environmental  impact\nassessment relates shall be deferred until after the amended environmental impact\nstatement is resubmitted by the applicant and the environmental impact statement\nhas been submitted for public scrutiny in accordance with regulation 16.\n\nWhere the Committee refers an environmental impact statement back to\n(4)\nthe applicant for further work and the applicant fails to carry out the further work\nwhich is required to the satisfaction of the Committee, the Committee may reject\nthe environmental impact statement and the Director may cancel the application\npursuant to section 27(4) of the Act.\n\n\f15\n\nPublic scrutiny of environmental impact statement\n\n16.(1)\nWhen the Committee accepts an environmental impact statement, the\nDirector shall, in any manner which the Board considers appropriate to facilitate\npublic access to the report, publish a notice setting out the following information:\n\n(a)\n\n(b)\n\n(c)\n\nthe date on which copies of the environmental impact statement will\nbe available for public scrutiny;\n\nthe places at which copies of the environmental impact statement may\nbe scrutinised; and\n\nthe deadline and address for the submission of public comments on the\nfindings  and  recommendations  of\nimpact\nassessment.\n\nthe  environmental\n\nPrior to the deadline set out in the notice published pursuant to paragraph\n(2)\n(1),  any  person  may  file  written  comments  with  the  Director  relating  to  the\nfindings and recommendations and any other aspect of the environmental impact\nassessment.\n\nThe Director shall receive written comments for not less than 21 days and,\n(3)\nif the Committee determines that there is sufficient public interest in the matter,\nthe  Director  shall  cause  a  public  consultation  to  be  held  to  receive  verbal\ncomments on the matter, not later than 7 days after the end of the period allowed\nfor the submission of written comments.\n\nIn determining whether there is sufficient public interest to cause a public\n(4)\nhearing to be held on the application pursuant to paragraph (3), the Committee\nmay take into account\n\n(a)\n\n(b)\n\nthe number of written comments submitted within the period allowed\nfor the submission of public comments; and\n\nthe amount of public interest in the matter as evidenced by coverage\nof the issue in the mass communications media.\n\n\f16\n\n(5)\nWhere  any  deficiencies  in  the  environmental  impact  assessment  are\nidentified as a result of the public scrutiny procedure, the Director may require\nthe  applicant  to  conduct  further  work  and  amend  the  environmental  impact\nstatement accordingly, provided always that such work is within the scope of the\nterms of reference.\n\nDecision following environmental impact assessment\n\nAfter taking into consideration the environmental impact statement\n17.(1)\nand any public comments filed pursuant of regulation 16, the Committee, where\ntaking  into  account  the  implementation  of  any  mitigation  measures  that  it\nconsiders appropriate,\n\n(a)\n\n(b)\n\n(c)\n\nconcludes  that  the  development  is  not  likely  to  cause  significant\nadverse  environmental  impacts,  shall  recommend  that  planning\npermission  be  granted  subject  to  such  conditions  as  are  required  to\nensure that any adverse impacts of the development on the environment\nare reduced and mitigated;\n\nconcludes that the development is likely to cause significant adverse\nenvironmental impacts which cannot be offset to its satisfaction, shall\nrecommend that planning permission for the development be refused;\nor\n\nis  uncertain  whether  the  development  is  likely  to  cause  significant\nenvironmental impacts or not, may advise that planning permission be\nrefused, based on the precautionary principle.\n\nFor the avoidance of doubt, it is declared that where the Board takes into\n(2)\naccount the Committee’s conclusions and recommendations with respect to the\nenvironmental  impact  statement  in  determining  an  application  for  planning\npermission, the Board is deemed to be in compliance with section 32(8)(e) of the\nAct.\n\nWhere an application for which an environmental impact assessment is\n(3)\nrequired is referred to the Minister for determination pursuant to section 33 of\nthe  Act,  the  provisions  of  paragraph  (1)  and  (2)  apply,  with  any  necessary\n\n\f17\n\nmodifications, to the determination of the application by the Minister as they\napply to the determination of an application by the Board.\n\n(4)\nWhere the Board or the Minister grants planning permission following an\nenvironmental  impact  assessment  and  such  permission  is  granted  subject  to\nconditions  intended  to  reduce,  mitigate  or  offset  the  adverse  impacts  of  the\ndevelopment  on  the  environment,  the  Director  shall  make  provision  for\nsupervising compliance with those conditions and for monitoring the impacts of\nthe development on the environment after its completion, notwithstanding the\nprovisions of any other written law.\n\nMade by the Minister this              day of                     , 2021.\n\nMinister responsible for planning and development\n\n"
}