{
  "bill_id": 603,
  "slug": "income-tax-country-by-country-reporting-bill-2021",
  "title": "Income Tax (Country by Country  Reporting) Bill, 2021",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/81316db57f6f09dd14ec026aac855922.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2021-12-18",
  "first_reading": "2021-12-17",
  "gazette_date": null,
  "markdown": "2021-12-08\nOBJECTS AND REASONS\nThis Bill would make provision for the annual filing of country-by-country reports by multinational enterprises in respect of each tax jurisdiction in which they conduct business and with respect to the amount of revenue, the profit before income tax and the income tax paid and accrued in each tax jurisdiction.\nArrangement of Sections\nPARTI\nPRELIMINARY\nShort title\nInterpretation\nPART II\nREPORTING PROCEDURES\nBarbados Competent Authority\nFiling of country-by-country reports\nNotifications to the Competent Authority\nTime to file reports\nContent of reports and method of filing reports\nVerification of enterprises\nPART II\nRECORDS AND USE OF COUNTRY-BY-COUNTRY REPORTS\nMaintenance of records\n10. Appointment of agents\n11. Confidentiality and use of information\n12. Provision of information to Competent Authority\n13. Requests from the Competent Authority\nPART IV\nOFFENCES, PENALTIES AND APPEALS.\n14, False reports\nTampering with reports\n16. Obstruction of the Competent Authority\n17. Pecuniary penalties\n18. Appeals\n19. Recovery of pecuniary penalties\nPART V\nMISCELLANEOUS\n20. Avoidance of obligations\n21. Guidelines\n22. Commencement\nBARBADOS\nA Bill entitled\nAn Act to make provision for the annual filing of country-by-country reports. by multinational enterprises.\nENACTED by the Parliament of Barbados as follows:\n6\nPART I\nPRELIMINARY\nShort title\n1. This Act may be cited as the Income Tax (Country-by-Country Reporting) Act, 2021.\nInterpretation\n2.(1) In this Act,\n“Commissioner” has the same meaning assigned to it in section 2 of the Barbados Revenue Authority Act, 2014 (Act 2014-1);\n“Competent Authority” means the Barbados Competent Authority referred to in section 3;\n“consolidated financial statement” means a financial statement of an MNE Group in which the assets, liabilities, income, expenses and cash flows of an ultimate parent entity and a constituent entity are presented as a single economic entity;\n“constituent entity” means any\n(a) separate business unit of an MNE Group\n(i) _ that is included in a consolidated financial statement of that MNE Group for the purposes of financial reporting; or\n(ii) which would be included in the consolidated financial statement if equity interest in the business unit of the MNE Group were traded on a public securities exchange;\n(6) business unit which is excluded from the consolidated financial statement of the MNE Group solely on the size or gross income of the\n7\nbusiness unit or any other grounds of materiality in respect of the business unit; and\n(c) permanent establishment of any separate business unit of the MNE. Group included in paragraph (a) or (6), provided that the business unit prepares a separate financial statement for that permanent establishment for the purposes of financial reporting, regulatory tax reporting or internal management control;\n“country-by-country report” means a report on an MNE Group which contains\n(a) aggregate information which relates to the amount of revenue, profit loss before income tax, income tax paid, income tax accrued, stated capital, accumulated earnings, number of employees and tangible assets other than cash or cash equivalents with regard to each jurisdiction in which the MNE Group operates;\n(b) an identification of each constituent entity of the MNE Group;\n(c) the jurisdiction of tax residence of each constituent entity and the jurisdiction under which each constituent entity is organized; and\n(d) the nature of the main business activity of each constituent entity;\n“enterprise” includes an incorporated or unincorporated body, a society, a partnership and an association;\n“excluded MNE Group” means, with respect to any fiscal year of a Group, a Group which has a total consolidated group revenue of less than USD$850, 000, 000 during the fiscal year immediately preceding the reporting fiscal year as reflected in its consolidated financial statements for that preceding fiscal year;\n“fiscal year” means an annual accounting period with respect to which an ultimate parent entity of an MNE Group prepares its financial statements;\n“Group” means a collection of enterprises which are related through ownership or control such that it is either required to prepare a consolidated financial statement for financial reporting purposes in accordance with relevant\n8\ninternational accounting principles or it would be so required if equity interests in any of the enterprises were traded on a public securities exchange;\n“international accounting principles” include the Generally Accepted Accounting Principles and the International Financial Reporting Standards;\n“international agreement” means\n(a) the Multilateral Convention for Mutual Administrative Assistance in Tax Matters as amended by Protocol in 2010; or\n(b) any bilateral or multilateral tax convention or any tax information exchange agreement which provides legal authority for the exchange of tax information between jurisdictions, including the automatic exchange of such information;\n“MNE Group” means any Group that\n(a) includes\n(i) 2 or more enterprises for which the tax residences of the enterprises are in different jurisdictions; or\n(ii) an enterprise that is resident for tax purposes in one jurisdiction and is subject to tax with respect to the business carried out through a permanent establishment in another jurisdiction; and\n(b) is not an excluded MNE Group;\n“qualifying competent authority agreement” means an agreement that is between jurisdictions which are parties to an international agreement and that requires the automatic exchange of country-by-country reports between the parties to the agreement;\n“Registrar” has the meaning assigned to in section 2(1) of the Companies Act, Cap. 308;\n9\n“reporting entity” means an enterprise which files a country-by-country report pursuant to section 4;\n“reporting fiscal year” means the fiscal year of the financial and operational results of an MNE Group which are reflected in a country-by-country report;\n“Tribunal” means the Barbados Revenue Appeals Tribunal established by section 24 of the Barbados Revenue Authority Act, 2014 (Act 2014-1);\n“USD” means the United States Dollar, the official currency of the United States of America.\n(2) _ Forthe purposes of this Act, reference to the term “surrogate parent entity” means a constituent entity of an MNE Group which the MNE Group appoints as a sole substitute for its ultimate parent entity for the purposes of filing, in the jurisdiction of tax residence of that constituent entity, a country-by-country report on behalf of the MNE Group when one or more conditions set out in section 4(3) applies.\n(3) For the purposes of this Act, reference to the term “ultimate parent entity” means a constituent entity of an MNE Group that meets the following criteria:\n(a) it owns, directly or indirectly, a sufficient interest in one or more other constituent entities of the MNE Group such that it is required to prepare a consolidated financial statement in accordance with accounting principles applied in its jurisdiction of tax residence or would be so required if its equity interests are traded on a public securities exchange in its jurisdiction of tax residence; and\n(b) there is no other constituent entity of such MNE Group that owns directly or indirectly an interest described in paragraph (a) in the first mentioned constituent entity.\n10\nPART II\nREPORTING PROCEDURES\nBarbados Competent Authority\n3.(1) For the purposes of this Act, the Minister responsible for Finance is the Barbados Competent Authority.\n(2) Notwithstanding subsection (1), the Minister may, in writing, delegate any of his powers and functions under this Act as the Barbados Competent Authority to the Commissioner.\nFiling of country-by-country reports\n4.1) Each ultimate parent entity of an MNE Group which is resident for tax purposes in Barbados shall file a country-by-country report in accordance with sections 6 and 7.\n(2) Notwithstanding subsection (1), a constituent entity which is\n(a) not an ultimate parent entity of an MNE Group, and\n(b) resident for tax purposes in Barbados,\nshall file a country-by-country report in accordance with sections 6 and 7 where one of the conditions referred to in subsection (3) applies to the ultimate parent entity.\n(3) The conditions referred to in subsection (2) are as follows:\n(a) the ultimate parent entity of the MNE Group is not obligated to file a country-by-country report in its jurisdiction of tax residence;\n(b) the jurisdiction in which the ultimate parent entity is resident for tax purposes has an international agreement to which Barbados is a party, but does not have a qualifying competent authority agreement in effect to which Barbados is a party by the period specified in section 6 for\nI\nthe filing of a country-by-country report in respect of a reporting fiscal year; or\n(c) the Competent Authority has notified the constituent entity that there is a systematic failure of the jurisdiction of tax residence of the ultimate parent entity.\n(4) Notwithstanding subsections (1) and (2), where\n(a) there is more than one constituent entity of the same MNE Group that are resident for tax purposes in Barbados; and\n(b) one or more conditions set out in subsection (3) apply to the ultimate parent entity,\nthe MNE Group may designate one of the constituent entities as a surrogate parent entity which shall file the country-by-country report in accordance with sections 6 and 7.\n(5) Subject to subsection (4), the surrogate parent entity shall, in writing, notify the Competent Authority that any country-by-country report that it files in accordance with this Act is to be treated as a country-by-country report that is filed on behalf of all of the constituent entities of the MNE Group which are resident in Barbados for tax purposes.\n(6) Any notice forwarded pursuant to subsection (5) shall be forwarded on or before the period specified in section 6.\n(7) Notwithstanding subsection (2), a constituent entity shall not be required to file a country-by-country report under this Act for a reporting fiscal year where the\n(a) MNE Group, through a surrogate parent entity, files a country-by- country report with the tax authority of its jurisdiction of tax residence with respect to the reporting fiscal year on or before the period specified in section 6; and\n(b) conditions outlined in subsection (8) are satisfied.\n12\n(8) The conditions referred to in subsection (7) are as follows:\n(a) the jurisdiction of tax residence of the surrogate entity requires the filing of country-by-country reports in accordance with procedures outlined in section 7;\n(b) the jurisdiction of tax residence of the surrogate entity has a qualifying competent agreement in effect, to which Barbados is party, by the period specified in section 6 for filing a country-by-country report for the reporting fiscal year;\n(c) the jurisdiction of tax residence of the surrogate entity has not notified the Competent Authority of a systematic failure;\n(d) the surrogate parent entity has notified the jurisdiction of its tax residence that it is the surrogate parent entity of the MNE Group; and\n(e) a notification has been provided to the Competent Authority in accordance with section 5.\n(9) For the purposes of this section, reference to the term “systematic failure” with respect to a jurisdiction means that the jurisdiction has a qualifying competent authority agreement with Barbados, but has\n(a) suspended the automatic exchange of country-by-country reports with Barbados for reasons other than those stated in the agreement; or\n(b) otherwise persistently failed to automatically provide Barbados with country-by-country reports in its possession of the MNE Group which has constituent entities in Barbados.\nNotifications to the Competent Authority\n5.(1) Any constituent entity of an MNE Group that is resident for tax purposes in Barbados shall, where applicable, notify the Competent Authority whether it is the ultimate parent entity or the surrogate parent entity of the MNE Group no later than the last day of the reporting fiscal year of the MNE Group.\n13\n(2) Where a constituent entity of an MNE Group that is resident for tax purposes in Barbados is not the ultimate parent entity nor the surrogate parent entity, it shall notify the Competent Authority of the identity and tax residence of the reporting entity no later than the last day of the reporting fiscal year of the MNE Group.\nTime to file reports\n6.1) Subject to section 4, a country-by-country report shall be filed with the Competent Authority no later than 12 months after the last day of the reporting fiscal year of the MNE Group.\n(2) _ The first reporting fiscal year for the purposes of section 4 is any fiscal year beginning on or after 1 January, 2021.\nContent of reports and method of filing reports\n741) The Commissioner shall give written directions or specifications in respect of the\n(a) content and format of a country-by-country report; and\n(b) method for filing a country-by-country report.\n(2) Where the Commissioner makes provision for an electronic method of filing a country-by-country report, the Commissioner shall cause an electronic validation process to be established.\n(3) Where the Commissioner specifies an electronic method for filing a country-by-country report, unless the contrary is proved, the\n(a) use of an electronic method is presumed to have resulted in the filing of the country-by-country report only if it has been successfully recorded by the electronic validation process;\n(b) time of filing the country-by-country report is presumed to be the time as recorded by the electronic validation process; and\n14\n(c) person who forwards the country-by-country report is presumed to be the person identified as such by any relevant feature of the electronic system.\n(4) A country-by-country report which is not filed in accordance with the directions or specifications of the Commissioner shall be treated as not having being filed or invalidly filed.\nVerification of enterprises\n8.(1) The Registrar shall forward to the Commissioner, at least once every 6 months,\n(a) alist of enterprises registered under the\n(i) Companies Act, Cap. 308;\n(ii) Registration of Business Names Act, Cap. 317;\n(ili) Societies With Restricted Liability Act, Cap. 318B, and\n(b) any other information which the Commissioner may require for the purposes of this Act.\n(2) Subject to subsection (1), the Commissioner shall utilize the list and information to verify whether enterprises specified in the list or information received are constituent entities resident in Barbados for tax purposes.\nPART III\nRECORDS AND USE OF COUNTRY-BY-COUNTRY REPORTS\nMaintenance of records\n9.1) Each reporting entity shall establish and keep a record of\n(a) the steps undertaken for the performance of its obligations under section 4;\n15\n(b) any evidence relied upon for the performance of its obligations under section 4; and\n(c) the information submitted to the Competent Authority for the purposes of section 4.\n(2) | The reporting entity shall, before the disposal of records made pursuant to subsection (1), ensure that the records are kept for a period of up to 5 years.\n(3) For the purposes of this section, the period referred to in subsection (2) shall commence after the end of the reporting fiscal year to which the records pertain.\nAppointment of agents\n10.(1) A reporting entity may appoint an agent to carry out its obligations under this Act.\n(2) Notwithstanding subsection(1), where a reporting entity appoints an agent, the reporting entity shall\n(a) remain responsible for its obligations under this Act;\n(b) be responsible for any acts undertaken by the agent or failures of the agent in respect of its obligations under the Act;\n(c) ensure it has access to all records described in section 9; and\n(d) where requested in accordance with this Act, produce the records described in section 9 or any part thereof.\nConfidentiality and use of information\n11.(1) The Competent Authority shall use the country-by-country reports and any other relevant information obtained pursuant to this Act for the purposes outlined in section 5 of the Multilateral Competent Authority Agreement on the Exchange of Country-by-Country Reports, 2016.\n(2) Where the Competent Authority receives a country-by-country report, it shall preserve the confidentiality of the information in the country-by-country\n16\nreport to the extent as if the report was provided to it in accordance with the Multilateral Convention on Mutual Administrative Assistance in Tax Matters as amended by Protocol in 2010.\nProvision of information to Competent Authority\n12.(1) The Competent Authority may, in writing and within such time as it may require, request a constituent entity to provide or make available to the Competent Authority information including\n(a) copies of relevant books, records or other documents; or\n(b) electronically stored information,\nin its possession or control as the Competent Authority may reasonably require to determine whether the constituent entity is compliant with this Act.\n(2) Where any information which is required to be provided to the Competent Authority is located outside of Barbados, the constituent entity shall take all necessary steps to bring the information to Barbados within the time specified by the Competent Authority.\nRequests from the Competent Authority\n13. Where the Competent Authority discovers an error in a country-by- country report, the Competent Authority shall, in writing,\n(a) notify the relevant reporting entity of the error;\n(b) require the reporting entity to correct the error and submit a corrected report within 14 days after the date of service of the notice; and\n(c) state that failure to comply with the requirements of the notice amounts to a breach of the Act and such breach may render the reporting entity liable to a pecuniary penalty under the Act.\n17\nPART IV\nOFFENCES, PENALTIES AND APPEALS\nFalse reports\n14. Where a person knowingly makes or submits a false country-by- country report, whether in its entirety or in any part thereof, that person is guilty of an offence and is liable on indictment to a fine of $50 000 or to imprisonment for a term of 10 years or to both.\nTampering with reports\n15. Where a person, without written authorization from the Competent Authority,\n(a) alters, destroys, mutilates, obliterates, hides or removes a country-by- country report which is submitted to the Competent Authority pursuant to this Act; or\n(b) causes another person to do anything referred to in paragraph (a),\nthat person is guilty of an offence is liable on summary conviction to a fine of $10, 000 or to imprisonment for one year or to both.\nObstruction of the Competent Authority\n16. Any person who hinders or obstructs the Competent Authority from performing a function under this Act is guilty ofan offence and liable on summary conviction to a fine of $10, 000 or to imprisonment for one year or to both.\nPecuniary penalties\n17.(1) Notwithstanding section 14, the Commissioner shall impose a pecuniary penalty of $10, 000 on a relevant enterprise which fails to comply with\n(a) sections 4, 5, 6 or 9;\n18\n(b) arequest made by the Competent Authority pursuant to section 12; or\n(c) anotice issued by the Competent Authority pursuant to section 13.\n(2) A pecuniary penalty imposed under subsection (1) is due and payable within the time specified in a notice issued pursuant to subsection (3), and where the enterprise does not remedy the breach under the Act, the enterprise is liable to a further pecuniary penalty of $5, 000 for each day or part thereof for which the failure continues after the date on which the original pecuniary penalty became due and payable.\n(3) Where an enterprise incurs a pecuniary penalty pursuant to subsection (1), the Commissioner shall, in writing, notify, the enterprise\n(a) of its breach under the Act;\n(b) that it has incurred a pecuniary penalty of $10, 000 pursuant to subsection (1);\n(c) that the pecuniary penalty is to be paid within 30 days of the date of service of the notice;\n(d) that failure to pay the pecuniary penalty within the period specified in the notice incurs a further pecuniary penalty of $5, 000 for each day or part thereof for which the failure continues after the date on which the original pecuniary penalty became due and payable; and\n(e) of its right under section 18 to appeal to the Tribunal against the imposition of the pecuniary penalty.\nAppeals\n18.(1) An enterprise may, within 14 days after the date of service of the imposition of a pecuniary penalty under section 17, appeal to the Tribunal against the pecuniary penalty on the ground that liability to a pecuniary penalty under the Act does not arise.\n(2) Notice of appeal shall be given in writing to the Tribunal in accordance with the procedures of the Tribunal.\n19\n(3) On hearing the appeal, the Tribunal may confirm or cancel the pecuniary penalty.\n(4) Where the Tribunal arrives at a decision, it shall serve the enterprise with a copy of the decision within 30 days of making the decision.\n(5) An enterprise which is aggrieved by the decision of the Tribunal may appeal to a Judge in Chambers against the decision within 30 days after the copy of the decision is served on it.\nRecovery of pecuniary penalties\n19. Subject to sections !7 and 18, where the Competent Authority imposes a pecuniary penalty on an enterprise pursuant to this Act and that enterprise fails to pay the pecuniary penalty, it may commence proceedings in the High Court to recover the pecuniary penalty.\nPART V\nMISCELLANEOUS\nAvoidance of obligations\n20. Where a person enters into an agreement or engages in a practice, for which the main purpose or one of the main purposes of the person entering into the agreement or engaging in the practice is to avoid any obligation under the Act, the person is subject to the obligation as if the person had not entered into the agreement or engaged in the practice.\nGuidelines\n21.1) The Competent Authority may issue guidelines in such form as it considers appropriate for the purpose of aiding compliance with this Act.\n(2) _ All guidelines and amendments to the guidelines shall be published in the Official Gazette.\n20\nCommencement\n22. This Act shall come into operation on the 31* day of December, 2021,\n"
}