{
  "bill_id": 605,
  "slug": "water-reuse-bill-2022",
  "title": "Water Reuse Bill, 2022",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/ce3db8a3288717c47330188797016748.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2022-02-08",
  "first_reading": "2022-02-08",
  "gazette_date": "2022-02-10",
  "markdown": "2022-02-07\n\nOBJECTS AND REASONS\n\nThis  Bill  would  provide  for  the  capture,  collection,  treatment  and  reuse  of\n\nwastewater to be used for various purposes.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nEnvironmental Protection Department\n\nPART II\n\nWATER REUSE COMMITTEE AND RELATED MATTERS\n\nEstablishment of the Committee\n\nFunctions of the Committee\n\nPowers of the Committee\n\nDisclosure of interest\n\nObligation to secrecy\n\nDirections of the Minister\n\n10.\n\nPowers of an inspector\n\n11.\n\nInspections\n\n\f3\n\nPART III\n\nPERMIT APPLICATION AND ADMINISTRATION\n\n12.\n\nWastewater treatment permit\n\n13.\n\nUses of non-potable water\n\n14.\n\nRegisters\n\n15.\n\nWarning or caution letters\n\n16.\n\nRevocation and Suspension of licence\n\n17.\n\nAmendment of Permit\n\n18.\n\nDisplay of Permit\n\n19.\n\nDuty due to suspension or revocation\n\nPART IV\n\nMISCELLANEOUS\n\n20.\n\nAmendment of Schedule\n\n21.\n\nGeneral Offences\n\n22.\n\nOffence continuing after conviction\n\n23.\n\nRegulations\n\n24.\n\nAct binds the State\n\n25.\n\nCommencement\n\n\f4\n\nFIRST SCHEDULE\n\nConstitution of the Water Reuse Committee\n\nSECOND SCHEDULE\n\nTHIRD SCHEDULE\n\nWastewater Treatment Permit\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  provide  for  the  capture,  collection,  treatment  and  reuse  of\n\nwastewater to be used for various purposes.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Water Reuse Act, 2022.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“agricultural wastewater” means\n\n(a)\n\n(b)\n\nthe excess water that runs off the field or other areas during surface\nirrigation  or  watering  areas  containing  salts,  nutrients,  pesticides,\nherbicides and other agricultural chemicals from the fields;\n\nthe water effluent high in organic matter from crops, processing plants\nand businesses preparing processed food, operated by and for farmers,\nusually in centralized facilities; or\n\n(c)\n\nthe  wastewater  produced  from  caring  for  and  slaughtering  farm\nanimals;\n\n“black  water”  means  wastewater  including  human  faeces  or  excrement  with\n\npaper and urine;\n\n“brown  water”  means  wastewater  and  paper  mixed  with  human  faeces  or\n\nexcrement;\n\n“Committee” means the Water Reuse Committee established under section 4;\n\n“Director”  means  the  public  office  established  under  the  Public  Service  Act,\nCap.  29  for  the  purpose  of  managing  the  Environmental  Protection\nDepartment;\n\n\f7\n\n“domestic wastewater” means yellow water, brown water, black water and grey\nwater generated as wastewater from the kitchen, shower, wash basin, toilet\nand laundry in a household or other similar building;\n\n“edible crops” means crops for human consumption;\n\n“effluent” means any liquid, other than storm water or uncontaminated water,\nsolid  or  gas  containing  organic,  inorganic,  animal,  vegetable  or  mineral\nmatter in solution or in suspension;\n\n“Environmental Health Officer I” means the public office established under the\n\nPublic Service Act, Cap. 29;\n\n“Environmental Health Officer II” means the public office established under the\n\nPublic Service Act, Cap. 29;\n\n“Environmental Inspector I” means the public office established under the Public\n\nService Act, Cap. 29;\n\n“Environmental  Inspector  II”  means  the  public  office  established  under  the\n\nPublic Service Act, Cap. 29;\n\n“Environmental Protection Department” means the department established under\n\nthe Public Service (General) Order, 2020 (S.I. 2020 No. 41);\n\n“grey water” means wastewater used in the kitchen, bathroom sinks, shower, and\n\nlaundry in a household or other similar building;\n\n“industrial  wastewater”  means  wastewater  containing  toxic  or  non-toxic\n\nchemical compounds or biological matter\n\n(a)\n\ngenerated  in  the  manufacturing  process  or  industrial  processes  as\nmeans  of  cooling  during  the  manufacturing  process  or  industrial\nprocess;\n\n(b)\n\ngenerated in the production process which is later separated; or\n\n(c)\n\ngenerated in office buildings, stores, shops and commercial centres;\n\n\f“inspector” means\n\n8\n\n(a)\n\n(b)\n\n(c)\n\nthe Director;\n\nthe Senior Environmental Inspector;\n\nan Environmental Inspector I;\n\n(d)\n\nan Environmental Inspector II;\n\n(e)\n\nan Environmental Health Officer I;\n\n(f)\n\nan Environmental Health Officer II; or\n\n(g)\n\nan Environmental Protection Officer;\n\n“Minister” means the Minister with responsibility for the environment;\n\n“non-potable” means water made from reclaimed water which is not treated to a\n\nstandard to be used as potable water;\n\n“potable water” means water which is of a standard of treatment or quality which\n\nmakes it suitable for domestic use or human consumption;\n\n“public  officer”  has  the  meaning  assigned  to  it  under  section  2  of  the  Public\n\nService Act, Cap. 29;\n\n“reclaimed water” means water collected from agriculture wastewater, industrial\nwater, domestic waste water or surface run-off which is treated or processed\nfor the use of the public or for use in a manner which may affect or impact\nthe public;\n\n“Senior Environmental Inspector” means the public office established under the\n\nPublic Service Act, Cap. 29;\n\n“surface run-off” means water from precipitation running over the landscape;\n\n“night soil” has the meaning assigned to it by regulation 2 of the Health Services\n(Disposal of Offensive Matter) Regulations, 1969 (S.I. 1969 No. 160);\n\n“yellow water” means wastewater mixed with human urine;\n\n\f9\n\n“wastewater” means\n\n(a)\n\n(b)\n\n(c)\n\nagricultural wastewater;\n\ndomestic wastewater;\n\nindustrial wastewater;\n\n(d)\n\neffluent; and\n\n(e)\n\nsurface run-off.\n\n“wastewater treatment permit” means the permit granted under section 11 for a\nperson to operate a wastewater treatment plant and to use that plant for the\ndischarge of wastewater as well as for the treatment of such wastewater or\nreclaimed water to produce non-potable water for sale to person pursuant to\nthis Act.\n\nEnvironmental Protection Department\n\n3.(1)\nstaff thereof shall generally administer this Act.\n\nThe  Director  of  the  Environmental  Protection  Department  and  the\n\nThe Director and the staff of the Environmental Protection Department\n\n(2)\nshall\n\n(a)\n\n(b)\n\ndo all such things as appear to be necessary or expedient for the purpose\nof the efficient administration of this Act;\n\nmonitor persons granted permits and otherwise to determine whether\nan infringement of this Act has occurred; and\n\n(c)\n\nensure compliance with the provisions of this Act.\n\n\f10\n\nPART II\n\nWATER REUSE COMMITTEE AND RELATED MATTERS\n\nEstablishment of the Committee\n\n4.(1)\nReuse Committee.\n\nThere is hereby established a Committee to be known as the Water\n\nThe provisions of the First Schedule shall have effect with respect to the\n(2)\nconstitution and management of the Water Reuse Committee and otherwise in\nrelation thereto.\n\nFunctions of the Committee\n\n5.\n\nThe functions of the Water Reuse Committee are to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nconsider  and  make  determinations  or  decisions  with  respect  to  an\napplication for a wastewater treatment permit;\n\ndetermine the suitability of certain premises and the structures thereon\nfor a wastewater treatment permit;\n\nrequire the Director to issue a wastewater treatment permit;\n\nmonitor  a  person  granted  a  wastewater  treatment  permit  to  ensure\ncompliance  with  the  terms  and  conditions  of  wastewater  treatment\npermit issued to that person; and\n\n(e)\n\ninquire into complaints made against any person granted a wastewater\ntreatment permit.\n\nPowers of the Committee\n\n6.\n\nThe Water Reuse Committee may\n\n(a)\n\nrequire a person to appear before the Committee to answer questions,\nproduce reports or produce documents in respect of an application for\na wastewater treatment permit;\n\n\f11\n\n(b)\n\n(c)\n\nrequire the production of any report or document where it is reasonably\nbelieved  to  contain  information  relevant  to  the  application  for  a\nwastewater treatment permit and take and keep copies thereof;\n\nmake inquiries of any person, whether orally or in writing with respect\nto an application for a wastewater treatment permit or in relation to\npremises subject to a wastewater treatment permit or with respect to\nany matter related to this Act; or\n\n(d)\n\nrequire any person to appear before the Committee to answer questions\nor produce documents in respect of a complaint made to the Committee.\n\nDisclosure of interest\n\nA member of the Committee who directly or indirectly has an interest\n7.(1)\nin any wastewater treatment permit or other matter whatsoever which falls to be\nconsidered by the Committee, shall disclose the nature of his interest to the other\nmembers of the Committee at a meeting of the Committee, and the disclosure\nshall be recorded in the minutes taken at that meeting of the Committee, and that\nmember  shall  not  take  part  in  any  deliberation  or  decision  of  the  Committee\nrelating to the licence or other matter.\n\nA disclosure made by a member of the Committee under subsection (1),\n(2)\nto the effect that he is a director or shareholder, or has a significant economic\nrelationship with a specific company, firm or other person or is to be regarded as\ninterested in any contract which is made with the company, firm or other person\nshall, for the purposes of subsection (1), be a sufficient disclosure of his interest\nin relation to any contract so made.\n\nNo  action,  suit,  prosecution  or  other  proceedings  shall  be  brought  or\n(3)\ninstituted personally against any member of the Committee in respect of any act\ndone bona fide in pursuance of their duties, functions or in execution of this Act.\n\nObligation to secrecy\n\n8.(1)\nEvery  public  officer  or  person  having  an  official  duty  or  being\nemployed  in  the  administration  of  this  Act  shall  regard  as  confidential,  any\n\n\f12\n\ninformation  given  to  that  person  for  the  purposes  of  this  Act,  including  any\ninformation contained in databases, registers, records or documents kept for the\npurposes of this Act and used by that person in the performance of his duties.\n\nNotwithstanding subsection (1), a public officer or person may disclose\n\n(2)\ninformation in any of the following circumstances\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\npursuant to an order of the Court;\n\nto any person or an employee of the Government of Barbados, where\nthe public officer or person is authorised or required to do so in the\nperformance of his duties;\n\nwhere disclosure is permitted under any other enactment; or\n\nwhere the person to whom the confidential information relates consents\nto the disclosure.\n\nA person who receives information pursuant to subsection (2) shall regard\n\n(3)\nand deal with that information as confidential.\n\nA person who contravenes this section is guilty of an offence and is liable\n(4)\non summary conviction to a fine of $3 500 or to imprisonment for a term of one\nyear.\n\nDirections of the Minister\n\n9.\nThe Minister may give directions of a general nature as to the policy\nto be followed by the Director and the Committee in the performance of their\nfunctions under this Act, as appear to the Minister to be necessary in the public\ninterest, and the Director and the Committee shall comply with those directions.\n\nPowers of an inspector\n\n10.(1)\n\nAn inspector may\n\n(a)\n\nenter  and  inspect  any  premises  for  the  purposes  of  investigating  or\nassessing  an  application  for  a  wastewater  treatment  permit,  where\nrequired to do so by the Director;\n\n\f13\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nenter  and  search  any  premises  subject  to  a  wastewater  treatment\npermit  at  anytime  for  the  purposes  of  assessing  compliance  or  any\ninfringement with the provisions of this Act;\n\ntake  a  sample  from  any  system  subject  to  a  wastewater  treatment\npermit;\n\nstop  and  search  any  vehicle  on  premises  in  respect  of  which  a\nwastewater treatment permit has been granted;\n\nrequire  the  production  of  any  report  or  any  document  which  is\nreasonably  believed  to  contain  information  relevant  to  wastewater\ntreatment permit; or\n\n(f)\n\nexercise any other power related to inspection or investigation granted\nunder this Act.\n\nAn inspector may require a police officer to be present, where the inspector\n(2)\nacts in accordance with paragraph (b) of subsection (1) and that police officer\nshall assist the inspector in the search of the premises.\n\nAn inspector exercising powers under this section shall identify himself\n\n(3)\nby the production of the identification issued to him by the Minister.\n\nFor the purposes of this section,\n\n(4)\n“search” includes taking a copy of any document, taking a photograph or taking\na video or a voice recording or anything related thereto; or\n\n“vehicle” means a septic tank or any other similar motor vehicle which is used\n\nto transport wastewater, reclaimed water or non-potable water.\n\nInspections\n\n11.(1)\nThe  Director  may,  on  the  advice  of  the  Committee,  conduct  an\ninspection for the purpose of assessing an application or conduct an inspection\nat any other time to ensure compliance with this Act.\n\nAn  inspector  may,  for  the  purposes  of  subsection  (1),  enter  onto  any\n(2)\npremises  or  enter  into  any  private  road  connected  therewith  and  make  such\n\n\f14\n\nexaminations,  investigations,  inspections  or  other  studies  as  he  considers\nnecessary.\n\nThe  Director  may,  on  the  request  of  the  Committee,  send  a  person\n(3)\npossessing a particular expertise, who is not a public officer, to assess or inspect\nany premises in respect of an application, and that expert shall\n\n(a)\n\n(b)\n\n(c)\n\nbe given an instrument in writing from the Minister identifying him;\n\nonly enter the premises with an inspector; and\n\nsubmit a report to the Committee.\n\nIn the case of an application for a permit, an inspector shall submit a written\n(4)\nreport within 21 days of an inspection or re-inspection to the Director and that\nreport shall\n\n(a)\n\n(b)\n\n(c)\n\nmake a recommendation with respect to the application for the permit;\n\nstate whether the premises meet the requirements of this Act; and if the\npremises are deficient, the report shall state the measures which should\nbe taken to correct the deficiencies; or\n\nstate the date of any re-inspection which is required for the purpose of\nascertaining  whether  the  corrective  measures  have  been  taken  in\naccordance with paragraph (b).\n\nIn  the  case  of  an  inspection  of  premises  to  which  a  permit  applies,  an\n(5)\ninspector  shall  submit  a  written  report  to  the  Director  within  21  days  of  the\ninspection and that report shall\n\n(a)\n\nstate whether the permit holder is in compliance with this Act; and if\nnot in compliance, the report shall specify the provisions of this Act\nwhich have been infringed, or terms and conditions of the licence which\nhave been infringed;\n\n(b)\n\nstate the corrective action that should be taken by the permit holder and\nthe date by which such corrective action should be taken.\n\n\f15\n\nA person shall not hinder an inspector, an authorised officer or an expert\n\n(6)\nappointed under this Act\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nin the performance of his duties;\n\nby giving false information or misleading declarations;\n\nby bribing the inspector, authorised officer or expert; or\n\nby  refusing  to  provide  information,  reports  or  documents,  required\nunder this Act.\n\nA person who contravenes subsection (5) is guilty of an offence and is\n(6)\nliable on summary conviction to a fine of $50 000 or to imprisonment for 5 years\nor to both.\n\nPART III\n\nPERMIT APPLICATION AND ADMINISTRATION\n\nWastewater treatment permit\n\n12.(1)\nwastewater or reclaimed water may use\n\nA  person  seeking  to  operate  a  waste  water  treatment  plant  to  treat\n\n(a)\n\n(b)\n\n(c)\n\nagricultural wastewater;\n\nindustrial wastewater;\n\ndomestic wastewater; or\n\n(d)\n\nsurface runoff,\n\nto  provide  a  source  of  water  which  is  to  be  sold  for  non-potable  domestic  or\nhousehold use, commercial use, agricultural use or for industrial use and for uses\nrelated thereto.\n\nA person seeking to operate under subsection (1) shall obtain a wastewater\n\n(2)\ntreatment permit.\n\n\f16\n\n(3)\nThe Director, with the approval of the Committee, shall issue guidelines\nfor  persons  seeking  to  apply  for  a  wastewater  treatment  permit,  and  those\nguidelines  shall  give  information  with  respect  to  the  application  process,\ninclusive of the documents to be submitted with the application, and information\non the process for issuing a waste water treatment permit.\n\nThe Committee shall not consider an application where the person has not\n(4)\ncomplied  with  the  guidelines  issued  by  the  Director,  and  that  person  shall  be\nnotified of that fact in writing.\n\nA person seeking a wastewater treatment permit shall apply in such form\n(5)\nas  the  Committee  requires,  pay  the  application  fee  specified  in  the  Second\nSchedule and submit such information with the application as the Committee may\nrequire.\n\nAn application under this section as well as the relevant documents may\n\n(6)\nbe submitted\n\n(a)\n\n(b)\n\nin an electronic format for the attention of the Director; or\n\nby delivering the application and the relevant documents to the office\nof the Environmental Protection Department for the attention of the\nDirector.\n\nWhere  the  Director  receives  an  application  under  subsection  (5),  that\n(7)\napplication and all of the required documents shall be sent to the Committee; and\nthe Committee shall review the application and all required documentation and\nmake a determination or decision on the application.\n\n(8)\n\nThe Committee may decide to\n\n(a)\n\nsuspend the consideration of the application until the matters identified\nby  the  Committee  as  requiring  rectification  are  addressed  to  the\nsatisfaction of the Committee;\n\n(b)\n\napprove the application and grant the permit; or\n\n(c)\n\ndeny the application.\n\n\f17\n\n(9)\nWhere the Committee suspends consideration of an application, it shall\nnotify the person in writing of the matters which must be rectified for the applicant\nto qualify for a wastewater treatment permit.\n\n(10)\nThe Committee shall notify an applicant in writing of a decision to deny\nor  approve  an  application;  and  where  the  decision  is  to  grant  the  wastewater\ntreatment permit, the permit shall be granted to that person\n\n(a)\n\n(b)\n\non the payment of the fee specified in the Second Schedule; and\n\nin the form set out in the Third Schedule.\n\nThe    Director  shall,  on  behalf  of  the  Committee,  issue  a    wastewater\n\n(11)\ntreatment permit granted by the Committee.\n\nA wastewater treatment permit issued in accordance with this section shall\n(12)\nbe subject to such terms or conditions as the Committee specifies in that permit.\n\nA  wastewater  treatment  permit  granted  under  this  section,  is  not\n(13)\ntransferable,  and  may  be  renewed  on  a  further  application  made  under  this\nsection, and that application may be made at least one month before the expiration\nof the permit.\n\nA person who contravenes subsection (2) is guilty of an offence and is\n(14)\nliable on summary conviction to a fine of $ 200 000, or to imprisonment for a\nterm of 10 years or to both.\n\nA person who sells or shares non-potable water produced from wastewater\n(15)\nor reclaimed water without a wastewater treatment permit is guilty of an offence\nand is liable on summary conviction to a fine of $ 200 000, or to imprisonment\nfor a term of 10 years or to both.\n\n\f18\n\nUses of non-potable water\n\n13.(1)\nplant for\n\nA  person  may  use  non-potable  water  from  a  wastewater  treatment\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\ndomestic or household needs such as the flushing of water closets, for\nthe watering or irrigation for ornamental plants or trees and household\ngardens and the cleaning of outdoor surfaces and for related uses;\n\ncommercial uses such as the cleaning of outdoor surfaces, the flushing\nof water closets, the irrigation and watering of ornamental plants or\ntrees and for related uses;\n\nagricultural uses such as the watering or irrigation of edible crops or\nornamental plants or trees and cleaning of outdoor surfaces and animal\npens, coops or holding areas and for related uses;\n\nindustrial uses such as the flushing and cooling of equipment or water\nclosets,  for  use  in  the  watering  or  irrigation  of  green  spaces  and\nornamental plants or trees in industrial areas; or\n\n(e)\n\nwatering and irrigation of plants or trees in public areas as well for the\nrecharging of the groundwater, for use in surface ponds or lakes.\n\nWhere a person acts under subsection (1), that person shall purchase or\n(2)\nobtain the non-potable water from a person with a wastewater treatment permit.\n\nAny  person  with  a  wastewater  treatment  permit  who  sells  non-potable\n\n(3)\nwater shall create a register of any person who purchases reclaimed water.\n\nThe  register  to  be  kept  under  subsection  (3)  shall  record  the  following\n\n(4)\ninformation\n\n(a)\n\n(b)\n\nthe name, address and contact number of a person who purchased the\nnon-potable water;\n\nthe  intended  use  for  the  non-potable  water  and  the  volume  of  non-\npotable water sold to that person;\n\n\f19\n\n(c)\n\nthe date of the purchase of the non-potable water;\n\n(d)\n\nsuch other information as may be required by the Minister.\n\nAn inspector may inspect a register kept under subsection (4) at anytime\n\n(5)\nand take copies of the information therein as may be required by the Director.\n\nA person who contravenes subsection (3) is guilty of an offence and is\n(6)\nliable on summary conviction to a fine of $ 50 000, or to imprisonment for a term\nof 5 years or to both.\n\nRegisters\n\nThe Director shall keep for the use of the Committee, a register to be\n14.(1)\nknown as the “Wastewater Register”, and that register shall contain the following\nparticulars:\n\n(a)\n\nthe name, address and contact number of a person granted a wastewater\ntreatment permit;\n\n(b)\n\nthe number of the wastewater treatment permit issued to that person;\n\n(c)\n\n(d)\n\nthe date  the wastewater treatment permit was issued as well as the date\nof expiration;\n\nthe company name, company registration number, registered business\naddress of the company and the name of the Directors of the company;\nand\n\n(e)\n\nspecify  the  periods  of  suspension  of  the  permit  and  the  date  of\nrevocation of the permit.\n\nThe  Director  shall  publish  in  the  Official  Gazette,  a  list  of  the  persons\n(2)\ngranted a wastewater treatment permit, as well as the registered business address\nof that person.\n\nWarning or caution letters\n\n15.(1)\nIn circumstances where an inspection reveals an area of concern which\nwas the subject of a prior request for redress or rectification, the Director may\n\n\f20\n\nissue  a  written  warning  to  the  person  issued  the  wastewater  treatment  permit\nrequiring that the area of concern be addressed within a specified time period.\n\n(2)\n\nThe warning in writing issued under subsection (1) shall\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nstate the area of concern;\n\ngive  details  of  prior  written  requests  for  the  redress  of  the  area  of\nconcern;\n\nindicate what needs to be rectified and the date by which compliance\nis required;\n\nstate the number of times written requests were sent to the permit holder\nrequesting the redress of the area of concern; and\n\n(e)\n\nstate the result of noncompliance such as suspension or cancellation.\n\nA person issued a wastewater treatment permit who rectifies the areas of\n(3)\nconcern before the period stated in subsection (2)(c) may request a re-inspection\nand pay the re-inspection fee specified in the Second Schedule, and that inspection\nshall be done in accordance with this Act.\n\nWhere the Director issues more than one warning under subsection (1), he\n\n(4)\nmay revoke or suspend the wastewater treatment permit.\n\nRevocation and Suspension of licence\n\n16.(1)\nwastewater treatment permit where\n\nThe  Director  may  with  immediate  effect,  suspend  or  revoke  a\n\n(a)\n\n(b)\n\n(c)\n\nthe person granted the wastewater treatment permit fails or refuses to\ncomply with this Act or with any request or direction given by notice\nin writing under this Act;\n\nthe person granted the wastewater treatment permit is convicted of an\noffence under this Act;\n\nthere is a direct or indirect danger to the health or safety of persons\nusing the non-potable water from a wastewater treatment plant, and the\n\n\f21\n\nrelevant authorities have given the necessary notifications under the\nHealth  Services  Act,  Cap.  44,  Safety  and  Health  at  Work  Act,\nCap. 356 or under any other relevant enactment;\n\n(d)\n\nthe  person  granted  the  wastewater  treatment  permit  has  altered\noperations  in  such  a  manner  that  it  no  longer  complies  with  the\nwastewater treatment permit issued to that person; or\n\n(e)\n\nthe person granted the wastewater treatment permit, his agent or his\nemployee refuses to permit an inspection in accordance with this Act.\n\nWhere the Director determines that it is necessary to suspend or revoke a\n\n(2)\nwastewater treatment permit, he shall\n\n(a)\n\nissue a notice in writing to that effect to the permit holder, and that\nnotice shall state the following:\n\n(i)\n\nthe reason for the suspension or revocation; or\n\n(ii)\n\na time period by which the matter should be rectified, where the\nissue can be rectified;\n\n(b)\n\ngive the permit holder 10 days from the date of the notice referred to\nin paragraph (a) to submit reasons to the Director why the permit should\nnot be suspended or revoked.\n\nWhere a suitable explanation has not been received from the person granted\n(3)\nthe  wastewater  treatment  permit,  at  the  end  of  the  time  period  mentioned  in\nsubsection (2)(b), the permit may be revoked or suspended, and the person shall\nbe notified in writing.\n\nWhere the Minster revokes or suspends a wastewater treatment permit, the\n(4)\nMinister shall publish a notice of the suspension or revocation in the Official\nGazette, and where the publication relates to a suspension, it shall state the period\nof the suspension.\n\nWhere a wastewater treatment permit is revoked or suspended under this\n(5)\nsection, no person shall perform any of the actions or activities authorised by the\npermit.\n\n\f22\n\n(6)\nA person who contravenes subsection (5) is guilty of an offence and is\nliable on summary conviction to a fine of  $250 000 or to imprisonment for 10\nyears or to both.\n\nAmendment of Permit\n\n17.(1)\n\nThe Director may amend a wastewater treatment permit to\n\n(a)\n\nchange the particulars in a permit where the person granted the permit\nhas changed the address of the business, changed the company name\nor changed the registered business name;\n\n(b)\n\nchange the particulars in a permit where the person granted the permit\nhas changed their name or changed their residential address; or\n\n(c)\n\namend the terms or conditions under which the permit is granted.\n\nThe  Director  may  require  information  or  documents  to  confirm  the\n\n(2)\ninformation under subsection (1).\n\nWhere  the  Director  acts  under  subsection  (1)(c),  he  shall  not  amend  a\n(3)\nwastewater  treatment  permit  without  giving  the  person  written  notice  of  the\nintended action and the reason for it, and an opportunity to make representations\nin relation thereto.\n\nDisplay of Permit\n\n18.(1)\nA person granted a wastewater treatment permit may display a copy\nof  that  permit  in  a  conspicuous  place  on  the  premises  where  he  operates  his\nbusiness, and shall where the permit is not displayed, ensure that the permit is\navailable to be inspected on request.\n\nThe Director shall publish in the Official Gazette by the 31st of January\n\n(2)\neach year a list of persons issued a permit under this Act.\n\n\f23\n\nDuty due to suspension or revocation\n\n19.(1)\nIn circumstances where the Director suspends or revokes a wastewater\ntreatment permit the person granted that permit shall discontinue the activity to\nwhich the permit relates.\n\nA person who contravenes subsection (1) is guilty of an offence and is\n(2)\nliable on summary conviction to a fine of $ 250 000 or to imprisonment for 10\nyears or to both.\n\nPART IV\n\nMISCELLANEOUS\n\nAmendment of Schedule\n\n20.\n\nThe Minister may by an order amend the Schedules.\n\nGeneral Offences\n\n21.(1)\n\nAny person who\n\n(a)\n\ndistributes,  produces,  treats  or  sells  non-potable  water  without  a\nwastewater treatment permit;\n\n(b)\n\nfails to register a person who purchases non-potable water;\n\n(c)\n\n(d)\n\n(e)\n\nallows water to be available for domestic use or human consumption\nwhich is not suitable for domestic use or human consumption;\n\nuses non-potable water as potable water in a manner that may endanger\nmembers of the public;\n\nfails to comply with the terms and conditions of a wastewater treatment\npermit; or\n\n\f24\n\n(f)\n\nuses  night  soil,  yellow  water,  black  water  or  brown  water  to  water,\nirrigate or treat edible crops which are to be sold or which are sold or\ngiven to any person for use or consumption by that person or another\nperson\n\nis guilty of an offence.\n\nA person who contravenes subsection (1) is guilty of an offence and is\n(2)\nliable on summary conviction to a fine of $500 000 or to imprisonment for 5 years\nor to both.\n\nOffence continuing after conviction\n\nWhere  a  person  is  convicted  under  this  Act,  and  the  contravention\n22.\ncontinues  after  conviction,  then,  unless  he  has  a  reasonable  excuse  for  the\ncontinued contravention, he is guilty of a further offence under this Act and may,\non conviction, be penalized in accordance with section 21(2).\n\nRegulations\n\n23.(1)\n\nThe Minister may make regulations prescribing\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe standards of treatment to be applied to obtain non-potable water\nfrom wastewater or reclaimed water;\n\nstandards for the treatment of wastewater or reclaimed water to be use\nby a wastewater treatment plant;\n\nthe  standards  to  be  used  to  construct  retaining  walls,  storage  tanks,\nbuildings  and  other  relevant  structures  to  be  used  with  respect  to\nstorage, treatment of wastewater or reclaimed water;\n\nthe standards to be applied in plumbing works, such as colour coding\nor labelling and other related matters for the use of reclaimed water;\n\nmechanisms and standards to be applied to wastewaste discharge as\nwell as the manner of wastewater or reclaimed water discharge;\n\n\f25\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\ntests to be used internally by a person granted a wastewater treatment\npermit  and  the  form  and  procedure  for  submission  of  the  testing  in\nformation to the Water Reuse Committee or the Director;\n\nthe  safe  operating  procedures  for  persons  granted  a  wastewater\ntreatment permit under this Act;\n\nthe forms and types of training and certification which a person issued\nwastewater treatment permit must ensure among employees;\n\nsuch fees and forms as may be required; or\n\nadministrative penalties to assist with ensuring compliance with this\nAct; or\n\n(k)\n\ngenerally, for giving effect to this Act.\n\nWhere  the  regulations  made  under  this  Act  create  an  offence,  the\n(2)\nregulations may provide for such offences to be tried summarily or on indictment\nand the regulations may prescribe the following penalties:\n\n(a)\n\n(b)\n\nin  the  case  of  an  offence  triable  summarily,  a  fine  of  $500  000  or\nimprisonment for a term of 5 years or to both; or\n\nin the case of an offence triable on indictment, a fine of $1 000 000 or\nimprisonment for a term of 8 years or to both.\n\nAct binds the State\n\n24.\n\nThis Act binds the State.\n\nCommencement\n\n25.\n\nThis Act shall come into force on a day to be fixed by proclamation.\n\n\f26\n\nFIRST SCHEDULE\n\nConstitution of the Water Reuse Committee\n\n(Section 3)\n\n1.\ncomposed in the manner specified in paragraph 2.\n\nThe  Water  Reuse  Committee  shall  comprise  7  persons  and  be\n\n2.\n\nThe Water Reuse Committee shall consist of the following:\n\n(a)\n\n(b)\n\n(c)\n\nChief Medical Officer, ex officio or his nominee;\n\nDirector, ex officio or his nominee;\n\nSolicitor General, ex officio or his nominee;\n\n(d)\n\nDirector, Coastal Zone Management Unit  ex officio or his nominee;\n\n(e)\n\nChief Agricultural Officer,  ex officio or his nominee;\n\n(f)\n\nDirector, Government Analytical Services  ex officio or his nominee;\nand\n\n(g)\n\nDirector of Planning and Development ex officio or his nominee.\n\n3.\nsummon a meeting of the Committee.\n\nThe Director shall be the Chairman and the Chairman may at any time\n\n4.\nThe  Chief  Medical  Officer  shall  be  the  Deputy  Chairman  for  the\npurposes of the Committee and shall in the absence of the Chairman function as\nthe chairman of the Committee.\n\n5.\nThe  Minister  shall  assign  a  public  officer  from  the  Ministry  with\nresponsibility  for  water  reuse,  as  secretary  to  the  Committee  to  assist  the\nCommittee with such clerical and secretarial duties as may be required.\n\n\f27\n\n6.\nthis Act, the Committee may regulate its own procedure and proceedings.\n\nFive members of the Committee shall form a quorum, and, subject to\n\n7.(1)\nbe necessary or expedient for the transaction of its business.\n\nSubject to paragraph 3, the Committee shall meet at such times as may\n\nSubject to paragraph 8, the Committee shall meet at such places as may be\n\n(2)\nnecessary or expedient for the transaction of its business.\n\nThe  public  officer  assigned  under  paragraph  5  shall  ensure  that  proper\n(3)\nminutes  are  kept  for  each  meeting  and  that  these  minutes  are  confirmed  and\napproved verbally or in writing at each subsequent meeting or confirmed prior\nto  such  a  meeting  by  an  electronic  means  that  the  Committee  permits  by\nagreement.\n\nThe decisions of the Committee shall be by a majority of votes and, in\n(4)\naddition to an original vote, the person presiding as Chairman at a meeting shall\nhave a casting vote in any case in which the voting is equal.\n\nThe validity of the proceedings of the Committee shall not be affected by\n\n(5)\nany vacancy amongst the members of the Committee.\n\n8.\nThe  Committee  shall  be  subject  to  such  directions  of  a  general\ncharacter in respect of the policy and practice to be followed in the exercise of\nits functions under this Act as the Minister may give.\n\n\f28\n\nSECOND SCHEDULE\n\n(Sections 12(5), (10) and 15(3))\n\nApplication Fees and Permit Fees\n\nApplication fee for a Wastewater Treatment\nPermit\n\n$50.00\n\nGrant of a Wastewater Treatment Permit\n\n$200.00\n\nRe-inspection fee\n\n$150.00\n\n\f29\n\nL.R.O. 1998THIRD SCHEDULE(Section 12(10))Water Reuse Act, 2022 WASTEWATER TREATMENT PERMITPermit Number:[company incorporated /registered business ] witha business [ ].IS HEREBY AUTHORISED by the Water Reuse Committee to operate in accordance with section 10 of the Water Reuse Act, 2022.This wastewater treatment permit is valid for one year commencing on the day of .TERMS AND CONDITIONS OF THE PERMITThis wastewater treatment permit is subject to the following terms and conditions:This licence expires on the               day of                             , 20          .Dated theday of, 20            .ChairmanWater Reuse Committee(insert company number)(insert certiﬁ cate number)(address of business or individual)(type of business)(date)(month)(year)\f30\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2022.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2022.\n\nPresident\n\n"
}