{
  "bill_id": 608,
  "slug": "constitution-amendment-bill-2022",
  "title": "Constitution (Amendment) Bill, 2022",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/5787ccd775ab7255c22fcfb45b11b1b4.pdf",
  "current_stage": "",
  "chamber": "The Senate",
  "notice_date": "2022-02-09",
  "first_reading": "2022-02-04",
  "gazette_date": "2022-02-07",
  "markdown": "2022/02/04\n\nOBJECTS AND REASONS\n\nThis  Bill  would  alter  the  Constitution  to  change  the  qualifications  for\nmembership  of  the  Senate  and  the  House  of  Assembly  and  to  make  better\nprovision for a vacancy in the office of the Leader of the Opposition.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nRepeal and replacement of section 37 of the Constitution\n\nRepeal and replacement of section 43 of the Constitution\n\nRepeal and replacement of section 75 of the Constitution\n\n1.\n\n2.\n\n3.\n\n4.\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to alter the Constitution to change the qualifications for membership\n\nof the Senate and the House of Assembly.\n\nENACTED by the Parliament of Barbados in accordance with the provisions\n\nof section 49 of the Constitution as follows:\n\n\f4\n\nShort title\n\n1.\n\nThis Act may be cited as the Constitution (Amendment) Act, 2022.\n\nRepeal and replacement of section 37 of the Constitution\n\n2.\nsubstituted:\n\nSection  37  of  the  Constitution  is  repealed  and  the  following  is\n\n“Qualification for membership of the Senate\n\n37.\nSubject to the provisions of section 38, any person who at\nthe  date  of  his  appointment  is  a  citizen  of  Barbados  of  the  age  of\neighteen  years  or  upwards  shall  be  qualified  to  be  appointed  as  a\nSenator.”.\n\nRepeal and replacement of section 43 of the Constitution\n\n3.\nsubstituted:\n\nSection  43  of  the  Constitution  is  repealed  and  the  following  is\n\n“Qualifications for membership of the Assembly\n\n43.\n\nSubject to the provisions of section 44, any person who\n\n(a)\n\n(b)\n\nis  a  citizen  of  Barbados  of  the  age  of  eighteen  years  or\nupwards; and\n\nhas such connection with Barbados by residence therein as\nmay be prescribed by Parliament,\n\nshall  be  qualified  to  be  elected  as  a  member  of  the  House  of\nAssembly.”.\n\n\f5\n\nRepeal and replacement of section 75 of the Constitution\n\n4.\nsubstituted:\n\nSection  75  of  the  Constitution  is  repealed  and  the  following  is\n\n“Vacancy in the office of the Leader of the Opposition\n\n75.(1)\nConstitution provides that\n\nWhere  there  is  no  Leader  of  the  Opposition  and  the\n\n(a)\n\nthe President, the Prime Minister or any other person shall\nact  in  accordance  with  the  advice  of  the  Leader  of  the\nOpposition; or\n\n(b)\n\nthe President, the Prime Minister or any other person shall\nact after consultation with the Leader of the Opposition,\n\nthe reference to the Leader of the Opposition shall be read as a reference\nto the opposing political party which obtained the highest number of\nvotes in the general election following the dissolution of Parliament.\n\nWhere the opposing political party which obtained the highest\n(2)\nnumber  of  votes  in  the  general  election  following  the  dissolution  of\nParliament fails or refuses to advise or facilitate consultation with the\nPresident, the Prime Minister or any other person in accordance with\nsubsection (1), the President, the Prime Minister or that other person\nshall seek the advice of or consult with the opposing political party that\nreceived  the  next  highest  number  of  votes  in  succession  and  if  no\nopposing  political  party  advises  or  facilitates  consultation  with  the\nPresident, the Prime Minister or that other person, the President, the\nPrime Minister or that other person shall act in his discretion.\n\nFor the purposes of subsections (1) and (2), the opposing political\n(3)\nparty shall designate in writing the person whose advice the President,\nthe Prime Minister or that other person shall seek or consult with.\n\n\f6\n\n(4)\nFor the purposes of this section, \"opposing political party\" means\nthe members of a political party which contested the elections but who\ndo not form the Government.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2022.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2022.\n\nPresident\n\n"
}