{
  "bill_id": 628,
  "slug": "resolution-re-st-joseph-hospital-ashton-hall-st-peter",
  "title": "Resolution re St. Joseph Hospital Ashton Hall St. Peter",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/496fb896bfa89684c3ab50abfcfd464c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-04-27",
  "first_reading": "2022-05-04",
  "gazette_date": null,
  "markdown": "2022-04-19\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the  Crown\n\nLands  (Vesting  and  Disposal)  Act,  Cap.  225  approve  the  vesting  in  a  commercial  Special\n\nPurpose  Vehicle  in  which  the  Government  of  Barbados  will  hold  25%  of  the  shares  and\n\nThe  University  of  the  West  Indies  at  Cave  Hill  will  hold  75%  of  the  shares,  of  the  parcel\n\nof  land,  the  property  of  the  State,  formerly  known  as  the  St.  Joseph  Hospital  situate  at\n\nAshton Hall in the parish of Saint Peter in this Island and more particularly described in the\n\nSchedule for a joint venture between the Government and The University of the West Indies.\n\nAPPROVED by the House of Assembly this                  day of                                                ,\n\nTwo thousand and twenty-two.\n\nSPEAKER\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and twenty-two.\n\nPRESIDENT\n\n\f2\n\nSCHEDULE\n\nAll  THAT  land  the  property  of  the  State,  namely  Lot A  (formerly  known  as\n\nthe  St.  Joseph  Hospital)  situate  at Ashton  Hall  in  the  parish  of  Saint  Peter  in  this  Island\n\ncontaining  by  admeasurement  8.698  hectares  (86982.2  square  metres)  inclusive  of  0.50\n\nhectares (503.2 square metres) in road or thereabouts abutting and bounding on lands now or\n\nlate of Monique Robinson (Lot 18A), Ancil and Merlyn Scott (Lot 208), Clarence Fergusson and\n\nP.  Sobers  (Lot  207),  and  Judith  Bowen  (Lot  206),  on  lands  now  or  formerly  of A.G.C.G.\n\nHoldings Ltd. (Lot 138), on lands now or late of Simon Brathwaite and Cynthia Balfour (Lot 137),\n\non lands now or formerly of The New Village Retirement Home Ltd.  (Lot 110A), on lands now\n\nor late of W. Oneale, Clovis Boyce, and Andrew Boyce and on a public road known as Highway 1\n\nwhich leads to Mile & A Quarter in one direction and to Speightstown in the other direction\n\nor  however  else  the  same  may  abut  and  bound  as  shown  and  delineated  on  a  Plan  certiﬁ ed\n\non  the  15th  day  of  July,  2014  by  Samuel  N.  Taylor,  Land  Surveyor  and  recorded  in  the\n\nLands  and  Surveys  Department  on  the  16th  day  of  July,  2014  as  Plan  No.  620/2014.\n\n\f3\n\nADDENDUM\n\n  On the 21st day of December, 2021 the Cabinet agreed to the vesting of approximately\n\n8.698  hectares  (21.485  acres)  of  land  together  with  the  buildings  thereon,  formerly  known\n\nas  the  St.  Joseph  Hospital,  situate  at Ashton  Hall  in  the  parish  of  Saint  Peter  in  this  Island\n\nin  a  commercial  Special  Purpose  Vehicle  in  which  the  Government  of  Barbados  will  hold\n\n25% of the shares and The University of the West Indies at Cave Hill will hold 75% of the\n\nshares  for  a  joint  venture  between  the  Government  and  The  University  of  the  West  Indies.\n\nThe parcel of land was conveyed to the Crown by Conveyance made on the 27th day of\n\nSeptember,  1988  between  Mother  of  Sorrow  Convent  Milwaukee,  Inc.  of  the  One  Part  and\n\nThe Crown of the Other Part and recorded in the Land Registry as Deed No. 9293 of 1988.\n\nIn  accordance  with  the  provisions  of  section  5  of  the  Crown  Lands  (Vesting  and\n\nDisposal)  Act,  Cap.  225  the  approval  of  Parliament  is  now  sought  for  the  vesting  in  the\n\ncommercial  Special  Purpose Vehicle  of  the  parcel  of  land  described  in  the  Schedule  for  the\n\njoint venture.\n\n"
}