{
  "bill_id": 629,
  "slug": "rescission-of-land-situate-at-ashton-hall-st-peter",
  "title": "Rescission of land situate at Ashton Hall St. Peter",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b457f4b44fe3100c582716e4303ec43c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-04-27",
  "first_reading": "2022-05-04",
  "gazette_date": null,
  "markdown": "2022-04-19\n\nPARLIAMENT\n\nWHEREAS  a  Resolution  was  passed  by  the  Honourable  House  of\n\nAssembly on the 16th day of March, 2012 and by the Honourable Senate on the 28th day of\n\nMarch,  2012,  was  assented  to  by  His  Excellency  the Acting  Governor-General  on  the  2nd\n\nday  of April,  2012  and  was  published  in  the  Oﬃ  cial  Gazette  as  Resolution  No.  12/2012  on\n\nthe 5th day of April, 2012 approving the lease to American World Clinics (Barbados) Limited\n\nof a parcel of land together with the buildings thereon situate at Ashton Hall in the parish of\n\nSaint Peter in this Island for the development and operation of an international health centre.\n\nAND WHEREAS it has been determined that Resolution No. 12/2012 should\n\nbe rescinded;\n\n12/2012.\n\nBE IT RESOLVED that Parliament approve the rescission of Resolution No.\n\n\f2\n\nAPPROVED by the House of Assembly this          day of                                     , Two\n\nthousand and twenty-two.\n\nSPEAKER\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and twenty-two.\n\nPRESIDENT\n\n\f3\n\nADDENDUM\n\n    On  the  30th  day  of  June,  2011  the  Cabinet  approved  the  text  of  a  Memorandum  of\n\nUnderstanding  between  the  Government  of  Barbados  and American  World  Clinics  (Barbados)\n\nLimited with respect to the lease to American World Clinics (Barbados) Limited of a parcel of land\n\ntogether with the buildings thereon situate at Ashton Hall in the parish of Saint Peter in this Island\n\nand containing approximately 21.485 acres (8.695 hectares), known as the St. Joseph Hospital, for\n\nthe development and operation of an international health care centre.\n\n  On the 8th day of March, 2012 the Cabinet approved the introduction into Parliament of a\n\nResolution seeking approval for the lease.\n\nThe Resolution was passed by the Honourable House of Assembly on the 16th day of March,\n\n2012  and  by  the  Honourable  Senate  on  the  28th  day  of  March,  2012,  was  assented  to  by  His\n\nExcellency the Acting Governor-General on the 2nd day of April, 2012 and was published in the\n\nOﬃ  cial Gazette as Resolution No. 12/2012 on the 5th day of April, 2012.\n\nThe lease, however, was never executed by the prospective lessee.\n\n\f4\n\nADDENDUM - (Concl'd)\n\n  On  the  21st  day  of  December,  2021  the  Cabinet  agreed  to  rescind  its  decision  of\n\n8th March, 2012 and instead agreed to vest the lands of approximately 8.698 hectares (21.485 acres)\n\ntogether with the buildings thereon situate at Ashton Hall in the parish of Saint Peter in this Island\n\nin a Special Purpose Vehicle in order to facilitate a joint venture between the University of the\n\nWest Indies at Cave Hill and the Government of Barbados whereby a commercial Special Purpose\n\nVehicle would be created where the Government will own 25% of the shares and the University of\n\nthe West Indies 75% of the shares.\n\nThe  approval  of  Parliament  is  therefore  now  sought  for  the  rescission  of  Resolution\n\nNo. 12/2012.\n\n"
}