{
  "bill_id": 62,
  "slug": "borrowing-from-first-citizens-bank-limited-of-250-million",
  "title": "Borrowing from First Citizens Bank Limited of $25.0 million",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/bb86bc62e097c0fcd0b5bbef9c6e7afc.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2014-11-19",
  "first_reading": "2014-11-19",
  "second_reading": null,
  "gazette_date": null,
  "passed_date": "2014-11-19",
  "markdown": "                                                                                                                                2014-11-10\n\nRESOLUTION NO.\n\nPARLIAMENT\n\nWHEREAS  by  section  2  of  the  Special  Loans  Act,  Cap.  105  the  Government\n\nis  authorized  from  time  to  time  to  borrow  from  any  bank,  corporation,  company  or\n\nother  institution  sums  of  money  not  exceeding  in  the  aggregate  BDS$2,500,000,000.00  on\n\nsuch  terms  as  may  be  agreed  upon  between  the  Government  and  the  lender  of\n\nany such sum of money;\n\nAND  WHEREAS  by  section  3  of  the  said Act  it  is  provided  that  any  money\n\nborrowed  under  the  authority  of  the  Act  shall  be  appropriated  and  applied  to  such\n\npurposes  as  Parliament  may  approve  by  resolution  and  that  such  money  and  any\n\ninterest  payable  thereon  is  charged  upon  the  general  revenues  and  assets  of  Barbados;\n\nAND  WHEREAS  the  Government  considers  it  necessary  to  borrow  the  sum  of\n\nUS$25.0 million from First Citizens Bank Limited for the purpose of funding the initial deposit\n\nrequired for the Government of Barbados to become a \"C\" member of the Development Bank of\n\nLatin America, on the terms and conditions contained in the Agreement, the main provisions of\n\nwhich are set out in the Schedule;\n\n\fL.R.2\n\nAND  WHEREAS  the  said  sum  of  US$25.0  million  is  within  the  authorized\n\nborrowing limit given to the Government under section 2 of the said Act;\n\nRESOLVED  therefore  that  Parliament  approve  the  borrowing  of  the\n\nsaid  sum  of  US$25.0  million  from  First  Citizens  Bank  Limited  to  fund  the  initial\n\ndeposit  required  for  the  Government  of  Barbados  to  become  a  \"C\"  member  of  the\n\nDevelopment Bank of Latin America on the terms and conditions contained in the Agreement, the main\n\nprovisions of which are set out in the Schedule.\n\nAPPROVED  by  the  House  of  Assembly  this                                      day  of\n\n                                                , 2014.\n\nSpeaker\n\n APPROVED  by  the  Senate  this                      day  of                                                                  ,\n\n2014.\n\nPresident\n\n\f3\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nGovernment of Barbados (GOB).\n\nFirst Citizens Bank Limited or any of its afﬁ liates.\n\nUS$25,000,000.00\n\nTo fund the initial deposit required for the Government of Barbados\nto become a \"C\" member of the Development Bank of Latin America\n(CAF).\n\nBorrower:\n\nLender:\n\nAmount:\n\nPurpose:\n\nFacility Type:\n\nShort term demand loan.\n\nTenor:\n\nRepayment:\n\nCommitment Fee:\n\nInterest rate:\n\nConditions precedent:\n\nNine (9) months.\n\nInterest  payable  monthly  and  principal  to  be  liquidated  in  full  at\nmaturity.\n\n1.375% of the facility, 0.69% of which is payable upon acceptance\nof the offer.\n\nSix (6) month LIBOR plus 6.42% p.a.  Current effective rate 6.75%,\nnet of withholding tax.\n\nThe  disbursement  of  funds  on  the  facility  is  conditional  upon  the\npreparation, execution and delivery of legal documentation in the form\nand substance satisfactory to the Lender and its Attorneys incorporating\nsubstantially  the  terms  set  forth  in  the  Term  Sheet  subject  to  all\nconditions  precedent  being  satisﬁ ed  including  but  not  limited  to:\n\n(i)\n\nLetter of Undertaking from Ministry of Finance and Economic\nAffairs (MOFEA) of Barbados indicating that they will utilize\nthe initial CAF loan facility obtained for the repayment of the\nproposed facility.\n\n\f4\n\n(ii)  Authorisation  from  all  Government  Regulatory  authorities  in    Barbados\n\nwith respect to the facility.\n\n(iii)  Any additional documents as guided by the Attorney-at-Law engaged in the\n\nmatter.\n\n(iv)  Any  further  downgrade  in  credit  ratings  of  Barbados  during  the  term  of\nthe loan may result in the review of the terms and conditions of the loan\nat the Lender's discretion including but not limited to an adjustment to the\ninterest rate.  In the event of a further one notch downgrade the interest rate\nmay be increased by 0.5% to 0.75% per annum.  The  Lender retains the\nright to renegotiate the terms and conditions of the Credit Facility should\ndowngrades persist.\n\n(v)  Copies  of  the  signed  agreements  evidencing  that  the  Government  of\nBarbados was considered, assessed and pre-qualiﬁ ed for \"C\" membership\nin  CAF  which  is  to  be  reviewed  by  in-house  Legal  Counsel  and  found\nacceptable to the Lender.\n\n(vi)  Conﬁ rmation from CAF that the Government of Barbados will be accepted\nas a \"C\" member upon payment of the initial US$25.0 million and beneﬁ t\nfrom full rights of a \"C\" member, evidenced by signed agreement between\nCAF and  the Government of Barbados to this effect.\n\n(vii)  Conﬁ rmation from CAF regarding the availability of a minimum US$25.0\n\nmillion in the ﬁ rst six (6) months of membership being granted.\n\n(viii)  Written conﬁ rmation from CAF that loan proceeds may be used to repay\nproposed  facility,  to  be  reviewed  by  in-house  Legal  Counsel  and  found\nacceptable to the Lender.\n\n(viiii) Conﬁ rmation  from  the  Central  Bank  of  Barbados  that  there  will  be  no\nhindrance to the Government of Barbados remitting the full amount due at\nmaturity to the Bank in accordance with exchange control regulations of\nBarbados.\n\n\f5\n\nLegal expenses and\nother expenses:\n\nAll legal and out-of-pocket expenses incurred by the Bank in connection with the\nfacility is for the account of the Borrower.\n\n  Events of default:\n\nUsual and customary for transactions of this type, to include, without limitation,\nnon-payment of principal, interest and fees;  violation of covenants; inaccuracy\nof  representations and warranties; cross defaults; bankruptcy.  Also any material\nadverse change being any change in circumstances including without limitation\nfinancial  and/or  trading  and/or  economic  conditions  and  the  political\nsituation  whether  or  not  relating  to  the  Borrower,  which  in  the  reasonable\nopinions of the Lender would be likely to have a material adverse effect on the Bor-\nrower or the ability or willingness to perform or comply with any of its obligations\nunder the facility or under any related ﬁ nance or security document.\n\n  Cross default:\n\nWhere\n\n(a)\n\n(b)\n\nthe Borrower has ﬁ nancial indebtedness to any other ﬁ nancial institution and such\nﬁ nancial institution becomes entitled to declare such ﬁ nancial indebtedness due\nand payable prior to its speciﬁ ed maturity as a result of an event of default; and\n\nany encumbrance to secure any ﬁ nancial indebtedness of the Borrower to any\nother ﬁ nancial institution becomes enforceable, the Lender shall immediately\nbe entitled to declare that the facility is cancelled, and/or to demand repayment\nof all advances together with all interest and other monies due under the Term\nSheet, including legal fees and related costs that might also be incurred if the\nfacility is cancelled whereupon the same shall become immediately due and\npayable without presentment, demand, protest or any other notice whatsoever.\n\nAll payments by the Borrower will be made free and clear of all present  and future\ntaxes,  withholdings or deductions of whatsoever nature.  The Borrower will also be\nresponsible for the due payment of all levies, imposts, taxes and duties or charges\nincurred in connection with this facility.\n\n# Taxation:\n\nGoverning law:\n\nLaws of the Republic of Trinidad and Tobago.\n\n\f   L.R.O. 1998\n\n6\n\nADDENDUM\n\nThis Resolution seeks the approval of Parliament for the borrowing of US$25.0 million, a sum which\n\nis within the limit of the Special Loans Act, Cap. 105, from First Citizens Bank Limited.\n\nThe purpose of the loan is to fund the initial deposit required for the Government of Barbados to\n\nbecome a \"C\" member of the Development Bank of Latin American (CAF).\n\nTHE LAWS OF BARBADOS\nPrinted by the Government Printer, Bay Street, St. Michael\nby the authority of the Government of Barbados\n\n"
}