{
  "bill_id": 631,
  "slug": "airport-service-charge-bill-2022",
  "title": "Airport Service Charge Bill, 2022",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/da780d7b6f67a82e9c874de0c60b8557.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-05-25",
  "first_reading": "2022-06-01",
  "gazette_date": "2022-05-23",
  "markdown": "2022-03-14\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the imposition and collection of an airport service\n\ncharge.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nAirport service charge\n\nCarrier to collect charge\n\nCollector and others may charge commission\n\nCollector to distribute payments\n\nRefund\n\nRecovery of charge\n\nOffence\n\n10.\n\nRegulations\n\n11.\n\nRepeal of Cap. 59\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the imposition and collection of an airport service\n\ncharge.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Airport Service Charge Act, 2022.\n\n\f4\n\nInterpretation\n\n2.(1)\n\nIn this Act,\n\n“aircraft” means any machine for flying, whether propelled by mechanical means\n\nor not, and includes any description of balloon;\n\n“Airport” means the Grantley Adams International Airport;\n\n“airport service charge” or “charge” means the charge imposed by section 3;\n\n“carrier” means\n\n(a)\n\na  person  who  transports  passengers  by  aircraft  on  a  flight  from  the\nAirport to a place outside Barbados;\n\n(b)\n\nthe pilot or other person in command or control of the aircraft;\n\n(c)\n\n(d)\n\nthe agent in Barbados of the person referred to in paragraph (a); and\n\nwhere the person referred to in paragraph (a) or the agent of the person\nis a corporation, any director or manager of the corporation;\n\n“collector” means Grantley Adams International Airport Inc. or such other person\n\nas may be designated under subsection (2);\n\n“Community” means the Caribbean Community established by Article 2 of the\nRevised Treaty of Chaguaramas and includes the CARICOM Single Market\nand Economy signed at Nassau, the Bahamas on 5th July, 2001;\n\n“regional destination” means\n\n(a)\n\n(b)\n\n(c)\n\na member of the Community;\n\nCuba;\n\nthe Dominican Republic;\n\n(d)\n\nthe islands of the British Antilles;\n\n(e)\n\nthe islands of the Dutch Antilles;\n\n(f)\n\nthe islands of the French Antilles;\n\n\f5\n\n(g)\n\n(h)\n\nthe Commonwealth of Puerto Rico;\n\nthe Virgin Islands of the United States.\n\n(2)\nThe  Minister  may  by  order,  subject  to  negative  resolution,  designate  a\nperson other than Grantley Adams International Airport Inc. to be the collector\nfor the purposes of this Act.\n\nAirport service charge\n\n3.(1)\nplace outside Barbados, a charge to be known as the airport service charge.\n\nThere shall be imposed on a person who travels from the Airport to a\n\n(2)\n\nWhere a person travels to a place which\n\n(a)\n\n(b)\n\nis a regional destination, the charge shall be $70;\n\nis not a regional destination, the charge shall be $140.\n\nNotwithstanding  subsection  (1),  the  airport  service  charge  shall  not  be\n\n(3)\npayable in respect of\n\n(a)\n\nstaff members of international organizations who, in accordance with\nthe terms of the agreement of their respective organizations and the\nGovernment of Barbados, are entitled to be exempt from the payment\nof any charges or taxes on travel undertaken in the performance of their\nduties;\n\n(b)\n\nchildren under the age of 2 years;\n\n(c)\n\nin-transit passengers remaining in Barbados for a period not exceeding\none day; and\n\n(d)\n\nmembers of the crew of an aircraft.\n\nCarrier to collect charge\n\n4.(1)\nA  carrier  which  transports  from  the  Airport  to  a  place  outside\nBarbados, a person by whom the airport service charge is payable shall collect\nthe charge from the person and pay it over to the collector.\n\n\f6\n\n(2)\nA carrier which fails to collect the charge in accordance with subsection\n(1) shall, notwithstanding the failure, pay to the collector an amount equal to the\ncharge.\n\n(3)\nAn  amount  which  a  carrier  is  required  to  pay  to  the  collector  under\nsubsection  (1)  or  (2)  shall,  without  further  demand,  upon  presentation  of  an\ninvoice by the collector, be due and payable\n\n(a)\n\n(b)\n\nwithin one month after the conclusion of the month to which the invoice\nrelates; and\n\nsubject  to  such  conditions  as  may  be  determined  by  the  collector\ngenerally or in any particular case.\n\n(4)\n\nA carrier shall, in relation to the charge\n\n(a)\n\n(b)\n\nkeep such records; and\n\nfurnish such returns, in such form and to such persons,\n\nas may be determined by the collector to be necessary for the purposes of this\nAct.\n\nCollector and others may charge commission\n\n5.\ncharge may, with the written approval of the Minister, charge a commission.\n\nThe collector and any other person who collects the airport service\n\nCollector to distribute payments\n\n6.\nNotwithstanding the right of the collector by virtue of section 5(1)\n(c) of the Grantley Adams International Airport (Transfer of Management and\nVesting of Assets) Act, Cap. 286 to collect and retain airport charges, all payments\nreceived by the collector pursuant to this Act shall be distributed by the collector\nin accordance with the written instructions of the Minister.\n\n\f7\n\nRefund\n\n7.(1)\nA person who proves to the satisfaction of the collector that he has\npaid an amount in excess of the amount that he is required to pay under this Act\nis entitled to have the amount so paid in excess refunded.\n\nNo  claim  for  a  refund  under  this  section  shall  be  entertained  after  the\n(2)\nexpiration of 6 months from the date on which payment of the amount in dispute\nwas made.\n\nRecovery of charge\n\nWhere any sum, being due and payable pursuant to section 4 remains\n8.\nunpaid, the sum may be recovered as a debt due to the Government of Barbados\nin civil proceedings in the Magistrate’s Court for District “A” notwithstanding\nthat the amount exceeds the normal monetary limit on the civil jurisdiction of the\ncourt.\n\nOffence\n\n9.\nA carrier which fails to pay over to the collector the airport service\ncharge collected in accordance with section 4 or knowingly seeks to retain the\ncharge so collected, is guilty of an offence and is liable upon summary conviction\nto a fine of $20,000.\n\nRegulations\n\n10.\n\nThe Minister may make regulations generally to give effect to this Act.\n\nRepeal of Cap. 59\n\n11.\n\nThe Airport Service Charge Act, Cap. 59 is repealed.\n\n\f8\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2022.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2022.\n\nPresident\n\n"
}