{
  "bill_id": 632,
  "slug": "resolution-re-lease-to-barbados-national-oil-company-ltd-of-a-parcel-of-land-at-fairy-valley",
  "title": "Resolution re lease to Barbados National Oil Company Ltd. of a parcel of land at Fairy Valley",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/e6b1d3cd3bb333556807c420d0a04dbf.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-05-18",
  "first_reading": "2022-05-17",
  "gazette_date": null,
  "markdown": "PARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 approve the lease to the Barbados National Oil Company Limited of a parcel of land, the property of the State, situate at Fairy Valley in the parish of Christ Church in this Island more particularly described in the First Schedule to this Resolution on the terms and conditions set out in the Second Schedule hereto for the purpose ofa solar photovoltaic power plant and a battery storage system.\nAPPROVED by the House of Assembly this day of , Two thousand and twenty-two.\nthousand and twenty-two.\nSPEAKER\nAPPROVED by the Senate this\nday of\n, Two\nthousand and twenty-two.\nPRESIDENT\nFIRST SCHEDULE\nALL THAT land the property of the State situate at Fairy Valley in the parish of Christ Church in this Island containing by admeasurement 55 937.7 square metres or thereabouts (inclusive of 1406.0 square metres in road reserve) abutting and bounding on lands now or formerly of Barbados National Terminal Co. Ltd. on a public road known as Highway 7 which leads to Pilgrim Road in one direction and to Grantley Adams International Airport in the other direction on a public road and another public road which leads to a cul-de-sac in one direction and a cul-de-sac in the other direction or however else the same may abut and bound as shown and delineated on a plan certified on the 8\" day of March, 2022 by Kevin R. Belgrave, Land Surveyor and recorded in the Lands and Surveys Department on the 18\"day of March, 2022 as Plan No. 442 of 2022.\nSECOND SCHEDULE\nTERMS AND CONDITIONS\nThe terms and conditions of the lease to the Barbados National Oil Company Limited of lands owned by the State, situate at Fairy Valley, Christ Church and described in the First Schedule to this Resolution are set out as follows:\n(a) the lease shall be for a period of 25 years at an initial rate of 32 cents per square foot, per annum with an option to renew for a further term;\n(b) rent reviews shall take place at every 5 years;\n(c) the lessee shall bear and discharge all existing and future rates and taxes and assessments whatsoever imposed upon the land including the payment of land taxes, insurance premiums and other outgoings arising out of the use of the land;\n(d) the lessee shall bear the cost of developing the land as a photovoltaic power plant and at all times during the continuance of the term, comply with the Planning and Development Act, 2019 (Act 2019-5) or subsequent planning and development enactments relating to any matter or things affecting the land demised and indemnify the lessor against all actions and proceedings, damages and penalties, costs, charges, claims and demands in respect of a breach of the provisions of the said Act and statutory instruments made thereunder;\n€) the lessee shall not use and occupy the land or permit the same to be used or occupied otherwise than approved by the Director of the Planning and Development Department;\n(f) the lessee shall maintain and keep the land to be demised in a clean and tidy condition;\n(g) the lessee shall not assign or underlet or part possession of the land or any part thereof without the previous consent in writing of the lessor;\n(h) the lessee shall not do or suffer to be done on the land to be demised or any part thereof any act, matter or thing whatsoever which may be or tend to the annoyance, nuisance, damage or disturbance of the occupiers of any adjoining or neighbouring property of the land to be demised;\n@) the lessee shall indemnify and protect the lessor and its duly authorized agents and each and any of them from all loss, damages, claims, suits and demands whatsoever from all persons whomsoever which may be in any wise sustained or be made for or by any reason of or in consequence of the use of the said lands for matters or things by these presents authorized or in consequence of any act or omission of the lessee or its agents in reference to this agreement or any loss or damage or liability in respect of or arising out of the use of the said lands for the purpose stated herein;\nSecond Schedule - (Concl'd)\nTERMS AND CONDITIONS - (Concl'd)\nG) _ the lessee shall permit the lessor and its authorized agents, after giving the lessee 48 hours’ notice in writing, to enter upon the land to be demised and inspect and view the conditions thereof;\n(k) _ the lessee shall, at the expiration or sooner determination of the said term proposed to be granted, quietly yield up the land to be demised for nil consideration; and\n(il) _ the premises shall to revert to the State for nil consideration at the end of the lease or its sooner determination.\nADDENDUM\nThe Cabinet at its meeting held on the 27\" day of May, 2021 considered Note (21) 439/MHLM 35 and agreed to the lease of 566,275.6 square feet (13 acres) of State land situate at Fairy Valley in the parish of Christ Church in this Island but more particularly described in the First Schedule to this Resolution to the Barbados National Oil Company Limited on the terms and conditions set out in the Second Schedule to this Resolution for the erection of a ground mounted solar photovoltaic power plant and a battery storage system.\nIn accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is now sought to lease to the Barbados National Oil Company Limited, the parcel of land described in the First Schedule on the terms and conditions set out in the Second Schedule.\n"
}