{
  "bill_id": 633,
  "slug": "safety-and-health-at-work-amendment-bill-2022",
  "title": "Safety and Health at Work (Amendment) Bill 2022",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/48a56a3ad466d4d0a956090e67219b6b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-07-06",
  "first_reading": "2022-07-06",
  "gazette_date": "2022-05-30",
  "markdown": "2022-04-21\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Safety and Health at Work Act, Cap. 356 to make\n\nprovision for\n\n(a)\n\n(b)\n\nthe certificate issued by the Chief Fire Officer, relating to a fire escape,\nto be displayed in the workplace and maintained in the general register;\n\nthe making of regulations respecting the right to refuse to carry out\ntasks where there is imminent danger to the health and safety of an\nemployee;\n\n(c)\n\nthe making of regulations respecting forms and fees; and\n\n(d)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 33 of Cap. 356\n\nAmendment of section 34 of Cap. 356\n\nAmendment of section 35 of Cap. 356\n\nAmendment of section 36 of Cap. 356\n\nAmendment of section 63 of Cap. 356\n\nAmendment of section 65 of Cap. 356\n\nAmendment of section 79 of Cap. 356\n\nAmendment of section 93 of Cap. 356\n\n10.\n\nAmendment of section 108 of Cap. 356\n\n11.\n\nAmendment of section 109 of Cap. 356\n\n12.\n\nAmendment of section 110 of Cap. 356\n\n13.\n\nAmendment of section 111 of Cap. 356\n\n14.\n\nInsertion of new section 136A into Cap. 356\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Safety and Health at Work Act, Cap. 356 to make better\nprovision for the issue of certificates by the Chief Fire Officer and to extend\nthe power to make regulations.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nAct, 2022.\n\nThis Act may be cited as the Safety and Health at Work (Amendment)\n\nAmendment of section 33 of Cap. 356\n\n2.\nAct referred to as the principal Act, is amended\n\nSection 33 of the Safety and Health at Work Act, Cap. 356, in this\n\n(a)\n\nin  paragraph  (c)  of  subsection  (6),  by  deleting\n“inflammable” and substituting the word “flammable”;\n\nthe  word\n\n(b)\n\nby deleting subsection (7) and substituting the following:\n\nWhere  a  certificate  of  the  Chief  Fire  Officer  is  issued  in\n\n“(7)\naccordance with subsection (5),\n\n(a)\n\n(b)\n\n(c)\n\nan original copy shall be displayed in a conspicuous place at\nthe workplace for the benefit of employees and persons who\nvisit the premises in connection with work;\n\none duplicate copy shall be lodged on the general register;\nand\n\none  duplicate  copy  shall  be  forwarded  by  the  Chief  Fire\nOfficer to the Chief Labour Officer.”.\n\nAmendment of section 34 of Cap. 356\n\nSection 34 of the principal Act is amended in subparagraph (iii) of\n3.\nparagraph (a) by deleting the word “inflammable” and substituting the word\n“flammable”.\n\n\f5\n\nAmendment of section 35 of Cap. 356\n\n4.\nSection  35  of  the  principal  Act  is  amended  in  paragraph  (c)  of\nsubsection (3) by deleting the word “inflammable” and substituting the word\n“flammable”.\n\nAmendment of section 36 of Cap. 356\n\n5.\ndeleting paragraph (d) and substituting the following:\n\nSection  36  of  the  principal  Act  is  amended  in  subsection  (1)  by\n\n“(d)\n\nthe length of time within which he is required to comply with\nany requirement made under section 33, 35 or 37; or”.\n\nAmendment of section 63 of Cap. 356\n\n6.\ndeleting the words “section 85” and substituting the words “section 86”.\n\nSection  63  of  the  principal  Act  is  amended  in  subsection  (9)  by\n\nAmendment of section 65 of Cap. 356\n\n7.\nand substituting the following:\n\nSection 65 of the principal Act is amended by deleting subsection (6)\n\n“(6)\nNotwithstanding  subsections  (3)  and  (4),  where  less  than  10\npersons  or  such  other  number  as  the  Chief  Labour  Officer  may\ndetermine are employed, or the only persons employed are members of\nthe same family, the Chief Labour Officer may permit the operation of\na workplace with such modifications to the requirements of this section\nas he deems proper.”.\n\n\f6\n\nAmendment of section 79 of Cap. 356\n\n8.\ndeleting the words “section 32” and substituting the words “section 33”.\n\nSection  79  of  the  principal  Act  is  amended  in  subsection  (4)  by\n\nAmendment of section 93 of Cap. 356\n\n9.\nand substituting the following:\n\nSection 93 of the principal Act is amended by deleting subsection (2)\n\nThe occupier referred to in subsection (1) shall keep in the general\n\n“(2)\nregister the following information:\n\n(a)\n\n(b)\n\na copy of all accident reports sent to the Chief Labour Officer;\n\na copy of the certificate of the Chief Fire Officer relating to\nmeans of escape in case of fire;\n\n(c)\n\na certificate of examination of an air receiver;\n\n(d)\n\na certificate of examination of a boiler;\n\n(e)\n\na certificate of examination of hoists and lifts;\n\n(f)\n\n(g)\n\n(h)\n\na  certificate  in  respect  of  any  other  examination  required\nunder this Act;\n\na  certificate  of  exemption  in  respect  of  a  workplace  or\ncategory of workplace;\n\nany  other  report  and  particulars  required  by  any  other\nprovision  of  this  Act  to  be  entered  into  or  attached  to  the\ngeneral register;\n\n(i)\n\nany reports regarding the safety and health conditions in the\nworkplace; and\n\n(j)\n\nany other matter as may be prescribed.”.\n\n\f7\n\nAmendment of section 108 of Cap. 356\n\n10.\n\nSection 108 of the principal Act is amended in subsection (1) by\n\n(a)\n\ninserting  immediately  after  paragraph  (g)  the  following  new\nparagraphs:\n\n“(h)\n\nrespecting the right to refuse to carry out tasks where there is\nimminent danger to the health and safety of an employee;\n\n(i)\n\n(j)\n\nprescribing the forms to be used for the purposes of this Act;\n\nprescribing the fees to be paid for services provided under\nthis Act;”; and\n\n(b)\n\nrenumbering paragraph (h) as paragraph (k).\n\nAmendment of section 109 of Cap. 356\n\n11.\n\nSection 109 of the principal Act is amended\n\n(a)\n\n(b)\n\n(c)\n\nin subsection (1) by inserting the words “or employer” immediately\nafter the word “occupier”;\n\nin subsection (3) by inserting the words “, employer” immediately\nafter the word “occupier” wherever it appears; and\n\nin subsection (4) by inserting the words “or employer” immediately\nafter the word “occupier”.\n\nAmendment of section 110 of Cap. 356\n\nSection 110 of the principal Act is amended by deleting the words\n12.\n“owner  or  occupier”  wherever  they  appear  and  substituting  the  words\n“occupier, employer or owner”.\n\n\f8\n\nAmendment of section 111 of Cap. 356\n\n13.\n\nSection 111 of the principal Act is amended\n\n(a)\n\nin subsection (1) by inserting the words “, employer” immediately\nafter the word “occupier”; and\n\n(b)\n\nby deleting subsection (2) and substituting the following:\n\n“(2)\nWhere an extension is allowed under subsection (1), the occupier,\nemployer or owner is not liable in respect of any continuation of the\ncontravention during the extended time, but if, after the expiration of\nthe time as originally specified or as extended, the order is not complied\nwith, the occupier, employer or owner, as the case maybe, is liable to\na fine of $100 for each day on which the non-compliance continues\nafter the date on which the conviction was first obtained.”.\n\nInsertion of new section 136A into Cap. 356\n\n14.\nimmediately after section 136:\n\nThe principal Act is amended by inserting the following new section\n\n“Act binds State\n\n136A.\n\nThis Act shall bind the State.”.\n\n\f9\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2022.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2022.\n\nPresident\n\n"
}