{
  "bill_id": 634,
  "slug": "barbados-water-authority-amendment-bill-2021-20211209",
  "title": "Barbados Water Authority (Amendment) Bill, 2021 (2021-12-09)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/a5cf0598222052e37bf6decede95de18.pdf",
  "current_stage": "",
  "chamber": "",
  "notice_date": null,
  "first_reading": null,
  "gazette_date": null,
  "markdown": "2021-12-09\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Barbados Water Authority Act, Cap. 274A\n\n(a)\n\n(b)\n\n(c)\n\nto make provision for water protection zones;\n\nto provide for institutional strengthening of the authority; and\n\nto provide for related matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 274A\n\nAmendment of section 5 of Cap. 274A\n\nRepeal and replacement of section 9 of Cap. 274A\n\nRepeal and replacement of section 13 of Cap. 274A\n\nRepeal and replacement of section 14 of Cap. 274A\n\nInsertion of Part IVA into Cap. 274A\n\nRepeal and replacement of section 27 of Cap. 274A\n\nAmendment of section 28 of Cap. 274A\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nAmendment of section 29 of Cap. 274A\n\n11.\n\nDeletion of section 31 of Cap. 274A\n\n12.\n\nInsertion of section 33 into Cap. 274A\n\n13.\n\nAmendment of Schedules to Cap. 274A\n\n14.\n\nConsequential amendments\n\n\f3\n\nFIRST SCHEDULE\n\nSECOND SCHEDULE\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Barbados Water Authority Act.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\nAct, 2021.\n\nThis Act may be cited as the Barbados Water Authority (Amendment)\n\n\f6\n\nAmendment of section 2 of Cap. 274A\n\nSection 2 of the Barbados Water Authority Act, Cap. 274A, in this\n2.\nAct  referred  to  as  the  principal  Act,  is  amended  by  inserting  the  following\ndefinitions in alphabetical order:\n\n“ “adit”means an excavation on a horizontal or inclined plane extending\n\nfrom a well, bore-hole or shaft;\n\n“aquifer” means an underground layer of water-bearing permeable rock\nor  unconsolidated  materials  such  as  gravel,  sand,  or  silt  from\nwhich groundwater can be extracted;\n\n“bore  hole”  means  a  shaft  or  bore-hole  of  any  diameter  constructed\n\nsolely by a recognised method of boring;\n\n“ground water” or “underground water” means the natural water that\nflows within the aquifers or which saturates geological formations\nof  rock  or  soil  beneath  the  surface  of  the  earth  which  occur  in\nsufficient quantities to be of beneficial use;\n\n“territorial waters”has the meaning assigned to it by section 2 of the\n\nBarbados Territorial Waters Act, Cap. 386;\n\n“water  resources”  means  the  springs,  rivers,  surface  water  in  water\nzones, underground water, coastal waters and the territorial waters\nof Barbados;\n\n“well” includes any bore-hole, adit, shaft or excavation.”.\n\nAmendment of section 5 of Cap. 274A\n\n3.\nand substituting the following:\n\nSection 5 of the principal Act, is amended by deleting subsection (1)\n\n\f7\n\n“(1)\n\nThe functions of the Authority are\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nto obtain and analyse information and maintain records of the\ntotal water resources of Barbados;\n\nto manage, allocate and monitor the surface and ground water\nresources of Barbados with a view to ensuring development,\nconservation and protection of the ground water resources in\nthe public interest;\n\nafter  consultation  with  such  persons  as  the  Minister  may\ndirect  or  otherwise,  to  prepare  and  submit  to  the  Minister\nfrom  time  to  time,  proposals  for  the  establishment  of\nefficient,  co-ordinated  and  economical  water  supply  and\nsewerage systems capable of meeting the need for water and\nsewerage services throughout Barbados;\n\nto  prepare  details  of  schemes  for  the  development  and\nprotection of surface and ground water resources and for the\nsupply  of  water  and  sewerage  services,  and  to  construct,\nmaintain and operate such schemes;\n\nto  regulate  and  keep  under  constant  review,  the  quality,\nreliability  and  availability  of  water  supply  and  sewerage\nservices in accordance with the requirements and standards\nissued  to  the  Authority  by  the  Environmental  Protection\nDepartment in writing;\n\nto  keep  under  review  the  rates  to  be  charged  for  those\nservices;\n\nto control and regulate the collection, production, treatment,\nstorage, transmission, distribution and use of water for public\npurposes;\n\nto design, construct, acquire, provide, operate and maintain\nwater works for the purposes of treating or supplying water\nfor public purposes;\n\n\f(i)\n\n(j)\n\n(k)\n\n(l)\n\n8\n\nto design, construct, acquire, provide, operate and maintain\nsewerage  works  for  the  purpose  of  receiving,  treating  and\ndisposing of sewage;\n\nto  control  and  regulate  the  disposal  of  sewage  through\nsewerage plants or waste treatment plants that are not part of\nthe Authority’s systems;\n\nto conduct research programmes and prepare statistics for its\npurposes;\n\nto  disseminate  information  and  advice  with  respect  to  the\ntransmission,\nmanagement,\ntreatment,  storage,  supply  and  distribution  of  water  and\nwhere applicable, sewage;\n\nproduction,\n\ncollection,\n\n(m)\n\nto provide such facilities as may be necessary for training and\neducating  its  employees  and  to  facilitate  research  by\nemployees;\n\n(n)\n\n(o)\n\n(p)\n\nto advise the Minister on the matters referred to in paragraph\n(e) and on such other matters relating to water supply and\nsewerage services as the Minister refers to the Authority;\n\nto monitor and ensure compliance with this Act and to ensure\nthe  conservation  and  protection  of  water  resources  in  the\npublic interest; and\n\nto perform such other functions as the Minister assigns or as\nthe  Authority  considers  necessary  or  expedient  for  its\npurposes.”.\n\nRepeal and replacement of section 9 of Cap. 274A\n\n4.\nthe following:\n\nThe principal Act is amended by deleting section 9 and substituting\n\n\f9\n\n“Appointment of Chief Executive Officer\n\n9.(1)\nThe Board may, with the approval of the Minister, appoint\na person to be the Chief Executive Officer of the Authority, who shall\nbe an employee of the Authority.\n\nThe Chief Executive Officer is subject to the directions of the\n(2)\nBoard  and  is  responsible  to  the  Board  for  the  execution  and\nmanagement of the affairs of the Authority.”.\n\nRepeal and replacement of section 13 of Cap. 274A\n\n5.\nthe following:\n\nThe principal Act is amended by deleting section 13 and substituting\n\n“Inspection of premises\n\n13.(1)\nThe  Authority,  its  employees  and  agents  may  for  the\npurposes  of  the  Authority,  at  any  time  that  is  reasonable  in  the\ncircumstances, enter into any premises or into any road and\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nperform or carry out surveys;\n\nperform or carry out examinations;\n\nperform or carry out tests on water, soils, rock, plant or any\nother related material;\n\ncollect  samples  of  water,  soil,  rock,  plant  or  any  related\nmaterial;\n\n(e)\n\nperform investigations of premises and wells;\n\n(f)\n\nperform inspections of premises and wells; or\n\n\f10\n\n(g)\n\nmake  any  arrangements  as  it  considers  necessary  for  the\nAuthority  to  effectively  discharge  its  functions  under\nparagraphs (a) to (f).\n\n(2)\nSubject to section 14(3), the Authority is liable for any damage\noccasioned in the performance of its functions under subsection (1).”.\n\nRepeal and replacement of section 14 of Cap. 274A\n\n6.\nthe following:\n\nThe principal Act is amended by deleting section 14 and substituting\n\n“Powers of Authority\n\n14.(1)\npurposes of the Authority\n\nThe Authority, its employees and agents may for any of the\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nenter upon premises for the purpose of laying pipes or for\nusing the water of any stream, spring or pond thereon;\n\ndivert or impound the water from any stream, spring, aquifer,\nwell or pond;\n\nopen and break up the surface soil of any road;\n\nopen and break up any sewer, drain or tunnel in or over any\nroad;\n\n(e)\n\nperform or carry out surveys;\n\n(f)\n\n(g)\n\n(h)\n\nperform or carry out examinations;\n\nperform or carry out tests on water, well, groundwater, soils,\nrock, plant or any other related material;\n\ncollect samples of water, groundwater, soil, rock, plant or any\nrelated material;\n\n(i)\n\nperform investigations pursuant to this Act;\n\n\f11\n\n(j)\n\nperform inspections pursuant to this Act; or\n\n(k)\n\ndo such other things as it considers necessary for its purposes.\n\n(2)\nThe Authority is liable to make reasonable compensation to the\nowner or occupier of premises or the road authority, as the case may\nbe, for the use of the water of any stream, spring, well or pond or for\nany damage occasioned in the performance of its functions under this\nsection.\n\nCompensation payable under this section and section 12 may be\n(3)\nin such amount as is agreed upon between the owner or occupier and\nthe Authority or as is assessed in accordance with the Land Acquisition\nAct, Cap. 228.”.\n\nInsertion of Part IVA into Cap. 274A\n\n7.\nthe following:\n\nThe principal Act is amended by inserting immediately after Part IV\n\n“PART IVA\n\nWATER REVIEW MANAGEMENT COMMITTEE, WELLS AND\nRELATED MATTERS\n\nWater Review Management Committee\n\n18A.(1)\nCommittee.\n\nThere is hereby established a Water Review Management\n\nThe  provisions  of  the  Second  Schedule  shall  have  effect  in\n(2)\nrelation  to  the  constitution  of  the  Committee  and  to  matters  related\nthereto.\n\n\f12\n\nProtection from personal liability\n\nNo  action,  suit,  prosecution  or  other  proceedings  shall  be\n18B.\nbrought  or  instituted  personally  against  any  member  of  the  Board,\nCommittee  or  employee  of  the  Authority  in  respect  of  any  act  done\nbona fide in pursuance of their duties, functions or instructions given\npursuant to this Act.\n\nApplication to use a well\n\n18C.(1)\n\nNo person shall\n\n(a)\n\n(b)\n\n(c)\n\nsink  any  well  for  agricultural,  commercial  or  any  other\npurpose;\n\ndeepen  an  existing  well  for  the  purpose  of  tapping,\nintercepting or abstracting ground water therefrom;\n\nconvert or substantially alter a well into a well for the tapping,\ninterception or abstraction of ground water;\n\n(d)\n\nabstract ground water from any well;\n\n(e)\n\ncarry out any substantial alteration to a well or change the use\nof a well\n\nunless he first obtains a licence from the Committee so to do.\n\nAny alteration which increases or is designed to increase or is\n(2)\ncapable of increasing the horizontal area or the depth of a well or the\npower utilised to raise water from a well or the discharge of water so\nraised shall be deemed to be a substantial alteration within the meaning\nof paragraph (d) of subsection (1).\n\nA person shall make an application in writing for a licence in\n(3)\nsuch form as the Committee requires and the Committee shall notify\nthe person of its determination with respect to the application in writing.\n\n\f13\n\n(4)\n\nAn employee of the Authority shall have the power\n\n(a)\n\n(b)\n\nto inspect the land, premises or well prior to granting a licence\nunder subsection (3); and\n\nto inspect any well which is subject to a licence under this\nAct.\n\nWhere an employee of the Authority acts under subsection (4)\n\n(5)\nhe shall submit a report to the Committee.\n\nWhere  the  Committee  determines  to  grant  a  licence,  that\n(6)\nlicence shall be subject to such terms and conditions as the Committee\nsees  fit,  and  shall  be  valid  for  the  period  stated  therein  unless  it  is\nrevoked or cancelled under subsection (8).\n\nThe Chairman of the Committee shall issue the licence on behalf\n\n(7)\nof the Committee.\n\nThe Committee may revoke or suspend a licence and accordingly\n\n(8)\nthe use of the well attached to the licence where\n\n(a)\n\n(b)\n\nthe  person  issued  the  licence  contravenes  any  term  or\ncondition contained in the licence; or\n\nthe existence or use of that well negatively affects the water\nsupply,  water  resources,  underground  water  or  the  marine\nenvironment in Barbados.\n\n(9)\n\nFor the purposes of this section,\n\n“inspect” means\n\n(a)\n\ninvestigating  and  checking  the  structure  of  the  wellhead\nprotection  to  ensure  that  a  proper  wellhead  protection  is\nprovided to stop surface water and foreign objects falling into\nthe well;\n\n(b)\n\nperforming  soil  tests,  water  quality  tests  or  such  other\nrequired tests on the land or premises with the well;\n\n\f14\n\n(c)\n\n(d)\n\n(e)\n\ntaking water or soil samples for testing;\n\ntaking copies of documents, taking photographs and taking\nvideos or voice recordings; or\n\nanything related to or necessary to effect the requirement of\nparagraphs (a) to (d).\n\nPower of general suspension\n\n18D.(1)\n\nThe Committee may\n\n(a)\n\n(b)\n\n(c)\n\nby  order,  suspend  the  extraction  of  water  from  wells  in\nrespect of which a licence is issued under this Act or saved\nunder section 18H, where there is a drought or where natural\nchanges cause a shortage of water for any purpose, which in\nthe opinion of the Committee makes it necessary to suspend\nthe extraction of water for the period stated in the order;\n\nby  an  instrument  in  writing,  revise  or  alter  the  quantity  of\nwater which a person who has been granted a licence under\nsection  18C  is  authorised  to  abstract  from  a  well,  in  such\nmanner  as  appears  to  the  Committee  to  be  equitable  and\nappropriate in light of the environmental conditions which\nare impacting the water supply; or\n\nby  an  instrument  in  writing,  revise  or  alter  the  quantity  of\nwater  which  a  person  to  whom  section  18H  applies  is\nauthorised  to  abstract  from  a  well,  in  such  manner  as  it\nappears  to  the  Committee  to  be  equitable  and  appropriate\ntaking into consideration the environmental conditions which\nare impacting the water supply.\n\n\f15\n\n(2)\nWhere an order made under subsection (1)(a) creates an offence,\nthe order may provide for such offences to be tried summarily or on\nindictment and the order may prescribe the following penalties:\n\n(a)\n\n(b)\n\nin  the  case  of  an  offence  triable  summarily,  a  fine  not\nexceeding $10 000 or imprisonment for a term of 5 years or\nto both; or\n\nin  the  case  of  an  offence  triable  on  indictment,  a  fine  not\nexceeding $25 000 or imprisonment for a term of 10 years\nor to both.\n\nMisuse of a well\n\n18E.(1)\n\nThe Committee may where any well\n\n(a)\n\n(b)\n\nis used or caused or permitted to be used in contravention of\nany of the provisions of this Act; or\n\nthough not situate in any prohibited area or zone as defined\npursuant to section 27, is used or caused or permitted to be\nused  for  the  disposal  of  sewage  water  or  other  waste,  in  a\nmanner which in the opinion of the Committee constitutes or\nmay constitute a danger to health or leads or may lead to the\ncontamination of any source of water whatever\n\nby notice in writing served on the owner of the land on which the well\nis situate, require the owner to plug or fill the well, or to cause such well\nto be plugged or filled, and to provide, or caused to be provided, such\nother means as the Committee may approve.\n\nWhere the owner of the land fails to comply with any requirement\n(2)\nof  subsection  (1),  the  Committee  may  require  an  employee  of  the\nAuthority to enter on the land and plug or fill the well and do such other\nworks as may be required to provide some other satisfactory method of\ndisposing of the sewage water or other waste.\n\n\f16\n\n(3)\nThe expenses of the Authority reasonably incurred in the exercise\nof the powers conferred by subsection (2) shall be a debt due by the\nowner of the land in question to the State and, without prejudice to any\nother lawful means of recovery, may be recovered on complaint before\na magistrate by the Authority.\n\nOffence\n\n18F.\nA person who knowingly makes an application under this\nPart that is false in any material particular, is guilty of an offence and\nis liable on summary conviction to a fine of $1 000 or to imprisonment\nfor 12 months or to both.\n\nSavings\n\nA licence issued to a person to construct or use a well under\n18G.(1)\nthe Underground Water Control Act, Cap. 283 shall remain valid for a\nperiod of 12 months from the commencement of the Barbados Water\nAuthority (Amendment) Act, 2021, and thereafter that licence shall be\ndeemed to be expired.\n\nA  person  to  whom  subsection  (1)  refers  shall  apply  to  the\n(2)\nCommittee for a licence in accordance with this part on or before the\nexpiration of the period specified in subsection (1).”.\n\nRepeal and replacement of section 27 of Cap. 274A\n\n8.\nthe following:\n\nThe principal Act is amended by deleting section 27 and substituting\n\n\f17\n\n“Defining of Areas of public water supply\n\n27.(1)\n\nThe Board may by order\n\n(a)\n\ndefine,  zone,  restrict  or  prohibit  the  use  of  areas  across\nBarbados which contribute to the water resource of Barbados\nand which contribute to the public water supply in Barbados;\nand\n\n(b)\n\ndefine and regulate the permissible uses of the areas referred\nto in paragraph (a).\n\n(2)\n\nAny person who\n\n(a)\n\nswims or bathes in a source of public water supply defined,\nzoned, regulated or prohibited under subsection (1);\n\n(b)\n\nswims or bathes in a source of public water supply;\n\n(c)\n\n(d)\n\nplaces, deposits, discharges or allows to remain therein any\nmaterial  of  any  kind  that  is  likely  to  impair  the  quality  of\nwater  in  a  source  of  public  water  supply  defined,  zoned,\nregulated or prohibited under subsection (1);\n\nplaces, deposits, discharges or allows to remain therein any\nmaterial  of  any  kind  that  is  likely  to  impair  the  quality  of\nwater in a source of public water supply; or\n\n(e)\n\ndoes any act or takes water so that the amount of water in a\nsource of public water supply unduly diminished,\n\nis guilty of an offence and is liable on summary conviction to a fine of\n$10 000 or imprisonment for 12 months or both and to a further fine of\n$100 for each day or part thereof during which the offence continues\nafter a conviction is obtained.\n\nThe  Board  shall  receive  reports  with  respect  to  a  breach  of\n(3)\nsubsection (2) from any Minister, Authority, company, Agency, person\n\n\f18\n\nor  public  officer  required  to  ensure  or  monitor  compliance  with\nBarbados Water Authority (Water Zones) Order, 2021.\n\n(4)\nWhere an order made under subsection (1) creates an offence,\nthe order may provide for such offences to be tried summarily or on\nindictment and the order may prescribe the following penalties:\n\n(a)\n\n(b)\n\nin  the  case  of  an  offence  triable  summarily,  a  fine  not\nexceeding $10 000 or imprisonment for a term of 5 years or to\nboth; or\n\nin  the  case  of  an  offence  triable  on  indictment,  a  fine  not\nexceeding $25 000 or imprisonment for a term of 10 years\nor to both.\n\nThe  Minister  may  amend  or  revoke  an  order  made  under\n\n(5)\nsubsection (1).”.\n\nAmendment of section 28 of Cap. 274A\n\n9.\n\nSection 28 of the principal Act is amended by\n\n(a)\n\ndeleting paragraphs (n) and (o) of subsection (2) and substituting the\nfollowing:\n\n“(n)\n\nprescribing matters related to water zones and ground water\nand prescribing standards and matters for the protection of\nwater zones and ground water;\n\n(o)\n\n(p)\n\n(q)\n\nprescribing matters related to the construction of a well and\nthe use of a well;\n\nprescribing the security to be furnished by persons applying\nfor the supply of water or sewerage services; and\n\nprescribing  the  conditions  for  discontinuing  the  supply  of\nwater or sewerage services.”;\n\n\f(b)\n\ndeleting subsection (4) and substituting the following:\n\n19\n\n“(4)\nWhere regulations made under subsection (2) creates an offence,\nthose regulations may provide for such offences to be tried summarily\nor  on  indictment  and  the  regulations  may  prescribe  the  following\npenalties\n\n(a)\n\n(b)\n\nin  the  case  of  an  offence  triable  summarily,  a  fine  not\nexceeding $10 000 or imprisonment for a term of 5 years or\nto both; or\n\nin  the  case  of  an  offence  triable  on  indictment,  a  fine  not\nexceeding $25 000 or imprisonment for a term of 10 years\nor to both.”;\n\n(c)\n\ndeleting subsection (5).\n\nAmendment of section 29 of Cap. 274A\n\n10.\nthe following:\n\nThe principal Act is amended by deleting section 29 and substituting\n\n“Directions of Minister\n\n29.(1)\nThe Minister may, after consultation with the Chairman of\nthe Board appointed under paragraph (2) of the First Schedule, give to\nthe Board directions of a general or specific nature relating to the policy\nto be followed by the Board in the performance of the functions of the\nAuthority; and the Board shall give effect to the directions.\n\n(2)\nThe Minister may give directions of a general or specific nature\nrelating to the policy to be followed with respect to matters relating to\nthe functions of the Committee or Garbage and Sewage Contribution\nRelief Board, and the Committee or Garbage and Sewage Contribution\nRelief Board shall give effect to the directions.”.\n\n\f20\n\nDeletion of section 31 of Cap. 274A\n\n11.\n\nSection 31 of the principal Act is deleted.\n\nInsertion of section 33 into Cap. 274A\n\n12.\n32 the following section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Application to the Town and Country Planning Act\n\n33.\nThe Minister and the Chief Town Planner shall have regard\nto  an  order  made  under  section  27  and  any  regulations  made  under\nsection 28 in the application of the provisions of the Town and Country\nPlanning Act, Cap. 240.”.\n\nAmendment of Schedules to Cap. 274A\n\n13.\n\nThe principal Act is amended\n\n(a)\n\n(b)\n\n(b)\n\nin paragraph 8 of the First Schedule by deleting the words “General\nManager”  wherever  they  appear  and  substituting  the  words  “Chief\nExecutive Officer”;\n\nby numbering the Second Schedule to the Act as the Third Schedule to\nthat Act; and\n\nby inserting the Second Schedule set out in the First Schedule to this\nAct as the Second Schedule to the principal Act.\n\nConsequential amendments\n\n14.\nare amended in the manner specified in the second column.\n\nThe enactments specified in the first column of the Second Schedule\n\n\f21\n\nFIRST SCHEDULE\n\n“SECOND SCHEDULE\n\nWater Review Management Committee\n\n(Section 13)\n\n(Section 18A)\n\nConstitution\n\n1.\n\nThe Water Review Management Committee shall consist of\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe Permanent Secretary, Ministry of Transport, Works and\nWater Resources ex officio or his nominee;\n\nthe Chief Executive Officer of the Barbados Water Authority\nor his nominee;\n\nthe Director of the Environmental Protection Department, ex\nofficio or his nominee;\n\nthe Permanent Secretary, Ministry of Agriculture, ex officio\nor his nominee;\n\n(e)\n\nthe Chief Medical Officer, ex officio or his nominee;\n\n(f)\n\n(g)\n\nthe  Permanent  Secretary,  Ministry  of  Environment  and\nNational Beautification,  ex officio or his nominee; and\n\nChief  Executive  Officer  of  the  Barbados  Agriculture\nDevelopment Marketing Corporation or his nominee.\n\nChairman\n\n2.\nmember to be Chairman  and member to be Deputy Chairman.\n\nThe  Minister  shall  by  an  instrument  in  writing  appoint  a\n\n\f22\n\nResignation\n\n3.(1)\nThe member appointed as chairman or deputy chairman may\nresign the post of chairman or deputy chairman by instrument in writing\naddressed to the Minister.\n\nA resignation takes effect from the date on which the Minister\n\n(2)\nreceives the instrument.\n\nTemporary leave of absence\n\n4.\nmember.\n\nThe Minister may, in writing, grant a leave of absence to a\n\nTemporary appointment\n\nWhere a member is, or is likely to be, unable to perform the\n5.\nfunctions of his office for more than 30 days, whether as a result of\nabsence from Barbados, illness or other cause or reason, the Minister\nmay appoint a person to act in the place of the member.\n\nCommittees\n\n6.(1)\nother persons to assist it with the proper discharge of its functions.\n\nThe Committee may appoint committees of its members or\n\nWhere  a  person  who  is  not  a  member  of  the  Committee  is\n(2)\nappointed to a committee, the Committee may, with the approval of the\nMinister, determine the remuneration and allowances to be paid to the\nperson.\n\nMeetings\n\n7.(1)\nThe Committee shall meet as often as may be necessary or\nexpedient for the transaction of its business and such meetings shall be\nheld at such places and times and on such days as the Committee may\ndetermine.\n\n\f23\n\n(2)\nThe Chairman, or in the event of his absence from Barbados or\ninability to act as such, the person acting as Chairman, may at any time\ncall a special meeting of the Committee and shall call such a meeting\nwithin 7 days of the receipt by him of a request for the purpose addressed\nto him in writing and signed by not less than 3 members.\n\nThe Chairman, or in his absence, the person acting as Chairman,\n\n(3)\nshall preside at all meetings of the Committee.\n\nWhere  the  Chairman  is  absent  from  a  meeting,  the  members\n(4)\npresent shall elect a member from among their number to preside at the\nmeeting.\n\n(5)\n\nFive members shall constitute a quorum.\n\nThe decisions of the Committee shall be by a majority of votes\n(6)\nand in a case where the voting is equal, the Chairman or other person\npresiding at the meeting shall, in addition to an original vote, have a\ncasting vote.\n\nMinutes of each meeting shall be kept by the person performing\n(7)\nthe functions of secretary to the Committee or by such other officer as\nthe Committee appoints for the purpose and shall be confirmed by the\nCommittee  and  signed  by  the  Chairman  at  the  next  meeting  of  the\nCommittee.\n\nAttendance of non-members at meetings\n\n8.\nThe Committee may invite any person to attend any of its\nmeetings  to  assist  or  advise  it  with  respect  to  any  matter  under  its\nconsideration, but a person so invited does not have a right to vote.\n\nCommittee may regulate proceedings\n\n9.\nmay regulate its own proceedings.”.\n\nSubject to the provisions of this Schedule, the Committee\n\n\f24\n\nSECOND SCHEDULE\n\nEnactment\n\nAmendments\n\nHealth Services (Building) Regulations,\n1969 (S.I. 1969 No. 233)\n\nRegulation  4  is  deleted  and  the  following  is\nsubstituted:\n\n(Section 14)\n\n“4.(1)  The  Minister  may,  in  respect  of  an\napplication made under these Regulations\n\n(a) refuse the application and where he refuses\nthe  application  he  shall,  within  forty-two  days\nafter  receipt  of  such  application,  give  to  the\napplicant notice of his refusal; or\n\n(b) grant an application and where he determines\nit is required, attach such conditions to the grant\nof the application as he thinks fit; or\n\n(c)  grant conditional approval and any notice of\nthe latter shall specify the conditions which need\nto be satisfied before approval may be granted.\n\n(2)      Where  the  Minister  grants  an  application\nunder  paragraph  (1)(b)  and  attaches  conditions\nthereto  he  shall  require  compliance  with  the\nprovisions  of  the  Barbados  Water  Authority\n(Water Zones) Order, 2021 as a condition of the\ngrant.”.\n\nRegulation  4  is  amended  by  inserting  the\nfollowing  new  paragraph  immediately  after\nparagraph (3):\n\n“(4)      Where  an  application  is  granted  under\nparagraph  (3)  it  shall  be  a  condition  of  that\napproval  that  the  person  complies  with  the\nprovisions  of  the  Barbados  Water  Authority\n(Water Zones) Order, 2021.”.\n\nHealth Services (Hotels) Regulations, 1969\n(S.I. 1969 No. 231)\n\n\f25\n\nHealth Services (Lodging House and\nBarracks) Regulations,1970\n(S.I. 1970 No. 74)\n\nRegulation  4  is  amended  in  paragraph  (2)  by\ndeleting  sub-paragraph  (e)  and  substituting  the\nfollowing:\n\nHealth Services (Private Hospitals, Nursing\nHomes, Senior Citizen’ Homes and\nMaternity Homes) Regulations, 2005\n(S.I. 2005 No. 58)\n\n“ (e) the maximum number of persons that may\nbe accommodated at any one time in each room\nof the lodging house or barrack; and\n\n“(f)   that the person shall as a condition of the\ngrant,  comply  with  the  provisions  of  the\nBarbados Water Authority (Water Zones) Order,\n2021.”.\n\n1.  Regulation  5  is  amended  by  inserting  the\nfollowing  new  paragraph  immediately  after\nparagraph (2):\n\n“(3)   Where the Minister approves an application\nunder  paragraph  (2),  he  shall  notify  the  person\nthat the person shall comply with the provisions\nof the Barbados Water Authority (Water Zones)\nOrder, 2021.”.\n\n2. Regulation 6 is amended in paragraph (2) by\ndeleting  sub-paragraphs\n(d)  and\nsubstituting the following:\n\n(c)  and\n\n“(c)  state  the  number  of  persons  that  may  be\naccommodated on the premises; and\n\n(d) require compliance with the provisions of the\nBarbados Water Authority (Water Zones) Order,\n2021; and\n\n(e) be kept affixed to some conspicuous place in\nthe premises to which it relates.”.\n\n\f26\n\nHealth Services (Restaurants) Regulations,\n1969 (S.I. 1969 No. 234)\n\nRegulation  5\nsubstituted:\n\nis  deleted  and  following\n\nis\n\n“5.(1)    Restaurants shall, to the satisfaction of\nthe Medical Officer of Health, be provided with\n\n        (a)  adequate toilet facilities which shall be\n                   conveniently located, accessible,\nsanitary\n              and in good repair;\n\n        (b)  adequate hand washing facilities which\n               shall include\n\n             (i)   wash basins;\n\n             (ii)  running water;\n\n            (iii)  a constant supply of soap in a\n                    suitable container or dispenser;\n\n           (iv)    individual towels or other hand-\n                     drying equipment; and\n\n           (v)     a suitable receptacle for used towels\n                    and waste material;\n\n         (c)  an adequate supply of potable water;\n                and\n\n         (d) compliance with the provisions of the\n          Barbados Water Authority (Water Zones)\n             Order, 2021.”.\n\n1. Section 5 is amended by inserting the following\nnew subsection after immediately subsection (2):\n\n“ (3) A marine pollution control inspector\ndischarging the functions set out in this Act, shall\nalso monitor compliance with the provisions of\nthe Barbados Water Authority (Water Zones)\nOrder, 2021 and report any breaches thereof to\nthe Barbados Water Authority or to the police, as\nthe case may be.”.\n\nMarine Pollution Control Act, Cap. 392A\n\n\fTown and Country Planning Act, Cap. 240\n\n27\n\n2.  Section  7  is  amended  in  subsection  (2)  by\ndeleting paragraphs (a) and (b) and substituting\nthe following:\n\n“ (a) prohibiting, wholly or partly the release of\nthe pollutant;\n\n(b) requiring the diminution or cessation of the\nrelease of the pollutant; or\n\n(c) monitoring compliance with the provisions of\nthe  Barbados  Water  Authority  (Water  Zones)\nOrder, 2016.”.\n\n1. Section 5 of the Act is amended by inserting\nthe  following  new  subsection  after  subsection\n(2):\n\n“(3)   The Chief Town Planner shall have regard\nto the Barbados Water Authority (Water Zones)\nOrder, 2021 and any other order or regulations\nmade under the Barbados Water Authority Act,\nCap. 274A which affects the distribution and use\nof  land  in  Barbados  in  the  preparation  of  the\nDevelopment Plan.”.\n\n2. Section 23 of the Act is amended by inserting\nthe  following  new  subsection  after  subsection\n(2):\n\n“(3)  The Chief Town Planner shall have regard\nto the Barbados Water Authority (Water Zones)\nOrder, 2021 and any other order or regulations\nmade under the Barbados Water Authority Act,\nCap. 274A in the application of the provisions of\nthis Act to\n\n        (a)   the grant of permission to develop land\n               or to sub-divide land for agricultural,\n               housing, or commercial development;\n               or\n\n       (b)    the grant of permission to improve, alter,\n               change demolish an existing structure.”.\n\n\f28\n\nTown and Country Planning Development\nOrder, 1972 (S.I. 1972 No. 75)\n\nPart I of the Second Schedule is amended by:\n\n(a)  deleting paragraph (3), in the second column\n      headed “CONDITIONS”, under the heading\n       “Class I - Development for housing purposes”\n      and substituting the following:\n\n“(3)  Where the circumstances so require, comply\nwith  the  provisions  of  the  Barbados  Water\nAuthority (Water Zones) Order, 2021.\n\n(4)  All standard conditions.”;\n\n(b)  deleting paragraph (5), in the second column\n      headed “CONDITIONS”, under the heading\n      “Class II - Development for commercial\n      purposes” and substituting the following:\n\n“(5)  Where the circumstances so require, comply\nwith  the  provisions  of  the  Barbados  Water\nAuthority (Water Zones) Order, 2021.\n\n(6)  All standard conditions.”;\n\n(c)  deleting paragraph (5), in the second column\n      headed “CONDITIONS”, under the heading\n      “Class III - Development for Industrial\n      purposes” and substituting the following:\n\n“(5)  Where the circumstances so require, comply\nwith  the  provisions  of  the  Barbados  Water\nAuthority (Water Zones) Order, 2021.\n\n(6)  All standard conditions.”;\n\n(d)  deleting paragraphs (4) and (5), in the second\n      column headed “CONDITIONS”, under the\n      heading “Class IV - Development for\n      agricultural purposes” and substituting the\n      following:\n\n“(4)    This  permission  shall  not  extend  to  any\nAgricultural class I area in any area designated\n\n\f29\n\nby the Barbados Water Authority (Water Zones)\nOrder, 2021 as being in a Zone 1, Exclusion Zone\narea.\n\n(5)  Standard conditions 1, 2, 4, 5, 6 and 9.”; and\n\n(e)  deleting paragraph (4) , in the second column\n      headed “CONDITIONS” , under the heading\n      “Class V - Development for agricultural\n      purposes” and substituting the following:\n\n“(4)  Where the circumstances so require, comply\nwith  the  provisions  of  the  Barbados  Water\nAuthority (Water Zones) Order, 2021.\n\n(5)  All standard conditions.”.\n\nUnderground Water Control Act, Cap. 283\n\nThis Act is repealed.\n\n"
}