{
  "bill_id": 635,
  "slug": "pandemic-contribution-levy-bill-2022",
  "title": "Pandemic Contribution Levy Bill, 2022",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/5a6caa36cb910222b7b85d393334e0b2.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-06-15",
  "first_reading": "2022-06-15",
  "gazette_date": "2022-06-20",
  "markdown": "2022-06-03\n\nOBJECTS AND REASONS\n\nThis Bill would make provision for the imposition of a levy to be known as\n\nthe “Pandemic Contribution Levy” and matters related thereto.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\nShort title\n\nInterpretation\n\nPurpose\n\nApplication of levy\n\nAdministration\n\nPART II\n\nAPPLICATION OF LEVY TO EMPLOYED AND SELF-EMPLOYED\nINDIVIDUALS\n\nImposition of levy on employed individuals and self-employed individuals\n\nRate of levy applicable to employed individuals and self-employed\nindividuals\n\nCollection of levy by employers\n\nPayment of levy by self-employed individuals\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nPandemic Contribution Levy Returns\n\n\f3\n\nPART III\n\nAPPLICATION OF LEVY TO COMPANIES\n\n11.\n\nImposition of levy on companies\n\n12.\n\nRate of levy applicable to companies\n\n13.\n\nPayment of levy by companies\n\n14.\n\nPandemic Contribution Levy Companies Return\n\nPART IV\n\nACCOUNTS AND RECORDS\n\n15.\n\nKeeping of accounts and records\n\n16.\n\nAudit\n\n17.\n\nCopies of documents\n\nPART V\n\nASSESSMENT\n\n18.\n\nAssessment\n\n19.\n\nReassessments\n\n20.\n\nNotice of assessment\n\n21.\n\nRefunds\n\n\f4\n\nPART VI\n\nOBJECTIONS, APPEALS, RECOVERY\n\n22.\n\nObjections\n\n23.\n\nAppeal to Tribunal\n\n24.\n\nAppeal to the High Court\n\n25.\n\nRecovery of the levy\n\n26.\n\nUnpaid levy certificates\n\nPART VII\n\nMISCELLANEOUS\n\n27.\n\nExtension\n\n28.\n\nObstruction of officers\n\n29.\n\nPenalties and interest\n\n30.\n\nDisallowed deductions\n\n31.\n\nRegulations\n\n32.\n\nAmendment of the enactments in the Schedule\n\n33.\n\nExpiration\n\nSCHEDULE\n\nConsequential Amendments\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to make provision for the imposition of a levy to be known as the\n\n“Pandemic Contribution Levy” and matters related thereto.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Pandemic Contribution Levy Act, 2022.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Authority” means the Barbados Revenue Authority established by section 3 of\n\nthe Barbados Revenue Authority Act, 2014 (Act 2014-1);\n\n“benefit-in-kind” means any non-cash benefit of monetary value that an employer\nprovides for an employee for the use or enjoyment of that employee;\n\n“Commissioner”  means  the  Revenue  Commissioner  appointed  pursuant  to\nsection 7 of the Barbados Revenue Authority Act, 2014 (Act 2014-1);\n\n“commercial  bank”  means  a  commercial  bank  licensed  under  Part  II  of  the\nFinancial  Institutions  Act,  Cap.  324A  and  a  merchant  bank  or  finance\ncompany licensed under Part III of that Act;\n\n“company” means a company referred to in section 4(1)(a);\n\n“employed individual” means an individual referred to in section 4(1)(b) or (c);\n\n“emoluments”\n\nincludes  salary,  wages,  overtime\n\nremuneration,  bonus,\ncommission,  retirement  plan  benefits  and  retiring  allowances  and  any\namount in respect of services and director’s fees received in Barbados;\n\n“financial year” means the financial year of a company;\n\n“income” includes emoluments, income from a business, office, employment,\nrents, dividends, supplement wages, interest and director’s remuneration or\nfees but does not include pension income, benefits in kind, interest on any\nGovernment of Barbados Bonds or foreign source dividends;\n\n\f7\n\n“international  financial  reporting  standards”  or  “  IFRS”  refers  to  a  set  of\ninternational  accounting  standards,  which  state  how  particular  types  of\ntransactions and other events should be reported in financial statements;\n\n“generally accepted accounting principles” or “GAAP” refers to a common set\nof accepted accounting principles, standards and procedures which must be\nfollowed in the preparation of financial statements of companies;\n\n“levy” means the Pandemic Contribution Levy;\n\n“life and general insurance company” means an insurance entity licensed under\n\nthe Insurance Act, Cap. 310 as a Class 2 licensee;\n\n“major engaged in the sale of fuel” means a firm or a company that carries on,\ndirectly  or  otherwise,  the  business  of  storage,  distribution  and  sale  of\nliquefied petroleum gas and aviation fuel in bulk or retail;\n\n“net income” means pre-tax profits of a company based on income from sources\n\nwithin Barbados, as calculated in accordance with IFRS or GAAP;\n\n“officer” means a person who is authorized by the Authority to administer and\n\nenforce this Act;\n\n“Pandemic Contribution Levy” means the levy imposed pursuant to section 6 or\n\nsection 11 as the case may be;\n\n“self-employed individual” means an individual referred to in section 4(1)(d);\n\n“supplement  wages”  means  payments  made  in  addition  to  an  employee’s\nordinary wages and includes overtime, commissions, bonuses, retroactive\npay and back pay;\n\n“telecommunications  company”  means  a  company,  firm  or  business  that  is\n\nregulated by the Telecommunications Act, Cap. 282B; and\n\n“Tribunal” means the Barbados Revenue Appeals Tribunal established by section\n\n24 of the Barbados Revenue Authority Act (Act 2014-1).\n\n\f8\n\nPurpose\n\n3.\neconomic effects of the spread of the Coronavirus (COVID-19).\n\nThe  levy  is  imposed  for  the  purpose  of  mitigating  the  adverse\n\nApplication of levy\n\n4.(1)\n\nThe levy applies to\n\n(a)\n\na company operating in Barbados that is\n\n(i)\n\na telecommunications company;\n\n(ii)\n\na life and general insurance company;\n\n(iii)\n\na major engaged in the sale of fuel; or\n\n(v)\n\na commercial bank;\n\nthat has a net income of 5 million dollars or more, in the financial year 2020\nor in the financial year 2021 or in the financial years 2020 and 2021;\n\n(b)\n\n(c)\n\nan individual employed in Barbados who has an income of $6 250 or\nmore per month for the period 1st April, 2022 to 31st March, 2023;\n\nan individual employed in Barbados who does not ordinarily have an\nincome of $6 250 or more per month or $75 000 or more per annum\nbut\n\n(i)\n\n(ii)\n\nin any month has an income of $6 250 or more or for the period\n1st April, 2022 to 31st March, 2023; or\n\nfor the period 1st April, 2022 to 31st March, 2023 has an income of\n$75 000 or more,\n\nwhich in either instance arises because of supplemental wages or otherwise;\nand\n\n(d)\n\na self-employed individual who has an income of $75 000 or more for\nthe period 1st April, 2022 to 31st March, 2023.\n\n\f(2)\n\nThe levy shall not apply to\n\n9\n\n(a)\n\n(b)\n\n(c)\n\nan individual who has been granted a Barbados Welcome Stamp under\nthe Remote Employment Act, 2020 (Act 2020-23);\n\na  qualified  person  who  has  been  granted  a  foreign  currency  permit\nunder the Foreign Currency Permits Act, 2018 (Act 2018-44); or\n\na  person  who  has  diplomatic  immunities  and  privileges  under  the\nDiplomatic Immunities and Privileges Act, Cap. 18.\n\nThe Minister may exempt a person from the application of the levy imposed\n\n(3)\nunder this Act.\n\nAdministration\n\n5.\nand for the assessment, collection and recovery of the levy.\n\nThe Authority shall be responsible for the administration of this Act\n\nPART II\n\nAPPLICATION OF LEVY TO EMPLOYED AND SELF-EMPLOYED\nINDIVIDUALS\n\nImposition of levy on employed individuals and self-employed\nindividuals\n\n6.\n\nWith effect from the 1st April, 2022, a levy is payable by\n\n(a)\n\n(b)\n\nan individual employed in Barbados who has an income of $6 250 or\nmore per month for the period 1st April, 2022 to 31st March, 2023;\n\nan individual employed in Barbados who does not ordinarily have an\nincome of $6 250 or more per month or $75 000 or more per annum\nbut in any month has an income of $6 250 or more or for the period\n1st April, 2022 to 31st March, 2023 has an income of $75 000 or more\n\n\f10\n\nwhich  in  any  instance  arises  because  of  supplemental  wages  or\notherwise; and\n\n(c)\n\na self-employed individual who has an income of $75 000 or more for\nthe period 1st April, 2022 to 31st March, 2023.\n\nRate of levy applicable to employed individuals and self-employed\nindividuals\n\n7.(1)\nemployed individuals is one per cent.\n\nThe  rate  of  the  levy  payable  by  employed  individuals  and  self-\n\nA  specially  qualified  person  who  has  received  a  tax  concession  under\n(2)\nsection 9(5) of the Income Tax Act, Cap. 73 shall pay the levy on the income less\nthe concessions granted.\n\nCollection of levy by employers\n\nAn employer shall deduct and withhold from the emoluments of an\n8.(1)\nindividual in his employ, the amount of the levy imposed pursuant to section\n6(a) at the rate specified under section 7 and shall remit to the Authority the sums\ndeducted and withheld on or before the 15th day of the following month for the\nprevious month.\n\nAn  employer  shall  deduct  and  withhold  from  the  emoluments  of  an\n(2)\nindividual in his employ, the amount of the levy imposed pursuant to section\n6(b) at the rate specified under section 7 and\n\n(a)\n\n(b)\n\nshall  remit  the  sums  deducted  and  withheld  to  the  Authority  on  or\nbefore  the  15th  day  of  the  month  following  which  the  employee’s\nincome was $6 250 or more; or\n\nif on the 31st March, 2023 it is determined that the employee’s income\nis  $75  000  or  more  for  the  period  1st  April,  2022  to  31st  March,\n2023 shall pay the levy on or before the 15th April, 2023.\n\n\f11\n\n(3)\nThe levy imposed on an employed individual referred to in section 6(b) by\nvirtue  of  income  other  than  emoluments  and  supplemental  wages  is  due  and\npayable by that employed individual on or before the 30th April, 2023.\n\n(4)\nThe obligation of the individual to file income tax returns in accordance\nwith  the  Income  Tax  Act,  Cap.  73  shall  not  be  affected  by  subsection  (1)  or\nsubsection (2).\n\nPayment of levy by self-employed individuals\n\n9.\n6(c) is due and payable on or before the 31st March, 2023.\n\nThe levy imposed on a self-employed individual pursuant to section\n\nPandemic Contribution Levy Returns\n\nAn employer shall be required to prepare and submit a return to be\n10.(1)\nknown as a “Pandemic Contribution Levy Employer Return” to the Authority on\nthe 15th of every month for the period May, 2022 to April, 2023 and the return\nshall  reflect  the  remuneration  of  the  employees  and  the  sums  deducted  and\nwithheld accordingly.\n\nNotwithstanding  subsection  (1),  every  employer  shall  be  required  to\n(2)\nreconcile and file a Pandemic Contribution Employer Levy Reconciliation to the\nAuthority on the 30th May, 2023.\n\nAn employed individual and a self-employed individual shall be required\n(3)\nto file a return to be known as a “Pandemic Contribution Levy Return” to the\nAuthority on or before 30th April, 2023.\n\nWhere an employed individual or self-employed individual fails to file a\n(4)\nreturn  in  accordance  with  subsection  (3),  that  employed  individual  or  self-\nemployed individual shall pay a penalty of $1 000 to the Authority.\n\n\f12\n\nPART III\n\nAPPLICATION OF LEVY TO COMPANIES\n\nImposition of levy on companies\n\nWith effect from the 1st July, 2022, a levy is payable by a company in\n11.\nrespect of the financial year ended in 2020 and the financial year ended in 2021,\nwhere the company had a net income of $5 million or more in both of those years\nor in either of those years.\n\nRate of levy applicable to companies\n\n12.\n15 per cent of the net income of that company.\n\nThe rate of the levy payable by a company pursuant to section 11 is\n\nPayment of levy by companies\n\nA company shall pay to the Commissioner 4 instalments each of an\n13.(1)\namount equal to 3.75 per cent of the net income of that company to constitute the\namount of the levy payable pursuant to section 11.\n\nPursuant to subsection (1) a company shall pay the 4 instalments each of\n(2)\nan amount equal to 3.75 per cent of the net income of that company that constitute\nthe amount of the levy as follows:\n\n(a)\n\nfor the financial year ended 2020 on the following dates:\n\n(i)\n\n15th July, 2022;\n\n(ii)\n\n15th August, 2022;\n\n(iii)\n\n15th September, 2022;\n\n(iv)\n\n15th October, 2022; and\n\n(b)\n\nfor the financial year ended 2021 on the following dates:\n\n(i)\n\n15th November, 2022;\n\n\f13\n\n(ii)\n\n15th December, 2022;\n\n(iii)\n\n15th January, 2023;\n\n(iv)\n\n15th February, 2023.\n\nPandemic Contribution Levy Companies Return\n\nA company shall file, with the Authority, a return to be known as a\n14.\n“Pandemic Contribution Levy Company Return” on the payment dates for the\nperiod 15th July, 2022 and 15th February, 2023.\n\nPART IV\n\nACCOUNTS AND RECORDS\n\nKeeping of accounts and records\n\n15.(1)\nA company, an employer or a self-employed individual, shall keep\nappropriate records, information and accounts so as to enable the Commissioner\nto  determine  the  amount  of  the  levy  which  is  payable  by  the  company,  the\nemployed individual or the self-employed individual, as the case may be, for any\npayment period.\n\nThe records, information and accounts referred to in subsection (1) shall\n(2)\nbe in electronic form in a readable format and paper form and shall be kept and\nfurnished when required in accordance with this Act.\n\nWhere a company, an employer or a self-employed individual fails to keep\n(3)\nadequate  records,  information  and  accounts  for  the  purposes  of  this  Act,  the\nCommissioner may require that company, employer or self-employed individual\nto keep such records, information and accounts as the Authority determines.\n\nA  company,  an  employer  and  a  self-employed  individual  required  by\n(4)\nsubsection (1) to keep records, information and accounts shall retain the records,\ninformation and accounts until the expiration of 5 years after the end of the year\n\n\f14\n\nto which the records, information and accounts relate or for such shorter period\nas the Commissioner may determine.\n\nWhere a person fails to keep or furnish adequate records, information and\n(5)\naccounts in accordance with this section, that person shall pay a penalty of $500\nto the Authority for each breach in addition to interest at the rate of one per cent\ncalculated for each month during which any part of that amount was not paid on\nthe largest amount of levy and penalty that was due and unpaid at any time in\nthat month.\n\nNotwithstanding  subsection  (4),  a  company,  an  employer  and  a  self-\n(6)\nemployed individual shall seek the permission of the Commissioner, in writing,\nto destroy any records, information and accounts required to be retained pursuant\nto this section.\n\n(7)\n\nWhere a company, an employer and a self-employed individual\n\n(a)\n\n(b)\n\nfails  to  seek  permission  to  destroy  the  records,  information  and\naccounts in accordance with subsection (6); or\n\ndestroys the records, information and accounts without the permission\nof the Commissioner or reasonable excuse\n\nthat company, employer or self-employed individual shall pay a penalty of $500\nto the Authority for each breach, in addition to interest at the rate of one per cent\ncalculated for each month during which any part of that amount was not paid on\nthe largest amount of levy and, the penalty that was due and unpaid at any time\nin that month.\n\nAudit\n\n16.(1)\nAn officer may, at any reasonable time, enter any premises or place\nof a company, an employer or a self-employed individual where any records,\ninformation or books of account relating thereto are kept and\n\n(a)\n\ninspect, audit or examine the records, information and books of account\nof the company, the employer or the self-employed individual or any\n\n\f15\n\nproperty  or  process  of  that  company,  employer  or  self-employed\nindividual on or any other matter that may be relevant in determining\n\n(i)\n\nthe amount of levy or any other amount payable by the company,\nemployed individual or self-employed individual under this Act;\nor\n\n(ii)\n\nthe amount of a refund that is payable to the company, employed\nindividual or self-employed individual under this Act;\n\n(b)\n\nrequire  a  manager  of  the  company,  employer  or  self-employed\nindividual to give him all reasonable assistance with his inspection,\naudit  or  examination  and  to  answer  all  questions  relating  to  his\nresponsibility for the payment of the levy under this Act either orally\nor in writing.\n\nFor the purposes of subsection (1), the officer may require the manager of\n(2)\nthe company, the employer or the self-employed individual to be present at the\npremises or place with him for the inspection, audit or examination and to answer\nany question relating to the obligation for the payment of the levy under this Act.\n\nWhere,  during  the  course  of  an  audit  or  examination  referred  to  in\n(3)\nsubsection (1), it appears to the officer referred to in that subsection that there\nhas been a violation of this Act or any regulations made under this Act, the officer\nmay seize and take away any records, information or books of account which\nmay afford evidence of the violation.\n\nThe Commissioner may, for any purpose related to the administration of\n(4)\nthis Act, by registered letter or by a demand served personally, require any person\nto\n\n(a)\n\n(b)\n\nprovide any information in the form of a return or otherwise; and\n\nproduce any record, information or books of account, within such time\nas the Commissioner specifies.\n\n(5)\n\nA person who fails to\n\n(a)\n\nprovide any information in the form of a return or otherwise; and\n\n\f16\n\n(b)\n\nproduce any record, information or books of account, within such time\nas the Commissioner specifies\n\npursuant to subsection (4) shall pay a penalty of $500 to the Authority for each\nbreach in addition to interest at the rate of one per cent calculated for each month\nduring which any part of that amount was not paid on the largest amount of the\nlevy and penalty that was due and unpaid at any time in that month.\n\nCopies of documents\n\nWhere  any  document,  information  or  book  of  account  has  been\n17.\nproduced, seized, inspected or examined by an officer under this Act, the officer\nmay make copies; and a document purporting to be certified by the officer to be\na copy made pursuant to this section is admissible in evidence and has the same\nprobative value as the original document.\n\nPART V\n\nASSESSMENT\n\nAssessment\n\n18.(1)\nThe Commissioner may determine the assessable income in respect\nof  the  levy  for  the  applicable  payment  period  in  respect  of  a  company,  an\nemployed individual or a self-employed individual and shall assess the amount\nof the levy for that applicable payment period in respect of such a company, an\nemployed individual or a self-employed individual.\n\n(2)\n\nWhere\n\n(a)\n\na company, an employer or a self-employed individual has failed to\n\n(i)\n\nfile a return in accordance with this Act; or\n\n(ii)\n\npay the levy payable in accordance with this Act; or\n\n\f17\n\n(b)\n\nthe Commissioner is satisfied that a true account of the levy payable\nhas not been given in a return,\n\nthe Commissioner may, after consideration of any representation or information\nwhich the company, the employer and the self-employed individual may make\nor supply to him, assess the levy payable by that company, employed individual\nor self-employed individual for the applicable payment period; and the levy for\nthat period shall be paid on the amount assessed.\n\nIn making an assessment under subsection (l) or under paragraph (b) of\n(3)\nsubsection 2, the Commissioner is not bound by the information contained in a\nreturn  in  respect  of  the  company,  employed  individual  or  self-employed\nindividual being assessed or by any other information supplied by, on behalf of,\nor in respect of, that company, employed individual or self-employed individual.\n\n(4)\n\nFor the purposes of this section, the assessable income of\n\n(a)\n\nan employed individual or a self-employed individual is his aggregate\ngross income derived from sources within Barbados for the period 1st\nApril 2022 to 31st March 2023;\n\n(b)\n\na company is the aggregate net income derived from sources within\nBarbados for the financial years ended 2020 and 2021.\n\nReassessments\n\n19.\nCommissioner may make a reassessment of the levy for the applicable period\n\nWhere  an  assessment  has  been  made  pursuant  to  section  18,  the\n\n(a)\n\nat any time, where the company, employed individual or self-employed\nindividual has made any misrepresentation or has failed to disclose any\nmaterial fact in making the return or in supplying information required\nto be supplied in accordance with this Act; or\n\n(b)\n\nin any other case, within 5 years after the end of applicable payment\nperiod of the levy.\n\n\f18\n\nNotice of assessment\n\nAfter  making  an  assessment  or  a  reassessment  under  section  18  or\n20.\n19, the Commissioner shall deliver a notice of assessment or reassessment, as the\ncase may be, to the company, employed individual or self-employed individual\nshowing the amount of the proceeds for the applicable period.\n\nRefunds\n\n21.(1)\n\nSubject to this section, the levy is not refundable.\n\nWhere the amount paid by a company, an employed individual or a self-\n\n(2)\nemployed individual as the levy\n\n(a)\n\n(b)\n\nis in excess of the amount due; or\n\nwas paid in error,\n\nthe  Commissioner  shall  refund  the  company,  employed  individual  or  self-\nemployed individual the excess or the amount paid in error.\n\nA company, an employed individual or a self-employed individual may\n(3)\nrequest that the excess or the amount paid in error referred to in subsection (2)\nbe applied against any outstanding liability of that company, employed individual\nor self-employed individual under the following enactments:\n\n(a)\n\n(b)\n\n(c)\n\nthe Income Tax Act, Cap. 73;\n\nthe Land Tax Act, Cap. 78A; or\n\nthe Value Added Tax Act, Cap. 87.\n\nRefunds granted under this section are a charge on the Consolidated Fund\n(4)\nand  shall  be  made  by  the  Commissioner  out  of  the  funds  provided  by  the\nAccountant General for the purpose.\n\n\f19\n\nPART VI\n\nOBJECTIONS, APPEALS, RECOVERY\n\nObjections\n\n22.(1)\na self-employed individual\n\nSubject to this section, where a company, an employed individual or\n\n(a)\n\n(b)\n\nhaving been assessed, disagrees with the assessment; or\n\nhaving made an application for a refund of the levy, disagrees with the\nCommissioner's determination respecting the application,\n\nthat company, employed individual or self-employed individual, may object to\nthe assessment, reassessment or determination by filing a notice of objection with\nthe  Commissioner  within  21  days  after  the  date  of  the  notice  of  assessment,\nreassessment or notice of determination, as the case may be, or such longer period\nas the Commissioner allows.\n\nExcept  with  leave  of  the  Commissioner,  a  company,  an  employed\n(2)\nindividual or a self-employed individual may not object to an assessment unless\nthe company, employed individual or self-employed individual has either paid\nthe  amount  that  was  so  assessed  or  given  security,  in  an  amount  and  form\nsatisfactory to the Commissioner, for the payment thereof.\n\nA notice of objection shall be in writing and shall state the grounds for the\n\n(3)\nobjection.\n\nThe Commissioner shall give a person who has objected to an assessment,\n(4)\nreassessment  or  determination,  an  opportunity  to  support  his  objection  by  a\nwritten or oral submission to the Commissioner.\n\n\f20\n\n(5)\nThe Commissioner shall, after receiving a notice of objection in respect of\nan assessment, a reassessment or a determination and after giving the person who\nobjected an opportunity to support his objection,\n\n(a)\n\nreview  the  assessment,  reassessment  or  determination  and  either\nconfirm it or make a reassessment or redetermination, as the case may\nrequire; and\n\n(b)\n\ndeliver to the person who objected, a notice of confirmation, a notice\nof reassessment or a notice of redetermination, as the case may require.\n\nAppeal to Tribunal\n\nAny person who has objected to an assessment or determination and\n23.(1)\nwho received a notice of confirmation or redetermination, may appeal from the\ndecision of the Commissioner to the Barbados Revenue Appeals Tribunal, within\n30  days  after  the  day  on  which  the  notice  of  confirmation,  reassessment  or\nredetermination, as the case may be, was delivered to him.\n\nWhere  a  person  has  filed  a  notice  of  objection  under  this  Act  and  the\n(2)\nCommissioner has not, within 12 months thereafter, delivered to the person a\nnotice of confirmation or redetermination, the person may appeal to the Tribunal\nin respect of the objection.\n\nWhere the Commissioner delivers to a person, a notice of confirmation or\n(3)\nredetermination respecting an objection after the expiration of the period of 6\nmonths referred to in subsection (2), the person may appeal to the Tribunal within\n30 days after the delivery of the notice.\n\nAn appeal under this section shall be instituted by filing a notice of appeal\n(4)\nwith the Tribunal together with such copies thereof as the Tribunal may require,\nand such notice shall, as far as possible, state the precise grounds of appeal.\n\nWhere the Tribunal is satisfied that there is good reason for the failure of\n(5)\na  person  to  object  or  appeal  within  the  time  specified  in  section  22  or  in\nsubsections (1), (2) or (3), the Tribunal may allow the person such further time\nas the Tribunal thinks fit.\n\n\f21\n\nIn disposing of an appeal under this section in respect of an assessment or\n\n(6)\ndetermination, the Tribunal may\n\n(a)\n\n(b)\n\nconfirm or vacate the assessment or determination;\n\nmake an order referring the assessment or determination back to the\nCommissioner for reassessment or redetermination in accordance with\nthe directions of the Tribunal; or\n\n(c)\n\nmake such order as the Tribunal thinks fit.\n\nWhere the Tribunal has referred an assessment or determination back to\n\n(7)\nthe Commissioner with directions for reassessment or redetermination by him\n\n(a)\n\n(b)\n\nthe  Commissioner  shall  make  a  reassessment  or  redetermination  in\naccordance with those directions and shall deliver to the appellant a\nnotice of reassessment or notice of redetermination, as the case may\nbe; and\n\nif the appellant believes that such notice of reassessment or notice of\nredetermination is not in accordance with the directions of the Tribunal,\nhe may apply to the Tribunal for an order determining the content of\nthe notice of reassessment or notice of redetermination, as the case may\nbe, which shall then be delivered by the Commissioner to the appellant.\n\nAppeal to the High Court\n\n24.(1)\nof the Tribunal to the High Court.\n\nAny party to an appeal to the Tribunal may appeal from the decision\n\nIn disposing of an appeal under this section in respect of an assessment or\n\n(2)\ndetermination, the High Court may\n\n(a)\n\n(b)\n\nconfirm or set aside the assessment or determination;\n\nmake an order referring the assessment or determination back to the\nCommissioner for reassessment or redetermination in accordance with\nthe directions of the Court; or\n\n\f22\n\n(c)\n\nmake such other order as it thinks fit.\n\nRecovery of the levy\n\n25.\nThe  levy  payable  under  this  Act  and  any  other  amount  payable  as\npenalties and interest, is a debt due to the State and recoverable as such in civil\nproceedings in the High Court or in the magistrate’s court for District A, at the\noption of the State, notwithstanding that the amount involved exceeds the normal\nmonetary limit on the jurisdiction of a magistrate’s court.\n\nUnpaid levy certificates\n\nAn amount payable by a company, an employed individual or a self-\n26.(1)\nemployed individual under this Act that has remained unpaid for a period of 30\ndays may be certified in relation to that company, employed individual or self-\nemployed individual by the Commissioner in a certificate called an unpaid levy\ncertificate.\n\nAn unpaid levy certificate may be filed by the Commissioner in the High\n(2)\nCourt or in the magistrate's court of District \"A\" and shall be registered in the\ncourt in which it is filed and after the expiry of 7 days after it is filed and registered\nhas the same force and effect as a judgment of the court in which it is registered\nin favour of the State against the company, employed individual or self-employed\nindividual named in the certificate for the amount specified in the certificate, plus\n\n(a)\n\n(b)\n\ninterest thereon as provided in this Act until the date of payment; and\n\nthe reasonable costs and charges attendant upon the registration of the\ncertificate,\n\nand all proceedings may be taken on the certificate and it may be enforced as if\nit was a judgment of the court in which it is registered.\n\nWhere an unpaid levy certificate is filed by the Commissioner in the High\n(3)\nCourt or in the magistrate's court of District \"A\", the Commissioner shall deliver\na copy of the unpaid levy certificate to the company, employed individual or self-\nemployed individual.\n\n\f23\n\n(4)\nWhere a judgment exists by virtue of subsection (1) or is obtained in any\ncourt against a company, an employed individual or a self-employed individual\nin  respect  of  the  levy  owed,  the  Commissioner  may  proceed  to  execute  and\nenforce  that  judgment  and  exercise  all  the  remedies  attached  thereto  for  the\nsatisfaction of the judgment notwithstanding any enactment or rule of law to the\ncontrary relating to\n\n(a)\n\n(b)\n\nthe powers and duties of a receiver;\n\nthe effect of a winding up order under the Companies Act, Cap. 308;\nor\n\n(c)\n\nthe effect of a receiving order under the Bankruptcy Act, Cap. 303.\n\nPART VII\n\nMISCELLANEOUS\n\nExtension\n\n27.(1)\nThe  Commissioner  may  in  writing,  grant,  on  a  written  application\nmade  to  him  by  a  company,  an  employed  individual  or  a  self-employed\nindividual, an extension in respect of the date for\n\n(a)\n\n(b)\n\nthe filing of a return in accordance with this Act; and\n\nthe payment of the levy due under this Act.\n\nNotwithstanding subsection (1), the Commissioner may, in writing, grant\n\n(2)\nan extension in respect of the date for\n\n(a)\n\n(b)\n\nthe filing of a return in accordance with this Act; and\n\nthe payment of the levy due under this Act\n\non the grounds of undue hardship or for any other reason where it would be just\nand equitable to do so.\n\n\f24\n\nThe obligation to file a return under this Act or to pay the levy imposed by\n\n(3)\nthis Act is not affected by subsection (1) or subsection (2).\n\nObstruction of officers\n\n28.\nA person who threatens, assaults or obstructs any officer acting in the\nexecution  of  his  duty  under  this  Act  is  guilty  of  an  offence  and  is  liable  on\nsummary conviction to a fine of $20 000 or to imprisonment for 3 years or to\nboth.\n\nPenalties and interest\n\n29.(1)\n\nWhere a company\n\n(a)\n\n(b)\n\n(c)\n\nfails to pay the levy imposed under this Act;\n\npays the levy after date specified by this Act; or\n\nfails to file the relevant return in accordance with this Act\n\nthat company shall pay a penalty of $500 to the Authority for each breach in\naddition to interest at the rate of one per cent calculated for each month during\nwhich any part of that amount was not paid on the largest amount of levy and\npenalty that was due and unpaid at any time in that month.\n\n(2)\n\nWhere an employer\n\n(a)\n\n(b)\n\nfails to deduct and withhold the levy pursuant to section 8;\n\nfails  to  remit  to  the  Commissioner  the  levy  deducted  and  withheld\npursuant to section 8;\n\n(c)\n\nfails to file the relevant return in accordance with this Act\n\nthat employer shall pay a penalty of $500 to the Authority for each breach in\naddition to interest at the rate of one per cent calculated for each month during\nwhich any part of that amount was not paid on the largest amount of levy and\npenalty that was due and unpaid at any time in that month.\n\n\f25\n\n(3)\n\nWhere a self-employed individual\n\n(a)\n\n(b)\n\nfails to pay the levy imposed under this Act;\n\npays the levy after date specified by this Act; or\n\nthat self-employed individual shall pay a penalty of $500 to the Authority for\neach breach in addition to interest at the rate of one per cent calculated for each\nmonth during which any part of that amount was not paid on the largest amount\nof levy and penalty that was due and unpaid at any time in that month.\n\nDisallowed deductions\n\n30.\nCap. 73 for any amount that is paid or incurred under this Act.\n\nNo  deduction  is  allowed  under  section  10  of  the  Income  Tax  Act,\n\nRegulations\n\n31.\nprovisions of this Act.\n\nThe  Minister  may  make  regulations  generally  for  carrying  out  the\n\nAmendment of the enactments in the Schedule\n\n32.\nto the extent set out in the second column opposite thereto.\n\nThe enactments set out in the first column of the Schedule are amended\n\nExpiration\n\n33.\n\nThis Act shall cease to have effect after the 31st day of March, 2023.\n\n\f26\n\n L.R.O. 1998SCHEDULE(Section 32)CONSEQUENTIAL AMENDMENTSColumn 1Enactment1. Income Tax Act, Cap. 732. Barbados Revenue Act,   2014 (Act 2014-1)Column 2AmendmentSection 11(1) is amended by(a) deleting the word “and” in paragraph (h);(b) deleting the full stop at the end of paragraph (i) and substituting a semi-colon; and(c) inserting immediately after paragraph (i) the following:  \"(j) the levy imposed by the Pandemic   Contribution Levy Act, 2022 (Act 2022-   ).”.In the First Schedule insert the following new paragraphafter paragraph 11:  \"12. Pandemic Contribution Levy Act,  2022 (Act 2022-   ).”.\f27\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2022.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2022.\n\nPresident\n\n"
}