{
  "bill_id": 638,
  "slug": "resolution-re-special-loans-scotland-district-rehabilitation-project",
  "title": "Resolution re Special Loans (Scotland District Rehabilitation Project)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/9428c1bf3f10d56aa212ccd3d2130582.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-06-22",
  "first_reading": "2022-06-29",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\n2022-04-22\n\nPARLIAMENT\n\nWHEREAS by virtue of section 2 of the Special Loans Act, Cap. 105 the Government\n\nis authorised from time to time to borrow from another government, any bank, corporation, company\n\nor other institution sums of money not exceeding in the aggregate BBD 2 500 000 000 on such\n\nterms as may be agreed upon between the Government and the lender of any such sum of money;\n\nAND  WHEREAS  by  section  3  of  the  said Act  it  is  provided  that  any  money\n\nborrowed under the authority of the Act shall be appropriated and applied to such purposes as\n\nParliament may approve by resolution and that such money and any interest payable thereon is\n\ncharged upon the general revenues and assets of Barbados;\n\nAND  WHEREAS  the  Government  considers  it  necessary  to  borrow  the  sum  of\n\napproximately BBD 256 600 000 from Export – Import Bank of China to ﬁ nance the execution of\n\nthe Scotland District Road Rehabilitation Project;\n\nAND WHEREAS the said sum of approximately BBD 256 600 000 is borrowed on\n\nthe terms and conditions contained in an Agreement, the main provisions of which are set out in\n\nthe Schedule;\n\n\f2\n\nAND WHEREAS the said sum of approximately BBD 256 600 000 is within the authorised\n\nborrowing limit given to the Government under section 2 of the said Act;\n\nBE IT RESOLVED therefore that Parliament approve the borrowing of the sum of approximately\n\nBBD 256 600 000 from Export – Import Bank of China to ﬁ nance the execution of the Scotland District Road\n\nRehabilitation Project on the terms and conditions contained in an Agreement, the main provisions of which\n\nare set out in the Schedule.\n\nAPPROVED by the House of Assembly this            day of                               , Two\n\nThousand and Twenty-two.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                          ,  Two\n\nThousand and Twenty-two.\n\n   President\n\n\f3\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nGovernment of Barbados.\n\nExport – Import Bank of China.\n\nApproximately BBD 256 600 000, Renminbi 815 500 000.\n\nBorrower:\n\nLender:\n\nAmount:\n\nLoan currency:\n\nRenminbi.\n\nPurpose:\n\nTerm:\n\nGrace period:\n\nRepayment:\n\nInterest rate:\n\nTo ﬁ nance the execution of the Scotland District Road Rehabilitation\nProject.\n\n20 years.\n\n60 months from the effective date of the Agreement.\n\n31 equal semi-annual instalments.\n\n2% per annum.\n\nDisbursement period:\n\n48 months from the effective date of the Agreement.\n\nCommitment fee:\n\n0.25% per annum on the undisbursed balance paid semi-annually.\n\nManagement fee:\n\n0.25%  on  the  aggregate  amount  of  approximately  BBD  641  530\npayable in one lump sum within 30 days after the effective date of the\nAgreement, but no later than the ﬁ rst disbursement date.\n\nGoverning Law:\n\nLaws of China.\n\n\f4\n\nADDENDUM\n\nThis  Resolution  seeks  the  approval  of  Parliament  for  the  borrowing  of  approximately\n\nBBD 256 600 000 by way of a term loan from the Export – Import Bank of China.\n\nThe sum of approximately BBD 256 600 000 is within the limit of the Special Loans Act,\n\nCap. 105.\n\nThe loan will be used to ﬁ nance the execution of the Scotland District Road Rehabilitation\n\nProject.\n\n"
}