{
  "bill_id": 639,
  "slug": "resolution-uwi-guarantee-of-loans-regional-digital-transformation-project",
  "title": "Resolution - UWI Guarantee of Loans - Regional Digital Transformation Project",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/bc00e98885011c848c306943f25d8aa5.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-07-27",
  "first_reading": "2022-08-10",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\n2022-05-10\n\nPARLIAMENT\n\nWHEREAS by virtue of subsection (1) of section 3 of the University of the West\n\nIndies  (Guarantee  of  Loans)  Act,  Cap.  106B,  the  Government  may,  with  the  approval  of  the\n\nParliament, guarantee the payment of the principal and interest due in respect of loans granted to\n\nthe University of the West Indies;\n\nAND WHEREAS by virtue of subsection (1) of section 3 of the Act, the Government\n\nmay by resolution of both Houses of Parliament, guarantee the payment of the principal and interest\n\ndue in respect of loans granted to the University on such terms and conditions as it thinks ﬁ t, but such\n\namounts shall not exceed the sum of 100 million dollars, exclusive of the interest payable thereon;\n\nAND  WHEREAS  the  Government  is  seeking  to  guarantee  approximately\n\nBBD $2.0 million of an approximately BBD $12 million loan from the Caribbean Development\n\nBank  to  the  University  of  the  West  Indies  on  the  terms  and  conditions  of  an Agreement,  the\n\nmain  provisions  of  which  are  set  out  in  the  Schedule  to  this  Resolution,  for  the  purpose  of\n\nﬁ nancing the Regional Digital Transformation Project;\n\nAND WHEREAS the principal and interest due in respect of the loan to be guaranteed\n\ndoes not exceed the limit given to the Government under section 3(1) of the said Act;\n\n\f2\n\n  BE  IT  RESOLVED  that  Parliament  approve  the  guarantee  by  the  Government  of\n\napproximately BBD $2.0 million of an approximately BBD $12 million loan to be granted to the University\n\nfrom the Caribbean Development Bank for the purpose of ﬁ nancing the Regional Digital Transformation\n\nProject on the terms and conditions of an Agreement, the main provisions of which are set out in the Schedule.\n\nAPPROVED by the House of Assembly this            day of                               , Two\n\nThousand and Twenty-two.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                          ,  Two\n\nThousand and Twenty-two.\n\n   President\n\n\f3\n\nSCHEDULE\n\nFacility:\n\nLender:\n\nAmount:\n\nTERMS AND CONDITIONS\n\nLoan.\n\nCaribbean Development Bank.\n\nBBD $4 000 000 Special Fund Resources and\nBBD $8 000 000 Ordinary Capital Resources.\n\nGuaranteed Amount:\n\nBBD $2 000 000 of the Special Fund Resources portion.\n\nBorrower:\n\nGuarantor:\n\nPurpose:\n\nMoratorium:\n\nTerm:\n\nRepayment:\n\nUniversity of the West Indies.\n\nGovernment of Barbados.\n\nTo ﬁ nance a Regional Digital Transformation Project.\n\nSpecial Fund Resources:\n\n3 years.\n\nOrdinary Capital Resources: 3 years.\n\nInclusive of Grace Period:  Special Fund Resources: 30 years.\n\nOrdinary Capital Resources: 20 years.\n\nSpecial Fund Resources:\n\n108  equal  or  approximately  equal,\nconsecutive  quarterly  payments  on  the\ndue dates.\n\nOrdinary Capital Resources:  68  equal  or  approximately  equal\nconsecutive  quarterly  payments  on\nthe due dates.\n\n\f4\n\nSchedule - (Concl'd)\n\nTERMS AND CONDITIONS - (Concl'd)\n\nInterest rate:\n\nSpecial Fund Resources:\n\nPer annum, ﬁ xed 0.75%.\n\nOrdinary Capital Resources:  Per  annum,  variable,  currently  3.60%,\npayable quarterly on the balance of the\nloan withdrawn and outstanding at the\ndue dates.\n\nCommittment Fee:\n\nSpecial Fund Resources:\n\nNot applicable.\n\nOrdinary Capital Resources:  1.0% per annum on undisbursed balance\nfrom  the  60th  day  after  the  date  of  the\nloan agreement.\n\nSecurity:\n\nThe Borrower shall furnish or cause to be furnished to the Bank the\nGuarantee Agreements, in form and substance acceptable to the Bank.\n\nConditions precedent to First\nDisbursement for the purposes\nof this Resolution:\n\nThe Guarantee Agreements have been executed.\n\nGoverning Law:\n\nLaws of Barbados.\n\n\f5\n\nADDENDUM\n\nThis Resolution seeks the approval of Parliament in respect of a guarantee by the\n\nGovernment of approximately BBD $2.0 million of an approximately BBD $12 million loan from\n\nthe Caribbean Development Bank to the University of the West Indies on the terms and conditions\n\nof an Agreement, the main provisions of which are set out in the Schedule to this Resolution for\n\nthe purpose of ﬁ nancing the Regional Digital Transformation Project.\n\nThe principal and interest due in respect of the loan to be granted to the University to be\n\nguaranteed does not exceed the limit given to the Government under the University of the West\n\nIndies (Guarantee of Loans) Act, Cap. 106B.\n\n"
}