{
  "bill_id": 640,
  "slug": "debt-conversion-counterguarantee-bill-2022",
  "title": "Debt Conversion (Counter-Guarantee) Bill 2022",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/f042f400d26382471294d257d2d7feb6.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-06-29",
  "first_reading": "2022-06-29",
  "gazette_date": "2022-06-30",
  "markdown": "2022-06-21\n\nOBJECTS AND REASONS\n\nThis Bill would authorize the Government of Barbados to enter into a counter-\nguarantee  agreement  with  any  body  in  respect  of  debt  to  be  issued  by  the\nGovernment of Barbados, the proceeds of which will be used for debt conversion\ntransactions  for  the  purpose  of  supporting  environmental,  economic  or  social\ndevelopment in Barbados and for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\nShort title\n\nInterpretation\n\nPurpose\n\nCounter-guarantee agreement\n\nRedemption of debt\n\nPower to sign agreement\n\nImplementation of obligations\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to authorize the Government of Barbados to enter into a counter-\nguarantee  agreement  with  any  body  in  respect  of  debt  to  be  issued  by  the\nGovernment  of  Barbados,  the  proceeds  of  which  will  be  used  for  debt\nconversion  transactions  for  the  purpose  of  supporting  environmental,\neconomic or social development in Barbados and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nAct, 2022.\n\nThis Act may be cited as the Debt Conversion (Counter-Guarantee)\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“body”  means  any  international  lending  agency,  bank,  corporation  or\n\norganization, whether corporate or unincorporate;\n\n“counter-guarantee agreement” means a counter-guarantee agreement concluded\n\nunder section 4;\n\n“debt” means any security or loan issued by the Government for the purposes of\n\nthis Act;\n\n“Minister” means the Minister responsible for Finance.\n\nPurpose\n\n3.\nThe purpose of this Act is to authorize the Government to enter into\ncounter-guarantee agreements in respect of debt to be issued in order to facilitate\nthe execution of programmes to provide for the environmental, economic and\nsocial development of Barbados.\n\nCounter-guarantee agreement\n\n4.(1)\nFor the purposes of this Act, the Government may, in such manner,\non such terms and subject to such conditions as may be agreed with any body,\nenter into a counter-guarantee agreement in respect of debt to be issued by the\nGovernment, the proceeds of which will be used for debt conversion transactions\nto support environmental, economic and social development in Barbados.\n\nThe amount of any debt in respect of which the Government enters into a\n(2)\ncounter-guarantee agreement shall be, and is hereby appropriated to the purposes\nspecified in the counter-guarantee agreement.\n\n\f5\n\n(3)\nA  copy  of  every  counter-guarantee  agreement  shall  be  laid  before\nParliament within 30 days of the conclusion of that agreement or, if Parliament\ndoes not sit within that time, within 30 days after the commencement of its next\nsitting.\n\nRedemption of debt\n\nAll  amounts  required  for  the  redemption  of  the  debt  to  which  a\n5.\ncounter-guarantee  agreement  applies  are  hereby  charged  upon  and  shall  be\npayable out of the Consolidated Fund.\n\nPower to sign agreement\n\nThe Minister or such person as the Minister designates in writing for\n6.\nthe purpose may sign any counter-guarantee agreement referred to in section 4.\n\nImplementation of obligations\n\nNotwithstanding any law in force in Barbados, a counter-guarantee\n7.\nagreement entered into by the Government shall be valid and enforceable and\nshall have full force and effect in accordance with its terms.\n\n"
}