{
  "bill_id": 644,
  "slug": "resolution-to-vest-1379-square-metres-of-land-at-lancaster-st-james",
  "title": "Resolution to Vest 137.9 Square Metres of Land at Lancaster St. James",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/a68df3a840c9ca125d4be9584e8736d7.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-07-27",
  "first_reading": "2022-08-10",
  "gazette_date": null,
  "markdown": "2022-06-10\nPARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 approve the vesting in the National Housing Corporation of the parcel of land, the property of the State, situate at Lancaster in the parish of Saint James in this Island and more particularly described in the Schedule for the provision of road access.\nAPPROVED by the House of Assembly this\nday of\nTwo thousand and twenty-two.\nSPEAKER\nAPPROVED by the Senate this\nday of\n, Two\nthousand and twenty-two.\nPRESIDENT\nP\n———\nSCHEDULE\nsituate Lancaster in the parish of\nALL THAT land the property of the State at St. James in this Island containing by admeasurement 137.9 square metres or thereabouts (forming part of a larger area containing by admeasurement 15 720.9 square metres) abutting and bounding on lands now or formerly of the National Housing Corporation and on a road reserve 6.40 metres wide adjoining a public road which leads to Greenwich in one direction and to the Ronald Mapp Highway in another direction or however else the same may abut and abound as shown and delineated as “Area A” on a plan certified on the 25\" day of January, 2021 by Ricardo A. Phillips, Land Surveyor and recorded in the Lands and Surveys Department on the 25% day of January, 2021 as Plan No. 71/2021.\nADDENDUM\nThe Cabinet at its meeting held on the 11 day of November, 2021 considered Note (21) 1182/MHLM 77 and agreed to the vesting in the National Housing Corporation of the parcel of land containing 137.9 square metres situate at Lancaster, St James for the provision of road access.\nThe parcel of land formed part of a larger area of land measuring 1577.41 square metres at Lancaster Plantation situate at Lancaster, St. James. The larger area of land was compulsorily acquired by the Crown for the improvement of Highway 2A, by Notice under section 5 of the Land Acquisition Act, Cap. 228, published as S.I. 1995 No. 105 in Supplement No. 54 to the Official Gazette No. 101 dated the 7\" day of December, 1995.\nIn accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 the approval of Parliament is now sought for the vesting in the National Housing Corporation of the parcel of land described in the Schedule for the provision of road access.\n"
}