{
  "bill_id": 645,
  "slug": "electric-light-and-power-amendment-bill-2022",
  "title": "Electric Light and Power (Amendment) Bill, 2022",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3200508c040b74572cc78ff306645e43.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-08-06",
  "first_reading": "2022-08-10",
  "gazette_date": "2022-07-18",
  "markdown": "2022-07-21\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend\n\nthe  Electric  Light  and  Power  Act,  2013\n\n(Act 2013-21).\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nAmendment of section 5 of Act 2013-21\n\nInsertion of section 5A into Act 2013-21\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Electric Light and Power Act, 2013 (Act 2013-21).\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\nAct, 2022.\n\nThis Act may be cited as the Electric Light and Power (Amendment)\n\n\f4\n\nAmendment of section 5 of Act 2013-21\n\n2.\nSection 5(4) of the Electric Light and Power Act, 2013 (Act 2013-21),\nin  this  Act  referred  to  as  the  principal  Act,  is  deleted  and  the  following\nsubstituted:\n\n“(4)\nAn applicant to whom subsection (3) applies shall not be issued\na licence until an opportunity has been given to interested parties, in\naccordance with section 5A, to make representations or objections to\nthe Minister in relation to his application.\n\nSubject to section 5A(6), where an applicant to whom subsection\n(5)\n(3) applies makes an application under this section, the application and\nany information and documents submitted in respect of the application\nshall be made available for public inspection.”.\n\nInsertion of section 5A into Act 2013-21\n\n3.\nfollowing:\n\nThe  principal  Act  is  amended  by  inserting  after  section  5,  the\n\n“Representations or objections regarding application for\nlicence\n\n5A.(1)\nAn interested party who desires to make a representation or\nan objection in relation to an application for a licence by an applicant\nto  whom  section  5(3)  applies  shall,  within  28  days  of  the  first\npublication of notice of the application, inform the Minister in writing\nof his representation or objection.\n\n(2)\n\nThe interested party\n\n(a)\n\nshall state his interest in the application;\n\n\f5\n\n(b)\n\n(c)\n\n(d)\n\nshall,  as  far  as  practicable,  state  concisely,  in  numbered\nparagraphs,\nthe  precise  nature  and  ground  of  his\nrepresentation or objection;\n\nshall include any supporting evidence; and\n\nshall not make a representation or an objection in respect of\nanything  that  is  not  directly  related  to  a  matter  set  out  in\nsection 6(2)(b) or (3).\n\nWhere  the  Minister,  after  consultation  with  the  Committee,\n(3)\nconsiders that there is merit in a representation or objection made by\nan interested party but additional information on the representation or\nobjection is required, the Minister may, within 28 days of receipt of the\nrepresentation or objection, give the interested party an opportunity to\nprovide such information orally or in writing.\n\nAn interested party shall be given no less than 14 days’ written\n(4)\nnotice  of  the  date  on  which  he  will  have  an  opportunity  to  provide\nadditional information pursuant to subsection (3).\n\nThe  Committee  shall,  in  making  a  recommendation  to  the\n(5)\nMinister in respect of an application for a licence, take into account any\nrepresentation or objection made in relation to the application that the\nMinister considers to have merit.\n\nNothing in this section entitles an interested party to have access\n\n(6)\nto information in the application of an applicant where\n\n(a)\n\n(b)\n\nthe applicant requests, in accordance with subsection (7), that\nthe information be kept confidential; and\n\nthe  Minister,  after  consultation  with  the  Committee,\ndetermines that there is merit in the request and grants the\nrequest.\n\n\f6\n\n(7)\n\nA request for confidentiality under subsection (6) shall include\n\n(a)\n\n(b)\n\na  summary  of  the  nature  of  the  information  to  be  kept\nconfidential;\n\nthe reason for the request, including details of the specific\nharm  that  would  result  if  the  information  were  publicly\ndisclosed; and\n\n(c)\n\nany  objection  to  the  disclosure  of  a  summary  of  the\ninformation.\n\nNotwithstanding subsection (6)(b), the Minister shall not grant a\n(8)\nrequest  for  confidentiality  where,  after  consultation  with\nthe\nCommittee,  the  Minister  determines  that  the  public  interest  in  the\ndisclosure of the information outweighs the interest of the applicant in\nkeeping the information confidential.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2022.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2022.\n\nPresident\n\n"
}