{
  "bill_id": 647,
  "slug": "protection-of-agricultural-products-bill-2022",
  "title": "Protection of Agricultural Products Bill, 2022",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/0bb9f758858e018a88eb54f3b86beb71.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-08-09",
  "first_reading": "2022-08-10",
  "gazette_date": "2022-08-10",
  "markdown": "2022/06/07\n\nOBJECTS AND REASONS\n\nThis Bill would make provision for the protection of agricultural products and\n\nmatters related thereto.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nInterpretation\n\nTransactions involving agricultural products\n\nProducer of agricultural products\n\nImporter of agricultural products\n\nFalsifying inspection records\n\nStolen agricultural products\n\nEnforcement\n\nTrial\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nRestitution\n\n11.\n\nSale of perishable agricultural products\n\n12.\n\nAmendment of Schedule\n\n13.\n\nRegulations\n\n14.\n\nRepeal\n\n15.\n\nCommencement\n\n\f3\n\nSCHEDULE\n\nCOMMERCIAL QUANTITIES\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to make provision for the protection of agricultural products and\n\nmatters related thereto.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n2022.\n\nThis Act may be cited as the Protection of Agricultural Products Act,\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“agricultural products” means all products grown in or on land that is produced\nfor the purpose of human consumption or for forage products cultivated for\nanimals and includes\n\n(a)\n\nsugar cane, roots, tubers, bulbs, vegetables, fruits, culinary herbs, trees,\nplants, seeds, or products thereof;\n\n(b)\n\nproducts of the following industries:\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\napiculture;\n\naquaculture;\n\ndairy;\n\nhorticulture;\n\nhydroponics;\n\n(vi)\n\nlivestock;\n\n(vii)\n\npermaculture;\n\n(viii)\n\npoultry; and\n\n(ix)\n\nvermiculture;\n\n(c)\n\nplanting material;\n\n(d)\n\nfresh water fish for human consumption.\n\n“apiculture” means products including honey, beeswax, royal jelly, bee pollen,\n\nbees, propolis, nucs and queens;\n\n\f7\n\n“aquaculture”  means  the  farming  of  aquatic  animals  with  some  manner  of\nintervention in the rearing process to enhance production such as regular\nstocking, feeding and protection from predators;\n\n“commercial quantities” means the value or the quantity of agricultural products\n\nas set out in the Schedule;\n\n“commercial-scale”  means  an  agricultural  enterprise  that  meets  the  minimum\n\nrequirements defined by the Ministry responsible for Agriculture;\n\n“dairy” means milk or any product including butter and cheese, derived from\n\ndairy animals;\n\n“dairy animals” includes cattle, sheep and goats, from which the products are\nintended for human consumption, or which are kept for raising replacement\ndairy animals;\n\n“delivery note” means a physical, electronic or digital transaction record issued\nby the owner of agricultural products to a courier for conveyance, which\ncontains the date of conveyance and the names of the owner and courier;\n\n“horticulture” means the cultivation of fruits, vegetables, flowers and ornamental\n\nplants or shrubs;\n\n“hydroponics” means the growing of plants without soil, in nutrient solutions\nwith  or  without  the  use  of  an  artificial  medium  to  provide  mechanical\nsupport;\n\n“livestock” means any animal kept for the production of meat or food, wool, skins\nor  fur,  for  labour  or  for  the  purpose  of  its  use  in  the  farming  of  land  or\ncarrying on of any agricultural activity;\n\n“permaculture” means a method of agricultural production that integrates the use\nto  create  efficient  self-sustaining\n\nof  renewable  natural  resources\necosystems;\n\n“police officer” means a member of the Police Service;\n\n\f8\n\n“poultry” means any fowl, chicken, turkey, duck, goose or other bird commonly\nreared for the purpose of human consumption and the eggs obtained from\nany such bird;\n\n“receipt” means any physical, electronic or digital transaction record issued by\n\na seller of agricultural products to a purchaser;\n\n“vehicle” has the meaning assigned to it by the Road Traffic Act, Cap. 295.\n\nTransactions involving agricultural products\n\nA person shall not purchase or in any other manner obtain possession\n3.(1)\nof commercial quantities of agricultural products unless, at the time of purchase\nor of obtaining possession of the agricultural product, the person has obtained a\nreceipt, delivery note or bill of lading from a person who is seeking to sell or\ndispose of the agricultural products.\n\nA person shall not sell or otherwise dispose of commercial quantities of\n(2)\nagricultural products unless at the time of sale or disposal, the person issues a\nreceipt, delivery note or bill of lading to the purchaser or to any other person to\nwhom possession of the agricultural products is given.\n\nA person who has purchased or in any other manner obtained possession\n(3)\nof  commercial  quantities  of  agricultural  products  or  their  representative  shall\nretain the receipt, delivery note or bill of lading for the agricultural products as\nproof of purchase or conveyance and shall produce it at the request of a police\nofficer.\n\nWhere  a  person  referred  to  in  subsection  (3)  is  unable  to  produce  the\n(4)\nreceipt, delivery note or bill of lading for the agricultural products at the request\nof  the  police  officer  pursuant  to  subsection  (3),  that  person  shall  produce  the\nreceipt, delivery note or bill of lading for the agricultural products at the police\nstation designated by the police officer within 24 hours of the date on which he\nwas required to produce it.\n\nA police officer may request additional evidence where he is not satisfied\n\n(5)\nwith the proof of purchase presented pursuant to subsections (3) or (4).\n\n\f9\n\nA person who contravenes subsection (1) is guilty of an offence and is\n\n(6)\nliable on summary conviction to a fine of $5 000.\n\nA person who contravenes subsection (2), (3) or (4) is guilty of an offence\n\n(7)\nand is liable on summary conviction to a fine of $10 000.\n\nProducer of agricultural products\n\nA person or his representative who is in possession of commercial\n4.(1)\nquantities of agricultural products that he has produced shall provide a delivery\nnote or any other evidence as proof of ownership and shall produce it at the request\nof a police officer.\n\nWhere  a  person  referred  to  in  subsection  (1)  is  unable  to  produce  the\n(2)\ndelivery  note  or  any  other  evidence  as  proof  of  ownership  of  the  agricultural\nproducts at the request of the police officer pursuant to subsection (1), that person\nshall produce the delivery note or any other evidence as proof of ownership of\nthe  agricultural  products  at  the  police  station  designated  by  the  police  officer\nwithin 24 hours of the date on which he was required to produce it.\n\nA police officer may request other evidence where he is not satisfied with\n(3)\nthe delivery note or the proof of ownership presented pursuant to subsection (1)\nor (2).\n\nA person who contravenes subsection (1) is guilty of an offence and is\n(4)\nliable on summary conviction to a fine of $10 000 or to imprisonment for 5 years\nor to both.\n\nImporter of agricultural products\n\n5.(1)\nquantities of agricultural products or his representative shall retain\n\nA  person  or  his  representative  who  has  imported  commercial\n\n(a)\n\n(b)\n\n(c)\n\nthe bill of lading in respect of the agricultural products imported;\n\nthe receipt for the imported agricultural products;\n\nthe delivery note for the imported agricultural products; or\n\n\f(d)\n\nany other evidence\n\n10\n\nas proof of ownership of the imported agricultural products.\n\n(2)\nWhere a police officer requests the production of proof of ownership of\nimported agricultural products under subsection (1), any of the following forms\nof evidence may be produced as proof of ownership:\n\n(a)\n\n(b)\n\n(c)\n\nbill of lading in respect of the agricultural products imported;\n\nreceipt for the imported agricultural products;\n\ndelivery note for the imported agricultural products; or\n\n(d)\n\nany other evidence of ownership\n\nshall be produced as proof of ownership of the imported agricultural products at\nthe request of a police officer.\n\nWhere a person referred to in subsection (2) is unable to produce the bill\n(3)\nof lading, receipt, delivery note or any other evidence as proof of ownership of\nthe imported agricultural products at the request of the police officer pursuant to\nsubsection (2), that person shall produce the bill of lading, receipt, delivery note\nor any other evidence as proof of ownership of the imported agricultural products\nat the police station designated by the police officer within 24 hours of the date\non which he was required to produce it.\n\nA police officer may request other evidence where he is not satisfied with\n(4)\nthe authenticity of the proof of ownership presented pursuant to subsection (2)\nor (3).\n\nA person who contravenes subsection (2) is guilty of an offence and is\n(5)\nliable on summary conviction to a fine of $10 000 or to imprisonment for 5 years\nor to both.\n\nFalsifying inspection records\n\n6.\nA person who forges or produces for inspection a false bill of lading,\nreceipt  or  delivery  note  for  commercial  quantities  of  agricultural  products  is\n\n\f11\n\nguilty of an offence and is liable on summary conviction to a fine of $10 000 or\nto imprisonment for 5 years or to both.\n\nStolen agricultural products\n\n7.(1)\nA person who steals any quantity of agricultural products is guilty of\nan  offence  and  is  liable  on  summary  conviction  to  a  fine  of  $100  000  or  to\nimprisonment for 5 years or to both.\n\nA  person  who  is  in  possession  of  commercial  quantities  of  agricultural\n(2)\nproducts and fails to produce, at the request of a police officer, or within 24 hours\nof the date of that request,\n\n(a)\n\n(b)\n\na receipt, delivery note, bill of lading; or\n\nproof of ownership or of lawful possession,\n\nor  otherwise  satisfy  a  police  officer  that  he  is  in  lawful  possession  of  the\nagricultural products, is guilty of an offence and is liable on summary conviction\nto a fine of $100 000 or to imprisonment for 5 years or to both.\n\nA police officer may designate the police station where the person referred\n(3)\nto  in  subsection  (2)  shall  produce  the  proof  of  ownership  or  of  lawful\npossession.\n\nA police officer may request additional evidence where he is not satisfied\n(4)\nwith the proof of ownership or lawful possession presented pursuant to subsection\n(2) or (3).\n\nEnforcement\n\n8.(1)\nan offence under this Act.\n\nA police officer may, without warrant, arrest and charge a person with\n\nWhere a police officer has reasonable grounds to suspect that a person has\n(2)\ncontravened the provisions of this Act, the police officer may without a warrant\nstop a vehicle and, upon informing the person in charge of the vehicle of the\n\n\f12\n\npurpose of the stop, may search the vehicle or search any parcel or package of\nany kind found in the vehicle.\n\nWhere in the course of examining a vehicle pursuant to subsection (2), a\n(3)\npolice  officer  discovers  commercial  quantities  of  agricultural  products  in  the\nvehicle, the police officer, pursuant to section 7, may request the person in charge\nof the vehicle to produce a receipt, delivery note or bill of lading or give other\nproof of ownership or of lawful possession.\n\nWhere the person in charge of a vehicle referred to in subsection (3) fails\n\n(4)\nto\n\n(a)\n\n(b)\n\n(c)\n\nproduce a receipt, delivery note, bill of lading;\n\ngive other proof of ownership or of lawful possession; or\n\nsatisfy the police officer that he is otherwise in lawful possession of\nthe commercial quantities of agricultural products,\n\nthe police officer may arrest and charge that person pursuant to subsection (1)\nand section 7.\n\nWhere a police officer makes an arrest pursuant to subsection (1) or (4),\n\n(5)\nthe police officer may seize\n\n(a)\n\n(b)\n\nthe agricultural product that is in the possession of the person who is\narrested; and\n\nthe vehicle where the agricultural product was found at the time of the\narrest.\n\n(6)\n\nA person who\n\n(a)\n\n(b)\n\nfails  to  comply  with  the  directions  given  by  a  police  officer  while\ncarrying out his duties pursuant to this Act; or\n\nobstructs a police officer in the execution of his duties pursuant to this\nAct,\n\n\f13\n\nis guilty of an offence and is liable on summary conviction to a fine of $10 000\nor to imprisonment for 5 years or to both.\n\nTrial\n\n9.(1)\nAs soon as may be practical after the arrest of a person for committing\nan offence under this Act, the person shall be brought before the magistrate in\nwhose jurisdiction the offence was committed.\n\nAny agricultural products seized pursuant to section 8 shall be delivered\n(2)\nto the Chief Agricultural Officer who shall keep the agricultural products pending\nthe decision of the magistrate pursuant to subsection (1) and subject to section\n11.\n\nRestitution\n\nA magistrate may order that any agricultural products alleged to have\n10.\nbeen obtained contrary to the provisions of this Act, be delivered to the person\nwho appears to the magistrate to be the owner of the agricultural products.\n\nSale of perishable agricultural products\n\n11.(1)\nNotwithstanding sections 9 and 10, where the agricultural products\nseized pursuant to this Act are likely to perish before the trial of the offence, the\nagricultural products shall be delivered to the Chief Agricultural Officer who\nshall sell the agricultural products.\n\nWhere a sale cannot be conducted pursuant to subsection (1), the Chief\n(2)\nAgricultural Officer shall dispose of the agricultural products in the manner that\nhe thinks fit.\n\nThe Chief Agricultural Officer shall deliver to the clerk of the magistrate’s\n\n(3)\ncourt where the offence referred to in subsection (1) is to be tried\n\n(a)\n\na certificate containing the following information:\n\n(i)\n\nphotographs  or  video  of  the  agricultural  products  received  by\nhim;\n\n\f14\n\n(ii)\n\na  list  of  any  unique  identifiers  on  the  agricultural  products\nreceived by him;\n\n(iii)\n\nthe quantity of agricultural products received by him;\n\n(iv)\n\nthe quantity of agricultural products sold;\n\n(v)\n\nthe amount realized by the sale;\n\n(vi)\n\nthe date of the sale;\n\n(vii)\n\nwhere the agricultural products are disposed of otherwise than by\nsale, the method and date of disposal; and\n\n(b)\n\nthe proceeds of the sale less any amount that is applied to satisfy the\nconduct of the sale.\n\nA certificate referred to in subsection (3) shall be admissible in evidence\n(4)\nas proof of the matters therein stated without proof of the signature of the Chief\nAgricultural Officer.\n\nWhere  a  person,  brought  before  the  magistrate,  pleads  guilty  to  or  is\n(5)\nconvicted  of  an  offence  under  this  Act  in  respect  of  which  the  agricultural\nproducts  were  seized  and  sold  or  otherwise  disposed  of  in  accordance  with\nsubsections (1) and (2), the magistrate may\n\n(a)\n\n(b)\n\nin the case of a sale, order that compensation be paid from the proceeds\nof the sale to the person who appears to the magistrate to be the owner\nof the agricultural products; or\n\nin a case where the agricultural products were disposed of otherwise\nthan by sale, order the accused to pay the informant or complainant\nsuch  compensation  not  exceeding  the  net  market  value  of  the\nagricultural products.\n\nAn order for payment of compensation made under subsection 5(b) shall\n\n(6)\nnot be for an amount in excess of $10 000.\n\nAn award of compensation referred to in subsection (6) shall not be a bar\n(7)\nto  any  civil  proceedings  for  damages  where  the  net  market  value  of  the\n\n\f15\n\nagricultural product is in excess of $10 000, but any compensation awarded shall\nbe taken into account for the purpose of awarding damages.\n\nWhere agricultural products are sold in accordance with subsection (1) and\n(8)\nthe owner cannot be ascertained, the proceeds of the sale shall be paid into the\nConsolidated Fund.\n\nAmendment of Schedule\n\n12.\n\nThe Minister may amend the Schedule by order.\n\nRegulations\n\n13.\neffect to this Act.\n\nThe Minister may make regulations generally for the purpose of giving\n\nRepeal\n\n14.\n\nThe\n\n(a)\n\n(b)\n\nPraedial Larceny Prevention Act, Cap. 142A; and\n\nProtection  of  Agricultural  Products  and  Livestock  Act,  2017\n(Act 2017-27)\n\nare repealed.\n\nCommencement\n\n15.\nproclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f16\n\nSCHEDULE\n\nCOMMERCIAL QUANTITIES\n\nPART I\n\nCOMMERCIAL VALUE\n\n(Sections 2 and 12)\n\nItem\nCommercial quantity of agricultural products\n\nValue\nIn excess of $200\n\nPART II\n\nCOMMERCIAL QUANTITY\n\nItem\n\nRoots, tubers, bulbs\n\nFresh poultry, livestock, fish\nproducts\n\nVegetables, fruits\n\nHoney, sugar cane\n\nCulinary herbs\n\nFresh milk\n\nEggs\n\nLive livestock\n\nLive poultry\n\nQuantity\n\nIn the amount of or in excess of\n\n25 Kg\n\n20 Kg\n\n15 Kg\n\n5 Kg\n\n2 Kg\n\n20 L\n\n180 eggs\n\n1 animal\n\n10 birds\n\n\f17\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2022.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2022.\n\nPresident\n\n"
}