{
  "bill_id": 648,
  "slug": "barbados-optional-savings-bonds-plus-offer-to-public-bill-2022",
  "title": "Barbados Optional Savings Bonds Plus (Offer to Public) Bill, 2022",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/8ca0ea863678b23d8ad3c0aab0ce9c79.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-08-15",
  "first_reading": "2022-08-30",
  "gazette_date": "2022-08-11",
  "markdown": "2022/08/08\n\nOBJECTS AND REASONS\n\nThis  Bill  would  provide  for  the  public  to  invest  in  the  Barbados  Optional\n\nSavings Scheme Plus.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nEstablishment of Scheme\n\nPurpose of Scheme, issuance of bonds and rate of interest\n\nPayment of interest\n\nMonetary value of bonds\n\nBonds to be tradeable and negotiable\n\nBank to be fiscal agent for the Government\n\nBonds to be redeemable\n\n10.\n\nAmendment of Schedule\n\n11.\n\nCommencement\n\nSCHEDULE\n\nTerms and conditions for the issue of the bonds\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the public to invest in the Barbados Optional Savings\n\nScheme Plus.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Offer to the Public) Act, 2022.\n\nThis Act may be cited as the Barbados Optional Savings Bonds Plus\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Bank” means the Central Bank of Barbados;\n\n“bonds” means the Barbados Optional Savings Bonds Plus issued under this Act;\n\nand\n\n“Scheme” refers to the Scheme established by section 3.\n\nEstablishment of Scheme\n\n3.\n\nThe Barbados Optional Savings Scheme Plus is hereby established.\n\nPurpose of Scheme, issuance of bonds and rate of interest\n\n4.(1)\nThe purpose of the Scheme is to provide a vehicle through which the\ngeneral public may invest in the bonds issued under this Act in order to facilitate\nthe funding of environmental, economic and social development in Barbados.\n\nThe  bonds  referred  to  in  subsection  (1)  shall  be  issued  upon  terms  and\n\n(2)\nconditions set out in the Schedule.\n\n(3)\n\nThe bonds shall mature 5 years after the date of issue of each bond.\n\nPayment of interest\n\n5.\n\nInterest accrued on the bonds is payable semi-annually.\n\nMonetary value of bonds\n\n6.\nbe in such amount as may be determined by Order made by the Minister.\n\nThe monetary value of bonds to be issued for each financial year shall\n\n\f5\n\nBonds to be tradeable and negotiable\n\n7.(1)\nsubject to the terms and conditions set out in the Schedule.\n\nA bond shall be a tradeable and negotiable instrument and shall be\n\nAfter the month of issuance market conditions shall apply to the trading of\n\n(2)\nthe bonds.\n\nNothing in the Income Tax Act, Cap. 73, the Stamp Duty Act, Cap. 91 or\n(3)\nany enactment relating to the imposition of a tax or any impost on bonds, shall\napply to bonds issued under this Act.\n\nBank to be fiscal agent for the Government\n\n8.\nfunctions necessary in relation to dealing with bonds.\n\nThe Bank shall be the fiscal agent of the bonds and shall perform all\n\nBonds to be redeemable\n\n9.\nthe date of first issue.\n\nA bond may be redeemed at par by the bondholder 24 months after\n\nAmendment of Schedule\n\n10.\n\nThe Minister may by Order amend the Schedule.\n\nCommencement\n\n11.\n\nThis Act shall into operation on the 1st day of September, 2022.\n\n\f6\n\nSCHEDULE\n\nTerms and conditions for the issue of the bonds\n\n(Sections 4(2) and 7(1))\n\nThe terms of the bond are as follows:\n\n1. A 5-year bond with a 4.5 per cent interest rate per annum.\n\n2.\n\nInterest accrued shall be payable semi-annually and the principal paid 5 years from date of\nissuance of bond.\n\n3. No withholding tax on the interest earned.\n\n4\n\nStamp duty shall not be payable.\n\n5. Bonds are fully tradeable in the Secondary Bond Market.\n\n6. Bonds can be purchased on monthly tranches.\n\n7.\n\nProtected bonds - As with the domestic debt restructuring of 2018 in which savings bonds\nissued pursuant to the Debt Holder (Approval of Debt Restructuring) Act, 2018 (Act 2018-\n24) were not restructured, these bonds are protected from restructuring.\n\n8. Bonds will have an early redemption feature (after 24 months of date of issue) which will\n\nallow individuals to redeem their bonds early.\n\n"
}