{
  "bill_id": 64,
  "slug": "value-added-tax-amendment-bill-2015",
  "title": "Value Added Tax (Amendment) Bill, 2015",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/dfbc8b72632cb39ccc25448da6fb6463.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-01-14",
  "first_reading": "2015-01-16",
  "second_reading": "2015-01-13",
  "gazette_date": null,
  "passed_date": "2015-01-16",
  "markdown": "2015-01-09\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Value Added Tax Act, Cap. 87 in order to ensure\nthat the value added tax to be imposed on imported goods will still be imposed\nin circumstances where\n\n(a)\n\n(b)\n\nreduced or no import duty is payable under Customs Act, Cap. 66; and\n\nthere is a reduction in or no duty or other imposition payable under any\nother enactment\n\nunless there is also a waiver or reduction of the value added tax under the Value\nAdded Tax Act, Cap. 87.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\nShort title\n\nAmendment of Section 31 of Cap. 87\n\nAmendment of Section 32 of Cap. 87\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Value Added Tax Act, Cap. 87 in order to ensure that\nthe value added tax to be imposed on imported goods will still be imposed in\ncircumstances where\n\n(a)\n\n(b)\n\nreduced or no import duty is payable under Customs Act, Cap. 66; and\n\nthere is a reduction in or no duty or other imposition payable under any\nother enactment\n\n\f4\n\nunless there is also a waiver or reduction of the value added tax under the Value\nAdded Tax Act, Cap. 87.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Value Added Tax (Amendment) Act, 2015.\n\nAmendment of Section 31 of Cap. 87\n\nSection 31 of the Value Added Tax Act, Cap. 87, in this Act referred\n2.\nto as the principal Act, is amended by deleting subsection (2) and substituting\nthe following:\n\n“(2)\n\nWhere\n\n(a)\n\n(b)\n\nan amount of duty (other than tax imposed under this Act)\nthat  is  payable  upon  the  entry  of  goods  into  Barbados  is\nremitted, refunded, drawn back or reduced under the Customs\nAct, Cap. 66 or any regulations or order made thereunder, and\n\na remission, refund, drawback or reduction of the tax payable\nin respect of the importation is not otherwise provided for in\nthis Act, the Customs Act, Cap. 66 or the regulations or order\nreferred to in paragraph (a)\n\nthe provisions of the Customs Act, Cap. 66, regulations or order under\nwhich  the  remission,  refund,  drawback  or  reduction  of  the  duty  is\ngranted  shall  not  be  deemed  to  provide  for  a  remission,  refund,\ndrawback  or  reduction,  as  the  case  may  be,  of  the  amount  of  tax\ncalculated on that duty. ”.\n\n\f5\n\nAmendment of Section 32 of Cap. 87\n\n3.\ndeleting paragraph (b) and substituting the following:\n\nSection  32  of  the  principal  Act  is  amended  in  subsection  (1)  by\n\n“(b)\n\nthe tax, if any, that was payable in respect of the goods at that\nprevious  time  has  not  been  remitted,  refunded  or  reduced\nbecause of the exportation of the goods; and ”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2015.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2015.\n\nPresident\n\n"
}