{
  "bill_id": 652,
  "slug": "resolution-re-debt-conversion-counterguarantee-act-2022122",
  "title": "Resolution re Debt Conversion (Counter-Guarantee) Act 2022-12.2",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/485de232c65f47c649f06f032f83d2f8.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-09-14",
  "first_reading": "2022-09-16",
  "gazette_date": null,
  "markdown": "RESOLUTION  NO.\n\n2022-09-09\n\n      PARLIAMENT\n\nWHEREAS by virtue of section 4 of  Debt Conversion (Counter-Guarantee) Act,\n\n2022-12,  the  Government  may  with  the  approval  of  Parliament,  enter  into  counter-guarantee\n\nagreements to allow the Government to buy back Eurobonds due 2029 and prepay Series E debt.\n\nAND WHEREAS the Government may by resolution of both Houses of Parliament, enter\n\ninto counter-guarantee agreements in respect of guaranteed payments of  principal and interest due in\n\nrespect  of  loans  to  be  used  to  buy  back  Eurobonds  due  2029  and  prepay  Series  E  debt,  on\n\nsuch terms and conditions as it thinks ﬁ t, but such guaranteed amounts shall not exceed the sum of\n\nBBD 300 million dollars, exclusive of the interest payable thereon;\n\nAND WHEREAS the Government is seeking a guarantee of approximately BBD 200 million\n\nfrom the Inter-American Development Bank and to enter into a corresponding counter-guarantee on the\n\nterms and conditions of an Agreement, the main provisions of which are set out in the First Schedule\n\nto this Resolution;\n\nAND  WHEREAS  the  Government  is  seeking  a  guarantee  of  up  to  approximately\n\nBBD 100 million from The Nature Conservancy and to enter into corresponding counter-guarantee\n\non the terms and conditions of an Agreement,  the main provisions of which are set out in the\n\nSecond Schedule to this Resolution;\n\n\f2\n\nAND WHEREAS the Government commits to use low cost guaranteed funding to buyback\n\nor  prepay  more  expensive  existing  debt  and  pay  the  net  savings  over  15  years  to  a  local  trust\n\nwhich will manage conservation work on the terms and conditions of the Conservation Funding\n\nAgreement, the main provisions of which are set out in the Third Schedule of this Resolution;\n\nAND  WHEREAS  the  Government  commits  that  the  local  trust  will  use  the  proceeds\n\nunder the Conservation Fund Agreement to pursue environmental milestones as outlined in the\n\nConservation and Sustainability Commitments Agreement, the main provisions of which are set out\n\nin the Fourth Schedule of this Resolution;\n\nBE IT RESOLVED that Parliament approve the counter-guarantee agreements with the\n\nInter-American Development Bank and The Nature Conservancy of up to approximately BBD 300\n\nmillion, to enable  the Government to buyback or prepay more expensive existing debt on the terms\n\nand conditions of the Agreements, the main provisions of which are set out in the First Schedule\n\nand Second Schedule respectively;\n\nAND BE IT RESOLVED that Parliament approve the Conservation Funding Agreement\n\nfor the purpose of paying the net savings over 15 years to a local trust which will manage conservation\n\nwork, the main provisions of which are set out in the Third Schedule;\n\nAND BE IT RESOLVED that Parliament approve the environmental and conservation\n\ncommitments under the Conservation and Sustainability Commitments Agreement, the main\n\nprovisions of which are set out in the Fourth Schedule;\n\n\f3\n\nAPPROVED by the House of Assembly this                 day of                                                ,\n\n, Two Thousand and Twenty-two.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                                                                             ,\n\n, Two Thousand and Twenty-two.\n\nPresident\n\n\f4\n\nFIRST SCHEDULE\n\nTERMS AND CONDITIONS\n\nFacility:\n\nCounter-guarantee\n\nCounter-Guarantor:\n\nInter-American Development Bank (IADB)\n\nBorrower:\n\nGovernment of Barbados\n\nCounter-Guarantee Amount:\n\nup to BBD 200 000 000.\n\nPurpose:\n\nTerms:\n\nDrawn amounts:\n\nTo buyback or prepay more expensive existing debt and pay the net\nsavings over 15 years to a local trust which will manage conservation\nwork\n\n20 years with a Weight Average Life of up to 12.75 years\n\nAny  amounts  drawn  under  the  Guarantee  will  not  be  reinstated.\nAny reimbursement made will not be available for new Guaranteed\nPayments.\n\nConditions Precedent:\n\n(a)\n\nthe contract has entered the force;\n\n(b)\n\nlegal opinion;\n\n(c)\n\n(d)\n\nsatisfaction  of  the  bank  of  the  structuring  of  the  guaranteed\ninstrument;\n\ndesignation of oﬃ  cials with authentic copies of the signatures\nof said representatives;\n\n(e)\n\ncomplied Policy conditions;\n\n\f5\n\nFirst Schedule - (Cont'd)\n\nConditions Precedent\n(Concl'd):\n\n(f)\n\nThe Counter-Guarantor\n\n  (i)\n\n  (ii)\n\nshall be in compliance with all the obligations provided\nunder this Contract; and\n\nshall not be in default for a period longer than thirty\n(30) days of any payment obligation set forth in this\nContract or under any other contract entered into with\nthe Bank.\n\nThe  Guarantee  fee  shall  be  paid  semi-annually,  calculated  using  the\nvariable lending ending spread applicable to sovereign guaranteed loans\ngranted by the Bank and ﬁ nanced with resources from the Bank’s ordinary\ncapital.  First payment due on the expiration date of the 6-month period\nfollowing the date of entry into force of the Guarantee Contract.\n\nThe Standby fee shall not exceed 0.75% per annum and will begin to\naccrue from the date of signature until the date in which the Guaranteed\nAmount is one hundred percent (100%) callable.\n\nThe payments under the guarantee to be made upon receipt of a payment\ndemand.  IADB will not be required to make any investigation as to\nwhether the information contained in it is correct.\n\nTo  be  reimbursed  within  a  period  of  not  more  than  180  days. An\namortization schedule may be agreed to through written agreement with\nthe counter guarantor established under the Bank’s guarantee policy,\nthe Flexible Financing Facility and Chapter III and V of the General\nConditions.\n\nGuarantee fee:\n\nStandby fee:\n\nPayments under\nthe Guarantee:\n\nReimbursement:\n\n\fFirst Schedule - (Concl'd)\n\nInterest rate:\n\nEarly Disbursement\nEvent:\n\n6\n\nSemi-annually due on the 15th day of the month. SOFR-Based Interest\nRate plus the applicable lending spread for the Bank’s ordinary capital\nloans.\n\n(a)\n\n(b)\n\nThe  Bank  may  make  an  early  disbursement  of  the\nGuarantee  through  a  deposit  in  an  escrow  account\nnominated  by  and  for  the  beneﬁ t  of  the  Guaranteed\nCreditors, if any default events.\n\nIn the event that the Bank makes an Escrow Payment\nequivalent  to  the  Maximum  Guaranteed Amount,\nthe  Bank's  Guarantee  will  be  canceled  once  the\nGuaranteed  Creditors  have  been  notiﬁ ed.  Upon  the\noccurrence  of  an  Early  Disbursement  Event  of  the\nGuarantee, it is the right of the Bank to declare that\nthe  Outstanding  Balance  or  a  portion  thereof  is\nimmediately due and payable.\n\n\f7\n\nSECOND SCHEDULE\n\nTERMS AND CONDITIONS\n\nFacility:\n\nCounter-guarantee\n\nCounter-Guarantor:\n\nThe Nature Conservancy (TNC)\n\nBorrower:\n\nGovernment of Barbados\n\nCounter Guarantee Amount:\n\nup to BBD 100 000 000.\n\nPurpose:\n\nTo buyback or prepay more expensive existing debt and pay the net\nsavings over 15 years to a local trust which will manage conservation\nwork\n\nTerms:\n\n20 years from date of entry into force\n\nAmounts drawn:\n\nAny amounts drawn under the Guarantee will not be reinstated.\n\nConditions Precedent:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nduly exectuted agreements;\n\nlegal opinions;\n\neach of the representations and warranties made be true\nand correct in all material respects;\n\nsatisfaction of the bank of the structuring of the blue loan\nagreement;\n\ndesignation of oﬃ  cials with authentic copies of the\nsignatures of said representatives;\n\n\f8\n\nSecond Schedule - (Cont'd)\n\nConditions Precedent\n(Concl'd):\n\n(f)\n\nThe Counter-Guarantor\n\n(i)\n\n(ii)\n\nshall  be  in  compliance  with  all  the\nthe obligations provided under this Contract\nand  each  other Transaction  Document;  and\n\nshall not be in default for a period longer than\nthirty  (30)  days  of  any  payment  obligation\nunder any other contract entered into with TNC\nor IADB.\n\n0.90%  per  annum  on  maximum  guaranteed  amount  payable\nsemi-annually beginning 6 months following date of entry into force\non the 20th of the month\n\nBBD 180,000 for 1-5 years\nBBD 140,000 until maturity\n(aggregate payments shall not exceed BBD 2.30M)\n\nWithin 180 days from guaranteed payment made by TNC.  TNC, in\nits sole discretion, and through written agreement with the Counter-\nGuarantor, may agree to a payment schedule that is diﬀ erent than the\none speciﬁ ed.\n\nGuarantee fee:\n\nConservation Advisory\nPayment:\n\nReimbursement:\n\nInterest rate:\n\nHighest coupon on the blue loan agreement\n\nDefault Interest rate:\n\nInterest rate plus 1%\n\n\fSecond Schedule - (Concl'd)\n\n9\n\nPrepayment:\n\n(a)\n\n(b)\n\nTNC  may  make  an  early  disbursement  through  a\ndeposit in an escrow account nominated by and for the\nbeneﬁ t of the Guaranteed Creditors, if any default of\nthe events.\n\nIn  the  event  that  TNC  makes  an  Escrow  Payment\nequivalent to the Maximum Guaranteed Amount, the\nGuarantee will be canceled once the Guaranteed Creditors\nhave been notiﬁ ed. Upon the occurrence of an Early\nDisbursement Event of the Guarantee, the right of the\nTNC  to  declare  that  the  Outstanding  Balance  or  a\nportion thereof is immediately due and payable will\nbe exercisable by TNC.\n\n\f10\n\nTHIRD SCHEDULE\n\nTERMS AND CONDITIONS\n\nThe main ﬁ nancial terms and conditions of the Conservation Funding Agreement are as follows:\n\nPayment Schedule:\n\nNet savings achieved through guaranteed funding and debt conversion\nto be paid over 15 years in semiannual installments at 0% interest\n\nLate Payment Charge:\n\nRate per annum equal to the sum of (a) the highest annual [coupon] on\nthe blue loan agreement plus (b) one percent (1%).\n\nExpenses:\n\n50% of all cost and expense\n\nNatural Disaster Clause:\n\nPari Passu Clause:\n\nTermination Events:\n\nPayments under the Fund:\n\nYes\n\nYes\n\n Yes\n\nFollowing receipt of any payment made pursuant to the Conservation\nFunding Agreement on each Payment Date, BESF shall apply all such\namounts in the following order of priority:\n\n(a)\n\n  (b)\n\nﬁ rst,  BESF  shall  set  aside  an  amount  necessary  to\nfund ﬁ fty percent (50%) of the general, administrative\nand operation expenses of BESF for that year, subject\nto the annual limit set.\n\nsecond, for each Payment Date that occurs in the ﬁ rst\nseven  (7)  years  from  the  Eﬀ ective  Date,  BESF  shall\nretain an amount that is 50% of the amount to be applied\nby BESF towards grants for Barbados in the context\nof the development of the MSP; and\n\n\fThird Schedule - (Concl'd)\n\n11\n\nPayments  under  the  Fund\n(Concl'd):\n\n(c)\n\nthird, after setting aside the amounts  set forth in clauses\n(a) and (b) above received by BESF as of such Payment\nDate, commit any remaining amounts of such payment\nas grants to third parties in accordance with the requirement\nunder  Exhibit A  (Conservation  Fund  Terms)  of  the\nAgreement.\n\n\f12\n\nFOURTH SCHEDULE\n\nTERMS AND CONDITIONS\n\nThe following milestones are agreed under the Conservation and Sustainability Commitments\n\nAgreement, which include the value of having a Marine Spatial  Plan (MSP) i.e.  what Barbados is\n\nwilling to commit to achieving over the next 5 to 7 years; the supporting frameworks/tools/systems\n\nfor MSP preparation and long term sustainability.\n\nMilestone 1: Initiation of the MSP\n\nNo  later  than  three  (3)  months  after  the  signing  of  the  Counter  Guarantee Agreements\n\n(“CGA” or the “Agreement”), Barbados shall initiate the process of developing a MSP for  its Ocean by\n\nthe\n\n(a)\n\ndesignation  of  a  Government  of  Barbados  ministry  or  agency  to  lead  and\n\nmanage MSP process;  and\n\n(b)\n\nestablish a MSP project-steering committee (“MSP Steering Committee”)\n\ncomprised of both\n\n(A)\n\nsenior  level  oﬃ  cers  or  employees  from  governmental  agencies;  and\n\n(B)   qualiﬁ ed representatives from non-governmental organizations.\n\n\fFourth Schedule - (Cont'd)\n\n13\n\nMilestone 2: Completion of First Draft of Zoning Design\n\nNo later than thirty-six (36) months after the date of signing of the Conservation and Sustainability\n\nCommitments Agreement, the government shall complete a ﬁ rst draft of the marine zoning design\n\nfor  the  complete  area  of  aﬀ ected  Ocean  showing  at  least  three  (3)  spatial  scenarios  that  could\n\nachieve up to an aspirational goal of 30% biodiversity protection, including at least one option\n\nevaluating  the  potential  for  15%  in  High  Protection  Biodiversity  Zones  and  15%  in  Medium\n\nProtection Biodiversity Zones that would allow for long-term, sustainable, eﬀ ective management\n\nof  Barbados’  Ocean  resources.   The  draft  zoning  design  will  include  spatial  maps  in  suﬃ  cient\n\ndetail  to  allow  visual  assessment  of  each  proposed  area  of  protected  space  in  each  scenario,\n\nthe  rationale  for  each  Zone  area  including  estimates  of  km2,  percentage  of  Ocean,  biodiversity\n\nsigniﬁ cance, existing uses and activities, existing maritime zones, threats or pressures, and proposed\n\ncategorization as High or Medium Protection Biodiversity Zones. The zoning design spatial scenarios\n\nwill be evidence-based, using all relevant data and information, including participatory mapping\n\nand  other  sources  of  information  collected  for  appropriate  marine  spatial  models  and  planning\n\n tools. Evidence of stakeholder engagement and participation shall be included in the Milestone Report.\n\n\fFourth Schedule - (Cont'd)\n\n14\n\nMilestone 3: Government Approval of\n\n(a)\n\n Legislation and Regulations to Declare Marine Biodiversity Protection Zones/\n\nMPAs; and\n\n(b)   MSP Institutional Frameworks\n\nNo later than four (4) years and six (6) months after the date of signing of the Conservation\n\nand Sustainability Commitments Agreement, the Government shall:\n\n (a)   approve the legislation and regulations that allows for the legal declaration, Gazetting,\n\nand  management  of  feasible  marine  Biodiversity  Protection  Zones/MPAs\n\n(identiﬁ ed as part of the MSP process), including bestowing of authority to an appropriate\n\ngovernment agency / agencies for monitoring and enforcement;\n\n (b)   approve and eﬀ ect the institutional framework required for MSP implementation; and\n\n (c)\n\nlegally declare and Gazette 10% of Ocean under biodiversity protection, if deemed\n\nfeasible within the scientiﬁ c analysis provided by the MSP.\n\n\fFourth Schedule - (Cont'd)\n\n15\n\nMilestone 4: Completion of the MSP, Gazetting of Biodiversity Protection Zones/MPAs and\n\nMSP implementation\n\nNo later than ﬁ ve (5) years after signing the Agreement Barbados shall,\n\n(a)\n\nhave completed the MSP;\n\n(b)\n\nlegally declared and Gazetted as MPAs whichever is the lower of either\n\n(i)\n\nan  aspirational  goal  of  30%  of  Ocean,  with  at  least  15%  in  High\n\nProtection Biodiversity Zones and at least 15% in Medium Protection Biodiversity\n\nZones; or\n\n(ii)\n\nthe percentage of Ocean declared as MPAs, with percentages of High Protection\n\nBiodiversity Zones and Medium Protection Biodiversity Zones deemed achievable\n\nin the MSP; and\n\n(c)\n\nImplement the MSP.\n\nMilestone 5: Government Approval and Adoption of Management Plans\n\nNo later than seven (7) years and six (6) months after the date of signing of Conservation\n\n and Sustainability Commitments Agreement, Barbados shall have\n\n\fFourth Schedule - (Concl'd)\n\n16\n\n(a)\n\napproved  Management  Plans  for  each  Gazetted  Biodiversity  Protection\n\nZone MPA; and\n\n(b)\n\nthe agency(s) with authority over such plans shall have adopted a Management\n\nplans  support  of  Barbados  's  goals  for  longterm,  sustainable,  effective\n\nmanagement of their Ocean using, but not limited to, strategies for protected\n\narea management, aligned  with recognized standards.\n\n\f17\n\nADDENDUM\n\nThis Resolution seeks the approval of Parliament for the Government to enter the\n\ncounter-guarantee  agreements,  the  conservation  funding  agreement  and  the  conservation  and\n\nsustainability commitments agreement on the terms and conditions contained in agreements, the\n\nmain provisions of which are set out in the Schedules to this Resolution.\n\nThe said agreements are  pursued to  facilitate the ﬁ nancing  of marine conservation in\n\nBarbados.\n\n"
}