{
  "bill_id": 655,
  "slug": "resolution-re-vesting-of-state-land-and-treasury-building-in-btii-for-residential-development",
  "title": "Resolution re vesting of State Land and Treasury Building in BTII for residential development",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/6ba2193c8eaeca851340169e22643fb1.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-09-14",
  "first_reading": "2022-10-12",
  "gazette_date": null,
  "markdown": "2022-08-15\nPARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 approve the vesting in Barbados Tourism Investment Inc. of the parcel of land, the property of the State, with the building thereon, known as the Treasury Building, situate at Bridge Street in the parish of Saint Michael in this Island, more particularly described in the Schedule hereto for residential development.\nAPPROVED by the House of Assembly this\nday of\nTwo thousand and twenty-two.\nSPEAKER\nAPPROVED by the Senate this\nday of\n> TWO\nthousand and twenty-two.\nPRESIDENT\n,\nSCHEDULE\nALL THAT land the property of the State situate at Bridge Street in the parish of Saint Michael in this Island containing by admeasurement 2106.5 square metres (inclusive of 355.4 square metres in a road called Drax Street) abutting and bounding on other lands of the Barbados Government on the public road known as Trafalgar Street on the public road known as Bridge Street and on a public road known as Wharf Road or however else the same may abut and bound, together with the building thereon known as the Treasury Building as shown and delineated on a Plan certified on the 2\" day of May, 2019 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Surveys Department on the 27\" day of May, 2019 as Plan No. 656/2019.\nADDENDUM\nAt its meeting held on the 16 day of September, 2021 the Cabinet considered Note (2021)/MHLM 61 and agreed to the vesting of the property of the State comprising the former Treasury Building situate at Bridge Street in the parish of Saint Michael in this Island and containing by admeasurement 2106.5 square metres (inclusive of 355.4 square metres in a road called Drax Street) in Barbados Tourism Investment Inc. for residential development.\nThe said parcel of land more particularly described in the Schedule to this Resolution, made up of four parcels of land. Three of these parcels of land were acquired by the State (formerly the Crown) by\nis\n(a)\nDeed of Conveyance dated the 19\" day of December, 1913 between Donald MacClain Simpson and the Executive Committee of the Island of Barbados and recorded in the Land Registry on the 7\" day October, 1913 as deed No. 880;\n(b)\nDeed of Conveyance dated the 20\" day of May, 1940 between Central Foundry Limited and the Executive Committee of the Island of Barbados and recorded in the Land Registry on the 22\" day of May, 1940 as Deed No. 562; and\n(c)\nDeed of Conveyance dated the 21\" day of March, 1949 between Central Foundry Limited and the Executive Committee of the Island of Barbados and recorded in the Land Registry on the 26\" day of March, 1949 as Deed No. 708.\nThe fourth parcel of land is a parcel of land which has been in the continuous, undisturbed possession of the State for upwards of 110 years but with respect to which the State, despite diligent searches, is unable to locate its title document at this time.\nIn accordance with the provision of section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is now sought for the vesting in Barbados Tourism Investment Inc. of the property more particularly described in the Schedule for residential development.\n"
}