{
  "bill_id": 656,
  "slug": "catastrophe-fund-amendment-bill-2022-20221004",
  "title": "Catastrophe Fund (Amendment) Bill, 2022 (2022-10-04)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3e84db3ba4e74e337822e100ceb28155.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-10-05",
  "first_reading": "2022-10-12",
  "gazette_date": null,
  "markdown": "2022-10-04 at 10:39am\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Catastrophe Fund Act, 2020 (Act 2020-13).\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nRepeal and replacement of section 4 of Act 2020-13\n\nAmendment of section 7 of Act 2020-13\n\nAmendment of First Schedule to Act 2020-13\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Catastrophe Fund Act, 2020 (Act 2020-13)\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2022.\n\nThis  Act  may  be  cited  as  the  Catastrophe  Fund  (Amendment)  Act,\n\n\f4\n\nRepeal and replacement of section 4 of Act 2020-13\n\n2.\nAct referred to as the principal Act, is deleted and the following substituted:\n\nSection 4 of the Catastrophe Fund Act, 2020 (Act 2020-13), in this\n\n“Purpose of Fund\n\n4.\n\nThe purpose of the Fund is to\n\n(a)\n\nprovide  financial  aid  to  eligible  persons  and  qualifying\nbusinesses in need of such aid; and\n\n(b)\n\nfacilitate measures by the State,\n\nto mitigate or remedy the adverse effects of a catastrophe.”.\n\nAmendment of section 7 of Act 2020-13\n\n3.\n\nSection 7 of the principal Act is amended\n\n(a)\n\nby deleting subsection (3) and substituting the following:\n\n“(3)\n\nThe following payments may be made from the Fund:\n\n(a)\n\npayments for the purposes of section 4 including the payment\nof financial aid pursuant to section 5;\n\n(b)\n\nrefunds of any payment paid in excess or in error; and\n\n(c)\n\nexpenses  incurred  in  respect  of  the  administration  of  this\nAct.”; and\n\n(b)\n\nin  subsection  (4),  by  deleting  the  words  “section  3(2)(b)”  and\nsubstituting the words “section 3(b)”.\n\n\f5\n\nAmendment of First Schedule to Act 2020-13\n\n4.\n\nThe First Schedule to the principal Act is amended\n\n(a)\n\nin  paragraph  1,  by  deleting  subparagraphs  (5)  and  (6)  and\nsubstituting the following:\n\n“(5)\n\nWhere with the approval of the Physical Catastrophes Committee\n\n(a)\n\n(b)\n\na house is provided by an agency to a person who is entitled\nto a grant under this paragraph; or\n\nrepairs  are  effected  by  an  agency  to  a  house  owned  by  a\nperson who is entitled to a grant under this paragraph,\n\nthe  Committee  shall,  instead  of  paying  the  grant  to  the  person  so\nentitled, pay the amount of the grant to the agency.\n\n(6)\n\nFor the purposes of this paragraph “agency” means\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe Urban Development Commission established under the\nUrban Development Commission Act, Cap. 241;\n\nthe  Rural  Development  Commission  established  under  the\nRural Development Commission Act, Cap. 238;\n\nthe  National  Housing  Corporation  established  under  the\nHousing Act, Cap. 226; or\n\nany ministry, department or other authority of Government\ncharged  with  providing  social  services,  including  another\nstatutory board.”; and\n\n(b)\n\nby inserting after paragraph 1, the following:\n\n\f6\n\n“Remedying and mitigating disruption or loss by catastrophe\n\n1A.(1)\nNotwithstanding  paragraph  1,  the  Physical  Catastrophes\nCommittee may take such other measures in relation to a house referred\nto that paragraph as would enable the owner to mitigate or remedy the\nadverse effects of a catastrophe.\n\n(2)\n\nA business, whether incorporated or not, which\n\n(a)\n\n(b)\n\nhas an annual turnover in business not exceeding $500 000;\nand\n\nis compliant with its obligations under the Income Tax Act,\nCap.  73,  the  Value  Added  Tax  Act,  Cap.  87,  the  National\nInsurance and Social Security Act, Cap. 47, and any other\nenactment relating to the payment of any other tax or impost,\n\nis  entitled  to  claim  financial  aid  in  such  amount  or  relief  from\nobligations  for  such  period  as  is  determined  by  the  Economic\nCatastrophes Committee in order to enable the business to mitigate or\nremedy the adverse effects of a catastrophe.”.\n\n"
}