{
  "bill_id": 657,
  "slug": "resolution-that-parliament-take-note-of-and-approve-the-bert-plan-2022",
  "title": "Resolution that Parliament take note of and approve the BERT Plan 2022",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/879d615a221db20b21c25f54a3d5972b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-10-12",
  "first_reading": "2022-11-02",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\nPARLIAMENT\n\nWHEREAS the Government of Barbados has determined that there should\n\nbe a Barbados Economic Recovery and Transformation (BERT) Plan 2022:\n\nFY2022/23 – FY2026/27 (BERT 2022).\n\nAND  WHEREAS  BERT  (2022)  is  the  successor  to  Barbados  Economic\n\nRecovery  and  Transformation  2018  (BERT  2018)  and  lays  out  the\n\nGovernment of Barbados’ economic and financial program for the next four\n\nyears, which is focused on achieving inclusive and sustainable growth, while\n\nmaintaining fiscal and debt sustainability.\n\nAND WHEREAS the general strategy of the BERT Plan 2022 is to preserve\n\nthe gains achieved under BERT (2018), and advance the reforms which were\n\ndelayed because of the COVID-19 global pandemic. This will be done with\n\nrefocused priorities on polices aimed at generating sustainable and inclusive\n\ngrowth while building resilience through climate adaptation and mitigation.\n\n1\n\n\fAND  WHEREAS  the  Government  of  Barbados  will  advance  a  growth\n\nstrategy  within  the  context  of  limited  fiscal  space  and  maintaining  fiscal\n\nstability that includes structural reforms to promote economic diversification,\n\nstrengthen  competitiveness  and  achieve  a  higher  sustainable  rate  of\n\neconomic  growth  that  is  private  sector  led  and  that  will  result  in  the\n\nenhancement of the economic well-being of every citizen.\n\nAND WHEREAS the growth strategy having as its eight pillars:\n\nPillar  1:  Incentivising  the  green  transition  and  building  climate  resilient\n\ninfrastructure;\n\nPillar 2: Incentivising low and middle income housing;\n\nPillar 3: Investing in skills training and education;\n\nPillar 4: Preserving financial stability and mobilising domestic savings for\n\nlocal investment;\n\nPillar 5: Making Government an enabler to improving productivity, boosting\n\ncompetitiveness and exports, and enhancing service excellence;\n\nPillar 6: Establishing Barbados as a logistics hub;\n\n2\n\n\fPillar  7:  Promoting  diversification  through  new  niche  economic  activities\n\ncentred around a new, high-skilled, knowledge-based economy that is more\n\ntechnologically advanced and carbon neutral and marine-conscious; and\n\nPillar  8:  Adopting  Open  Labour  Market  Policies  to  Support  Stronger,\n\nResilient  Growth  Together  With  Expanding  The  Population  Base  and\n\nImproving Productivity And Competitiveness.\n\nBE IT RESOLVED that Parliament take note of and approve the Barbados\n\nEconomic Recovery and Transformation (BERT) Plan 2022:  FY2022/23 –\n\nFY2026/27.\n\nApproved by the House of Assembly this          day of\n\n          2022.\n\nSPEAKER\n\nApproved by the Senate this            day of                               2022.\n\nPRESIDENT\n\n3\n\n"
}