{
  "bill_id": 65,
  "slug": "supplementary-estimates-no2-20142015",
  "title": "Supplementary Estimates No.2 2014-2015",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/d88e032c69e030dfea884d52a9e966ba.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2015-01-13",
  "first_reading": "2015-01-13",
  "second_reading": "2015-01-13",
  "gazette_date": null,
  "passed_date": "2015-01-13",
  "markdown": "HOUSE OF ASSEMBLY\nResolved that the sum of ONE MILLION THREE HUNDRED AND SIX THOUSAND, AND FIFTY DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2014-2015 as shown in the Supplementary Estimates No.2 2014-2015 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2014 — 2015 No.2\nHEAD Code Provision in Provision in Supplementary Number Approved Supplementary Provision Estimates Estimates Required 2014 - 2015 No. 1-2 Other Other Other Expenditure Expenditure Expenditure HEAD: 19 TREASURY Program: 109 Asset Management Subprogram: 0338 Air Traffic Management 191090338 Services Account Code: 751 Property and Plant 3,869,800 4,289,110 HEAD: 27 MINISTRY OF TOURISM AND INTERNATIONAL TRANSPORT Program: 335 Air Transport Infrastructure Subprogram: 0338 Air Traffic Management 273350338 Services Account Code: 102 Other Personal Emoluments 1,379,530 16,940\nADDENDUM\nSupplementary provision in the amount of $$1,306,050 is required under:\na. Head 19:\nHead 19: Treasury Program 109: Assets Management Sub-program 0338: Air Traffic Management Services Account Code 751: Property and Plant\n$1,289,110.00\nPayment to be made by Grantley Adams International Airport Inc. (GAIA Inc.) for construction and associated consultancy services in respect of the new Civil Aviation Department building.\nb.\nHead27: ' Ministry of Tourism and International Transport Program 335: Air Transport Infrastructure Subprogram 0338: Air Traffic Management Services Account Code 102: Other Personal Emoluments\n$16,940.00\nPayment of shortfall in vacation pay due to the retired Director of Civil Aviation and the requisite funds associated with the sequential acting and other allowances payable to the current Director of Civil Aviation and approximately five other officers who will be impacted.\n"
}