{
  "bill_id": 660,
  "slug": "firearms-amendment-bill-2022",
  "title": "Firearms (Amendment) Bill, 2022",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/8e27513e0a63156ccebd06ad348c4405.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-10-31",
  "first_reading": "2022-11-02",
  "gazette_date": "2022-11-07",
  "markdown": "2022-10-28\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Firearms Act, Cap. 179 to\n\n(a)\n\n(b)\n\n(c)\n\nrevise the offences relating to the use of firearms;\n\nrevise the penalties for offences under that Act;\n\nprovide for licences for firearms for the purposes of hunting and sport\nshooting; and\n\n(d)\n\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 179\n\nInsertion of section 13A into Cap. 179\n\nAmendment of section 15 of Cap. 179\n\nAmendment of Cap. 179\n\nAmendment of section 16 of Cap. 179\n\nRepeal and replacement of section 29 of Cap. 179\n\nRepeal and replacement of section 30 of Cap. 179\n\nInsertion of sections 30A and 30B into Cap. 179\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nAmendment of section 32 of Cap. 179\n\n11.\n\nCommencement\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Firearms Act, Cap. 179.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Firearms (Amendment) Act, 2022.\n\n\f4\n\nAmendment of section 2 of Cap. 179\n\n2.\nthe principal Act, is amended\n\nSection 2 of the Firearms Act, Cap. 179, in this Act referred to as\n\n(a)\n\nby deleting the definition of “imitation firearm” and substituting the\nfollowing:\n\n“  “imitation  firearm”  means  anything  which  has  the  appearance  of\nbeing a firearm, but is not a firearm, whether or not it is capable\nof discharging any shot, bullet or other missile;”; and\n\n(b)\n\nby inserting the following definition in the appropriate alphabetical\norder:\n\n“ “hunting firearm licence” means a licence granted under section 13B;\n\n“sporting  firearm  licence”  means  a  licence  granted  under  section\n\n13A;”.\n\nInsertion of section 13A into Cap. 179\n\n3.\nafter section 13:\n\nThe principal Act is amended by inserting the following new section\n\n“Sporting firearm licence\n\n13A.(1)\nA person who is desirous of possessing or carrying a firearm\nfor sporting purposes shall apply to the Commissioner in the prescribed\nform for a sporting firearm licence.\n\n\f5\n\nSubject to this Act, the Commissioner shall not grant a sporting\n\n(2)\nfirearm licence unless\n\n(a)\n\n(b)\n\n(c)\n\nhe  is  satisfied  that  the  applicant  is  a  current  member  of  a\nshooting-club licensed under section 12;\n\nthe  applicant  demonstrates  that  the  licence  is  required  for\nsport or target shooting;\n\nthe applicant demonstrates that he intends to participate in\nsport or target shooting competitions; or\n\n(d)\n\nany combination of (a), (b) and (c) are applicable.\n\n(3)\n\nA person who holds a sporting firearm licence may engage in\n\n(a)\n\n(b)\n\nsport or target shooting on a shooting range maintained by a\nshooting-club;\n\nsport or target shooting competitions held by a shooting-club\nwhether alone or in conjunction with any other shooting-club.\n\nHunting firearm licence\n\n13B.(1)\nA person who is desirous of possessing or carrying a firearm\nfor hunting purposes shall apply to the Commissioner in the prescribed\nform for a hunting firearm licence.\n\nSubject to this Act, the Commissioner shall not grant a hunting\n\n(2)\nfirearm licence unless\n\n(a)\n\n(b)\n\nthe  applicant  demonstrates  that  the  licence  is  required  for\nhunting; and\n\nthe applicant demonstrates that he intends to participate in\nhunting.\n\nSubject to any other enactment regulating hunting, a person who\n\n(3)\nholds a hunting firearm licence may engage in hunting.”.\n\n\f6\n\nAmendment of section 15 of Cap. 179\n\n4.\n\nSection 15 of the principal Act is amended\n\n(a)\n\n(b)\n\n(c)\n\nby deleting the shoulder note and substituting the words “Revocation\nof licences and surrender of firearms and ammunition”;\n\nin subsection (2), by deleting the word “not” appearing in the last\nline; and\n\nin subsection (3), by inserting immediately after the word “licence”\nthe  firearm  and\nappearing\nammunition”.\n\nthe  words  “and\n\nline,\n\nlast\n\nthe\n\nAmendment of Cap. 179\n\n5.\nappearing immediately after section 14 and substituting the following:\n\nThe  principal  Act  is  amended  by  deleting  the  cross-heading\n\n“Revocation  of  Licences  and  Surrender  of  Firearms  and\nAmmunition”.\n\nAmendment of section 16 of Cap. 179\n\n6.\nSection 16 of the principal Act is amended by deleting the word “it”\nin  subsection  (5)  and  substituting  the  words  “the  licence,  firearm  and\nammunition”.\n\nRepeal and replacement of section 29 of Cap. 179\n\n7.\nsubstituted:\n\nSection  29  of  the  principal  Act  is  deleted  and  the  following  is\n\n\f7\n\n“Prosecution and punishment of offences\n\n29.(1)\nAny  person  who  uses  a  firearm  or  an  imitation  firearm,\nwhether  by  discharging  the  firearm  or  by  brandishing  or  otherwise\nusing the firearm or imitation firearm\n\n(a)\n\n(b)\n\nwhile  committing  or  attempting  to  commit  an  indictable\noffence; or\n\nduring  flight  after  committing  or  attempting  to  commit  an\nindictable offence,\n\nwhether or not he causes or intends to cause bodily harm to any person\nas a result thereof, is guilty of an offence.\n\nA  person  who  aids,  abets,  counsels  or  procures  another  or\n(2)\nconspires with another to commit an offence under this Act, is guilty\nof an offence and is liable to the same punishment as is provided for\nthat offence.”.\n\nRepeal and replacement of section 30 of Cap. 179\n\n8.\nsubstituted:\n\nSection  30  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Punishment for certain offences\n\n30.(1)\nor 29(1) shall on conviction on indictment\n\nA person who is guilty of an offence under section 3(9), 7(3),\n\n(a)\n\nin  the  case  of  a  first  offence,  except  as  provided  in\nparagraph (b)(ii), be sentenced to imprisonment for not less\nthan 10 years and not more than 20 years; or\n\n\f8\n\n(b)\n\nin the case of\n\n(i)\n\n(ii)\n\na  second  or  subsequent  offence  be  sentenced  to\nimprisonment for life or a lesser term, being not less than\n20 years; or\n\na first offence committed by a person who prior to the\ncommencement  of  this  section  was  convicted  of  an\nindictable offence in the course of which or during his\nflight after the commission of which he used a firearm\nbe sentenced to imprisonment for life or a lesser term,\nbeing not less than 20 years.\n\nThe court shall impose at least the lesser sentence specified in\n(2)\nsubsection  (1)(a),  with  or  without  a  fine  of  $100  000,  unless  the\nconditions specified in subsection (3) are satisfied.\n\n(3)\n\nThe conditions referred to in subsection (2) are as follows:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe person who committed the offence was under the age of\n18 years at the time of the commission of the offence;\n\nthe  person  who  committed  the  offence  has  not  been\npreviously  convicted  of  an  indictable  offence  of  a  violent\nnature;\n\npublic safety and public order will not be prejudiced; or\n\nthe  court  is  of  the  opinion  that  there  are  exceptional\ncircumstances relating to the offence or the person convicted\nof the offence which justify its not doing so.\n\nAny firearm, imitation firearm or ammunition in respect of which\n(4)\nan offence under this Act has been committed shall, with effect from\nthe date of the conviction of the accused person for that offence, be\nforfeited to the State.”.\n\n\f9\n\nInsertion of sections 30A and 30B into Cap. 179\n\n9.\nafter section 30:\n\nThe principal Act is amended by inserting the following new sections\n\n“Joinder of counts\n\n30A.(1)\nNotwithstanding section 24 of the Juries Act, Cap. 115B,\nsection 5 of the Indictments Act, Cap. 136, and any other law to the\ncontrary, a count for an offence under section 3(9), 7(3) or 29(1) of this\nAct may be joined in the same indictment as a count of murder if it is\nalleged that the accused used a firearm to commit the offence of murder.\n\n(2)\n\nFor the purposes of this Act,\n\n(a)\n\nthe array of 12 jurors shall preside at the trial and shall render\nverdicts in accordance with sections 38 and 39 of the Juries\nAct, Cap. 115B; and\n\n(b)\n\nthe period of 3 hours set out in sections 41(1) and 43 of the\nJuries Act shall be extended to 4 hours.\n\nSentencing\n\nNotwithstanding  any  law  to  the  contrary,  a  sentence  of\n30B.(1)\nimprisonment imposed on a person convicted of an indictable offence\nunder this Act shall be served consecutively to any other sentence of\nimprisonment imposed for an offence arising out of the same event or\nseries of events and to any other sentence to which he is subject at the\ntime the sentence is imposed on him for an offence under this Act.\n\n\f10\n\n(2)\nThe court may order that a sentence of imprisonment on a person\nconvicted of an indictable offence under this Act shall not be served in\nthe manner set out in subsection (1) where\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe person who committed the offence was under the age of\n18 years at the time of the commission of the offence;\n\nthe  person  who  committed  the  offence  has  not  been\npreviously  convicted  of  an  indictable  offence  of  a  violent\nnature;\n\npublic safety and public order will not be prejudiced; or\n\nthe  court  is  of  the  opinion  that  there  are  exceptional\ncircumstances relating to the offence or the person convicted\nof the offence which justify its not doing so.”.\n\nAmendment of section 32 of Cap. 179\n\n10.\ninserting the following paragraph after paragraph (d):\n\nSection  32  of  the  principal  Act  is  amended  in  subsection  (1)  by\n\n“(d.1)\n\nprescribing the conditions relating to sporting and hunting\nfirearm licences;”.\n\nCommencement\n\n11.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f11\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2022.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2022.\n\nPresident\n\n"
}