{
  "bill_id": 662,
  "slug": "resolution-re-kensington-new-road-beckles-land-new-orleans-st-michael",
  "title": "Resolution re Kensington New Road & Beckles Land, New Orleans, St. Michael",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/8e59db446681c76b1a6c662f66caac83.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-11-09",
  "first_reading": "2022-11-23",
  "gazette_date": null,
  "markdown": "2022-10-27\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the  Land\n\nAcquisition Act, Cap. 228 approve the compulsory acquisition by the State of the parcels of\n\nland situate at Kensington New Road and at Beckles Land, New Orleans in the parish of Saint\n\nMichael in this Island and more particularly described in the Schedules hereto for the public\n\npurpose of housing development.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo Thousand and Twenty-Two.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                            day  of                                                    ,\n\nTwo Thousand and Twenty-Two.\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL  THAT  land  the  property  of  Megan  Scott  situate  at  Beckles  Land,  New\n\nOrleans in the parish of Saint Michael in this Island containing by admeasurement 3486.6 square\n\nmetres or thereabouts abutting and bounding on lands now or formerly of Beckles Land Tenantry\n\n(Lots 1, 35 and 36) on an existing footpath on lands now or formerly of Beckles Land Tenantry\n\n(Lots 37, 38 and 39) on an existing footpath on lands now or formerly of Beckles Land Tenantry\n\n(Lots 40, 22 and 25) on lands now or late of Mohammed Patel (Lot 567) on lands now or late of\n\nAshaf Yufuf Piprawala (Lot 569) on lands now or late of Hasim Teladia (Lot 570) on lands now\n\nor formerly of Goddard Enterprises Ltd. on an unpaved road and on the public road called Wharton\n\nGap  or  however  else  the  same  may  abut  and  bound  as  shown  and  delineated  on  a  Plan\n\ncertiﬁ ed  on  the  8th  day  of  March,  2022  by  Kevin  R.  Belgrave,  Land  Surveyor  and  recorded\n\nin the Lands and Surveys Department on the 8th day of March, 2022 as Plan No. 352/2022.\n\n\f3\n\nSECOND SCHEDULE\n\nALL THAT land the property of Egerton Harding (Lot 562) situate at Kensington\n\nNew Road in the parish of Saint Michael in this Island containing by admeasurement 782.5 square\n\nmetres or thereabouts abutting and bounding on lands now or late of Christopher Lewis on lands\n\nnow or late of Dudley Beckles on lands now or late of Rose Sylvester on lands now or late of\n\nMatthew Rampersad et ux on other lands of Egerton Harding (Lot 558) on a concrete drain which\n\nseparates  the  said  land  from  the  public  road  called  Kensington  New  Road  which  leads  to\n\nBaxters Road in one direction to Lakes Folly in another direction and to Fontabelle in another\n\ndirection or however else the same may abut and bound as shown and delineated on a Plan certiﬁ ed\n\non the 4th day of March, 2022 by Kevin R. Belgrave, Land Surveyor and recorded in the Lands\n\nand Surveys Department on the 8th day of March, 2022 as Plan No. 348/2022.\n\n\f4\n\nTHIRD SCHEDULE\n\nALL  THAT  land  the  property  of  Egerton  Harding  (Lot  558)  situate  at\n\nKensington New Road in the parish of Saint Michael in this Island containing by admeasurement\n\n284.1 square metres or thereabouts abutting and bounding on other lands now or late of Egerton\n\nHarding (Lot 562) on lands now or late of Matthew Rampersad et ux on lands now or late of\n\nWilliam Crick on other lands now or late of Egerton Harding (Lot 557) on  a concrete drain which\n\nseparates the said land from the public road known as Kensington New Road which leads to\n\nBaxters Road in one direction to Lakes Folly in another direction and to Fontabelle in the other\n\ndirection  or  however  else  the  same  may  abut  and  bound  as  shown  and  delineated  on  a  Plan\n\ncertiﬁ ed  on  the  4th  day  of  March,  2022  by  Kevin  R.  Belgrave,  Land  Surveyor  and  recorded\n\nin  the  Lands  and  Surveys  Department  on  the  8th  day  of  March,  2022  as  Plan  No.  348/2022.\n\n\f5\n\nADDENDUM\n\n  On  the  24th  day  of  June,  2021,  the  Cabinet  agreed  inter  alia  to  the  acquisition  of\n\n782.5  square  metres  of  land  situate  at  Kensington  New  Road  and  3486.6  square  metres  of\n\nland situate at Beckles Land, New Orleans in the parish of Saint Michael in this Island, the\n\nproperty of Mr. Egerton Harding and Ms. Megan Scott, respectively, for housing development.\n\n  On the 11th day of August, 2022, the Cabinet agreed to the acquisition  of 284.1 square\n\nmetres of land situate at Lot 558 Kensington New Road in  the parish of Saint Michael in this Island,\n\nthe property of Mr. Egerton Harding for housing development.\n\n  In accordance with the provisions of section 5 of the Land Acquisition Act, Cap. 228,\n\nthe approval of Parliament is now sought for the compulsory acquisition of the parcels of land\n\ndescribed in Schedules hereto in order that the public purpose set out in the Resolution may be\n\neﬀ ected and that the State may acquire an indefeasible title to the said parcels of land.\n\n"
}