{
  "bill_id": 663,
  "slug": "resolution-rescind-lease-of-land-at-garfield-sobers-sports-complex-to-the-rotary-club-of-barbados",
  "title": "Resolution Rescind Lease of land at Garfield Sobers Sports Complex to the Rotary Club of Barbados",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/7217eb7fa6b4cf62218f2da0ee82dbf6.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-11-22",
  "first_reading": "2022-12-07",
  "gazette_date": null,
  "markdown": "2022-09-29\n\nPARLIAMENT\n\nWHEREAS a Resolution was passed by the Honourable House of Assembly\n\non the 23rd day of June, 2015 and by the Honourable Senate on the 8th day of July, 2015, was\n\nassented  to  by  Her  Excellency  the  Governor-General  on  the  28th  day  of  July,  2015  and  was\n\npublished  in  the  Oﬃ  cial  Gazette  as  Resolution  No.  20/2015  on  the  3rd  day  of August,  2015\n\napproving the lease to the Rotary Club of Barbados South of a parcel of land the property of the\n\ncrown situate at Garﬁ eld Sobers Sports Complex, Upton, in the parish of Christ Church in this\n\nIsland for the construction and development of a recreational facility for children with disabilities;\n\nAND WHEREAS it has been determined that Resolution No. 20/2015 should\n\nbe rescinded;\n\nNo. 20/2015.\n\nBE  IT  RESOLVED  that  Parliament  approve  the  rescission  of  Resolution\n\n\f2\n\nAPPROVED by the House of Assembly this          day of                                     , Two\n\nthousand and twenty-two.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and twenty-two.\n\nPresident\n\n\f3\n\nADDENDUM\n\n  On  the  8th  day  of  March,  2012  the  Cabinet  agreed  to  the  lease  to  the  Rotary  Club\n\nBarbados South of a parcel of land situate at Garﬁ eld Sobers Sports Complex, Wildey in the\n\nparish of Christ Church in this Island and containing approximately 25 000 square feet for the\n\ncreation of a recreational facility for children with disabilities.\n\n  On the 4th day of June, 2015, the Cabinet approved the introduction into Parliament of a\n\nResolution seeking approval for the lease.\n\nThe  Resolution  was  passed  by  the  Honourable  House  of Assembly  on  the  23rd  day  of\n\nJune,  2015  and  by  the  Honourable  Senate  on  the  8th  day  of  July,  2015,  was  assented  to  by\n\nHer Excellency Governor-General on the 28th day of July, 2015 and was published in the Oﬃ  cial\n\nGazette as Resolution No. 20/2015 on the 3rd day of August, 2015.\n\nThe Ministry of Housing, Lands and Rural Development was subsequently advised that\n\nthere  was  no  good  and  proper  registration  of  the  organization  known  as  the  Rotary  Club  of\n\nBarbados South and that the entity known as Rotary Inclusive Play Trust had been incorporated\n\nto manage the aﬀ airs of the leased site.\n\n  The name of the unregistered entity had its origins in the initial negotiation stages for\n\nthe grant of the lease and thereafter found its way into the related documentation.\n\nThe  approval  of  Parliament  is  therefore  now  sought  for  the  recission  of  Resolution\n\nNo. 20/2015.\n\n"
}