{
  "bill_id": 664,
  "slug": "resolution-re-lease-of-land-at-garfield-sobers-sports-complex-to-the-rotary-inclusive-play-trust",
  "title": "Resolution re Lease of land at Garfield Sobers Sports Complex to the Rotary Inclusive Play Trust",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/9b3ef80a12505be01e6ff8acff3f2d8b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-11-22",
  "first_reading": "2022-12-07",
  "gazette_date": null,
  "markdown": "2022-09-29\n\nPARLIAMENT\n\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands\n\n(Vesting and Disposal) Act, Cap. 225 approve the lease to The Rotary Inclusive Play Trust, a\n\ncharity registered as Charity No. 910 under the Charities Act, Cap. 243, of the parcel of land,\n\nthe  property  of  the  State,  situate  at  Garﬁ eld  Sobers  Sports  Complex,  Upton  in  the  parish  of\n\nChrist  Church  in  this  Island  and  more  particularly  described  in  the  First  Schedule  on  the\n\nterms and conditions set out in the Second Schedule for the construction and development of a\n\nrecreational facility for children with disabilities.\n\nAPPROVED by the House of Assembly this                  day of                                                ,\n\nTwo thousand and twenty-two.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and twenty-two.\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL  THAT  land  the  property  of  the  State  situate  at  Upton  in  the  parish\n\nof  Christ  Church  in  this  Island  containing  by  admeasurement  2322.6  square  metres  or\n\nthereabouts (inclusive of 65.5 square metres in road reserve and 439.1 square metres in drainage\n\nreserve) abutting and bounding on lands of the Barbados Government (Garﬁ eld Sobers Complex),\n\non lands now or late of Donald Marshall (Lot B), on lands now or late of Mary Jordan (Lot A), on\n\nother lands of the Barbados Government (Garﬁ eld Sobers Complex) and on a public road leading\n\nto Highway R in one direction and to the Aquatic Centre in the other direction or however else\n\nthe same may abut and bound as shown and delineated on a plan certiﬁ ed on the 9th day of May,\n\n2013 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Surveys Department\n\non the 2nd day of September, 2013 as Plan No. 846/2013.\n\n\f3\n\nSECOND SCHEDULE\n\nTERMS AND CONDITIONS\n\nThe lease to The Rotary Inculsive Play Trust of the parcel of land, the property of the State,\n\nsituate at Garﬁ eld Sobers Sports Complex, Upton in the parish of Christ Church in this Island\n\nand more particularly described in the First Schedule is on the following terms and conditions:\n\n(a)\n\nthe lease shall be for a period of twenty-ﬁ ve years with an option to renew for a\nfurther term;\n\n(b)  rent reviews are to take place at ﬁ ve (5) year intervals;\n\n(c)\n\nthe lessee shall, in respect of any construction or development of the land which\nwould  be  subject  to  the  Planning  and  Development  Act,  2019  (Act  2019-5),\ncomply with the requirements of the Director of Planning and Development and,\nwhere relevant, other statutory requirements;\n\n (d)  the lessee shall be responsible for:\n\n(i)\n\nthe payment of insurance premiums, land tax, utilites and other outgoings\narising out of the use of the site;\n\n(ii)\n\nthe cost of development of the site; and\n\n(iii)\n\nrepairs and maintenance of the buildings;\n\n(e)  either party may bring the lease to an end after its tenth year by serving two years'\n\nprior notice in writing; and\n\n(f)  at the end of the lease period or its sooner determination, all buildings, structures\nand  other  facilities  and  improvements  made  to  the  land,  regardless  of  stage  of\nconstruction, shall revert to the State for nil consideration.\n\n\f4\n\nADDENDUM\n\n  The  Cabinet  at  its  meeting  held  on  the  28th  day  of  September,  2017  agreed  to  the\n\ngranting of a lease of approximately 25,000 square feet (2322.60 square meters) of land situate\n\nat the Garﬁ eld Sobers Sports Complex, Upton in the parish of Christ Church in this Island and\n\ndescribed in the First Schedule hereto to the Rotary Inclusive Play Trust for the creation of a\n\nrecreational facility for children with disabilities.\n\n  The Cabinet at its meeting held on the 12th day of October, 2017 agreed to the terms\n\nand conditions for the lease to The Rotary Inclusive Play Trust contained in the Second Schedule.\n\n  The  Cabinet  at  its  meeting  held  on  the  14th  day  of  December,  2017  agreed  to  the\n\nlease  of  2322.60  metres  of  land  situate  at  the  Garﬁ eld  Sobers  Sports  Complex,  Wildey/\n\nUpton  in  the  parish  of  Christ  Church  in  this  Island  to  the  Rotary  Inclusive  Play  Trust.\n\n  The  Cabinet  at  its  meeting  held  on  the  4th  day  of August,  2022  ratiﬁ ed  the  Cabinet\n\nDecision  made  on  the  14th of  December,  2017  to  agree  to  the  terms  and  conditions\n\nfor  the  lease  to  the  Rotary  Inclusive  Play  Trust  contained  in  the  Second  Schedule.\n\n  In accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal) Act,\n\nCap. 225 the approval of Parliament is now sought for the lease to the Rotary Inclusive Play Trust of\n\nthe parcel of land described in the First Schedule to this Resolution on the terms and conditions set out\n\nin the Second Schedule hereto, for the creation of a recreational facility for children with disabilities.\n\n"
}