{
  "bill_id": 665,
  "slug": "resolution-re-land-at-balls-plantation-christ-church",
  "title": "Resolution re Land at Balls Plantation, Christ Church",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/59c5df424b424c3c5f84719343800430.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2022-12-07",
  "first_reading": "2022-12-14",
  "gazette_date": null,
  "markdown": "2022-10-07\nPARLIAMENT\nRESOLVED that Parliament approve in accordance with section 5 of the Land Acquisition Act, Cap. 228 the compulsory acquisition by the State of the parcel of land situate at Balls Plantation in the parish of Christ Church in this Island, more particularly described in the Schedule hereto for a public purpose, namely, the erection of a water storage tank by the Barbados Water Authority.\nAPPROVED by the House of Assembly this\nday of\nTwo Thousand and Twenty-Two.\nSpeaker\nAPPROVED by the Senate this\nday of\nTwo Thousand and Twenty-Two.\nPresident\nSCHEDULE\nALL THAT land the property of the Apostolic Teaching Centre situate at Balls Plantation in the parish of Christ Church in this Island containing by admeasurement 3 802.7 square metres or thereabouts abutting and bounding on lands now or formerly of the Apostolic Teaching Centre (Lot B) on lands now or formerly of the Barbados Government (Rising Sun Reservoir) and ona Right of Way 8.00 metres wide leading to Highway No. 6 or however else the same may abut and bound as shown and delineated on a plan certified on the 27\" day of June, 2022 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Surveys Department on the 29\" day of June, 2022 as Plan No. 1026/2022.\nADDENDUM.\nThe Cabinet at its meeting held on the 24\" day of March, 2022 considered Note (22) (2) 188/MHLM 15 and agreed to the compulsory acquisition of 3 802.7 square metres of land situate at Balls Plantation in the parish of Christ Church the property of the Apostolic Teaching Centre, more particularly described in the Schedule hereto for a public purpose, namely, the erection of a water storage tank by the Barbados Water Authority.\nIn accordance with section 5 of the Land Acquisition Act, Cap. 228, the approval of Parliament is now sought for the compulsory acquisition of the parcel of land described in the Schedule hereto in order that the public purpose set out in the Resolution may be effected and that the State may acquire an indefeasible title to the said parcel of land.\n"
}