{
  "bill_id": 66,
  "slug": "the-tax-on-assets-bill-2015",
  "title": "The Tax on Assets Bill, 2015.",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/2da9142f034ba2c288e2f403d3e41e07.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-01-21",
  "first_reading": "2015-01-23",
  "second_reading": "2015-01-20",
  "gazette_date": "2015-01-23",
  "passed_date": "2015-01-23",
  "markdown": "2015/01/15\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the imposition of tax on the assets of\n\n(a)\n\na deposit taking licensee under Part III of the Financial Institutions\nAct, Cap. 324A;\n\n(b)\n\na credit union; or\n\n(c)\n\nan insurance company.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nInterpretation\n\nAdministration\n\nImposition of tax\n\nComputation of assets and rate of tax in relation to a deposit taking licensee\n\nComputation of assets and rate of tax in relation to a credit union\n\nComputation of assets and rate of tax in relation to an insurance company\n\nPayment of tax\n\nPenalty\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nAccounts of records\n\n11.\n\nAudit and ancillary powers\n\n12.\n\nProcedure on default\n\n13.\n\nUnpaid tax certificates\n\n14.\n\nRefunds\n\n15.\n\nExpiration of tax\n\n\f3\n\n16.\n\nCommencement\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the imposition of tax on the assets of\n\n(a)\n\na deposit taking licensee under Part III of the Financial Institutions\nAct, Cap. 324A;\n\n(b)\n\na credit union; or\n\n(c)\n\nan insurance company.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n\nThis Act may be cited as the Tax on Assets Act, 2015.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“assets” mean,\n\n(a)\n\n(b)\n\nas it relates to a deposit taking licensee, assets as determined by the\nCentral Bank from the returns of the deposit taking licensee; or\n\nas  it  relates  to  a  credit  union  or  an  insurance  company,  assets  as\ndetermined by the Financial Services Commission from the returns of\nthe credit union or the insurance company.\n\n“average domestic assets” mean,\n\n(a)\n\n(b)\n\n(c)\n\nthe  assets  of  a  deposit  taking  licensee  held  in  national  currency,\nirrespective of the residency and computed in the manner set out in\nsection 5;\n\nthe assets of a credit union, held in national currency, irrespective of\nthe residency and computed in the manner set out in section 6;\n\nthe  assets  of  an  insurance  company  held  in  national  currency,\nirrespective of the residency and computed in the manner set out in\nsection 7;\n\n“Central Bank” means the Central Bank of Barbados;\n\n“Commissioner”  means  the  Revenue  Commissioner  appointed  under  the\n\nBarbados Revenue Authority Act (Act 2014-1);\n\n“credit union” means a co-operative society within the meaning of section 193\nof the Co-operative Societies Act, Cap. 378, which is registered under that\nAct and the total gross assets of which is $40 million or more;\n\n\f7\n\n“deposit  taking  licensee”  means  a  company  licensed  under  section  22  of  the\n\nFinancial Institutions Act, Cap. 324A\n\n(a)\n\n(b)\n\nthe total gross assets of which is $40 million or more; and\n\naccepts deposits from third parties;\n\n“Financial Services Commission” means the Commission established by section\n\n3 of the Financial Services Commission (Act 2010-21);\n\n“insurance business” has the meaning assigned to it under the Insurance Act,\n\nCap. 310;\n\n“insurance company” means a body corporate registered to carry on insurance\nbusiness under the Insurance Act, Cap. 310 and which has total gross assets\nof $40 million or more;\n\n“returns” mean,\n\n(a)\n\nas it relates to a deposit taking licensee,\n\n(i)\n\n(ii)\n\nthe financial information that is required by law to be submitted\nperiodically to the Minister responsible for Finance or the Central\nBank;\n\nany other information available to the Central Bank and which the\nCentral Bank certifies, in writing, is relevant in determining the\nfinancial condition of a deposit taking licensee in respect of a given\nperiod; or\n\n(b)\n\nas  it  relates  to  a  credit  union  or  an  insurance  company,  any  other\ninformation available to the Financial Services Commission and which\nthe Financial Services Commission certifies, in writing, is relevant in\ndetermining the financial condition of a credit union or an insurance\ncompany.\n\nAdministration\n\n3.(1)\n\nThe Commissioner is responsible for administration of this Act.\n\n\f8\n\n(2)\nA function conferred by this Act on the Commissioner is exercisable by\nany public officer authorised by the Commissioner for the purpose and reference\nin this Act, to the Commissioner is a reference to any such officer.\n\nImposition of tax\n\n4.(1)\naverage domestic assets of a deposit taking licensee, a tax\n\nSubject to this Act, there shall be charged, levied and collected on the\n\n(a)\n\n(b)\n\ndescribed in the manner; and\n\nat the rate\n\nset out in section 5.\n\nSubject to this Act, there shall be charged, levied and collected on the assets\n\n(2)\nof a credit union, a tax described in the manner set out in section 6.\n\nSubject to this Act, there shall be charged, levied and collected on the assets\n\n(3)\nof an insurance company, a tax described in the manner set out in section 7.\n\nComputation of assets and rate of tax in relation to a deposit taking\nlicensee\n\nThe formula for computing the average domestic assets of a deposit\n5.(1)\ntaking licensee is, one divided by the number of months for which the tax is being\npaid, multiplied by the sum of the domestic assets for the said months, which is\nset out as follows:\n\n1/# of months * Ʃ (domestic assets for the number of identified months).\n\n(2)\nThe rate of tax payable on the average domestic assets of a deposit taking\nlicensee  in  relation  to  those  assets  is  0.20%  per  annum  and  shall  be  paid  to\nCommissioner in the manner specified in section 8(1).\n\n\f9\n\nComputation of assets and rate of tax in relation to a credit union\n\n6.(1)\nThe formula for computing the taxable assets of a credit union is the\ntotal assets held in national currency less the provision of bad debt and reserve\nfor depreciation.\n\nThe rate of tax payable on the average domestic assets of a credit union in\n(2)\nrelation to those assets is 0.20% per annum and shall be paid to Commissioner\nin the manner specified in section 8(2).\n\nComputation of assets and rate of tax in relation to an insurance\ncompany\n\n7.(1)\nis the total assets net of segregated assets.\n\nThe formula for computing the taxable assets of an insurance company\n\nThe formula for computing the segregated assets referred to in subsection\n\n(2)\n(1) is the regulatory capital plus the reinsurance recoverable.\n\nThe  rate  of  tax  payable  on  the  average  domestic  assets  of  an  insurance\n(3)\ncompany  in  relation  to  those  assets  is  0.20%  per  annum  and  shall  be  paid  to\nCommissioner in the manner specified in section 8(2).\n\nPayment of tax\n\n8.(1)\nlicensee, shall be paid to the Commissioner\n\nThe  tax  levied  by  virtue  of  this  Act,  in  respect  of  a  deposit  taking\n\n(a)\n\n(b)\n\n(c)\n\nfor  the  period  1st  June,  2014  to  31st  August,  2014,  on  or  before  the\n15th February, 2015;\n\nfor the period 1st September, 2014 to 30th November, 2014, on or before\nthe 15th April, 2015;\n\nfor the period 1st December, 2014 to 28th February, 2015, on or before\nthe 15th June, 2015;\n\n\f10\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nfor the period 1st March, 2015 to 31st May, 2015, on or before the 15th\nAugust, 2015;\n\nfor  the  period  1st  June,  2015  to  31st  August,  2015,  on  or  before  the\n15th October, 2015;\n\nfor the period 1st September, 2015 to 30th November, 2015, on or before\nthe 15th January, 2016;\n\nfor the period 1st December, 2015 to 29th February, 2016, on or before\nthe 15th April, 2016;\n\nfor the period 1st March, 2016 to 31st March, 2016, on or before the\n15th June, 2016.\n\nThe  tax  levied  by  virtue  of  this  Act,  in  respect  of  a  credit  union  or  an\n(2)\ninsurance company, shall be paid to the Commissioner in the manner specified:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nfor the period 1st July, 2014 to 30th September, 2014, on or before the\n31st January, 2015;\n\nfor the period 1st October, 2014 to 31st December, 2014 on or before\nthe 30th April, 2015;\n\nfor the period 1st January, 2015 to 31st March, 2015, on or before the\n30th June, 2015;\n\nfor the period 1st April, 2015 to 30th June, 2015, on or before the 30th\nSeptember, 2015;\n\nfor the period 1st July, 2015 to 30th September, 2015, on or before the\n30th November, 2015;\n\nfor the period 1st October, 2015 to 31st December, 2015, on or before\nthe 29th February, 2016;\n\nfor the period 1st January, 2016 to 31st March, 2016 on or before 30th\nApril, 2016.\n\n\f11\n\n(3)\n\nNothing in this Act shall preclude\n\n(a)\n\n(b)\n\n(c)\n\na deposit taking licensee;\n\na credit union; or\n\nan insurance company,\n\nfrom pro rating and paying the tax on a more frequent basis.\n\nPenalty\n\n9.\nA deposit taking licensee, a credit union or an insurance company that\nfails  to  pay  the  tax  by  the  dates  specified  in  section  8(1),  shall  pay  to  the\nCommissioner\n\n(a)\n\n(b)\n\nthe tax payable; and\n\na penalty, equal to 10 per cent of the amount of tax that was due and\nunpaid at that date, or $20,000 whichever is greater.\n\nAccounts of records\n\n10.(1)\nA deposit taking licensee, a credit union or an insurance company shall\nkeep, in Barbados, records and books of account in such form and containing\nsuch information as will allow the tax payable under this Act to be determined.\n\nThe Commissioner may require a deposit taking licensee, a credit union or\n(2)\nan  insurance  company  that  fails  to  comply  with  subsection  (1)  to  keep  such\nrecords  and  books  of  account  as  the  Commissioner  specifies,  and  the  deposit\ntaking licensee, credit union or insurance company shall keep the records and\nbooks of account so specified.\n\nA deposit taking licensee, a credit union or an insurance company, required\n(3)\nby this section to keep records and books of account, shall retain all records and\nbooks of account and every document or record necessary to verify the records\nand books of account until the Commissioner gives permission, in writing, for\nthe disposal of that document or record.\n\n\f12\n\nAudit and ancillary powers\n\nFor the purpose of enforcing this Act, the powers conferred by section\n11.\n76 of the Income Tax Act, Cap. 73 on the Commissioner are exercisable by the\nCommissioner in relation to the premises occupied by a deposit taking licensee,\na credit union or an insurance company and accordingly, section 76 of the Income\nTax  Act,  shall  be  construed  mutatis  mutandis  for  the  purpose  of  giving  the\nnecessary effect to this Act.\n\nProcedure on default\n\nWhere a deposit taking licensee fails to make payment as required by\n12.(1)\nthis Act, the Commissioner shall assess the tax payable by the deposit taking\nlicensee on the basis of the contents of a certified statement, submitted to him by\nthe Central Bank.\n\nWhere a credit union or an insurance company fails to make payment as\n(2)\nrequired by this Act, the Commissioner shall assess the tax payable by the credit\nunion or insurance company on the basis of the contents of a certified statement,\nsubmitted to him by the Financial Services Commission.\n\nUnpaid tax certificates\n\n13.(1)\nWhere tax payable under this Act remains unpaid for a period of 30\ndays from the date on which payment should have been made, the amount of the\ntax may be certified, in relation to the deposit taking licensee, credit union or\ninsurance company, by the Commissioner in a certificate called an unpaid tax\ncertificate.\n\nAn unpaid tax certificate may be filed by the Commissioner in the High\n(2)\nCourt or in a magistrates’ court for District “A” and shall be registered in the\ncourt in which it is filed.\n\nA certificate referred to in subsection (2) has, after the expiry of a period\n(3)\nof 7 days from the date on which it is filed and registered, the same force and\neffect as a judgement of the court in which it is registered in favour of the Crown\n\n\f13\n\nagainst the deposit taking licensee, credit union or insurance company, named in\nthe certificate, for the amount specified in the certificate and also for\n\n(a)\n\n(b)\n\ninterest on that amount at the rate of 1.5 per cent per month calculated\nfor each month on the unpaid balance of the tax; and\n\nthe reasonable costs and charges attendant upon the registration of the\ncertificate.\n\nAll proceedings may be taken on an unpaid tax certificate and the certificate\n(4)\nmay be enforced as if it were a judgement of the court in which it is registered.\n\nWhere an unpaid certificate is filed by the Commissioner in the High Court\n(5)\nor in a magistrates’ court for District “A”, the Commissioner shall immediately\ndeliver a copy of the certificate to the deposit taking licensee, credit union or\ninsurance company to which the certificate relates and if the copy of the certificate\nis  not  delivered  within  7  days  from  the  date  of  filing  subsections  (3)  and  (4)\nshall cease to have effect in respect of the certificate.\n\nRefunds\n\n14.(1)\n\nSubject to subsection (2), where\n\n(a)\n\nan  amount  paid,  by  a  deposit  taking  licensee,  a  credit  union  or  an\ninsurance company, as tax or interest is in excess of the amount that\nought to have been paid; and\n\n(b)\n\nthe deposit taking licensee, credit union or insurance company applies\nto the Commissioner, in writing, for a refund of the excess,\n\nthe  Commissioner  shall  apply  the  amount  of  the  excess  for  meeting  any\noutstanding  liability  of  that  deposit  taking  licensee,  credit  union  or  insurance\ncompany under this Act and then pay over to the deposit taking licensee, credit\nunion or insurance company the balance, if any.\n\nAn application for a refund shall not be considered unless the application\n(2)\nis made before the expiration of a period of one year from the date on which the\npayment was made.\n\n\f14\n\nA refund under this section shall be made by the Commissioner and shall\n\n(3)\nbe a charge on the Consolidated Fund.\n\nExpiration of tax\n\n15.\nNo tax shall be levied under this Act in respect of a deposit taking\nlicensee, credit union or insurance company for any period after 31st March, 2016.\n\nCommencement\n\n16.\n\nThis Act shall be deemed to have come into operation in respect of\n\n(a)\n\n(b)\n\na deposit taking licensee, on the 1st June, 2014; and\n\na credit union or an insurance company, on the 1st July, 2014.\n\n"
}