{
  "bill_id": 672,
  "slug": "duties-taxes-and-other-payments-exemption-bill-2023",
  "title": "Duties, Taxes and Other Payments (Exemption) Bill, 2023",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/c2e8a2c712bc1500f6e69a01562d32e7.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-05-24",
  "first_reading": "2023-05-23",
  "gazette_date": null,
  "markdown": "Certified Draft 2022-12-30\n\nOBJECTS AND REASONS\n\nThis  Bill  would  improve  the  process  for  the  granting  of  exemptions  to\nindividuals, businesses and agencies from the payment of duties, taxes and other\nimposts.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nExemption from taxes by the Minister\n\nExemption from taxes with the approval of the Cabinet\n\nConditions respecting order\n\nLimitations on the exercise of the power to exempt\n\nRepayments\n\nRefund re overpayment of taxes\n\nRepeal of Cap. 67B\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to improve the process for the granting of exemptions to individuals,\nbusinesses and agencies from the payment of duties, taxes and other imposts.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Exemption) Act, 2023.\n\nThis  Act  may  be  cited  as  the  Duties,  Taxes  and  other  Payments\n\nInterpretation\n\n2.\n\nIn this Act\n\n“duty”  or  “tax”  means  import  duty,  consumption  tax,  income  tax,  national\n\ninsurance contribution or any other tax, duty or impost;\n\n“person” means an individual, a business, an agency or an entity of any kind.\n\nExemption from taxes by the Minister\n\nNotwithstanding anything contained in any enactment, and subject to\n3.\nthe provisions of the Public Finance Management Act, 2019 (Act 2019-1) the\nMinister of Finance may by order\n\n(a)\n\n(b)\n\ngrant an exemption to; or\n\nremit or refund any payment made by\n\nany person in respect of the payment of any duty or tax where the sum does not\nexceed $100, 000.\n\nExemption from taxes with the approval of the Cabinet\n\n4.\nNotwithstanding anything contained in any enactment, and subject to\nthe provisions of the Public Finance Management Act, 2019 (Act 2019-1), the\nMinister of Finance may, with the approval of the Cabinet, by order\n\n(a)\n\n(b)\n\ngrant an exemption to; or\n\nremit or refund any payment made by\n\nany person in respect of the payment of any duty or tax where the sum exceeds\n$100, 000.\n\n\f5\n\nConditions respecting order\n\n5.\n\nAn order made under this Act\n\n(a)\n\n(b)\n\n(c)\n\nis subject to any condition specified in the order;\n\nis subject to negative resolution; and\n\nmay be made retrospective to any date specified in the order.\n\nLimitations on the exercise of the power to exempt\n\nThe Minister or the Cabinet, as the case may be, may only exercise\n6.\nthe power conferred under section 3 or 4 where it is in the public interest to do\nso or where it is necessary to alleviate hardship or avoid injustice.\n\nRepayments\n\n7.\n\nWhere an exemption granted under this Act is subject to\n\n(a)\n\n(b)\n\nany condition specified in an order made under this Act; or\n\nany condition specified in any other enactment,\n\nthe sums which were exempt are repayable by the person to whom the exemption\nwas  granted  where  the  conditions  so  specified  are  not  complied  with  by  that\nperson.\n\nRefund re overpayment of taxes\n\n8.\nmay be refunded without the enactment of an order under this Act.\n\nAny duty or tax which is overpaid by a person under any enactment\n\nRepeal of Cap. 67B\n\n9.\nrepealed.\n\nThe Duties, Taxes and other Payments (Exemption) Act, Cap. 67B is\n\n\f6\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2023.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2023.\n\nPresident\n\n"
}