{
  "bill_id": 673,
  "slug": "resolution-re-vesting-of-land-at-retreat-six-mens-stpeter-in-the-btii-2811-sq-metres1",
  "title": "Resolution re vesting of land at Retreat Six Mens, St.Peter in the BTII - 2811 sq metres.1",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/f6e4f49125ee835c7950981fffbce587.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-01-18",
  "first_reading": "2023-01-25",
  "gazette_date": null,
  "markdown": "2023-01-12\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  28(c)  of  the\n\nLand Acquisition Act, Cap. 228 approve the vesting in the Barbados Tourism Investment Inc.\n\nof the parcel of land, the property of the State situate at Six Men's in the parish of Saint Peter\n\nin  this  Island,  more  particularly  described  in  the  Schedule  hereto  for  tourism  development.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo Thousand and Twenty-three.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                            day  of                                                    ,\n\nTwo Thousand and Twenty-three.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  the  property  of  the  State  (formerly  the  Crown)  situate  at\n\nSix Men's in the parish of Saint Peter in this Island containing by admeasurement 2811 square\n\nmetres or thereabouts (formerly part of a larger area of land comprising 116,168 square metres)\n\nabutting and bounding on lands now or formerly of S.P. Musson Son and Company on lands now\n\nor formerly of Six Men's Plantation on lands now or formerly of Port St. Charles Development\n\nLtd. and on a public road known as Highway #1 which leads to Heywoods in one direction and\n\nto Shermans in the other direction or however else the same may abut and bound as delineated\n\nand shown on a plan certiﬁ ed on the 25th day of July, 2008 by Brian A. Hart, Land Surveyor and\n\nrecorded in the Lands and Surveys Department on the 25th day of July, 2008 as Plan No. 937/2008.\n\n\f3\n\nADDENDUM\n\n  The  Cabinet  at  its  meeting  held  on  the  22nd  day  of  December,  2022  considered\n\nNote  (22)  (2)  1326/MHLM  84  and  agreed  to  the  vesting  of  approximately  2811  square\n\nmetres of State lands at Six Men's in the parish of Saint Peter in this Island in the Barbados Tourism\n\nInvestment Inc. for tourism development subject to planning permission being obtained.\n\n  The said lands, formerly part of a larger area of land comprising 116,168 square metres\n\nwas on the 8th day of December, 1997 compulsorily acquired by the State (formerly the Crown)\n\nfrom Mount Six Men's Limited for housing development as indicated by S.I. 1997 No. 128 which\n\nwas published in the Oﬃ  cial Gazette on 22nd December, 1997.\n\n  By Application  No.  1970/12/2022C  dated  the  14th  day  of  December,  2022  the  State\n\napplied  to  the  Planning  and  Development  Office  for  permission  to  subdivide  the  said\n\n2811 square metres of land from the larger parcel.\n\n\f4\n\nADDENDUM - (Concl'd)\n\n  By Permission, Reference No. 1970/12/2022C, dated the 19th day of December, 2022 the\n\nDirector of Planning and Development approved the subdivision subject to certain conditions\n\nnamely:\n\n  (i)  The submission to and approval by the Director of Planning and Development of a\n\ncertiﬁ ed surveyor's plot or plots of the subdivision; and\n\n  (ii)  Where ﬁ ve (5) or more years expire before the development for which planning\n\npermission has been granted takes place, this permission shall be deemed to have\n\nlapsed requiring a new application to the Director of Planning and Development.\n\n  In  accordance  with  the  provisions  of  section  28(c)  of  the  Lands  Acquisition  Act,\n\nCap.  228  the  approval  of  Parliament  is  now  sought  for  the  vesting  of  the  parcel  of  land\n\ndescribed in the Schedule hereto in the Barbados Tourism Marketing Inc. for tourism development.\n\n"
}