{
  "bill_id": 674,
  "slug": "resolution-re-vesting-of-land-at-retreat-six-mens-stpeter-in-the-btii-12987-sq-metres2",
  "title": "Resolution re vesting of land at Retreat Six Mens, St.Peter in the BTII - 1298.7 sq metres.2",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3191f49b5f08bd48edbc079307536cff.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-01-18",
  "first_reading": "2023-01-17",
  "gazette_date": "2023-01-25",
  "markdown": "2023-01-12\n\nPARLIAMENT\n\nRESOLVED that Parliament, in accordance with section 5 of the Crown Lands\n\n(Vesting and Disposal) Act, Cap. 225, approve the vesting in the Barbados Tourism Investment Inc.\n\nof the parcel of land, the property of the State, situate at Retreat, Six Men’s in the parish of Saint\n\nPeter in this Island, more particularly described in the Schedule hereto for tourism development.\n\nAPPROVED by the House of Assembly this                  day of                                                ,\n\nTwo thousand and twenty-three.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and twenty-three.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL THAT land the property of the State situate at Six Men’s in the parish of Saint\n\nPeter in this Island containing by admeasurement 1298.7 square metres (including 86.7 square\n\nmetres in land and 1212 square metres in beach) abutting and bounding on lands now or formerly of Port\n\n Ferdinand S.R.L., on lands now or formerly of the Barbados Government (boulders), on the Sea (High\n\nWater Mark 7th June, 2022) on lands now or formerly of Corsair Cove S.R.L. (Lot P), and on a\n\npublic road known as Highway #1 which leads to Shermans in one direction and to Heywoods in\n\nthe other direction or however else the same may abut and bound as shown and delineated on a plan\n\ncertiﬁ ed on the 15th day of September, 2022 by Garrick L. Jenkins, Land Surveyor and recorded\n\nin the Lands and Surveys Department on the 16th day of September, 2022 as Plan No. 1489/2022.\n\n\f3\n\nADDENDUM\n\n  The  Cabinet  at  its  meeting  held  on  the  1st  day  of  September,  2022  considered\n\nNote (22) (2) 874/MHLM 57 and agreed to the vesting of approximately 1212 square metres\n\n(13,045.86  square  feet)  in  beach  up  to  the  high  water  mark  and  87.6  square  metres  (942.9\n\nsquare  feet)  in  land  at  Retreat,  Six  Men’s  in  the  parish  of  Saint  Peter  in  the  Barbados\n\nTourism Investment Inc. for tourism development.\n\n  By a recent survey, the land was found to contain by admeasurement a total of 1298.7\n\nsquare metres comprising 86.7 square metres in land and 1212 square metres in beach as shown and\n\ndelineated on a plan certiﬁ ed on the 15th day of September, 2022 by Garrick L. Jenkins, Land Surveyor\n\nand recorded on the 16th day of September, 2022 in the Lands and Surveys Department as Plan\n\nNo. 1489/2022.\n\n  On  the  4th  day  of  February,  1985,  the  Crown  (now  the  State)  compulsorily\n\nacquired the property of Manning Wilkinson and Challenor Limited, containing 1251 square\n\nmetres  of  land  (including  314  square  metres  in  road)  situate  at  Six  Men’s  in  the  parish  of\n\nSaint Peter for the construction of the Speightstown By-Pass Road (Phase 3) and for housing\n\nrelocation  as  indicated  by  S.I.  1985  No.  16  which  was  published  in  the  Oﬃ  cial  Gazette.\n\n  On  the  6th  day  of  January,  1994,  the  Minister  responsible  for  Public  Works  by  the\n\nauthority  vested  in  him  by  section  11  of  the  Highways  Act,  Cap.  289,  abandoned  a  parcel\n\nof  land  referred  to  as  the  ‘Old  Public  Road’  under  the  Highways  (Abandonment)  Order,\n\n1994  by  (S.I  1994  No.  3).  The  area  of  abandoned  land  included  part  of  that  property\n\ncompulsorily acquired from Manning Wilkinson and Challenor Limited.\n\n\f4\n\n     By  Resolution  No.  32  of  1995  passed  by  the  House  of  Assembly  on  the\n\n8th  day  of August,  1995  and  approved  by  the  Senate  on  the  18th  day  of August,  1995  and\n\nassented  to  by  Her  Excellency  the  Governor-General  on  the  21st  day  of August,  1995,  the\n\napproval for the sale of  the land to DaCosta Manning Inc. (formerly Manning Wilkinson and Challenor\n\nLimited) was granted. By Conveyance made on the 8th day of December, 1995 between the\n\nCrown  and  DaCosta  Manning  Inc.,  part  of  the  area  of  the  abandoned  land  was  conveyed  to\n\nDaCosta Manning Inc. and an area known as C2 containing by admeasurement 87.1 square metres\n\nin land or thereabouts was retained by the Crown as shown on a plan certiﬁ ed on the 17th day of\n\nAugust, 1992 by James W. Abrahams, Land Surveryor and recorded in the Lands and Surveys\n\nDepartment on the 20th day of August, 1992 as Plan No. 806/92.\n\n     Over time, an area of accreted beach, namely, 1212 square metres has expanded the total\n\nproperty of the State as shown and delineated on a plan certiﬁ ed on the 15th day of September, 2022\n\nand recorded in the Lands and Surveys Department on the 16th  day of September, 2022 as Plan\n\nNo. 1489/2022.\n\n     In  accordance  with  the  provisions  of  section  5  of  the  Crown  Lands  (Vesting  and\n\nDisposal) Act, Cap. 225, the approval of Parliament is now sought for the vesting in the Barbados\n\nTourism Investment Inc. of the parcel of land, more particularly described in the Schedule, for\n\ntourism development.\n\n"
}