{
  "bill_id": 675,
  "slug": "resolution-re-vesting-of-land-at-retreat-six-mens-stpeter-in-the-btii-11367-sq-metres3",
  "title": "Resolution re vesting of land at Retreat Six Mens, St.Peter in the BTII - 1136.7 sq metres.3",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/82b4af5a4feb0add2c4a1e64037b0b53.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-01-18",
  "first_reading": "2023-01-17",
  "gazette_date": "2023-01-25",
  "markdown": "2023-01-12\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the  Crown\n\nLands  (Vesting  and  Disposal)  Act,  Cap.  225  approve  the  vesting  in  the  Barbados  Tourism\n\nInvestment Inc. of the parcel of land, the property of the State situate at Retreat, Six Men's in the\n\nparish  of  Saint  Peter  in  this  Island,  more  particularly  described  in  the  Schedule  hereto  for\n\ntourism development.\n\nAPPROVED by the House of Assembly this                  day of                                                ,\n\nTwo thousand and twenty-three.\n\nSpeaker\n\nAPPROVED by the Senate this              day of                          , Two\n\nthousand and twenty-three.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  the  property  of  the  State  situate  at  Six  Men’s  in  the  parish\n\nof  Saint  Peter  in  this  Island  containing  by  admeasurement  1136.7  square  metres\n\n(being an aggregate of 1091 square metres in road comprised in  Lot G1 and 45.7 square metres in\n\nroad reserve comprised in Lot G2) abutting and bounding on lands now or formerly of the Barbados\n\nG o v e r n m e n t   ( L o t   C 2 )   o n   l a n d s   n o w   o r   f o r m e r l y   o f   C o r s a i r   C o v e   S R L\n\n(Lot  P)  on  a  public  road  (Highway  #1)  leading  to  Shermans  in  one  direction  and  to\n\nSix Men's Cul-de-Sac in another direction on Lot R on Lot A and on a public road known as\n\nHighway #1 which leads to Heywoods or however else the same may abut and bound as shown\n\nand delineated on a  plan  certiﬁ ed on the 19th day of  December, 2022 by  Garrick L. Jenkins,\n\nLand Surveyor and recorded in the Lands and Surveys Department on the 19th day of December,\n\n2022 as Plan No. 1966/2022.\n\n\f3\n\nADDENDUM\n\n  The  Cabinet  at  its  meeting  held  on  the  1st  day  of  September,  2022  considered\n\nNote  (22)  (2)  874/MHLM  57  and  agreed  to  the  vesting  of  approximately  1136.70  square\n\nmetres  in  land  contained  in  a  public  road  at  Retreat,  Six  Men's  in  the  parish  of  Saint  Peter\n\nin this Island in the Barbados Tourism Investment Inc. following the abandonment of the said public road\n\nby the Minister responsible for Highways.\n\n  On the 31st day of October, 2022, the Minister responsible for Highways, by virtue of the\n\nauthority vested in him by Section 11 of the Highways Act, Cap. 289, gave notice of his intention\n\nto abandon 1100 square metres of the said parcel of land contained in the public road by way of\n\nthe Highways (Abandonment) Notice, 2022 (S.I. No. 93 of 2022).\n\n  On the 12th day of January, 2023, the Minister responsible for Highways, by virtue of the\n\nauthority vested in him by section 11 of the Highways Act, Cap. 289, abandoned the said 1100\n\nsquare metres of the said parcel of land by way of the Highways (Abandonment) Order, 2023\n\n(S.I. No. 2 of 2023).\n\n  In  accordance  with  the  provisions  of  section  5  of  the  Crown  Lands  (Vesting  and\n\nDisposal) Act, Cap. 225, the approval of Parliament is now sought for the vesting in the Barbados\n\nTourism Investment Inc. of the parcel of land more particularly described in the Schedule hereto\n\nfor tourism development.\n\n"
}