{
  "bill_id": 677,
  "slug": "minor-offences-amendment-bill-2023",
  "title": "Minor Offences (Amendment) Bill, 2023",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/23b74f2c9d13f23e530fc4fadf87f929.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-02-08",
  "first_reading": "2023-02-08",
  "gazette_date": "2023-02-13",
  "markdown": "2023-01-27\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Minor Offences Act, Cap. 137 to create an offence\n\nof flying a kite with any object which creates noise between specified hours.\n\n\f2\n\n1.\n\n2.\n\n3.\n\n4.\n\nArrangement of Sections\n\nShort title\n\nInsertion of sections 4A, 4B and 4C into Cap. 137\n\nAmendment of section 5 of Cap. 137\n\nInsertion of Schedule into Cap. 137\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Minor Offences Act, Cap. 137\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2023.\n\nThis  Act  may  be  cited  as  the  Minor  Offences  (Amendment)  Act,\n\n\f4\n\nInsertion of sections 4A, 4B and 4C into Cap. 137\n\n2.\nThe  Minor  Offences  Act,  Cap.  137,  in  this  Act  referred  to  as  the\nprincipal Act, is amended by inserting immediately after section 4 the following\nnew sections:\n\n“Offence of flying a kite which makes noise between specified\nhours\n\n4A.(1)\nobject which\n\nAny person who flies or causes to be flown any kite with any\n\n(a)\n\n(b)\n\ncreates noise when attached to the kite; or\n\ncauses the kite to make noise,\n\nbetween the hours of 7:00 p.m. and 6:00 a.m. is guilty of an offence and\nis liable on summary conviction to a fixed penalty of $500.\n\nWhere  a  person  contravenes  subsection  (1),  a  member  of  the\n\n(2)\nPolice Service shall\n\n(a)\n\n(b)\n\n(c)\n\nask the person to give his full name and address;\n\nserve personally upon the person a fixed penalty notice in the\nrelevant form set out in the Schedule; and\n\nsend a duplicate of the notice to the clerk of the magistrate’s\ncourt referred to in paragraph (c).\n\nThe fixed penalty notice shall be signed by the member of the\n\n(3)\nPolice Service and shall state the following:\n\n(a)\n\n(b)\n\nthe date, time and place of service of the notice;\n\nthe provision of this Act which creates the alleged offence\nand such particulars of the offence as are required under this\nAct;\n\n\f5\n\n(c)\n\n(d)\n\nthe  time  within  which  the  fixed  penalty  may  be  paid  in\naccordance with subsection (6); and\n\nthe clerk of the magistrate’s court to whom the fixed penalty\nmay be paid and the address of the magistrate’s court where\nthe fixed penalty may be paid or remitted.\n\nA person who refuses to answer or who gives a false answer in\n(4)\nrespect of a question mentioned in paragraph (a) of subsection (2) is\nguilty of an offence and is liable on summary conviction to a fine of\n$500 or to imprisonment for 6 months.\n\nA  person  upon  whom  a  fixed  penalty  notice  is  served  may\n(5)\ncomplete the notice in the prescribed manner and pay the fixed penalty\nin accordance with the notice.\n\nA fixed penalty is payable within 14 days from the date of the\n\n(6)\nfixed penalty.\n\n(7)\n\nPayment of the fixed penalty shall be\n\n(a)\n\nmade to the clerk of the magistrate’s court as stated in the\nnotice; and\n\n(b)\n\naccompanied by the completed notice.\n\nDirection from member of the Police Service\n\n4B.(1)\nA member of the Barbados Police Service shall require an\nowner or a person in charge of any kite found flying in contravention\nof  section  4A  to  cause  the  kite  to  cease  flying  immediately  and  the\nowner or person in charge of the kite shall comply with the direction of\nthe member of the Barbados Police Service.\n\nWhere a person fails or refuses to comply with a direction given\n\n(2)\nby a member of the Police Service under subsection (1),\n\n(a)\n\nthat person is guilty of an offence and is liable on summary\nconviction to a fixed penalty of $500; and\n\n\f6\n\n(b)\n\nsubsections (2) to (7) of section 4A and the Schedule shall\napply mutatis mutandis.\n\nPenalty to constitute a debt to the State\n\n4C.\nin civil proceedings before a Magistrate for District “A”.”.\n\nA fixed penalty may be recovered as a debt due to the State\n\nAmendment of section 5 of Cap. 137\n\n3.\nSection  5  of  the  principal  Act,  is  amended  by  deleting  the  words\n“police officer” and substituting the words “member of the Barbados Police\nService”.\n\nInsertion of Schedule into Cap. 137\n\n4.\nthe Schedule to this Act.\n\nThe principal Act is amended by inserting the Schedule set out in\n\n\f7\n\nL.R.O. 1998SCHEDULE(Section 4)\"SCHEDULE (Sections 4A and 4B)FORM AMinor Oﬀ ences ActCap. 137NOTICE OF FIXED PENALTYSection A  Serial No.:Take notice that, I,                                                                                                                        , have reason to believe that you have committed the oﬀ ence herein. The ﬁ xed penalty for the oﬀ ence is $500.In paying the ﬁ xed penalty, the following conditions shall be observed:1. The payment of the ﬁ xed penalty shall be accompanied by this notice. 2. Payment of the ﬁ xed penalty shall be made or remitted to the clerk of the magistrate’s court for District . (Rank)(Name of member of the Police Service)(Number)\f8\n\n L.R.O. 1998This notice was given at on   20 , at   a.m./p.m.PARTICULARS OF OFFENCEAt   a.m./p.m. on the day of  , 20 you,      ofat         were ﬂ ying/caused to be ﬂ own a kite with an object contrary to section 4A of the Minor Oﬀ ences Act, Cap. 137.                Schedule - (Cont'd)(state date)(state time)(name)(place)Signature of member of the Police Service(address)(place)\f9\n\n L.R.O. 1998 Instructions to Oﬀ ender Cash should be paid to the clerk. Cheques, postal orders or money orders may be sent by post and made payable to the clerk of the magistrate's court of  District        . A receipt for the payment will be given. Part payment will not be accepted by the clerk.  The person paying the ﬁ xed penalty must forward with the remittance Section B ofthis notice or identify this notice by quoting its serial number. A ﬁ xed penalty may be recovered as a debt due to the State in civil proceedings before a Magistrate for District \"A\".Schedule - (Cont'd)\f10\n\n L.R.O. 1998Schedule - (Cont'd)Section B Serial No.(of notice)To: Clerk of the magistrate's court for District .  I enclosed the sum of $500 as payment of the ﬁ xed penalty for the oﬀ ence mentioned inPart A of this notice.Name:Address:         (Signature)(Date)\f11\n\nL.R.O. 1998FORM BMinor Oﬀ ences ActCap. 137NOTICE OF FIXED PENALTYSection A  Serial No.:Take notice that, I,                                                                                                                        , have reason to believe that you have committed the oﬀ ence herein. The ﬁ xed penalty for the oﬀ ence is $500.In paying the ﬁ xed penalty, the following conditions shall be observed:1. The payment of the ﬁ xed penalty shall be accompanied by this notice. 2. Payment of the ﬁ xed penalty shall be made or remitted to the clerk of the magistrate’s court for District .This notice was given at on   20 , at   a.m./p.m.(Rank)(Name of member of the Police Service)(Number)Schedule - (Cont'd)(state date)(state time)(place)\f12\n\n L.R.O. 1998Schedule - (Cont'd)PARTICULARS OF OFFENCEAt   a.m./p.m. on the day of  , 20 you,      ofat          failed or refused to complywith a direction of a member of the Police Service to cause a kite to cease ﬂ ying contrary tosection 4B of the Minor Oﬀ ences Act, Cap. 137.(name)(place)(address)Signature of member of the Police Service\f13\n\n L.R.O. 1998 Instructions to Oﬀ ender Cash should be paid to the clerk. Cheques, postal orders or money orders may be sent by post and made payable to the clerk of the magistrate's court of  District        . A receipt for the payment will be given. Part payment will not be accepted by the clerk.  The person paying the ﬁ xed penalty must forward with the remittance Section B ofthis notice or identify this notice by quoting its serial number. A ﬁ xed penalty may be recovered as a debt due to the State in civil proceedings before a Magistrate for District \"A\".Schedule - (Cont'd)\f14\n\n L.R.O. 1998Schedule - (Concl'd)Section B Serial No.(of notice)To: Clerk of the magistrate's court for District .  I enclosed the sum of $500 as payment of the ﬁ xed penalty for the oﬀ ence mentioned inPart A of this notice.Name:Address:         \".(Signature)(Date)\f15\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2023.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2023.\n\nPresident\n\n"
}