{
  "bill_id": 678,
  "slug": "integrity-in-public-life-bill-2023",
  "title": "Integrity in Public Life Bill, 2023",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/cc50a37849474df098583b0b3133ce68.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-07-22",
  "first_reading": "2023-07-26",
  "gazette_date": "2023-02-13",
  "markdown": "Explanatory Memorandum following Page 102\n\n2023-01-27\n\nOBJECTS AND REASONS\n\nThis  Bill  would  establish  a  regime,  including  an  integrity  commission,  to\npromote the integrity of persons in public life and strengthen measures for the\nprevention, detection, investigation and prosecution of acts of corruption, alter\nthe Constitution to the extent necessary for the purpose and provide for related\nmatters.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\nShort title\n\nInterpretation\n\nPART II\n\nINTEGRITY COMMISSION\n\nEstablishment of Integrity Commission\n\nFunctions of Commission\n\nConsultation\n\nAgreements and exchange of information with law enforcement agencies\n\nFunds of Commission\n\nAnnual reports\n\nStaff of Commission\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nInvestigative officers\n\n\f3\n\nPART III\n\nDECLARATIONS\n\n11.\n\nDeclaration of financial affairs by specified persons in public life\n\n12.\n\nFull disclosure\n\n13.\n\nTrust property\n\n14.\n\nBlind trusts\n\n15.\n\nExamination of declarations\n\n16.\n\nPublication of failure to file declaration or furnish information\n\n17.\n\nOffences in respect of declarations\n\nPART IV\n\nREGISTRABLE AND PROHIBITED INTERESTS\n\n18.\n\nFiling of statements of registrable interests\n\n19.\n\nRecord of statements of registrable interests etc.\n\n20.\n\nOffences in respect of statements of registrable interests\n\n21.\n\nDisqualification of member from holding public office\n\n22.\n\nProhibited interests\n\n\f4\n\nPART V\n\nGIFTS\n\nPART VI\n\n23.\n\nReports on gifts\n\n24.\n\nOffences in respect of gifts\n\nCONDUCT IN PUBLIC LIFE AND CONTRAVENTIONS OF ACT\n\n25.\n\nCode of Conduct\n\n26.\n\nDuty to report contravention of Act\n\n27.\n\nComplaint to Commission regarding contravention of Act\n\n28.\n\nOral complaints to be put into writing\n\n29.\n\nExamination of complaints\n\n30.\n\nOffences in respect of false complaints\n\nPART VII\n\nPOWER TO REQUIRE FURTHER INFORMATION AND TO CONDUCT\nINQUIRIES\n\n31.\n\nGeneral powers of Commission to investigate or inquire\n\n32.\n\nConduct of inquiries\n\n33.\n\nCommission’s powers to summon and examine witnesses\n\n34.\n\nDuty of witnesses summoned\n\n\f5\n\n35.\n\nWitness expenses\n\n36.\n\nMarshals to attend Commission\n\n37.\n\nInquiry reports etc.\n\n38.\n\nAction by Director of Public Prosecutions\n\n39.\n\nOffences in respect of requests for information and inquiries\n\n40.\n\nPresident to appoint tribunal to perform functions\n\nPART VIII\n\nINVESTIGATIONS\n\nPowers of Investigative Officers\n\n41.\n\nPower of arrest\n\n42.\n\nDisclosure orders\n\n43.\n\nSearch and seizure warrants\n\n44.\n\nObstruction of investigative officer\n\nComplaints regarding Investigative Officers\n\n45.\n\nComplaints concerning conduct of investigative officers\n\n46.\n\nAppointment of complaints panel\n\n47.\n\nDisposal of complaint without formal investigation\n\n48.\n\nFormal investigation of complaint\n\n\f6\n\n49.\n\nReview of complaints by panel\n\nPART IX\n\nMISCELLANEOUS\n\n50.\n\nCommissioner of Police to assist Commission etc.\n\n51.\n\nConfidentiality of information\n\n52.\n\nConflicts of interest\n\n53.\n\nProtection from suit\n\n54.\n\nOaths\n\n55.\n\nAmendment of Second and Third Schedules\n\n56.\n\nRegulations\n\n57.\n\nAlteration of Constitution\n\n58.\n\nCommencement\n\n\f7\n\nFIRST SCHEDULE\n\nINTEGRITY COMMISSION\n\nSECOND SCHEDULE\n\nSPECIFIED PERSONS IN PUBLIC LIFE\n\nTHIRD SCHEDULE\n\nFORMS FOR PARTS III, IV AND V\n\nFOURTH SCHEDULE\n\nCODE OF CONDUCT FOR PERSONS IN PUBLIC LIFE\n\nFIFTH SCHEDULE\n\nFORM OF OATHS\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to establish a regime, including an integrity commission, to promote\nthe  integrity  of  persons  in  public  life  and  strengthen  measures  for  the\nprevention, detection, investigation and prosecution of acts of corruption, alter\nthe Constitution to the extent necessary for the purpose and provide for related\nmatters.\n\nENACTED by the Parliament of Barbados in accordance with section 49 of\n\nthe Constitution as follows:\n\n\f10\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Integrity in Public Life Act, 2023.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Anti-Corruption  and  Anti-Terrorism  Agency”  means  the  body  corporate\nestablished by section 4 of the Anti-Corruption and Anti-Terrorism Agency\nAct, 2021 (Act 2021-5);\n\n“appointed day” means the day on which this Act comes into operation;\n\n“assets” means all property, including any right or interest in property, held by a\n\nperson in Barbados or elsewhere;\n\n“benefit” includes any property, service or advantage, whether direct or indirect;\n\n“Chairman” means the chairman of the Commission appointed in accordance\n\nwith the First Schedule;\n\n“child”, in relation to a person, means any child of the person and includes a\nstepchild and an adopted child and, in respect of a man, includes a child\n\n(a)\n\nin respect of whom the man has been adjudged the father by a court of\ncompetent jurisdiction; or\n\n(b)\n\nwho the man has acknowledged to be his child;\n\n“Code of Conduct” means the Code of Conduct for Persons in Public Life referred\n\nto in section 25;\n\n“Commission” means the Integrity Commission established by section 3;\n\n\f11\n\n“declaration” means a declaration filed or required to be filed pursuant to section\n11 and includes any statement or other information filed or required to be\nfiled with such a declaration;\n\n“dependent child” means any child of a person, whether a minor or not, who is\n\nunmarried and is being maintained by the person;\n\n“disclosure order” means an order made under section 42(1);\n\n“document” includes\n\n(a)\n\n(b)\n\n(c)\n\nanything on which there is writing;\n\na map, plan, drawing or photograph; and\n\nany  information  recorded  or  stored  by  means  of  any  tape  recorder,\ncomputer or other device, and any material subsequently derived from\nthe information so recorded or stored;\n\n“Head of Department” has the meaning assigned to it by section 2 of the Public\n\nService Act, Cap. 29;\n\n“income” includes\n\n(a)\n\n(b)\n\nmoney or money’s worth derived from whatever source or acquired in\nBarbados or elsewhere, whether directly or indirectly; and\n\nall receipts by way of salary, fees, wages, requisitions, profits, grants,\nemoluments, rents, interest, commissions, bonuses, pensions, annuities\nor benefits;\n\n“investigative officer” means a person designated as such under section 10(1);\n\n“liabilities” means all the obligations of a person to pay money or to provide\n\ngoods or services in Barbados or elsewhere;\n\n“member of the House of Assembly or the Senate”, as the case may be, shall be\nconstrued  to  include,  in  relation  to  any  period  between  a  dissolution  of\nParliament and the day on which the next election of members of the House\n\n\f12\n\nof Assembly is held, a person who was a member of the House of Assembly\nor the Senate, as the case may be, before the dissolution of Parliament;\n\n“Permanent Secretary” has the meaning assigned to it by section 2 of the Public\n\nService Act, Cap. 29;\n\n“person exercising public functions” means\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\na specified person in public life;\n\na public officer;\n\na member, chief executive officer, manager, director or employee of a\nstate-owned enterprise; and\n\nany other person who holds a legislative, executive, administrative or\njudicial office in the Government of Barbados, whether appointed or\nelected, permanent or temporary or paid or unpaid, except a person\nwho is appointed to an office listed in paragraph 1(a), (b) or (c) of Part\nII of the Second Schedule before the appointed day;\n\n“privileged material” means\n\n(a)\n\n(b)\n\ncommunications  between  an  attorney-at-law  and  his  client  or  any\nperson representing his client, made in connection with the giving of\nlegal advice to the client;\n\ncommunications  between  an  attorney-at-law  and  his  client  or  any\nperson representing his client, or between such an attorney-at-law or\nhis  client  or  any  such  representative  and  any  other  person,  made  in\nconnection with or in contemplation of legal proceedings and for the\npurposes of such proceedings; and\n\n(c)\n\nmaterials  enclosed  with  or  referred  to  in  such  communications  and\nmade\n\n(i)\n\nin connection with the giving of legal advice; or\n\n(ii)\n\nin connection with or in contemplation of legal proceedings and\nfor the purposes of such proceedings,\n\n\f13\n\nwhen the communications or materials are in the possession of a person who\nis entitled to such possession and are not held with the intention of furthering\na criminal purpose;\n\n“prohibited interest” means an interest in a contract with the Government or a\nstate-owned enterprise, the acquisition of which by a specified person in\npublic life is prohibited by rules made under section 22;\n\n“property” includes money and all other property whether real, personal or things\n\nin action;\n\n“public officer” has the meaning assigned to it by section 2 of the Public Service\n\nAct, Cap. 29;\n\n“senior  officer”,  in  relation  to  the  Commission,  means  an  employee  of  the\nCommission who is at or above the rank of Secretary to the Commission;\n\n“specified person in public life” means a person listed in Part I or Part II of the\n\nSecond Schedule;\n\n“spouse”, in relation to a specified person in public life, means a person\n\n(a)\n\n(b)\n\nto whom the specified person in public life is married; or\n\nwith whom the specified person in public life is in a union other than\nmarriage;\n\n“statement of registrable interests” means a statement described in section 18(1);\n\n“state-owned enterprise” means\n\n(a)\n\na company within the meaning of section 2(1) of the Companies Act,\nCap. 308; or\n\n(b)\n\na statutory board,\n\nlisted in Part III of the Second Schedule;\n\n“union other than marriage” has the meaning assigned to it by section 39 of the\n\nFamily Law Act, Cap. 214.\n\n\f14\n\nPART II\n\nINTEGRITY COMMISSION\n\nEstablishment of Integrity Commission\n\n3.(1)\nCommission.\n\nThere  is  established  a  body  corporate  to  be  known  as  the  Integrity\n\n(2)\n\nSection 21 of the Interpretation Act, Cap. 1 applies to the Commission.\n\nThe  First  Schedule  has  effect  with  respect  to  the  constitution  of  the\n\n(3)\nCommission and otherwise in relation thereto.\n\nThe members of the Commission are entitled to such remuneration and\n\n(4)\nallowances as the Minister responsible for Finance determines.\n\nSubject to this Act, the Commission may regulate its own procedure and\n\n(5)\nmay make rules for the purpose.\n\nFunctions of Commission\n\n4.(1)\n\nThe functions of the Commission are\n\n(a)\n\n(b)\n\nto receive, keep on record, examine and inquire into all declarations,\nstatements of registrable interests and reports of gifts filed with it under\nthis Act;\n\nto  request  such  information  and  conduct  such  investigations  and\ninquiries as may be necessary to verify or determine the accuracy of\nall such declarations, statements of registrable interests and reports of\ngifts;\n\n(c)\n\nto investigate, on its own initiative or upon receipt of a complaint\n\n(i)\n\n(ii)\n\nany alleged contravention of this Act or the Code of Conduct;\n\nany  acquisition  by  any  specified  person  in  public  life  of  a\nprohibited interest; and\n\n\f15\n\n(iii)\n\nany alleged offence under this Act or any other enactment that\nassigns  responsibility  for  the  investigation  of  offences  to  the\nCommission;\n\n(d)\n\nto  examine  the  practices  and  procedures  of  public  authorities  to\ndetermine whether such practices and procedures are likely to facilitate\nthe  occurrence  of  acts  of  corruption  and  to  recommend  appropriate\nchanges  in  such  practices  and  procedures,  except  where  there  is  a\nstatutory duty on any other person to perform such functions; and\n\n(e)\n\nto perform such other functions as may be required by this Act or any\nother enactment.\n\nIn the discharge of its functions, the Commission shall not be subject to\n\n(2)\nthe direction or control of any person or authority.\n\nThe President may in writing require the Commission to inquire into or\n\n(3)\ninvestigate any matter within the scope of its functions.\n\nConsultation\n\n5.\nfunctions, including in the conduct of an investigation or inquiry.\n\nThe Commission may consult with any person in the discharge of its\n\nAgreements and exchange of information with law enforcement\nagencies\n\nThe  Commission  may  enter\n\n6.(1)\ninto  such  written  agreements,\narrangements or memoranda of understanding with a law enforcement agency as\nthe  Commission  considers  necessary  or  desirable  for  the  discharge  of  its\nfunctions.\n\nThe  Commission  shall  be  treated  as  a  law  enforcement  agency  for  the\n(2)\npurpose of receiving disclosures of information which are relevant to its functions\nfrom any law enforcement agency.\n\nSubject to section 51, the Commission may disclose to a law enforcement\n\n(3)\nagency any information disclosed to the Commission.\n\n\f16\n\n(4)\nThe Financial Intelligence Unit referred to in section 9(1) of the Money\nLaundering  and  Financing  of  Terrorism  (Prevention  and  Control)  Act,  2011\n(Act 2011-23) and foreign financial intelligence units, by whatever name called,\nshall  be  treated  as  law  enforcement  agencies  for  the  purpose  of  this  section,\nregardless of whether they operate as enforcement or administrative entities.\n\nIn  this  section  “law  enforcement  agency”  includes  a  foreign  law\n\n(5)\nenforcement agency.\n\nFunds of Commission\n\n7.(1)\n\nThe Commission shall have such funds as may be voted by Parliament.\n\nThe  Commission  shall  keep  proper  accounts  of  its  receipts,  payments,\n(2)\nassets and liabilities and those accounts shall be audited annually by the Auditor-\nGeneral.\n\nAnnual reports\n\nThe Commission shall, before the commencement of each financial\n8.(1)\nyear, prepare and forward to the Prime Minister a report of its activities during\nthe  previous  financial  year,  including  a  statement  of  its  accounts  audited  in\naccordance with section 7(2).\n\nA copy of the report, together with the Auditor-General’s report, shall be\n\n(2)\nlaid in Parliament.\n\nStaff of Commission\n\n9.(1)\nThe  Commission  may  employ  such  staff  and  retain  the  services  of\nsuch persons as it requires for the discharge of its functions, on such terms and\nconditions as it determines appropriate.\n\nThe Statutory Boards (Pensions) Act, Cap. 384 applies to employees of the\n\n(2)\nCommission with such modifications and adaptations as may be necessary.\n\n\f17\n\nInvestigative officers\n\n10.(1)\nThe Commission may designate such staff as it determines appropriate\nas investigative officers and may issue to such officers an identification card,\nwhich shall be prima facie evidence of the designation of the officers.\n\nAn  investigative  officer  may  conduct  an  investigation  into  any  matter,\n(2)\nwhether or not involving an alleged offence, in respect of which the Commission\ndischarges functions under this Act or any other enactment.\n\nNotwithstanding subsections (1) and (2), the Commission may, where it\n(3)\nconsiders it appropriate to do so, require the Anti-Corruption and Anti-Terrorism\nAgency to conduct an investigation on its behalf.\n\nPART III\n\nDECLARATIONS\n\nDeclaration of financial affairs by specified persons in public life\n\n11.(1)\n\nA person who\n\n(a)\n\n(b)\n\n(c)\n\nis a specified person in public life shall, within 90 days of the appointed\nday and on or before the biennial anniversary of the appointed day;\n\nbecomes a specified person in public life shall, within 90 days from the\ndate on which he becomes a specified person in public life;\n\nceases to be a specified person in public life shall, within 90 days from\nthe date on which he ceases to be a specified person in public life,\n\nfile in accordance with subsection (3), a declaration containing the particulars set\nout in subsection (5).\n\nNotwithstanding subsection (1)(a), a person who files a declaration under\n(2)\nsubsection (1)(b) in a particular year is not required to file another declaration in\nthe same year.\n\n\f18\n\n(3)\n\nA specified person in public life whose office is listed in\n\n(a)\n\n(b)\n\nPart  I  of  the  Second  Schedule,  shall  file  his  declaration  with  the\nCommission;\n\nPart  II  of  the  Second  Schedule,  shall  file  his  declaration  with  the\nPresident.\n\nThe Commission may, in exceptional circumstances, grant to a specified\n(4)\nperson in public life required to file a declaration with it, an extension of the\nperiod for filing the declaration of up to 6 months, beginning on the day that the\ndeclaration is required to be filed.\n\nA declaration shall be in the Form 1 set out in the Third Schedule and shall\n\n(5)\ngive full, true and complete particulars of\n\n(a)\n\nthe income, assets and liabilities of the specified person in public life;\nand\n\n(b)\n\nthe income, assets and liabilities of his spouse and dependent children.\n\nA declaration may be accompanied, where a specified person in public life\n(6)\nso  desires,  by  a  statement  giving  details  of  his  income,  assets  and  liabilities\ncertified by an accountant.\n\nWhere a specified person in public life dies, there is no obligation on the\n(7)\npersonal representative of his estate to file the declaration which the specified\nperson in public life would have been required to file had he lived.\n\nFor the avoidance of doubt, this Part applies to a person who ceases to be\n(8)\na specified person in public life but is required to file a declaration pursuant to\nsubsection (1)(c) as it applies to any other specified person in public life.\n\nThe President has, in respect of a specified person in public life who is\n(9)\nrequired  to  file  a  declaration  with  him  and  any  declaration  so  filed,  the  same\nfunctions that the Commission has in this Act in respect of a specified person in\npublic life who is required to file a declaration with it and any declaration so filed.\n\n\f19\n\nFull disclosure\n\nA specified person in public life shall disclose in his declaration such\n12.\ndetails in respect of his income, assets and liabilities and those of his spouse and\ndependent children as, by the exercise of reasonable care, should be known to\nhim including\n\n(a)\n\n(b)\n\nany benefit accruing to his income and assets and those of his spouse\nand dependent children; and\n\nany  income,  assets  and  liabilities  acquired,  held  or  incurred  by  any\nother  person  as  agent  or  on  behalf  of  himself  and  his  spouse  and\ndependent children or any of them.\n\nTrust property\n\nWhere  a  specified  person  in  public  life  holds  any  money  or  other\n13.\nproperty in trust for a person who is not his spouse or child or another specified\nperson in public life, he shall so state in his declaration but he shall not be required\nto disclose the terms of the trust.\n\nBlind trusts\n\n14.(1)\nA specified person in public life may place all or part of his assets in\na blind trust for the purpose of this Act and upon doing so, where his office is\nlisted in\n\n(a)\n\n(b)\n\nPart I of the Second Schedule, he shall file a copy of the trust deed with\nthe Commission;\n\nPart II of the Second Schedule, he shall file a copy of the trust deed\nwith the President.\n\nWhere the Commission or the President, as the case may be, has reasonable\n(2)\ngrounds to believe that a specified person in public life who is required to file a\n\n\f20\n\ndeclaration is likely to contravene or has contravened the Code of Conduct, the\nCommission or the President may direct the person to\n\n(a)\n\nplace all or part of his assets in a blind trust on such terms and conditions\nas are considered appropriate; and\n\n(b)\n\nfile a copy of the trust deed in accordance with subsection (1).\n\nWhere a specified person in public life places assets in a blind trust, he\n(3)\nshall not be required to provide in his declaration more particulars of the assets\nthan the amount and description of the assets and the date on which they were\nplaced in the trust.\n\nNotwithstanding any other law relating to the duties of trustees, a qualified\n(4)\ntrust company which manages the assets of a specified person in public life by\nway of a blind trust shall reply fully to any inquiries of the Commission or the\nPresident, as the case may be, relating to the nature and management of the assets.\n\nA blind trust is created where a specified person in public life enters into\n\n(5)\nan agreement with a qualified trust company whereby\n\n(a)\n\n(b)\n\n(c)\n\nall or any part of his assets or those of his spouse or his children are\nconveyed  to  the  qualified  trust  company  for  the  management,\nadministration  and  control  thereof  in  its  absolute  discretion  without\nrecourse or report to the person beneficially entitled to the assets;\n\nincome derived from the management of the assets is to be distributed,\nin accordance with the agreement, to him, his spouse or his children\nuntil he ceases to be a specified person in public life; and\n\nafter he ceases to be a specified person in public life, proper and full\naccounting  is  to  be  made  to  him,  his  spouse  or  his  children  as  the\ncircumstances of the management of the trust require.\n\n\f21\n\n(6)\n\nFor the purpose of this section\n\n(a)\n\na trust company is a qualified trust company where\n\n(i)\n\n(ii)\n\nit  is  incorporated  in  or  outside  Barbados  and  is  carrying  on\nbusiness in Barbados;\n\nno more than 5 per cent of the stated capital in the trust company\nor  its  affiliate  is  held  or  controlled  by  the  specified  person  in\npublic life who enters into an agreement referred to in subsection\n(5) with it, or by any other person associated with him; and\n\n(iii)\n\nneither the specified person in public life nor his spouse nor any\nof his children hold any directorship or office in the trust company\nor its affiliate;\n\n(b)\n\na company is an affiliate of another company where it holds more than\n5 per cent of the stated capital in that other company or where that other\ncompany holds more than 5 per cent of the stated capital in the first\nmentioned company;\n\n(c)\n\na person is associated with another where that other person is\n\n(i)\n\n(ii)\n\n(iii)\n\nthe spouse or child of the person;\n\nthe  partner  of  the  person  in  a  profession,  trade  or  commercial\nundertaking; or\n\na  corporation,  and  the  first  mentioned  person  or  any  person\nmentioned  in  subparagraph  (i)  controls  the  corporation,  its\nholding corporation or a corporation affiliated with either.\n\nExamination of declarations\n\n15.(1)\nThe Commission shall examine every declaration it receives in order\nto determine whether the declaration is a complete and accurate statement of the\nfinancial affairs of the specified person in public life who filed it.\n\n\f22\n\n(2)\n\nWhere the Commission\n\n(a)\n\nis satisfied that the declaration\n\n(i)\n\nhas been fully made and all questions satisfactorily answered; or\n\n(ii)\n\nis  incomplete  but  the  specified  person  in  public  life  cannot\nreasonably obtain the information required to complete it,\n\nthe  Commission  shall  forward  to  the  specified  person  in  public  life  a\ncertificate of compliance in the Form 2 set out in the Third Schedule and, at\nthe request of the person, publish a statement regarding its satisfaction with\nthe declaration in the Official Gazette and in a daily newspaper in general\ncirculation in Barbados; or\n\n(b)\n\nis not satisfied with any aspect of the declaration, the Commission may\nreport the matter to the appropriate Service Commission, board or other\nauthority and to the Director of Public Prosecutions, setting out such\ndetails as it considers appropriate.\n\nPublication of failure to file declaration or furnish information\n\n16.(1)\nWhere  a  person  who  is  required  to  file  a  declaration  with  the\nCommission  in  accordance  with  this  Part  or  to  furnish  particulars  or  other\ninformation or documents to the Commission in accordance with section 31 fails\nto do so, the Commission shall\n\n(a)\n\n(b)\n\npublish that fact in the Official Gazette and in a daily newspaper in\ngeneral circulation in Barbados; and\n\nreport the matter to the appropriate Service Commission, board or other\nauthority and to the Director of Public Prosecutions, setting out such\ndetails as it considers appropriate.\n\nSubsection (1)(a) does not apply to a specified person in public life who\n\n(2)\nholds an office set out in Part II of the Second Schedule.\n\n\f23\n\nOffences in respect of declarations\n\n17.(1)\n\nA person who, without reasonable cause\n\n(a)\n\n(b)\n\nfails to file a declaration that he is required to file; or\n\nfails to comply with a direction given under section 14(2) within the\ntime specified therefor,\n\nis  guilty  of  an  offence  and  is  liable,  on  summary  conviction,  to  a  fine  of\n$50 000.\n\n(2)\n\nA person who\n\n(a)\n\n(b)\n\nknowingly files a declaration that is incomplete or false in any material\nparticular; or\n\nknowingly gives any false or incomplete information in a trust deed\nfiled under section 14,\n\nis guilty of an offence and is liable, on summary conviction, to a fine of $50 000\nor to imprisonment for one year or to both.\n\nWhere an offence referred to in subsection (1)(a) or (2)(a) involves the\n(3)\nnon-disclosure, by a specified person in public life, of property which should\nhave  been  disclosed  in  a  declaration,  the  magistrate  shall  order  the  specified\nperson in public life to make full disclosure of the property within a specified\nperiod.\n\nWhere a specified person in public life fails to comply with an order made\n(4)\nunder subsection (3) within the specified period, the offence shall be deemed to\nbe a continuing offence and the specified person in public life shall be liable to\na further fine of $3 000 for each day on which the offence continues.\n\n\f24\n\nPART IV\n\nREGISTRABLE AND PROHIBITED INTERESTS\n\nFiling of statements of registrable interests\n\nEvery member of the House of Assembly and of the Senate shall file\n18.(1)\nwith the Commission, in addition to his declaration, a statement that contains the\nfollowing information in respect of the member, his spouse and his children:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nparticulars  of  any  directorships  held  in  any  company  or  other  body\ncorporate;\n\nparticulars of any contract made with the Government or a state-owned\nenterprise;\n\nthe name and description of any company, partnership or association\nin which the person is an investor;\n\na concise description of any trust in respect of which the person is a\nbeneficiary or trustee;\n\n(e)\n\nany beneficial interest held in land;\n\n(f)\n\n(g)\n\nany fund to which the person contributes;\n\nparticulars of any political, trade or professional association to which\nthe person belongs;\n\n(h)\n\nparticulars of any sources of income; and\n\n(i)\n\nany  other  substantial  interest,  whether  of  a  pecuniary  nature  or  not,\nwhich the member considers may appear to raise a material conflict\nbetween his private interest and his public duty.\n\n\f25\n\n(2)\nEvery member of the House of Assembly and of the Senate shall file his\nstatement of registrable interests in the Form 3 set out in the Third Schedule within\n90 days after\n\n(a)\n\n(b)\n\nthe day on which he becomes a member, in respect of his interests on\nthe day on which he becomes a member; and\n\nthe 31st day of December in each year during any part of which he is a\nmember, in respect of his interests on the 31st day of December in that\nyear.\n\nNotwithstanding  subsection  (2)(b),  a  member  who  files  a  statement  of\n(3)\nregistrable interests in the period of 6 months preceding the 31st day of December\nin a particular year is not required to file another such statement for that same\nyear.\n\nWhere  a  member  dies,  the  personal  representative  of  his  estate  is  not\n(4)\nrequired to file the statement of registrable interests which the member would\nhave been required to file, had he lived.\n\nNothing in this section shall be taken to require disclosure of the actual\n\n(5)\namount or extent of any financial benefit, contribution or interest.\n\nThe Commission shall examine every statement of registrable interests it\n\n(6)\nreceives in order to determine whether it is complete and accurate.\n\nRecord of statements of registrable interests etc.\n\n19.(1)\nThe  Commission  shall  keep  a  record,  in  such  form  as  it  considers\nappropriate,  of  all  statements  of  registrable  interests  and  other  information\nfurnished by members of the House of Assembly and of the Senate under this\nPart.\n\nEvery member of the House of Assembly and of the Senate shall notify the\n(2)\nCommission of any change which occurs in his interests, or those of his spouse\nor children, within 6 weeks of the change.\n\n\f26\n\nOffences in respect of statements of registrable interests\n\n20.(1)\nA  member  of  the  House  of  Assembly  or  the  Senate  who,  without\nreasonable cause, fails to file a statement of registrable interests that he is required\nto file is guilty of an offence and is liable, on summary conviction, to a fine of\n$50 000.\n\nA member of the House of Assembly or the Senate who knowingly files\n(2)\nwith the Commission a statement of registrable interests that is incomplete or\nfalse in any material particular is guilty of an offence and is liable, on summary\nconviction, to a fine of $50 000 or to imprisonment for one year or to both.\n\nWhere an offence referred to in subsection (1) or (2) involves the non-\n(3)\ndisclosure, by a member of the House of Assembly or the Senate, of information\nwhich  should  have  been  disclosed  in  a  statement  of  registrable  interests,  the\nmagistrate  shall  order  the  member  to  make  full  disclosure  of  the  information\nwithin a specified period.\n\nWhere a member of the House of Assembly or the Senate fails to comply\n(4)\nwith an order made pursuant to subsection (3) within the specified period, the\noffence referred to in subsection (1) or (2) shall be deemed to be a continuing\noffence and the member shall be liable to a further fine of $3 000 for each day\non which the offence continues.\n\nDisqualification of member from holding public office\n\n21.\nA member of the House of Assembly or the Senate who is convicted\nof an offence under section 17 or 20 is liable, in addition to any other penalty\nprescribed by law, to be disqualified from holding any public office for a period\nof 10 years from the date of conviction for the offence.\n\nProhibited interests\n\n22.(1)\nThe Commission shall make rules prescribing the circumstances in\nwhich the acquisition by a specified person in public life of an interest in a contract\nwith the Government or a state-owned enterprise is prohibited.\n\n\f27\n\n(2)\nThe Commission shall not issue a determination that a specified person in\npublic  life  has  acquired  a  prohibited  interest  where  the  person  notifies  the\nCommission of the interest and the Commission is of the opinion that the interest\n\n(a)\n\n(b)\n\nis  unlikely  to  affect  the  person’s  obligations  under  the  Code  of\nConduct; or\n\nis likely to affect the person’s obligations under the Code of Conduct\nbut that the person, his spouse or child, as the case may be, has divested\nhimself of the interest or has placed it in a blind trust on such terms and\nconditions as the Commission considers appropriate.\n\nPART V\n\nGIFTS\n\nReports on gifts\n\nA  specified  person  in  public  life  listed  in  Part  I  of  the  Second\n23.(1)\nSchedule who receives a gift worth more than $2 500, or whose spouse or child\nreceives such a gift, shall make a report of that fact to the Commission in the\nForm 4 set out in the Third Schedule and shall state in the report\n\n(a)\n\n(b)\n\n(c)\n\nthe name and address of the donor;\n\nthe description and approximate value of the gift; and\n\nwhether, in the opinion of the recipient, the gift is a personal gift or an\nofficial gift.\n\nA specified person in public life listed in Part II of the Second Schedule\n(2)\nshall, in the circumstances described in subsection (1), make the report referred\nto in that subsection to the President.\n\nThis section does not apply to a personal gift received by a specified person\n\n(3)\nin public life from a relative or friend.\n\n\f28\n\n(4)\nA specified person in public life who is unsure whether a gift received from\na  relative  or  friend  is  a  personal  gift  or  an  official  gift  may  apply  to  the\nCommission seeking an opinion as to the proper classification of the gift.\n\nA specified person in public life shall make a report or an application under\n\n(5)\nsubsection (1), (2) or (4) within 30 days of the receipt of the gift.\n\nThe Commission shall determine whether the gift is a personal gift or an\n\n(6)\nofficial gift and such decision shall be final.\n\n(7)\n\nWhere the Commission finds that\n\n(a)\n\na gift was given to a specified person in public life personally and\n\n(i)\n\nwas trivial; or\n\n(ii)\n\nwas not trivial but was not intended to be a motive or reward for\ndoing or forbearing to do anything in the course of the discharge\nof his official functions or for causing any other person to do or\nforbear from doing anything,\n\nthe Commission shall allow the specified person in public life to retain the\ngift; or\n\n(b)\n\na gift was not of the kind described in paragraph (a), the Commission\nshall in writing direct the specified person in public life to deliver the\ngift  or  its  value  to  the  Minister  responsible  for  Finance  within  a\nspecified  period  not  exceeding  30  days,  and  the  specified  person  in\npublic life shall comply with the direction within the time so specified.\n\nNothing in this Part shall be taken to alter any law, rule or decision which\n(8)\nprohibits a particular specified person in public life or class of specified persons\nin public life from receiving gifts in the course of discharging official functions.\n\nThe President has, in respect of a specified person in public life who is\n(9)\nrequired to make a report to him under subsection (2) and any report so made,\nthe same functions that the Commission has in this Act in respect of a specified\nperson in public life who is required to make a report to it under subsection (1)\nand any report so made.\n\n\f29\n\n(10)\nThe Minister may by order subject to negative resolution prescribe, for the\npurposes of subsection (1), a monetary value other than the value specified in\nthat subsection.\n\nOffences in respect of gifts\n\n24.(1)\n\nA specified person in public life who, without reasonable excuse\n\n(a)\n\n(b)\n\nfails to comply with section 23(1) or (2), as the case may be; or\n\nfails to comply with a direction given under section 23(7),\n\nis guilty of an offence and is liable, on summary conviction, to a fine, which shall\nnot be more than three times the value of the gift involved in the commission of\nthe offence.\n\nA specified person in public life who knowingly makes a report pursuant\n(2)\nto section 23(1) or (2) that is incomplete or false in any material particular is\nguilty of an offence and is liable, on summary conviction, to a fine, which shall\nnot be more than three times the value of the gift involved in the commission of\nthe offence or to imprisonment for 6 months or to both.\n\nNo prosecution for an offence under subsection (1) shall be instituted after\n(3)\n5 years from the date when the person alleged to have committed the offence\nceased to be a specified person in public life.\n\nPART VI\n\nCONDUCT IN PUBLIC LIFE AND CONTRAVENTIONS OF ACT\n\nCode of Conduct\n\n25.(1)\nof Conduct for Persons in Public Life set out in the Fourth Schedule.\n\nEvery person exercising public functions shall comply with the Code\n\n\f30\n\n(2)\nThe Commission shall, where it has reasonable grounds to suspect or it\nreceives a complaint that the Code of Conduct has been contravened, inquire into\nand report on the matter.\n\n(3)\nWhere the Commission determines that a person has contravened the Code\nof Conduct, it may include in its report any recommendations as to punishment\nor disciplinary measures that it considers appropriate.\n\nSubsection (1) does not derogate from the obligations of a public officer\n(4)\nunder the Code of Conduct and Ethics established by section 11 of the Public\nService Act, Cap. 29.\n\nDuty to report contravention of Act\n\nA  person  exercising  public  functions  who  knows  or  suspects  that\n26.(1)\nanother person has been, is or is likely to be engaged in a contravention of the\nCode of Conduct shall report his knowledge or suspicion to the Commission in\nthe form of a complaint.\n\nA person who, without reasonable excuse, fails to report his knowledge or\n(2)\nsuspicion as required by subsection (1) is guilty of an offence and is liable, on\nconviction on indictment, to a fine of $50 000.\n\nComplaint to Commission regarding contravention of Act\n\n27.\nsection 26 shall state\n\nA  person  who  makes  a  complaint  to  the  Commission  pursuant  to\n\n(a)\n\n(b)\n\nthe particulars of the contravention;\n\nthe nature of the evidence that he proposes to produce in support of the\ncomplaint; and\n\n(c)\n\nsuch other particulars as may be prescribed.\n\nOral complaints to be put into writing\n\n28.\ninto writing by one of its employees.\n\nThe Commission shall ensure that any oral complaint it receives is put\n\n\f31\n\nExamination of complaints\n\n29.\n\nThe Commission may, upon examination of a complaint\n\n(a)\n\nreject the complaint where it considers that the complaint is frivolous\nor does not relate to a matter the Commission is empowered to address;\nor\n\n(b)\n\nconduct an inquiry into the complaint.\n\nOffences in respect of false complaints\n\nA  person  who  knowingly  makes  a  false  allegation  or  maliciously\n30.\nprovides false information related to a contravention of this Act is guilty of an\noffence and is liable\n\n(a)\n\n(b)\n\non summary conviction to a fine of $50 000 or to imprisonment for one\nyear or to both;\n\non conviction on indictment to a fine of $100 000 or to imprisonment\nfor 2 years or to both.\n\nPART VII\n\nPOWER TO REQUIRE FURTHER INFORMATION AND TO CONDUCT\nINQUIRIES\n\nGeneral powers of Commission to investigate or inquire\n\n31.(1)\nwhere it considers it necessary in order to determine whether\n\nThe  Commission  may  take  any  action  specified  in  subsection  (2)\n\n(a)\n\na  declaration  is  a  complete  and  accurate  statement  of  the  financial\naffairs of the specified person in public life who filed it;\n\n(b)\n\na statement of registrable interests is complete and accurate;\n\n\f32\n\n(c)\n\n(d)\n\n(e)\n\na specified person in public life has acquired a prohibited interest;\n\na gift given to a specified person in public life is a personal gift or an\nofficial gift;\n\na  person  exercising  public  functions  has  contravened  the  Code  of\nConduct; or\n\n(f)\n\na person has otherwise contravened this Act.\n\n(2)\n\nFor the purposes of subsection (1)(a) to (f), the Commission may\n\n(a)\n\n(b)\n\n(c)\n\nmake such independent inquiries as it considers appropriate;\n\nin writing request any specified person in public life or other person\nexercising public functions involved to furnish such further particulars\nor other information or documents as it considers appropriate; or\n\nconduct an inquiry and require the person involved to attend before it\nto answer any questions and to be heard on any matter relating to the\nsubject of the inquiry.\n\nA person who receives a request pursuant to subsection (1)(b) shall comply\n\n(3)\nwith the request within the time the Commission specifies.\n\nConduct of inquiries\n\n32.(1)\n\nThe Commission shall conduct inquiries in private.\n\nA person whose conduct is the subject of an inquiry or who is in any way\n\n(2)\nimplicated or concerned in a matter under inquiry\n\n(a)\n\nis entitled to be represented at the inquiry by an attorney-at-law or such\nother person as he chooses, and any other person who desires to be so\nrepresented may, by leave of the Commission, be represented in that\nmanner; and\n\n(b)\n\nmay require the Commission to summon witnesses in relation to the\ninquiry.\n\n\f33\n\n(3)\nThe Commission shall not take an adverse decision against a person whose\nconduct is the subject of an inquiry or who is in any way implicated or concerned\nin a matter under inquiry without giving the person an opportunity to be heard.\n\n(4)\nAn inquiry shall not be commenced after 5 years from the date on which\na person ceases to be a specified person in public life or other person exercising\npublic functions, as the case may be.\n\nCommission’s powers to summon and examine witnesses\n\nThe Commission shall, in respect of an inquiry, have the powers of a\n33.(1)\njudge of the Supreme Court to summon witnesses and to call for the production\nof documents.\n\n(2)\n\nA summons to attend an inquiry to give evidence or to produce documents\n\n(a)\n\nshall be\n\n(i)\n\n(ii)\n\n(iii)\n\nin such form as the Commission may determine;\n\nissued under the hand of the Chairman or another member of the\nCommission; and\n\nserved  on  a  person  by  handing  it  to  or  leaving  it  with  the\nperson, or in such other manner as the Commission may direct to\nensure that it is brought to the attention of the person; and\n\n(b)\n\nmay  be  served  by  a  person  authorized  by  the  Commission  for  the\npurpose.\n\n(3)\n\nThe Commission may\n\n(a)\n\nrequire that any facts, matters or things relating to the subject of an\ninquiry be verified or otherwise ascertained by the oral examination of\nwitnesses; and\n\n(b)\n\ncause any witnesses and parties concerned to be examined on oath.\n\nThe Chairman or the Secretary of the Commission may administer an oath\n\n(4)\nfor the purpose of subsection (3).\n\n\f34\n\n(5)\nThe Commission may, if it thinks fit, receive oral or written evidence but\nit is not bound by the rules of evidence in the Evidence Act, Cap. 121 and it may\ntake into account opinion evidence and such facts as it considers relevant and\nmaterial.\n\nDuty of witnesses summoned\n\nA  person  summoned  to  attend  to  give  evidence  or  to  produce\n34.(1)\ndocuments at any sitting of the Commission is bound to obey the summons served\nupon him as fully in all respects as witnesses are bound to obey subpoenas issued\nfrom the Supreme Court.\n\n(2)\n\nA person who\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nwithout sufficient cause, refuses or omits to attend at the time and place\nmentioned in the summons served on him;\n\nattends  but  leaves  the  Commission  without  the  permission  of  the\nCommission;\n\nwithout  sufficient  cause,  refuses  to  answer  or  to  answer  fully  and\nsatisfactorily to the best of his knowledge and belief all questions put\nto him by or with the concurrence of the Commission;\n\nwithout sufficient cause, refuses or omits to produce any document in\nhis possession or under his control and mentioned or referred to in the\nsummons served on him; or\n\n(e)\n\nat  any  sitting  of  the  Commission,  wilfully  insults  a  member  of  the\nCommission or the Secretary of the Commission,\n\nis guilty of an offence and is liable, on summary conviction, to a fine of $10 000\nor to imprisonment for 6 months or to both.\n\n(3)\n\nA person who gives evidence before the Commission shall\n\n(a)\n\nnotwithstanding  subsection  (2),  not  be  compellable  to  incriminate\nhimself; and\n\n\f35\n\n(b)\n\nin respect of any evidence given by him before the Commission, be\nentitled to all privileges to which a witness giving evidence before the\nSupreme Court is entitled in respect of evidence given by the witness\nbefore the court.\n\nWitness expenses\n\nA  person  summoned  to  attend  to  give  evidence  or  to  produce\n35.(1)\ndocuments at any sitting of the Commission shall, where the Commission allows\nhim expenses\n\n(a)\n\nbe entitled to the same expenses as if he had been summoned to attend\nthe Supreme Court on a criminal trial;\n\n(b)\n\nbe paid\n\n(i)\n\n(ii)\n\nat such time and in such manner as the Minister responsible for\nFinance may direct; and\n\nas far as possible, by the same procedure as that for the payment\nof witnesses before the Supreme Court.\n\nThe Commission may disallow the whole or any part of the expenses of a\n(2)\nperson referred to in subsection (1) in any case where the Commission thinks fit.\n\nMarshals to attend Commission\n\n36.\nassign marshals to\n\nThe Chief Marshal may, where required by the Commission to do so,\n\n(a)\n\n(b)\n\nattend proceedings of the Commission to preserve order;\n\nperform  such  other  duties  as  usually  pertain  to  their  office  when  in\nattendance upon the Supreme Court;\n\n(c)\n\nserve summonses on witnesses; and\n\n(d)\n\nperform such other duties as the Commission may direct.\n\n\f36\n\nInquiry reports etc.\n\n37.(1)\nThe  Commission  shall  prepare  a  written  report  of  its  findings  and\ndeterminations in respect of each inquiry it conducts and send a copy of the report,\ntogether with copies of any complaint and material documents submitted during\nthe inquiry\n\n(a)\n\n(b)\n\nto the person whose conduct was the subject of the inquiry; and\n\nwhere that person is,\n\n(i)\n\n(ii)\n\na public officer, to the Head of the Public Service, the appropriate\nService Commission and the President;\n\na  member  of  the  House  of  Assembly  or  the  Senate,  to  the\nPresident  and  the  Speaker  of  the  House  of  Assembly  or  the\nPresident of the Senate, as the case may be;\n\n(iii)\n\nthe Head of the Public Service, to the President; and\n\n(iv)\n\nconcerned with any state-owned enterprise, to the state-owned\nenterprise and the Minister with responsibility for the enterprise;\nand\n\n(c)\n\nto  the  Director  of  Public  Prosecutions,  where  the  Commission\nconsiders that an offence may have been committed.\n\nWhere  a  person  is  exonerated  following  an  inquiry  into  an  alleged\n\n(2)\ncontravention of this Act, the Commission shall\n\n(a)\n\n(b)\n\nin writing inform the person who made the complaint and the person\nalleged to have contravened this Act of the finding of the inquiry; and\n\nat  the  request  of  the  person  whose  conduct  was  the  subject  of  the\ncomplaint, publish the finding of the inquiry in the Official Gazette and\nin a daily newspaper in general circulation in Barbados.\n\n\f37\n\nAction by Director of Public Prosecutions\n\n38.(1)\nThe Director of Public Prosecutions shall, as soon as practicable after\nreceiving any complaint, report or other document pursuant to this Act, in any\ncase in which he considers that a person ought to be prosecuted for an offence,\ninstitute and undertake criminal proceedings against the person and inform\n\n(a)\n\n(b)\n\n(c)\n\nthe  Commission  of  any  action  taken  following  the  receipt  of  the\ninformation;\n\nthe appropriate Service Commission, where the complaint relates to a\npublic officer; and\n\nthe appropriate board or other authority with which the person alleged\nto have contravened this Act is employed or in respect of which he is\na member.\n\nWhere criminal proceedings are commenced against a person exercising\n(2)\npublic  functions,  no  disciplinary  procedures  shall  be  instituted  pending  the\ndetermination of the criminal proceedings.\n\nThe Director of Public Prosecutions may authorize any person having an\n(3)\nofficial duty under this Act to furnish information to any officer of the court or\nmember  of  the  Police  Force  or  any  other  person  the  Director  of  Public\nProsecutions specifies.\n\nOffences in respect of requests for information and inquiries\n\n39.(1)\n\nA person exercising public functions who, without reasonable cause\n\n(a)\n\nfails to comply with a request made under section 31(2)(b) within the\ntime specified therefor; or\n\n(b)\n\nfails to attend an inquiry when summoned to do so,\n\nis guilty of an offence and is liable, on summary conviction, to a fine of $50 000.\n\n\f38\n\n(2)\n\nA person exercising public functions who\n\n(a)\n\nknowingly  gives  any  false  or  incomplete  information  pursuant  to  a\nrequest made under section 31(2)(b); or\n\n(b)\n\nknowingly gives false or incomplete information at an inquiry,\n\nis guilty of an offence and is liable, on summary conviction, to a fine of $50 000\nor to imprisonment for one year or to both.\n\nPresident to appoint tribunal to perform functions\n\nThe President shall appoint a tribunal consisting of a Chairman and\n40.(1)\nnot less than two other members to discharge the functions of the President under\nthis Act other than a function under paragraph 1, 5, 6 or 7 of the First Schedule.\n\nThe  members  of  the  tribunal  shall  be  selected  by  the  President,  after\n(2)\nconsultation with the Prime Minister, the Leader of the Opposition and the Chief\nJustice, from among persons who have held office as a judge of a court having\nunlimited  jurisdiction  in  civil  and  criminal  matters  in  some  part  of  the\nCommonwealth or a court having jurisdiction in appeals from any such court.\n\nWithout prejudice to the generality of sections 11(9) and 23(9), sections\n(3)\n11(4), 14(2) and (4), 15, 16, 22, 23(4) to (7), 25(2) and (3), 26, 28, 29 and 31 to\n38 apply to the President and a specified person in public life required to file a\ndeclaration with him or to make a report to him under section 11(3)(b) or 23(2),\nwith such modifications and adaptations as may be necessary, as those sections\napply  to  the  Commission  and  other  specified  persons  in  public  life,  and  the\nPresident has the same functions as the Commission in those sections.\n\nSections 51, 52 and 53 apply to the members of the tribunal appointed by\n(4)\nthe President under this section as those sections apply to the Commission and\nmembers of the Commission.\n\n\f39\n\nPART VIII\n\nINVESTIGATIONS\n\nPowers of Investigative Officers\n\nPower of arrest\n\nAn investigative officer has, in carrying out his functions, the powers\n41.(1)\nof a constable to arrest any person whom he reasonably suspects has committed\nan offence punishable by imprisonment under this Act or any other enactment\nthat assigns responsibility for investigations to the Commission.\n\nAn investigative officer shall, after making an arrest, deliver the person\n(2)\narrested to the custody of a member of the Police Force who shall immediately\nbring the person before a magistrate.\n\nDisclosure orders\n\nWhere on an application made by an investigative officer, a Judge in\n42.(1)\nChambers is satisfied that each of the requirements set out in subsection (3) is\nfulfilled, the judge may make an order authorizing the officer to give to any person\nthe  officer  considers  has  relevant  information,  notice  in  writing  requiring  the\nperson, with respect to any matter relevant to the investigation for the purposes\nof which the order is sought, to\n\n(a)\n\n(b)\n\n(c)\n\nanswer any question, either at a time and place specified in the notice\nor at once;\n\nprovide  any  information  specified  in  the  notice,  by  a  time  and  in  a\nmanner so specified;\n\nproduce any document specified or described in the notice, either by a\ntime and in a manner so specified or at once.\n\nAn application for a disclosure order shall be made without notice and shall\n(2)\nstate that a person specified in the application is subject to an investigation under\n\n\f40\n\nthis Act or any other enactment that assigns responsibility for investigations to\nthe Commission.\n\nThe requirements referred to in subsection (1) are that there are reasonable\n\n(3)\ngrounds for\n\n(a)\n\nsuspecting that the person specified in the application has committed\nan  offence  under  this  Act  or  any  other  enactment  that  assigns\nresponsibility for the investigation of offences to the Commission; and\n\n(b)\n\nbelieving that\n\n(i)\n\n(ii)\n\ninformation which may be provided in compliance with the order\nis likely to be of substantial value, whether or not by itself, to the\ninvestigation for the purposes of which the order is sought; and\n\nit is in the public interest for the information to be provided, having\nregard  to  the  benefit  likely  to  accrue  to  the  investigation  if  the\ninformation is obtained.\n\nA person is not bound to comply with a requirement imposed by a notice\n(4)\ngiven under a disclosure order unless evidence of authority to give the notice is\nproduced to him.\n\n(5)\n\nA person who\n\n(a)\n\n(b)\n\nwithout reasonable excuse, fails to comply with a requirement imposed\non him under a disclosure order; or\n\nin purported compliance with a requirement imposed on him under a\ndisclosure order\n\n(i)\n\n(ii)\n\nmakes a statement which he knows to be false or misleading in a\nmaterial particular; or\n\nrecklessly  makes  a  statement  which  is  false  or  misleading  in  a\nmaterial particular,\n\nis guilty of an offence.\n\n\f41\n\nAn offence under subsection (5) is punishable upon summary conviction\n\n(6)\nby\n\n(a)\n\na  fine  of  $10  000  or  imprisonment  for  2  years  or  both,  where  the\noffender is an individual;\n\n(b)\n\na fine of $50 000, where the offender is a body corporate.\n\nSubject to subsection (8), a statement made by a person in response to a\n(7)\nrequirement imposed by a disclosure order may not be used in evidence against\nthe person in criminal proceedings.\n\n(8)\n\nSubsection (7) does not apply in the case of\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nproceedings for contempt of court;\n\na prosecution for an offence under subsection (6);\n\na prosecution for an offence under the Perjury Act, Cap. 142; or\n\na prosecution for another offence where, in giving evidence, the person\nmakes  a  statement  inconsistent  with  the  statement  mentioned  in\nsubsection (7).\n\nA statement may not be used by virtue of subsection (8)(d) against a person\n\n(9)\nunless\n\n(a)\n\n(b)\n\nevidence relating to it is adduced; or\n\na question relating to it is asked,\n\nby or on behalf of the person in the proceedings arising out of the prosecution.\n\nA  disclosure  order  has  effect  notwithstanding  any  obligation  as  to\n(10)\nconfidentiality  or  any  other  restriction  upon  the  disclosure  of  information\nimposed by any enactment, rule of law or otherwise.\n\nFor the purposes of subsection (1), “relevant information” is information,\n(11)\nwhether or not contained in a document, which the investigative officer considers\nto be relevant to the investigation.\n\n\f42\n\n(12)\nSections 145 and 148 of the Proceeds and Instrumentalities of Crime Act,\n2019 (Act 2019-17) apply in respect of a disclosure order made under this section\nas those sections apply to a disclosure order made under that Act and for the\npurpose of this Act any reference in section 145 of that Act to a police officer\nshall be construed to include an investigative officer.\n\nSearch and seizure warrants\n\n43.(1)\nWhere on an application made by an investigative officer, a Judge in\nChambers is satisfied of the circumstances set out in subsection (3), the judge\nmay issue a warrant authorizing the officer to\n\n(a)\n\n(b)\n\nenter  and  search  the  premises  specified  in  the  application  for  the\nwarrant; and\n\nseize and retain any material found on the premises which is likely to\nbe of substantial value, whether or not by itself, to the investigation for\nthe purposes of which the application is made.\n\n(2)\n\nAn application for a search and seizure warrant shall\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nspecify the person subject to investigation;\n\nstate that the warrant is sought for the purposes of the investigation;\n\nspecify the premises in respect of which the warrant is sought; and\n\nspecify the material in respect of which the warrant is sought or, where\nthe material cannot be identified at the time of the application, state\nthat there are reasonable grounds for believing that there is material on\nthe premises that\n\n(i)\n\nrelates to the person specified in the application or the question\nwhether that person has committed an offence under this Act or\nany  other  enactment\nthe\ninvestigation of offences to the Commission; and\n\nthat  assigns  responsibility  for\n\n(ii)\n\nis likely to be of substantial value, whether or not by itself, to the\ninvestigation for the purposes of which the warrant is sought.\n\n\f(3)\n\nThe circumstances referred to in subsection (1) are that\n\n43\n\n(a)\n\n(b)\n\na disclosure order in relation to material has not been complied with\nand there are reasonable grounds for believing that the material is on\nthe premises specified in the application for the warrant; or\n\nthere are reasonable grounds for suspecting that the person specified\nin the application for the warrant has committed an offence under this\nAct or any other enactment that assigns responsibility for investigations\nto the Commission and\n\n(i)\n\nthe conditions specified in subsection (4) are fulfilled; or\n\n(ii)\n\nthe conditions specified in subsection (5) are fulfilled.\n\n(4)\n\nThe conditions referred to in subsection (3)(b)(i) are that\n\n(a)\n\nthere are reasonable grounds for believing that\n\n(i)\n\nany material on the premises specified in the application for the\nwarrant is likely to be of substantial value, whether or not by itself,\nto the investigation for the purposes of which the warrant is sought;\nand\n\n(ii)\n\nit is in the public interest for the material to be obtained, having\nregard  to  the  benefit  likely  to  accrue  to  the  investigation  if  the\nmaterial is obtained; and\n\n(b)\n\nit would not be appropriate to make a disclosure order because\n\n(i)\n\n(ii)\n\n(iii)\n\nit  is  not  practicable  to  communicate  with  any  person  against\nwhom the disclosure order could be made;\n\nit is not practicable to communicate with any person who would\nbe required to comply with an order to grant entry to the premises;\nor\n\nthe  investigation  might  be  seriously  prejudiced  unless  an\ninvestigative  officer  is  able  to  secure  immediate  access  to  the\nmaterial.\n\n\f44\n\n(5)\n\nThe conditions referred to in subsection (3)(b)(ii) are that\n\n(a)\n\nthere are reasonable grounds for believing where the material cannot\nbe identified at the time of the application, that there is material on the\npremises specified in the application for the warrant that\n\n(i)\n\nrelates to the person specified in the application or the question\nwhether he has committed an offence under this Act or any other\nenactment  that  assigns  responsibility  for  investigations  to  the\nCommission; and\n\n(ii)\n\nis likely to be of substantial value, whether or not by itself, to the\ninvestigation for the purposes of which the warrant is sought; and\n\n(b)\n\nthere are reasonable grounds for believing that it is in the public interest\nfor the material to be obtained, having regard to the benefit likely to\naccrue to the investigation if the material is obtained; and\n\n(c)\n\none of the following applies:\n\n(i)\n\n(ii)\n\n(iii)\n\nit  is  not  practicable  to  communicate  with  any  person  against\nwhom a disclosure order could be made;\n\nentry  to  the  premises  will  not  be  granted  unless  a  warrant  is\nproduced; or\n\nthe  investigation  might  be  seriously  prejudiced  unless  an\ninvestigative  officer  arriving  at  the  premises  is  able  to  secure\nimmediate entry to them.\n\nA search and seizure warrant does not confer the right to seize privileged\n\n(6)\nmaterial.\n\nObstruction of investigative officer\n\nA  person  who  resists  or  obstructs  an  investigative  officer  in  the\n44.\nexecution of his duty is guilty of an offence and is liable, on summary conviction,\nto a fine of $10 000 or to imprisonment for 6 months or to both.\n\n\f45\n\nComplaints regarding Investigative Officers\n\nComplaints concerning conduct of investigative officers\n\n45.(1)\nA person may address a complaint in writing to the Commission in\nrespect of the conduct of an investigative officer in the discharge of the officer’s\nfunctions where the person\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nhas been personally affected by the conduct;\n\nhas witnessed the conduct;\n\nhas a substantial and direct interest in the complaint; or\n\nhas been authorized by a person described in paragraph (a), (b) or (c)\nto make a complaint in that person’s name.\n\nThe Commission shall refer a complaint made under subsection (1) to a\n\n(2)\npanel appointed under section 46.\n\nAppointment of complaints panel\n\n46.\n\nThe President may appoint an ad hoc panel consisting of\n\n(a)\n\na judge or magistrate or a retired judge or magistrate, who shall be the\nchairman;\n\n(b)\n\nthe Commissioner of Police, who shall hold office ex officio; and\n\n(c)\n\na person, other than a member or former member of the Police Force,\nto represent the public,\n\nto hear and adjudicate a complaint made under section 45.\n\nDisposal of complaint without formal investigation\n\n47.(1)\nof a complaint be carried out where in its opinion\n\nA panel appointed under section 46 may direct that no investigation\n\n(a)\n\nthe complaint is trivial, frivolous, vexatious or made in bad faith; or\n\n\f46\n\n(b)\n\nhaving  regard  to  all  the  circumstances,  an  investigation  or  further\ninvestigation is not necessary or reasonably practicable.\n\nWhere  no  direction  is  given  under  subsection  (1),  the  panel  and  the\n\n(2)\nCommission shall\n\n(a)\n\n(b)\n\nconsider whether the complaint can be disposed of informally; and\n\nwith the consent of the complainant and the investigative officer whose\nconduct is the subject matter of the complaint, attempt to dispose of\nthe complaint informally rather than through a formal investigation.\n\nWhere a complaint is disposed of informally, the panel shall prepare and\n(3)\nsend the following documents to the complainant, the investigative officer and\nthe Commission:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nan overview of the facts that gave rise to the complaint;\n\nthe name of the person who conducted the informal disposition;\n\na statement of the manner in which the complaint was disposed of; and\n\nevidence  of  agreement  to  the  disposition  of  the  complaint  by  the\ncomplainant and the investigative officer.\n\nFormal investigation of complaint\n\n48.(1)\nWhere  a  complaint  is  not  disposed  of  informally,  the  Commission\nshall investigate the matter and send a complaint resolution report to the panel,\nthe complainant and the investigative officer whose conduct is the subject matter\nof the complaint.\n\n(2)\n\nThe complaint resolution report shall contain\n\n(a)\n\n(b)\n\n(c)\n\na summary of the complaint;\n\nthe results of the investigation;\n\na summary of any action that has been or will be taken with respect to\nresolution of the complaint; and\n\n\f47\n\n(d)\n\na statement that the complainant may refer the complaint to the panel\nfor review within 28 days of the receipt of the complaint resolution\nreport where he is not satisfied with the disposition of the complaint\nby the Commission.\n\nA complainant who is not satisfied with a direction given under section\n(3)\n47(1)  or  with  the  disposition  of  his  complaint  by  the  Commission  under\nsubsection (1), may refer the complaint to the panel in writing within 28 days\nafter  the  date  on  which  he  receives  notice  of  the  direction  or  the  complaint\nresolution report; and the panel shall review every complaint so referred.\n\nReview of complaints by panel\n\n49.(1)\n\nWhere, after reviewing a complaint, the panel\n\n(a)\n\nis satisfied with the disposition of the complaint by the Commission,\nthe panel shall send to\n\n(i)\n\n(ii)\n\nthe Commission, a complaint review report to that effect setting\nout  such  findings  and  recommendations  with  respect  to  the\ncomplaint as the panel sees fit; and\n\nthe complainant and the investigative officer whose conduct is the\nsubject matter of the complaint, a report of the conclusion of the\nreview together with any finding or recommendation referred to\nin subparagraph (i); or\n\n(b)\n\nis not satisfied with the disposition of the complaint by the Commission\nor considers that further inquiry is warranted, the panel may take any\nor all of the following measures:\n\n(i)\n\n(ii)\n\nsend a report to the Commission indicating the reasons for its\ndissatisfaction;\n\nrequest the Commission to conduct a further investigation into\nthe complaint;\n\n(iii)\n\nmake such inquiries as it deems necessary in the circumstances;\n\n\f48\n\n(iv)\n\ninvestigate the complaint further;\n\n(v)\n\ninstitute a hearing to inquire into the complaint.\n\nThe  panel  shall,  on  completion  of  any  further  investigation,  inquiry  or\n\n(2)\nhearing that it orders under subsection (1)(b) send to\n\n(a)\n\nthe Commission, a complaint review report setting out\n\n(i)\n\n(ii)\n\nsuch findings with respect to the complaint as the panel sees fit;\nand\n\nsuch recommendations, including any disciplinary measures to be\ntaken with regard to the investigative officer, as the panel sees fit;\nand\n\n(b)\n\nthe complainant and the investigative officer, a report of the conclusion\nof the review, together with any finding or recommendation referred\nto in paragraph (a).\n\nThe Commission shall give effect to any recommendations in a complaint\n\n(3)\nreview report sent to it.\n\nPART IX\n\nMISCELLANEOUS\n\nCommissioner of Police to assist Commission etc.\n\n50.\nassistance as it requests in connection with the discharge of its functions.\n\nThe Commissioner of Police shall provide to the Commission such\n\nConfidentiality of information\n\n51.(1)\nAny  information  received  by  any  member  or  employee  of  the\nCommission  in  the  discharge  of  the  functions  of  such  person  under  this  Act\nincluding  information  contained  in  any  document  received  by  that  person  by\nvirtue of this Act shall not be divulged by any such member or employee except\n\n\f49\n\nwhere the information is required to be produced for the purpose of complying\nwith any other enactment or an order of any court or for the purpose of prosecution\nfor an offence.\n\nA person who contravenes subsection (1) is guilty of an offence and is\n(2)\nliable, on conviction on indictment, to a fine of $100 000 or to imprisonment for\n2 years.\n\nA  person  who  receives  any  information  or  anything  contained  in  any\n(3)\ndocument described in subsection (1), knowing or having reasonable ground to\nbelieve  at  the  time  when  he  receives  it  that  it  is  communicated  to  him  in\ncontravention of this section, unless he proves that the communication to him of\nthe  information  or  anything  contained  in  such  document  was  contrary  to  his\ndesire, is guilty of an offence and is liable, on conviction on indictment, to a fine\nof $100 000 or to imprisonment for 2 years.\n\nEvery  member  of  the  Commission  and  every  person  performing  any\n(4)\nfunction in the service of or as an employee of the Commission shall treat all\nrecords, and information relating to declarations, as secret and confidential and\nshall  not  disclose  or  communicate  the  text  of  any  record,  information  or\ndeclaration to any unauthorized person or allow any unauthorized person to have\naccess to any records, information or declarations.\n\nA person who contravenes subsection (4) is guilty of an offence and is\n(5)\nliable, on conviction on indictment, to a fine of $100 000 or to imprisonment for\n2 years or to both.\n\nConflicts of interest\n\n52.(1)\nWhere a member of the Commission is interested in a matter before\nthe  Commission  or  in  a  person  who  is  a  party  to  proceedings  before  the\nCommission, the member so interested shall disclose the nature of his interest to\nthe Commission and shall not participate in its sittings in relation to the matter\nor person.\n\nWhere, in the opinion of the Commission, a member of the Commission\n(2)\nis interested in a matter before the Commission or in a person who is a party to\n\n\f50\n\nproceedings before the Commission, the Commission shall direct the member\nnot to participate in the sittings of the Commission in relation to the matter or\nperson.\n\nProtection from suit\n\nNo  member  or  employee  of  the  Commission  shall  be  liable  to  any\n53.\naction or suit for any matter or thing done by him in good faith as a member or\nemployee of the Commission or in the exercise of his functions or the course of\nhis employment, as the case may be.\n\nOaths\n\nEvery member of the Commission and every person appointed as a\n54.(1)\nmember of a tribunal by the President under this Act shall, before assuming the\nfunctions of his office, take before the President the applicable oath of office and\noath of secrecy in the forms set out in Parts I and III, respectively, of the Fifth\nSchedule.\n\nEvery person performing functions in the service of or as an employee of\n(2)\nthe Commission shall, before assuming the functions of his office, take before\nthe  Chairman,  or  in  his  absence,  another  member  of  the  Commission,  the\napplicable oath of office and oath of secrecy set out in the forms in Part II of the\nFifth Schedule.\n\nAmendment of Second and Third Schedules\n\n55.\n\nThe Minister may by order\n\n(a)\n\n(b)\n\namend Part III of the Second Schedule;\n\nafter consultation with the Commission, amend the Third Schedule.\n\n\f51\n\nRegulations\n\n56.\nAct and, in particular, for any matter\n\nThe Minister may make Regulations generally for giving effect to this\n\n(a)\n\n(b)\n\nrequired to be prescribed by this Act; and\n\nrelated to any report, investigation or inquiry under this Act.\n\nAlteration of Constitution\n\n57.\nextent necessary to give effect to this Act.\n\nChapter VII and section 112 of the Constitution are amended to the\n\nCommencement\n\n58.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  day  to  be  fixed  by\n\n\f52\n\nFIRST SCHEDULE\n\nINTEGRITY COMMISSION\n\n(Sections 2, 3 and 40)\n\nMembers of Commission\n\n1.\n\nThe Commission shall consist of\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\na Chairman who shall be a person who has held office as a judge of a\ncourt  having  unlimited  jurisdiction  in  civil  and  criminal  matters  in\nsome  part  of  the  Commonwealth  or  a  court  having  jurisdiction  in\nappeals  from  any  such  court,  appointed  by  the  President  after\nconsultation with the Prime Minister and the Leader of the Opposition;\n\nan attorney-at-law with at least 10 years’ standing whose name appears\non the Roll of Attorneys-at-law pursuant to the Legal Profession Act,\nCap.  370A,  appointed  by  the  President  after  consultation  with  the\nCouncil of the Barbados Bar Association;\n\na  chartered  or  certified  accountant  of  at  least  7  years’  standing\nappointed by the President after consultation with any body which, in\nhis opinion, represents chartered or certified accountants in Barbados;\n\na member of the clergy appointed by the President after consultation\nwith the Prime Minister and the Leader of the Opposition;\n\na person appointed by the President on the advice of the Prime Minister;\nand\n\na person appointed by the President on the advice of the Leader of the\nOpposition.\n\nDisqualification from membership\n\n2.\n\nA person who\n\n(a)\n\nis a member of the House of Assembly or the Senate;\n\n\f53\n\n(b)\n\n(c)\n\n(d)\n\nwould  be  disqualified  in  accordance  with  section  38  or  44  of  the\nConstitution from being a member of the House of Assembly or the\nSenate;\n\nhas, at any time during the period of 5 years preceding the proposed\ndate of his appointment, held office in a political party; or\n\nhas, at any time during the period of 3 years preceding the proposed\ndate of his appointment, been a public officer,\n\nis not qualified to be appointed as a member of the Commission.\n\nTenure of office\n\n3.\n\nA member of the Commission shall\n\n(a)\n\n(b)\n\n(c)\n\nbe appointed by instrument in writing;\n\nsubject to paragraphs 2, 5 and 6, hold office for a period of 3 years; and\n\nbe eligible for re-appointment.\n\nChairman\n\n4.(1)\nwhich he is present.\n\nThe  Chairman  shall  preside  at  all  meetings  of  the  Commission  at\n\nWhere the Chairman is absent from any meeting, the members present and\n\n(2)\nforming a quorum shall elect one among them to preside at the meeting.\n\nVacancy in membership of Commission\n\n5.(1)\n\nThe office of a member of the Commission shall become vacant\n\n(a)\n\n(b)\n\nat the expiration of the term specified in the member’s instrument of\nappointment;\n\nwhere he notifies the President in writing of his intention to resign his\noffice;  and  the  resignation  shall  take  effect  when  the  letter  of\nresignation is received by the President;\n\n\f54\n\n(c)\n\n(d)\n\non the death, retirement or removal of the member; or\n\non  the  absence  of  the  member  from  3  consecutive  meetings  of  the\nCommission, unless such absence is approved by the President.\n\n(2)\nWhere  any  vacancy  occurs  in  the  membership  of  the  Commission,  the\nvacancy shall be filled by the appointment of another person from the categories\nof persons in paragraph 1.\n\nRemoval of member\n\nA member of the Commission may be removed from office by the\n6.(1)\nPresident for inability to discharge the functions of his office, whether arising\nfrom infirmity of mind or body or any other cause, or for misbehaviour, and shall\nnot be removed except in accordance with this paragraph.\n\nA  member  shall  be  removed  from  office  by  the  President  where  the\n(2)\nquestion of his removal is referred to a tribunal appointed under subparagraph\n(3)  and  the  tribunal  recommends  to  the  President  that  the  member  should  be\nremoved for inability to discharge the functions of his office or for misbehaviour.\n\nWhere the President, after consultation with the Prime Minister and the\n(3)\nLeader  of  the  Opposition,  considers  that  the  question  of  removing  a  member\nought to be investigated, the President shall appoint a tribunal to inquire into the\nmatter, report on the facts thereof to him and recommend to him whether the\nmember should be removed.\n\n(4)\n\nThe tribunal referred to in subparagraph (3) shall consist of\n\n(a)\n\n(b)\n\na judge of the Supreme Court;\n\nan attorney-at-law with at least 10 years’ standing whose name appears\non the Roll of Attorneys-at-law pursuant to the Legal Profession Act,\nCap. 370A; and\n\n(c)\n\none other person of high integrity and appropriate qualifications.\n\nThe tribunal shall give the member an opportunity to be heard as to why\n\n(5)\nhe should not be removed.\n\n\f55\n\n(6)\nWhere the question of removing a member is referred to a tribunal, the\nPresident,  after  consultation  with  the  Prime  Minister  and  the  Leader  of  the\nOpposition, may suspend the member from the exercise of the functions of his\noffice.\n\nA suspension may at any time be revoked by the President and shall in any\n(7)\ncase cease to have effect where the tribunal recommends to the President that the\nmember should not be removed.\n\nProceedings and meetings\n\n7.(1)\nas it considers necessary or desirable for the discharge of its functions.\n\nSubject to subparagraph (4), the Commission shall meet at such times\n\n(2)\n\nFour members form a quorum of the Commission.\n\nThe proceedings of the Commission shall not be affected by a vacancy\n\n(3)\namong its members or a defect in the appointment of a member.\n\nThe President may in writing request the Commission to meet at such times\n\n(4)\nas he thinks fit.\n\nSecretary to the Commission\n\n8.(1)\n\nThere shall be a Secretary to the Commission.\n\n(2)\n\nThe Secretary shall\n\n(a)\n\n(b)\n\n(c)\n\nattend the meetings of the Commission;.\n\nrecord  the  proceedings  of  the  Commission  and  keep  the  minutes  of\neach meeting in proper form; and\n\ngenerally  perform  such  duties  connected  with  the  work  of  the\nCommission as the Commission may require.\n\nPublication in the Official Gazette\n\n9.\nof a member of the Commission shall be published in the Official Gazette.\n\nThe appointment, resignation and revocation of appointment or death\n\n\f56\n\nSECOND SCHEDULE\n\nSPECIFIED PERSONS IN PUBLIC LIFE\n\n(Sections 2, 11, 14, 16, 23 and 55)\n\nPART I\n\nMembers of the House of Assembly and the Senate\n\nMembers of the Cabinet\n\nPermanent Secretaries\n\n1.\n\n2.\n\n3.\n\n4.\noffices in the same grade as that of such Heads of Department\n\nHeads of Departments within the Public Service and holders of public\n\n5.\n\nChairpersons of the state-owned enterprises listed in Part III\n\n6.\nheads of the state-owned enterprises listed in Part III\n\nChief  Executive  Officers,  General  Managers  and  other  executive\n\n7.\n\n8.\n\n1.\nday:\n\nMagistrates\n\nSenior officers of the Commission\n\nPART II\n\nA person appointed to one of the following posts after the appointed\n\n(a)\n\n(b)\n\n(c)\n\nJudge of the Supreme Court\n\nDirector of Public Prosecutions\n\nAuditor-General\n\n\f57\n\nMember of the Commission\n\nPART III\n\nAir Transport Licensing Authority\n\nBarbados Accreditation Council\n\nBarbados Agency for Micro-Enterprise Development Ltd.\n\nBarbados Agricultural Credit Trust Ltd.\n\nBarbados Agricultural Development and Marketing Corporation\n\nBarbados Agricultural Management Co. Ltd.\n\nBarbados Conference Services Ltd.\n\nBarbados Community College\n\nBarbados Defence Force\n\nBarbados International Business Promotion Corporation\n\nBarbados Investment and Development Corporation\n\nBarbados National Oil Co. Ltd.\n\nBarbados National Standards Institute\n\nBarbados National Terminal Ltd.\n\nBarbados Port Inc.\n\n2.\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\n11.\n\n12.\n\n13.\n\n14.\n\n15.\n\n\f58\n\nBarbados Revenue Authority\n\nBarbados Tourism Investment Inc.\n\nBarbados Tourism Marketing Inc.\n\nBarbados Vocational Training Board\n\nBarbados Water Authority\n\nCaribbean Aircraft Handling Co. Ltd.\n\nCaribbean Airways International Ltd.\n\nCaribbean Broadcasting Corporation\n\nCaves of Barbados Ltd.\n\nChild Care Board\n\nCommunity Legal Services Commission\n\nEnterprise Growth Fund Ltd.\n\nFair Trading Commission\n\nFinancial Services Commission\n\nGrantley Adams International Airport Inc.\n\nHotels and Resorts Limited (Gems of Barbados)\n\nKensington Oval Management Inc.\n\nNational Assistance Board\n\n16.\n\n17.\n\n18.\n\n19.\n\n20.\n\n21.\n\n22.\n\n23.\n\n24.\n\n25.\n\n26.\n\n27.\n\n28.\n\n29.\n\n30.\n\n31.\n\n32.\n\n33.\n\n\f59\n\nNational Conservation Commission\n\nNational Council on Substance Abuse\n\nNational Cultural Foundation\n\nNational Housing Corporation\n\nNational Insurance Board\n\nNational Petroleum Corporation\n\nNational Sports Council\n\nNeedham’s Point Development Inc.\n\nNeedham’s Point Holdings Ltd.\n\nNew Life Investment Company Inc.\n\nQueen Elizabeth Hospital\n\nResolution Life Assurance Company Ltd.\n\nRural Development Commission\n\nSanitation Service Authority\n\nSouthern Meats Inc.\n\nStudent Revolving Loan Fund Management Committee\n\nTechnical and Vocational Education and Training Council\n\nTransport Authority\n\n34.\n\n35.\n\n36.\n\n37.\n\n38.\n\n39.\n\n40.\n\n41.\n\n42.\n\n43.\n\n44.\n\n45.\n\n46.\n\n47.\n\n48.\n\n49.\n\n50.\n\n51.\n\n\f60\n\n52.\n\n53.\n\nTransport Board\n\nUrban Development Commission\n\n\f61\n\nCONFIDENTIALForm 1Integrity in Public Life Act, 2023(Act 2023-  )DECLARATION OF INCOME, ASSETS AND LIABILITIES FOR THE YEAR ENDED 31ST DECEMBER, 20…(Pursuant to section 11 of the Integrity in Public Life Act, 2023)(If there is insuﬃ  cient space for the items falling under any PART of this Form, additional information may be provided on separate sheets.)WARNING: Under section 17 of the Integrity in Public Life Act, 2023 it is an oﬀ ence punishable by a ﬁ ne of $50 000 or imprisonment for one year or both to knowingly ﬁ le a declaration that is incomplete or false in any material  particular. THIRD SCHEDULE(Sections 11, 15, 18, 23 and 55)FORMS FOR PARTS III, IV AND V\f62\n\nPART IIDENTIFICATION SECTIONThird Schedule - (Cont’d)NAME OF DECLARANT (Surname, Other Names)DATE OF BIRTH OF DECLARANT (yyyy/mm/dd)POSITION HELD HOME ADDRESS OF DECLARANTOFFICE ADDRESS OF DECLARANTDECLARANT’S CONTACT INFORMATION(a) Telephone (Home) (Oﬃ  ce)          (Mobile)(b) Email(c) Fax             1.  DECLARANT\f63\n\n2.  DECLARANT’S EMPLOYMENT HISTORY (for the last 5 years)Position HeldName and Address of EmployerPeriod of EmploymentFrom(yyyy/mm/dd)To(yyyy/mm/dd)Third Schedule - (Cont’d)\f64\n\nNAME OF DECLARANT’S SPOUSE (Surname, Other Names)DATE OF BIRTH OF DECLARANT’S SPOUSE (yyyy/mm/dd)HOME ADDRESS OF DECLARANT’S SPOUSE OFFICE ADDRESS OF DECLARANT’S SPOUSESPOUSE ‘S CONTACT INFORMATION(a) Telephone (Home) (Oﬃ  ce)  (Mobile)(b) Email(c) Fax 3.  DECLARANT’S SPOUSENOTE: Under section 2 of the Integrity in Public Life Act, 2023  “spouse” includes a person with whom  the declarant is in a union other than marriage as deﬁ ned by section 39 of the Family Law Act,  Cap. 314.Third Schedule - (Cont’d)\f65\n\nName(Surname, Other Names)AddressIs this child adependent child?(Yes/No)Date of Birth(yyyy/mm/dd)NOTE: Under section 2 of the Integrity in Public Life Act, 2023   “child”, in relation to a person, means any child of the person and includes a stepchild and an  adopted child and, in respect of a man, includes a child(a) in respect of whom the man has been adjudged the father by a court of competent  jurisdiction; or(b) who the man has acknowledged to be his child; “dependent child”, means any child of a person, whether a minor or not, who is unmarried and is  being maintained by the person. 4.  DECLARANT’S CHILDRENThird Schedule - (Cont’d)\f66\n\n1. INCOME FROM EMPLOYMENT - GOVERNMENT/NON-GOVERNMENT (Include receipts from any Ministry, Department, Board, Agency, etc.)Name and Address of EmployerTitle of Oﬃ  ceGross Annual Earnings$Recipient’s Name(Declarant/Spouse/Dependent Child)PART IIDETAILS OF INCOME (OF DECLARANT, SPOUSE AND DEPENDENT CHILDREN)Third Schedule - (Cont’d)\f67\n\nName and Address of BusinessRecipient’s Name(Declarant/Spouse/Dependent Child)Annual Net Income$Nature of BusinessAddress and Descriptionof PropertyRecipient’s Name(Declarant/Spouse/Dependent Child)Annual Net Income$Tenant’s Name2.  INCOME FROM TRADE, PROFESSION OR VOCATION  (Please state Net Income—after deduction of expenses)3.  INCOME FROM PROPERTY  (Please state Net Income—after deduction of expenses)Third Schedule - (Cont’d)\f68\n\nRecipient’s Name(Declarant/Spouse/Dependent Child)Annual  Income$Annual Income$4.  INTEREST INCOME 5. DIVIDED INCOME ( from shares and stock)Name and Address of Organisation/Persons from whom Interest ReceivedRecipient’s Name(Declarant/Spouse/Dependent Child)Name and Address of Organisationfrom which Dividend ReceivedThird Schedule - (Cont’d)\f69\n\nDescription of  Any Assets SoldPurchase Price and AdditionalCapital Expenditure(a)$6. GAINS/PROFITSIn Whose Name Held(Declarant/Spouse/Dependent Child)Expenses Relativeto Sale(b)$Proceeds of Sale(c)$Gains/Proﬁ ts[c – (a + b)]$7. OTHER BENEFITS FROM EMPLOYMENT (including Housing, Travelling)Name and Address of EmployerValue$Description of Beneﬁ tRecipient’s Name(Declarant/Spouse/Dependent Child)Third Schedule - (Cont’d)\f70\n\nSource of Income and AddressRecipient’s Name(Declarant/Spouse/Dependent Child)Value$Description of IncomeNOTE: Under section 2 of the Integrity in Public Life Act, 2023  “income” includes(a) money or money’s worth derived from whatever source or acquired in Barbados or elsewhere, whether  directly or indirectly; and(b) all receipts by way of salary, fees, wages, requisitions, proﬁ ts, grants, emoluments, rents, interest, commissions, bonuses, pensions, annuities or beneﬁ ts.8. OTHER INCOME (not herein previously declared - including receipts by way of commissions, bonuses, pensions, trust, annuities) - See Note below. Third Schedule - (Cont’d)\f71\n\nDate of Acquisition(yyyy/mm/dd)In Whose Name Held(Declarant/Spouse/Dependent Child)OriginalCost$Cost ofAdditions$Estimated Value as atDec. 31, 20... $ Address and Descriptionof  Property including Land and Floor AreasSource of Funding(Mortgage, Loan, Savings etc.)1.  REAL PROPERTY(a) LAND AND BUILDINGS (including townhouses and condominiums)PART IIIDETAILS OF ASSETS (OF DECLARANT, SPOUSE AND DEPENDENT CHILDREN)Third Schedule - (Cont’d)\f72\n\nAddress, Descriptionand Area of LandDate of Acquisition(yyyy/mm/dd)In Whose Name Held(Declarant/Spouse/Dependent Child)OriginalCost$Estimated Value as atDec. 31, 20... $Source of Funding(Mortgage, Loan, Savings etc.)(b) LAND (Without Buildings)Third Schedule - (Cont’d)\f73\n\nName and Address of InstitutionIn Whose Name Held(Declarant/Spouse/Dependent Child)Account NumberBalance as at Dec. 31, 20.... $Type of Account2. AMOUNTS HELD IN BANKS AND OTHER FINANCIAL INSTITUTIONS (not including Unit Trust and Mutual Funds)Third Schedule - (Cont’d)\f74\n\nValue as atDec. 31, 20.... $Number of Units HeldName and Address of InstitutionIn Whose Name Held(Declarant/Spouse/Dependent Child)3.  UNIT TRUST AND MUTUAL FUNDS Third Schedule - (Cont’d)\f75\n\nName and Address of InstitutionValue$In Whose Name Held(Declarant/Spouse/Dependent Child)Description of Cash/Valuables4.  CASH AND VALUABLES HELD IN SAFETY DEPOSIT BOXESThird Schedule - (Cont’d)\f76\n\nIn Whose Name Held(Declarant/Spouse/Dependent Child)Annual PremiumPaid$Sum Assured$Cash SurrenderValue $CompanyType of Policyand Maturity Date(yyyy/mm/dd)5.LIFE INSURANCE POLICIESThird Schedule - (Cont’d)\f77\n\nName of CompanyIn Whose Name Held(Declarant/Spouse/Dependent Child)Stock Units/Shares HeldMarket Value as at Dec. 31, 20.... $6.  COMPANY SHARES AND STOCK (a) COMPANY SHARES AND STOCK [(Quoted), i.e., Traded on the Stock Exchange)]Third Schedule - (Cont’d)\f78\n\nName and Address of CompanyIn Whose Name Held(Declarant/Spouse/Dependent Child)Stock Units/Shares HeldEstimated Value$Nature of  BusinessName and Address of Company or BusinessIn Whose Name Held(Declarant/Spouse/Dependent Child)PercentageOwnershipNature of BusinessInvestment as atDec. 31, 20.... $ (b)  COMPANY SHARES AND STOCK (Unquoted)7. INVESTMENT IN PARTNERSHIPS, JOINT VENTURES AND OTHER BUSINESSESThird Schedule - (Cont’d)\f79\n\nMake and ModelIn Whose Name Held(Declarant/Spouse/Dependent Child)Purchase Price $Registration NumberName and Address of BorrowerName of Lender(Declarant/Spouse/Dependent Child)Date LentAmount Lent$Balance Dueas at Dec. 31, 20.... $Estimated Value as atDec. 31, 20.... $Year ofAcquisition8. OTHER ASSETS (a) MOTOR VEHICLES(b) MONEY LOANEDThird Schedule - (Cont’d)\f80\n\nIssuing OrganisationIn Whose Name Held(Declarant/Spouse/Dependent Child)MaturityDateDate ofPurchaseName and Address of Credit UnionIn Whose Name Held(Declarant/Spouse/Dependent Child)Type of Account(Shares/Savings/Fixed Deposit)Balance as at Dec. 31, 20.... $Face Value$InterestRateAccountNumber (c)  GOVERNMENT AND CORPORATE BONDS(d) CREDIT UNIONSThird Schedule - (Cont’d)\f81\n\nDescriptionIn Whose Name Held(Declarant/Spouse/Dependent Child)LocationValue as atDec. 31, 20.... $NOTE: Under section 2 of the Integrity in Public Life Act, 2023 “assets” means all property, including any  right or interest in property, held by a person in Barbados or elsewhere.  (e) ANY OTHER ASSETS  (not herein previously declared - including  Boats, Jewelry, Paintings, Coin Collections etc.)   -See Note Below Third Schedule - (Cont’d)\f82\n\nProperty/AssetMortgagedName of Borrower(Declarant/Spouse/Dependent Child)Interest Rateand TermAmountPaid for the YearBalanceOwing as atDec. 31, 20.... $Name and Address of LenderOriginal Loanand DateIncurred(yyyy/mm/dd)1.  MORTGAGE LOANS PART IVDETAILS OF LIABILITIES (OF DECLARANT, SPOUSE AND DEPENDENT CHILDREN)Third Schedule - (Cont’d)\f83\n\nName and Address ofOrganization/PersonOwedDateDebt Incurred(yyyy/mm/dd)Name of Debtor(Declarant/Spouse/Dependent Child)OriginalDebt$AmountRepaidduring Year$Amount Owingas at Dec. 31, 20....$NOTE: Under section 2 of the Integrity in Public Life Act, 2023 “liabilities” means all the obligations of aperson to pay money or to provide goods or services in Barbados or elsewhere.2.OTHER LIABILITIES (including Judgment Debts) - See Note below.Third Schedule - (Cont’d)\f84\n\nForm 2Integrity in Public Life Act, 2023(Act 2023-  )CERTIFICATE OF COMPLIANCE(Pursuant to section 15 of the Integrity in Public Life Act, 2023)This is to certify that the declaration required under section 11 of the Integrity in Public Life Act, 2023has been submitted by and has beensatisfactorily made.Dated thisday of20      .NOTE:  The statement of registrable interests required under section 18 of the Act has/has not*been  ﬁ led.*Delete as applicable.Chairman of the Integrity Commission/PresidentThird Schedule - (Cont’d)\f85\n\nForm 3Integrity in Public Life Act, 2023 (Act 2023-  )STATEMENT OF REGISTRABLE INTERESTS FOR THE YEAR ENDED 31ST DECEMBER, 20…(Pursuant to section 18 of the Integrity in Public Life Act, 2023)Complete this Form and ﬁ le it together with the Declaration of Income, Assets and Liabilities which you are required to ﬁ le with the Integrity Commission under section 11 of the Integrity in Public Life Act, 2023.NOTE: There is no requirement to disclose in this Statement the actual amount or extent of any ﬁ nancialbeneﬁ t, contribution or interest. Please notify the Secretary to the Commission of any change which occurs in your interests as set out in this Statement within 6 weeks of the change occurring.(If there is insuﬃ  cient space for the items falling under any section, additional information may be provided on separate sheets.)WARNING: Under section 20 of the Integrity in Public Life Act, 2023 it is an oﬀ ence punishable by a ﬁ ne of $50 000 or imprisonment for one year or both to knowingly ﬁ le a statement of registrable  interests that is incomplete or false in any material particular.  Third Schedule - (Cont’d)\f86\n\nSTATEMENT OF REGISTRABLE INTERESTSNAME OF DECLARANT (Surname, Other Names)DATE OF BIRTH OF DECLARANT (yyyy/mm/dd)POSITION HELD (Tick one)  Member of the House of Assembly SenatorDATE ELECTED/APPOINTED (yyyy/mm/dd)  The following information is provided pursuant to section 18 of the Act:Name of Company or other Corporate BodyAddress1. I/MY SPOUSE/MY CHILD HOLD(S) DIRECTORSHIPS IN THE FOLLOWING COMPANIES OR OTHER CORPORATE BODIES:Third Schedule - (Cont’d)\f87\n\nDate of ContractParticulars of Obligations UndertakenName of Company/Partnership/AssociationAddress2. I/MY SPOUSE/MY CHILD HAVE (HAS) MADE OR AM (IS) A PARTNER IN A FIRM OR A DIRECTOR OR MANAGER OF A COMPANY THAT HAS MADE CONTRACTS WITH THE STATE AS FOLLOWS:3. I/MY SPOUSE/MY CHILD HAVE (HAS) INVESTMENTS IN THE FOLLOWING  COMPANIES,  PARTNERSHIPS OR ASSOCIATIONS:Third Schedule - (Cont’d)\f88\n\nName of TrustBrief Particulars of TrustName of TrustBrief Particulars of Trust4. I/MY SPOUSE/MY CHILD HOLD(S) THE POSITION OF TRUSTEE IN THE FOLLOWING TRUSTS:5. I/MY SPOUSE/MY CHILD HOLD(S) THE POSITION OF BENEFICIARY IN THE FOLLOWING TRUSTS:Third Schedule - (Cont’d)\f89\n\nLocation, Description and Area of LandBeneﬁ cial InterestName and Address of FundController of Fund6. I/MY SPOUSE/MY CHILD HAVE  (HAS) BENEFICIAL INTERESTS IN THE FOLLOWING LANDS:7. I/MY SPOUSE/MY CHILD HAVE (HAS) BEEN MAKING CONTRIBUTIONS TO THE FOLLOWING FUNDS:Third Schedule - (Cont’d)\f90\n\nName and Address of Association Nature of Association(Political/Trade/Professional)Description of IncomeSource8. I/MY SPOUSE/MY CHILD HOLD(S) MEMBERSHIPS IN THE FOLLOWING POLITICAL,  TRADE OR PROFESSIONAL ASSOCIATIONS:7. I/MY SPOUSE/MY CHILD HAVE (HAS) RECEIVED INCOME FROM THE  FOLLOWING  SOURCES:Third Schedule - (Cont’d)\f91\n\nName of Interest (Pecuniary or Non-Pecuniary)Dated this   day of    20  .Signature of Declarant:10. I/MY SPOUSE/MY CHILD HAVE (HAS) THE FOLLOWING OTHER SUBSTANTIAL  INTERESTS WHICH MAY APPEAR TO RAISE A MATERIAL CONFLICT BETWEEN MY   PRIVATE INTEREST AND MY PUBLIC DUTY:Third Schedule - (Cont’d)\f92\n\nCONFIDENTIALForm 4Integrity in Public Life Act, 2023(Act 2023-  )REPORT OF GIFT(Pursuant to section 23 of the Integrity in Public Life Act, 2023)WARNING: Under section 24 of the Integrity in Public Life Act, 2023, it is an oﬀ ence punishable by aﬁ ne of not more than 3 times the value of the gift involved or imprisonment for 6 months orboth, to knowingly make a report pursuant to section 23 that is incomplete or false in anymaterial particular.Third Schedule - (Cont’d)\f93\n\nNAME OF DECLARANT (Surname, Other Names)POSITION HELDDESCRIPTION AND VALUE OF GIFT ($)IN YOUR OPINION, IS THE GIFT (Tick one)  A PERSONAL GIFT  AN OFFICIAL GIFT NAME OF RECIPIENT (Surname, Other Names)RELATIONSHIP TO DECLARANT (Tick one)SPOUSECHILDN/ANAME OF DONOR (Surname, Other Names)ADDRESS OF DONORDated thisday of20.Signature of Declarant:Third Schedule - (Concl’d)\f94\n\nFOURTH SCHEDULE\n\nCODE OF CONDUCT FOR PERSONS IN PUBLIC LIFE\n\n(Section 25)\n\nUse of office\n\n1.\n\nA person exercising public functions\n\n(a)\n\nshall\n\n(i)\n\nensure that he performs his functions and administers the public\nresources for which he is responsible in an effective and efficient\nmanner;\n\n(ii)\n\nbe fair and impartial in exercising his public functions; and\n\n(iii)\n\nafford no undue preferential treatment to any person;\n\n(b)\n\nshall not\n\n(i)\n\n(ii)\n\nuse his office for the improper advancement of his own or his\nfamily’s personal or financial interests or the interest of any other\nperson;\n\nengage  in  any  transaction,  acquire  any  position  or  have  any\ncommercial or other interest that is incompatible with his office,\nfunction and duty or the discharge thereof;\n\n(iii)\n\nuse or allow the use of public property or services for activities\nnot related to his public functions;\n\n(iv)\n\ndirectly or indirectly use his office for private gain; and\n\n(v)\n\nuse  his  official  influence  in  support  of  any  scheme  or  in\nfurtherance of any contract or proposed contract with respect to\nwhich he or a member of his immediate family has an interest.\n\n\f95\n\nUse of information\n\nA  person  exercising  public  functions  shall  not,  for  his  personal\n2.\nadvantage,  benefit  or  gain,  communicate  to  anyone  or  make  use  of  any\ninformation or the contents of any document which was acquired in his official\ncapacity and is not in the public domain.\n\nPrivate interests and conflicts of interest\n\n3.(1)\nA  person  exercising  public  functions  shall  not  allow  his  private\ninterest  to  conflict  with  or  interfere  with  the  proper  discharge  of  his  public\nfunctions  or  improperly  influence  his  conduct  in  the  discharge  of  his  public\nfunctions.\n\nA conflict of interest is deemed to arise where a person exercising public\n(2)\nfunctions makes or participates in the making of a decision in the execution of\nhis office and at the same time knows or ought reasonably to have known that in\nthe making of the decision there was an opportunity either directly or indirectly\nto further his private interests or that of a member of his family or of any other\nperson associated with him.\n\nWhere  there  is  a  possible  or  perceived  conflict  of  interest,  the  person\n(3)\nexercising public functions involved shall disclose his interest in accordance with\nsuch procedures as may be appropriate and disqualify himself from any decision-\nmaking process.\n\n\f96\n\nL.R.O. 1998FIFTH SCHEDULE(Section 54)FORM OF OATHSPART IMEMBERS OF INTEGRITY COMMISSIONForm 1Integrity in Public Life Act, 2023 (Act 2023- )OATH OF OFFICE I  do swear/aﬃ  rm that I will exercise the functions of member of the Integrity Commission under the Integrity in Public Life Act, 2023 (Act 2023-   )without fear or favour, aﬀ ection or ill-will according to the Laws of Barbados. So help Me God.Dated this day of  , 20 .Signature\f97\n\nL.R.O. 1998Fifth Schedule - (Cont'd)PART I - (Concl'd)MEMBERS OF INTEGRITY COMMISSIONForm 2Integrity in Public Life Act, 2023(Act 2023- )OATH OF SECRECY I  member of the Integrity Commission do swear/aﬃ  rm that I shall treat all declarations ﬁ led with the Integrity Commission under the Integrity in Public Life Act, 2023 (Act 2023-   ) and all records and information relating thereto as secret andconﬁ dential and I shall not disclose or communicate to any unauthorized person or allow any unauthorized person to have access to any such record, information or declaration. So help Me God.Dated this day of   , 20 .Signature\f98\n\nL.R.O. 1998PART IIEMPLOYEES AND OTHER PERSONS PERFORMING FUNCTIONS IN THE SERVICE OF THE INTEGRITY COMMISSIONForm 3Integrity in Public Life Act, 2023 (Act 2023- )OATH OF OFFICE I  do swear/aﬃ  rm that I will exercise my functions (in the service of/as employee of) the Integrity Commission under the Integrity in Public Life Act, 2023 (Act 2023-   ) without fear or favour, aﬀ ection or ill-will according to the Laws ofBarbados. So help Me God.Dated this day of   , 20 .Fifth Schedule - (Cont'd)Signature\f99\n\nL.R.O. 1998PART II - (Concl'd)EMPLOYEES AND OTHER PERSONS PERFORMING FUNCTIONS IN THE SERVICE OF THE INTEGRITY COMMISSION Form 4Integrity in Public Life Act, 2023 (Act 2023- )OATH OF SECRECY I  employee/performing a function in the service of theIntegrity Commission do swear/aﬃ  rm that I shall treat all declarations ﬁ led with the Integrity Commission under the Integrity in Public Life Act, 2023 (Act 2023-   ) and all records andinformation relating thereto as secret and conﬁ dential and I shall not disclose or communicate to any unauthorized person or allow any unauthorized person to have access to any such record, information or declaration. So help Me God.Dated this day of   , 20 .Fifth Schedule - (Cont'd)Signature\f100\n\nL.R.O. 1998Fifth Schedule - (Cont'd)PART IIIPERSONS APPOINTED AS TRIBUNAL MEMBERSForm 5Integrity in Public Life Act, 2023 (Act 2023- )OATH OF OFFICE I   do swear/aﬃ  rm that I will exercise my functions as amember of a tribunal under the Integrity in Public Life Act, 2023 (Act 2023-  ) without fear or favour,  aﬀ ection or ill-will according to the Laws of Barbados. So help Me God.Dated this         day of        , 20    .Signature\f101\n\nL.R.O. 1998PART III - (Concl'd)PERSONS APPOINTED AS TRIBUNAL MEMBERS  Form 6Integrity in Public Life Act, 2023(Act 2023-  )OATH OF SECRECY I  appointed as a member of a tribunal under the Integrity in Public Life Act, 2023 (Act 2023-    ) do swear/aﬃ  rm that I shall treat all declarations ﬁ led with the President and all records and information relating thereto as secret and conﬁ dential and I shall not disclose or communicate to any unauthorized person or allow any unauthorizedperson to have access to any such record, information or declaration. So help Me God.Dated this          day of        , 20   .Fifth Schedule - (Concl'd)Signature\f102\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2023.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2023.\n\nPresident\n\n\fINTEGRITY IN PUBLIC LIFE BILL, 2023\n\nEXPLANATORY MEMORANDUM\n\nThe  Bill  would  establish  a  regime,  including  an  integrity  commission,  to\npromote the integrity of persons in public life and strengthen measures for the\nprevention,  detection,  investigation  and  prosecution  of  acts  of  corruption  and\nprovide for related matters.\n\nPART I -\nPRELIMINARY\n\nClause 1:\n\nprovides the short title.\n\nClause 2:\n\ndefines the terms used in the legislation, including the term\n“specified person in public life”, which is any person listed in\nthe Second Schedule including a Member of Parliament.\n\nPART II -\nINTEGRITY COMMISSION\n\nEstablishment and Functions of Commission\n\nClause 3:\n\nprovides for the establishment of the Integrity Commission,\nthe constitution of which is set out in the First Schedule.\n\nClause 4:\n\nsets out the functions of the Commission.\n\nClause 5:\n\nClause 6:\n\nempowers the Commission to consult with any person in the\nexercise of its functions.\n\nprovides for the Commission to enter into written agreements,\narrangements  or  memoranda  of  understanding  with  law\nenforcement agencies.\n\ni\n\n\fIntegrity in Public Life Bill, 2023\n\nClause 7:\n\nClause 8:\n\nprovides for the funds of the Commission and mandates the\nCommission to keep proper accounts.\n\nrequires  the  Commission  to  produce  annual  reports  on  its\nactivities.\n\nClause 9:\n\nprovides for the Commission’s staff.\n\nClause 10:\n\nempowers  the  Commission  to  designate  persons  to  be\ninvestigative officers.\n\nClause 11:\n\nClause 12:\n\nClause 13:\n\nClause 14:\n\nClause 15:\n\nPART III -\nDECLARATIONS\n\nrequires  all  persons  in  public  life  specified  in  the  Second\nSchedule to file, every 2 years, declarations of their financial\naffairs with the Commission, or, in the case of members and\nsenior officers of the Commission, with the President.\n\nstipulates  that  the  declaration  must  contain  details  of  the\nincome, assets and liabilities of the person in public life and\nthose of his spouse and dependent children.\n\nexempts  a  person  from  declaring  certain  trust  property  in\ndetail.\n\npermits a person in public life to place his assets in a blind\ntrust,  and,  where  he  does  so,  exempts  him  from  the\nrequirement to declare details of those assets.\n\nprovides for the receipt and examination of declarations and\nexplains  the  steps  the  Commission  must  take  in  relation  to\nboth satisfactory and unsatisfactory declarations.\n\nii\n\n\fClause 16:\n\nClause 17:\n\nClause 18:\n\nClause 19:\n\nClause 20:\n\nClause 21:\n\nIntegrity in Public Life Bill, 2023\n\nimposes a duty to publish the name of any person who fails to\nfile a declaration or to furnish further information concerning\nhis  declaration,  in  the  Official  Gazette  and  in  a  daily\nnewspaper.\n\nmakes  it  an  offence,  among  other  things,  to  fail  to  file  a\ndeclaration  or  to  give  false  or  incomplete  information  in  a\ndeclaration.\n\nPART IV -\nREGISTRABLE AND PROHIBITED INTERESTS\n\nrequires every member of the House of Assembly and of the\nSenate  to  file  a  statement  of  registrable  interests  with  the\nCommission with details, for example, of any directorships\nheld and any associations to which the person belongs.\n\nprovides for the Commission to keep a record of all statements\nof  registrable  interests  and  other  information  filed  by\nmembers of the House of Assembly and of the Senate.\n\nmakes it an offence to fail to file a statement of registrable\ninterests or to give false or incomplete information concerning\nsuch a statement.\n\ndisqualifies a member of the House of Assembly or the Senate\nwho is convicted of an offence related to his declaration or\nstatement  of  registrable  interests  from  holding  any  public\noffice for a period of 10 years from the date of conviction for\nthe offence.\n\nClause 22:\n\nprovides  for  the  Commission  to  make  rules  regarding  the\ncircumstances in which a specified person in public life would\n\niii\n\n\fIntegrity in Public Life Bill, 2023\n\nbe prohibited from acquiring an interest in a contract with the\nGovernment or a state-owned enterprise.\n\nPART V -\nGIFTS\n\nClause 23:\n\nClause 24:\n\nrequires every specified person in public life who receives a\ngift  worth  more  than  $2500  to  report  that  fact  to  the\nCommission or, in the case of a member or senior officer of\nthe  Commission,  to  the  President,  for  determination  as  to\nwhether the gift is a personal or official one, and requires the\nperson in public life to deliver any gift that is not personal to\nthe Minister of Finance.\n\nmakes it an offence, among other things, to fail to report a gift\nor to comply with a direction to deliver a gift to the Minister\nof Finance but places a limitation period of 5 years from when\na person ceases to be a person in public life for the institution\nof proceedings.\n\nPART VI -\nCONDUCT IN PUBLIC LIFE AND CONTRAVENTIONS OF ACT\n\nClause 25:\n\nClause 26:\n\nClause 27:\n\nestablishes  a  code  of  conduct  for  persons  exercising  public\nfunctions  and  provides  for  the  Commission  to  investigate\nalleged contraventions of the code. The code is set out in the\nFourth Schedule.\n\nimposes a duty on persons to report suspected contraventions\nof the legislation.\n\nprovides  generally  for  complaints  to  be  made  to  the\nCommission in relation to contraventions of the legislation.\n\niv\n\n\fIntegrity in Public Life Bill, 2023\n\nClause 28:\n\nClause 29:\n\nClause 30:\n\nrequires any oral complaint received by the Commission to be\nput in writing.\n\nprovides for the Commission to examine each complaint and\nto reject any that is frivolous or outside its jurisdiction.\n\nmakes it an offence to knowingly make a false allegation or\nprovide  false  information  relating  to  a  contravention  of  the\nlegislation.\n\nPART VII -\nPOWER TO REQUIRE FURTHER INFORMATION AND TO CONDUCT\nINQUIRIES\n\nClause 31:\n\nempowers the Commission to make independent inquiries and\nrequest further information for several purposes including to\ndetermine whether any declaration or statement of registrable\ninterests is complete and accurate and whether any person has\ncontravened the Code of Conduct or otherwise contravened\nthe legislation.\n\nClause 32:\n\naddresses the conduct by the Commission of formal inquiries.\n\nClause 33:\n\nClause 34:\n\ngives the Commission the power of a judge to summon and\nexamine witnesses.\n\noutlines\nCommission and makes non-compliance an offence.\n\nthe  duties  of  witnesses  summoned  by\n\nthe\n\nClause 35:\n\nprovides for the expenses of witnesses.\n\nClause 36:\n\nprovides for the Chief Marshal to detail marshals to preserve\norder at proceedings of the Commission.\n\nv\n\n\fIntegrity in Public Life Bill, 2023\n\nClause 37:\n\nClause 38:\n\nClause 39:\n\nprovides for the Commission to prepare written reports of each\ninquiry it conducts.\n\nspeaks to action by the Director of Public Prosecutions upon\nreceipt of information from the Commission.\n\nmakes  it  an  offence,  among  other  things,  to  fail  to  furnish\ninformation  requested  by  the  Commission  or  attend  an\ninquiry, without reasonable cause.\n\nClause 40:\n\nprovides for the President to appoint a person as a tribunal to\ndischarge her functions on her behalf.\n\nPART VIII -\nINVESTIGATIONS\n\nPowers of Investigative Officers\n\nClause 41:\n\nClause 42:\n\ngives an investigative officer the same power of arrest as a\nconstable  where  he  reasonably  suspects  that  a  person  has\ncommitted an offence under the legislation.\n\nallows  an  investigative  officer  to  obtain  a  disclosure  order\nfrom  a  Judge  in  Chambers  for  the  purpose  of  obtaining\nmaterial relevant to his investigation.\n\nClause 43:\n\nprovides for an investigative officer to obtain a search warrant.\n\nClause 44:\n\nmakes it an offence to obstruct an investigative officer in the\nexecution of his duty.\n\nComplaints regarding Investigative Officers\n\nClause 45:\n\nprovides a procedure for complaints about the conduct of an\ninvestigative officer to be made.\n\nvi\n\n\fClause 46:\n\nClause 47:\n\nClause 48:\n\nClause 49:\n\nClause 50:\n\nClause 51:\n\nClause 52:\n\nClause 53:\n\nClause 54:\n\nIntegrity in Public Life Bill, 2023\n\nrequires the President to appoint a panel to hear and adjudicate\nsuch complaints.\n\npermits the panel to dispense with trivial complaints and to\ndispose of complaints informally.\n\nprovides for the complaints to be investigated formally by the\nCommission in certain cases.\n\nrequires the panel to review the Commission’s disposition of\na complaint and report thereon.\n\nPART IX -\nMISCELLANEOUS\n\nprovides  for  the  Commissioner  of  Police  to  assist  the\nCommission in connection with the discharge of its functions\nwhere the Commission so requests.\n\nimposes, among other things, a general duty of confidentiality\non members and employees of the Commission with respect\nto information received in the discharge of their functions.\n\nprovides for the manner in which conflicts of interest are to\nbe addressed.\n\nprotects members and employees of the Commission from suit\nfor acts done in good faith in the exercise of their functions.\n\nprovides for an oath of office and of secrecy to be taken by\nmembers and employees of the Commission and other persons\nperforming  specified  functions  under  the  legislation.  The\nforms of the oaths are set out in the Fifth Schedule.\n\nvii\n\n\fIntegrity in Public Life Bill, 2023\n\nClause 55:\n\nClause 56:\n\nempowers  the  Minister  to  amend  Part  II  of  the  Second\nSchedule and the Third Schedule.\n\nprovides for the Minister to make regulations to give effect to\nthe legislation and empowers the Commission to make rules\nfor its procedure.\n\nClause 57:\n\nprovides for the amendment of section 112 of the Constitution.\n\nClause 58:\n\nprovides  for  the  commencement  of  the  legislation  by\nProclamation.\n\nviii\n\n"
}