{
  "bill_id": 679,
  "slug": "resolution-re-acquisition-of-land-at-work-hall-st-philip",
  "title": "Resolution re Acquisition of land at Work Hall, St. Philip",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/d94128653e1638961385093491cf77c9.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2023-02-01",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "2022-10-04\nPARLIAMENT\nRESOLVED that Parliament approve in accordance with section 5 of the Land Acquisition Act, Cap. 228 the compulsory acquisition by the State of the parcels of land more particularly described in the Schedules hereto and situate at Work Hall in the parish of Saint Philip in this Island for the public purpose of regularizing a squatters' housing area.\nAPPROVED by the House of Assembly this\nday of\n:\nTwo Thousand and Twenty-Two.\nSpeaker\nAPPROVED by the Senate this\nday of\n;\nTwo Thousand and Twenty-Two.\nPresident\nFIRST SCHEDULE\nALL, THAT land the property of Arthur Pounder situate at Work Hall in the parish of Saint Philip in this Island containing by admeasurement 9 853.1 square metres or thereabouts abutting and bounding on a right of way 4.88 metres wide on lands now or late of Martha Hawkesworth on lands now or late of Kevin Gobin e¢ al on a road on lands now or late of Reynold White on Lots 4, 3 and 2 on lands now or late of Scofield Alleyne (Lot 1) and on a road in common leading to Highway #5 in one direction or however else the same may abut and bound as shown and delineated on a plan certified on the 7\" day of March, 2022 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Survey Department on the 26\" day of May, 2022 as Plan No, 819/2022.\nSECOND SCHEDULE\nALLTHAT land the property of Reynold White situate at Work Hall in the parish of Saint Philip in this Island containing by admeasurment 4 166.8 square metres (including 129.3 square metres in road) or thereabouts abutting and bounding on Lot 4 and on lands now or late of Arthur Pounder on a road on lands now or late of Fabian Sargeant (Lot 16) on lands now or late of Sherry-Ann Blackman (Lot 15) on lands now or late of Pedro Shepherd (Lot 14) on lands now or late of Nicole Hunte (Lot 13) on lands now or late of Derwin Belgrave (Lot 12) on lands now or late of Rena Sealy (Lot 11) on lands now or late of Jennie Welch (Lot 10) on lands now or late of Maureen Butcher (Lot 9) and on a public road or however else the same may abut and bound as shown and delineated on a plan certified on the 7\" day of March, 2022 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Survey Department on the 26\" day of May, 2022 as Plan No, 819/2022.\nTHIRD SCHEDULE\nALL THAT land the property of Jonathan Henry situate at Work Hall in the parish of Saint Philip in this Island containing by admeasurement 2 377,3 square metres (including 187.5 square metres in road) or therabouts abutting and bounding on lands now or late of Reynold White on lands now or late of Arthur Pounder on lands now or late of Kevin Gobin ef al on lands now or late of Beresford Smith and on a road or however else the same may abut and bound as shown and delineated on a plan certified on the 7\" day of March, 2022 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Survey Department on the 26\" day of May, 2022 as Plan No. 819/2022.\nFOURTH SCHEDULE\nALL THAT land the property of Beresford Smith situate at Work Hall in the parish of Saint Philip in this Island containing by admeasurement 1 678.5 squate metres or thereabouts abutting and bounding on lands now or late of Jonathan Henry on lands now or late of Kevin Gobin ef a/ on lands now or late of Gwendolyn Browne on lands now or late of Abel Scott and onaroad or however else the same may abut and bound as shown and delineated ona plan certified on the 7\" day of March, 2022 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Survey Department on the 26\" day of May, 2022 as Plan No. 819/2022.\nFIFTH SCHEDULE\nALL THAT land the property of Kevin Gobin e¢ al situate at Work Hall in the parish of Saint Philip in this Island containing by admeasurement 1 000.6 square metres or thereabouts abutting and bounding on lands now or late of Arthur Pounder on lands now ot late of Martha Hawkesworth on lands now or late of Gwendolyn Browne on lands now or late of Beresford Smith on lands now or late of Jonathan Henry and on a road or however else the same may abut and bound as shown and delineated on a plan certified on the 7\" day of March, 2022 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Survey Department on the 26\" day of May, 2022 as Plan No. 819/2022.\nSIXTH SCHEDULE\nALL THAT land the property of Martha Hawkesworth situate at Work Hall in the parish of Saint Philip in this Island containing by admeasurement 992.4 square metres (including 156.7 square metres in Right of Way) or thereabouts abutting and bounding on lands now or late of Elizabeth Alleyne on lands now or late of Gwendolyn Browne on lands now or late of Kevin Gobin e¢ al on lands now or late of Arthur Pounder and on a Right of Way 4.88 metres wide or however else the same may abut and bound as shown and delineated on a plan certified on the 7\" day of March, 2022 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Survey Department on the 26\" day of May, 2022 as Plan No. 819/2022.\nSEVENTH SCHEDULE\nALL THAT land the property of Gwendolyn Browne situate at Work Hall the parish of Saint Philip in this Island containing by admeasurement 993.7 square metres (including 141.0 square metres in Right of Way) or thereabouts abutting and bounding on lands now or late of Nathaniel Franklyn on lands now or late of Abel Scott on lands now or late of Beresford Smith on lands now or late of Kevin Gobin et al on lands now or late of Martha Hawkesworth on lands now or late of Elizabeth Alleyne and on a Right of Way 4.88 metres wide leading to a cul-de-sac in one direction or however else the same may abut and bound as shown and delineated ona plan certified on the 7\" day of March, 2022 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Survey Department on the 26\" day of May, 2022 as Plan No. 819/2022.\nin\nADDENDUM\nThe Cabinet at its meeting held on the 27\" of May, 2021 considered Note (21) 440/ MHLM 36 and agreed to the compulsory acquisition of seven (7) parcels of land comprising a total area of 20 988 square metres situate at Work Hall in the parish of Saint Philip in this Island and more particularly described in the Schedules hereto for the purpose of regularizing a squatters’ housing area at Work Hall, St. Philip.\nIn accordance with the provisions of section 5 of the Lands Acquisition Act, Cap. 228, the approval of Parliament is now sought for the compulsory acquisition of the parcels of land described in the Schedules hereto in order that the public purpose set out in the Resolution may be effected and that the State may acquire an indefeasible title to the said parcels of land.\nPermanent Secretary, Ministry of Housing, Lands & Maintenance\nT certify that the Resolution faired at cover, a copy of which is at (136), is in order for submission to the Cabinet and, if approved without amendment, laid in Parliament,\nKo DALE D. MARSHALL, KC, MP Atpmey General 40\" October 2022\n"
}