{
  "bill_id": 680,
  "slug": "resolution-re-take-note-of-green-paper-on-the-national-sports-policy",
  "title": "Resolution re Take note of Green Paper on the National Sports Policy",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/345fe2d51960fc977d0d65f017fc71b6.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-05-31",
  "first_reading": "2023-05-30",
  "gazette_date": null,
  "markdown": "Green Paper Policy follows after page 2\n\nPARLIAMENT\n\nRESOLUTION\n\nWHEREAS the Government of Barbados has signaled its intentions to give new\nimpetus to the sports sector to provide communities with ownership in the development\nof sports and to ensure sports generates revenue for athletes, communities and the youth\nthrough the creation of a comprehensive and inclusive sports policy;\n\nAND WHEREAS the policy aims to utilize sports as a means to foster youth and\n\ncommunity development, and as a tool for social development and nation building;\n\nAND  WHEREAS  the  policy  recognizes  the  significant  economic  potential  of\nsports and supports the need to build a sports industry which can contribute to economic\ndevelopment in a meaningful way;\n\nAND  WHEREAS  the  Government  has  engaged  in  extensive  consultations  with\n\ndirect stakeholders within the sports arena on the draft National Sports Policy;\n\nAND  WHEREAS  the  Cabinet  has  given  favourable  consideration  to  the  draft\n\nNational Sports Policy;\n\nAND WHEREAS a Green Paper has been prepared to inform the finalization of a\n\nNational Sports Policy;\n\nAND  WHEREAS  the  policy  recognizes  twelve  thematic  areas  which  are\nfundamental to sports development, namely Building a More Active Barbados, Sports for\nCommunity Development, Physical Education, Sports and the Education System, Sports\nand  Penitentiary  Reform,  Development  of  a  Sports  Economy,  Sports  Tourism,\nIntellectual  Property  and  Sports,  Digital  Sports  Sector,  Development  of  a  High-\nPerformance  System,  Specialists’  Sports  Centre,  Institutional  Strengthening  and\nGovernance, and Incentives and Concessions;\n\n\fBE IT RESOLVED that the Parliament of Barbados take note of the Green\n\nPaper on the National Sports Policy.\n\n2\n\nAPPROVED by the House of Assembly this          day of\n\n ,\n\nTwo Thousand and Twenty-three.\n\nSpeaker\n\n          APPROVED by the Senate this        day of\nand Twenty-three.\n\n , Two Thousand\n\nPresident\n\n\fGREEN PAPER\n\nMINISTRY OF YOUTH, SPORTS AND COMMUNITY EMPOWERMENT\n\nNATIONAL SPORTS POLICY\n\nReimagining the Future of Sports\n\n“A vision for national sports development for the next 10 years”\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 1\n\n\fTable of Contents\n\n1.\n\n2.\n\n3.\n\nEXECUTIVE SUMMARY ..................................................................................................................... 4\n\nBACKGROUND AND RATIONALE ...................................................................................................... 8\n\n2.1\n\nPolicy Problem .................................................................................................................... 8\n\nKEY CONCEPTS AND ISSUES ............................................................................................................. 9\n\n3.1  Building A More Active Barbados ................................................................................. 9\n\n3.1.1\n\nSports for Community Development ......................................................................... 9\n\n3.1.2\n\nPhysical Education, Sports and the Education System ....................................... 10\n\n3.1.3\n\nSports and Healthy Living ......................................................................................... 10\n\n3.1.4  Gender Diversity & Equality ...................................................................................... 10\n\n3.1.5\n\nSports and Penitentiary reform ................................................................................ 10\n\n3.2  Development of a Sports Economy ............................................................................ 11\n\n3.2.1\n\nSports and National Development ........................................................................... 11\n\n3.2.2\n\nCommunity, Youth and Elite Sports ........................................................................ 11\n\n3.2.3\n\nProfessional Sports .................................................................................................... 12\n\n3.2.4\n\nSports Tourism............................................................................................................ 12\n\n3.2.5\n\nSports Manufacturing ................................................................................................. 12\n\n3.2.6\n\nIntellectual Property and Sports ............................................................................... 13\n\n3.2.7\n\nBroadcast and other Media Rights .......................................................................... 13\n\n3.2.8\n\nSports and the Environment ..................................................................................... 13\n\n3.2.9\n\nVolunteers ................................................................................................................... 13\n\n3.2.10  The Digital Sports Sector .......................................................................................... 14\n\n3.2.11  Areas of Special Interest ........................................................................................... 14\n\n3.2.12  Cricket Development.................................................................................................. 14\n\n3.2.13  Road Tennis Development ....................................................................................... 15\n\n3.2.14  Beach Culture and Sport ........................................................................................... 15\n\n3.2.15  Disciplines for Primary Focus ................................................................................... 15\n\n3.3  Hosting of Regional and International Events ......................................................... 16\n\n3.4  Development of a High-Performance System .......................................................... 16\n\n3.4.1\n\nNational Development Scholarships ....................................................................... 17\n\n3.4.2\n\nSpecialists’ Sports Centre ......................................................................................... 17\n\n3.4.3\n\nInvestment and Resource Allocation ....................................................................... 17\n\n3.4.4\n\nRegional and International Cooperation ................................................................. 17\n\n3.4.5\n\nAthlete Centric Holistic Development ...................................................................... 18\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 2\n\n\f3.4.6\n\nAcademic and Vocational Training .......................................................................... 18\n\n3.4.7\n\nAthletes as model Citizens ........................................................................................ 18\n\n3.5  Maintaining the Integrity of Sports .............................................................................. 18\n\n3.6\n\n3.7\n\n3.8\n\nInstitutional Strengthening and Governance ........................................................... 18\n\nInfrastructural Development ......................................................................................... 19\n\nFinancing and Incentivizing .......................................................................................... 19\n\n3.8.1\n\nIncentives and Concessions ..................................................................................... 19\n\n3.9\n\nLegislation ......................................................................................................................... 20\n\n4.\n\nSPORTS DEVELOPMENT ACT ......................................................................................................... 20\n\n5.  POLICY DIRECTION AND VISION FOR SPORTS ................................................................................ 22\n\n5.1\n\n5.2\n\n5.3\n\nThe Guiding Values ......................................................................................................... 22\n\nPolicy Objectives ............................................................................................................. 22\n\nExpected Outcomes and Impact .................................................................................. 24\n\n6.  POLICY IMPLEMENTATION AND EVALUATION .............................................................................. 26\n\n7.  CONCLUSION ................................................................................................................................. 26\n\n8.  ANNEXES ....................................................................................................................................... 28\n\nAnnex 1 - List of National Sports Organisations: ................................................................ 28\n\nAnnex 2 - List of Facilities Managed by the National Sports Council & Other\nRecreational Facilities ................................................................................................................ 31\n\nAnnex 3 - The Inter-Ministerial Committee on Sports – Terms of Reference .............. 38\n\n9.  REFERENCES: ................................................................................................................................. 40\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 3\n\n\f1.  EXECUTIVE SUMMARY\n\nThis Green Paper takes note of the immense potential which exists in the field of\nsports and identifies challenges which require intervention to allow for optimal\nsports development in Barbados.  The paper will seek to demonstrate the issues\nand challenges, along with possible solutions which can be implemented through\nthe creation of a National Sports Policy.\n\nThis Green Paper seeks to lay the foundation “to elevate sports as a central pillar\nof Barbadian national identity, social development and economic prosperity, by\n2032.”\n\nThe National Sports Policy should be structured to foster increased participation\nin physical activity and sports, as a mechanism for improving health and wellness,\nas an access to economic opportunities and to facilitate the pursuit of excellence.\nIt could be underpinned by the core values of inclusiveness and accessibility; fair\nplay, respect and ethical behaviour; discipline and dedication, empowerment and\nexcellence.\n\nThe  National  Sports  Policy  should  endeavour  to  build  on  the  existing  sports\nculture and on the successes achieved in the numerous sports disciplines over\nthe  years,  to  enable  Barbados  to  realize  its  full  potential  in  sports.    It  should\nspecify the direction in which the country must go to optimise its sports related\npotential, as articulated in the following objectives:\n\n●  to create an environment in which sport is accessible to all and which\nembraces  the  principle  of  inclusion  as  it  relates  to  persons  with\ndisabilities;\n\n●  to  promote  gender  equality  in  all  aspects  of  sports  participation  and\n\nadministration;\n\n●  to promote community development through sports;\n\n●  to stimulate a culture of healthy living and wellness;\n\n●  to  intensify  the  promotion  of  road  tennis  as  the  indigenous  national\n\nsport of Barbados;\n\n●  to empower National Sports Organizations to be greater contributors\n\nto national development;\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 4\n\n\f●  to  promote  the  formulation  of  strategies  and  programmes  that\nfacilitate the development of athletes, coaches and administrators to\nthe highest levels;\n\n●  to encourage the full integration of physical education and sports into\nthe educational curriculum, as well as recreational activities at all levels;\n\n●  to  create  an  awareness  of  sports-oriented  career  opportunities  for\n\nprofessionals and entrepreneurs;\n\n●  to  encourage  an  inter-sectoral  approach  to  sports  development,\n\nestablishing linkages with key sectors and stakeholders;\n\n●  to create an environment that is conducive to maximizing the economic\n\npotential of sports;\n\n●  to package and leverage a “Brand Barbados”, central to which will be\n\nsports;\n\n●  to  position  Barbados  as  a  hosting  nation-of-choice  for  regional  and\n\ninternational sporting events; and ultimately\n\n●  to transform sports in Barbados to a multifaceted way of life.\n\nThe National Sports Policy should seek to educate the general public on the many\nopportunities and benefits that are available in and through sports.  Concurrently\nit should encourage and promote a positive change of attitude towards assisting\nthe development of our sports and its practitioners, while seeking to ensure that\nsport in Barbados is integrated into the mainstream of our educational, social and\neconomic life.\n\nThe Policy should recognize the pivotal role of the Government of Barbados, in\nproviding a structured framework within which the efforts of stakeholders may\nbe  focused.    This  is  reflected  in  the  following  areas  that  are  addressed  in  the\nPolicy:\n\n  Sports  for  all,  through  facilitation  and  education,  toward  illuminating\n\nsports and accessing the many benefits to be derived;\n\n  the development of a sporting economy;\n\n  the development of a sustainable high-performance system;\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 5\n\n\f  the promotion of institutional strengthening and governance, towards\nbuilding  the  capacity  of  the  stakeholders  in  sports  and  attaining  the\nsustained development of sports;\n\n  the provision of the necessary enabling infrastructure; and\n\n  the  use  of  financing  and  incentivizing  strategies  with  respect  to\nattracting  of  sponsorship  and  investments  and  encouraging  the\nefficient management of resources and the attainment of excellence in\nsports.\n\nIt is essential that there be a legislative and policy environment that embraces\nthe international sports conventions, treaties and charters to which Barbados is\nsignatory.  These reflect the globally accepted standards that underpin the policy\nand the sports environment that is envisaged for Barbados.\n\nThe  Policy  should  highlight  the  need  enact  a  Sports  Development  Act,  to  give\njurisdiction  to  the  measures  and  initiatives  embodied  in  this  National  Sports\nPolicy.  The Act should provide for the following:\n\n-  a definition of sports;\n-\n-\n\nthe creation of a list of approved sports;\nthe  waiver  of  duties  on  sports  gear  and  equipment  for  National\nSports Associations and approved sportspersons and organisations;\ninequalities  related  to  granting  of\nthe  removal  of  gender\nconcessions to athletes;\nthe  comprehensive  integration  of  physical  activities,  sports  and\nrelated programmes within the education system;\nthe  inclusion  of  persons  with  disabilities  in  sports  and  physical\nactivities and programming;\nthe modernising of the regulatory framework for horse racing;\nthe  requirement  for  sports  practitioners\nin  Barbados  to  be\ncompliant  with  the  International  Convention  against  Doping  in\nSports  and  the  World  Anti-doping  Code,  and  other  sports  related\nConventions,  Treaties  and  Declaration  to  which  Barbados\nis\nsignatory;\nthe provision of a new regulatory framework for the National Sports\nCouncil;\nthe  recognition  of  the  National  Sports  Council  as  Government’s\ncompetent  authority  to  support  the  operations  of  the  National\n\n-\n\n-\n\n-\n\n-\n-\n\n-\n\n-\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 6\n\n\fSports  Organisations,  pursuant  to  the  role  as  provided  for  in  the\nlegislation governing the National Sports Council;\nthe  recognition  of  the  Barbados  Olympic  Association  Inc.  as  the\nNational  Olympic  Committee  for  Barbados  with  responsibility  for\nOlympic sports;\n the  recognition  of  the  National  Anti-doping  Commission  as  the\ncompetent authority in Barbados with responsibility for anti-doping\nin  sports,  pursuant  to  the  role  as  provided  for  in  the  legislation\ngoverning the National Anti-doping Commission;\nthe  recognition  of  the  Paralympic  Association of Barbados  as  the\nNational Paralympic Committee for Barbados with responsibility for\nParalympic sports;\nthe  conditional  provision  of  incentives  for  major  investments  in\nsports and related activities;\n\n-\n\n-\n\n-\n\n-\n\n-  approval for the hosting of international competitions in Barbados;\n\n-\n\nand\nthe definition and recognition of a sports industry, as an economic\nsector.\n\nThe effective creation and implementation of the Policy may be realized through\nthe collaborative efforts of the stakeholders in sports. Hence, the Policy should\nemphasise  the  importance  of  the  contribution  of  individuals,  communities,\nNational Sports Organisations, Corporate Barbados, the Government of Barbados\nthrough  its  Ministries,  Departments  and  Agencies  and,  most  importantly,  all\nBarbadians.   It is further proposed that the Policy provide for the strengthening\nof the Ministry responsible for Sports and the National Sports Council, to position\nthese  entities  to  have  oversight  for  the  implementation,  monitoring  and\nevaluation of this Policy.\n\nThe National Sports Policy should reflect Government’s deliberate commitment\nto sports development and development through sports, integral to which is the\ndevelopment of all Barbadians.  This is indicative that the National Sports Policy\nshould not be an end in itself, but an essential pathway for the journey of national\ndevelopment.\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 7\n\n\f2.  BACKGROUND AND RATIONALE\n\n2.1  Policy Problem\n\nOver the years, Barbadians have viewed sports primarily as an avenue for\nleisure, physical exertion and competition, but to a much lesser extent, as\na  tool  for  economic  development.  This  view  has  led  to  an  inability  to\nmaximize the benefits attained from sports.  It is therefore critical that we\nfocus on the following:\n\n-\n-\n-\n-\n\nthe building of sports as an industry;\nthe use of sports to foster youth and community development;\ntourism diversification through sports; and by extension\nthe use of sports as a tool for nation building.\n\nArguments have been advanced that the absence of a well-defined National\nSports Policy for Barbados has inhibited the level of sports development.\nOther concerns include:\n\n-\n\n-\n-\n\nfunctional  and  structural  weaknesses  of  numerous  National  Sports\nOrganisations;\ninadequate financing for the development of sports;\nthe  need  to  restructure  the  education  system  towards  devising  and\nimplementing  adequate  programmes  for  the  development  of  sports\nand sportspersons;\n\n-  an insufficiency of trained instructors, physical education teachers and\n\ncoaches;\n\n-  a  lack  of  modern  and  suitably  equipped  sports  facilities  and  the\n\nmanagement thereof;\ninadequate recognition and celebration of sports icons;\nthe absence of a well-defined and focused sports industry. and\n\nthe need for a robust governance structure for sports, in general.\n\n-\n-\n\n-\n\nIt is against the backdrop that this Green Paper on the National Sports Policy\nhas been formulated.\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 8\n\n\f3.  KEY CONCEPTS AND ISSUES\n\n3.1  Building A More Active Barbados\n\nSport is an inherent, universal human activity that embraces the interest and\nparticipation  of  people  and  society  at  all  levels.  Its  unique  underpinning\nvalue  has  given  strong  identity  to  a  people  and  has  been  a  tool  for\ncommunity  building.  This  has  given  birth  to  the  “Sports-for-All”\nmethodology,  which  entails  transforming  sports  from  physical  activity\nreserved  for  young  and  healthy  persons  into  activity  for  all,  designed  to\nimprove  health,  mental  and  social  well-being,  stimulate  personal\ndevelopment and the pursuit of excellence in sports.\n\nThe World Health Organisation (WHO) in its Report on Non-communicable\n## Diseases (NCD) Country Profiles, 2018i revealed that obesity in Barbados is\non a consistent upward trajectory, which was attributed to inactivity by 44%\nof  Barbadians.    Given  the  significant  implications  for  the  prevalence  of\ncardiovascular diseases, depression, dementia and other NCDs in Barbados,\na state of affairs exacerbated by the COVID19 pandemic, physical activity by\nall  Barbadians  must  be  prioritised  in  the  programmatic  agenda  of  the\nGovernment of Barbados.\n\nAs an ideal of Olympism, the “Sports-for-all” concept embraces participation\nby all individuals, regardless of age, gender, intellectual or physical abilities,\nclass or race. The special needs of the elderly and persons with disabilities\nmust  be  taken  into  account  in  the  implementation  of  any  measures  to\npromote a realistic “Sports-for-All” culture.\n\n3.1.1  Sports for Community Development\n\nThere is a perception that the implementation of a Community Sports\nStrategy  Framework  can  lend  to  support  and  the  development  of  a\nrobust and consistent community-based sporting programs.  This could\nentail partnering with the National Sports organisations, public sector\nentities and corporate Barbados, with a view to promoting sport as part\nof our national identity.  Support for such programmes and initiatives\ncan lead to community cohesion, greater resilience against undesirable\nsocial issues.  The issues to be addressed include the need for increased\nand  sustained  participation  sports  and  physical  activities  at  the\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 9\n\n\fcommunity  level,  through  improved  access  to  community  sports\nfacilities and the provision of structured, age-appropriate programmes.\n\n3.1.2  Physical Education, Sports and the Education System\n\nThe education system is seen as a vehicle through which children are\nintroduced to physical education and sports. As such there should be\nthe full integration of physical education and sports into the curriculum\nat all levels of the education system.  This integration would encompass\nevery  student  from  nursery  to  secondary  school  unless  medically\nexcused, including those with special needs.  These sport and physical\nactivity  programmes  could  be  linked  to  values  education,  to  better\nequip participants to handle life’s challenges. Essential to the process\nwill  be  attaining  a  better  understanding  of  the  impact  of  integrating\nphysical education and sports in early childhood education.\n\n3.1.3  Sports and Healthy Living\n\nThe projected trajectory of increase obesity attributed to inactivity by\nsome  Barbadians,  can  significantly  impact  the  prevalence  of  physical\nand  mental  NCDs  in  Barbados.  Increased  participation  in  physical\nactivity and sports by Barbadians offers a solution to reducing this trend\nand can be conducive to the enhanced physical and mental health and\nwellness of the nation.\n\n3.1.4  Gender Diversity & Equality\n\nGlobally, there is a strategic thrust to attain gender equity and diversity\nin all areas of sports. Efforts in this regard include the empowering both\nmales and females at all levels of sports, through specific training and\ndevelopment  programmes  that\nincludes  governance-related  and\ntechnical training.\n\n3.1.5  Sports and Penitentiary reform\n\nSports can be a vehicle for the positive rehabilitation for residents of\nthe  state  towards,  with  a  view  of  reducing  the  level  of  recidivism,\nstrengthening the prison reform and enhancing the physical and mental\nwellness of the participants.  Of emphasis should be a sports program\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 10\n\n\fthat caters to juvenile detainees,  to enable the early intervening and\naltering of the pathways for young residents of the state.\n\n3.2  Development of a Sports Economy\n\nSports  globally  is  a  lucrative  business,  with  the  industry  estimated  to  be\n## worth  between  $489  to  $614  billionii.  In  light  of  this  commercial  value  of\nsports, there has been much public discourse on the potential for developing\na sustainable, and diverse sports industry for Barbados.\n\nSeveral elements for such an industry exist in Barbados, albeit many of which\nare in an embryonic stage relative to those in the regional and international\narenas. these elements comprise but are not limited to  being engaged as\nathletes,  sports  management  including  being  a  sports  agent,  sports\nadministration,  volunteerism,  sports  manufacturing,  sport  merchandising\nand retailing, advertising, spectating, sports tourism, semi-professional and\nprofessional sports, the provision of facilities, coaching, sports research and\ndevelopment, sport-related gaming, health and fitness, sports medicine and\nsports journalism and broadcasting.\n\nThese presents career opportunities in the full spectrum of sport business\nand for commercial exploitation of sports events and sports related products\nand services, including those that are technology based.\n\n3.2.1  Sports and National Development\n\nAs a starting point for advancing sports as an industry, it is necessary to\ndetermine  the  contribution  of  sports  to  national  development  in\nBarbados. This should include attaining an understanding of the current\ninvestment in sports in Barbados, the benefits derived from sports and\na better understanding of the social and economic value of sports to\nBarbados.  This  may  inform  evidence-based  decision  making  and\nplanning towards repositioning Barbados and Barbadians in the global\nsports market.\n\n3.2.2  Community, Youth and Elite Sports\n\nSport may be utilized as a vehicle for social mobilization and economic\ndevelopment at the community level, for the youth and elite athletes,\nwith a view to opening opportunities for them to generate income and\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 11\n\n\fto  self-actualise.  There  is  also  the  recognition  that  sports  motivate\nyoung people to be active and can redound to them achieving better\nresults at school, acquiring the early foundation of skills and habits that\nhelp them remain healthy and have productive lives.\n\n3.2.3  Professional Sports\n\nSportsmen  and  women  fall  into  the  category  of  global  professionals,\nsome of whom are the highest paid practitioners the world over. The\ndevelopment  of  semi-professional  and  professional  sports  leagues  in\nBarbados  can  present  an\nintermediate  pathway  through  which\nBarbadian  sportspersons  can  hone  their  skills  and  positioning\nthemselves to be global sports professionals. Such leagues can attract\nincreased  corporate  support  locally,  as  well  as  capture  international\nmedia attention and the associated global audiences.\n\n3.2.4  Sports Tourism\n\nThe  development  of  a  sustainable  sports  tourism  package  can  be  a\nviable option for enhancing our tourism product offering and as a major\neconomic growth strategy for Barbados. This could include establishing\nBarbados  as  a  leading  destination  for  regional  and  international\ntournaments,  training  camps,  sporting  exhibitions  and  sports\nconferences.  There is also the opportunity to build on our global image\nas  a  caring  nation  and  an  ideal  destination  for  relaxation,  as  well  as\nleverage  its  historical  investment  in  our  health  sector,  to  establish\nBarbados as a regional hub for sports sciences and a premier location\nfor sports injury care and rehabilitation.\n\n3.2.5  Sports Manufacturing\n\nInherent to the proposed formalizing of a sports industry in Barbados is\nthe  opportunity  to  establish  an  environment  that  encourages\ninvestment in sports manufacturing locally.  The starting point can be\nthe positioning of Barbados as the key distributor of equipment related\nto our indigenous, bona fide sport, road tennis, and the manufacturing\nof ancillary products for mainstream sports, including cricket, for the\ndomestic and export markets.\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 12\n\n\f3.2.6  Intellectual Property and Sports\n\nThe growth and development of sport in Barbados will be accompanied\nby  the  increased  attractiveness  of  its  commercial  value.    It  will  be\nnecessary therefore to ensure the maintenance of a robust legal and\npolicy framework for the protection of Intellectual Property Rights, to\nfacilitating  the  monetizing  of  intellectual  property  assets  and  to\npromote public awareness and the building of respect for Intellectual\nProperty Rights in sports.\n\n3.2.7  Broadcast and other Media Rights\n\nThe  involvement  in  sports  by  sponsors,  sports  practitioners  and\nespecially the local and international media may be influenced by the\nperceived attractiveness of so doing. This appeal may be enhanced by\nthe packaging and promotion of Barbados’ sports product, infused with\nBarbadian  information  and  culture,  to  encourage  mutually  beneficial\npartnerships with these stakeholders.\n\n3.2.8  Sports and the Environment\n\nThe use of public spaces, including the sea, beaches, gullies, hills and\nparks for physical activities and sports, offers an inexpensive solution to\nthe  growing  demand  for  sport  facilities.  This  is  augmented  by  the\nrapidly  increasing  global  interest  in  outdoor  and  beach  sports.  The\ngrowing interest in sports can used as a platform to implement public\nawareness programmes that focus on issues pertaining to sports and\nthe natural environment, including the preservation of the beaches and\npublic spaces in Barbados, to influence positive environmental changes.\nThis can include the reduction of energy costs and carbon emissions, by\nengaging  renewable  energy  solutions  for  sports  facilities,  structures\nand equipment.\n\n3.2.9  Volunteers\n\nSports  in  Barbados  is  underpinned  by  the  spirit  of  volunteerism,  a\nmechanism through which persons may be trained in the elements of\nsports  event  coordination  and  management.  The  skills  acquired  are\ntransferrable and hence, the sports community should be encouraged\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 13\n\n\fto  prioritise  volunteerism  as  a  tool  to  augment  the  foundation  of  a\ntrained workforce for Barbados.\n\n3.2.10  The Digital Sports Sector\n\nDigital Technology in sports is a big and rapidly evolving business, where\na growing number of persons globally use technology with some form\nof sports. This ranges from apps that facilitate or track training and the\nvital signs of participants, internet platforms for the sharing of sports\nrelated  content  and  doing  sports  related  business  and  e-sports,  to\ntelevision  and  on-line  viewing  of  local,  regional  and  international\ncompetitions.   Inherent to the digital sports sector are the essential\nsports  marketing  and  the  lucrative  media  rights.    The  transition  to  a\ndigitally ready sports sector will necessitate a review of the policy and\nregulatory  framework  that  governs  activities\nin  some  sporting\ndisciplines, including horseracing.\n\n3.2.11 Areas of Special Interest\n\nThere are some sporting disciplines to which special attention must be\nafforded,  given  their  critical  role  in  the  socio-cultural  and  economic\ndevelopment  of  Barbados.  Foremost  of  these  sports  are  cricket  and\nroad tennis.\n\n3.2.12 Cricket Development\n\nBarbadians per capita have done better in cricket than any other nation\non  earth  and  hence,  cricket  may  be  considered  to  be  a  symbol  and\nmodel of national excellence in Barbados.  Moreover, geographic and\npopulation  size  have  not  been  impediments  to  Barbadians  achieving\nglobal excellence in cricket.   As in commerce, cricket can be considered\nour lead sport product.  It is essential therefore that Barbados capitalize\non its cricket related investment, infrastructure and human capital and\nsuccesses,  to  ensure  sustained  success  in  the  sport  and  to  lead  the\nfurther development of its sports industry.\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 14\n\n\f3.2.13 Road Tennis Development\n\nRoad tennis is the only indigenous sport of Barbados and hence, it is\nintrinsically linked to the Barbadian culture.  Special emphasis must be\nplaced on initiatives to advance this sport, as it is a mechanism for living\na healthy lifestyle and it has the capacity to afford our young men and\nwomen  careers  in  sports,  locally  and  internationally,  as  well  as  to\nenhance their social and personal development.\n\nThese  efforts  should  include  building  capacity  and  encouraging\nparticipation  at  the  community  level,  the  adoption  of  a  scientific\napproach  to  enhancing  the  game,  positioning  Barbados  as  the  key\ndistributor of equipment and supplies related to road tennis, and as a\nsource of professionals for developing the sport at all levels.\n\n3.2.14 Beach Culture and Sport\n\nBarbados  is  surrounded  by  beautiful  beaches,  which  can  be  better\nutilized to enhance the sporting landscape and sports tourism product\noffering  of  the  island.  These  beaches  are  an  element  of  natural\ninfrastructure  and  an  integral  part  of  Barbados’  cultural  envelope.\nHence,  efforts  should  be  made  to  create  a  synergy  among  the  sand,\nocean, communities, and the many sports that currently utilize or can\nbe adapted to utilize the sea and beaches. This enhanced beach culture\npresents opportunities for increased sports tourism, job creation and\nthe development of neighboring communities and their residents.\n\n3.2.15 Disciplines for Primary Focus\n\nThere  is  a  need  to  allocate  resources  to  sporting  disciplines  and\nencourage them to facilitate mass recreational participation, as well as\ncompetitive pursuits where applicable.  Beyond the special interest in\ncricket and road tennis however, there are other disciplines that may\nbe emphasized, given their history of development and contribution to\nassisting\nin  the  country’s  socio-economic  development.  Specific\nvariables that determine which of the disciplines should be singled out\nfor specific increased national resource investment and attention are:\n\n  national  historical  and  traditional  exposure  to  and  investment  in  the\n\ndiscipline;\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 15\n\n\f  percentage of the populace practicing the sport at the recreational and\n\ncompetitive levels;\n\n  potential  for  enhanced  measurable  national  social  and  economic\n\ncontribution;\n\n  existing adequate infrastructure for the practice of the discipline;\n  potential for international exposure and or expansion;\n  existing adequate proponents and or technically competent exponents\n\n\n\nof the discipline;\nthe  combining  of  proven  existing  national  physical  and  mental\ncompetencies of the majority of the populace; and\n  consistent regional and international success.\n\n3.3  Hosting of Regional and International Events\n\nBarbados  has  been  recognised  for  its  successful  hosting  of  numerous\nregional  and  international  sporting  events,  which  has  showcased  our\nexpertise in event management and our culture and way of life. The hosting\nof these events constitutes a sound strategy  for economic diversification,\nits  ability  to  generate  tourism  and  small  business  revenue,\ngiven\nentrepreneurship and in general, the development of sports as a productive\nsector.  Another primary beneficiary is the services sector, as the successful\nhosting of such events entails a fusion of many local services.\n\n3.4  Development of a High-Performance System\n\nIn  the  past,  Barbados  had  set  a  benchmark  for  the  achievement  of  high-\nperformance  outcomes.  Notwithstanding  that  our  competitors  have\nimproved significantly, we have not kept pace with global developments and\nhence, Barbados has been achieving fewer medals on the world stage and\nour  international  rankings  in  many  sports  have  dwindled.  While  the\nachievement of medals remains a priority, there is the need to redefine the\nsuccesses  of  elite  athletes  to  include  their  impact  as  role  models,  their\nengagement  at  the  community  level  toward  encouraging  persons  to\nparticipate in sports and lead healthier lifestyles, their contribution to the\ndevelopment of the sports industry and as global citizens.\n\nThe development of a technology infused national high-performance system\nis  therefore  a  necessary  task,  which  once  embraced  and  nurtured,  can\nredound  to  considerable  benefits  and  the  overall  sustained  growth  and\nadvancement of sports in Barbados. This will provide aspiring and current\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 16\n\n\fathletes with established pathways towards achieving their best during and\nafter their careers.\n\n3.4.1  National Development Scholarships\n\nThe building of Barbados’ sports related expert capacity is necessary, to\nprovide  Barbados  with  a  comparative  advantage  with  respect  to  the\ninternational sporting community.  This may be achieved through the\nprovision of National Development Scholarships in key areas of sports.\n\n3.4.2  Specialists’ Sports Centre\n\nThe  international  competitiveness  of  Barbados  may  be  enhanced\nthrough  the  establishment  of  a  Specialists’  Sports  Centre,  a  national\ncoaching  structure  and  the  recruitment  and  training  of  high-calibre\nsports  personnel.  This  approach  can  be  strengthened  through  a\ncollaboration with the School of Sports, Cave Hill Campus and other key\nsports  sciences  and  medical  stakeholders,  to  ensure  that  any\nperformance  issues  are  addressed  through  research,  technology  and\ninnovation and that sports science is infused into our sports disciplines.\n\n3.4.3  Investment and Resource Allocation\n\nIn light of the limited resources that are available to the development\nof sports, there is a need for the Government of Barbados through the\nNational Sports Council, Barbados Olympic Association and other key\ninvestment  and\nstakeholders  to  collaborate  towards  optimising\nresource  allocation  in  support  of  our  athletes  achieving  better\nperformance outcomes.\n\n3.4.4  Regional and International Cooperation\n\nSports can be utilized as a vehicle for enhancing cooperation and the\nleveraging  of  expertise  at  the  local,  regional  and  international  levels,\nthe outcome of which can be conducive to national development, and\na competitive edge for our athletes and their performance.\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 17\n\n\f3.4.5  Athlete Centric Holistic Development\n\nThe  holistic  development  of  Barbadian  athlete\nis  of  primary\nimportance, to include skills for remaining healthy, as well as life skills\nto  navigate  inside  and  outside  of  the  elite  sports  environment,  and\nprofessional development in career and education.\n\n3.4.6  Academic and Vocational Training\n\nThe elite athletes and officials who represent Barbados do so with much\nsacrifice of their time and alternative careers. These role models should\nbe  afforded  the  opportunity  to  undertake  academic  and  vocational\ntraining  at  tertiary  institutions,  provided  the  minimum  required\nstandard for matriculation is achieved.\n\n3.4.7  Athletes as model Citizens\n\nSportspersons  may  be  viewed  as  highly  disciplined  and  focused\nindividuals,  with  the  potential  to  positively  impact  the  Barbadian\nsociety.  Strategies  should  be  implemented  through  which  such\nsportspersons can advance their performances as effective role models\nand as positive influences on our communities.\n\n3.5  Maintaining the Integrity of Sports\n\nBarbados  is  signatory  to  the  International  Convention  Against  Doping  in\nSports and the Olympic Charter, which provides for a sports environment\nthat is fair, safe and  inclusive, as well as proactively identify,  remedy and\ndeter any threats to the integrity of sports and the safety of our athletes,\nsupport and accompanying personnel.  The preservation of the integrity of\nsports, including against match fixing and exploitation should be supported\nby the appropriate a legislative framework.\n\n3.6  Institutional Strengthening and Governance\n\nIn order for the Barbadian sporting ecosystem to thrive and be conducive to\nsuccess in the global sporting environment, our process of transformation\ndemands greater global alignment.  The institutional strengthening of  our\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 18\n\n\fNational  Sporting  Organisations  is  now  more  critical  than  ever,  as  it  will\nprovide the opportunity for our National Organisations to create sustainable\ndevelopment  frameworks  towards  optimising  their  efficiencies  and\npositioning our athletes to attain sustained excellence.\n\nSuch  support  may  be  delivered  through  a  strengthened  and  rebranded\nNational Sports Council and may include assistance with the arbitration of\ndisputes,  capacity  building\nin  the  areas  of  governance,  operational\nalignment  towards  excellence,  the  implementation  of  child  safeguarding\npolicies and inclusivity to embrace the differently abled and marginalized.\n\n3.7  Infrastructural Development\n\nInfrastructural  development  is  critical  for  the  promotion  of  public  and\ncommunity-oriented participation in sport and recreational activity. It is also\nessential to the achievement of high-performance objectives and standards\nin  sport.    Greater  emphasis  must  also  be  placed  on  creating  access  for\ndisability sports through systematic upgrades to the existing facilities, and to\npositioning Barbados as an inclusive sports tourism destination.\n\nThis investment can help to ensure quality sporting experiences for all adults\nand  children  participating  in  sport  regularly,  as  well  as  assist  our  top\nsportspersons towards competing successfully at the highest levels.\n\n3.8  Financing and Incentivizing\n\nThere is a general acknowledgement that the development of sports can be\na  costly  undertaking.    Sponsorship,  philanthropic  contributions,  self-help\nand prudent management of resources are essential, in order to achieve the\ndesired successes in sports. This may be assisted through the formation of\npublic-private sector partnerships, as a means to maintaining and expanding\nthe  facilities  available  for  sports,  as  well  as  encouraging  collaborations\nbetween the National Federation and the private sector.\n\n3.8.1  Incentives and Concessions\n\nIt is imperative that there be stimuli to encourage contributions to the\ndevelopment of sports and to motivate individuals to perform at the\nhighest  levels.    Such  stimuli  may  include  duty-free  concessions  on\nimports for National Sports Organisations and approved sportspersons,\nexemptions  from  the  payment  of  taxes  pertaining  to  undertaking\napproved sports projects and competitions, appropriate incentives for\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 19\n\n\fpersons  or  entities  who  undertake  the  construction,  refurbishing,\nfurnishing  and  operation  of  a  sports  related  facility,  the  release  of\nemployees  for  training  and  to  represent  Barbados  in  sports  without\nthem being disadvantaged, and the creation of a national recognition\nmechanism that highlights, rewards and engages outstanding national\nsportspersons.\n\n3.9  Legislation\n\nA  robust  legislative  framework  built  on  globally  accepted  standards  is  a\nnecessary underpinning of an effective policy and sports environment.  This\nwould include local legislation to fully enable and support the objectives of\nthe policy.\n\n4.  SPORTS DEVELOPMENT ACT\nThe enactment of a Sports Development Act will be required, to give jurisdiction\nto the measures and initiatives embodied in the National Sports Policy.  Inter alia,\nthis Act should be conducive to the strengthening of the state entities to better\nfacilitate the development of sports as a true economic earning sector and as a\nsocial development mechanism.  It is proposed that the Sports Development Act\nprovide for the following:\n\n-  a definition of sports;\n-\n-\n\n-\n\n-\n\n-\n\nthe creation of a list of approved sports;\nthe waiver of duties on sports gear and equipment for National Sports\nAssociations and approved sportspersons and organisations;\nthe removal of gender inequalities related to granting of concessions to\nathletes;\nthe comprehensive integration of physical activities, sports and related\nprogrammes within the education system;\nthe inclusion of persons with disabilities in sports and physical activities\nand programming;\nthe modernising of the regulatory framework for horse racing;\n\n-\n-  sports practitioners in Barbados to be compliant with the International\nConvention against Doping in Sports and the World Anti-doping Code,\nand  other  sports  related  Conventions,  Treaties  and  Declaration  to\nwhich Barbados is signatory;\nthe  provision  of  a  new  regulatory  framework  for  the National Sports\nCouncil;\n\n-\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 20\n\n\f-\n\n-\n\n-\n\n-\n\n-\n\nthe  recognition  of  the  National  Sports  Council  as  Government’s\ncompetent authority to support the operations of the National Sports\nOrganisations,  pursuant  to  the  role  as  provided  for  in  the  legislation\ngoverning the National Sports Council;\nthe  recognition  of  the  Barbados  Olympic  Association  Inc.  as  the\nNational  Olympic  Committee  for  Barbados  with  responsibility  for\nOlympic sports;\n the  recognition  of  the  National  Anti-doping  Commission  as  the\ncompetent authority in Barbados with responsibility for anti-doping in\nsports, pursuant to the role as provided for in the legislation governing\nthe National Anti-doping Commission;\nthe  recognition  of  the  Paralympic  Association of Barbados  as  the\nNational  Paralympic  Committee  for  Barbados  with  responsibility  for\nParalympic sports;\nthe  conditional  provision  of  incentives  for  investments  in  sports  and\nrelated activities;\n\n-  approval  for  the  hosting  of  international  sports  competitions  in\n\n-\n\nBarbados; and\nthe  definition  and  recognition  of  a  sports  industry,  as  an  economic\nsector.\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 21\n\n\f5.  POLICY DIRECTION AND VISION FOR SPORTS\n\nThe vision of the proposed National Sports Policy is:\n\nTo elevate sports as a central pillar of Barbadian national identity, social\ndevelopment and economic prosperity, by 2032.\n\n5.1  The Guiding Values\n\nIt is proposed that the policy is underpinned by a set of core values, which\nwill form the basis of the framework for the transformed Barbadian sports\nlandscape  we  envisage.  These  principles  embody  the  requirements  for  a\nsustainable, success-oriented national sporting culture.\n\nFigure 1: Pyramid of Policy Value\n\n5.2  Policy Objectives\n\nThe  National  Sports  Policy  should  endeavour  to  focus  the  efforts  of  the\nstakeholders in sports in Barbados and specify the direction in which the\ncountry must go to optimise its potential in and through sports.  In order to\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 22\n\n\fachieve this aim, it is proposed that the National Sports Policy pursue the\nfollowing objectives:\n\n  To create an environment in which sport is accessible to all and which\nembraces  the  principle  of  inclusion  as  it  relates  to  persons  with\ndisabilities;\n\n  To encourage the full integration of physical education and sports into\nthe educational curriculum, as well as recreational activities at all levels;\n\n  To stimulate a culture of healthy living and wellness;\n\n  To promote gender equality in all aspects of sports participation and\n\nadministration;\n\n  To promote community development through sports;\n\n  To encourage and facilitate improved governance by the stakeholders\n\nof sports in Barbados;\n\n  To empower National Sports Organizations to be greater contributors\n\nto national development;\n\n  To  promote  the  formulation  of  strategies  and  programmes  that\nfacilitate the development of athletes, coaches and administrators to\nthe highest levels;\n\n  To  create  an  awareness  of  sports-oriented  career  opportunities  for\n\nprofessionals and entrepreneurs;\n\n  To  encourage  an  inter-sectoral  approach  to  sports  development,\n\nestablishing linkages with key sectors and stakeholders;\n\n  To  create  an  environment  that  is  conducive  to  maximizing  the\n\neconomic potential of sports;\n\n  To elevate road tennis, the indigenous national sport of Barbados, in\n\nline with mainstream sports;\n\n  To  facilitate  the  establishment  of  Barbados  as  a  premier  location  for\nregional  and  international  tournaments,  training  camps,  sporting\nexhibitions, sports conferences, sports science and injury rehabilitation;\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 23\n\n\f  To promote a safe sporting environment in which integrity, fair play and\n\nrespect are reflective of global best practices;\n\n  To create a legal framework for the governance and development of\n\nsports in Barbados; and ultimately\n\n  To transform sports in Barbados to a multifaceted way of life.\n\n5.3  Expected Outcomes and Impact\n\nIt is envisaged that creation and implementation of the Policy will redound\nto:\n\n  Increased  participation\n\nin  recreational  and  competitive  sports,\nincluding  by  athletes  with  special  needs  across  more  diversified\ndisciplines;\n\n  Comprehensively  integrated  physical  activities,  sports  and  sports\n\nrelated programmes within the education system;\n\n  Enhanced physical and mental well-being for Barbadians;\n\n  A greater level of gender equity in all level of sports participation and\n\nadministration.\n\n  Enhanced levels of cohesion and development across communities;\n\n  Improved  governance  by  the  Ministry  responsible  for  sports  and  its\ninstitutions  and  National  Sports\n\nrelated  agencies,  educational\nOrganisations;\n\n  Improved administrative and institutional capacity of sports entities in\nBarbados,  reflected  in  reduced  inefficiencies  and  their  increased\ncontribution to national development;\n\n  Increased  global  sporting  success  across  the  various\n\nlevels  of\n\ncompetition;\n\n  Increased  pursuit  of  careers\n\nin  sports  by  athletes,  coaches,\n\nadministrators, technical officials and entrepreneurs;\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 24\n\n\f  Improved linkages and collaboration between civil society, the private\nsector and public sector stakeholders in the development of sport;\n\n  Increased contribution of the sports sector to national development;\n\n  Formal and popular recognition of road tennis as Barbados’ indigenous\nnational sport and increased participation in the sport locally, regionally\nand internationally;\n\n  Increased tourist arrivals for sports related activities;\n\n  Zero  tolerance  for  all  aspects  of  corruption  and  the  use  of  illegal\nperformance  enhancing  substances  and  methods,  by  embracing  the\nethical principles of fair play and respect;\n\n  A  Sports  Development  Act,  to  govern  sports  and  its  development  in\n\nBarbados; and\n\n  A shift in mindset as to the value of sports and its relevance to socio-\n\ncultural and economic life.\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 25\n\n\f6.  POLICY IMPLEMENTATION AND EVALUATION\n\nThe  implementation  of  a  National  Sports  Policy  for  Barbados  will  require  the\nparticipation  and  cooperation  of  the  Government  of  Barbados,  through  its\nMinistries, Departments and Agencies (MDAs), integral to which will be an Inter-\nMinisterial  Committee  on  Sports  that  focuses  on  achieving  synergies,  greater\nefficiency and effectiveness with respect to the implementation of the policy by\nthe ministerial stakeholders.  The implementation of the Policy will  also entail\ncollaborations  with  the  private  sector,  sporting  organisations,  educational\ninstitutions and community-based organizations.\n\nPolicy  monitoring  and  evaluation  are  key  functions  to  assist  in  achieving  the\nexpected results of the National Sports Policy.  The purpose is to track changes\nand  explain  why  change  may  or  may  not  be  occurring.  The  monitoring  and\nevaluation  process  may  be  guided  by  a  number  of  performance  indicators,\nparticularly regarding participation and success of the policy at all levels. Annual\nreviews should be conducted to assess the effectiveness of the implementation\nof  those  initiatives  that  are  highlighted  within  the  annual  strategic  and\noperational plans of the Ministry responsible for Sports and other stakeholders.\n\nA mid-term review and evaluation should be undertaken after five (5) years, in an\neffort  to  inform  the  long-term  objectives.  This  will  allow  for  any  necessary\nmodification of the strategic direction of the policy, emanating from any changes\nin national or global environment.\n\n7.  CONCLUSION\n\nThe proposed creation of a National Sports Policy is geared towards consolidating\nthe diverse efforts of stakeholders in sports in Barbados, while strengthening the\ncapacity  of  the  sports  sector  to  develop  elite  athletes,  encouraging  increased\nparticipation nationally and to stimulating the further development of sports as\na productive sector.\n\nThe Policy should seek to capitalize on the synergies of the stakeholders, thus\nfueling  creativity  and  innovation.  It  should  further  promote  the  fostering  of\nlinkages with business entities beyond the traditional sports system in Barbados\nand hence, offer the opportunity to enhance the resources available for sports.\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 26\n\n\fIt  is  envisaged  that  these  objectives  of  the  Policy  could  be  realized  through  a\nconcerted  and  collaborative  effort  by  the  Government  of  Barbados,  its  non-\ngovernmental  partners  and  most  importantly,  all  Barbadians,  the  ultimate\nbeneficiaries of the policy.\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 27\n\n\f8.  ANNEXES\n\nAnnex 1 - List of National Sports Organisations:\n\n1.  Athletic Association of Barbados\n\n2.  Barbados Amateur Basketball Association\n\n3.  Barbados Amateur Bodybuilding & Fitness Federation\n\n4.  Barbados Amateur Gymnastics Association\n\n5.  Barbados Amateur Weight-Lifting Association\n\n6.  Barbados Aquatic Sports Association\n\n7.  Barbados Badminton Association\n\n8.  Barbados Blind Cricket Association\n\n9.  Barbados Boxing Association\n\n10. Barbados Bridge League\n\n11. Barbados Canoe & Kayak Association\n\n12. Barbados Cheerleading Federation\n\n13. Barbados Chess Federation\n\n14. Barbados Cricket Association\n\n15. Barbados Cricket League\n\n16. Barbados Cycling Union\n\n17. Barbados Dance Council\n\n18. Barbados Darts Association\n\n19. Barbados Draughts Association\n\n20. Barbados Equestrian Association\n\n21. Barbados Federation of Island Triathletes\n\n22. Barbados Federation of Poker\n\n23. Barbados Fencing Federation\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 28\n\n\f24. Barbados Football Association\n\n25. Barbados Golf Association\n\n26. Barbados Hockey Federation Inc.\n\n27. Barbados Judo Association\n\n28. Barbados Karate Association\n\n29. Barbados Martial Arts Sports Federation\n\n30. Barbados Motoring Federation Inc.\n\n31. Barbados National Domino, Whist & Hearts Club\n\n32. Barbados Netball Association\n\n33. Barbados Orienteering Federation\n\n34. Barbados Paragliding Association\n\n35. Barbados Polo Club\n\n36. Barbados Pool Development Association\n\n37. Barbados Rifle & Pistol Federation\n\n38. Barbados Road Tennis Association\n\n39. Barbados Rugby Football Union\n\n40. Barbados Sailing Association Inc.\n\n41. Barbados Secondary Schools Football League\n\n42. Barbados Shooting Council\n\n43. Barbados Sports Combat Association\n\n44. Barbados Squash Association\n\n45. Barbados Surfing Association\n\n46. Barbados Table Tennis Association\n\n47. Barbados Tennis Association\n\n48. Barbados Turf Club\n\n49. Barbados Volleyball Association\n\n50. Barbados Water Polo Club\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 29\n\n\f51. Barbados Water Ski & Wakeboarding Association\n\n52. Barbados Windsurfing Association\n\n53. Barbados Women’s Cricket Association\n\n54. Barbados Wrestling Association\n\n55. Barbados Wushu Tai Chi Federation\n\n56. Barbados Yacht Club\n\n57. Handball Association of Barbados\n\n58. National Kickboxing League of Barbados\n\n59. Paralympics Association of Barbados\n\n60. Special Olympics Barbados\n\n61. Taekwondo Association of Barbados\n\n62. World Archery Barbados\n\nOther Sports Organisations\n\n1.  Barbados Basketball Coaches Association\n\n2.  Barbados Boxing Board of Control\n\n3.  Barbados Olympic Association\n\n4.  Barbados Sports Medicine Association\n\n5.  BSSAC Committee\n\n6.  Kensington Oval Management Inc.\n\n7.  NAPSAC Committee\n\n8.  National Anti-doping Commission\n\n9.  Professional Road Tennis Association\n\n10. Sport for Life Barbados Inc.\n\n11. World Road Tennis Federation\n\n12. Barbados Netball Umpires Association\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 30\n\n\fAnnex 2 - List of Facilities Managed by the National Sports Council & Other Recreational Facilities\n\nPARISHES\n\nST. LUCY\n\nST. PETER\n\nNAME OF FACILITIES\n\nPAVILIONS\n\nHARD COURTS\n\nHC LIGHTS\n\nPLAYING FIELDS\n\nPF LIGHTS\n\nArcher's Bay\n\nChecker Hall\n\nClinketts\n\nConnell Town\n\nCrab Hill\n\nDurhams\n\nGreenidges\n\nHope Road\n\nPie Corner\n\nRock Field\n\nBlack Bess\n\nBoscobel\n\nIndian Ground\n\nKeith Boyce\n\nMaynards\n\nSix Men’s\n\nSpeightstown\n\nWarleigh\n\nWhim\n\nx\n\nx\n\nx\n\nNORTH STARS\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nBADMC\n\nx\n\nx\n\nBADMC\n\nBADMC\n\nBADMC\n\nBADMC\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 31\n\n\fPAVILIONS\n\nHARD COURTS\n\nHC LIGHTS\n\nPLAYING FIELDS\n\nPF LIGHTS\n\nPARISHES\n\nST. ANDREW\n\nST. JOSEPH\n\nNAME OF FACILITIES\n\nBelleplaine\nConrad Hunte/Shorey\nVillage\nGrantley Adams\n\nHorse Hill\n\nLammings\n\nSt. Elizabeth\n\nx\n\nx\n\nx\n\nx\n\nST. JAMES\n\nDesmond Haynes\n\nCOMM. DEV.\n\nST. THOMAS\n\nFolkstone\n\nHaynesville\n\nHoytes Village\n\nHusbands Gardens\n\nOrange Hill\n\nOxnards\n\nSion Hill\n\nTrents\n\nArthur Seat\n\nBagatelle\n\nBridgefield\n\nContent\n\nFarmers\n\nHoly Innocents\n\nLears\n\nProute\n\nCLUB\n\n x\n\nCOMM. DEV. / RES. CN\n\nCLUB\n\nx\n\nx\n\nx\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\nx\nx\nSchool\n\nx\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 32\n\n\fPARISHES\n\nST. GEORGE\n\nNAME OF FACILITIES\n\nBairds/Greens\n\nST. JOHN\n\nST. PHILIP\n\nDrax Hall\n\nEllerton\n\nFlat Rock\n\nGlebe\n\nJames Bryan/St. Helens\n\nLower Estate\n\nSalisbury\n\nSt. Judes Primary\n\nSweet Vale\n\nGall Hill\n\nFoster Hall\n\nBayleys\n\nBlades Hill\n\nChapel\n\nChurch Village\n\nCliff\n\nFoul Bay\n\nHarrow\n\nHilda Skeene\n\nKing George V\n\nRices\n\nSt. Martin\n\nWayne Daniel\n\nPAVILIONS\n\nx/RES.CN\n\nx / RES. CN\n\nx\n\n x\n\nx\n\nCLUB\n\nx\n\nx\n\nX /RES.CN\n\nx\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\nHARD COURTS\n\nHC LIGHTS\n\nPLAYING FIELDS\n\nPF LIGHTS\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nHILDA SKEENE SCH.\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\n x\n\n x\n\nx\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 33\n\n\fPARISHES\n\nNAME OF FACILITIES\n\nPAVILIONS\n\nHARD COURTS\n\nHC LIGHTS\n\nPLAYING FIELDS   PF LIGHTS\n\nCHRIST CHURCH\n\nAirport\n\nGAIA\n\nApple Grove (Briar Hall)\n\nx  /RES. CN\n\nx / RES/CN\n\nx\n\nRES. CN\n\nx\n\nx\n\nx\n\nCane Vale\n\nDover\n\nFairy Valley\n\nGall Hill\n\nGoodland\n\nInch Marlow\n\nLowthers\n\nParish Land\n\nPillersdorf\n\nPlumgrove\n\nRendezvous\n\nRockley\n\nSargeants Village\n\nCOMM. DEV. / RES. CN\n\nSilver Hill\n\nSilver Sands\n\nSt. Christopher\n\nSt. Matthias\n\nVauxhall Prim.\n\nWotton\n\n RES. CN\n\nx\n\nx\n\n x\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\n x\n\nx\n\nx\n\n  x\n\nx\n\nx\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 34\n\n\fPARISHES\n\nST. MICHAEL\n\nNAME OF FACILITIES\n\nPAVILIONS\n\nHARD COURTS\n\nHC LIGHTS\n\nPLAYING FIELDS   PF LIGHTS\n\nArsenal/Jackson\n\nBayville\n\nBelfield\n\nBelmont School\n\nBlenheim \"A\"\n\nBlenheim \"B\"\n\nBonnetts\n\nBush Hall\n\nChancery Lane\n\nClapham\n\nx\n\nx\n\nx / RES. CN\n\nx\n\n x\n\nx\n\nx\n\nBELMONT PRIMARY\n\nx\n\nx\n\nx\n\nx\n\nx\n\nDalkeith/Garrison School\n\nGARRISON SCHOOL\n\nDeacons\n\nCOMM. DEV. / RES. CN\n\nEagle Hall Primary\n\nEden Lodge\n\nx / RES. CN\n\nEmerton/Elkes\n\nCOMM. DEV. / RES. CN\n\nFerniehurst\n\nFree Hill\n\nFriendship\n\nGarrison Savannah\n\nGrazettes\n\nHaggatt Hall\n\nHill Road/Dash Gap\n\nJessamy Avenue\n\nCOMM. DEV.\n\nCOMM. DEV.\n\nCOMM. DEV. / RES. CN\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nPRIVATELY OWNED\n\nPage 35\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\n\fPARISHES\n\nNAME OF FACILITIES\n\nPAVILIONS\n\nHARD COURTS\n\nHC LIGHTS\n\nPLAYING FIELDS   PF LIGHTS\n\nST. MICHAEL (Cont'd)\n\nKaitif Skate Park\n\nLawrence T. Gay\n\nLodge Hill\n\nLumber Company\n\nMap Hill\n\nMeadow Road/Wildey\n\nMontgomery\n\nMurphy Pasture\n\nNational Stadium\n\nNetball Stadium\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nParkinson \"A\"\n\nCOMM. DEV. / RES. CN\n\nParkinson\" B\"\n\nPassage Road\n\nPrincess Royal\n\nSpring Garden\n\nSt. Pauls/Delamere\n\nx\n\nCLUB\n\nStation Hill\n\nCOMM. DEV. / RES. CN\n\nValery\nVictor Clarke/Aubrey\nGrant\nWarrens\n\nWesley Hall Primary\n\nWeymouth \"B\"\n\nx\n\nx\n\nLAWRENCE T. GAY\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nWESLEY HALL PRI.\n\n x\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nPARKINSON SCHOOL\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nx\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 36\n\n\fS U M M A R Y OF FACILITIES\n\nNumber of Pavilions\n-\nNumber of Playing fields -\nNumber of Hard Courts  -\n\n  70\n107\n  77\n\nNo. of Pavilions under the control of the National Sports Council\nNo. of Pavilions owned by Community Development\nNo. of Pavilions owned by Clubs\n\nNo. of Playing Fields with lights\nNo. of Playing Fields under the control of the National Sports Council\nNo. of Playing Fields under the control of the BADMC\nNo. of Schools with Playing Fields under control of NSC\nNo. of Hard Courts with lights\nNo. of Hard Courts under the control of the NSC\nNo. of Hard Courts under the control of Schools\nNo. of Skate Parks under the control of the NSC\n\n-\n-\n-\n\n-\n-\n-\n-\n-\n-\n-\n-\n\n54\n09\n06\n\n46\n97 (44 with lights)\n05\n04 (01 with lights)\n66\n64 with lights)\n03 (01 with lights)\n01 (01 with lights)\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 37\n\n\fAnnex 3 - The Inter-Ministerial Committee on Sports – Terms of Reference\n\nObjective\n\nIn light of the cross-sectoral impact of sports and the implications of the National Sports\nPolicy  for  the  stakeholder  ministries,  an  Inter-Ministerial  Committee  on  Sports  will  be\nestablished to facilitate the implementation of the relevant aspects of the Policy by the\nrespective  Ministries.  The  Inter-Ministerial  Committee  on  Sports  will  also  work  towards\nachieving synergies and greater efficiency and effectiveness with respect to the application\nof sports, its development and its contribution to the economy of Barbados.\n\nScope of Services\n\nThe  duties  and  responsibilities  of  the  Inter-Ministerial  Committee  on  Sports  shall  be  as\nfollows:\n\n  promote the goals, objectives and desired outcomes of the National Sports Policy;\n\n\n\nidentify  sports-related  core  competencies  within  the  stakeholder  ministries  and\npromote the use of these competencies in the implementation of the National Sports\nPolicy;\n\n  promote  information-sharing  among  the  stakeholder  ministries,  with  respect  to  the\n\nNational Sports Policy and its implementation;\n\n  monitor and evaluate the participation of the stakeholder ministries and their progress\n\ntowards achieving the objectives of the National Sports Policy;\n\n  collaborate  on  the  implementation  of  the  National  Sports  Policy  by  the  stakeholder\n\nministries;\n\n\n\nidentify emerging opportunities and changes in the environment relative to the Policy,\nand agree on strategies for addressing such matters;\n\n  collaborate towards the development, promotion and delivery of sports initiatives by\n\nstakeholder ministries;\n\n  collaborate towards optimising the use of resources that are allocated by stakeholder\n\nministries for sports-related activities; and\n\n  advise the Ministry of Youth, Sports and Community Empowerment on addressing any\nchallenges  or  issues  emerging  from  stakeholder  ministries,  as  it  relates  to  the\nimplementation of a National Sports Policy.\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 38\n\n\fComposition of the Committee\n\nThe Inter-Ministerial Committee on Sports shall be comprised as follows:\n\n  The Permanent Secretary, Ministry of Youth, Sports and Community Empowerment or\n\nhis or her nominee (Chairman);\n\n  The Permanent Secretary, Ministry of Education, Technological and Vocational Training\n\nor his or her nominee (Deputy Chairman);\n\n  The Permanent Secretary, Ministry of Tourism and International Transport or his or her\n\nnominee;\n\n  The Permanent Secretary, Ministry of Finance, Economic Affairs and Investment or his\n\nor her nominee;\n\n  The Permanent Secretary, Ministry of Health and Wellness or his or her nominee;\n\n  The Permanent Secretary, Ministry of Small Business, Entrepreneurship and Commerce\n\nor his or her nominee;\n\n  The Permanent Secretary, Ministry of People Empowerment and Elder Affairs or his or\n\nher nominee; and\n\n  The Permanent Secretary, Ministry of Environment and Natural Beautification or his or\n\nher nominee.\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 39\n\n\f9.  REFERENCES:\n\ni World Health Organization (2018) Non-communicable Diseases (NCD) Country Profiles.\nhttps://www.who.int/nmh/countries/2018/brb_en.pdf?ua=1\n\nii PR Newswire (2019) $614 Billion by 2022: The Business Research Company.\n\nhttps://markets.businessinsider.com/news/stocks/increasing-sports-sponsorships-will-drive-the-global-\nsports-market-to-614-billion-by-2022-the-business-research-company-1028360019#\n\nMinistry of Youth, Sports and Community Empowerment\n\nNATIONAL SPORTS POLICY\n\nPage 40\n\n"
}