{
  "bill_id": 683,
  "slug": "resolution-re-acquisition-of-land-at-lot-5a-waterford-st-michael",
  "title": "Resolution re Acquisition of land at Lot 5A, Waterford, St Michael",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/4b2c8a1298974100f432740c2d870d87.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-02-15",
  "first_reading": "2023-02-14",
  "gazette_date": null,
  "markdown": "2023-02-09\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the\n\nLand  Acquisition  Act,  Cap.  228  approve  the  compulsory  acquisition  by  the  State  of  the\n\nparcel of land situate at Lot 5A, Waterford in the parish of Saint Michael in this Island and more\n\nparticularly  described  in  the  Schedule  to  this  Resolution  for  a  public  purpose,  namely  the\n\nconstruction of a District Hospital.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo Thousand and Twenty-Three.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                            day  of                                                    ,\n\nTwo Thousand and Twenty-Three.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  the  property  of  Caribbean  Consultants  Ltd.,  a  company\n\nincorporated under the Companies Act, Cap. 308 situate at Lot 5A, Waterford in the parish of\n\nSaint Michael in this Island containing by admeasurement 13 025.7 square metres (inclusive of\n\n265.4 square metres of verge) abutting and bounding on the ABC Highway Road Reserve (which\n\nseparates the said land from the ABC Highway) on lands now or formerly the Barbados Government on\n\na road and on a road reserve 7.92 metres wide or however else the same may abut and abound\n\nas delineated and shown on a Plan certiﬁ ed on the 8th day of February, 2023 by Alex Chandler,\n\nLand Surveyor and recorded in the Lands and Surveys Department on the 9th day of February,\n\n2023 as Plan No. 216/2023.\n\n\f3\n\nADDENDUM\n\nThe  Cabinet,  at  its  meeting  on  the  16th day  of  September,  2021  agreed  to  the\n\ncompulsory acquisition of 1.303 hectares (13 025.7 square metres) of land situate at Lot 5A,\n\nWaterford in the parish of Saint Michael, the property of Caribbean Consultants Limited for the\n\npublic purpose of the construction of a District Hospital.\n\nIn accordance with the provisions of section 5 of the Lands Acquisition Act, Cap. 228,\n\nthe approval of Parliament is now sought for the compulsory acquisition of the parcel of land\n\ndescribed  in  the  Schedule  to  this  Resolution  in  order  that  the  public  purpose  set  out  in  this\n\nResolution may be eﬀ ected and that the State may acquire an indefeasible title to the said parcel\n\nof land.\n\n"
}