{
  "bill_id": 684,
  "slug": "resolution-re-sale-of-land-at-lot-13-lower-estate-st-michael",
  "title": "Resolution re Sale of land at Lot 13, Lower Estate, St. Michael",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/81f1055134102fe0deb0b7fb54b4fd3a.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-02-15",
  "first_reading": "2023-02-14",
  "gazette_date": null,
  "markdown": "2023-02-09\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  28(c)  of  the\n\nLand  Acquisition  Act,  Cap.  228  approve  the  sale  of  a  parcel  of  land,  the  property  of  the\n\nState,  situate  at  Lot  13,  Lower  Estate  in  the  parish  of  Saint  Michael  and  more  particularly\n\ndescribed in the Schedule to this Resolution, to Edgstrong Holdings Ltd., a company incorporated\n\nunder the Companies Act, Cap. 308.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo Thousand and Twenty-three.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                            day  of                                                    ,\n\nTwo Thousand and Twenty-three.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL THAT land the property of the State situate at Lower Estate in the parish of\n\nSaint Michael in this Island, namely, Lot 13 containing by admeasurement 24 295.0 square metres\n\n(inclusive  of  3  891.0  square  metres  in  road  reserve)  abutting  and  bounding  on  lands  now  or\n\nformerly of the Barbados Government (Section A, Lots 2 and 3) on a carriageway 6.96 metres wide\n\nwith verges 1.52 metres wide and on a public road leading to a roundabout in one direction and to\n\nErrol Barrow Highway in the other direction or however else the same may abut and bound as\n\nshown and delineated on a Plan certiﬁ ed on the 18th day of June, 2009 by Camille Belgrave,\n\nLand Surveyor and recorded in the Lands and Surveys Department on the 29th day of June, 2009\n\nas Plan No. 797/2009.\n\n\f3\n\nADDENDUM\n\n            The  Cabinet  at  its  meeting  held  on  the  27th  day  of  October,  2022  considered\n\nNote (22) (2) 1150/MHLM 77 and agreed to the following:\n\n(a)\n\nto rescind its decision to sell 2.4295 hectares (24 295.0 square metres)\n\nof State land situate at Lot 13 Lower  Estate,  Saint Michael to Caribbean\n\nConsultants Limited  a company incorporated under the Companies Act, Cap.\n\n308 in consideration of the sum of $3,000,000.00  under section 28(c) of the\n\nLand Acquisition Act, Cap. 228; and\n\n(b)\n\nto sell 2.4295 hectares (24 295.0 square metres) of State land situate at Lot 13,\n\nLower Estate, Saint Michael to Edgstrong Holdings Ltd. in consideration\n\nof the sum of $3,000,000.00   u n d e r   s e c t i o n   2 8 ( c )   o f   t h e   L a n d\n\nAcquisition Act, Cap. 228.\n\nThe said parcel of land more particularly described in the Schedule to this Resolution\n\nformed part of a larger parcel measuring 21.259 acres of land which was acquired by the Crown\n\non the 14th  day of July, 1980 in accordance with section 5 of the Land Acquisition Act, Cap. 228\n\nas evidenced by Statutory Instrument No. 101 of 1980.\n\nIn accordance with the provisions of section 28(c) of the Land Acquisition Act,\n\nCap.  228  the  approval  of  Parliament  is  now  sought  for  the  sale  of  the  parcel  of  land\n\ndescribed in the Schedule to this Resolution to Edgstrong Holdings Ltd., in consideration of the\n\nsum of $3,000.000.00.\n\n"
}