{
  "bill_id": 689,
  "slug": "public-procurement-amendment-bill-2023",
  "title": "Public Procurement (Amendment) Bill, 2023",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/44be6497064406de8681a7cb5f5ef8ad.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-04-01",
  "first_reading": "2023-03-23",
  "gazette_date": "2023-03-28",
  "markdown": "2023-03-22\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Public Procurement Act, 2021 (Act 2021-30) to\nclarify the circumstances in which certain procurement arrangements entered into\nby Barbados will prevail over the Act, make it clear that procurement proceedings\nmay  be  conducted  electronically  and  simplify  the  process  for  registration  of\nsuppliers.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 3 of Act 2021-30\n\nAmendment of section 12 of Act 2021-30\n\nRepeal and replacement of section 85 of Act 2021-30\n\nRepeal and replacement of section 86 of Act 2021-30\n\nRepeal and replacement of section 87 of Act 2021-30\n\nAmendment of section 90 of Act 2021-30\n\nCommencement\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Public Procurement Act, 2021.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2023.\n\nThis Act may be cited as the Public Procurement (Amendment) Act,\n\n\f4\n\nAmendment of section 3 of Act 2021-30\n\n2.\nSection 3(2) of the Public Procurement Act, 2021 (Act 2021-30), in\nthis Act referred to as the principal Act, is deleted and the following substituted:\n\n“(2)\n\nNotwithstanding subsection (1), to the extent that\n\n(a)\n\n(b)\n\nany other provision of this Act conflicts with the Protocol; or\n\nthis  Act  conflicts  with  an  obligation  of  the  State  under  or\narising out of a treaty or other form of agreement between\nBarbados and\n\n(i)\n\n(ii)\n\nanother state, including an agreement for technical or\nother cooperation;\n\nan  authority  or  agent  of  another  state  including  a\nstatutory body or other enterprise owned or controlled\nby the state and a private enterprise acting as an agent\nof the state; or\n\n(iii)\n\nan international or regional organization including an\ninternational financial institution,\n\nthe requirements of the Protocol, treaty or other agreement shall prevail.\n\nFor the avoidance of doubt, public procurement proceedings may\n\n(3)\nbe conducted wholly or partially by electronic means.”.\n\nAmendment of section 12 of Act 2021-30\n\n3.\nfollowing substituted:\n\nSection  12(c)  and  (d)  of  the  principal  Act  are  deleted  and  the\n\n“(c)\n\nmaximizes economy and efficiency and promotes best value\nfor money;\n\n(d)\n\npromotes sustainable development; and\n\n\f5\n\n(e)\n\npromotes the socio-economic policies of Government.”.\n\nRepeal and replacement of section 85 of Act 2021-30\n\n4.\nsubstituted:\n\nSection  85  of  the  principal  Act  is  deleted  and  the  following\n\n“Suppliers Register\n\n85.(1)\na register to be called the Suppliers Register.\n\nThe Chief Procurement Officer shall establish and maintain\n\n(2)\n\nThe Suppliers Register\n\n(a)\n\nshall include in respect of every supplier registered pursuant\nto section 86\n\n(i)\n\n(ii)\n\n(iii)\n\nthe name, address and other contact information of the\nsupplier;\n\nevidence regarding the legal capacity of the supplier to\nenter into a procurement contract;\n\na statement as to whether the supplier is registered as a\nsupplier of goods, services or works or a combination\nof the three;\n\n(iv)\n\nthe unique registration number assigned to the supplier\npursuant to section 86(4); and\n\n(v)\n\nthe date of registration; and\n\n(b)\n\nmay include, where available\n\n(i)\n\nthe  taxpayer  identification  number  and  national\ninsurance number of the supplier;\n\n(ii)\n\nthe bank account information of the supplier;\n\n\f6\n\n(iii)\n\n(iv)\n\n(v)\n\nany  information  available  as  to  the  eligibility  of  the\nsupplier to participate in public procurement;\n\nany information available as to the qualifications of the\nsupplier  to  supply  the  goods,  services  or  works  he\nproposes to supply;\n\na record of the current and past procurement contracts\nof the supplier, if any, and of his performance under the\ncontracts; and\n\n(vi)\n\nsuch  other  information  as  the  Chief  Procurement\nOfficer may consider appropriate.\n\nThe Chief Procurement Officer shall, twice annually, publicize\n(3)\nthe  existence  of  the  Suppliers  Register  and  the  requirement  and\nprocedure for suppliers to be registered.\n\nThe entry of the name of a supplier in the Suppliers Register shall\n(4)\nnot  be  construed  as  an  indication  that  the  supplier  is  suitable  to\nparticipate in any particular procurement.”.\n\nRepeal and replacement of section 86 of Act 2021-30\n\n5.\nsubstituted:\n\nSection  86  of  the  principal  Act  is  deleted  and  the  following\n\n“Suppliers to be registered\n\n86.(1)\nA  procuring  entity  shall  not  enter  into  a  procurement\ncontract  with  a  supplier  unless  the  supplier  is  registered  under  this\nsection.\n\n\f7\n\n(2)\nThe Chief Procurement Officer shall, as soon as practicable after\nthe commencement of this Act, enter in the Suppliers Register, the name\nof any supplier who\n\n(a)\n\nimmediately  before  the  commencement  of  this  Act  was\nregistered with the Chief Procurement Officer; and\n\n(b)\n\nconsents to such entry,\n\nand such a supplier shall be taken to be registered for the purposes of\nthis section.\n\nA person other than a supplier described in subsection (2) may\n(3)\napply  to  the  Chief  Procurement  Officer,  in  such  form  as  the  Chief\nProcurement Officer may specify, to be registered as a supplier; and the\nChief Procurement Officer may register the person upon receipt of the\ninformation specified in section 85(2)(a)(i) to (iii).\n\nThe Chief Procurement Officer shall issue a unique registration\n\n(4)\nnumber to every registered supplier.\n\nRegistration under this section is valid for one year and may be\n(5)\nrenewed annually by such date as the Chief Procurement Officer may\nspecify.”.\n\nRepeal and replacement of section 87 of Act 2021-30\n\n6.\nsubstituted:\n\nSection  87  of  the  principal  Act  is  deleted  and  the  following\n\n“Changes affecting registration\n\n87.(1)\nWhere a material change in the circumstances of a supplier\nrenders information submitted to the Chief Procurement Officer for the\npurposes  of  registration  under  section  86  misleading,  inaccurate  or\n\n\f8\n\nincomplete, the supplier shall, as soon as practicable, notify the Chief\nProcurement Officer in writing of the change.\n\n(2)\nIn  subsection  (1),  “material  change”  includes  a  change  of  the\nname  under  which,  or  the  address  at  which,  the  supplier  conducts\nbusiness and a change that renders a supplier ineligible to participate\nin public procurement.\n\nThe Chief Procurement Officer shall, where he is satisfied that\n(3)\nany information in the Suppliers Register is misleading, inaccurate or\nincomplete\n\n(a)\n\n(b)\n\nalter the register to rectify the matter; and\n\nwhere the alteration was made otherwise than at the request\nof a supplier but substantially affects the supplier, notify the\nsupplier in writing of the fact of the alteration and the nature\nof it.”.\n\nAmendment of section 90 of Act 2021-30\n\n7.\nword “who”, the words “is or”.\n\nSection 90(1) of the principal Act is amended by inserting after the\n\nCommencement\n\n8.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  day  to  be  fixed  by\n\n\f9\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2023.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2023.\n\nPresident\n\n"
}