{
  "bill_id": 691,
  "slug": "resolution-re-vesting-of-land-in-nhc-hanson-plantation",
  "title": "Resolution re Vesting of Land in NHC, Hanson Plantation",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/0477c87ced6e4c5f655a757c0a843f5b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-03-28",
  "first_reading": "2023-03-29",
  "gazette_date": null,
  "markdown": "2023-03-15\n\nPARLIAMENT\n\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands\n\n(Vesting and Disposal) Act, Cap. 225 approve the vesting in the National Housing Corporation\n\nof the parcel of land, the property of the State, situate at Hanson Plantation in the parishes of\n\nSaint George and Christ Church in this Island and more particularly described in the Schedule\n\nhereto for residential and commercial purposes.\n\nAPPROVED by the House of Assembly this                  day of                                                ,\n\nTwo thousand and twenty-three.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                            day  of                                                    ,\n\nTwo thousand and twenty-three.\n\nPresident\n\n\f2\n\nSCHEDULE\n\nALL THAT land the property of the State situate at Hanson Plantation in the\n\nparishes of Saint George and Christ Church in this Island (formerly part of a larger parcel of\n\nlands of Hanson Plantation) containing by admeasurement 8.353 hectares or thereabouts abutting\n\nand  bounding  on  lands  now  or  late  of  McDonald  Best  (Lot  4)  on  lands  now  or  formerly  of\n\nKingsland Estates Ltd. (Hanson Plantation) on two sides on other lands now or formerly of the\n\nBarbados Government on lands now or formerly of the National Housing Corporation (Open\n\nArea 4) and on an unpaved road leading to Highway #5 or however else the same may abut\n\nand bound as shown and delineated on a plan certiﬁ ed on the 1st day of March, 2023 by Samuel\n\nN. Taylor, Land Surveyor and recorded in the Lands and Surveys Department on the 1st day of\n\nMarch, 2023 as Plan No. 352/2023.\n\n\f3\n\nADDENDUM\n\n  By a Planning Obligation Agreement dated 31st March, 2021 made between Kingsland\n\nEstates Limited and the Minister charged with the responsibility for Planning and Development,\n\nit was agreed that Kingsland Estates Limited would convey 16.40 hectares of land situate at\n\nHanson Plantation in the parishes of Saint George, Saint Michael and Christ Church to the State\n\nto secure a planning obligation.\n\n  By Application  No.  1356/10/2020D  dated  2nd  October,  2020,  Kingsland  Estates\n\nLimited applied to the Director of Planning and Development for permission to develop land,\n\nin  particular,  to  subdivide  16.40  hectares  of  land  from  other  lands  of  Hanson  Plantation  for\n\nagricultural purposes.\n\n  By letter from the Permanent Secretary in the Prime Minister's Oﬃ  ce, dated 25th October,\n\n2021 planning permission was granted subject to certain conditions namely:\n\n  1.      Where  5  or  more  years  expire  before  the  development  for  which  planning\n\n           permission  was  granted  takes  place,  the  permission  shall  be  deemed  to  have\n\n           lapsed  requiring  a  new  application  in  writing  to  the  Director  of  Planning  and\n\n           Development;\n\n\f4\n\nADDENDUM - (Cont'd)\n\n  2.      The  submission  of  a  Certiﬁ ed  Surveyor's  Plot  (or  plots  if  appropriate)  of  the\n\n           subdivision and approval thereof by the Director of Planning and Development;\n\n           and\n\n  3.      The  applicant  Kingsland  Estates  Limited  was  required  to  enter  into  a  Planning\n\n           Obligation Agreement with the Government of Barbados within 3 months of the date\n\n           of the permission relating to the conveyance of the area labelled \"Parcel A\" on the\n\n           Site  Plan  stamped  \"approved\"  referred  to  in  the  said  agreement  as    the  \"Lower\n\n           Burney Site\".\n\n  To discharge the condition numbered 2 of the planning permission, Kingsland Estates\n\nLimited caused to be made a plan certiﬁ ed on 24th January, 2022 by Samuel N. Taylor, Land\n\nSurveyor which was submitted to and approved by the Director of Planning and Development\n\non  5th  May,  2022  showing  the  16.40  hectares  as  subdivided  from  other  lands  of  Hanson\n\nPlantation.\n\n  By  Certiﬁ cate  of  Compliance  dated  30th  May,  2022,  the  Director  of  Planning  and\n\nDevelopment certiﬁ ed that the conditions numbered 2 and 3 of the planning permission had been\n\ndischarged to his satisfaction and there was no objection to the sale, lease or other disposal of\n\nthe 16.40 hectares.\n\n\f5\n\nADDENDUM - (Concl'd)\n\n  By Conveyance dated 5th September, 2022 made between Kingsland Estates Limited and\n\nthe State, the 16.40 hectares of land was conveyed to the State in accordance with the terms and\n\nconditions of the Planning Obligation Agreement.\n\n  The Cabinet at its meeting held on 13th October, 2022 considered Note (22) (2) 1062/\n\nMHLM 69 and approved the proposal to vest the recently conveyed 16.40 hectares of State lands\n\nat Lower Burney in the National Housing Corporation for housing development. At that meeting\n\nthe Cabinet also noted that 20 acres of land at Lower Burney would be assigned for joint venture\n\npartnerships with the private sector.\n\n  Subsequently, the Cabinet at its meeting held on 2nd March, 2023 considered Note (23)\n\n165/MHLM 17 and rescinded its decision to vest the 16.40 hectares of State lands in the National\n\nHousing Corporation for housing development and agreed to vest 8.046 hectares of the 16.40\n\nhectares of State lands in Home Ownership Providing Energy Inc. (HOPE Inc.) for housing\n\ndevelopment  and  the  remaining  8.353  hectares  in  the  National  Housing  Corporation  for\n\nresidential and commercial purposes.\n\n  The approval of Parliament is now sought for the vesting of the parcel of land containing\n\n8.353  hectares  and  more  particularly  described  in  the  Schedule  in  the  National  Housing\n\nCorporation for residential and commercial purposes.\n\n"
}