{
  "bill_id": 697,
  "slug": "water-reuse-bill-2023-20230517",
  "title": "Water Reuse Bill, 2023 (2023-05-17)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/2247ae8846baf69ac0f89205ac43ddd4.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-05-24",
  "first_reading": "2023-05-23",
  "gazette_date": null,
  "markdown": "2023-05-17\n\nOBJECTS AND REASONS\n\nThis  Bill  would  provide  for  the  capture,  collection,  treatment  and  reuse  of\n\nwastewater for various purposes.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nAct binds State\n\nAdministration\n\nPART II\n\nWATER REUSE COMMITTEE\n\nEstablishment of Committee\n\nFunctions of Committee\n\nDirections\n\nPART III\n\nWASTEWATER TREATMENT PERMIT\n\nPermit required to produce reclaimed water for sale etc.\n\nApplication for permit\n\n\f3\n\n10.\n\nDetermination of application and issue of permit\n\n11.\n\nDisplay of permit\n\n12.\n\nAmendment of permit\n\nPART IV\n\nOPERATION OF WASTEWATER TREATMENT PLANT AND USE OF\nRECLAIMED WATER\n\n13.\n\nTypes of wastewater for use in wastewater treatment plant\n\n14.\n\nUse of reclaimed, non-potable water\n\n15.\n\nProhibition on obtaining reclaimed water from person without permit\n\nPART V\n\nINSPECTION AND ENFORCEMENT\n\n16.\n\nInspection\n\n17.\n\nInspection before permit issued\n\n18.\n\nRe-inspection\n\n19.\n\nReport on inspection\n\n20.\n\nWarning\n\n21.\n\nSuspension or revocation of permit\n\n\f4\n\nPART VI\n\nMISCELLANEOUS\n\n22.\n\nExperts\n\n23.\n\nWastewater Register\n\n24.\n\nOffences\n\n25.\n\nOffence continuing after conviction\n\n26.\n\nAdministrative penalties\n\n27.\n\nAmendment of Schedule\n\n28.\n\nRegulations\n\nSCHEDULE\n\nWATER REUSE COMMITTEE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  provide  for  the  capture,  collection,  treatment  and  reuse  of\n\nwastewater for various purposes.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Water Reuse Act, 2023.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“agricultural wastewater” means\n\n(a)\n\n(b)\n\nexcess  water  that  runs  off  the  field  or  other  areas  during  surface\nirrigation or watering, containing salts, nutrients, pesticides, herbicides\nand other agricultural chemicals from the field or other areas;\n\nwastewater  generated  from  the  handling  of  crops  and  from  food\nprocessing  operations,  usually  with  a  high  concentration  of  organic\nmatter;\n\n(c)\n\nwastewater generated from caring for and slaughtering farm animals;\n\n“approved form” means such form as the Minister may approve for the purposes\n\nof this Act;\n\n“black water” means wastewater that includes urine or human excreta with paper\n\nor both;\n\n“Committee” means the Water Reuse Committee established by section 5;\n\n“domestic wastewater” means black water and grey water generated in a house\n\nor other dwelling place;\n\n“edible crops” means crops for human consumption;\n\n\f“grey water” means wastewater generated from a kitchen, sink, shower, bathtub\n\n7\n\nor washbasin or from laundry in\n\n(a)\n\n(b)\n\n(c)\n\na house or other dwelling place;\n\nan office building; or\n\na hotel or similar building;\n\n“industrial  wastewater”  means  wastewater,  containing  toxic  or  non-toxic\n\nchemical compounds or biological matter, generated in\n\n(a)\n\na manufacturing or industrial process as a means of cooling during the\nprocess;\n\n(b)\n\na production process, and later separated; or\n\n(c)\n\noffice buildings, stores, shops and commercial centres;\n\n“inspector”  means  the  Chief  Medical  Officer,  the  Director,  Environmental\nProtection  Department  or  such  other  public  officer  as  the  Chief  Medical\nOfficer or the Director may authorise to conduct an inspection under this\nAct;\n\n“Minister” means the Minister with responsibility for Health;\n\n“non-potable water” means water which is not of a standard to be used as potable\n\nwater;\n\n“Permanent  Secretary”  means  the  Permanent  Secretary  of  the  Ministry  with\n\nresponsibility for Health;\n\n“permit holder” means a person who holds a wastewater treatment permit;\n\n“potable water” means water of a standard of treatment or quality which makes\n\nit suitable for domestic use or human consumption;\n\n“public officer” has the meaning assigned to it by section 2 of the Public Service\n\nAct, Cap. 29;\n\n\f8\n\n“reclaimed  water”  means  water  collected  from  wastewater  and  treated  or\nprocessed to meet specific water quality criteria for use by the public or in\na manner which may affect or impact the public;\n\n“surface  runoff”  means  water,  primarily  from  precipitation,  running  over  the\n\nlandscape;\n\n“wastewater” means\n\n(a)\n\nwater that has been used or is a by-product of an activity, and contains\nother matter, whether in a solid, liquid or gaseous state; and\n\n(b)\n\nsurface runoff;\n\n“wastewater treatment permit” means a permit described in section 8.\n\nAct binds State\n\n3.\n\nThis Act binds the State.\n\nAdministration\n\n4.(1)\n\nThe Minister is responsible for the administration of this Act.\n\nThe  Minister  may  delegate  to  such  public  officer  as  he  considers\n(2)\nappropriate  any  function  related  to  the  administration  of  this  Act  except  his\nfunctions under sections 27 and 28.\n\nWithout prejudice to the generality of subsections (1) and (2), the Minister\n(3)\nmay  delegate  to  the  Permanent  Secretary  or  the  Chief  Medical  Officer,  his\nfunctions  in  respect  of  wastewater  treatment  permits  including  the  issue,\nregistration, amendment, suspension and revocation of such permits.\n\nNotwithstanding subsection (1), for the avoidance of doubt, the Director,\n\n(4)\nEnvironmental Protection Department shall be responsible for\n\n(a)\n\nthe inspection of a wastewater treatment plant or premises on which\nsuch  a  plant  is  to  be  situated  for  the  purpose  of  determining  its\nsuitability or continued suitability for producing reclaimed water for\nsale or other supply; and\n\n\f(b)\n\nmonitoring the impact of the operation of the plant on the environment.\n\n9\n\nPART II\n\nWATER REUSE COMMITTEE\n\nEstablishment of Committee\n\n5.(1)\nCommittee.\n\nThere  is  established  a  committee  to  be  known  as  the  Water  Reuse\n\nThe Schedule has effect with respect to the constitution of the Committee\n\n(2)\nand otherwise in relation to the Committee.\n\nFunctions of Committee\n\n6.(1)\n\nThe functions of the Water Reuse Committee are to\n\n(a)\n\n(b)\n\n(c)\n\nconsider and make recommendations to the Minister on any application\nfor a wastewater treatment permit;\n\ndetermine the suitability of premises and structures on premises for a\nwastewater treatment plant for the production of reclaimed water for\nsale or other supply to persons;\n\nmonitor each permit holder to determine whether the permit holder is\nin  compliance  with  this  Act  and  the  terms  and  conditions  of  his\npermit;\n\n(d)\n\ninquire into any complaint made against a permit holder; and\n\n(e)\n\nmake  recommendations,  where  appropriate,  on  the  suspension  or\nrevocation of any wastewater treatment permit.\n\n\f(2)\n\nThe Committee may, for the purposes of subsection (1)\n\n10\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nrequire a person to appear before the Committee to answer questions\nor produce reports or other documents with respect to an application\nfor a wastewater treatment permit;\n\nrequire  a  person  to  produce  a  report  or  other  document  where  it  is\nreasonably believed to contain information relevant to an application,\nand take and keep a copy of the report or other document;\n\nmake inquiries of a person, whether orally or in writing, with respect\nto an application for a permit, premises subject to a permit or any other\nmatter related to this Act; and\n\nrequire a person to appear before the Committee to answer questions\nor  produce  documents  with  respect  to  a  complaint  made  against  a\npermit holder.\n\nDirections\n\nThe Minister may give directions of a general nature as to the policy\n7.\nto be followed in the administration of this Act, as appear to the Minister to be\nnecessary in the public interest; and every person exercising a function in the\nadministration of this Act shall comply with the directions.\n\nPART III\n\nWASTEWATER TREATMENT PERMIT\n\nPermit required to produce reclaimed water for sale etc.\n\n8.\nwithout a permit issued to him by the Minister for the purpose.\n\nNo person shall sell or otherwise supply reclaimed water to another\n\n\f11\n\nApplication for permit\n\n9.(1)\nprescribed fee, apply to the Minister for a wastewater treatment permit.\n\nA  person  may,  in  the  approved  form  and  upon  payment  of  the\n\n(2)\nAn applicant shall submit with his application such information as may be\nrequired by the Minister to determine whether a permit should be issued to the\napplicant.\n\nDetermination of application and issue of permit\n\nWhere the Minister receives an application for a wastewater treatment\n10.(1)\npermit,  the  Minister  shall  submit  the  application  to  the  Committee  for\nconsideration.\n\nThe  Committee  may,  upon  consideration  of  the  application,  any  report\n(2)\nsubmitted pursuant to section 19 on an inspection conducted in relation to the\napplication, and such other information as may be relevant to the application,\nrecommend to the Minister that\n\n(a)\n\n(b)\n\nthe wastewater treatment permit be issued;\n\nconsideration  of  the  application  be  suspended  until  any  matter\nidentified by the Committee as requiring rectification is rectified to the\nsatisfaction of the Committee; or\n\n(c)\n\nthe application be refused.\n\n(3)\n\nWhere the Committee recommends that\n\n(a)\n\n(b)\n\na wastewater treatment permit be issued to an applicant, the Minister\nshall, in the approved form and upon payment of the prescribed fee,\nissue the permit to the applicant;\n\nconsideration of the application be suspended, the Minister shall notify\nthe applicant in writing of the matter to be rectified for the applicant to\nqualify for the issue of a permit; or\n\n\f12\n\n(c)\n\nthe application be refused, the Minister shall notify the applicant in\nwriting of the refusal and the reason for the refusal.\n\n(4)\n\nA wastewater treatment permit\n\n(a)\n\nshall be subject to such terms and conditions as the Minister, on the\nrecommendation of the Committee, shall specify in the permit;\n\n(b)\n\nis not transferable;\n\n(c)\n\n(d)\n\nis valid for 2 years; and\n\nmay be renewed on a further application under this section at least one\nmonth prior to the expiration of the permit.\n\nDisplay of permit\n\nA permit holder may display a copy of his wastewater treatment permit\n11.\nin a conspicuous place on the premises where he operates his business, and shall,\nwhere the permit is not displayed, ensure that the permit is available for inspection\nupon request.\n\nAmendment of permit\n\n12.(1)\n\nThe Minister may amend a wastewater treatment permit to\n\n(a)\n\nreflect a change in the name, address or other particulars of a permit\nholder; or\n\n(b)\n\nalter the terms and conditions of the permit.\n\nNotwithstanding subsection (1)(b), the Minister shall not amend the terms\n(2)\nand conditions of a permit without giving the permit holder notice in writing of\nthe  intended  action  and  the  reason  for  it,  and  an  opportunity  to  make\nrepresentations in relation thereto.\n\n\f13\n\nPART IV\n\nOPERATION OF WASTEWATER TREATMENT PLANT AND USE OF\nRECLAIMED WATER\n\nTypes of wastewater for use in wastewater treatment plant\n\nA permit holder may use the following types of wastewater to produce\n13.\nreclaimed water for sale or other supply, and use, in accordance with this Part:\n\n(a)\n\n(b)\n\n(c)\n\nagricultural wastewater;\n\nindustrial wastewater;\n\ndomestic wastewater;\n\n(d)\n\nsurface runoff.\n\nUse of reclaimed, non-potable water\n\n14.\n\nReclaimed water that is non-potable may be used for\n\n(a)\n\n(b)\n\n(c)\n\nflushing water closets;\n\ncleaning outdoor surfaces;\n\nwatering or irrigating\n\n(i)\n\nedible crops;\n\n(ii)\n\nhousehold gardens;\n\n(iii)\n\nornamental plants and trees; and\n\n(iv)\n\ngreen spaces;\n\n(d)\n\ncleaning animal pens, coops or holding areas;\n\n(e)\n\nflushing and cooling equipment;\n\n(f)\n\nfilling surface ponds or lakes;\n\n\f14\n\n(g)\n\n(h)\n\nrecharging the groundwater; and\n\nother similar purposes.\n\nProhibition on obtaining reclaimed water from person without permit\n\n15.(1)\nNo person shall purchase or otherwise obtain reclaimed water from a\nwastewater treatment plant unless a wastewater treatment permit has been issued\nin respect of the plant.\n\nA  permit  holder  who  sells  or  otherwise  supplies  reclaimed  water  shall\n\n(2)\nmaintain a register containing the following particulars:\n\n(a)\n\n(b)\n\nthe name, address and contact information of each person to whom the\nreclaimed water is supplied;\n\nthe volume of reclaimed water supplied to the person and the purpose\nfor which the person intends to use the reclaimed water;\n\n(c)\n\nthe date of the supply; and\n\n(d)\n\nsuch other information as may be required for the purposes of this Act.\n\nPART V\n\nINSPECTION AND ENFORCEMENT\n\nInspection\n\n16.(1)\nwhich such a plant is to be situated for the purpose of\n\nAn inspector may inspect a wastewater treatment plant or premises on\n\n(a)\n\n(b)\n\ndetermining an application for a wastewater treatment permit;\n\nassessing whether a matter required to be rectified by an applicant for\na permit, or by a permit holder, has been satisfactorily rectified;\n\n\f15\n\n(c)\n\nassessing whether a permit holder is in compliance with this Act, the\nterms and conditions of his permit or any request made, or direction\ngiven, in writing under this Act; or\n\n(d)\n\ndetermining whether this Act or a term or condition of a permit has\nbeen contravened,\n\nor for any other purpose related to the administration of this Act.\n\n(2)\n\nAn inspector may, for the purpose of an inspection under subsection (1)\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nenter any premises or any private road connected with such premises,\nand search the premises;\n\nstop  and  search  any  motor  vehicle  on  the  premises  that  is  used  to\ntransport wastewater or reclaimed water;\n\nconduct such surveys, examinations, investigations or other studies,\nand take such samples, as may be necessary;\n\nmake such copies of documents, take such photographs, make such\nvideos  or  voice  recordings  or  use  such  equipment,  technology  or\nfacility  as  may  be  necessary  to  ensure  that  evidence  to  support  the\nfindings of the inspection is acquired;\n\nrequire  the  production  of  any  report  or  other  document  which  is\nreasonably believed to contain information relevant to the purpose of\nthe inspection;\n\nmake inquiries of any person, whether orally or in writing; and\n\nexercise such other powers as may be necessary for the purposes of the\ninspection.\n\nAn  inspector  shall,  prior  to  an  inspection,  identify  himself  by  the\n\n(3)\nproduction of the official form of identification issued to him.\n\nAn  inspector  may  be  accompanied  and  assisted  in  an  inspection  by  a\n(4)\nmember  of  the  Barbados  Police  Service  or  an  expert  appointed  under section\n22 or both.\n\n\f16\n\nInspection before permit issued\n\nWithout prejudice to the generality of section 16, where an application\n17.\nfor  a  wastewater  treatment  permit  is  made,  an  inspector  shall,  before  the\napplication  is  determined,  inspect  the  premises  and  any  wastewater  treatment\nplant related to the application.\n\nRe-inspection\n\n18.\nAn inspector may, for the purposes of section 16, upon payment of\nthe prescribed fee by an applicant for a wastewater treatment permit or by a permit\nholder, conduct a re-inspection of any premises or wastewater treatment plant.\n\nReport on inspection\n\n19.(1)\n17 or 18, submit to the Minister a written report on the inspection.\n\nAn inspector shall, within 21 days of an inspection under section 16,\n\n(2)\n\nThe report shall include\n\n(a)\n\n(b)\n\nthe date and time of the inspection;\n\nwhere  the  inspection  relates  to  an  application  for  a  wastewater\ntreatment permit\n\n(i)\n\n(ii)\n\na recommendation with respect to the issue of the permit;\n\nan assessment of whether the premises meet the requirements for\nthe issue of the permit; and\n\n(iii)\n\nwhere the premises are deficient,\n\n(A)\n\nthe measures to be taken to rectify the deficiencies; and\n\n(B)\n\nthe date of any proposed re-inspection to ascertain whether\nthe measures have been taken;\n\n\f17\n\n(c)\n\nwhere the inspection relates to a wastewater treatment plant in respect\nof which a permit has been issued,\n\n(i)\n\na statement on whether the permit holder is in compliance with\nthis Act and the terms and conditions of the permit; and\n\n(ii)\n\nwhere the permit holder is not so in compliance\n\n(A)\n\nthe provisions of this Act or the terms and conditions of the\npermit which have been contravened;\n\n(B)\n\nthe nature of the contravention;\n\n(C)\n\n(D)\n\n(E)\n\nthe measures to be taken to rectify the contravention and the\ndate by which compliance is required;\n\nthe proposed date for re-inspection to reassess compliance;\nand\n\na  recommendation,  where  appropriate,  as  to  whether  the\npermit should be suspended or revoked; and\n\n(d)\n\nevidence in support of the findings of the inspection.\n\nAn applicant for a wastewater treatment permit or a permit holder, as the\n(3)\ncase may be, shall be provided with a written summary of a report of an inspection\nconcerning him; and the summary shall include\n\nthe date and time of the inspection; and\n\nthe  information  set  out  in  subsection  (2)(b)(ii)  and  (iii)  or  (c),  as\nappropriate.\n\n(a)\n\n(b)\n\nWarning\n\n20.(1)\nWhere an inspection reveals an area of concern which was the subject\nof a prior request for rectification, the Minister may, on the recommendation of\nthe Committee, issue a written warning to the permit holder requiring that the\narea of concern be rectified within a specified period.\n\n\f(2)\n\nThe warning shall\n\n18\n\n(a)\n\n(b)\n\n(c)\n\n(e)\n\nstate the area of concern;\n\ngive details of any prior written requests for rectification of the area of\nconcern including the number of times such requests were issued;\n\nindicate the measures to be taken to rectify the area of concern and the\ndate by which compliance is required; and\n\nadvise that non-compliance may result in the suspension or revocation\nof the permit.\n\nThe Minister may, subject to section 21, suspend or revoke a wastewater\n(3)\ntreatment  permit  where  the  permit  holder  fails  to  comply  as  required  in  a\nwarning.\n\nSuspension or revocation of permit\n\nSubject  to  subsections  (2)  and  (3),  the  Minister  may,  on  the\n21.(1)\nrecommendation of the Committee suspend or revoke a wastewater treatment\npermit where\n\n(a)\n\nthe permit holder\n\n(i)\n\nfails or refuses to comply with this Act, the terms and conditions\nof his permit or any request made, or direction given, in writing\nunder this Act;\n\n(ii)\n\nis convicted of an offence under this Act; or\n\n(iii)\n\nhas altered the operation of the wastewater treatment plant in such\na manner that he no longer qualifies for a wastewater treatment\npermit in respect of the plant;\n\nthe  permit  holder  or  his  agent  or  employee  refuses  to  facilitate  an\ninspection in accordance with this Act; or\n\nthere is a direct or indirect danger to the health or safety of persons\nfrom use of reclaimed water from the wastewater treatment plant, and\n\n(b)\n\n(c)\n\n\f19\n\nthe relevant authorities have given the necessary notifications under\nthe Health Services Act, Cap. 44, the Safety and Health at Work Act,\nCap. 356 or under any other relevant enactment.\n\nThe Minister shall not suspend or revoke a permit without giving the permit\n\n(2)\nholder\n\n(a)\n\n(b)\n\n(c)\n\nwritten notice of the intended suspension or revocation, and the reason\nfor it;\n\nwhere appropriate, a further period during which the permit holder may\nrectify any area of concern requiring rectification; and\n\n10 days, from the date of the notice, to make representations as to why\nthe permit should not be suspended or revoked.\n\n(3)\n\nThe Minister may suspend or revoke a permit where\n\n(a)\n\n(b)\n\nan area of concern is not rectified by the permit holder by the end of\nthe period described in subsection (2)(b); or\n\na suitable explanation as to why the permit should not be suspended or\nrevoked is not received from the permit holder by the end of the period\ndescribed in subsection (2)(c).\n\n(4)\n\nWhere the Minster suspends or revokes a permit, the Minister shall\n\n(a)\n\n(b)\n\ngive the permit holder written notice of the suspension or revocation;\nand\n\ncause  notice  of  the  suspension  or  revocation  and,  in  the  case  of  a\nsuspension,  of  the  period  of  the  suspension,  to  be  published  in  the\nOfficial Gazette.\n\nNotwithstanding  subsection  (2)(c),  where  subsection(1)(c)  applies,  the\n\n(5)\nMinister may suspend or revoke a permit with immediate effect.\n\n\f20\n\nPART VI\n\nMISCELLANEOUS\n\nExperts\n\nA person with a particular expertise, other than a public officer, may,\n22.\nwhere appropriate, be appointed in writing to assist the Committee or an inspector\nin the exercise of their functions under this Act including in\n\n(a)\n\n(b)\n\n(c)\n\nthe conduct of an inspection;\n\nthe assessment of an application for a wastewater treatment permit; and\n\nthe  monitoring  of  a  permit  holder  to  determine  whether  he  is  in\ncompliance with this Act and the terms and conditions of his permit.\n\nWastewater Register\n\nThe  Minister  shall  cause  to  be  maintained,  for  the  use  of  the\n23.(1)\nCommittee, a register to be known as the “Wastewater Register”, containing the\nfollowing particulars in respect of wastewater treatment permits:\n\n(a)\n\n(b)\n\nthe name, address and contact information of each permit holder;\n\nwhere a permit holder is a company, the registration number, registered\nbusiness address and names of the directors of the company;\n\n(c)\n\nthe number assigned to the permit;\n\n(d)\n\nthe date of issue and of expiration of the permit;\n\n(e)\n\nany amendment of the permit;\n\n(f)\n\nany period of suspension of the permit; and\n\n(g)\n\nany revocation of the permit and the date of the revocation.\n\n\f21\n\n(2)\nThe Minister shall cause to be published in the Official Gazette, by the\n31st of January each year, a list of the names and registered business addresses\nof permit holders.\n\nOffences\n\n24.(1)\n\nA person who\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nwithout  a  wastewater  treatment  permit,  sells  or  otherwise  supplies\nreclaimed water to another;\n\nmakes  available  or  misrepresents  as  fit  for  human  consumption,\nreclaimed water that is non-potable;\n\nuses non-potable water as potable water in a manner that may endanger\npublic health or safety; or\n\nuses black water to water, irrigate or treat edible crops which are to be\nor are sold or otherwise supplied for human consumption,\n\nis guilty of an offence and is liable, on summary conviction, to a fine of $500 000\nor to imprisonment for 10 years or both.\n\n(2)\n\nA person who\n\n(a)\n\n(b)\n\nobstructs an inspector or an expert appointed under section 22 in the\nexercise of a function under this Act;\n\nknowingly  gives  false  information  or  misleading  information  in\nconnection with an application for a wastewater treatment permit or an\ninspection under this Act; or\n\n(c)\n\ncontravenes section 15(2),\n\nis guilty of an offence and is liable, on summary conviction, to a fine of $50 000\nor to imprisonment for 5 years or both.\n\nFor the avoidance of doubt, a person whose wastewater treatment permit\n(3)\nis suspended or revoked shall not be regarded as being in breach of subsection\n\n\f22\n\n(1)  or  section  8  where  the  person  disposes  of  any  reclaimed  water  in  his\npossession in accordance with the written directions or approval of the Minister.\n\nOffence continuing after conviction\n\n25.\nWhere a person is convicted of an offence under section 24 and the\ncontravention of this Act leading to his conviction continues after conviction, the\nperson shall, unless he has a reasonable excuse for the continued contravention,\nbe  guilty  of  a  further  offence  under  this  Act  and  may,  on  conviction,  be\npenalized in accordance with that section.\n\nAdministrative penalties\n\n26.(1)\na permit holder has\n\nWhere the Minister is satisfied, on the advice of the Committee, that\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\ncontravened a term or condition of his wastewater treatment permit;\n\nfailed to maintain adequate and accurate records on the operations of\nthe wastewater treatment plant;\n\nfailed  to  provide  reports  or  other  documents  or  information  where\nrequired to do so under this Act; or\n\ncontravened any other provision of this Act or regulations made under\nthis Act,\n\nand the contravention does not constitute an offence, the Minister may, subject\nto  subsection  (4),  impose  on  the  permit  holder,  an  administrative  penalty  of\n$5000.\n\nWhere a permit holder is required to take measures, by a specified date, to\n\n(2)\nrectify\n\n(a)\n\n(b)\n\nan area of concern identified pursuant to an inspection; or\n\na contravention or failure described in subsection (1),\n\nand  the  Minister  is  satisfied,  on  the  advice  of  the  Committee,  that  the  permit\nholder has failed to take the measures, the Minister may impose on the permit\n\n\f23\n\nholder, in addition to the penalty specified in that subsection, an administrative\npenalty of $500 for every day or part of a day that the permit holder fails to take\nthe measures.\n\n(3)\n\nThe administrative penalty referred to in subsection (2)\n\n(a)\n\nmay be imposed from the day following the date by which the permit\nholder was required to have taken the measures; and\n\n(b)\n\nshall not be imposed in respect of a period of more than 30 days.\n\nThe Minister shall not impose an administrative penalty on a permit holder\n(4)\nunder  subsection  (1)  without  first  giving  the  permit  holder  written  notice  of\nimposition of the administrative penalty.\n\n(5)\n\nThe notice referred to in subsection (4) shall\n\n(a)\n\n(b)\n\n(c)\n\nspecify  the  nature  of  the  act  constituting  the  contravention  and  the\npenalty to be paid;\n\nrequire the permit holder to pay the penalty to the Minister within 10\ndays of the date of the notice; and\n\nadvise the permit holder that a further penalty of $500 for every day or\npart of a day may be imposed for a period of 30 days where the permit\nholder is required to take measures, by a specified date, to rectify a\nmatter  described  in  subsection  (2)(a)  or  (b)  but  fails  to  take  the\nmeasures.\n\nA person who is in receipt of an administrative penalty notice shall pay the\n(6)\namount of the penalty to the Minister and comply with any additional requirement\ncontained in the notice on or before the date specified in the notice.\n\n(7)\n\nAn administrative penalty may be recovered as a debt due to the State.\n\nAmendment of Schedule\n\n27.\n\nThe Minister may by Order amend the Schedule.\n\n\f24\n\nRegulations\n\n28.(1)\n\nThe Minister may make regulations for\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe standards of treatment to be applied in relation to reclaimed water\nfor sale or other supply to persons;\n\nstandards for the treatment of wastewater to be used in the operation\nof  a  wastewater  treatment  plant  otherwise  than  directly  to  obtain\nreclaimed water for sale or other supply;\n\nthe  mechanisms  and  standards  to  be  applied  in  relation  to  the\nmanagement of reclaimed water;\n\nthe tests to be conducted by a permit holder, and the form and procedure\nfor the submission of test results and related information;\n\n(e)\n\nsafe operating procedures;\n\n(f)\n\n(g)\n\n(h)\n\nthe forms and types of training and certification which a permit holder\nmust ensure among employees;\n\nthe fees to be paid under this Act; and\n\ngenerally giving effect to this Act.\n\nWhere regulations made under this Act create an offence, the regulations\n(2)\nmay provide for a penalty of a fine of $50 000 or imprisonment for 5 years or\nboth, on summary conviction in respect of the offence.\n\n\f25\n\nSCHEDULE\n\nWATER REUSE COMMITTEE\n\n(Sections 5 and 27)\n\nComposition\n\n1.\nofficio:\n\n(a)\n\n(b)\n\n(c)\n\nThe Water Reuse Committee shall comprise the following persons, ex\n\nthe Permanent Secretary or his nominee;\n\nthe Chief Medical Officer or his nominee;\n\nthe Director, Environmental Protection Department or his nominee;\n\n(d)\n\nthe Solicitor General or his nominee;\n\n(e)\n\nthe Director, Coastal Zone Management Unit or his nominee;\n\n(f)\n\n(g)\n\n(h)\n\nthe Chief Agricultural Officer or his nominee;\n\nthe Director, Analytical Services or his nominee; and\n\nthe Director of Planning and Development or his nominee.\n\nChairman and Deputy Chairman\n\n2.(1)\n\nThe Permanent Secretary shall be Chairman of the Committee.\n\nThe Chief Medical Officer shall be Deputy Chairman of the Committee\n\n(2)\nand shall, in the absence of the Chairman, function as Chairman.\n\nSecretary\n\n3.\nThe  Permanent  Secretary  shall  assign  a  public  officer  from  the\nMinistry with responsibility for Health to be secretary to the Committee to assist\nthe Committee with such clerical and secretarial duties as may be required.\n\n\f26\n\nQuorum\n\n4.\n\nFive members of the Committee shall constitute a quorum.\n\nMeetings\n\n5.(1)\nnecessary or expedient for the transaction of its business.\n\nThe  Committee  shall  meet  at  such  times  and  places  as  may  be\n\nNotwithstanding subparagraph (1), the Chairman may at any time summon\n\n(2)\na meeting of the Committee.\n\nThe secretary to the Committee shall ensure that minutes are kept for each\n\n(3)\nmeeting and confirmed\n\n(a)\n\n(b)\n\nby electronic means prior to the next meeting; or\n\norally or in writing at the next meeting.\n\nDecisions of the Committee shall be by a majority of votes and, where the\n\n(4)\nvoting is equal, the person presiding at a meeting shall have a casting vote.\n\nThe validity of the proceedings of the Committee shall not be affected by\n\n(5)\na vacancy amongst the members of the Committee.\n\nProcedure\n\n6.\nand proceedings.\n\nSubject to this Act, the Committee may regulate its own procedure\n\n"
}