{
  "bill_id": 708,
  "slug": "three-houses-spring-management-and-control-bill-2023",
  "title": "Three Houses Spring (Management and Control) Bill, 2023",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/69e8af693e5931b8e3c996b8f21b93ec.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-05-17",
  "first_reading": "2023-04-24",
  "gazette_date": "2023-04-27",
  "markdown": "2023-04-18\n\nOBJECTS AND REASONS\n\nThis Bill would provide for\n\n(a)\n\nthe management and control of the spring known as the Three Houses\nSpring;\n\n(b)\n\nthe categories of persons entitled to use the spring;\n\n(c)\n\nthe role and functions of the Barbados Agricultural Development and\nMarketing Corporation in respect of the management and control of\nthe spring;\n\n(d)\n\nthe settlement of disputes relating to the use of the spring;\n\n(e)\n\nthe repeal and replacement of the Three Houses Spring Act, 1713-1;\nand\n\n(f)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nApplication\n\nRole and functions of the BADMC\n\nEmergency measures\n\nRights of entry of the BADMC\n\nNotice of intention\n\nPersons entitled to use water\n\nFarmers at former River Plantation\n\n10.\n\nProhibited conduct\n\n11.\n\nInterference with functions of the BADMC\n\n12.\n\nEstablishment of the Oversight Committee\n\n13.\n\nSettlement of disputes\n\n14.\n\nRegulations\n\n15.\n\nRepeal\n\n\f3\n\n16.\n\nCommencement\n\nFIRST SCHEDULE\n\nDescription of Tree Houses Spring\n\nSECOND SCHEDULE\n\nMap of Tree Houses Spring\n\nTHIRD SCHEDULE\n\nRiparian Owners\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the management and control of the spring known as\n\nThree Houses Spring.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\nControl) Act, 2023.\n\nThis Act may be cited as the Three Houses Spring (Management and\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“BADMC”  means  the  Barbados  Agricultural  Development  and  Marketing\nCorporation established under the Barbados Agricultural Development and\nMarketing Corporation Act, Cap. 254;\n\n“BWA” means the Barbados Water Authority established under the Barbados\n\nWater Authority Act, Cap. 274A;\n\n“Committee” means the Three Houses Spring Oversight Committee established\n\nby section 12;\n\n“Minister” means the Minister responsible for Agriculture;\n\n“Permanent Secretary” means the Permanent Secretary with responsibility for\n\nthe Ministry of Agriculture;\n\n“pollute” includes\n\n(a)\n\n(b)\n\n(c)\n\ncontaminating  or  causing  a  change  in  the  physical,  chemical,\nbiological, bacteriological or other properties of the water in the spring;\n\nintroducing noxious or toxic substances in the water likely to cause\nharm to livestock, human beings, fauna or flora; or\n\ndegrading the quality of water or rendering the water less suitable for\nits use;\n\n“riparian owners” means the owners for the time being of lands adjacent to the\nspring and whose names are set out in the Third Schedule, their successors\nin title or assigns;\n\n\f7\n\n“spring” means the spring known as Three Houses Spring as described in the\n\nFirst Schedule and shown on a map in the Second Schedule.\n\nApplication\n\n3.\nThis Act shall apply to the spring described in the First Schedule and\ndelineated on a map in the Second Schedule notwithstanding anything contained\nin  the  Underground  Water  Control  Act,  Cap.  283  and  the  Barbados  Water\nAuthority Act, Cap. 274A.\n\nRole and functions of the BADMC\n\nThe  BADMC  shall  manage  and  control  the  spring  and  the  stream\n4.(1)\nflowing therefrom to ensure that all persons entitled to receive and use the water\nflowing from the spring are treated fairly and equitably.\n\n(2)\n\nThe BADMC shall\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nmaintain the proper alignment of the spring;\n\nkeep and maintain registers of all persons entitled to abstract and use\nwater from the spring;\n\nmeasure and regulate the flow of water from the spring and establish\nthe volume and distribution of water to maintain adequate water levels\nin the spring;\n\nregulate the manner in which water may be extracted from the spring\nand where the BADMC considers it necessary, install sluice-gates or\nsimilar contrivances or devices to control the volume or flow of water;\n\nensure the regular cleaning of the spring and the areas surrounding the\nspring;\n\ntransfer water from the spring to such channels, ponds or reservoirs as\nmay be deemed necessary or expedient;\n\nregulate the distribution of water from the spring among the persons\nentitled to receive and use the water:\n\n\f8\n\n(h)\n\ntake prompt action to prevent or rectify pollution of the spring;\n\n(i)\n\n(j)\n\n(k)\n\ncarry out tests to analyse the quality of the water;\n\ncause the abatement of any nuisances; and\n\nestablish water rates for the extraction and use of the water from the\nspring after consultation with the BWA.\n\nEmergency measures\n\n5.(1)\nWhere the BADMC is satisfied that the spring is in danger of its water\nbeing depleted or that there is an imminent threat to the spring the BADMC may\ndo all things necessary to protect and preserve the spring.\n\nWhere  Brown’s  Pond  becomes  flooded,  the  BADMC  shall  take  such\n(2)\nmeasures as are necessary or expedient, including channelling excess water into\nwells south of Brown’s Pond to alleviate the effects of flooding and to protect\nthe  crops  and  livestock  of  tenants  and  lessees  of  a  riparian  owner  or  the\nBADMC.\n\nRights of entry of the BADMC\n\n6.(1)\nSubject to subsections (2) and (3), the employees or duly authorized\nagents of the BADMC may enter the premises of a riparian owner, a lessee or\ntenant of a riparian owner, or a lessee or tenant of the BADMC to\n\n(a)\n\n(b)\n\noversee the laying of pipes and any associated equipment;\n\ninstall devices or contrivances for monitoring or managing the flow of\nwater in the spring;\n\n(c)\n\ninvestigate complaints in respect of the abuse of water in the spring;\n\n(d)\n\ninvestigate offences under this Act;\n\n(e)\n\nclean the spring;\n\n(f)\n\ndivert or impound water from the spring; or\n\n(g)\n\ndeal with anything likely to cause a nuisance.\n\n\f9\n\n(2)\nThe BADMC shall be liable to make reasonable compensation to any of\nthe persons referred to in subsection (1) for any loss or damage occasioned during\nthe performance of the functions of the BADMC under this section including\nrestoration of any of the damaged property to its original condition.\n\nCompensation  payable  under  this  section  may  be  in  such  amount  as  is\n(3)\nagreed between a person referred to in subsection (1) and the BADMC, or in\ndefault of agreement, in such amount as the Committee shall determine.\n\nNotice of intention\n\nThe BADMC shall give notice in writing to the owner or occupier of\n7.(1)\npremises, as the case may be, of its intention to commence work at least 3 days\nbefore employees or duly authorized agents perform any function under section\n5.\n\nIn  the  case  of  an  emergency  arising,  notice  shall  be  given  as  soon  as\n(2)\npossible after the necessity for the action has arisen or after the action is begun.\n\nPersons entitled to use water\n\n8.(1)\ncharge, for the purposes of\n\nA person shall be entitled to use the water from the spring, free of\n\n(a)\n\n(b)\n\n(c)\n\nshorebird hunting;\n\nmodel boat racing;\n\nfishing;\n\n(d)\n\nthe maintenance of a bird or wildlife sanctuary;\n\n(e)\n\nbathing; or\n\n(f)\n\nreligious practices.\n\n(2)\n\nSubject to any regulations made under this Act\n\n(a)\n\n(b)\n\nriparian owners;\n\nlessees, tenants, licencees of riparian owners; and\n\n\f10\n\n(c)\n\npersons claiming title from riparian owners\n\nshall be entitled to use the water from the spring free of charge.\n\nLessees or tenants of the BADMC shall be entitled to use the water from\n\n(3)\nthe spring at such rates and fees charged by the BADMC.\n\nA person who claims title from a riparian owner shall make an application\n(4)\nto the BADMC to be registered as a riparian owner and on proof of title shall be\nregistered as a riparian owner.\n\nThe  persons  referred  to  in  subsections  (2)  and  (3)  shall  be  entitled  to\n\n(5)\nabstract and use the water from the spring solely for the purposes of\n\n(a)\n\n(b)\n\n(c)\n\nagriculture production, including food production;\n\nhorticulture;\n\naquaculture;\n\n(d)\n\nlandscaping; or\n\n(e)\n\nthe maintenance of grounds and curtilages.\n\nA person who is entitled to abstract and use water from the spring under\n\n(6)\nsubsections (2) and (3) shall apply to the BADMC to do so.\n\nFarmers at former River Plantation\n\nTenants  or  occupiers  of  lands  situate  at  lands  formerly  of  River\n9.\nPlantation and now owned by the BADMC shall be entitled to receive water from\nBrown’s Pond by means of pipes for the purpose of irrigation on such terms and\nconditions as shall be agreed between the BADMC and such tenants or occupiers.\n\nProhibited conduct\n\n10.(1)\n\nA person who\n\n(a)\n\n(b)\n\nabstracts water for any other purpose than they are entitled;\n\ndiverts, dams, or blocks the spring;\n\n\f11\n\npollutes the spring; or\n\ninstalls any device or contrivance in or near to the spring which may\ninterfere with the free flow of water,\n\n(c)\n\n(d)\n\ncommits an offence and is liable on summary conviction to a fine of $25,000 or\nimprisonment for 2 years or to both.\n\nA person who commits an offence under subsection (1) shall be ordered\n\n(2)\nby the BADMC to take such action to rectify the condition of the spring.\n\nA person who fails to comply with the order of the BADMC made under\n(3)\nsubsection (2) shall be denied further use of the water from the spring until he\nrectifies the condition of the spring.\n\nInterference with functions of the BADMC\n\n11.\n\nA person who\n\n(a)\n\n(b)\n\ninsults, abuses or uses indecent language towards; or\n\nhinders or obstructs,\n\nan employee or duly authorised agent of the BADMC in the performance of their\nfunctions under this Act or regulations made under this Act commits an offence\nand is liable on summary conviction to a fine of $1 000.\n\nEstablishment of the Oversight Committee\n\n12.(1)\nHouses Spring Oversight Committee.\n\nThere is established the oversight committee to be known as the Three\n\n(2)\n\nThe Committee shall consist of\n\n(a)\n\nthe General Manager of the BWA who shall be the Chairperson of the\nCommittee;\n\n(b)\n\na representative of the BADMC; and\n\n(c)\n\na representative of riparian owners.\n\n\f12\n\nSubject to this Act, the Committee shall regulate its own procedure and\n\n(3)\nmay make rules for this purpose.\n\nThe function of the Committee is to settle disputes which may arise, as the\n\n(4)\ncase may be, between\n\n(a)\n\n(b)\n\npersons entitled to use the spring; or\n\npersons entitled to use the spring and the BADMC.\n\nSettlement of disputes\n\n13.(1)\ndispute shall first attempt to settle the dispute in accordance with this section.\n\nWhere  a  dispute  referred  to  in  section  12(4)  arises  the  parties  to  a\n\n(2)\n\nThe Committee shall first employ its good offices to settle the dispute.\n\nWhere the Committee is unable through its good offices to settle the dispute\n\n(2)\nit shall seek to have the dispute settled by recourse to mediation.\n\nWhere the parties to a dispute seek to have the dispute settled by mediation\n(3)\nthey may agree on a person to serve as the mediator or require the Committee to\nselect a mediator from the list of rostered mediators of the Supreme Court.\n\nWhere the parties to a dispute are unable to settle the dispute by mediation\n\n(4)\nthe parties may commence proceedings in the High Court.\n\nA party to a dispute shall commence the process for settling a dispute by\n\n(5)\ngiving notice in writing to the Permanent Secretary that a dispute exists.\n\nThe  Permanent  Secretary  shall  within  3  days  of  receiving  the  notice\n\n(6)\nforward it to the Chairperson of the Committee.\n\nRegulations\n\n14.(1)\nto provide for\n\nThe BADMC may with the approval of the Minister, make regulations\n\n(a)\n\nthe types, size and specifications of pipes and pumps to be used for the\nabstraction of water from the spring;\n\n\f13\n\n(b)\n\nthe use of water from the spring and the prioritization of its use;\n\n(c)\n\nthe rate of abstraction of water from the spring;\n\n(d)\n\nthe rates and charges for use of water from the spring;\n\n(e)\n\nthe exemption of persons from the payment of rates and charges for\nthe use of water from the spring;\n\n(f)\n\nspecial rates or charges payable in respect of the use of water; and\n\n(g)\n\ngiving effect to this Act generally.\n\nRegulations made under this Act may provide for a penalty not exceeding\n\n(2)\n$1 000 or imprisonment for a term not exceeding 18 months.\n\n(3)\n\nRegulations made under this Act are subject to negative resolution.\n\nRepeal\n\n15.\n\nThe Three Houses Spring Act, 1713-1 is repealed.\n\nCommencement\n\n16.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f14\n\nFIRST SCHEDULE\n\nDescription of Tree Houses Spring\n\n(Section 2)\n\nThe body of water as labelled “THS1” as shown on a map in the Second Schedule originating on\nlands  of  the  former  Tree  Houses  Plantation  bearing  the  approximate  coordinates  Easting\n40656.73,  Northing  72704.61  and  running  in  a  south-easterly  direction  towards  lands  of  the\nformer River Plantation and ending at approximate coordinates Easting 43132.04(m), Northing\n71118.52(m).\n\nThe body of water as labelled “THS2” as shown on a map in the Second Schedule from that part\nof  the  spring  labelled  “THS1”  identified  at  approximate  coordinates  Easting  41586.83(m),\nNorthing  7260.07(m)  and  running  in  a  north-easterly  direction  towards  the  former  Wiltshire\nPlanation and running through a pond commonly known as “The Jackman Pond” and ending near\nthe sea at approximate coordinates Easting 42414.59(m), Northing 73413.78(m).\n\nThe body of water labelled as “THS3” as shown on a map in the Second Schedule from that part\nof  the  spring  labelled  “THS1”  identified  at  approximate  coordinates  Easting  42594.10(m),\nNorthing 71483.38(m) and running in a south-westerly direction and ending at Brown’s Pond at\napproximate coordinates Easting 42414.61(m), Northing 71297.09(m).\n\n\f15\n\n L.R.O. 1998SECOND SCHEDULE(Section 2)Map of Three Houses Spring\f16\n\nTHIRD SCHEDULE\n\nRiparian Owners\n\n(Section 2)\n\nKEITH DURANT and HEATHER DURANT\n\nGEOFFREY ALLAN KINCH ET UX\n\nP J HOLDINGS LTD\n\nOSCAR A. BURGESS\n\nGORDON M. TAYLOR and MONIQUE BURKE-TAYLOR\n\nEDGE GROVE LTD\nMARCUS C. MORRIS\n\nTHE BARBADOS AGRICULTURAL DEVELOPMENT CORPORATION\n\nVICTOR A. PINTO\n\nRHONA GIBSON, ESBATH and LISA WESTERMAN and CHESTERFIELD WESTERMAN\n\nOSWALD T. SMALL\n\nHAROLD H. PARRIS and DALSTON PARRIS\n\nFRANTZ HAREWOOD-HAMBLIN\n\nANNA WENT\n\nLELON ADAMS\n\nANNETTE POWER\n\nWENDY WILKINSON and MAY ERNESTINE JACKMAN\n\n\f17\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2023.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2023.\n\nPresident\n\n"
}