{
  "bill_id": 712,
  "slug": "resolution-re-vesting-of-land-in-black-rock-in-badmc-for-agricultural-purposes",
  "title": "Resolution re vesting of land in Black Rock in BADMC for agricultural purposes",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/7d90a0344a4b83d8ee1ac644fcdc074c.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-05-03",
  "first_reading": "2023-05-17",
  "gazette_date": null,
  "markdown": "L.R.O. 1998\n\n2023-04-21\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the\n\nCrown Lands (Vesting and Disposal) Act, Cap. 225 approve the vesting of the parcel of land, the\n\nproperty of the State situate at Black Rock in the parish of Saint Michael in this Island and more\n\nparticularly described in the Schedule to this Resolution, in the Barbados Agricultural Development\n\nand Marketing Corporation, a corporation established by section 3 of the Barbados Agricultural\n\nDevelopment and Marketing Corporation Act, Cap. 254, for community agricultural purposes.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo Thousand and twenty-three.\n\nSPEAKER\n\nAPPROVED  by  the  Senate  this                            day  of                                                    ,\n\nTwo Thousand and twenty-three.\n\nPRESIDENT\n\n\f2\n\nL.R.O. 1998\n\nSCHEDULE\n\nALL THAT land the property of the State situate at Black Rock in the parish of\n\nSaint  Michael  in  this  Island  containing  by  admeasurement  1.356  hectares  (13  559  square\n\nmetres) or thereabouts (which comprises the Parcel A being 1.052 hectares (10 520.0 square\n\nmetres)  and  the  Parcel  B  being  0.304  hectares  (3  039.9  square  metres) Abutting  and\n\nBounding  on  lands  now  or  formerly  of  The  Barbados  Government  (Psychiatric  Hospital)\n\non  two  sides  on  lands  now  or  formerly  of  National  Housing  Corporation  \"Rosemont\"  on\n\ntwo sides on lands now or formerly of The Barbados Government (Lot 1B) on lands now or\n\nformerly of National Housing Corporation (Open Space) and on Madison Terrace leading to\n\nFarm Road or however else the same may abut and bound as shown and delineated on a Plan\n\ncertiﬁ ed on the 24th day of January, 2023 by Samuel N. Taylor, Land Surveyor and recorded\n\nin the Lands and Surveys Department on the 30th day of January, 2023 as Plan No. 142/2023.\n\n\f3\n\nL.R.O. 1998\n\nADDENDUM\n\nOn the 18th day of August, 2022, the Cabinet agreed to vest in the Barbados\n\nAgricultural Development and Marketing Corporation, a corporation established by section 3\n\nof  the  Barbados  Agricultural  Development  and  Marketing  Corporation  Act,  Cap.  254,\n\napproximately  18  596  square  metres  of  land  (comprising  two  parcels  of  land  containing\n\napproximately 15 531 square metres and 3 065 square metres, respectively) the property of the\n\nState situate at Deacons Farm, Deacons Road in the parish of Saint Michael for comnmunity\n\nagricultural purposes.\n\nBy  a  recent  survey,  the  said  parcel  of  land  was  found  to  be  sited  at  Black\n\nRock  in  the  parish  of  Saint  Michael  and  to  contain  by  admeasurement  1.356  hectares\n\n(13 559 square metres) (which comprises the Parcel A being 1.052 hectares (10 520.0 square\n\nmetres) and the Parcel B being 0.304 hectares (3 039.9 square metres).\n\nThe  said  parcel  of  land  more  particularly  described  in  the  Schedule  to\n\nthis  Resolution  became  vested  in  the  State  (formerly  the  Crown)  by  virtue  of  section\n\n2  of  the  Lunatic  Act,  1890  and  a  Conveyance  dated  the  7th  day  of  October,  1892  from\n\nJames Goldbourne Williams et al to the Executive Committee of the Island of Barbados and\n\nrecorded in the Land Registry of this Island on the 7th day of February, 1893 as Deed No. 95.\n\nIn  accordance  with  the  provisions  of  section  5  of  the  Crown  Lands\n\n(Vesting and Disposal) Act, Cap. 225 the approval of Parliament is now sought for the vesting\n\nof  the  parcel  of  land  described  in  the  Schedule  to  this  Resolution  in  the  Barbados\n\nAgricultural Development and Marketing Corporation for community agricultural purposes.\n\n"
}