{
  "bill_id": 717,
  "slug": "resolution-land-re-acquisition-of-land-at-harrisons-point-st-lucy",
  "title": "Resolution Land re Acquisition of land at Harrisons Point, St. Lucy",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/56b6ff4100b698d3db6ac67fa5d1c461.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-06-06",
  "first_reading": "2023-06-06",
  "gazette_date": null,
  "markdown": "2023-05-22\n\nPARLIAMENT\n\nRESOLVED that Parliament in accordance with section 5 of the Land Acquisition\n\nAct,  Cap.  228  approve  the  compulsory  acquisition  by  the  State  of  the  parcel  of  land  situate  at\n\nHarrison’s Plantation in the parish of Saint Lucy in this Island and more particularly described in\n\nthe Schedule to this Resolution for a public purpose, namely, education, economic and tourism\n\ndevelopment.\n\nAPPROVED by the House of Assembly this\n\nday of\n\n           ,\n\nTwo Thousand and Twenty-Three.\n\nSPEAKER\n\nAPPROVED by the Senate this\n\nday of\n\n                       ,\n\nTwo Thousand and Twenty-Three.\n\nPRESIDENT\n\n\f2\n\nSCHEDULE\n\nALL THAT land situate at Harrison’s Plantation in the parish of Saint Lucy in this\n\nIsland  containing  by  admeasurement  36  517.3  square  metres  (3.65173  hectares)  Abutting  and\n\nBounding on lands now or late of Arlington Griffith (Lot 24) on lands now or formerly of Massy\n\nProperties Barbados Limited (Lot 23) on lands now or late of Maria-Rene Aileen Cumberbatch\n\n(Lot 22) on lands now or late of Gleeson Carlos Roach (Lot 21) on lands now or late of Neville\n\nRicardo Mason (Lot 20) on lands now or late of Troy Noland Belgrave (Lot 19) on lands now or\n\nlate of Philmore Medford Brome (Lot 18) on lands now or formerly of W. R. Investments Inc. on\n\nlands now or formerly of Barbados Tourism Investment Inc. and on a public road which leads to\n\nH.M.P Harrison’s Point in one direction and to Highway 1B in another direction or however else\n\n# the same may abut and bound as shown and delineated on a Plan certified on the 4th day of May,\n\n2023 by Alex R. Chandler, Land Surveyor and recorded in the Lands and Surveys Department on\n\n# the 5th day of May, 2023 as Plan No. 740/2023.\n\n\f3\n\nADDENDUM\n\n# The  Cabinet,  at  a  meeting  held  on  the  9th  day  of  February,  2023,  agreed  to  the\n\ncompulsory acquisition of the parcel of land situate at Harrison’s Plantation in the parish of Saint\n\nLucy,  in  this  Island,  containing  approximately  36,548  square  metres  of  land,  the  property  of\n\nFairfield  Investment  Limited  for  the  public  purposes  of  education,  economic  and  tourism\n\ndevelopment.\n\nIn accordance with the provisions of section 5 of the Land Acquisition Act, Cap.\n\n228, the approval of Parliament is now sought for the compulsory acquisition of the parcel of land\n\ndescribed  in  the  Schedule  to  this  Resolution  in  order  that  the  public  purpose  set  out  in  the\n\nResolution may be effected and the State may acquire an indefeasible title to the said parcel of\n\nland.\n\n"
}