{
  "bill_id": 719,
  "slug": "central-bank-of-barbados-amendment-bill-2023",
  "title": "Central Bank of Barbados (Amendment) Bill, 2023",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/d8da0aa3d290b52fdc38e38db7235825.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-07-05",
  "first_reading": "2023-07-05",
  "gazette_date": null,
  "markdown": "2023-06-08\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Central Bank of Barbados Act, 2020 (Act 2020-30)\nto  strengthen  the  Central  Bank’s  mandate  and  to  make  better  provision  for\ngovernance.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 12 of Act 2020-30\n\nAmendment of section 13 of Act 2020-30\n\nAmendment of section 14 of Act 2020-30\n\nAmendment of section 15 of Act 2020-30\n\nAmendment of section 18 of Act 2020-30\n\nAmendment of section 24 of Act 2020-30\n\nAmendment of section 25 of Act 2020-30\n\nAmendment of section 32 of Act 2020-30\n\n10.\n\nAmendment of section 37 of Act 2020-30\n\n11.\n\nRepeal and replacement of section 41 of Act 2020-30\n\n12.\n\nAmendment of section 45 of Act 2020-30\n\n13.\n\nAmendment of section 62 of Act 2020-30\n\n14.\n\nAmendment of section 69 of Act 2020-30\n\n15.\n\nAmendment of section 78 of Act 2020-30\n\n\f3\n\n16.\n\nInsertion of Second Schedule into Act 2020-30\n\nSCHEDULE\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Central Bank of Barbados Act, 2020 (Act 2020-30).\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\nAct, 2023.\n\nThis Act may be cited as the Central Bank of Barbados (Amendment)\n\n\f6\n\nAmendment of section 12 of Act 2020-30\n\n2.\n(Act 2020-30), in this Act referred to as the principal Act, is amended\n\nthe  Central  Bank  of  Barbados  Act,  2020\n\nSection  12  of\n\n(a)\n\n(b)\n\n(c)\n\nin subsection (1), by deleting the word “5” and substituting the word\n“6”;\n\nin subsection (2), by deleting the words “accounting matters” and\nsubstituting the words “accounting or auditing matters”; and\n\nby inserting the following subsection immediately after subsection\n(3):\n\nThe  meetings  of  the  Board  shall  be  conducted  in  the  manner\n\n“(4)\nspecified in the Second Schedule.”.\n\nAmendment of section 13 of Act 2020-30\n\n3.\n(l) and substituting the following:\n\nSection 13(2) of the principal Act is amended by deleting paragraph\n\n“(l)\n\nto make by-laws to regulate the procedures of the Board;\n\n(m)\n\n(n)\n\nto adopt policies formulated by the Executive Committee in\naccordance with paragraph (c) of section 15(3);\n\nto make regulations and issue orders for the purpose of giving\neffect to the provisions of this Act;\n\n(o)\n\nto amend, by Order, the Schedules to this Act.”.\n\nAmendment of section 14 of Act 2020-30\n\n4.\n(2) and (3) and substituting the following:\n\nSection 14 of the principal Act is amended by deleting subsections\n\n\f7\n\n“(2)\nA  committee  appointed  under  subsection  (1)  may  make\nrecommendations to the Board with respect to the performance of the\nrelevant function.\n\nNotwithstanding subsection (2), recommendations made by the\n\n(3)\ncommittee shall not bind the Board.\n\nA committee appointed under subsection (1) shall, on completion\n(4)\nof the function, submit a report in writing as soon as practicable to the\nBoard. ”.\n\nAmendment of section 15 of Act 2020-30\n\n5.\n\nSection 15 of the principal Act is amended\n\n(a)\n\n(b)\n\nin subsection (1), by deleting the words “2 Deputy Governors” and\nsubstituting the words “3 Deputy Governors”; and\n\nby  deleting  paragraph  (b)  of  subsection  (3)  and  substituting  the\nfollowing:\n\n“(b)\n\nthe  formulation,  adoption  and  implementation  of  the\nmonetary  policy  and  the  financial  stability  policy  of  the\nBank;”.\n\nAmendment of section 18 of Act 2020-30\n\n6.\n“2 Deputy Governors” and substituting the words “3 Deputy Governors”.\n\nSection 18(1) of the principal Act is amended by deleting the words\n\nAmendment of section 24 of Act 2020-30\n\n7.\nand substituting the following:\n\nSection 24 of the principal Act is amended by deleting subsection (2)\n\n\f8\n\n“(2)\nWhere there is a temporary absence or incapacity of a Director,\nthe  Minister  may,  on  the  recommendation  of  the  Board,  appoint  a\nperson to serve as a substitute for the Director until the expiry of the\nterm of the Director or until a determination that the absence or the\nincapacity of the Director has ceased, whichever is earlier.”.\n\nAmendment of section 25 of Act 2020-30\n\n8.\n\nSection 25(2) of the principal Act is amended by\n\n(a)\n\ndeleting  the  words  “Governor-General”  and  substituting  the  word\n“President”; and\n\n(b)\n\ndeleting paragraph (a) and substituting the following:\n\n“(a)\n\nis unfit, absent without leave for a period of 3 consecutive\nmonths or otherwise incapable of carrying out his duties;”.\n\nAmendment of section 32 of Act 2020-30\n\n9.\n“Governor-General” and substituting the word “President”.\n\nSection 32(1) of the principal Act is amended by deleting the words\n\nAmendment of section 37 of Act 2020-30\n\n10.\nand substituting the following:\n\nSection 37 of the principal Act is amended by deleting subsection (2)\n\n“(2)\n\nThe Bank may\n\n(a)\n\nprescribe, by notice published in the Official Gazette, the fees\nthat may be charged for services of the Bank referred to in\nsubsection (1); and\n\n(b)\n\nforward  a  written  notice  of  the  fees  to  each  financial\ninstitution at its principal place of business in Barbados.”.\n\n\f9\n\nRepeal and replacement of section 41 of Act 2020-30\n\n11.\nthe following:\n\nThe principal Act is amended by deleting section 41 and substituting\n\n“Limitation on operations of foreign exchange\n\nThe  Bank  may,\n\n41.\nthe  operations\nenumerated at section 40, deal only with such institutions as determined\nby the Board as part of the risk management policy of the Bank.”.\n\nin  connection  with\n\nAmendment of section 45 of Act 2020-30\n\n12.\n\nSection 45(1) of the principal Act is amended by\n\n(a)\n\ndeleting paragraph (c) and substituting the following:\n\n“(c)\n\ntemporarily\n\nto  solvent  but\n\nsubject  to  terms  and  conditions  that  the  Bank  establishes,\nprovide\nilliquid  financial\ninstitutions or to solvent but temporarily illiquid systemically\nimportant financial institutions, loans in domestic or foreign\ncurrency  for  periods  not  exceeding  180  days,  which  are\nrenewable only once at the discretion of the Bank and secured\nby collateral;”;\n\n(b)\n\ndeleting paragraph (f) and substituting the following:\n\n“(f)\n\nlend  to  the  Corporation  on  a  short  term  basis  under  such\nconditions and amounts as the Bank determines and secured\nby  an  unconditional  government  guarantee\nthe\nCorporation  may  require  to  meet  its  obligations  under  the\nDeposit Insurance Act, Cap. 323 where such loans are for the\npurpose  of  addressing  urgent  situations  which  may\nnegatively impact financial stability.”.\n\nthat\n\n\f10\n\nAmendment of section 62 of Act 2020-30\n\n13.\nand substituting the following:\n\nSection 62 of the principal Act is amended by deleting subsection (4)\n\n“(4)\nNotwithstanding subsection (3), the Bank may acquire securities\ntransferred to it by the Government in accordance with section 7 and\nsection  43  and  pursuant  to  the  Debt  Holder  (Approval  of  Debt\nRestructuring) Act, 2018 (Act 2018-24).”.\n\nAmendment of section 69 of Act 2020-30\n\n14.\nand substituting the following:\n\nSection 69 of the principal Act is amended by deleting subsection (5)\n\n“(5)\n\nWhere a person\n\n(a)\n\n(b)\n\n(c)\n\nintentionally or without justification fails to comply with a\nrequest for information under subsection (2);\n\nintentionally or without justification fails to furnish, within\nthe  time  specified  by  the  Bank,  any  information  or  data\nrequested by the Bank under subsection (2); or\n\nknowingly  supplies  any  information  pursuant  to  a  request\nmade under subsection (2) which is incomplete or false in\nmaterial particular,\n\nthat person is liable to pay to the Bank an administrative penalty of an\namount not exceeding $10 000.\n\nWhere  the  Bank  seeks  to  impose  an  administrative  penalty\n(6)\npursuant  to  subsection  (5),  the  Bank  shall  issue  an  administrative\n\n\f11\n\npenalty  notice  to  the  relevant  person  in  such  form  as  the  Bank\ndetermines and the administrative notice shall\n\n(a)\n\n(b)\n\nspecify the act constituting the contravention and the penalty\nto be paid; and\n\nrequire the person to whom it is addressed to pay the penalty\nwithin 30 days of the date of the notice.\n\nA person who is in receipt of an administrative penalty notice\n(7)\nissued pursuant to subsection (6) shall pay the amount of the penalty\nset out in the notice on or before the period specified in the notice.\n\nNotwithstanding subsection (7), where the Bank is satisfied on\n(8)\ngrounds of undue hardship or any other reason that would be just and\nequitable to do so, the Bank may arrange with the person who is the\nsubject of the penalty notice to pay the penalty stated in the notice in\ninstalments.\n\nAn  administrative  penalty  imposed  pursuant  to  subsection  (5)\n(9)\nmay be recovered as a debt due to the State in civil proceedings before\na magistrate for District “A”.”.\n\nAmendment of section 78 of Act 2020-30\n\n15.\n“Schedule” and substituting the words “First Schedule”.\n\nSection  78  of  the  principal  Act  is  amended  by  deleting  the  word\n\nInsertion of Second Schedule into Act 2020-30\n\n16.\nsubstituting the Schedules as set out in the Schedule to this Act.\n\nThe  principal  Act  is  amended  by  deleting  the  Schedule  and\n\n\f12\n\nSCHEDULE(Section 15)\"FIRST SCHEDULE(Section 78)CONSEQUENTIAL AMENDMENTColumn 1EnactmentPublic Finance Management Act, 2019 (Act 2019-1)Column 2AmendmentSubsection (2) of section 59 is repealed.\f13\n\n L.R.O. 1998SECOND SCHEDULE(Section 12(4))Meetings of the BoardMeetings1.(1) The Board shall meet as often as the business of the Bank requires but not less than 10 times in each year.(2) Notwithstanding paragraph (1), no interval greater than 2 months shall elapsebetween one meeting of the Board and the following meeting.(3) Subject to any by-laws made in accordance with the Act, the Board may convenemeetings for which no notice to its members is necessary.(4) Notwithstanding paragraph (3), the Board shall convene special meetings at the written request of the Governor or any 2 of the Directors for which notice shall berequired.Attendance at meetings by Deputy Governors2. The Deputy Governors may attend the meetings of the Board, but shall not have the right to vote at the meeting unless acting as Chairman in accordance with the Act.Quorum3. Five Directors, one of whom shall be the Governor, or in the case of his absence or disability, a Deputy Governor, shall form a quorum at a meeting of the Board.Decisions4.(1) The Board shall adopt decisions by a simple majority of the votes of the members of the Board present at a meeting. (2) Where there is an equality of votes in respect of a decision to be made, the Chairman shall exercise a second vote.\".Schedule (Concl'd)\f14\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2023.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2023.\n\nPresident\n\n"
}