{
  "bill_id": 721,
  "slug": "resolution-that-house-take-note-of-the-mou-gaia",
  "title": "Resolution that House take note of the MOU - GAIA",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/71693c53459a65560c5f56a2186a274a.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-07-25",
  "first_reading": "2023-07-25",
  "gazette_date": null,
  "markdown": "RESOLUTION\n\nPARLIAMENT\n\nWHEREAS  the  Grantley Adams  International Airport  is  in  need  of  investment\nhaving not had major capital investment for a period of two decades;\n\nAND  WHEREAS  during  the  COVID19  pandemic,  the  Airport  moved  from  a\nposition  of  profit  to  one  significant  loss  having  seen  a  cessation  of  commercial\ntraffic;\n\nAND WHEREAS during the period of cessation of commercial traffic the Grantley\nAdams International Airport retained its entire staff complement;\n\nAND  WHEREAS  airports  which  play  a  pivotal  role  in  all  economies,  have  to\nremain relevant, competitive, appealing and financially successful in order to fully\nplay their crucial role in contributing to continued economic and social growth and\ndevelopment;\n\n# AND WHEREAS a Memorandum of Understanding (MOU) dated 18th July, 2023\nfor  a  Public-Private  Partnership  was  signed  between  the  Grantley  Adams\nInternational  Airport  Inc.  (GAIA  Inc.)  and  the  Office  of  H.  H.  Sheikh  Ahmed\nDalmook Al  Maktoum,  an  entity  registered  and  incorporated  in  the  United Arab\nEmirates and Agencias Universales S.A., a company incorporated in Chile, for the\nmodernisation, expansion, upgrading and management of the GAIA;\n\n# AND  WHEREAS  on  the  21st  July,  2023  the  Hon.  Minister  of  Tourism  and\nInternational Transport made and laid a Statement in the Honourable the House of\nAssembly  concerning  the  history  leading  to  the  said  MOU  and  the  terms  and\nconditions thereof;\n\n\fBE IT RESOLVED that this Honourable House:\n\n1.\n\n2.\n\n3.\n\nTakes  notice  and  supports  the  said  Statement  of  the  Honourable\nMinister of Tourism and International Transport on the said MOU and\nits contents;\n\nRecognises  and  supports  the  commitment  of  the  Government  of\nBarbados to repositioning Barbados in the global aviation industry and\nredefining its role as a regional hub and as a beacon of excellence for\ntravelers and cargo in the Americas; and\n\nthe  Government’s  pledge\n\nSupports\neconomic\nenfranchisement and contribute to the expansion of opportunities for\nthe workers of Barbados and the creation of wealth for them.\n\nto  broaden\n\nAPPROVED by the House of Assembly this                  day of July, 2023.\n\n                                                         SPEAKER\n\n"
}