{
  "bill_id": 727,
  "slug": "commissioners-of-probates-bill-2024",
  "title": "Commissioners of Probates Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/7c4a0cfbafc04d729fa059d606572669.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-01-24",
  "first_reading": "2024-01-31",
  "gazette_date": "2023-09-18",
  "markdown": "2023-07-03\n\nOBJECTS AND REASONS\n\nThis  Bill  would  repeal  and  replace  the  Commissioners  of  Probates  Act,\nCap. 120 and make provision for the appointment of Commissioners of Probates\nand matters related thereto.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nShort title\n\nInterpretation\n\nAppointment and functions of Commissioners\n\nFees of Commissioners\n\nAmendment of Schedule\n\nAppointment of Acting Commissioners\n\nCommissioners not entitled to pension\n\nRepeal of Cap. 120\n\nFIRST SCHEDULE\n\nCertificate\n\nSECOND SCHEDULE\n\nFees\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  repeal  and  replace  the  Commissioners  of  Probates  Act,\nCap. 120 and to provide for the appointment of Commissioners of Probates\nand matters related thereto.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n\nThis Act may be cited as the Commissioners of Probates Act, 2023.\n\nInterpretation\n\n2.\nappointed under section 3.\n\nIn  this  Act,  “Commissioner”  means  a  Commissioner  of  Probate\n\nAppointment and functions of Commissioners\n\n3.(1)\nCommissioners of Probates, not exceeding 7.\n\nThe  President  may  by\n\ninstrument  appoint  any  number  of\n\nThe  Commissioners  of  Probates  shall  be  responsible  for  taking  the\n(2)\nacknowledgement  and  the  probate  of  deeds  in  the  form  set  out  in  the  First\nSchedule.\n\nFees of Commissioners\n\n4.\nupon taking the acknowledgment and the probate of deeds.\n\nThe fees in the Second Schedule shall be payable to all Commissioners\n\nAmendment of Schedule\n\n5.\n\nThe Minister may by order amend the Schedules to this Act.\n\nAppointment of Acting Commissioners\n\n6.(1)\nThe  President  may  grant  leave  to  a  Commissioner  and  may  give\napproval for the duties of a Commissioner to be performed by another person\nduring the period of leave.\n\nAn acting Commissioner shall be invested with, and exercise and perform\n(2)\nthe same powers and authorities, rights and duties, as a Commissioner, and shall\nbe entitled to the same fees.\n\n\f5\n\nCommissioners not entitled to pension\n\n7.\nCommissioner.\n\nThe  Pensions  Act,  Cap.  25  does  not  apply  to  the  office  of\n\nRepeal of Cap. 120\n\n8.\n\nThe Commissioners of Probates Act, Cap. 120 is hereby repealed.\n\n\f6\n\n L.R.O. 1998FIRST SCHEDULECERTIFICATE (Section 3(2))CERTIFICATE Appear before me this day , the subscribed witness to the execution of theforegoing deed and made oath and say that he/she was present and saw the within named   , the executing party to the foregoing duly sign, seal and deliver thesame as for his/her free and voluntary act and deed.Given under my hand, this  day of  20 .Commissioner of Probates\f7\n\n L.R.O. 1998SECOND SCHEDULE(Section 4)FEES  For proving (a) a deed other than a power of attorney   (i) if the value of the property is under $500,000……………….……$25.00  (ii) if the value of the property is $500,000 or more…………………….$50.00  (b) a power of attorney…………………………………………….……….$25.00 For the purposes of this Schedule, the proving of a deed or power of attorney includes the writing of the aﬃ  davit or certiﬁ cate of proof.\f8\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2023.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2023.\n\nPresident\n\n"
}