{
  "bill_id": 728,
  "slug": "resolution-re-lease-of-land-at-the-garrison-to-the-autism-association",
  "title": "Resolution re Lease of land at the Garrison to the Autism Association",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/7d22275af900ae8d8b694e4092ef2a70.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-09-23",
  "first_reading": "2023-11-08",
  "gazette_date": null,
  "markdown": "2023-06-07\n\nPARLIAMENT\n\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands\n\n(Vesting and Disposal) Act, Cap. 225 approve the lease to the Autism Association of Barbados,\n\na charity registered under the Charities Act, Cap. 243 as Charity No. 612 of a parcel of land,\n\nthe property of the State situate at the Garrison in the parish of Saint Michael, in this Island\n\nand more particularly described in the First Schedule on the terms and conditions set out in the\n\nSecond Schedule to this Resolution for its Basic Life Skills Programme.\n\nAPPROVED by the House of Assembly this                  day of                                                ,\n\nTwo thousand and twenty-three.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                            day  of                                                    ,\n\nTwo thousand and twenty-three.\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL THAT land the property of the State situate at the Garrison in the parish\n\nof Saint Michael in this Island containing by admeasurement 836.5 square metres or thereabouts\n\n(inclusive of 120.0 square metres in road reserve and 9.5 square metres in sidewalk) abutting\n\nand bounding on a public road which leads to Philips Road on lands now or formerly of the\n\nBarbados Government (“Carpark”) on a road on a public road and on another public road known\n\nas St. Matthias Road which leads to Kings Village in one direction and to Garrison Road in the\n\nother direction or however else the same may abut and bound as shown and delineated on a plan\n\ncertiﬁ ed on the 30th day of June, 2021 by Kevin R. Belgrave, Land Surveyor and recorded in the\n\nLands and Surveys Department on the 7th day of July, 2021 as Plan No. 786/2021 together with\n\nthe building situated thereon.\n\n\f3\n\nSECOND SCHEDULE\n\nTERMS AND CONDITIONS\n\nThe lease to the Autism Association of Barbados (“the Lessee”) of the parcel of land,\n\nthe property of the State (“the Lessor”), situate at the Garrison in the parish of Saint Michael in\n\nthis Island and more particularly described in the First Schedule is on the following terms and\n\nconditions:\n\n(a)  the lease shall be for a period of 10 years with an option to renew for an additional\n\nperiod of 10 years;\n\n(b)  initial rent shall be $3 000.00 plus value added tax per annum payable monthly\n\nin advance at a rate of $250.00 per month plus value added tax;\n\n(c)  the rent is to be reviewed at 5 year intervals;\n\n(d)  the lessee shall be responsible for putting and keeping the demised premises in\n\ngood repair, inclusive of structural repairs, throughout the term;\n\n(e)  the lessee shall bear the cost of developing the site and comply with any Planning\n\nand Development Department and other statutory requirements;\n\n(f)\n\nthe lessee shall be responsible for all outgoings, inclusive of land taxes, property\nand liability insurances arising from the use of the premises;\n\n\f4\n\nSECOND SCHEDULE - (Concl'd)\n\n(g)  the  lessee  shall  be  responsible  for  insuring  the  demised  premises  at  its  full\n\nreinstatement cost in the joint names of the lessor and lessee;\n\n(h)  the lessee shall be responsible for the maintenance of the demised premises which\n\nshall be kept clean and tidy and appropriately landscaped throughout the lease\n\nand any renewal thereafter;\n\n(i)\n\nthe  demised  premises  is  to  be  used  for  the  express  purposes  of  the Autism\n\nAssociation of Barbados; and\n\n(j)\n\nthat the demised premises shall revert to the State for nil consideration.\n\n\f5\n\nADDENDUM\n\nThe Cabinet at its meeting held on the 12th day of January, 2023 considered Note\n\n(23) of 09/MHLM 02 and agreed to the lease of 836.5 square metres or thereabouts of State\n\nlands together with the building situated thereon known as the “Annex Building” situate at the\n\nGarrison in the parish of Saint Michael, in this Island, to the Autism Association of Barbados for\n\nits Basic Life Skills Programme under the terms and conditions set out in the Second Schedule\n\nto this Resolution.\n\nThe  area  of  land  to  be  leased  is  part  of  a  larger  parcel  of  State  lands\n\ncontaining by estimation 61 acres or thereabouts which formed part of the land conveyed by Deed of\n\nConveyance dated 17th day of December, 1912 between His Majesty’s Principal Secretary of\n\nState for the War Department and The Executive Committee recorded on the 17th day of July,\n\n1913 in Volume of Deeds 441 at folio 419.\n\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and\n\nDisposal) Act, Cap. 225, the approval of Parliament is now sought for the lease of State lands to\n\nthe Autism Association of Barbados the property described in the First Schedule on the terms\n\nand conditions set out in the Second Schedule for its Basic Life Skills Programme.\n\n"
}