{
  "bill_id": 72,
  "slug": "vesting-in-nhc-crown-land-at-rosemont-st-michael",
  "title": "Vesting  in NHC Crown land at Rosemont, St. Michael",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/2eabf39738a99f2af39b42d97a019b17.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-02-11",
  "first_reading": "2015-03-11",
  "second_reading": null,
  "gazette_date": "2015-03-11",
  "passed_date": "2015-03-11",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament, in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, approve the vesting in the National Housing Corporation of the parcel of land, the property of the Crown situate at \"Rosemont\", Deacons Road, Black Rock, in the parish of Saint Michael, in this Island, more particularly described in the Schedule hereto, for the public purpose of housing development.\nAPPROVED by the House of Assembly this\nday of\n, Two thousand and fifteen.\nSpeaker\nAPPROVED by the Senate this\nday of\nTwo thousand and fifteen.\nPresident\n5\nSCHEDULE\nALL THAT land the property of the Crown situate at \"Rosemont\", Deacons Road,\nBlack Rock, in the parish of Saint Michael, in this Island containing by admeasurement 1.871 hectares or thereabouts Abutting and Bounding on lands now or formerly of the Barbados Government, on lands now or late of J. Rudder, on lands now or late of Sundry Owners, on lands now or late of Lilian Weekes, on lands now or late of Fitzgerald Sealy, deceased, on lands now or late of one Devonish, on a public road known as Deacons Road that leads to Highway 1 in one direction and to Brandons in the other direction, on lands now or formerly of the Barbados Government on three sides or however else the same may abut and bound as shown and delineated on a Plan certified on the 15\" day of October, 2004 by Lennox J. Reid, Land Surveyor and recorded in the Lands and Surveys Department on the 26\" day of October, 2004 as Plan No. 1084/2004, in conjunction with a statement of rectification contained in an affidavit deposed on the 14th day of January, 2014 by Lennox J. Reid, Land Surveyor and recorded in the Land Registry on the 16th day of 2014 Instrument No. RD 2014 000495.\nJanuary,\nas\nADDENDUM\nOn the 1% day of October, 2009, the Cabinet agreed that the parcel of land situate at \"Rosemont\", Deacons Road, Black Rock, in the parish of Saint Michael, should be vested in the National Housing Corporation for the public purpose of housing development.\nThe said parcel of land, more particularly described in the Schedule to this Resolution, was acquired by the Crown by deed of conveyance dated the 7th day of October, 1892 between James Goldbourne Williams and the Executive Committee of the Island of Barbados and recorded in the Land Registry on the 7th day of February, 1893 as Deed No. 95.\nIn accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is now sought for the vesting in the National Housing Corporation of the parcel of land, more particularly described in the Schedule to this Resolution, for the public purpose of housing development.\nLands of The Barbados Government 23 089.15 mE 68 258.86 mN Lands of The ir fd bent Now or Formerly Lands of National Housing aa 123.88 oN 7 Corporation og 7 y CES a Land 1.871 Ha\nVa\nBarbados\nSCALE 1:1CCO\nDistances are in metrss earings are referred to Grid North Derived from T170 & TI71\nof Land Bordered Green\nPlan\nat “Rosemont” Deacons Road, Black Rock, St. Michael\nNCTE Ol enotes ir Q Denotes x\nfd unless otherwise stated\npt unless atherwise stated\nContaining\nLand 1.871 Ha\nFor Lands and Surveys Dept only\nSurveyed for\nNational Housing Corperation\nwa\nCertified (Land Surveyor)\n\npare\n"
}