{
  "bill_id": 730,
  "slug": "barbados-water-authority-amendment-act-2023",
  "title": "Barbados Water Authority (Amendment) Act, 2023",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/48cc116217a2df173e7f5dc80cca0f39.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-09-23",
  "first_reading": "2023-10-25",
  "gazette_date": "2023-10-23",
  "markdown": "2023-08-22\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Barbados  Water  Authority  Act,  Cap.  274A  to\n\nprovide for\n\n(a)\n\n(b)\n\n(c)\n\nthe institutional strengthening of the Authority;\n\nthe establishment of water protection zones;\n\nthe management of wells; and\n\n(d)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 274A\n\nAmendment of section 3 of Cap. 274A\n\nAmendment of section 5 of Cap. 274A\n\nAmendment of section 6 of Cap. 274A\n\nAmendment of section 7 of Cap. 274A\n\nRepeal and replacement of section 9 of Cap. 274A\n\nAmendment of section 11 of Cap. 274A\n\nAmendment of section 12 of Cap. 274A\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nRepeal of section 13 of Cap. 274A\n\n11.\n\nRepeal and replacement of section 14 of Cap. 274A\n\n12.\n\nRepeal and replacement of section 15 of Cap. 274A\n\n13.\n\nAmendment of section 17 of Cap. 274A\n\n14.\n\nInsertion of Part IVA into Cap. 274A\n\n15.\n\nAmendment of section 19A of Cap. 274A\n\n\f3\n\n16.\n\nRepeal and replacement of section 26 of Cap. 274A\n\n17.\n\nRepeal and replacement of section 27 of Cap. 274A\n\n18.\n\nAmendment of section 28 of Cap. 274A\n\n19.\n\nInsertion of section 29B into Cap. 274A\n\n20.\n\nRepeal of section 31 of Cap. 274A\n\n21.\n\nInsertion of section 33 into Cap. 274A\n\n22.\n\nAmendment of Schedules to Cap. 274A\n\n23.\n\nConsequential amendments\n\nFIRST SCHEDULE\n\nSECOND SCHEDULE\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Barbados Water Authority Act.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\nAct, 2023.\n\nThis Act may be cited as the Barbados Water Authority (Amendment)\n\n\f6\n\nAmendment of section 2 of Cap. 274A\n\nSection 2 of the Barbados Water Authority Act, Cap. 274A, in this\n2.\nAct referred to as the principal Act, is amended by inserting, in alphabetical\norder, the following definitions:\n\n“ “adit” means an excavation on a horizontal or inclined plane extending\n\nfrom a well, borehole or shaft;\n\n“aquifer” means an underground layer of water-bearing permeable rock\nor  unconsolidated  materials,  such  as  gravel,  sand  or  silt,  from\nwhich groundwater can be abstracted;\n\n“borehole” means a hole made in the ground with boring or drilling\nequipment for the purpose of exploring for, monitoring, tapping,\nintercepting or abstracting groundwater;\n\n“Committee”  means  the  Water  and  Wells  Management  Committee\n\nestablished by section 18A;\n\n“groundwater”  means  the  natural  water  which  occurs  within  the\n\naquifers;\n\n“Relief  Board”  means  the  Garbage  and  Sewage  Contribution  Relief\n\nBoard established by section 25A;\n\n“water resources” means the springs, rivers and other surface water,\n\ngroundwater, coastal waters and territorial waters of Barbados;\n\n“well” includes a borehole, adit or shaft.”.\n\nAmendment of section 3 of Cap. 274A\n\n3.\n“Crown” and substituting the word “State”.\n\nSection  3  of  the  principal  Act  is  amended  by  deleting  the  word\n\n\f7\n\nAmendment of section 5 of Cap. 274A\n\n4.\nsubstituted:\n\nSection  5(1)  of  the  principal  Act  is  deleted  and  the  following\n\n“(1)\n\nThe functions of the Authority are:\n\n(a)\n\n(b)\n\n(c)\n\nto obtain and analyse information on and maintain records of\nthe total water resources of Barbados;\n\nto  manage,  allocate  and  monitor  the  surface  water  and\ngroundwater resources of Barbados with a view to ensuring\nthe development, conservation and protection of such water\nresources in the public interest;\n\nto prepare and submit to the Minister, after consultation with\nsuch  persons  as  the  Minister  may  direct  or  otherwise,\nproposals for the establishment of efficient, co-ordinated and\neconomical systems for the supply of water and for sewerage,\nthat  are  capable  of  meeting  the  demand  for  water  and\nsewerage services in Barbados;\n\n(d)\n\nto prepare details of schemes for\n\n(i)\n\nthe development and protection of the surface water and\ngroundwater resources; and\n\n(ii)\n\nthe supply of water and sewerage services,\n\nand to construct, maintain and operate such schemes;\n\n(e)\n\nto  manage  and  keep  under  constant  review,  the  quality,\nreliability  and  availability  of  water  supply  and  sewerage\nservices in accordance with such requirements and standards\nas may be issued or adopted for the purpose;\n\n(f)\n\nto keep under review the rates to be charged for the services\ndescribed in paragraph (e);\n\n\f8\n\n(g)\n\nto control and regulate the collection, production, treatment,\nstorage, transmission, distribution and use of water for public\npurposes;\n\n(h)\n\nto design, construct, acquire, provide, operate and maintain\n\n(i)\n\n(ii)\n\nwater  works  for  the  purpose  of  treating  or  supplying\nwater for public purposes; and\n\nsewerage  works  for  the  purpose  of  receiving,  treating\nand disposing of sewage;\n\nto  control  and  regulate  the  disposal  of  sewage  through\nsewerage plants or waste treatment plants that are not part of\nthe Authority’s systems;\n\nto conduct research programmes and prepare statistics for its\npurposes;\n\nto  disseminate  information  and  advice  with  respect  to  the\ntransmission,\nmanagement,\ntreatment,  storage,  supply  and  distribution  of  water  and,\nwhere applicable, sewage;\n\nproduction,\n\ncollection,\n\nto provide such facilities as may be necessary for training and\neducating  its  employees,  and  to  facilitate  research  by\nemployees;\n\nto advise the Minister on the matters referred to in paragraph\n(e) and on such other matters relating to water supply and\nsewerage services as the Minister refers to the Authority;\n\nto monitor compliance with this Act; and\n\nto perform such other functions as the Minister assigns or as\nthe  Authority  considers  necessary  or  expedient  for  its\npurposes.”.\n\n(i)\n\n(j)\n\n(k)\n\n(l)\n\n(m)\n\n(n)\n\n(o)\n\n\f9\n\nAmendment of section 6 of Cap. 274A\n\nSection 6(2) of the principal Act is amended by deleting the words\n5.\n“or underground waters” and substituting the words “water or groundwater”.\n\nAmendment of section 7 of Cap. 274A\n\n6.\nword “Schedule”, the word “First”.\n\nSection 7(2) of the principal Act is amended by inserting before the\n\nRepeal and replacement of section 9 of Cap. 274A\n\n7.\nsubstituted:\n\nSection  9  of  the  principal  Act  is  deleted  and  the  following\n\n“Appointment of Chief Executive Officer\n\n9.(1)\nThe Board may, with the approval of the Minister, appoint\na person to be the Chief Executive Officer of the Authority, who shall\nbe an employee of the Authority.\n\n(2)\nThe Chief Executive Officer is subject to the directions of the\nBoard  and  is  responsible  to  the  Board  for  the  execution  and\nmanagement of the affairs of the Authority.”.\n\nAmendment of section 11 of Cap. 274A\n\n8.\n“Governor-General” and substituting the word “President”.\n\nSection 11(3) of the principal Act is amended by deleting the word\n\nAmendment of section 12 of Cap. 274A\n\n9.\n“Crown” and substituting the word “State”.\n\nSection 12(1) of the principal Act is amended by deleting the word\n\n\f10\n\nRepeal of section 13 of Cap. 274A\n\n10.\n\nSection 13 of the principal Act is repealed.\n\nRepeal and replacement of section 14 of Cap. 274A\n\n11.\nsubstituted:\n\nSection  14  of  the  principal  Act  is  deleted  and  the  following\n\n“Powers of Authority\n\n14.(1)\npurposes of this Act\n\nThe  Authority,  its  employees  and  agents  may  for  the\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nenter upon premises for the purpose of laying pipes or for\nusing the water of any stream, spring, well or pond;\n\ndivert or impound the water from any stream, spring, aquifer,\nwell or pond;\n\nopen and break up the surface soil of any road;\n\nopen and break up any sewer, drain or tunnel in or over any\nroad;\n\n(e)\n\nconduct surveys;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\ncarry out examinations;\n\nperform tests on wells, water, soil, rock, plants or any other\nrelevant material;\n\ncollect  samples  of  water,  soil,  rock,  plants  or  any  other\nrelevant material;\n\nconduct inspections, including of premises and wells;\n\nconduct investigations, including in relation to premises and\nwells;\n\n\f11\n\n(k)\n\ntake  photographs,  videos,  voice  recordings  or  copies  of\ndocuments; and\n\n(l)\n\ndo such other things as it considers necessary for its purposes.\n\n(2)\nThe Authority is liable to make reasonable compensation to an\nowner or occupier of premises for the use of the water of any stream,\nspring, well or pond or for any damage occasioned in the performance\nof its functions under this section.\n\nCompensation payable under this section and section 12 may be\n(3)\nin such amount as is agreed upon between the owner or occupier of the\npremises  and  the  Authority  or  as  is  assessed  in  accordance  with  the\nLand Acquisition Act, Cap. 228.\n\nFor the purposes of this section and Part IVA “inspection”, in\n(4)\nrelation to a well, includes checking whether the structure of the well\nhead adequately prevents surface water and foreign objects from falling\ninto the well.”.\n\nRepeal and replacement of section 15 of Cap. 274A\n\n12.\nsubstituted:\n\nSection  15  of  the  principal  Act  is  deleted  and  the  following\n\n“Notice required in certain cases\n\n15.(1)\nThe Authority shall, no less than 7 days before conducting\nany activity set out section 14(1)(a), (b), (c) or (d), give notice in writing\nto the owner or occupier of the premises or the road authority, as the\ncase may be, of its intention to conduct the activity.\n\nNotwithstanding subsection (1), where an emergency arises, the\n(2)\nAuthority shall give notice as soon as possible after the necessity for\nthe activity has arisen or the activity is begun.\n\n\f12\n\n(3)\nThe Authority may, without notice, at any reasonable time, enter\nonto any premises or into any road to perform any function set out in\nsection 14(1)(e), (f), (g), (h), (i), (j), (k) or (l).”.\n\nAmendment of section 17 of Cap. 274A\n\n13.\nand substituting the word “16”.\n\nSection 17 of the principal Act is amended by deleting the word “15”\n\nInsertion of Part IVA into Cap. 274A\n\n14.\nfollowing:\n\nThe  principal  Act  is  amended  by  inserting  after  Part  IV,  the\n\n“PART IVA\n\nWATER AND WELLS MANAGEMENT COMMITTEE\n\nWater and Wells Management Committee\n\n18A.(1)\nand Wells Management Committee.\n\nThere is established a committee to be known as the Water\n\nThe Second Schedule has effect with respect to the constitution\n\n(2)\nof the Committee and otherwise in relation to the Committee.\n\nLicence to sink, alter or use well\n\n18B.(1)\nagents, shall\n\nNo  person,  other  than  the  Authority,  its  employees  and\n\n(a)\n\nsink  a  well  for  the  purpose  of  exploring  for,  monitoring,\ntapping, intercepting or abstracting groundwater;\n\n\f13\n\n(b)\n\n(c)\n\ndeepen or otherwise substantially alter or convert an existing\nwell for the purpose of exploring for, monitoring, tapping,\nintercepting or abstracting groundwater from the well;\n\nuse  a  well  previously  used  for  exploring  for,  monitoring,\ntapping, intercepting or abstracting groundwater for another\npurpose;\n\n(d)\n\nabstract groundwater from a well; or\n\n(e)\n\nuse groundwater abstracted from a well for a purpose other\nthan a permitted purpose,\n\nunless he holds a licence issued under section 18D in relation to the\nactivity.\n\n(2)\n\nFor the purposes of subsection (1),\n\n(a)\n\nan alteration which increases, is designed to increase or is\ncapable of increasing\n\n(i)\n\nthe horizontal area of a well;\n\n(ii)\n\nthe depth of a well;\n\n(iii)\n\nthe power utilised to raise water from a well; or\n\n(iv)\n\nthe discharge of water raised from a well,\n\nis deemed to be a substantial alteration of the well;\n\n(b)\n\n“permitted purpose” means a purpose permitted by a licence\nissued under section 18D.\n\nA person who contravenes subsection (1) is guilty of an offence\n(3)\nand  is  liable,  on  summary  conviction,  to  a  fine  of  $25  000  or\nimprisonment for 5 years or both.\n\n\f14\n\nApplication for licence\n\n18C.(1)\nA person may, in such form as the Minister may require and\nupon payment of the prescribed fee, apply to the Minister for a licence\nfor the purposes of section 18B.\n\nAn applicant shall submit with his application such information\n(2)\nas  may  be  required  by  the  Minister  to  determine  whether  a  licence\nshould be issued to the applicant.\n\nA person who knowingly makes an application under this Part\n(3)\nthat is false in any material particular is guilty of an offence and is liable,\non summary conviction, to a fine of $1 000 or imprisonment for 12\nmonths or both.\n\nDetermination of application and issue of licence\n\n18D.(1)\nMinister  shall  submit\nconsideration.\n\nWhere the Minister receives an application for a licence, the\nthe  Committee  for\n\nthe  application\n\nto\n\n(2)\nThe Committee may, upon consideration of the application, any\nreport submitted pursuant to section 18I on an inspection conducted in\nrelation  to  the  application,  and  such  other  information  as  may  be\nrelevant to the application, recommend to the Minister that\n\n(a)\n\n(b)\n\na licence be issued;\n\nconsideration  of  the  application  be  suspended  until  any\nmatter identified by the Committee as requiring rectification\nis rectified to the satisfaction of the Committee; or\n\n(c)\n\nthe application be refused.\n\n\f15\n\n(3)\n\nWhere the Committee recommends that\n\n(a)\n\n(b)\n\n(c)\n\na licence be issued to an applicant, the Minister shall, in such\nform as the Minister may determine and upon payment of the\nprescribed fee, issue the licence to the applicant;\n\nconsideration of the application be suspended, the Minister\nshall  notify  the  applicant  in  writing  of  the  matter  to  be\nrectified for the applicant to qualify for the issue of a licence;\nor\n\nthe  application  be  refused,  the  Minister  shall  notify  the\napplicant  in  writing  of  the  refusal  and  the  reason  for  the\nrefusal.\n\n(4)\n\nA licence\n\n(a)\n\nshall be subject to such terms and conditions as the Minister,\non the recommendation of the Committee, may specify in the\nlicence;\n\n(b)\n\nis not transferable;\n\n(c)\n\n(d)\n\nis valid for one year; and\n\nmay be renewed on a further application under section 18C\nat least one month prior to its expiration.\n\nWithout prejudice to the generality of subsections (2) and (3), the\n(5)\nMinister  may  refuse  to  issue  or  renew  a  licence  where  the  activity\nintended  to  be  conducted  under  the  licence  is  likely  negatively  to\naffect the water resources or marine environment of Barbados or the\nsupply of water to the public.\n\nWarning\n\n18E.(1)\nWhere an inspection of a well or premises connected to a\nwell reveals an area of concern which was the subject of a prior request\nfor  rectification,  the  Minister  may,  on  the  recommendation  of  the\n\n\f16\n\nCommittee, issue a written warning to the licensee involved requiring\nthat the area of concern be rectified within a specified period.\n\n(2)\n\nThe warning shall\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nstate the area of concern;\n\ngive details of any prior written requests for rectification of\nthe  area  of  concern  including  the  number  of  times  such\nrequests were issued;\n\nindicate the measures to be taken to rectify the area of concern\nand the date by which compliance is required; and\n\nadvise that non-compliance may result in the suspension or\nrevocation of the licence.\n\nThe Minister may, subject to section 18F, suspend or revoke a\n\n(3)\nlicence where the licensee fails to comply as required in a warning.\n\nSuspension or revocation of licence\n\n18F.(1)\nSubject to subsections (2) and (3), the Minister may, on the\nrecommendation of the Committee, suspend or revoke a licence where\n\n(a)\n\n(b)\n\nthe licensee contravenes a term or condition of the licence;\nor\n\nthe  existence  or  use  of  the  well  negatively  affects,  or  is\nlikely  negatively  to  affect  the  water  resources  or  marine\nenvironment of Barbados or the supply of water to the public.\n\nThe Minister shall not suspend or revoke a licence on the ground\n\n(2)\nset out in subsection (1)(a) without giving the licensee\n\n(a)\n\n(b)\n\nwritten notice of the intended suspension or revocation, and\nthe reason for it;\n\nwhere appropriate, a further period during which the licensee\nmay rectify any area of concern requiring rectification; and\n\n\f17\n\n(c)\n\n10 days, from the date of the notice, to make representations\nas to why the licence should not be suspended or revoked.\n\n(3)\n\nThe Minister may suspend or revoke a licence where\n\n(a)\n\n(b)\n\nan area of concern is not rectified by the licensee by the end\nof the period described in subsection (2)(b); or\n\na suitable explanation as to why the licence should not be\nsuspended or revoked is not received from the licensee by the\nend of the period described in subsection (2)(c).\n\nWhere the Minister suspends or revokes a licence, the Minister\n(4)\nshall give the licensee written notice of the suspension or revocation.\n\nNotwithstanding  subsection  (2)(c),  where  subsection  (1)(b)\n(5)\napplies the Minister may suspend or revoke a licence with immediate\neffect.\n\nSuspension or limitation of groundwater abstraction by\nlicensees during drought etc.\n\n18G.(1)\n\nThe Minister may, on the recommendation of the Committee\n\n(a)\n\n(b)\n\nby  Order,  suspend  the  abstraction  of  water  from  wells  in\nrespect  of  which  a  licence  is  issued  under  section  18D  or\nsaved under section 18K where there is a drought or natural\nchanges cause a shortage of water for any purpose, which in\nthe opinion of the Minister, makes it necessary to suspend the\nabstraction of water for the period stated in the Order;\n\nby instrument in writing, revise or alter the quantity of water\nwhich a person who has been issued a licence under section\n18D or to whom section 18K applies is authorised to abstract\nfrom a well in such manner as appears to the Minister to be\nequitable  and  appropriate  taking  into  consideration    the\nenvironmental  conditions  which  are  impacting  the  water\nsupply.\n\n\f18\n\n(2)\nThe  Minister  may,  in  an  Order  made  under  subsection  (1)(a),\nprovide  for  contravention  of  the  Order  to  be  an  offence  triable\nsummarily and punishable by a fine of $25 000 or imprisonment for 5\nyears or both.\n\nMisuse of a well\n\n18H.(1)\n\nWhere a well\n\n(a)\n\n(b)\n\nis used or caused or permitted to be used in contravention of\nthis Act; or\n\nthough not situated in any area or zone defined pursuant to\nsection 27 or in respect of which a restriction or prohibition\napplies pursuant to that section, is used or caused or permitted\nto  be  used  for  the  disposal  of  sewage  or  other  waste  in  a\nmanner which, in the opinion of the Committee, constitutes\nor is likely to constitute a danger to health or leads or is likely\nto lead to the contamination of any source of water,\n\nthe Minister may, on the recommendation of the Committee, by notice\nin writing served on the owner or occupier of the land on which the well\nis situated, require the owner or occupier to plug or fill the well or use\nsuch other means as the Minister may approve to provide some other\nsatisfactory method of disposing of the sewage or other waste.\n\nWhere  an  owner  or  occupier  of  land  fails  to  comply  with  a\n(2)\nrequirement  of  the  Minister  under  subsection  (1),  the  Minister  may\nrequire the Authority to enter on the land and plug or fill the well and\ndo  such  other  works  as  may  be  required  to  provide  some  other\nsatisfactory method of disposing of the sewage or other waste.\n\nThe expenses of the Authority reasonably incurred in the exercise\n(3)\nof the powers conferred by subsection (2) shall be a debt due by the\nowner or occupier of the land to the State and, without prejudice to any\nother lawful means of recovery, may be recovered by the Authority on\ncomplaint before a magistrate.\n\n\f19\n\nInspection of wells etc.\n\nThe Minister may require the Authority to inspect any well\n18I.\nor premises connected to a well and submit a report on its inspection\nfor the purpose of\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\ndetermining an application for a licence;\n\nassessing  whether  a  matter  required  to  be  rectified  by  an\napplicant  for  a  licence,  or  by  a  licensee,  has  been\nsatisfactorily rectified;\n\nassessing whether a licensee is in compliance with the terms\nand conditions of his licence; or\n\ndetermining  whether  this  Part  or  a  term  or  condition  of  a\nlicence has been contravened.\n\nSavings\n\n18J.(1)\nA licence issued to a person to construct or use a well under\nthe Underground Water Control Act, Cap. 283 shall remain valid for a\nperiod of 12 months from the commencement of the Barbados Water\nAuthority  (Amendment)  Act,  2023  (Act  2023-  )  and  thereafter  the\nlicence shall be deemed to be expired.\n\nA person to whom subsection (1) refers may apply for a licence\n(2)\nin accordance with section 18C on or before the expiration of the period\nspecified in subsection (1).”.\n\nAmendment of section 19A of Cap. 274A\n\n15.\n“Crown” and substituting the word “State”.\n\nSection 19A of the principal Act is amended by deleting the word\n\n\f20\n\nRepeal and replacement of section 26 of Cap. 274A\n\n16.\nsubstituted:\n\nSection  26  of  the  principal  Act  is  deleted  and  the  following\n\n“Directions of Minister\n\n26.(1)\nThe Minister may, after consultation with the Chairman of\nthe Board appointed under paragraph 1(2) of the First Schedule, give\nto the Board directions of a general or specific nature relating to the\npolicy to be followed by the Board in the performance of the functions\nof the Authority; and the Board shall give effect to the directions.\n\nThe Minister may give directions of a general or specific nature\n(2)\nrelating to the policy to be followed with respect to matters relating to\nthe  functions  of  the  Committee  and  the  Relief  Board;  and  the\nCommittee and the Relief Board shall give effect to the directions.”.\n\nRepeal and replacement of section 27 of Cap. 274A\n\n17.\nsubstituted:\n\nSection  27  of  the  principal  Act  is  deleted  and  the  following\n\n“Water zones and areas of public water supply\n\n27.(1)\n\nThe Board may, with the approval of the Minister, by Order\n\n(a)\n\ndefine or zone, or restrict or prohibit the use of, areas across\nBarbados which contribute to\n\n(i)\n\nthe water resources of Barbados; and\n\n(ii)\n\nthe public water supply in Barbados; and\n\n\f21\n\n(b)\n\nspecify and regulate the permissible uses of the areas referred\nto in paragraph (a).\n\n(2)\nThe Board may, in an Order made under subsection (1), provide\nfor contravention of the Order to be an offence triable summarily and\npunishable by a fine of $25 000 or imprisonment for 5 years or both.\n\nThe Board shall receive reports with respect to any contravention\n(3)\nof an Order made under subsection (1) from any person or authority\nrequired to ensure or monitor compliance with the Order.”.\n\nAmendment of section 28 of Cap. 274A\n\n18.\n\nSection 28 of the principal Act is amended by\n\n(a)\n\ndeleting subsection (2)(n) and (o) and substituting the following:\n\n“(n)\n\nprescribing matters related the management and protection\nof water zones and groundwater;\n\n(o)\n\n(p)\n\n(q)\n\nprescribing matters related to the construction and use of a\nwell;\n\nprescribing the security to be furnished by persons applying\nfor the supply of water or sewerage services; and\n\nprescribing  the  conditions  for  discontinuing  the  supply  of\nwater or sewerage services.”;\n\n(b)\n\ndeleting subsection (4) and substituting the following:\n\n“(4)\nThe  Board  may,  in  regulations  made  under  subsection  (2),\nprovide  for  contravention  of  the  regulations  to  be  an  offence  triable\nsummarily and punishable by a fine of $25 000 or imprisonment for 5\nyears or both.”; and\n\n(c)\n\ndeleting subsection (5).\n\n\f22\n\nInsertion of section 29B into Cap. 274A\n\n19.\nfollowing:\n\nThe  principal  Act  is  amended  by  inserting  after  section  29A,  the\n\n“Protection from personal liability\n\n29B.\nNo  action,  suit,  prosecution  or  other  proceedings  shall  be\nbrought or instituted personally against any member of the Board, the\nCommittee  or  the  Relief  Board  or  an  employee  of  the  Authority  in\nrespect of any act done in good faith in pursuance of their functions or\ninstructions given pursuant to this Act.”.\n\nRepeal of section 31 of Cap. 274A\n\n20.\n\nSection 31 of the principal Act is repealed.\n\nInsertion of section 33 into Cap. 274A\n\n21.\nfollowing:\n\nThe  principal  Act  is  amended  by  inserting  after  section  32,  the\n\n“Relevance to administration of Planning and Development\nAct, 2019\n\n33.\nThe Minister responsible for Planning and Development and\nthe  Director  of  Planning  and  Development  shall  have  regard  to  any\nOrder made under section 27 in respect of water protection zones and,\nwhere applicable, any other Order or regulations made under this Act,\nin  the  administration  of  the  Planning  and  Development  Act,  2019\n(Act 2019-5) generally, and in particular, in relation to\n\n(a)\n\nthe distribution and use of land in Barbados in the preparation\nof a physical development plan; and\n\n\f23\n\n(b)\n\nthe grant of permission to\n\n(i)\n\n(ii)\n\ndevelop  land  or  to  sub-divide  land  for  agricultural,\nhousing or commercial development; or\n\nimprove,  alter,  change  or  demolish  an  existing\nstructure.”.\n\nAmendment of Schedules to Cap. 274A\n\n22.\n\nThe principal Act is amended\n\n(a)\n\nin paragraph 8 of the First Schedule by deleting the words “General\nManager” wherever they appear and substituting the words “Chief\nExecutive Officer”;\n\n(b)\n\nby renumbering the Second Schedule as the Third Schedule;\n\n(c)\n\n(d)\n\nby inserting as the new Second Schedule, the Schedule set out in the\nFirst Schedule to this Act; and\n\nin paragraph 1(1) of the Third Schedule as renumbered, by deleting\nthe  words  “General  Manager”  and  substituting  the  words  “Chief\nExecutive Officer”.\n\nConsequential amendments\n\n23.(1)\nSchedule are amended in the manner specified in the second column.\n\nThe enactments specified in the first column of Part I of the Second\n\nThe enactments set out in Part II of the Second Schedule are repealed\n\n(2)\nor revoked as the case may be.\n\n\f24\n\nFIRST SCHEDULE\n\n“SECOND SCHEDULE\n\n(Section 22)\n\n(Section 18A)\n\nWATER AND WELLS MANAGEMENT COMMITTEE\n\n1.\ncomprise the following persons, ex officio:\n\nThe  Water  and  Wells  Management  Committee  shall\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe  Permanent  Secretary  in  the  Ministry  responsible  for\nWater Resources or his nominee;\n\nthe Chief Executive Officer of the Barbados Water Authority\nor his nominee;\n\nthe  Director,  Environmental  Protection  Department  or  his\nnominee;\n\nthe  Permanent  Secretary  in  the  Ministry  responsible  for\nAgriculture or his nominee;\n\n(e)\n\nthe Chief Medical Officer or his nominee;\n\n(f)\n\n(g)\n\nthe Permanent Secretary in the Ministry responsible for the\nEnvironment or his nominee; and\n\nthe  Chief  Executive  Officer  of  the  Barbados  Agriculture\nDevelopment Marketing Corporation or his nominee.\n\n2.(1)\nThe  Minister  shall  by  instrument  in  writing  appoint  a\nmember of the Committee to be Chairman and another member to be\nDeputy Chairman.\n\n\f25\n\n(2)\nA  member  appointed  as  Chairman  or  Deputy  Chairman  may\nresign  the  post  of  Chairman  or  Deputy  Chairman  by  instrument  in\nwriting addressed to the Minister.\n\nA resignation takes effect from the date on which the Minister\n\n(3)\nreceives the instrument.\n\n3.\nThe  Permanent  Secretary  in  the  Ministry  responsible  for\nWater  Resources  shall  assign  a  public  officer  to  be  secretary  to  the\nCommittee to assist the Committee with such clerical and secretarial\nduties as may be required.\n\n4.\n\nFive members of the Committee shall constitute a quorum.\n\n5.(1)\nbe necessary or expedient for the transaction of its business.\n\nThe Committee shall meet at such times and places as may\n\nThe  Chairman  may  at  any  time  call  a  special  meeting  of  the\n(2)\nCommittee, and shall call such a meeting within 7 days of the receipt\nof a request for the purpose addressed to him in writing and signed by\nnot less than 3 members of the Committee.\n\nThe secretary to the Committee shall ensure that minutes are kept\n\n(3)\nfor each meeting and confirmed\n\n(a)\n\n(b)\n\nby electronic means prior to the next meeting; or\n\norally or in writing at the next meeting.\n\nDecisions of the Committee shall be by a majority of votes and,\n(4)\nwhere the voting is equal, the person presiding at the meeting shall have\na casting vote.\n\nThe  Committee  may  invite  any  person  to  attend  any  of  its\n(5)\nmeetings  to  assist  or  advise  it  with  respect  to  any  matter  under  its\nconsideration, but a person so invited does not have a right to vote.\n\n\f26\n\nThe validity of the proceedings of the Committee shall not be\n\n(6)\naffected by a vacancy amongst the members of the Committee.\n\n6.(1)\nother persons to assist it with the proper discharge of its functions.\n\nThe Committee may appoint committees of its members or\n\nWhere  a  person  who  is  not  a  member  of  the  Committee  is\n(2)\nappointed to a committee, the Committee may, with the approval of the\nMinister, determine the remuneration and allowances to be paid to the\nperson.\n\n7.\nproceedings.”.\n\nSubject  to  this  Act,  the  Committee  may  regulate  its  own\n\n\f27\n\nL.R.O. 1998SECOND SCHEDULE(Section 23)PART ICONSEQUENTIAL AMENDMENTSEnactment1.Marine Pollution ControlAct, Cap. 392A2.Health Services (Hotels)Regulations, 1969(S.I. 1969 No. 231)3.Health Services (Building)Regulations, 1969(S.I. 1969 No. 233)AmendmentsIn section 5, insert after subsection (2), the following:\"(3) A marine pollution control inspector discharging the functions set out in this Act, shall also monitor compliance with the Barbados Water Authority (Water Protection Zones) Order, 2023 (S.I. 2023 No.   ) and report any infringement thereof to the Barbados Water Authority or to the police, as the case may be.\".In regulation 4, insert after paragraph (3), the following:\"(4) Without prejudice to the generality of paragraph (3), where the Minister grants a licence, he shall include as a condition of the licence a requirement for the licensee to comply with the Barbados Water Authority (Water Protection Zones) Order, 2023 (S.I. 2023 No.   ).\".1.In regulation 3(3), delete the words “Chief Town Planner”wherever they appear and substitute the words “Director ofPlanning and Development”.2.Delete regulation 4 and substitute the following:\"4.(1)  The Minister may, in respect of an applicationmade under these Regulations\f28\n\n L.R.O. 1998Enactment3. Health Services (Building) Regulations, 1969  (S.I. 1969 No. 233)  - (Concl'd)  4. Health Services (Restaurants) Regulations, 1969 (S.I. 1969 No. 234) Amendments(a) deny the application;(b) approve the application and, where he determines that conditions are required, attach such conditions to the approval of the application as he thinks ﬁ t; or(c) give conditional approval of the application and, where he does so, he shall specify the conditions which must be satisﬁ ed before the application is approved.   (2) The Minister shall notify an applicant in writing of his decision on an application under paragraph (1)  within forty-two days of receipt of the application.(3) Where the Minister approves an application under paragraph (1)(b), he shall include as a condition of the approval a requirement for the applicant to comply with the Barbados Water Authority (Water Protection Zones) Order, 2023 (S.I. 2023 No.  ).”.In regulation 3,(a) insert after paragraph (2), the following:\"(2A) Where a licence or permit is issued, it shall be subject to the condition that the holder thereof shall comply with the Barbados Water Authority (Water Protection Zones Order, 2023 (S.I. 2023 No.  ).\"; and(b) renumber the paragraph after paragraph (6), as regulation 4.CONSEQUENTIAL AMENDMENTS - (Cont'd)Second Schedule - (Cont'd)\f29\n\n L.R.O. 1998Enactment5. Health Services (Lodging Houses and Barracks) Regulations, 1970  (S.I. 1970 No. 74)6. Health Services (Private Hospitals, Nursing Homes, Senior Citizens’ Homes and Maternity Homes)  Regulations, 2005 (S.I. 2005 No. 58) AmendmentsIn regulation 7, insert after the word “regulations”, the words “or the person in charge of the premises fails to comply with the Barbados Water Authority (Water Protection Zones) Order, 2023 (S.I. 2023 No.   ).”.In regulation 6, insert after paragraph (4), the following:\"(5) A licence shall be subject to the condition that the licensee shall comply with the Barbados Water Authority (Water Protection Zones) Order, 2023 (S.I. 2023 No.   ).\".CONSEQUENTIAL AMENDMENTS - (Concl'd)Second Schedule - (Cont'd)\f30\n\n L.R.O. 1998PART IIREPEALS AND REVOCATIONS1. Underground Water Control Act, Cap. 2832. Town and Country Planning Development Order, 1972 (S.I. 1972 No. 75)Second Schedule - (Concl'd)\f31\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2023.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2023.\n\nPresident\n\n"
}