{
  "bill_id": 732,
  "slug": "road-traffic-amendment-act-2023",
  "title": "Road Traffic (Amendment) Act, 2023",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/e29f880d72ebc8a28fb74ef7a51b7925.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-10-18",
  "first_reading": "2023-10-25",
  "gazette_date": "2023-10-23",
  "markdown": "2023-09-05\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Road Traffic Act, Cap. 295\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nto make provision for privately owned garages to inspect and examine\ncertain vehicles;\n\nto increase the age at which a medical certificate is required to renew\na driving licence;\n\nto provide the period of renewal of a driving licence for persons from\nthe age of 75 years to the age of 85 years;\n\nto provide the period of renewal of a driving licence for persons over\nthe age of 85 years; and\n\n(e)\n\nto provide for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of section 2 of Cap. 295\n\nRepeal and replacement of section 3 of Cap. 295\n\nAmendment of section 76 of Cap. 295\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Road Traffic Act, Cap. 295.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Road Traffic (Amendment) Act, 2023.\n\n\f4\n\nAmendment of section 2 of Cap. 295\n\n2.\nSection 2 of the Road Traffic Act, Cap. 295, in this Act referred to\nas the principal Act, is amended by inserting in the appropriate alphabetical\norder the following definition:\n\n“  “approved  garage”  means  a  garage  approved  by  the  Minister  in\n\naccordance with section 3(3);”.\n\nRepeal and replacement of section 3 of Cap. 295\n\n3.\nsubstituted:\n\nSection  3  of  the  principal  Act  is  deleted  and  the  following\n\n“Appointment and duties of examiners or inspectors in\nrespect of motor vehicles\n\n3.(1)\n\nThe Licensing Authority may authorise such number of\n\n(a)\n\n(b)\n\npublic officers; and\n\nprivately owned garages,\n\nas  it  thinks  necessary  to  be  vehicle  examiners  for  the  purpose  of\ninspecting and examining motor vehicles in order to determine the road\nworthiness of the vehicles and to issue certificates in accordance with\nthis Act.\n\nThe Licensing Authority may authorise such public officers as it\n(2)\nthinks  necessary  to  be  transport  inspectors  to  monitor  and  report  on\nground  transportation  systems  to  ensure  that  owners  and  drivers  of\nmotor vehicles conform to the provisions of the Act and regulations\nmade thereunder with respect to the operation and licensing of a motor\nvehicle.\n\n\f5\n\n(3)\nThe Minister may by order designate a privately owned garage\nas  an  approved  garage  for  the  purpose  of  inspecting  and  examining\nmotor vehicles in order to determine the roadworthiness of the vehicles\nand to issue certificates in accordance with this Act.\n\nA person appointed or authorised by the Licensing Authority to\n(4)\nbe a vehicle examiner shall inspect any motor vehicle or trailer at the\nrequest of a member of the Police Service or a transport inspector.\n\nSubsection (4) shall not apply where the Licensing Authority has\n(5)\nauthorised  a  privately  owned  garage  to  be  a  vehicle  examiner  in\naccordance with subsection (1).”.\n\nAmendment of section 76 of Cap. 295\n\n4.\n\nSection 76 the Road Traffic Act, Cap. 295 is amended\n\n(a)\n\nby deleting subsection (5) and substituting the following:\n\n“(5)\n\nWhere the holder of a driving licence\n\n(a)\n\n(b)\n\nis  75  years  of  age  and  not  more  than  85  years  of  age,  the\nlicence  of  that  holder  may  be  renewed  for  a  period  not\nexceeding 2 years from the date that the renewed licence is\nissued; or\n\nis  over  85  years  of  age,  the  licence  of  that  holder  may  be\nrenewed  for  a  period  of  one  year  from  the  date  that  the\nrenewed licence is issued,\n\nwhere  that  person  submits  a  medical  certificate  to  the  Licensing\nAuthority signed by a medical practitioner as to that person’s physical\nfitness.”; and\n\n(b)\n\nby deleting subsection (7) and substituting the following:\n\n\f6\n\n“(7)\nNotwithstanding subsection (1), a driving licence may be issued\nto an applicant who is 75 years of age and not more than 85 years of\nage for a period not exceeding 2 years.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2023.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2023.\n\nPresident\n\n"
}