{
  "bill_id": 735,
  "slug": "debt-natural-disaster-and-pandemic-deferment-of-payment-miscellaneous-provisions-bill-2023",
  "title": "Debt (Natural Disaster and Pandemic Deferment of Payment) (Miscellaneous Provisions) Bill, 2023",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/c8141eb7c3d0e23b1b32fc58042da21b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-11-15",
  "first_reading": "2023-11-29",
  "gazette_date": "2023-10-30",
  "markdown": "2023-07-25\n\nOBJECTS AND REASONS\n\nThis  Bill  would  make  provision  for  deferment  of  the  payment  of  the\namortizations and interest due on debt on the occurrence of a natural disaster or\na pandemic event under certain enactments.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\nShort title\n\nAmendment of enactments\n\nSCHEDULE\n\nConsequential Amendments\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to make provision for deferment of the payment of the amortizations\nand interest due on debt on the occurrence of a natural disaster or a pandemic\nevent under certain enactments.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nDeferment of Payment) (Miscellaneous Provisions) Act, 2023.\n\nThis Act may be cited as the Debt (Natural Disaster and Pandemic\n\nAmendment of enactments\n\n2.\nthe manner specified in Column 2 of the Schedule.\n\nThe enactments set out in Column 1 of the Schedule are amended in\n\n\f5\n\nL.R.O. 1998SCHEDULE(Section 2)CONSEQUENTIAL AMENDMENTSEnactment1.External Loan Act, Cap. 94DAmendmentsThe External Loan Act, Cap. 94D is amended by inserting immediately after section 9 the following:\"Natural Disaster Deferment10.(1) Where a natural disaster has occurred in respect of which a policy payment was made to the Government under the CCRIF Policy and subject to subsection (2), the Government may elect to defer the payment of the principal amortizations and interest payments to holdersof the securities on the date of payment under the securities.(2)The Government shall be entitled to defer thepayment of the principal amortizations and interestpayments falling due on the securities following theoccurrence of a natural disaster for the consecutive2 year period immediately after the submission of adeferral claim by the Government to the holders of thesecurities or for the consecutive 2 year immediatelyfrom and including the next interest payment date after adeferral claim was submitted by the Government to the holders of the securities where(a)the CCRIF Policy is in effect and CCRIFhas issued a written report confirmingthat the natural disaster is an insuredevent in respect of which a CCRIF PolicyPayment has been made to Barbados;\f6\n\n L.R.O. 1998Enactment1. External Loan Act, Cap. 94D (Cont'd)Amendments(b) neither the coverage limit nor exhaustion point applicable to the insured event has been reduced by CCRIF and CCRIF has declined a request submitted by Barbados to CCRIF to maintain such coverage limit or  exhaustion point, as the case may be; and(c) the referenced modelled loss to Barbados  from the natural disaster is greater than  $10 million.(3) The deferred payment amount shall remain outstanding and shall continue to accrue interest in manner set out in subsection (4).(4)  The portion of the deferred payment amount that is comprised of interest shall be capitalized and added to the principal as each interest payment falls due under the terms of the securities after the relevant deferral date and as that interest is converted into principal, the principal amount of the securities shall be increased in the amount of the deferred interest.(5) Beginning with the next payment date following a deferral date, each remaining principal amortization of the securities, shall be(a) paid as a single payment if the original  maturity was a single payment; or(b) increased by an amount equal to a pro  rata portion of principal that is being  deferred on the deferral date, taking intoSchedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f7\n\n L.R.O. 1998Enactment1. External Loan Act, Cap. 94D  (Cont'd)Amendments account the number of remaining principal  amortization payments of that security.(6) Upon electing to defer the payment of the deferred payment amount, the Government shall at its own expense provide notice thereof to be known as a \"deferral claim\" to the security holders.(7) The deferral claim, referred to in subsection (6),  shall in relation to the securities, describe in reasonable detail the particulars of the natural  disaster.(8) The Government shall be entitled to make no  more than 3 deferral claims under each security.(9) For the purposes of this section, \"CCRIF\" means CCRIF SPC, formerly, the Caribbean  Catastrophe Risk Insurance Facility, or any  successor thereof, with whom the Government  of Barbados has entered into the CCRIF Policy;\"CCRIF\" means CCRIF SPC, formerly, the Caribbean  Catastrophe Risk Insurance Facility, or any  successor thereof, with whom the Government  of Barbados has entered into the CCRIF Policy;\"\"CCRIF Policy\" means the Parametric Insurance  Contract which the Government of Barbados has  entered into with CCRIF to insure against risks  of earthquake, tropical cyclone and excess  rainfall, including any documents incorporated  by reference therein and any attachments,Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f8\n\n L.R.O. 1998Enactment1. External Loan Act, Cap. 94D  (Cont'd)Amendments  annexes, appendices or supplements thereto,  including but not limited to the applicable  coverage summary and associated loss curve data  spreadsheet, as such CCRIF Policy maybe  amended or supplemented from time to time;\"coverage limit\" has the meaning assigned to it by the  CCRIF Policy;\"deferral date\" means the payment date under the relevant securities next following submission of  a deferral claim;\"deferred payment amount\" means all principal  amortizations and interest payments falling due  on securities for the consecutive 2 year period  immediately following the deferral date;\"exhaustion point\" has the meaning assigned to it by  the CCRIF Policy;\"insured event\" means a natural disaster which is  covered by the CCRIF Policy;\"natural disaster\" means an earthquake, a tropical  cyclone or excess rainfall as deﬁ ned by the CCRIF  Policy;\"referenced modelled loss\" means the loss in respect of  a natural disaster calculated under the CCRIF  Policy as in effect on the closing date, using the  relevant return period applicable to the natural  disaster and when calculating the reference  modelled loss, the return period applicable to the  natural disaster, if not divisible by 5, Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f9\n\n L.R.O. 1998Enactment1. External Loan Act, Cap. 94D  (Cont'd)Amendments shall be rounded down to the nearest number that is divisible by 5; and\"return period\", in relation to years, means the return  period applicable to the natural disaster in  accordance with the relevant provisions of the  model and formulae described in the CCRIF  Policy.Pandemic Event Deferment11.(1)  Where a pandemic event has occurred, subject to subsection (2), the Government may elect to defer the payment of the principal amortizations and interest payments to holders of the security on the date of payment under the security.(2) The Government shall be entitled to defer the payment of the principal amortizations and interest payments falling due on securities following the occurrence of a pandemic event for the consecutive 2 year period immediately after the submission of a deferral claim by the Government to the holders of the security.(3) The deferred payment amount shall remain outstanding and shall continue to accrue interest in manner set out in subsection (4).(4)  The portion of the deferred payment amount that is comprised of interest shall be capitalized and added to the principal as each interest payment falls due under the terms of the security after the relevant deferral date and as that interest is converted into principal, theprincipal amount of the security shall be increased in the amount of the deferred interest.Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f10\n\n L.R.O. 1998Enactment1. External Loan Act, Cap. 94D  (Cont'd)Amendments(5) Beginning with the next payment date following a deferral date, each remaining principal amortization of the security, shall be(a) paid as a single payment if the original   maturity was a single payment; or(b) increased by an amount equal to a pro rata   portion of principal that is being deferred   on the deferral date, taking into account the   number of remaining principal amortization payments of that security.(6) Upon electing to defer the payment of the deferred payment amount, the Government shall at its own expense provide notice thereof to be known as a \"deferral claim\" to the security holders.(7) The deferral claim, referred to in subsection (6),shall in relation to the securities, describe in reasonable detail the particulars of the pandemic event.(8) The Government shall be entitled to make no more than 3 deferral claims under each security.(9) For the purposes of this section,\"deferral date\" means the payment date under the relevant security next following submission of a  deferral claim;\"deferred payment amount\" means all principal  amortizations and interest payments falling due  on securities for the consecutive 2 year period  immediately following the deferral date;Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f11\n\n L.R.O. 1998Enactment1. External Loan Act, Cap. 94D  (Cont'd)Amendments\"pandemic event\" means the occurrence of the following sequence of events after the issuance date of the  relevant securities:(a) the World Health Organization declares a Public Health Emergency of International Concern, as deﬁ ned in the International Health Regulations of the World Health Organization, with respect to any disease that grants  such disease phase 6 status,or any other categorization as the WHO may use to  describe an active ongoing pandemic from time to time excluding the continuation of the  COVID-19 pandemic in the form of the current  variants of COVID-19 existing as at the date of the issuance of the relevant securities;(b) a public health emergency has been  declared under section 28A of the   Emergency Management Act, Cap. 160A;   and(c) either(i) the occurrence of a real GDP contraction  over 2 consecutive quarters, which in aggregate results in a  contraction of at least 5 per cent of real GDP relative to the same 2 quarters in the previous ﬁ scal  year based on estimated realized GDP at  constant prices for the current year andSchedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f12\n\n L.R.O. 1998Enactment1. External Loan Act, Cap. 94D  (Concl'd)Amendments  provisional realized GDP at constant prices for the prior year, as published by the Central Bank of Barbados and reported to at least one of the  International Monetary Fund or the World Bank; or(ii) the events described in paragraph (a) and (b) result in the Government of Barbados  approving and enacting legislation to increase governmental spending directly relating to the relevant Public Health Emergency of International Concern and the measures taken by the Government of Barbados  in response that is at least equal to $37 500 000,and for the purposes of (ii), any reduction in budgeted Government spending as a result of payments due under the securities being deferred as a result of a pandemic event occurring shall be disregarded when determining whether an increase in governmental spending has been approved; and\"real GDP\" means the gross domestic product of  Barbados at constant prices as adjusted for  inﬂ ation.\".  Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f13\n\n L.R.O. 1998Enactment2. Guarantee of Loans (Companies) Act, Cap. 96Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)AmendmentsThe Guarantee of Loans (Companies) Act, Cap. 96 is amended by inserting immediately after section 8 the following:  \"Natural Disaster Deferment8A.(1) Where a natural disaster has occurred in respect of which a policy payment was made to the Government under the CCRIF Policy and subject to subsection (2), the Government may elect to defer the payment of the principal amortizations and interest payments to lending agency of the money borrowed on date of payment under the loan.(2)  The Government shall be entitled to defer the payment of the principal amortizations and interest payments falling due on loans following the occurrence of a natural disaster for the consecutive 2 year period immediately after the submission of a deferral claim by the Government to the lending agency for the consecutive 2 year immediately from and including the next interest payment date after a deferral claim was submitted by the Government to the lending agency where(a)  the CCRIF Policy is in effect and CCRIF  has issued a written report conﬁ rming that  the natural disaster is an insured event in  respect of which a CCRIF Policy Payment   has been made to Barbados; (b) neither the coverage limit nor exhaustion  point applicable to the insured event has been reduced by CCRIF and CCRIF has declined a request submitted by \f14\n\n L.R.O. 1998Enactment2. Guarantee of Loans (Companies) Act, Cap. 96 (Cont'd)Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Amendments Barbados to CCRIF to maintain such  coverage limit or exhaustion point, as the  case may be; and(c) the referenced modelled loss to Barbados  from the natural disaster is greater than  $10 million.(3) The deferred payment amount shall remain outstanding and shall continue to accrue interest in manner set out in subsection (4).(4)  The portion of the deferred payment amount that is comprised of interest shall be capitalized and added to the principal as each interest payment falls due under the terms of the loan after the relevant deferral date and as that interest is converted into principal, the principal amount of the loan shall be increased in the amount of the deferred interest.(5) Beginning with the next payment date following a deferral date, each remaining principal amortization of the loan, shall bea) paid as a single payment if the original  maturity was a single payment; or(b) increased by an amount equal to a pro rata portion of principal that is being deferred on  the deferral date, taking into account the  number of remaining principal amortization payments of that loan.\f15\n\n L.R.O. 1998Enactment2. Guarantee of Loans (Companies) Act, Cap. 96 (Cont'd)Amendments(6) Upon electing to defer the payment of the deferred payment amount, the Government shall at its own expense provide notice thereof to be known as a \"deferral claim\" to the lending agency.(7) The deferral claim, referred to in subsection (6), shall in relation to the loans, describe in reasonable detail the particulars of the natural disaster.(8) The Government shall be entitled to make no more than 3 deferral claims under each loan.(9) For the purposes of this section, \"CCRIF\" means CCRIF SPC, formerly, the Caribbean  Catastrophe Risk Insurance Facility, or any  successor thereof, with whom the Government  of Barbados has entered into the CCRIF Policy;\"CCRIF\" means CCRIF SPC, formerly, the Caribbean  Catastrophe Risk Insurance Facility, or any  successor thereof, with whom the Government  of Barbados has entered into the CCRIF Policy;\"\"CCRIF Policy\" means the Parametric Insurance  Contract which the Government of Barbados has  entered into with CCRIF to insure against risks  of earthquake, tropical cyclone and excess  rainfall, including any documents incorporated  by reference therein and any attachments,  annexes, appendices or supplements thereto,  including but not limited to the applicable  coverage summary and associated loss curve data  spreadsheet, as such CCRIF Policy maybe  amended or supplemented from time to time;Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f16\n\n L.R.O. 1998Amendments\"coverage limit\" has the meaning assigned to it by the  CCRIF Policy;\"deferral date\" means the payment date under the relevant loan next following submission of a  deferral claim;\"deferred payment amount\" means all principal  amortizations and interest payments falling due  on loans for the consecutive 2 year period  immediately following the deferral date;\"exhaustion point\" has the meaning assigned to it by  the CCRIF Policy;\"insured event\" means a natural disaster which is  covered by the CCRIF Policy;\"natural disaster\" means an earthquake, a tropical  cyclone or excess rainfall as deﬁ ned by the CCRIF  Policy;\"referenced modelled loss\" means the loss in respect of  a natural disaster calculated under the CCRIF  Policy as in effect on the closing date, using the  relevant return period applicable to the natural  disaster and when calculating the reference  modelled loss, the return period applicable to the  natural disaster, if not divisible by 5, shall be  rounded down to the nearest number that is  divisible by 5; andSchedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Enactment2. Guarantee of Loans (Companies) Act, Cap. 96 (Cont'd)\f17\n\n L.R.O. 1998Amendments\"return period\", in relation to years, means the return  period applicable to the natural disaster in  accordance with the relevant provisions of the  model and formulae described in the CCRIF  Policy.Pandemic Event Deferment8B.(1) Where a pandemic event has occurred, subject to subsection (2), the Government may elect to defer the payment of the principal amortizations and interestpayments to the lending agency on the date of payment under the loan.(2) The Government shall be entitled to defer the payment of the principal amortizations and interest payments falling due on loans following the occurrence of a pandemic event for the consecutive 2 year period immediately after the submission of a deferral claim by the Government to the lending agency.(3) The deferred payment amount shall remain outstanding and shall continue to accrue interest in manner set out in subsection (4).(4)  The portion of the deferred payment amount that is comprised of interest shall be capitalized and added to the principal as each interest payment falls due under the terms of the loan after the relevant deferral date and as that interest is converted into principal, theprincipal amount of the loan shall be increased in the amount of the deferred interest.Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Enactment2. Guarantee of Loans (Companies) Act, Cap. 96 (Cont'd)\f18\n\n L.R.O. 1998Amendments(5) Beginning with the next payment date following a deferral date, each remaining principal amortization of the loan, shall be(a) paid as a single payment if the original  maturity was a single payment; or(b) increased by an amount equal to a pro rata portion of principal that is being deferred on the deferral date, taking into account the number of remaining principal amortization  payments of that loan.(6) Upon electing to defer the payment of the deferred payment amount, the Government shall at its own expense provide notice thereof to be known as a \"deferral claim\" to the lenders.(7) The deferral claim, referred to in subsection (6),shall in relation to the loans, describe in reasonable detail the particulars of the pandemic event.(8) The Government shall be entitled to make no more than 3 deferral claims under each loan.(9) For the purposes of this section,\"deferral date\" means the payment date under the relevant loan next following submission of a  deferral claim;\"deferred payment amount\" means all principal  amortizations and interest payments falling due  on loans for the consecutive 2 year period  immediately following the deferral date;Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Enactment2. Guarantee of Loans (Companies) Act, Cap. 96 (Cont'd)\f19\n\n L.R.O. 1998Amendments\"pandemic event\" means the occurrence of the following  sequence of events after the issuance date of the relevant loans:(a) the World Health Organization declares a   Public Health Emergency of International   Concern, as deﬁ ned in the International Health Regulations of the World Health Organization, with respect to any disease that grants such disease phase 6 status,or any other categorization as the WHO may use to describe an active ongoing pandemic from time to time excluding the  continuation of the COVID-19  pandemic in the form of the current  variants of COVID-19 existing as at the date of the issuance of the relevant loans;(b) a public health emergency has been   declared under section 28A of the   Emergency Management Act, Cap. 160A;   and(c) either(i) the occurrence of a real GDP  contraction over 2 consecutive  quarters, which in aggregate results in a contraction of at least 5 per cent of real GDP relative to the same 2 quarters in the previous fiscal year based on estimated realized GDP at constant prices for the current year and provisional realized GDP at constant prices for the prior year, published by the Central Bank of Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Enactment2. Guarantee of Loans (Companies) Act, Cap. 96 (Cont'd)\f20\n\n L.R.O. 1998Amendments (i) Barbados and reported to at least one  of the International Monetary Fund or  the World Bank; or(ii) the events described in paragraphs (a)  and (b) result in the Government of Barbados approving and enacting legislation to increase governmental  spending directly relating to the  relevant Public Health Emergency of International Concern and the measures taken by the Government of Barbados in response that is at least equal to $37 500 000,and for the purposes of (ii), any reduction in budgeted Government spending as a result ofpayments due under the loans being deferred as a result of a pandemic event occurring shall be disregarded when determining whether an increase in governmental spending has been approved; and\"real GDP\" means the gross domestic product of  Barbados at constant prices as adjusted for  inﬂ ation.\".  Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Enactment2. Guarantee of Loans (Companies) Act, Cap. 96 (Concl'd)\f21\n\n L.R.O. 1998Enactment3. Local Loans Act, Cap.98AmendmentsThe Local Loans Act, Cap. 98 is amended by inserting immediately after section 17 the following:  \"Natural Disaster Deferment17A.(1) Where a natural disaster has occurred in respect of which a policy payment was made to the Government under the CCRIF Policy and subject to subsection (2), the Government may elect to defer the payment of the principal amortizations and interest payments to holders of the securities on date of payment under the securities.(2)  The Government shall be entitled to defer the payment of the principal amortizations and interest payments falling due on the securities following the occurrence of a natural disaster for the consecutive 2 year period immediately after the submission of a deferral claim by the Government to the holders of the securities or for the consecutive 2 year immediately from and including the next interest payment date after a deferral claim was submitted by the Government to the holders of the securities where(a) the CCRIF Policy is in effect and CCRIF has issued a written report conﬁ rming that  the natural disaster is an insured event in  respect of which a CCRIF Policy Payment  has been made to Barbados;Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f22\n\n L.R.O. 1998Enactment3. Local Loans Act, Cap.98 (Cont'd)Amendments(b) neither the coverage limit nor exhaustion   point applicable to the insured event has   been reduced by CCRIF and CCRIF has  declined a request submitted by   Barbados to CCRIF to maintain such  coverage limit or exhaustion point, as the   case may be; and(c) the referenced modelled loss to Barbados  from the natural disaster is greater than  $10 million.(3) The deferred payment amount shall remain outstanding and shall continue to accrue interest in manner set out in subsection (4).(4)  The portion of the deferred payment amount that is comprised of interest shall be capitalized and added to the principal as each interest payment falls due under the terms of the securities after the relevant deferral date and as that interest is converted into principal, the principal amount of the securities shall be increased in the amount of the deferred interest.(5) Beginning with the next payment date following a deferral date, each remaining principal amortization of the securities, shall be(a) paid as a single payment if the original   maturity was a single payment; or(b) increased by an amount equal to a pro   rata portion of principal that is being   deferred on the deferral date, taking into   account the number of remaining principal   amortization payments of that security.Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f23\n\n L.R.O. 1998Enactment3. Local Loans Act, Cap.98 (Cont'd)Amendments(6) Upon electing to defer the payment of the deferred payment amount, the Government shall at its own expense provide notice thereof to be known as a \"deferral claim\" to the security holders.(7) The deferral claim, referred to in subsection (6),  shall in relation to the securities, describe in reasonable detail the particulars of the natural  disaster.(8) The Government shall be entitled to make no  more than 3 deferral claims under each security.(9) For the purposes of this section, \"CCRIF\" means CCRIF SPC, formerly, the Caribbean  Catastrophe Risk Insurance Facility, or any  successor thereof, with whom the Government  of Barbados has entered into the CCRIF Policy;\"CCRIF\" means CCRIF SPC, formerly, the Caribbean  Catastrophe Risk Insurance Facility, or any  successor thereof, with whom the Government  of Barbados has entered into the CCRIF Policy;\"\"CCRIF Policy\" means the Parametric Insurance  Contract which the Government of Barbados has  entered into with CCRIF to insure against risks  of earthquake, tropical cyclone and excess  rainfall, including any documents incorporated  by reference therein and any attachments,  annexes, appendices or supplements thereto,  including but not limited to the applicable  coverage summary and associated loss curve data  spreadsheet, as such CCRIF Policy maybe  amended or supplemented from time to time;Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f24\n\n L.R.O. 1998Enactment3. Local Loans Act, Cap.98 (Cont'd)Amendments\"coverage limit\" has the meaning assigned to it by the  CCRIF Policy;\"deferral date\" means the payment date under the relevant security next following submission of a  deferral claim;\"deferred payment amount\" means all principal  amortizations and interest payments falling due  on securities for the consecutive 2 year period  immediately following the deferral date;\"exhaustion point\" has the meaning assigned to it by  the CCRIF Policy;\"insured event\" means a natural disaster which is  covered by the CCRIF Policy;\"natural disaster\" means an earthquake, a tropical  cyclone or excess rainfall as deﬁ ned by the CCRIF  Policy;\"referenced modelled loss\" means the loss in respect of  a natural disaster calculated under the CCRIF  Policy as in effect on the closing date, using the  relevant return period applicable to the natural  disaster and when calculating the reference  modelled loss, the return period applicable to the  natural disaster, if not divisible by 5, shall be  rounded down to the nearest number that is  divisible by 5; andSchedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f25\n\n L.R.O. 1998Enactment3. Local Loans Act, Cap.98 (Cont'd)Amendments\"return period\", in relation to years, means the return  period applicable to the natural disaster in  accordance with the relevant provisions of the  model and formulae described in the CCRIF  Policy.Pandemic Event Deferment17B.(1) Where a pandemic event has occurred, subject to subsection (2), the Government may elect to defer the payment of the principal amortizations and interest payments to holders of the security on date of payment under the security.(2) The Government shall be entitled to defer the payment of the principal amortizations and interest payments falling due on securities following the occurrence of a pandemic event for the consecutive 2 year period immediately after the submission of a deferral claim by the Government to the holders of the security.(3) The deferred payment amount shall remain outstanding and shall continue to accrue interest in manner set out in subsection (4).(4)  The portion of the deferred payment amount that is comprised of interest shall be capitalized and added to the principal as each interest payment falls due under the terms of the security after the relevant deferral date and as that interest is converted into principal, theprincipal amount of the security shall be increased in the amount of the deferred interest.Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f26\n\n L.R.O. 1998Enactment3. Local Loans Act, Cap.98 (Cont'd)Amendments(5) Beginning with the next payment date following a deferral date, each remaining principal amortization of the security, shall be(a) paid as a single payment if the original   maturity was a single payment; or(b) increased by an amount equal to a pro rata portion of principal that is being  deferred on the deferral date, taking into account the number of remaining principal amortization payments of that security.(6) Upon electing to defer the payment of the deferred payment amount, the Government shall at its own expense provide notice thereof to be known as a \"deferral claim\" to the security holders.(7) The deferral claim, referred to in subsection (6),shall in relation to the securities, describe in reasonable detail the particulars of the pandemic event.(8) The Government shall be entitled to make no more than 3 deferral claims under each security.(9) For the purposes of this section,\"deferral date\" means the payment date under the relevant security next following submission of a  deferral claim;\"deferred payment amount\" means all principal  amortizations and interest payments falling due  on securities for the consecutive 2 year period  immediately following the deferral date;Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f27\n\n L.R.O. 1998Enactment3. Local Loans Act, Cap.98 (Cont'd)Amendments\"pandemic event\" means the occurrence of  the following sequence of events after the issuance  date of the relevant securities:(a) the World Health Organization declares a Public Health Emergency of International Concern, as defined in the International Health Regulations of the World Health Organization, with respect to any disease that grants such disease phase 6 status,or any other categorization as the WHO may use to describe an active ongoing pandemic from time to time excluding the continuation of the COVID-19 pandemic in the form of the  current variants of COVID-19 existing as at the date of the issuance of the relevant securities;(b) a public health emergency has been  declared under section 28A of the  Emergency Management Act, Cap. 160A;  and(c) either(i)  the occurrence of a real GDP contraction over 2 consecutive quarters, which in aggregate results in a contraction of at least 5 per cent of real GDP relative to the same 2 quarters in the previous ﬁ scal year based on estimated realized GDP at constant prices for the current year and provisional realized GDP at constant prices for the prior year, asSchedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f28\n\n L.R.O. 1998Enactment3. Local Loans Act, Cap.98 (Concl'd)Amendments  published by the Central Bank of  Barbados and reported to at least one  of the International Monetary Fund or  the World Bank; or(ii) the events described in paragraphs (a) and  (b) result in the Government of Barbados  approving and enacting legislation to  increase governmental spending directly  relating to the  relevant Public Health  Emergency of International Concern and the measures taken by the Government of Barbados in response that is at least equal to $37 500 000,  and for the purposes of (ii), any reduction in budgeted Government spending as a result ofpayments due under the securities being deferred as a result of a pandemic event occurring shall be disregarded when determining whether an increase in governmental spending has been approved; and\"real GDP\" means the gross domestic product of  Barbados at constant prices as adjusted for inﬂ ation.\".Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f29\n\nL.R.O. 1998Enactment4.Special Loans Act, Cap. 105Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)AmendmentsThe Special Loans Act, Cap. 105 is amended by inserting im-mediately after section 4 the following:\"Natural Disaster Deferment5.(1)  Where a natural disaster has occurred in respect of which a policy payment was made to the Government under the CCRIF Policy and subject to subsection (2), the Government may elect to defer the payment of the principal amortizations and interest payments to lenders of the money borrowed on date of payment under the loan.(2)The Government shall be entitled to defer thepayment of the principal amortizations and interestpayments falling due on loans following theoccurrence of a natural disaster for the consecutive2 year period immediately after the submission of adeferral claim by the Government to the lendersfor the consecutive 2 year immediately from andincluding the next interest payment date after adeferral claim was submitted by the Government to the lenders where(a)the CCRIF Policy is in effect and CCRIFhas issued a written report conﬁ rming that the natural disaster is an insured event in respectof which a CCRIF Policy Payment has beenmade to Barbados;(b)neither the coverage limit nor exhaustionpoint applicable to the insured event has been reduced by CCRIF and CCRIF has declined a request submitted by Barbados to CCRIF tomaintain such coverage limit or exhaustionpoint, as the case may be; and\f30\n\n L.R.O. 1998Enactment4. Special Loans Act, Cap. 105 (Cont'd)Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Amendments (c) the referenced modelled loss to Barbados  from the natural disaster is greater than  $10 million.(3) The deferred payment amount shall remain outstanding and shall continue to accrue interest in manner set out in subsection (4).(4)  The portion of the deferred payment amount that is comprised of interest shall be capitalized and added to the principal as each interest payment falls due under the terms of the loan after the relevant deferral date and as that interest is converted into principal, the principal amount of the loan shall be increased in the amount of the deferred interest.(5) Beginning with the next payment date following a deferral date, each remaining principal amortization of the loan, shall be(a) paid as a single payment if the original  maturity was a single payment; or(b) increased by an amount equal to a pro rata portion of principal that is being  deferred on the deferral date, taking into  account the number of remaining principal amortization payments of that loan.\f31\n\n L.R.O. 1998Enactment4. Special Loans Act, Cap. 105 (Cont'd)Amendments(6) Upon electing to defer the payment of the deferred payment amount, the Government shall at its own expense provide notice thereof to be known as a \"deferral claim\" to the lenders.(7) The deferral claim, referred to in subsection (6), shall in relation to the loans, describe in reasonable detail the particulars of the natural disaster.(8) The Government shall be entitled to make no more than 3 deferral claims under each loan.(9) For the purposes of this section, \"CCRIF\" means CCRIF SPC, formerly, the Caribbean  Catastrophe Risk Insurance Facility, or any  successor thereof, with whom the Government  of Barbados has entered into the CCRIF Policy;\"CCRIF\" means CCRIF SPC, formerly, the Caribbean  Catastrophe Risk Insurance Facility, or any  successor thereof, with whom the Government  of Barbados has entered into the CCRIF Policy;\"\"CCRIF Policy\" means the Parametric Insurance  Contract which the Government of Barbados has  entered into with CCRIF to insure against risks  of earthquake, tropical cyclone and excess  rainfall, including any documents incorporated  by reference therein and any attachments,  annexes, appendices or supplements thereto,  including but not limited to the applicable  coverage summary and associated loss curve data  spreadsheet, as such CCRIF Policy maybe  amended or supplemented from time to time;Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f32\n\n L.R.O. 1998Amendments\"coverage limit\" has the meaning assigned to it by the  CCRIF Policy;\"deferral date\" means the payment date under the relevant loan next following submission of a  deferral claim;\"deferred payment amount\" means all principal  amortizations and interest payments falling due  on loans for the consecutive 2 year period  immediately following the deferral date;\"exhaustion point\" has the meaning assigned to it by  the CCRIF Policy;\"insured event\" means a natural disaster which is  covered by the CCRIF Policy;\"natural disaster\" means an earthquake, a tropical  cyclone or excess rainfall as deﬁ ned by the CCRIF  Policy;\"referenced modelled loss\" means the loss in respect of  a natural disaster calculated under the CCRIF  Policy as in effect on the closing date, using the  relevant return period applicable to the natural  disaster and when calculating the reference  modelled loss, the return period applicable to the  natural disaster, if not divisible by 5, shall be  rounded down to the nearest number that is  divisible by 5; andSchedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Enactment4. Special Loans Act, Cap. 105 (Cont'd)\f33\n\n L.R.O. 1998Amendments\"return period\", in relation to years, means the return  period applicable to the natural disaster in  accordance with the relevant provisions of the  model and formulae described in the CCRIF  Policy.Pandemic Event Deferment6.(1) Where a pandemic event has occurred, subject to subsection (2), the Government may elect to defer the payment of the principal amortizations and interest payments to lenders on the date of payment under the loan.(2) The Government shall be entitled to defer the payment of the principal amortizations and interest payments falling due on loans following the occurrence of a pandemic event for the consecutive 2 year period immediately after the submission of a deferral claim by the Government to the lenders.(3) The deferred payment amount shall remain outstanding and shall continue to accrue interest in manner set out in subsection (4).(4)  The portion of the deferred payment amount that is comprised of interest shall be capitalized and added to the principal as each interest payment falls due under the terms of the security after the relevant deferral date and as that interest is converted into principal, theprincipal amount of the loan shall be increased in the amount of the deferred interest.Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Enactment4. Special Loans Act, Cap. 105 (Cont'd)\f34\n\n L.R.O. 1998Amendments(5) Beginning with the next payment date following a deferral date, each remaining principal amortization of the bond, shall be(a) paid as a single payment if the original maturity was a single payment; or(b) increased by an amount equal to a pro rata portion of principal that is being deferred  on the deferral date, taking into account the  number of remaining principal amortization payments of that loan.(6) Upon electing to defer the payment of the deferred payment amount, the Government shall at its own expense provide notice thereof to be known as a \"deferral claim\" to the lenders.(7) The deferral claim, referred to in subsection (6),shall in relation to the loans, describe in reasonable detail the particulars of the pandemic event.(8) The Government shall be entitled to make no more than 3 deferral claims under each loan.(9) For the purposes of this section,\"deferral date\" means the payment date under the relevant loan next following submission of a  deferral claim;Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Enactment4. Special Loans Act, Cap. 105 (Cont'd)\f35\n\n L.R.O. 1998Amendments\"deferred payment amount\" means all principal  amortizations and interest payments falling due  on loans for the consecutive 2 year period  immediately following the deferral date;\"pandemic event\" means the occurrence of  the following sequence of events after the issuance  date of the relevant loans:(a) the World Health Organization declares a  Public Health Emergency of International Concern, as defined in the International Health Regulations of the World Health Organization, with respect to any disease that grants such disease phase 6 status,or any other categorization as the WHO may use to describe an active ongoing pandemic from time to time excluding the continuation of the COVID-19 pandemic in the form of the current variants of COVID-19 existing as at the date of the issuance of the relevant loans;(b) a public health emergency has been  declared under section 28A of the  Emergency Management Act, Cap. 160A; and(c) either(i) the occurrence of a real GDP contraction over 2 consecutive  quarters, which in aggregate results in a  contraction of at least 5 per cent of real GDP relative to the same 2 quarters in the previous ﬁ scal year based on     Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)Enactment4. Special Loans Act, Cap. 105 (Cont'd)\f36\n\n L.R.O. 1998Amendments  prices for the current year and estimated realized GDP at constant provisional real-ized GDP at constant prices for the prior year, as published by the Central Bank of  Barbados and reported to at least one  of the International Monetary Fund or  the World Bank; or(ii) the events described in paragraphs (a)  and (b) result in the Government of  Barbados approving and enacting legislation to increase governmental  spending directly relating to the  relevant Public Health Emergency of International Concern and the measures  taken by the Government of Barbados  in response that is at least equal to  $37 500 000,and for the purposes of (ii), any reduction in budgeted Government spending as a result of payments due under the loans being deferred as a result of a pandemic event occurring shall be disregarded when determining whether an increase in governmental spending has been approved; and\"real GDP\" means the gross domestic product of  Barbados at constant prices as adjusted for  inﬂ ation.\". Schedule - (Concl'd)CONSEQUENTIAL AMENDMENTS - (Concl'd)Enactment4. Special Loans Act, Cap. 105 (Concl'd)\f37\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2023.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2023.\n\nPresident\n\n"
}