{
  "bill_id": 736,
  "slug": "resolution-of-approx-196-hectares-of-land-at-dodds-st-philip",
  "title": "Resolution of Approx 19.6 Hectares of Land at Dodds, St. Philip",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/239f68336b5aa9b0e02d68d924b756e6.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-11-08",
  "first_reading": "2023-12-13",
  "gazette_date": null,
  "markdown": "|\nf ;\nPARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 approve the vesting in the National Housing Corporation ofa parce] of land situate at Dodds Plantation in the parish of Saint Philip in this Island and more particularly described in the Schedule for residential, commercial and recreational purposes.\nAPPROVED by the House of Assembly this\nday of\nTwo thousand and twenty-three.\nSpeaker\nAPPROVED by the Senate this\nday of\n\n. Two\nthousand and twenty-three.\nPresident\ni\nSCHEDULE\nALL THAT land the property of the State situate at Dodds Plantation in the parish of Saint Philip in this Island containing by admeasurement 195,906.60 square metres (19.591 hectares) or thereabouts abutting and bounding on lands now or late of Lillian Walrond deceased on lands now or late of Nathan D. Garner on lands now or late of Harold Franklin on lands now or formerly of Guinea Estates Inc. on lands now or formerly of Ronald Stoute & Sons Limited and ona public road known as Highway 4B which leads to Highway H in one direction and to Church Village in the other direction or however else the same may abut and bound as shown and delineated on a plan certified on the 15\" day of May, 2023 by Alex R. Chandler, Land Surveyor and recorded in the Lands and Surveys Department on the 16\" day of May, 2023 as Plan No. 807/2023.\nj\nADDENDUM\nThe Cabinet at its meeting held on the 23\" day of March, 2023 considered Note (23) 196 MHLM 19 and agreed, inter alia, that 19.6 hectares of land situate at Dodds North, Dodds, in the parish of Saint Philip which was previously allocated for the establishment of an integrated prison farm, would be re-allocated to the Ministry of Housing, Lands and Maintenance and further agreed that the said re-allocated 19.6 hectares of land be vested in the National Housing Corporation for residential, commercial and recreational purposes.\nin\nThe approval of Parliament is now sought for the vesting of the parcel of land described the Schedule in the National Housing Corporation.\n»\n2\n.\n|\nSufore Gres We 15 /20es Cacrompunisertse No 9d0el- 724\nVen:\nj\nInes: Cblaian any\nCte Tao\nFi\nenue bewaye\nOP OOK\n:\nieeht\n4 a1 “Te\nBYRD qreeane\nPLD amy\n»,\n\n2\n2\nReo\nwt Popesa toe\n=\nree\naM a) ‘tt BPG ogee. Jor oejyn gy ete wow weeet -\n> ~ ' Barhadns\nShAde ent Smale tay \\ . TAseyseau cee nt antitas Vega: lanier: fe BAG Bones or relyee ye Sd tee Arivet very CHS! Re -bservatsny te + Dh Centewty tres ‘SWE ane PODER wc viv ote is laren) Worstar 56 throne OD densa ns pp @ danat + teunr s densles tropwirts par! Aa eaves ty Ren Ae aie CANES 3 asain TEASE sane Tia f Fond Eh tae te: te szn@e eam Sonvegy Degt eet ftps 8 Seeemitiee Let Syapeate\nLARDS AND SURVEYS OFPARENCH\n'\nfects Dowdy Mantztion Wy sir XY Pai if ‘u, Pon Wart 4 ort thaws 4 ion anu * > # s o — “Dory Petting” Prev wh MRO Nhe TAHOE ty my td SON OE deren wee os a reel ae o aay . . 4 Peievees Plan PLN Rarer Curios Wher a TRY are Pacmag me 6. Bp ash ape Oe ee a ee ! | H t H ' } I ! 4 ' ‘\n31\nf sl; ei\ni\n:\n7] | f\n| i\nMWiesrn.t i e =~\nSree PE Tae TESS\nRee ed aS ER\nee\n!\nwhe\nFas, ma Ny\n{ i } t :\n| | |\ni\n: :\n"
}