{
  "bill_id": 737,
  "slug": "resolution-pertaining-to-the-compulsory-acquisition-at-work-hall-st-philip",
  "title": "Resolution Pertaining to the Compulsory Acquisition at Work Hall, St Philip",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/389e230826b8ba5ec4b6d405b05988ef.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2023-11-14",
  "first_reading": "2023-11-14",
  "gazette_date": null,
  "markdown": "2023-10-27\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the\n\nLand  Acquisition  Act,  Cap.  228  approve  the  compulsory  acquisition  by  the  State  of\n\nparcels  of  land  situate  at  Work  Hall  in  the  parish  of  Saint  Philip  in  this  Island  and  more\n\nparticularly  described  in  the  Schedules  for  the  public  purpose  of  regularizing  a  squatters'\n\nhousing area.\n\nAPPROVED by the House of Assembly this          day of                                     ,\n\nTwo thousand and twenty-three.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                            day  of                                                    ,\n\nTwo thousand and twenty-three.\n\nPresident\n\nAPPENDIX IV\n\n\f2\n\nFIRST SCHEDULE\n\nALL  THAT  land  the  property  of Arthur  Pounder  situate  at  Work  Hall  in  the\n\nparish  of  Saint  Philip  in  this  Island  containing  by  admeasurement  9  853.1  square  metres  or\n\nthereabouts  abutting  and  bounding  on  a  road  in  common  leading  to  Highway  5  in  one\n\ndirection on a right of way 4.88 metres wide on lands now or late of Martha Hawkesworth on\n\nlands now or late of Kevin Gobin et al on lands now or late of Jonathan Henry on lands now or\n\nlate of Reynold White on Lots 4, 3 and 2 on lands now or late of Scoﬁ eld Alleyne (Lot 1) and\n\non a public road or however else the same may abut and bound as shown and delineated on a\n\nplan certiﬁ ed on the 7th day of March, 2022 by Samuel N. Taylor, Land Surveyor and recorded\n\nin  the  Lands  and  Surveys  Department  on  the  26th  day  of  May,  2022  as  Plan  No.  819/2022.\n\n\f3\n\nSECOND SCHEDULE\n\nFIRSTLY  ALL  THAT  land  the  property  of  Reynold  White  situate\n\nat  Work  Hall  in  the  parish  of  Saint  Philip  in  this  Island  containing  by  admeasurment\n\n43.2 square metres in road or thereabouts abutting and bounding on other lands now or late of\n\nReynold White on lands now or late of Maureen Butcher (Lot 9)  and on a public road or however\n\nelse the same may abut and bound as shown and delineated on a plan certiﬁ ed on the 7th day\n\nof March, 2022 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Surveys\n\nDepartment on the 26th day of May, 2022 as Plan No. 819/2022;\n\nSECONDLY  ALL  THAT  land  the  property  of  Reynold  White  situate\n\nat  Work  Hall  in  the  parish  of  Saint  Philip  in  this  Island  containing  by  admeasurment\n\n86.1  square  metres  in  road  or  thereabouts  abutting  and  bounding  on  lands  now  or  late  of\n\nArthur Pounder on lands now or late of Jonathan Henry on a road and on other lands now or late of\n\nReynold White or however else the same may abut and bound as shown and delineated on a\n\nplan certiﬁ ed on the 7th day of March, 2022 by Samuel N. Taylor, Land Surveyor and recorded\n\nin the Lands and Surveys Department on the 26th day of May, 2022 as Plan No. 819/2022.\n\n\f4\n\nTHIRD SCHEDULE\n\n  ALL  THAT  land  the  property  of  Jonathan  Henry  situate  at  Work  Hall  in  the\n\nparish  of  Saint  Philip  in  this  Island  containing  by  admeasurement  2  377.3  square  metres\n\n(including  187.5  square  metres  in  road)  or  therabouts  abutting  and  bounding  on  lands  now\n\nor late of Arthur Pounder on lands now or late of Kevin Gobin et al on lands now or late of\n\nBeresford Smith and on a road on two sides and on other lands now or late of Reynold White\n\nor however else the same may abut and bound as shown and delineated on a plan certiﬁ ed on\n\nthe  7th  day  of  March,  2022  by  Samuel  N. Taylor,  Land  Surveyor  and  recorded  in  the  Lands\n\nand Surveys Department on the 26th day of May, 2022 as Plan No. 819/2022.\n\n\f5\n\nFOURTH SCHEDULE\n\n            ALL  THAT  land  the  property  of  Beresford  Smith  situate  at  Work  Hall  in  the\n\nparish  of  Saint  Philip  in  this  Island  containing  by  admeasurement  1  678.5  square  metres  or\n\nthereabouts abutting and bounding on lands now or late of Gwendolyn Browne on lands now or\n\nlate of Abel Scott on a road on lands now or late of Jonathan Henry and on lands now or late of\n\nKevin Gobin et al or however else the same may abut and bound as shown and delineated on a\n\nplan certiﬁ ed on the 7th day of March, 2022 by Samuel N. Taylor, Land Surveyor and recorded\n\nin the Lands and Surveys Department on the 26th day of May, 2022 as Plan No. 819/2022.\n\n\f6\n\nFIFTH SCHEDULE\n\n            ALL THAT land the property of Kevin Gobin et al situate at Work Hall in the\n\nparish  of  Saint  Philip  in  this  Island  containing  by  admeasurement  1  000.6  square  metres  or\n\nthereabouts abutting and bounding on lands now or late of Martha Hawkesworth on lands now or late\n\nof  Gwendolyn  Browne  on  lands  now  or  late  of  Beresford  Smith  on  lands  now  or  late  of\n\nJonathan Henry and on lands now or late of  Arthur Pounder or however else the same may abut and\n\nbound  as  shown  and  delineated  on  a  plan  certified  on  the  7th  day  of  March,  2022  by\n\nSamuel N. Taylor, Land Surveyor and recorded in the Lands and Surveys Department on the\n\n26th day of May, 2022 as Plan No. 819/2022.\n\n\f7\n\nSIXTH SCHEDULE\n\n            ALL  THAT  land  the  property  of  Martha  Hawkesworth  situate  at  Work  Hall\n\nin  the  parish  of  Saint  Philip  in  this  Island  containing  by  admeasurement  992.4  square\n\nmetres (including 156.7 square metres in right of way) or thereabouts abutting and bounding\n\non a right of way 4.88 metres wide on lands now or late of Elizabeth Alleyne on lands now\n\nor late of Gwendolyn Browne on lands now or late of Kevin Gobin et al and on lands now or\n\nlate of Arthur Pounder or however else the same may abut and bound as shown and delineated\n\non  a  plan  certiﬁ ed  on  the  7th  day  of  March,  2022  by  Samuel  N. Taylor,  Land  Surveyor  and\n\nrecorded in the Lands and Surveys Department on the 26th day of May, 2022 as Plan No. 819/2022.\n\n\f8\n\nSEVENTH SCHEDULE\n\n            ALL THAT land the property of Gwendolyn Browne situate at Work Hall in the\n\nparish of Saint Philip in this Island containing by admeasurement 141.0 in square metres in\n\nright of way or thereabouts abutting and bounding on a right of way 4.88 metres wide on lands\n\nnow or late of Elizabeth Alleyne on a right of way 4.88 metres wide which leads to a cul-de-sac\n\nin one direction and on other lands now or late of Gwendolyn Browne and on lands now or\n\nlate  of  Martha  Hawkesworth  or  however  else  the  same  may  abut  and  bound  as  shown  and\n\ndelineated on a plan certiﬁ ed on the 7th day of March, 2022 by Samuel N. Taylor, Land Surveyor\n\nand  recorded  in  the  Lands  and  Surveys  Department  on  the  26th day  of  May,  2022  as\n\nPlan No. 819/2022.\n\n\f9\n\nADDENDUM\n\nThe  Cabinet  at  its  meeting  on  the  27th day  of  May,  2021  considered  Note\n\n(21)  440/MHLM  36  and  agreed  to  the  compulsory  acquisition  of  seven  (7)  parcels  of  land\n\ncontaining  20  988  square  metres  situate  at  Work  Hall  in  the  parish  of  Saint  Philip\n\nin  this  Island  and  more  particularly  described  in  the  Schedules  for  the  purpose  of\n\nregularizing a squatters' housing area at Work Hall, St. Philip.\n\nThe Cabinet at its meeting on the 3rd day of November, 2022 considered Note (22)\n\n(2) 1178/MHLM 78 and approved the Resolution related to the compulsory acquisition of seven\n\n(7)  parcels  of  land  containing  21  062.4  square  metres  situate  at  Work  Hall  in  the  parish  of\n\nSaint Philip in this Island and agreed that Notice of the Resolution should be introduced into\n\nParliament.\n\nThe approved Resolution related to the compulsory acquisition of seven (7) parcels\n\nof land containing 21 062.4 square metres situate at Work Hall in the parish of Saint Philip in\n\nthis  Island  was  submitted  for  debate  and  passage  through  the  House  of Assembly  on  the\n\n6th day of February, 2023 but was subsequently withdrawn from the Order Paper of the House of\n\nAssembly on the 4th day of July, 2023.\n\nIn accordance with section 5 of the Land Acquisition Act, Cap. 228, the approval\n\nof Parliament is now sought for the compulsory acquisition of the parcels of land described in the\n\nSchedules in order that the public purpose set out in the Resolution may be eﬀ ected and that the\n\nState may acquire an indefeasible title to the said parcels of land.\n\n"
}