{
  "bill_id": 738,
  "slug": "national-insurance-and-social-security-amendment-no-2-bill-2023",
  "title": "National Insurance and Social Security (Amendment) (No. 2) Bill, 2023",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3d3a37cd7289cfbfa3c6af1f3a8cfef5.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-11-22",
  "first_reading": "2023-11-21",
  "gazette_date": null,
  "markdown": "2023-11-21\n\nBill as amended\n\nOBJECTS AND REASONS\n\nThis Bill would\n\n(a)\n\namend the law relating to the system of national insurance and social\nsecurity by establishing a body corporate to administer the system and\nperform the functions relating to national insurance and social security\nhitherto administered and performed by the Department of National\nInsurance;\n\n(b)\n\nmake better provision for self employed persons; and\n\n(c)\n\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of section 2 of Cap. 47\n\nAmendment of Cap. 47\n\nAmendment of section 12 of Cap. 47\n\nAmendment of section 21 of Cap. 47\n\nInsertion of section 25B into Cap. 47\n\nAmendment of Cap. 47\n\nAmendment of section 30 of Cap. 47\n\nAmendment of section 30A of Cap. 47\n\n10.\n\nRepeal of section 33 of Cap. 47\n\n11.\n\nAmendment of Schedule I to Cap. 47\n\n12.\n\nAmendment of Cap. 47\n\n13.\n\nConsequential amendments\n\n14.\n\nRepeal of Act 2023-18\n\n15.\n\nCommencement\n\n\f3\n\nFIRST SCHEDULE\n\nPENSIONABLE AGE\n\nSECOND SCHEDULE\n\nNATIONAL INSURANCE AND SOCIAL SECURITY SERVICE BOARD\n\nTHIRD SCHEDULE\n\nCONSEQUENTIAL AMENDMENTS\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the National Insurance and Social Security Act, Cap. 47\nto amend the law relating to the system of national insurance and social security\nby  establishing  a  body  corporate  to  administer  the  system  and  perform  the\nfunctions  relating  to  national  insurance  and  social  security  hitherto\nadministered and performed by the Department of National Insurance and to\nmake better provision for self employed persons.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n(Amendment)(No. 2) Act, 2023.\n\nThis Act may be cited as the National Insurance and Social Security\n\nAmendment of section 2 of Cap. 47\n\n2.\n47, in this Act referred to as the principal Act, is amended by\n\nSection 2 of the National Insurance and Social Security Act, Cap.\n\n(a)\n\ninserting in its alphabetical order the following new definition:\n\n“ “Service” means the National Insurance and Social Security Service\n\nestablished by section 3;”; and\n\n(b)\n\ndeleting the definitions “Board”, “inspector”, “manager”, “owner”\nand  “pensionable  age”  and  substituting  the  following  in  the\nappropriate alphabetical order:\n\n“ “Board” means the National Insurance and Social Security Service\n\nBoard established by section 11M;\n\n“inspector”  means  any  person  appointed  by  the  Service  pursuant  to\nsection 38 to perform the functions of an inspector under this Act;\n\n“manager” and “owner” have in relation to a ship or vessel, the same\nmeaning as that set out in paragraph 2(3) of Part I of Schedule I;\n\n“pensionable  age”  means  each  age  corresponding  with  the  period\n\nprescribed as set out in Schedule II;\n\n“self-employed  person”  means  a  person  gainfully  occupied  in\nemployment in Barbados pursuant to a contract for services;”.\n\n\f7\n\nAmendment of Cap. 47\n\n3.\nfollowing:\n\nThe principal Act is amended by deleting Part I and substituting the\n\n“PART I\n\nESTABLISHMENT, FUNCTIONS AND ADMINISTRATION OF\nTHE SERVICE\n\nEstablishment of Service\n\n3.(1)\nestablished.\n\nThe  National  Insurance  and  Social  Security  Service  is\n\nThe  Service  is  a  body  corporate  to  which  section  21  of  the\n\n(2)\nInterpretation Act, Cap. 1 applies.\n\nFunctions of the Service\n\n4.(1)\n\nThe functions of the Service are to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nmanage  and  operate  the  system  of  national  insurance\nestablished by this Act;\n\nadvise the government and other public authorities on matters\nrelating to this Act and the regulations;\n\nbe responsible for the policy, organization and administration\nof the system of national insurance;\n\nappoint the staff of the Service and to be responsible for the\nrecruitment,  discipline,  promotion  and  termination  of\nemployees;\n\n(e)\n\ndevelop policies for the prudent and efficient management of\nthe Fund;\n\n\f8\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\napprove the budget of the Service and oversee its execution;\n\nestablish or reorganise any internal unit or division for the\neffective functioning of the Service;\n\nconsider  and  approve  the  annual  audited  accounts  and\nfinancial statements of the Service;\n\nadopt the accounting policies and procedures which are in\naccordance  with  internationally  recognized  accounting\nstandards;\n\n(j)\n\ncause to be prepared by the Service\n\n(i)\n\na statement of corporate intent;\n\n(ii)\n\nan annual plan; and\n\n(iii)\n\nmid-year and annual reports.\n\nThe Service shall perform such other functions as are conferred\n\n(2)\nupon it by this Act and any other enactment.\n\nStaff of the Service and establishment of the divisions\n\n5.(1)\n\nThe staff of the Service shall comprise a\n\n(a)\n\n(b)\n\n(c)\n\nChief Executive Officer;\n\nChief Finance Officer;\n\nChief People Development Officer;\n\n(d)\n\nChief Operations Officer;\n\n(e)\n\nChief Investments Officer;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\nChief Policy and Planning Officer;\n\nChief Risk Management Officer;\n\nChief Internal Auditor;\n\nChief Legal Officer;\n\n\f9\n\n(j)\n\nChief Information Technology Officer,\n\nand such number of staff including officers to manage any division that\nit establishes, as it considers necessary for giving effect to this Act.\n\nFor  the  purposes  of  this  Act,  the  Service  may  separate  its\n\n(2)\noperations into divisions or units.\n\nRole of the Chief Executive Officer\n\n6.\n\nThe Chief Executive Officer shall be responsible for\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nensuring  that  the  decisions  of  the  Board  of  Directors  are\ncarried out;\n\nmanaging  the  assets  and  liabilities  of  the  Service  in\naccordance with the law;\n\nachieving the level of performance required in the Annual\nBudget,  the  Approved  Annual  Plan  and  the  Statement  of\nCorporate Intent;\n\ncollecting  and  receiving  promptly  the  revenues  of  the\nService;\n\ncontrolling, accounting for and reporting in a timely manner\non the revenue and expenditure of the Service;\n\ncontrolling, accounting for and reporting in a timely manner\non the monies and property received by or under the control\nof the Service; and\n\n(g)\n\nensuring  that  the  plans,  budgets  and  reports  required  by\nlegislation are provided.\n\n\f10\n\nRole of the Chief Finance Officer\n\n7.\n\nThe Chief Finance Officer shall be responsible for\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\ndirecting  and  overseeing  all  aspects  of  the  financial  and\naccounting functions of the Service;\n\nproviding timely and accurate analysis of budgets, financial\ntrends and forecasts;\n\ndeveloping, implementing and maintaining a comprehensive\nfinancial management system;\n\nproviding executive management with advice in respect of\nthe financial implications of any proposed investments;\n\nanalysing cash flow, cost control, expenses and all financial\nstatements;\n\nproviding  the  executive  management  and  the  Board  with\nadvice on managing the Fund portfolio of the Service; and\n\n(g)\n\nestablishing systems for budget and internal control.\n\nRole of Chief People Development Officer\n\n8.\nfor\n\nThe Chief People Development Officer shall be responsible\n\n(a)\n\n(b)\n\n(c)\n\npromoting  and  fostering  good  industrial  relations  between\nmanagement,  employees  and\nrepresentatives  of\nemployees and dealing with grievance issues;\n\nthe\n\nmanaging the recruitment and selection of staff processes in\nconjunction with the Board;\n\nkeeping  under  constant  review  the  staffing  needs  of  the\nService including requirements for training;\n\n\f11\n\n(d)\n\ndeveloping  and  monitoring  people  development  strategies,\nsystems and procedures within the Service; and\n\n(e)\n\nmanaging the Service’s performance appraisal system.\n\nRole of Chief Operations Officer\n\n9.\n\nThe Chief Operations Officer shall be responsible for\n\n(a)\n\nmanaging and directing the process of registration\n\n(i)\n\nof persons who are to be registered as insured persons\nunder this Act; and\n\n(ii)\n\nof employers;\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nmanaging and directing the processing of all benefits payable\nto insured persons;\n\noverseeing the business and administrative operations of the\ndivision  responsible  for  benefits  and  keeping  operating\nprocedures under constant review;\n\nevaluating the performance of the division for benefits and\nrecommending strategies to improve results;\n\npreparing  and  submitting  reports  to  the  Chief  Executive\nOfficer on a quarterly basis or as required; and\n\nensuring  compliance  with  this  Act  and  the  Severance\nPayments Act, Cap. 355A.\n\nRole of Chief Investment Officer\n\n10.(1)\n\nThe Chief Investment Officer shall be responsible for\n\n(a)\n\nmanaging  the  investment  functions  of  the  Service  and  its\nfunds;\n\n\f12\n\n(b)\n\n(c)\n\n(d)\n\ninvestment\n\ndeveloping\nrecommendations  on\nconsideration of the Investment Committee and the Board;\n\nand  making\nthe\nfor\n\ninvestment  policies\n\nstrategies\n\npreparing  reports,  analyses  and  strategies  for  the  Chief\nExecutive Office and the Board; and\n\nestablishing processes or systems to ensure that investment\npolicies are followed and are in accordance with the Service’s\nInvestment Policy Statement and Guidelines.\n\nRole of Chief Policy and Planning Officer\n\n11.\nfor\n\nThe Chief Policy and Planning Officer shall be responsible\n\n(a)\n\n(b)\n\n(c)\n\nmanaging\ndevelopment, research and actuarial service functions;\n\nthe  Service’s  corporate  planning,  policy\n\nassisting  with  the  leadership  and  management  of  the\nService’s strategic planning process and the implementation\nof strategies and objectives;\n\nproviding  leadership  in  the  development,  formulation,\nimplementation and monitoring of the Board’s strategic plans\nand policies; and\n\n(d)\n\nmanaging the conduct of periodic actuarial reviews.\n\nRole of Chief Risk Management Officer\n\n11A.\n\nThe Chief Risk Management Officer shall be responsible for\n\n(a)\n\n(b)\n\nmonitoring, evaluating and advising on the elimination and\nmitigation of operational, investment and environmental risk;\n\noverseeing the Service’s risk management including general\nliability and any related insurance coverage;\n\n\f13\n\n(c)\n\n(d)\n\nestablishing a risk management framework and action plan\nfor the Service;\n\ndeveloping an action plan to mitigate, manage or respond to\nrisks; and\n\n(e)\n\nsubmitting quarterly reports to the Board.\n\nRole of Chief Internal Auditor\n\n11B.\n\nThe Chief Internal Auditor shall be responsible for\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\ndeveloping  an  annual  risk-based  Internal  Audit  Plan  in\nconsultation with the Chief Executive Officer and the heads\nof divisions or units of the Service for submission to the Audit\nCommittee for approval;\n\nsubmitting the approved risk-based Internal Audit Plan to the\nBoard for final approval;\n\nperforming  financial,  operational,  compliance  and  systems\naudits in accordance with the Internal Audit Plan;\n\nconducting special investigations as instructed by the Board\nof Directors;\n\nreports  on\n\npreparing\nreviews  conducted  and  make\nrecommendations  for  the  correction  of  any  deficiencies\nidentified;\n\nmaking presentations to the Audit Committee and the Board\nof Directors as required; and\n\nreviewing, monitoring and reporting to the Audit Committee\non the implementation of Board-approved recommendations\narising out of the completed audits.\n\n\f14\n\nRole of Chief Legal Officer\n\n11C.\n\nThe Chief Legal Officer shall be responsible for\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nensuring  compliance  with  this  Act  and  the  Severance\nPayments  Act,  Cap.  355A  and  any  other  enactment  which\napplies to the Service;\n\nadvising  the  Board  as  well  as  any  division  or  unit  of  the\nService on legal matters;\n\nrepresenting  the  Board  and  the  Chief  Executive  Officer  in\nlegal  matters  before  the  Court,  Tribunals  and  the  National\nInsurance Commissioner;\n\ninstituting\ncontributions and other sums due to the Service;\n\nlegal  proceedings\n\nto\n\nrecover  outstanding\n\nproviding  legal  advice  on  matters  pertaining  to  benefits,\nseverance, compliance, audit, fraud, investments, contracts\nand other legal matters as may be required for the purposes\nof the Service;\n\npreparing  and  reviewing  agreements,  contracts,  leases  and\nother legal documents for the Board;\n\nregistering  unpaid  national\n\npreparing  and\ninsurance\ncertificates and ensuring the necessary civil proceedings are\nfiled for debt collection;\n\n(h)\n\npreparing garnishments and memoranda of satisfaction;\n\n(i)\n\n(j)\n\nundertaking legal searches and legal research necessary for\nthe  purposes  of  civil  proceedings  or  the  filing  of  legal\ndocuments;\n\nreviewing legislation and liaising with the Solicitor General\nand the Chief Parliamentary Counsel; and\n\n\f15\n\n(k)\n\nsuch other functions or duties as may be required by the Board\nor the Chief Executive Officer for the purposes of the Service.\n\nRole of Chief Information Technology Officer\n\n11D.\nresponsible for\n\nThe  Chief  Information  Technology  Officer  shall  be\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\ncreating  and  maintaining  necessary  policies  to  ensure  the\nsafety  and  security  of  information  and  data  stored  by  the\nService;\n\nmaintaining  security  of  all  data  and  information  stored  to\nensure the timely processing of benefits and other functions\nof the Service;\n\nmonitoring and maintaining system continuity with respect\nto software licensing and software agreements;\n\nimplementing and maintaining backup and security systems\nto protect data and information stored by the Service;\n\nmonitoring  and  maintaining  the  computer  systems  of  the\nService;\n\nmanaging and maintaining the software, software systems,\ncomputer programmes and other related systems used by the\nService;\n\ndetermining the long-term information technology needs to\nensure proper and efficient functioning for the Service; and\n\nsuch other functions or duties as may be required by the Board\nor the Chief Executive Officer for the purposes of the Service.\n\nOther functions of officers\n\n11E.\nThe officers named in sections 6 to 11D shall, in addition to\nthe functions listed in those sections, perform such other functions and\n\n\f16\n\ncarry  out  such  other  duties  as  may  be  necessary  or  incidental  to  the\nperformance of their duties as may be required by the Board or the Chief\nExecutive Officer for the purposes of the Service.\n\nResponsibilities of officers not prejudiced\n\nThe  responsibilities  stated  in  respect  of  the  officers\n11F.\nmentioned  at  sections  5  to  11D,  are  without  prejudice  to  any  other\ncontractual terms and conditions agreed between the officers and the\nService.\n\nEmployment of public officer and others\n\n11G.(1)\n\nWhere a public officer accepts employment with the Board,\n\n(a)\n\n(b)\n\n(c)\n\nhe shall be employed as a permanent employee on terms and\nconditions that are no less favourable than those on which he\nwas employed before the commencement of this Part;\n\nhe shall, upon accepting employment with the Service, retain\nany right to pension, gratuity or other allowance for which he\nwould  have  been  eligible  had  he  remained  in  the  Public\nService;\n\nhis service in the Public Service before the commencement\nof this Part shall be aggregated with his service in the Board\nfor the purposes of paragraph (d); and\n\n(d)\n\nhis right to pension, gratuity and other allowances shall be\ncalculated in accordance with the Pensions Act, Cap. 25.\n\nWhere a person, other than an officer referred to in subsection\n(2)\n(1), was employed by the former Board accepts employment with the\nBoard,\n\n(a)\n\nhe  shall  be  employed  on  terms  and  conditions  no  less\nfavourable than those on which he was employed before the\ncommencement of this Part;\n\n\f17\n\n(b)\n\n(c)\n\n(d)\n\nhe shall, upon accepting employment with the Board, retain\nany right to pension, gratuity or other allowance for which he\nwas eligible when he was employed by the former Board;\n\nhis service with the former Board before the commencement\nof this Part shall be aggregated with his service with the Board\nfor the purposes of paragraph (d); and\n\nhis  right  to  pension,  gratuity  or  other  allowance  shall  be\ncalculated\nthe  Statutory  Boards\n(Pensions) Act, Cap. 384.\n\nin  accordance  with\n\nPrivate pension plan\n\nThe Board shall, within 2 years of the commencement of this\n11H.\nPart, provide for the establishment of a pension plan for the benefit of\nthe staff of the Service.\n\nAppointment on fixed term contracts\n\nWhere a person is employed by the Service under a written\n11I.\ncontract of employment for a fixed term he shall be entitled to become\na member of the pension scheme within one year of his employment.\n\nPower of Service to invest\n\n11J.(1)\nFund and the Unemployment Benefit Account\n\nThe Board may invest moneys standing to the credit of the\n\n(a)\n\nin such proportions as the Board approves, having regard to\nthe  several  contingencies  in  relation  to  which  benefits  are\nprovided under this Act; and\n\n(b)\n\nin such manner or securities as are deemed appropriate.\n\nIn  determining  the  types  of  securities  that  are  appropriate  for\n(2)\ninvestment, the investment committee shall, inter alia, have regard to\nthe investment policy statement and guidelines.\n\n\f18\n\n(3)\nNotwithstanding subsections (1) and (2), the Board may, after\nconsultation  with  the  Minister  responsible  for  Finance,  invest  any\nmoneys  forming  part  of  the  Fund  in  such  manner  and  in  such\ninvestments as the Minister may direct.\n\nBorrowing powers of the Service\n\nThe  Board  may,  with  the  approval  of  the  Minister\n11K.\nresponsible for Finance, borrow any money it requires for meeting any\nof its obligations or performing any of its functions and shall, in such\na case, inform the Minister of\n\n(a)\n\n(b)\n\nthe amount and sources of the loan;\n\nthe terms and conditions on which the loan may be obtained;\nand\n\n(c)\n\nthe solvency of the fund.\n\nGuarantee of loans\n\n11L.\nThe Government may, with the approval of Parliament, in\nsuch manner and on such terms and conditions as may be specified,\nguarantee a loan to the Board together with any interest or other charges\npayable.\n\nEstablishment of Board\n\n11M.(1)\nis established.\n\nThe National Insurance and Social Security Service Board\n\nSchedule  III  has  effect  with  respect  to  the  constitution  of  the\n\n(2)\nBoard and otherwise in relation thereto.\n\n(3)\n\nThe members of the Board shall be known as “directors”.\n\n\f19\n\nResponsibility of Board\n\n11N.(1)\nthe organization and administration of the Service and, in particular,\n\nThe Board is responsible for the formulation of policy and\n\n(a)\n\nthe appointment of staff to the Service and the management\nof such staff;\n\n(b)\n\nthe management of the resources and contracts of the Service;\n\n(c)\n\n(d)\n\nthe prudent and efficient management of the Service; and\n\nmonitoring the performance of the Service with respect to the\ndischarge of its functions.\n\nThe Board shall develop a funding policy for the Service and the\n(2)\nMinister shall cause a copy of the policy to be laid on the table of both\nHouses.\n\nIf  the  Board  proposes  to  amend  the  policy  referred  to  in\n(3)\nsubsection (2), the Minister shall lay the proposed amendment on the\ntable of both Houses of Parliament.\n\nThe  Minister  shall  respond  to  the  funding  policy  or  proposed\n(4)\namendment  within  6  weeks  of  the  date  after  it  has  been  laid  in\nParliament.\n\nDelegation of functions\n\n11O.(1)\nThe Board may delegate such of its functions as it thinks\nexpedient for the purpose of effectively transacting the business of the\nBoard to the chairman, a committee of the Board or the Chief Executive\nOfficer.\n\n(2)\n\nThe delegation of a function pursuant to subsection (1)\n\n(a)\n\ndoes not prevent the Board from discharging that function;\nand\n\n\f20\n\n(b)\n\nmay at any time be revoked by the Board.\n\nPower of the Board to acquire real property\n\n11P.\nThe Board has the right to acquire and hold any real property\nfor the purposes for which the Board is constituted, and subject to the\napproval of the Minister, to charge, whether by mortgage, debenture or\notherwise and to dispose of such property.\n\nProtection of the Board and its members\n\n11Q.(1)\nquestioned on the ground\n\nNo act done or proceedings taken under this Act shall be\n\n(a)\n\n(b)\n\nof the existence of any vacancy in the membership of, or any\ndefect in the constitution of, the Board; or\n\nof any omission, defect or irregularity not affecting the merits\nof the case.\n\nNo action, suit, prosecution or other proceedings shall be brought\n(2)\nor instituted personally against any member in respect of any act done\nbona fide in pursuance of or execution or intended execution of this\nAct.\n\nRole of Secretary\n\n11R.\nresponsible for\n\nThere  shall  be  a  secretary  to  the  Board  who  shall  be\n\n(a)\n\n(b)\n\n(c)\n\nensuring  that  all  necessary  arrangements  preparatory  to\nmeetings of the directors or committees are made;\n\ntaking the minutes and recording the decisions of meetings\nof the directors;\n\nthe safe custody and control of all documentation relating to\nthe directors or committees; and\n\n\f21\n\n(d)\n\nensuring  that  the  Board  acts  in  compliance  with  the\nrequirements of the legislation relating to the Service.\n\nPower to appoint committees\n\n11S.(1)\n\nSubject to this Act, and the regulations, the Board\n\n(a)\n\nshall appoint the following standing committees:\n\n(i)\n\na people development committee;\n\n(ii)\n\nan information technology committee;\n\n(iii)\n\nan operations committee;\n\n(iv)\n\na tenders committee; and\n\n(v)\n\na risk and data management committee; and\n\n(b)\n\nmay appoint such other committee as the Board thinks fit.\n\nA committee appointed by the Board shall comprise not less than\n\n(2)\n2 members.\n\nWhere a committee, appointed under subsection (1)(b) performs\n\n(3)\na function, it is deemed to have been performed by the Board.\n\nWhere the Board appoints a committee pursuant to subsection\n(4)\n(1)(b)  the  committee  shall,  on  completion  of  the  function,  submit  a\nreport in writing as soon as practicable to the Board.\n\nSubject  to  this  Act  and  the  regulations,  the  constitution  and\n\n(5)\nfunctions of a committee shall be determined by the Board.\n\nAudit Committee\n\n11T.(1)\n\nThere shall be an Audit Committee of the Service.\n\nThe Audit Committee shall comprise 3 members from among the\n\n(2)\nDirectors.\n\n\f22\n\nAt  least  one  member  of  the  Audit  Committee  shall  be  an\n\n(3)\naccounting or audit expert.\n\nThe  responsibilities  of  the  Audit  Committee  shall  include  the\n\n(4)\nfollowing:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe evaluation of the overall effectiveness of internal control\nsystems of the Service;\n\nthe  oversight  of  the  financial  statements  and  the  financial\nreporting processes;\n\nmaking  recommendations  to  the  Board  with  respect  to  the\nexternal auditor selection and rotation policy;\n\nproposing to the Service the scope of any special audits and\nother relevant services;\n\n(e)\n\nreviewing the performance of external auditors;\n\n(f)\n\nmonitoring the implementation of recommendations made by\nthe Chief Internal Auditor and the external auditors;\n\n(g)\n\nreporting to the Board not less than 4 times a year.\n\nInvestment Committee\n\n11U.(1)\ncomprise\n\nThere  shall  be  an  Investment  Committee  which  shall\n\n(a)\n\n(b)\n\n(c)\n\nthe Chairman of the Board;\n\nthe Deputy Chairman of the Board;\n\nthe Chief Executive Officer;\n\n(d)\n\nthe Chief Financial Officer;\n\n(e)\n\nthe Chief Investment Officer;\n\n(f)\n\ntwo  directors  of  whom  one  represents  employers  and  the\nother represents trade unions;\n\n\f23\n\n(g)\n\n(h)\n\na  Director  from  the  Central  Bank  of  Barbados  with\nresponsibility for investments; and\n\ntwo  other  persons,  not  being  directors,  appointed  by  the\nMinister from among persons with necessary qualifications\nin investment matters, finance and accounting.\n\n(2)\n\nThe functions of the Investment Committee are to\n\n(a)\n\n(b)\n\n(c)\n\nadvise the Board on investment policy;\n\nto monitor the implementation of investment decisions; and\n\nto  perform  such  other  duties  as  may  be  delegated  by  the\nBoard.\n\n(3)\n\nThe Investment Committee shall regulate its own procedure.\n\nIn  the  absence  of  the  Chairman,  the  Deputy  Chairman  shall\n\n(4)\npreside.\n\n(5)\n\nSix members shall constitute a quorum.\n\nExercise of powers of directors\n\n11V.(1)\n\nEvery director shall in exercising his duties\n\n(a)\n\n(b)\n\nact honestly and in good faith with a view to the best interests\nof the Fund; and\n\nexercise the care, diligence and skill that a reasonably prudent\nperson would exercise in comparable circumstances.\n\nIn determining the best interests of the Fund, a director must have\n(2)\nregard to the interest of the Fund as well as the interests of the employees\nin general.\n\nConflict of interest\n\n11W.(1)\nA director who is in any way directly or indirectly interested\nin a contract or proposed contract with the Board or any other matter\n\n\f24\n\nwhatsoever in which the Board is concerned, shall declare the nature\nand extent of his interest at the first meeting of the Board at which it is\npracticable for him to do so.\n\nA director shall not take part in any deliberation or decision of\n(2)\nthe Board with respect to any contract or proposed contract with the\nBoard or any other matter with which the Board is concerned, in which\nhe has any pecuniary interest, whether directly or indirectly.\n\nFor  the  purposes  of  this  section,  a  director  shall  be  treated  as\n(3)\nhaving an indirect interest in a contract or proposed contract with the\nBoard or in any other matter with which the Board is concerned, if he\nis\n\n(a)\n\n(b)\n\n(c)\n\na director;\n\na shareholder;\n\na partner; or\n\n(d)\n\nan employee,\n\nof a company or other association of persons that is a party to such other\nmatter with which the Board is concerned.\n\nA director mentioned in subsection (1), (2) and (3) shall not vote\n(4)\non the contract or proposed contract or any other matter connected to\nthat with which the Board is concerned.\n\nA director or any employee of the Service shall not accept a gift\n(5)\nor an advantage for himself or on behalf of persons with whom they\nhave family, business or financial connections, if the acceptance would\nresult or give the appearance of resulting in a diminution of his impartial\nperformance of duties.\n\nWhere a person to whom this section applies contravenes this\n(6)\nsection,  he  is  guilty  of  an  offence  and  is  liable  on  conviction  on\nindictment to a fine of $50 000 or imprisonment for 3 years or to both.\n\n\f25\n\nActuarial reviews\n\n11X.(1)\nFor  the  purposes  of  assessing  the  balance  between  the\ncontributions and rates of benefits, an actuarial review of the system of\nnational insurance shall be undertaken within 3 years after the 31st day\nof  December,  2023  and  thereafter,  during  the  period  ending  on  the\n31st day of December in every third year or such shorter period as the\nBoard determines; and a report of every such actuarial review shall be\nforwarded to the Minister.\n\nIn addition to the actuarial review referred to in subsection (1)\n(2)\nthe Minister may require an actuarial review to be undertaken at any\ntime.\n\nThe Board shall send a copy of every actuarial review to the clerk\n\n(3)\nof Parliament to be laid on the table of both Houses.\n\nReport and accounts to be submitted to Minister\n\n11Y.(1)\n\nThe Board shall\n\n(a)\n\n(b)\n\n(c)\n\nin  each  year,  prepare  a  report  on  its  activities  in  the  last\npreceding year and shall furnish such report to the Minister\nnot later than the 30th day of June;\n\nsubmit to the Minister every account certified by the Auditor-\nGeneral thereon, within one month of such certification; and\n\nsubmit annually to the Minister, an account of the securities\nin which moneys forming part of the Fund are for the time\nbeing invested.\n\nThe  Minister  shall  cause  a  copy  of  every  report  of  account\n(2)\nsubmitted to him pursuant to this section to be laid on the table of both\nHouses.\n\n\f26\n\nMinister may give directions\n\n11Z.(1)\nThe Minister may give general directions to the Board with\nrespect to the performance of its functions, powers and duties under this\nAct or any other enactment; and the Board shall act in accordance with\nthose directions.\n\nSubject  to  this  section,  the  Board  shall  not  be  subject  to  the\n\n(2)\ncontrol or direction of any other person or Service.\n\nApplication of Public Finance Management Act, 2019\n(2019-1)\n\nThe  Public Finance Management Act, 2019 (Act 2019-1)\n11AA.\napplies  to  this  Act  with  such  modifications  and  adaptations  as\ncircumstances require.\n\nVesting of assets\n\n11BB.\nformer Act are\n\nAll assets vested in or held by the former Board under the\n\n(a)\n\n(b)\n\ntransferred to and vested in the Board and shall be managed\nand administered by the Board for the purpose of this Act;\nand\n\nby virtue of this Act and without further assurance, transfer\nor other formality, with effect from the commencement of\nthis  section,  to  be  held  by  the  Service  for  same  estate  and\ninterest and to the same extent and in the same manner as the\nassets  were  vested  in,  or  held  by,  the  said  former  Board\nimmediately before the commencement of this section.\n\nLiabilities and proceedings\n\n11CC.(1)\nAll liabilities incurred by or on behalf of the former Board\nimmediately before the commencement of this Part have, from such\n\n\f27\n\ncommencement, effect as if they had been incurred by or on behalf of\nthe Service.\n\n(2)\n\nWithout affecting subsection (1),\n\n(a)\n\nall sums\n\n(i)\n\n(ii)\n\nstanding immediately before the commencement of this\nPart to the credit of the former Board are from that day\ntransferred to and vested in the Service; and\n\nheld  by  an  employer  pursuant  to  section  18  as\ncontributions  deducted  from  an  employed  persons\nwages  or  remunerations  are,  with  effect  from  the\ncommencement of this Part, due to the Service and shall\nbe dealt with in accordance with the provisions of that\nsection as moneys due to the Service; and\n\n(b)\n\nany contract made by or on behalf of the former Board before\nthe commencement of this Part shall be deemed to have been\nmade by or on behalf of the Service and shall be construed\nwith  such  modifications  and  adaptations  as  circumstances\nrequire for the purposes of this section.\n\nAll unpaid national insurance certificates filed on behalf of the\n(3)\nformer Board before the commencement of this Part shall be deemed\nto have been filed by or on behalf of the Service.\n\nAll civil proceedings commenced before the commencement of\n(4)\nthis Part in any court in Barbados by or against the former Board may\nbe continued by or against the Service, and process in those proceedings\nmay be amended accordingly.\n\nTransfer of functions\n\nAll  registrations,  decisions,  acts,  duties,  payments  or\n11DD.\nfunctions formerly discharged by the National Insurance Department\nfor and on behalf of the former Board before the commencement of this\n\n\f28\n\nPart are, from the commencement of this Part to be discharged by the\nService.\n\nInterpretation\n\n11EE.\nFor the purposes of sections 11BB, 11CC and 11DD “former\nBoard” means the Board in existence on the day immediately preceding\nthe commencement of this Part.”.\n\nAmendment of section 12 of Cap. 47\n\n4.\n\nSection 12 of the principal Act is amended\n\n(a)\n\nby deleting the shoulder note and substituting the following:\n\n“Insurance of persons employed in respect of benefits under\nsection 21(1) ”;\n\n(b)\n\ndeleting subsection (1) and substituting the following:\n\n“(1)\nSubject to this Act, every person who, being over the age of 16\nyears and under pensionable age, is gainfully occupied in employment\nin Barbados, under a contract of service or a contract for services, shall\nbe  insured  under  this  Act  in  respect  of  the  several  contingencies  in\nrelation to which benefits are provided under subsection (1) of section\n21; and there shall be payable to or in respect of any such person, in the\nprescribed  circumstances,  any  benefit  payable  by  virtue  of  the  said\nsubsection.”; and\n\n(c)\n\ndeleting  the  word  “Crown”  where  it  appears  and  substituting  the\nword “State”.\n\n\f29\n\nAmendment of section 21 of Cap. 47\n\n5.\nafter subsection (1D) the following:\n\nSection 21 of the principal Act is amended by inserting immediately\n\n“(1E)\nAll self-employed persons shall from such day as the Board may\nfix by order be insured pursuant to section 14 for personal injury arising\nout of and in the course of employment.”.\n\nInsertion of section 25B into Cap. 47\n\n6.\n25A the following:\n\nThe principal Act is amended by inserting immediately after section\n\n“Cost of living increase in contributory pension\n\n25B.(1)\n\nThe Board shall by order increase all contributory pensions\n\n(a)\n\n(b)\n\nby 3 per cent per annum for the year 2023; and\n\nsubject to subsection (2), by such amount, not exceeding 1.5\nper cent per annum for every succeeding year.\n\n(2)\nIf the average rate of price inflation exceeds 3 per cent per annum\nthe actuary shall advise the Board on the appropriate rate of increase.\n\nThe  Board  shall  publish  the  rate  of  increase  in  2  newspapers\n\n(3)\npublished and circulated in Barbados.”.\n\nAmendment of Cap. 47\n\nThe principal Act is amended in Parts II to VI by deleting the words\n7.\n“Director”  and  “Director,  National  Insurance”  and  substituting  the  words\n“Chief Executive Officer”.\n\n\f30\n\nAmendment of section 30 of Cap. 47\n\n8.\n(5).\n\nSection 30 of the principal Act is amended by deleting subsection\n\nAmendment of section 30A of Cap. 47\n\n9.\n(1) and (2) and substituting the following:\n\nSection 30A of the principal Act is amended by deleting subsections\n\nThe Unemployment Benefit Account established on 1st January,\n“(1)\n1997 and referred to as “the Account” shall be under the management\nand control of the Service.\n\n(2)\n\nThe Unemployment Benefit Account shall comprise\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nsuch sums as may be paid in respect of every employer and\nevery insured person as a contribution at such rate as may be\nprescribed by regulations;\n\nany sums earned by the Board from the use or investment of\nthe assets of the Unemployment Benefit Account;\n\nsuch money as may be voted by Parliament for the purposes\nof the Unemployment Benefit Account; and\n\nsuch sums as were held by the former Board in the former\nUnemployed Benefit Account; and\n\nsuch other moneys as may be granted or may become payable\nto the Service for the purposes of the Unemployment Benefit\nAccount.”.\n\nRepeal of section 33 of Cap. 47\n\n10.\n\nSection 33 of the principal Act is repealed.\n\n\f31\n\nAmendment of Schedule I to Cap. 47\n\n11.\nparagraph 1 the following as paragraph 1A:\n\nPart  I  of  Schedule  I  is  amended  by  inserting  immediately  after\n\n“1A.\nservice whether written or oral and whether express or implied.”.\n\nEmployment of a self-employed person under a contract for\n\nAmendment of Cap. 47\n\n12.\n\nThe principal Act is amended by\n\n(a)\n\n(b)\n\ndeleting Schedule II and substituting the Schedule set out in the First\nSchedule to this Act; and\n\ninserting as Schedule III the Schedule set out in the Second Schedule\nto this Act.\n\nConsequential amendments\n\n13.\nin the manner set out opposite thereto in Column 2.\n\nThe enactments set out in Column 1 of the Third Schedule are amended\n\nRepeal of Act 2023-18\n\n14.\n(Act 2023-18) is repealed.\n\nThe National Insurance and Social Security (Amendment) Act, 2023\n\nCommencement\n\n15.\n\nThis Act shall come into operation on the 1st day of December, 2023.\n\n\f32\n\nFIRST SCHEDULE\n\nPENSIONABLE AGE\n\n“SCHEDULE II\n\nPENSIONABLE AGE\n\nPeriod\n\nFrom 1st January 2003 to 31st December, 2005\nFrom 1st January 2006 to 31st December, 2009\nFrom 1st January 2010 to 31st December, 2013\nFrom 1st January 2014 to 31st December, 2017\nFrom 1st January 2018 to 31st December, 2027\nFrom 1st January 2028 to 31st December, 2033\nFrom 1st January 2034 and thereafter\n\n(Section 12(a))\n\n(Section 2)\n\nAge\n65\n\n65½\n\n66\n\n66½\n\n67\n\n67½\n\n68\n\n”.\n\n\f33\n\nSECOND SCHEDULE\n\nNATIONAL INSURANCE AND SOCIAL SECURITY SERVICE BOARD\n\n(Section 12(b))\n\n“SCHEDULE III\n\n(Section 11M)\n\nNATIONAL INSURANCE AND SOCIAL SECURITY SERVICE\nBOARD\n\nAppointment of directors\n\n1.(1)\n\nThe Board shall comprise 9 directors as follows:\n\n(a)\n\nthe  Permanent  Secretary  in  the  Ministry  responsible  for\nSocial Security, ex officio;\n\n(b)\n\nthe Director of Finance and Economic Affairs, ex officio; and\n\n(c)\n\nseven  other  persons  appointed  by  the  Minister  with  the\napproval of the cabinet as follows:\n\n(i)\n\n(ii)\n\n(iii)\n\n2  persons  on  the  recommendation  of  the  employers\norganisations;\n\n2  persons  on\norganisations; and\n\nthe  recommendation  of  workers\n\n3  persons  who  possess  expertise  or  at  least  10  years\nexperience in law, finance, accountancy, management,\npensions,\ncorporate\ninvestments or other skills appropriate to social security\nmatters.\n\ngovernance,\n\neconomics,\n\n\f34\n\nA director, other than an ex officio director, shall, subject to the\n\n(2)\nprovisions of this Schedule\n\n(a)\n\n(b)\n\nhold office for a term not exceeding 3 years; and\n\nis eligible for reappointment.\n\nThe Minister shall, pursuant to subparagraph (2), determine the\n(3)\nterm of office of a director in such a manner that in any one year the\nrespective terms of office of no more than 3 directors expire.\n\nRemuneration of directors\n\n2.\n\nThe Minister may pay to\n\n(a)\n\n(b)\n\neach director, in respect of his office such remuneration and\nallowances; and\n\nthe Chairman and Deputy Chairman such remuneration and\nallowances,\n\nin  addition  to  any  remuneration  or  allowances  to  which  he  may  be\nentitled in respect of his office as a director, as the Minister determines.\n\nChairman and Deputy Chairman\n\n3.(1)\nanother to be Deputy Chairman, of the Board.\n\nThe Minister may appoint a director to be Chairman, and\n\nThe  Chairman  must  be  a  person  who  has  at  least  10  years\n(2)\nexperience  in  law,  finance,  accountancy,  management,  corporate\ngovernance, economics, pensions or other skills appropriate to social\nsecurity matters.\n\nAffixing seal and authentication of documents\n\n4.(1)\nThe  seal  of  the  Service  shall  be  kept  in  custody  of  the\nChairman  or  the  Deputy  Chairman  or  the  person  performing  the\nfunctions of the secretary to the Board.\n\n\f35\n\n(2)\nThe  seal  may  be  affixed  to  such  contracts,  agreements,\ninstruments  in  writing  and  such  other  documents  as  the  Board\ndetermines\n\n(3)\nAll documents in subparagraph (2) made by the Board, shall be\nsignified under the hand of the Chairman or the Deputy Chairman, in\ncase of the absence of the Chairman, as the case may be, and by at least\none other director of the Board.\n\nAll  documents  or  instruments  made  by  the  Board,  other  than\n(4)\nthose required by law to be under seal, and all decisions of the Board\nshall  be  signified  under  the  hand  of  the  Chairman  or  the  Deputy\nChairman and by at least one other director of the Board.\n\nResignation\n\n5.(1)\naddressed to the Minister.\n\nThe Chairman may resign his office by instrument in writing\n\nA  director,  other  than  the  Chairman,  may  resign  his  office  by\n(2)\ninstrument in writing addressed to the Chairman, who shall forward\nforthwith the instrument to the Minister.\n\nA resignation takes effect from the date on which the Minister\n\n(3)\nreceives the instrument.\n\nTemporary leave of absence\n\n6.\ndirector.\n\nThe  Minister  may  in  writing  grant  leave  of  absence  to  a\n\nTemporary appointment\n\n7.\nWhere a director is, or is likely to be, unable to perform the\nfunctions of his office for more than 30 days, whether as a result of\nabsence from Barbados, illness or other cause, the Minister may appoint\na person to act in the place of the director.\n\n\f36\n\nRevocation of appointment\n\n8.\n\nThe Minister shall revoke the appointment of a director who\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nbecomes of unsound mind or becomes permanently unable\nto perform his functions by reason of ill health;\n\nis convicted of an offence involving fraud or dishonesty or,\nin the case of any other offence, is sentenced to a term of\nimprisonment;\n\nis guilty of serious misconduct in relation to his functions;\n\nis bankrupt or compounds with or suspends payment to his\ncreditors; or\n\nfails to declare his interest in a matter before the Board as\nrequired by section 11W(1).\n\nVacancies\n\n9.(1)\n\nA vacancy in the membership of the Board arises on\n\n(a)\n\n(b)\n\n(c)\n\nthe death or resignation of a director;\n\nthe revocation of the appointment of a director; or\n\nthe absence of a director from 4 consecutive meetings of the\nBoard without the approval of the Minister.\n\nA  person  who  is  appointed  to  fill  a  vacancy  referred  to  in\n(2)\nsubparagraph (1) shall hold office only for the unexpired portion of the\nterm of the former director concerned.\n\n\f37\n\nDisqualification of director\n\n10.\n\nA person who\n\n(a)\n\nother than a person specified in paragraphs 1(1)(a) and (b),\nis a public officer within the meaning of the Public Service\nAct, Cap. 29; or\n\n(b)\n\nwhere he is a director, would have to be removed from office\npursuant to paragraph 8,\n\nis not eligible to be a director.\n\nGazetting of appointments\n\n11.\nof a director shall be notified in the Official Gazette.\n\nThe appointment, resignation, removal from office or death\n\nCommittees\n\n12.(1)\npersons to assist it with the proper discharge of its functions.\n\nThe Board may appoint committees of its members or other\n\nWhere a person who is not a member of the Board is appointed\n(2)\nto  a  committee,  the  Board  may,  with  the  approval  of  the  Minister,\ndetermine the remuneration and allowances to be paid to the person.\n\nMeetings\n\n13.(1)\nThe  Board  shall  meet  as  often  as  may  be  necessary  or\nexpedient for the transaction of its business and such meeting shall be\nheld  at  such  places  and  times  and  on  such  days  as  the  Board  may\ndetermine.\n\nThe Chairman, or in the event of his absence from Barbados or\n(2)\ninability to act as such, the Deputy Chairman, may at any time call a\nspecial meeting of the Board and shall call such meeting within 7 days\n\n\f38\n\nof the receipt by him of a request for the purpose addressed to him in\nwriting and signed by not less than 3 directors.\n\nThe  Chairman,  or  in  his  absence,  the  Deputy  Chairman,  shall\n\n(3)\npreside at meetings of the Board.\n\nWhere the Chairman and the Deputy Chairman are absent from\n(4)\na meeting, the directors present shall elect a director from among their\nnumber to preside at the meeting.\n\n(5)\n\nSix directors shall constitute a quorum.\n\nThe decisions of the Board shall be by a majority of votes and in\n(6)\na case where the voting is equal, the Chairman or other person presiding\nat  the  meeting  shall,  in  addition  to  an  original  vote,  have  a  casting\nvote.\n\nMinutes of each meeting shall be kept by the person performing\n(7)\nthe functions of secretary of the Board or by such other officers as the\nBoard appoints for the purpose and shall be confirmed by the Board\nand signed by the Chairman or Deputy Chairman at the next meeting\nof the Board.\n\nAttendance of non-members at meetings\n\n14.(1)\nThe Board may invite any person to attend any particular\nmeeting of the Board for the purpose of assisting or advising the Board\nin any matter with which the Board is dealing, but a person so invited\ndoes not have a right to vote.\n\nWhere any person is invited under paragraph (1), the Board may\n(2)\nbe  resolution  of  the  Board  determine  and  pay  to  such  person  such\nremuneration  and  allowances  as  are  suitable  and  such  sums  shall\nproperly be payable out of the Fund.\n\n\f39\n\nBoard may regulate proceedings\n\n15.\nregulate its own procedure. ”.\n\nSubject  to  provisions  of  this  Schedule,  the  Board  may\n\n\f40\n\nL.R.O. 1998Column 1Enactments1.Public Finance ManagementAct, 2019 (Act 2019-1)2.National Insuranceand Social Security(Self-employed Persons)Regulations, 1970 (S.I.1971 No. 1)Column 2AmendmentsIn the Second Schedule delete, \"National Insurance Department\"and insert \"National Insurance and Social Security Service\".1.Delete regulation 4 and substitute the following:  \"Amount of contribution payable by self-employed person4.(1)  Every self-employed person shall pay atleast $1 200 as contributions per contribution year.(2)The Service shall deduct from the contributionreferred to in paragraph (1) the contributions that arerequired to be deducted under the Act or any otherenactment.(3)Every self-employed person shall pay thecontribution due on the 31st day of December in acontribution year no later than the 15th day of Januaryin the succeeding year.(4)Where the contributions paid by a self-employedperson in any contribution year exceeds the maximumcontributions payable in that year the excess contributionsshall be credited to the succeeding year;  and the Serviceshall notify the self-employed person accordingly.THIRD SCHEDULE(Section 14)CONSEQUENTIAL AMENDMENTS\f41\n\n L.R.O. 1998Column 1Enactments2. National Insurance and Social Security(Self-employed Persons) Regulations, 1970 (S.I. 1971 No. 1) - (Cont'd)Column 2Amendments  Payment of contributions4A.(1)    A self-employed person may elect to paycontributions due for a contribution year (a) in full by a single payment; or (b) by instalments.  (2)   A self-employed person may pay his contributions(a) at the oﬃ  ce of the National Insurance and Social Security Service in person; or (b) by electronic means.  (3)  Notwithstanding regulation 4(1), a self-employed person may elect to pay his contribution at anytime in the contribution year.  Beneﬁ ts for the self-employed4B.    Pursuant to sections 14 and 21 of the Act,where applicable, a self-employed person is entitled to bepaid the beneﬁ ts speciﬁ ed therein, except the beneﬁ tspeciﬁ ed in section 21(1)(h).Third Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f42\n\n L.R.O. 1998Column 1Enactments2. National Insurance and Social Security(Self-employed Persons) Regulations, 1970 (S.I. 1971 No. 1) - (Cont'd)Column 2Amendments  Annual statement of contributions and benefit eligibility4C.(1)    The Service shall before the 31st  day ofDecember in the succeeding year give to every self-employed person a statement for the end of thecontribution year and that statement may be sent bymail or by such electronic means as the Servicemay determine.  (2)    The statement referred to in paragraph (1) shall show(a) the contributions paid by the self-employed person;(b) the amount paid for the preceding contributionyear; (c) the number of registered contribution weeks credited for that payment;(d) the number of credits; and (e) such other information as the Board determines.  Additional payments into the Fund4D.(1)  Notwithstanding regulation 4A(3), a self-employed person may elect to pay additional sums intothe National Insurance Fund for years for which he didnot pay contributions at any time before that personattains the age at which he qualiﬁ es for voluntary pension.Third Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f43\n\n L.R.O. 1998Column 1Enactments2. National Insurance and Social Security(Self-employed Persons) Regulations, 1970 (S.I. 1971 No. 1) - (Concl'd)3. National Insurance and Social Security(Employment Injury) (Prescribed Diseases)Regulations, 1971 (S.I. 1971 No. 77) 4. National Insurance andSocial Security(Employment InjuryInsurable & ExceptedEmployments)  Regulations,1971 (S.I. 1971 No. 79)Column 2Amendments  (2)  Where contributions made pursuant toparagraph (1) in respect of any year prior to 2023,that person shall submit a contribution Schedulein accordance with the National Insurance and Social Security (Collection of  Contributions)Regulations, 1967 (L.N. 48/1967)  (3)    A self-employed person may from the commencement of regulations 4 to 4D, pay into the Fund for a maximum period of 3 contribution years during which he failed to pay contributions, and the Service shall apply a surcharge of 5 per cent for each  such year.\".2.  Delete regulation 6  and substitute the following: \"6. A self-employed person shall furnish to theBoard such information and evidence relating tohis income as the Board may require for the purposesof the Board, which may include a Notice of Assessmentfrom the Barbados Revenue Authority.\". 3.  Delete regulations 7, 8 and 9.4.  Delete the First Schedule.In regulation 2, delete the deﬁ nition of \"insurable employment\"and substitute the following: \"insurable employment” means employment pursuant  to sections 13 and 14(2) of the Act;\".In the First Schedule, insert the following immediately afterparagraph 1:  \"1A. Employment of a self-employed person under  a contract for service whether written or oral and  whether express or implied.\".Third Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f44\n\n L.R.O. 1998Column 1Enactments5. National Insuranceand Social Security(Employment Injury Claims and Payments) Regulations, 1984 (S.I. 1984 No. 149)Column 2AmendmentsInsert the following immediately after regulation 6:    Claim for injury beneﬁ t by self-employed person\"6A.(1) A claim for injury beneﬁ t by a self-employedperson shall include(a) a personal report of the cause  of the injury;(b) a report or a letter from a registered medical practitioner;(c) an eye witness report, if the incident was witnessed by another person and the contactinformation of the witness;(d) a copy of the contract for service relating to thetask, job, service or undertaking in which theinjury occurred;(e) a copy of the police report of the incident,where applicable;(f) a photograph or video of the incident and of the injury suﬀ ered by the self-employed person; and(g) any other information the Board may require.\".Third Schedule - (Concl'd)CONSEQUENTIAL AMENDMENTS - (Concl'd)\f45\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2023.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2023.\n\nPresident\n\n"
}