{
  "bill_id": 739,
  "slug": "resolution-re-physical-development-plan-amendment",
  "title": "Resolution Re Physical Development Plan Amendment",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/813a4e2bf75fcc86b4fcd5597ee87fcc.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-12-13",
  "first_reading": "2023-11-21",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\nPARLIAMENT\n\nWHEREAS it is provided by section 16(7) of the Planning and Development Act 2019, that\n\nthe  Director  of  Planning  and  Development  shall  submit  for  the  approval  of  the  Minister  a\n\ndevelopment plan for the Island;\n\nAND WHEREAS a development plan called the Barbados Physical Development Plan was\n\nsubmitted to the Minister on 8th day of July, 1970 and in accordance with section 10(2) of the\n\nTown and Country Planning Act, Cap. 240, came into operation on the 15th day of March, 1977;\n\nAND WHEREAS in accordance with section 11 of the Town and Country Planning Act,\n\nCap. 240 proposals for alterations to the Barbados Physical Development Plan were submitted to\n\nthe Minister on 7th day of February, 1985 and in accordance with section 10(2) of the Town and\n\nCountry Planning Act Cap. 240, the amendments to the development plan came into operation 1st\n\nAugust, 1991;\n\nAND WHEREAS in accordance with section 11 of the Town and Country Planning Act,\n\nCap. 240, proposals for alterations to the Barbados Physical Development Plan were submitted to\n\nthe Minister on the 30th day of April, 1998 and the 29th day of January, 2003 respectively and in\n\naccordance with section 10(2) of the Town and Country Planning Act Cap. 240, the amendments\n\n# to the development plan came into operation 15th April, 2008;\n\nAND WHEREAS in accordance with section 16(3) of the Planning and Development Act,\n\n2019, certain objections and representations with respect to the Barbados Physical Development\n\nPlan were made in writing to the Director of Planning and Development who, in accordance with\n\nthat section, prepared a report to the Minister;\n\nAND WHEREAS in accordance with section 16(5) of the Planning and Development Act,\n\n2019 the Minister appointed the Chairman Mr. Kenneth Atherley to hold separate public enquiries\n\ninto those objections and representations;\n\n\f2\n\nAND WHEREAS certain amendments which were proposed by the Minister under section\n\n# 16 of the Planning and Development  Act, 2019 have been  approved  by the Cabinet on the 19th\n\nOctober, 2023;\n\nAND WHEREAS it is provided by section 16(7) of the Planning and Development Act,\n\n2019  that  the  amendments  to  a  development  plan  shall  be  submitted  for  the  approval  of  both\n\nHouses;\n\nBE IT RESOLVED therefore that the House of Assembly and the Senate approve the\n\nBarbados Physical Development Plan as amended in 2023 and prior plans rescinded.\n\nAPPROVED by the House of Assembly this\n\nday of                                       2023.\n\nSpeaker\n\nAPPROVED by the Senate this                day of                                      2023.\n\nPresident\n\n"
}