{
  "bill_id": 73,
  "slug": "national-registration-bill-2015",
  "title": "National Registration Bill, 2015",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/1fae30050993697eb306a04b635480ea.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2015-02-03",
  "first_reading": "2015-02-10",
  "second_reading": null,
  "gazette_date": "2015-02-23",
  "passed_date": null,
  "markdown": "Explanatory Memo at page 18\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the Electoral and Boundaries Commission to\n\n(a)\n\ncompile a database to be known as the National Register in order to\nprovide for the registration of\n\n(i)\n\ncitizens of Barbados; and\n\n(ii)\n\npersons who are not citizens of Barbados but who are resident in\nBarbados, for a period of 6 months or more;\n\n(b)\n\nissue new identification cards with new national registration numbers\nto each person registered in the National Register; and\n\n(c)\n\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nNational Register\n\nPersons to be registered in the National Register\n\nRegistration of persons\n\nDuties of Chief Registering Officer\n\nIssuance of identification cards\n\nUse of an identification card\n\nDuty of non-disclosure\n\n10.\n\nPower to inspect and re-issue an identification card\n\n11.\n\nPower to waive fees\n\n12.\n\nConsolidated Fund\n\n13.\n\nOffences\n\n14.\n\nRegulations\n\n15.\n\nSavings and Transitional provision\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the Electoral and Boundaries Commission to\n\n(a)\n\ncompile a database to be known as the National Register in order to\nprovide for the registration of\n\n(i)\n\ncitizens of Barbados; and\n\n(ii)\n\npersons who are not citizens of Barbados but who are resident in\nBarbados, for a period of 6 months or more;\n\n\f4\n\n(b)\n\nissue new identification cards with new national registration numbers\nto each person registered in the National Register; and\n\n(c)\n\nprovide for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the National Registration Act, 2015.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Chief Registering Officer” has the meaning assigned to it by section 2 of the\n\nRepresentation of the People Act, Cap. 12;\n\n“child” includes an adopted child;\n\n“citizen”  means  a  person  who  has  citizenship  of  Barbados  by  virtue  of  the\nprovisions of the Constitution, Cap. 1966/1455 or the Barbados Citizenship\nAct, Cap. 186;\n\n“Commission”  means  the  Electoral  and  Boundaries  Commission  established\n\nunder section 41A of the Constitution, Cap. 1966/1455;\n\n“constituency”  means  a  constituency  specified  in  the  First  Schedule  to  the\nElectoral  and  Boundaries  Commission  (Review  of  Boundaries)  Order,\n2002 (S.I. 2002 No. 79) , and described in the Second Schedule thereto;\n\n“compulsory  school  age”  has  the  meaning  assigned  to  it  by  section  2  of  the\n\nEducation Act, Cap. 41;\n\n“documentary  evidence”  means  electronic  data,  printed  or  written  material,  a\nphotograph or any other material which records or shows information which\ncan be used to establish or confirm\n\n(a)\n\nthe identity of a person; or\n\n\f5\n\n(b)\n\nwhether that person qualifies for registration;\n\n“enumerator” has the meaning assigned to it by section 2 of the Representation\n\nof the People Act, Cap. 12;\n\n“identification  card”  means  an  identification  card,  whether  a  Barbados\nidentification card or a non-citizen identification card of Barbados, issued\nby the Commission to a person in accordance with section 7 for the purpose\nof identifying that person;\n\n“legitimate  non-immigrant  purposes”  includes  such  purposes  as  touring,\n\nrecreation, sports, health, family reasons or business;\n\n“National  Register”  means  the  register  established  by  the  Commission  under\n\nsection 3(2);\n\n“national registration number” means the number issued by the Commission to\na person registered in the National Register and affixed to the identification\ncard issued to that person;\n\n“minor” means a person who is under 16 years of age;\n\n“permanent  resident”  has  the  meaning  assigned  to  it  by  section  2  of  the\n\nImmigration Act, Cap. 190;\n\n“registering  officer”  has  the  meaning  assigned  to  it  by  section  2  of  the\n\nRepresentation of the People Act, Cap. 12;\n\n“student” includes a person attending a tertiary institution;\n\n“tertiary  institution”  has  the  meaning  assigned  to  it  by  section  9(f)  of  the\n\nEducation Act, Cap. 41;\n\n“visitor” means a person who\n\n(a)\n\nenters Barbados for legitimate non-immigrant purposes, in the course\nof duty, or for purposes connected with their employment for a period\nof 6 months or more but not exceeding 12 consecutive months; and\n\n\f6\n\n(b)\n\nwho is not resident in Barbados for the purposes of section 85 of the\nIncome Tax Act, Cap. 73.\n\nNational Register\n\n3.(1)\n\nThe Commission shall register\n\n(a)\n\n(b)\n\nall citizens of Barbados; and\n\npersons  who  are  not  citizens  of  Barbados  but  who  are  resident  in\nBarbados for a period of 6 months or more.\n\nThe Commission shall, for the purposes of subsection (1), establish, keep\n\n(2)\nand maintain a register to be known as the National Register to\n\n(a)\n\n(b)\n\nregister and record the persons referred to in subsection (1); and\n\nprovide information to facilitate\n\n(i)\n\n(ii)\n\nthe issuing of identification cards to the persons registered in the\nNational Register; and\n\nthe  preparation  of  a  register  of  electors  for  the  purposes  of  the\nRepresentation of the People Act, Cap. 12.\n\nThe National Register shall be in such form and contain such particulars\n(3)\nas the Commission may prescribe in respect of the persons to whom section 4\napplies.\n\nPersons to be registered in the National Register\n\n4.(1)\n\nA person who\n\n(a)\n\n(b)\n\n(c)\n\nis born in Barbados;\n\nis a citizen of Barbados;\n\nhas  an  immigrant  status  certificate  issued  in  accordance  with  the\nprovisions of the Immigration Act, Cap. 190;\n\n\f7\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\n(k)\n\nhas permanent resident status in accordance with the provisions of the\nImmigration Act, Cap. 190;\n\nis resident in Barbados for a period of 6 months or more as a student\nor worker, in accordance with the provisions of the Immigration Act,\nCap. 190;\n\nis employed by the Caribbean Development Bank under the provisions\nof the Caribbean Development Bank Act, Cap. 323A;\n\nhas a Right of Establishment Certificate issued in accordance with the\nprovisions of the Immigration Act, Cap. 190;\n\nhas  a  CARICOM  Skilled  National  Certificate,  issued  in  accordance\nwith the Caribbean Community (Movement of Skilled Nationals) Act,\nCap. 186A;\n\nis  the  spouse  of  a  person  who  has  a  CARICOM  Skilled  National\nCertificate  issued  in  accordance  with  the  Caribbean  Community\n(Movement of Skilled Nationals) Act, Cap. 186A;\n\nis the spouse of a person who is resident in Barbados for a period of 12\nmonths or more as a worker in accordance with the provisions of the\nImmigration Act, Cap. 190;\n\nis  entitled  by  virtue  of  any  other  provision  of  the  Immigration  Act,\nCap. 190 to remain as a resident in Barbados for a period of 6 months\nor more;\n\n(l)\n\nis permitted to remain in Barbados permanently under any other law;\nor\n\n(m)\n\nis  a  minor  and  the  child  of  a  person  to  whom  paragraphs  (c)  to  (l)\napplies, where that minor is under compulsory school age\n\nshall be registered in the National Register.\n\nA  person  who  is  eligible  for  registration  in  the  National  Register  shall\n(2)\nprovide the registering officer or enumerator with such documentary evidence as\n\n\f8\n\nthe Commission may prescribe in order to establish the truth of the information\nto be recorded in relation to that person in the National Register.\n\nNotwithstanding  subsection  (2),  where  a  person  is  unable  to  produce\n\n(3)\ndocumentary evidence to satisfy the registering officer or enumerator of his\n\n(a)\n\n(b)\n\n(c)\n\nfull name;\n\ncorrect date of birth; and\n\ncorrect place of birth,\n\nthe registering officer or enumerator shall request that the person produce to the\nChief  Registering  Officer  a  sworn  affidavit  with  supporting  exhibits,  where\nrelevant, deposing his full name, as well as his correct date of birth, and place of\nbirth,  in  addition  to  stating  the  reason  for  the  unavailability  of  the  required\ndocumentary evidence.\n\nThe Commission shall take such reasonable steps as may be required to\n(4)\nverify the contents of an affidavit submitted in accordance with subsection (3).\n\nA person who is a visitor shall not be eligible for registration in the National\n\n(5)\nRegister unless that person is a person to whom subsection (1) applies.\n\n(6)\n\nA person who is not registered under this Act shall not\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nbe added to the National Register;\n\nbe assigned a national registration number;\n\nbe issued with an identification card; and\n\nqualify to be added to the register of electors or the revised register of\nelectors  prepared  under  the  Representation  of  the  People  Act,\nCap. 12.\n\nRegistration of persons\n\nA person to whom section 4(1) applies, shall register within such a\n5.(1)\nperiod and in such a manner as the Commission may prescribe for registration in\nthe National Register.\n\n\f9\n\n(2)\nThe Registrar with responsibility for the registration of deaths, under the\nVital Statistics Act, Cap. 192A, shall between the first and tenth day of each month\nof the year provide the Commission with a list of the names of persons whose\ndeaths have occurred during the preceding month.\n\nThe Commission shall review the National Register and where necessary\n\n(3)\ndelete any entry in respect of any person\n\n(a)\n\n(b)\n\nwho is deceased;\n\nwho  is  not  a  citizen  of  Barbados  and  who  is  no  longer  resident  in\nBarbados,  and  has  not  been  resident  in  Barbados  for  a  continuous\nperiod of more than 5 years; or\n\n(c)\n\nwhere the Commission considers that that person ought not to have\nbeen registered in the National Register.\n\nNotwithstanding subsection (1), the Commission may, for the purpose of\n(4)\nregistering a person specified in section 4, publish at least once in the Official\nGazette and at least twice, at intervals of not less than 7 days apart, in at least two\nnewspapers in circulation in Barbados, a notice requiring a person or a group of\npersons  to  appear  before  the  Chief  Registering  Officer  for  registration  in  the\nNational Register.\n\nThe Commission may, for the purpose of removing a person specified in\n(5)\nsubsection (3) or section 7(5) from the National Register, publish at least once\nin the Official Gazette and at least twice, at intervals of not less than 7 days apart,\nin at least two newspapers in circulation in Barbados, a notice of the removal and\nwhere relevant, the notice may require a person or a group of persons to attend\nbefore the Chief Registering Officer.\n\nDuties of Chief Registering Officer\n\n6.(1)\nas the Commission may require, and shall assist the Commission with\n\nThe Chief Registering Officer shall perform such functions and duties\n\n(a)\n\ncompiling and preparing the National Register;\n\n\f10\n\n(b)\n\nregistering persons in the National Register;\n\n(c)\n\nthe maintenance of the National Register;\n\n(d)\n\nthe issuing of identification cards; and\n\n(e)\n\nsuch other duties as the Commission may consider necessary for the\npurposes of the Act.\n\nThe Chief Registering Officer may, in order to perform his functions under\n(2)\nthe Representation of the People Act, Cap. 12, have access to the information\nrecorded in the National Register.\n\nIssuance of identification cards\n\n7.(1)\nRegister identification cards in the following categories:\n\nThe  Commission  shall  issue  to  persons  registered  in  the  National\n\n(a)\n\nthe Barbados identification card to\n\n(i)\n\na citizen of Barbados who is a minor; or\n\n(ii)\n\na citizen of Barbados who is 16 years of age or older; and\n\n(b)\n\nthe non-citizen identification card of Barbados to\n\n(i)\n\na minor who\n\n(A)\n\nis not a citizen of Barbados; and\n\n(B)\n\nis resident in Barbados for a period of 6 months or more; or\n\n(ii)\n\na person who\n\n(A)\n\nis 16 years of age or older;\n\n(B)\n\nis not a citizen of Barbados; and\n\n(C)\n\nis resident in Barbados for a period of 6 months or more.\n\nA  Barbados  identification  card  or  a  non-citizen  identification  card  of\n\n(2)\nBarbados shall be valid for such a period as the Commission prescribes.\n\n\f11\n\n(3)\nThe Commission shall issue to a person registered in the National Register\nan identification card which shall be in such form as the Commission prescribes,\nand the identification card shall contain such security features, and perform such\nother functions as the Commission determines.\n\nA  person  registered  in  the  National  Register  shall  be  issued  the\n(4)\nidentification card for which he is eligible upon the payment of the prescribed\nfee, where applicable.\n\nThe Commission shall, where the Commission is satisfied that a person\n(5)\ndoes not qualify for an identification card under subsection (1), direct the Chief\nRegistering Officer not to issue an identification card to that person, and that\nperson shall be removed from the National Register.\n\nUse of an identification card\n\n8.(1)\nproduce his identification card\n\nA  person  who  is  issued  an  identification  card  may  be  required  to\n\n(a)\n\nto a registering officer, enumerator or any other officer designated by\nthe Commission;\n\n(b)\n\nto a police officer, immigration officer or customs officer;\n\n(c)\n\n(d)\n\nto  verify  his  identity  for  the  purpose  of  voting  in  an  election  in\nBarbados; and\n\nfor  any  other  purpose  for  which  the  verification  of  his  identity  is\nrequired\n\nand that identification card shall be prima facie evidence of the identity of the\nperson shown on the identification card.\n\nWhere  a  person  is  unable  to  produce  his  identification  card,  for  the\n(2)\npurposes  mentioned  in  subsection  (1),  the  person  authorised  to  require  such\nidentification shall, unless another form of identification is authorised by law,\ndefer consideration of the person or refuse access until such time as the relevant\nidentification card is produced.\n\n\f12\n\n(3)\nAll identification cards issued by the Commission are the property of the\nCommission and shall be for the use of the person to whom the card is issued,\nand any person who finds, or comes into possession of, an identification card\nwhich  was  not  issued  to  him  shall  return  that  identification  card  to  the\nCommission.\n\nDuty of non-disclosure\n\n9.(1)\nunder section 4(2) except\n\nThe Commission shall not disclose any of the information obtained\n\n(a)\n\n(b)\n\nin the exercise of powers or duties conferred under this Act or under\nthe Representation of the People Act, Cap. 12;\n\nin compliance with an official request by an instrument in writing from\nthe Commissioner of Police, Chief of Staff of the Barbados Defence\nForce,  Chief  Immigration  Officer,  Revenue  Commissioner,  Chief\nWelfare Officer, Chief Medical Officer or Director of the Barbados\nDrug Service; or\n\n(c)\n\nin compliance with an order of the court.\n\nNotwithstanding subsection (1)(b), where a person in charge of a Ministry\n(2)\nor department, statutory body or any other entity requires information recorded\nin  the  National  Register  in  the  public  interest,  that  Ministry  or  department,\nstatutory  body  or  any  other  entity  shall  request  that  information  from  the\nCommission by an instrument in writing, and the Commission shall determine\nwhether it is fitting in the public interest to issue that information to the Ministry\nor department, statutory body or any other entity.\n\nThe National Register shall not be open to inspection by members of the\n\n(3)\npublic.\n\nPower to inspect and re-issue an identification card\n\nThe  Commission  may  require  a  person  to  submit  or  surrender  the\n10.(1)\nidentification card issued to that person under section 7(4) for inspection by the\n\n\f13\n\nCommission, and the Commission may cancel and replace the identification card\nissued to that person where\n\n(a)\n\nthe card was issued in reliance on information that was later discovered\nto be inaccurate or incomplete due to inadvertence on the part of the\nCommission; and\n\n(b)\n\nthe card is found to be defective by the Commission.\n\nWhere the Commission cancels and replaces an identification card under\n(2)\nsubsection (1) there shall be no charge for the replacement of that identification\ncard.\n\nPower to waive fees\n\nThe Commission may by order exempt a person or a group of persons\n11.(1)\nfrom  the  payment  of  any  fee  prescribed  for  the  issue  or  replacement  of  an\nidentification card.\n\n(2)\n\nAn order made under subsection (1) is subject to negative resolution.\n\nConsolidated Fund\n\n12.\nunder this Act shall be paid into the Consolidated Fund.\n\nAll fees and other monies collected or received by the Commission\n\nOffences\n\n13.\n\nA person who\n\n(a)\n\n(b)\n\nwilfully obstructs the Chief Registering Officer, a registering officer,\nan  enumerator  or  any  other  officer  in  the  execution  of  the  duties\nassigned under this Act;\n\nwithout lawful authority issues an identification card to a person who\nis not entitled to receive an identification card in accordance with the\nprovisions of this Act;\n\n\f14\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nwilfully gives false information to be recorded in the National Register\nwith regard to himself or another person;\n\nwithout  lawful  authority  makes  any  mark  or  entry  upon  or  erases,\ncancels, tampers with, or alters any information on an identification\ncard;\n\nuses an identification card other than the identification card issued to\nhim intending that some other person would be led to believe that he\nis the person on that identification card;\n\nwithout lawful authority or reasonable excuse knowingly obtains or is\nin possession of more than one identification card which purport to\nshow his identity;\n\nwilfully permits another person to use the identification card issued to\nhim knowing that other persons will be led to believe that the person\nusing  the  identification  card  is  the  person  represented  on  the\nidentification card;\n\nforges or makes a card to replicate an identification card or has in his\npossession  any  document  which  closely  resembles  an  identification\ncard, whether or not he intends to use the card or document to deceive\nany person into believing that the card or document is an identification\ncard; or\n\n(i)\n\nwhen required to do so, fails to surrender his identification card for\ninspection by the Chief Registering Officer;\n\nis guilty of an offence and shall be liable on summary conviction to a fine of\n$10 000 or to imprisonment for 3 years or to both.\n\n\f15\n\nRegulations\n\n14.(1)\n\nThe Commission may make regulations\n\n(a)\n\nto prescribe\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\n(vi)\n\nthe  time  for  the  registration  of  persons  to  whom  section  4\napplies;\n\nthe information or particulars to be recorded for each person in\nthe National Register;\n\nthe  form  of  the  application  form  for  the  collection  of  the\ninformation required for the National Register;\n\nthe documents to be furnished for the purposes of confirming or\nverifying  the  identity  of  a  person  and  the  information  to  be\nrecorded in the National Register;\n\nthe manner for the taking of photographs, signatures, finger and\nthumb prints;\n\nthe  form  of  an  identification  card  and  the  particulars  to  be\nentered thereon;\n\n(vii)\n\nthe procedure for the collection of identification cards;\n\n(viii)\n\nthe procedure for issuing replacement identification cards; and\n\n(ix)\n\nfees to be charged for the issuing of an identification card or the\nreplacement thereof; and\n\n(b)\n\ngenerally for carrying out the purposes of this Act.\n\n(2)\n\nAll regulations made under this Act shall be subject to negative resolution.\n\nSavings and Transitional provision\n\n15.(1)\nthe\nRepresentation of the People Act, Cap. 12 or under the Statistics Act, Cap. 192\n\nidentification  card  authorised  under  section  25  of\n\nAn\n\n\f16\n\nshall remain valid for a period of 18 months from the date of the commencement\nof this Act.\n\n(2)\nA new identification card issued under the National Registration Act, 2015,\n(Act 2015- ) to any person who is an existing holder of a valid identification card\n\n(a)\n\n(b)\n\nauthorised under section 25 of the Representation of the People Act,\nCap.  12  and  issued  under  the  Representation  of  the  People\n(Registration of Electors) Regulations, 1990 (S.I. 1990 No. 8) ; or\n\nauthorised  under  the  Statistics  Act,  Cap.  192  and  issued  under  the\nStatistics  (Registration  Census  of  Barbadian  Residents),  1979\n(S.I. 1979 No. 47)\n\nshall be issued free of cost during the period referred to in subsection (1).\n\n(3)\n\nFor the purposes of this section,\n\n“existing holder” means a person who was registered with the Commission or\nunder the Statistics Act, Cap. 192, and issued with an identification card by\nthe Commission prior to the commencement this Act.\n\n\f17\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2015.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2015.\n\nPresident\n\n\f18\n\nNATIONAL REGISTRATION ACT, 2015\n\nEXPLANATORY MEMORANDUM\n\nThe National Registration Act, 2015 would allow the Electoral and Boundaries\n\nCommission to\n\n(a)\n\ncompile  a  National  Register  to  for  the  registration  of  citizens  of\nBarbados as well as for the registration of non-citizens who are resident\nin Barbados for a period of 6 months or more; and\n\n(b)\n\nissue new identification cards with new national registration numbers\nto each person registered in the National Register.\n\nClause 1:\n\nprovides for the short title of the Act.\n\nClause 2:\n\ndefines certain terms used in the Act.\n\nClause 3:\n\nClause 4:\n\nrequires  the  Commission  to  establish,  keep  and  maintain  a\nNational Register where every citizen of Barbados and every\nnon-citizen  who  is  resident  in  Barbados  for  a  period  of  6\nmonths or more is to be registered. It also provides for that\nregister  to  be  used  as  a  means  of  providing  information  to\nfacilitate the issuing of identification cards to those registered\nin the National Register. This information will also be used to\nassist  with  the  preparation  of  a  register  of  electors  for  the\npurposes of the Representation of the People Act, Cap. 12.\n\nsets  out  the  eligibility  requirements  for  a  person  to  be\nregistered in the National Register and for the provision of\nsuch documentary evidence as the Commission may prescribe\nin order to establish the truth of the information to be recorded\nin  the  National  Register.  In  addition,  it  provides  for  the\nsubmission  of  affidavit  evidence  where  documentary\nevidence cannot be produced and such affidavit evidence must\n\ni\n\n\fClause 5:\n\nClause 6:\n\nClause 7:\n\nClause 8:\n\nNATIONAL REGISTRATION ACT,\n2015\n\nbe reasonably verified by the Commission. It also prohibits\nthe registration of persons who fail to meet the requirements\nfor eligibility to be registered.\n\nrequires a person to register in such manner and within such\ntime frame as stipulated by the Commission. It also requires\nthe  Registrar  of  Deaths  to  report  to  the  Commission  the\nnumber of deaths recorded within a given time frame. It allows\nthe Commission to amend the National Register by deleting\nnames as necessary and allows for publishing in the Official\nGazette and in daily newspapers the names of persons required\nto present themselves for registration or the names of persons\nremoved from the register, as the case may be.\n\nsets out the specific duties of the Chief Registering Officer as\nit  relates  to  the  National  Register  and  allows  him  to  have\naccess to the information recorded in the register in order to\nperform his functions.\n\nsets out the categories under which a Barbados identification\ncard or a non-citizen identification card of Barbados is to be\nissued.  It  further  sets  out  the  period  of  validity  of  such\nidentification  cards  and  provides  for  payment  of  the\nprescribed  fee  by  the  person  being  registered  where\napplicable.\n\nsets out when a person issued with an identification card may\nbe  required  to  produce  that  card  and  establishes  that  the\nidentification card is to be viewed as prima facie evidence of\nthe identity of the person whose image it bears. Further it is\nestablished that the identification card is the property of the\nCommission for the use of the person to whom it is issued. It\nalso  stipulates  that  if  the  identification  card  is  found  by  a\n\nii\n\n\fClause 9:\n\nClause 10:\n\nClause 11:\n\nClause 12:\n\nClause 13:\n\nClause 14:\n\nClause 15:\n\nNATIONAL REGISTRATION ACT,\n2015\n\nperson to whom it has not been issued it should be returned to\nthe Commission.\n\nrequires  that  the  information  obtained  to  be  placed  in  the\nNational Register not be open to inspection by the public and\nnot be disclosed except under named circumstances.\n\nto\n\ninspect  and  re-issue  an\nthe  Commission\nallows\nidentification  card  which  was\nin  reliance  on\ninformation later found to be inaccurate or incomplete due to\ninadvertence  on  the  part  of  the  Commission  and  where  the\ncard is found to be defective by the Commission.\n\nissued\n\nallows  the  Commission  to  waive,  by  order,  fees  for  the\nreplacement of an identification card for a person or group of\npersons. The order made in respect of the waiver is subject to\nnegative resolution.\n\nstipulates  that  any  monies  collected  or  received  by  the\nCommission shall be paid into the Consolidated Fund.\n\nsets out certain acts that will be deemed offences as it relates\nto the Act and prescribes a penalty for such offences.\n\nempowers the Commission to make regulations to prescribe\nspecific  requirements  relating  to  the  National  Register  or\nnational identification cards; or to make regulations generally\nfor carrying out the purposes of the Act.\n\nstipulates  that  a  valid  identification  card  authorised  under\nsection 25 of the Representation of the People Act, Cap. 12 or\nunder  the  Statistics  Act,  Cap.  192  shall  remain  valid  for  a\nperiod of 18 months from the date of commencement of this\nAct. It also provides that a new card issued under this Act to\nany  person  who  held  a  valid  identification  card  authorised\n\niii\n\n\fNATIONAL REGISTRATION ACT,\n2015\n\nunder  section  25  of  the  Representation  of  the  People  Act,\nCap. 12 or under the Statistics Act, Cap. 192 shall be free of\ncost during the 18 month period that the previous card remains\nvalid.\n\niv\n\n"
}