{
  "bill_id": 740,
  "slug": "mutual-assistance-in-criminal-matters-amendment-bill-2024",
  "title": "Mutual Assistance in Criminal Matters (Amendment) Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/7f27f525672ef91b5eb4694a73320003.pdf",
  "current_stage": "The Senate",
  "chamber": "The Senate",
  "notice_date": "2024-02-07",
  "first_reading": "2024-02-07",
  "gazette_date": "2023-12-11",
  "markdown": "2024-01-29\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Mutual  Assistance  in  Criminal  Matters  Act,\nCap.  140A  to  make  provision  for  mutual  assistance  in  matters  relating  to\ncomputer-related crimes and for related matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 18 of Cap. 140A\n\nInsertion of new section 18A into Cap. 140A\n\nInsertion of new section 20A and 20B into Cap. 140A\n\nAmendment of section 29 of Cap. 140A\n\nInsertion of new section 34A into Cap. 140A\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  amend  the  Mutual  Assistance  in  Criminal  Matters  Act,\nCap.  140A  to  make  provision  for  mutual  assistance  in  matters  relating  to\ncomputer-related crimes and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment) Act, 2024.\n\nThis Act may be cited as the Mutual Assistance in Criminal Matters\n\nAmendment of section 18 of Cap. 140A\n\n2.\nCap. 140A in this Act referred to as the principal Act is amended by\n\nSection  18  of  the  Mutual  Assistance  in  Criminal  Matters  Act,\n\n(a)\n\ninserting  immediately  after  subsection  (3)  the  following  new\nsubsections:\n\n“(3A)\nWhere an action on a request for assistance would prejudice a\ncriminal  investigation  or  a  criminal  proceeding  conducted  by  its\nauthorities, the central authority for Barbados may postpone an action.\n\n(3B)\nBefore refusing or postponing assistance, the central authority\nfor Barbados shall, where appropriate after having consulted with the\nCommonwealth country, consider whether the request may be granted\npartially or subject to such conditions as it deems necessary.\n\n(3C)\n\nThe central authority for Barbados shall\n\n(a)\n\n(b)\n\n(c)\n\npromptly inform the Commonwealth country of the outcome\nof the execution of a request for assistance;\n\ngive reasons for any refusal or postponement of the request;\nor\n\ninform the Commonwealth country of any reasons that render\nimpossible the execution of the request or are likely to delay\nit significantly.”;\n\n(b)\n\ndeleting subsection (4) and substituting the following:\n\n\f5\n\n“(4)\nWhere a Commonwealth country makes a request for assistance,\nthe central authority for Barbados may supply information or material\non the condition that it is\n\n(a)\n\n(b)\n\nkept confidential; or\n\nnot used for investigations or proceedings other than those\nstated in the request for assistance.”; and\n\n(c)\n\ninserting  immediately  after  subsection  (4)  the  following  new\nsubsections:\n\n“(4A)\nWhere a Commonwealth country cannot comply with a condition\nreferred  to  in  subsection  (4),  it  shall  promptly  inform  the  central\nauthority for Barbados.\n\n(4B)\nWhere  a  Commonwealth  country  has  informed  the  central\nauthority for Barbados that it is unable to comply with a condition under\nsubsection  (4),  the  central  authority  for  Barbados  shall  determine\nwhether the information is to be provided.\n\nA Commonwealth country that accepts a condition in accordance\n\n(4C)\nwith subsection (4) shall be bound by it.\n\nWhere the central authority for Barbados supplies information or\n(4D)\nmaterial  subject  to  a  condition  referred  to  in  subsection  (4),  it  may\nrequire  the  Commonwealth  country  to  explain,  in  relation  to  that\ncondition, the use made of such information or material.\n\nWhere, in the opinion of the central authority for Barbados, the\n(4E)\nexpense involved in complying with a request for assistance would be\nof an extraordinary nature, the central authority for Barbados\n\n(a)\n\nshall consult with the central authority for the country as to\nthe terms and conditions under which compliance with the\nrequest may continue; or\n\n\f6\n\n(b)\n\nmay refuse to continue further with the request in the absence\nof an agreement as to the terms and conditions for compliance\nwith a request.”.\n\nInsertion of new section 18A into Cap. 140A\n\n3.\n18 the following new section:\n\nThe principal Act is amended by inserting immediately after section\n\n“Confidentiality of request for assistance\n\n18A.(1)\nA  Commonwealth  country  may  require  that  a  request  for\nassistance  under  this  Act  be  kept  confidential  except  to  the  extent\nnecessary for its execution.\n\nWhere a request for confidentiality under subsection (1) cannot\n(2)\nbe  complied  with,  the  central  authority  for  Barbados  shall  promptly\ninform the Commonwealth country.\n\nWhere  the  central  authority  for  Barbados  has  informed  a\n(3)\nCommonwealth country that it is unable to comply with a request for\nconfidentiality under subsection (1), the Commonwealth country shall\ndetermine whether the request for assistance is to be executed.”.\n\nInsertion of new section 20A and 20B into Cap. 140A\n\n4.\n20 the following new sections:\n\nThe principal Act is amended by inserting immediately after section\n\n\f7\n\n“Assistance in expediting preservation of computer data\n\n20A.(1)\nA  Commonwealth  country  may  request  that  the  central\nauthority for Barbados obtain an order for the expeditious preservation\nof data stored in a computer system\n\n(a)\n\n(b)\n\nlocated within Barbados; and\n\nin respect of which the country intends to submit a request\nfor mutual assistance in relation to\n\n(i)\n\nsearch or similar access of the data;\n\n(ii)\n\nseizure or similar securing of the data; or\n\n(iii)\n\ndisclosure of the data.\n\nA  request  for  preservation  made  under  subsection  (1),  shall\n\n(2)\nspecify the following:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe authority seeking the preservation;\n\nthe offence that is the subject of a criminal investigation or\nproceedings and a brief summary of the related facts;\n\nthe stored computer data to be preserved and its relationship\nto the offence;\n\nany  available  information  identifying  the  custodian  of  the\nstored computer data or the location of the computer system;\n\n(e)\n\nthe necessity of the preservation; and\n\n(f)\n\nthat the Commonwealth country intends to submit a request\nfor mutual assistance for the search or similar access, seizure\nor similar securing, or disclosure of the stored computer data.\n\nDual  criminality  shall  not  be  a  requirement  to  comply  with  a\n\n(3)\nrequest under subsection (1).\n\n\f8\n\nNotwithstanding any provision in this Part, the central authority\n\n(4)\nfor Barbados may refuse a request for preservation where\n\n(a)\n\n(b)\n\nthe request concerns an offence of a political character; or\n\nthe  granting  of  the  request  would  be  contrary  to  the\nConstitution  or  would  prejudice  the  security,  international\nrelations  or  any  substantial  interest  relating  to  national\nsecurity or other essential public policy of Barbados.\n\nWhere  in  the  opinion  of  the  central  authority  for  Barbados  a\n\n(5)\nrequest for preservation may\n\n(a)\n\n(b)\n\nnot ensure the future availability of the data; or\n\nthreaten the confidentiality of or prejudice the investigation\nof the Commonwealth country,\n\nthe central authority shall promptly inform the Commonwealth country.\n\nWhere  the  Commonwealth  country  is  informed  in  accordance\n(6)\nwith subsection (5), it shall determine whether the request for assistance\nis to be executed.\n\nThe Commissioner of Police, or any other officer designated by\n(7)\nhim in writing, may make an ex parte application for a preservation\norder to a Judge or magistrate where\n\n(a)\n\n(b)\n\ncomputer data, including traffic data, stored in a computer\nthe  purposes  of  a  criminal\nsystem\ninvestigation; and\n\nis  required  for\n\nthere are grounds to believe that the computer data, including\ntraffic  data,  stored  in  a  computer  system  is  particularly\nvulnerable to loss or modification.\n\nWhere the Commissioner of Police satisfies a Judge or magistrate\n(8)\non the basis of the ex parte application made under subsection (7), the\n\n\f9\n\nJudge or magistrate may make an order requiring the person in control\nof the computer system to\n\n(a)\n\n(b)\n\n(c)\n\nensure  that  the  computer  data  specified  in  the  order  be\npreserved for a period of up to 90 days;\n\nmaintain the integrity of the computer data for a period of up\nto 90 days; and\n\nkeep  confidential  any  information  or  action  relating  to  the\npreservation order.\n\nWhere the Commissioner of Police makes an ex parte application\n(9)\nfor  an  extension  of  a  preservation  order,  a  Judge  or  magistrate  may\nextend the preservation order beyond the 90 day period for a further\nperiod of up to 90 days.\n\n(10)\n\nFor the purposes of this section,\n\n“computer  data”  means  any  representation  of  facts,  information  or\nconcepts in a form suitable for processing in a computer system,\nincluding  a  programme  suitable  to  cause  a  computer  system  to\nperform a function;\n\n“computer system” means a device or a group of inter-connected or\nrelated devices, one or more of which, pursuant to a programme,\nfacilitates communication, performs automatic processing of data\nor any other function.\n\nAssistance in expediting disclosure of preserved traffic data\n\n20B.(1)\nWhere in the execution of a request made under section 20A,\nBarbados  discovers  that  a  service  provider  in  another  country  was\ninvolved  in  the  transmission  of  the  communication,  Barbados  shall\nexpeditiously disclose to the Commonwealth country\n\n(a)\n\na  sufficient  amount  of  traffic  data  to  identify  that  service\nprovider; and\n\n\f10\n\n(b)\n\nthe path through which the communication was transmitted.\n\nNotwithstanding subsection (1), Barbados may refuse to disclose\n\n(2)\ntraffic data where\n\n(a)\n\n(b)\n\nthe request concerns an offence of a political character;\n\nthe  granting  of  the  request  would  be  contrary  to  the\nConstitution  or  would  prejudice  the  security,  international\nrelations  or  any  substantial  interest  relating  to  national\nsecurity or other essential public policy of Barbados.”.\n\nAmendment of section 29 of Cap. 140A\n\n5.\n\nSection 29 of the principal Act is amended in subsection (1)\n\n(a)\n\n(b)\n\nin paragraph (a) by deleting the word “and” appearing immediately\nafter the word “matters;”;\n\nby  inserting  immediately  after  paragraph  (b),  the  following\nparagraph:\n\n“(c)\n\nto any country which is party to the Budapest Convention on\nCybercrime.”.\n\nInsertion of new section 34A into Cap. 140A\n\n6.\nimmediately after section 34:\n\nThe principal Act is amended by inserting the following new section\n\n“Spontaneous information\n\n34A.(1)\nSubject to any enactment relating to mutual assistance, the\ncentral authority may, without a request, forward information obtained\n\n\f11\n\nwithin the framework of its investigations to a country if the disclosure\nof such information is likely to\n\n(a)\n\nassist the receiving country in initiating or carrying out an\ninvestigation or proceedings concerning criminal offences;\nor\n\n(b)\n\nlead to a request for co-operation by that country.\n\nNotwithstanding  subsection  (1),  the  central  authority  may\n(2)\nrequest, that prior to providing such information, it be kept confidential\nor only used subject to conditions.\n\nWhere the receiving country is unable to comply with a request\n(3)\nmade under subsection (2), it shall notify the central authority which\nshall  determine  whether  the  information  should  nevertheless  be\nprovided.\n\nWhere the receiving country accepts the information subject to\n\n(4)\nthe conditions, it shall be bound by them.”.\n\n\f12\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}