{
  "bill_id": 741,
  "slug": "cybercrime-bill-2024",
  "title": "Cybercrime Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/48c581fc50f5357214a37caab9189066.pdf",
  "current_stage": "The Senate",
  "chamber": "The Senate",
  "notice_date": "2024-02-07",
  "first_reading": "2024-02-07",
  "gazette_date": "2023-12-11",
  "markdown": "2024-01-29\n\nOBJECTS AND REASONS\n\nThis Bill would provide for\n\n(a)\n\n(b)\n\n(c)\n\nthe combatting of cybercrime;\n\nthe  protection  of  legitimate  interests  in  the  use  and  development  of\ninformation technologies;\n\nthe  facilitation  of  international  co-operation  in  computer  related\ncrimes;\n\n(d)\n\nthe repeal of the Computer Misuse Act, Cap. 124B; and\n\n(e)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\nPART II\n\nPROHIBITED CONDUCT\n\nShort title\n\nInterpretation\n\nApplication\n\nIllegal access\n\nModification of programme or data\n\nInterfering with programme or data\n\nInterfering with computer system\n\nIllegal interception of data\n\nMisuse of devices\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nAccess with intent to commit further offence\n\n11.\n\nDisclosure of access code\n\n\f3\n\n12.\n\nCritical information infrastructure system\n\n13.\n\nReceiving or giving of access to computer programme or data\n\n14.\n\nComputer-related forgery\n\n15.\n\nComputer-related fraud\n\n16.\n\nChild pornography\n\n17.\n\nChild grooming\n\n18.\n\nOnline child sexual abuse\n\n19.\n\nMalicious communications\n\n20.\n\nCyber bullying\n\n21.\n\nCyber terrorism\n\n22.\n\nAiding or abetting\n\nPART III\n\nINVESTIGATION AND ENFORCEMENT\n\n23.\n\nSearch and seizure\n\n24.\n\nAssisting a police officer\n\n25.\n\nRecord of seized data to be provided to owner\n\n26.\n\nProduction of data for criminal proceedings\n\n27.\n\nExpedited preservation and partial disclosure of traffic data\n\n\f4\n\n28.\n\nPreservation of data for criminal proceedings\n\n29.\n\nOrder for payment of compensation\n\n30.\n\nRegulations.\n\n31.\n\nConsequential amendments\n\n32.\n\nRepeal\n\n33.\n\nCommencement\n\nSCHEDULE\n\nCONSEQUENTIAL AMENDMENTS\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the combatting of cybercrime, protection of legitimate\ninterests  in  the  use  and  development  of  information  technologies,  the\nfacilitation of international co-operation in computer related crimes and related\nmatters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Cybercrime Act, 2024.\n\nInterpretation\n\n2.(1)\n\nIn this Act,\n\n“approved  person”  means  a  person  who  has  the  relevant  training  and  skill  in\ncomputer  systems  and  technology,  who  has  knowledge  about  the\nfunctioning  of  the  computer  system  and  is  identified,  in  writing,  by  the\nCommissioner  of  Police  or  other  gazetted  officer  designated  by  the\nCommissioner, to assist the police;\n\n“computer data” means any representation of facts, information or concepts in a\nform suitable for processing in a computer system, including a programme\nsuitable to cause a computer system to perform a function;\n\n“computer  data  storage  medium”  means  any  article  or  material  from  which\nelectronic information is capable of being reproduced, with or without the\naid of any other electronic article or device;\n\n“computer  programme”  or  “programme”  means  data  or  a  portion  of  data\nrepresenting instructions or statements that, when executed in a computer\nsystem, causes the computer system to perform a function;\n\n“computer  system”  means  a  device  or  a  group  of  inter-connected  or  related\ndevices,  one  or  more  of  which,  pursuant  to  a  programme,  facilitates\ncommunication,  performs  automatic  processing  of  data  or  any  other\nfunction;\n\n\f“damage” includes\n\n7\n\n(a)\n\nany impairment to the integrity of a computer system or the integrity\nor availability of any data or programme held in a computer system;\nand\n\n(b)\n\nthe impairment of the confidentiality of data or programme held in a\ncomputer system;\n\n“intercept” includes, in relation to a computer system, listening to, monitoring or\nsurveillance of or recording a function of a computer system, or acquiring\nthe substance, meaning or purport of the function;\n\n“service provider” means\n\n(a)\n\n(b)\n\na public or private entity that provides to users of its services the ability\nto communicate by means of a computer system; and\n\nany other entity that processes or stores computer data on behalf of that\nentity or its users;\n\n“ship” means a vessel which is designed, used or capable of being used solely or\npartly  for  navigation  in,  on,  through,  or  immediately  above  the  water,\nwithout  regard  to  method  or  lack  of  propulsion  and  includes  a  maritime\nautonomous surface ship;\n\n“traffic data” means computer data that\n\n(a)\n\n(b)\n\n(c)\n\nrelates to a communication by means of a computer system;\n\nis  generated  by  a  computer  system  that  is  part  of  a  chain  of\ncommunication; and\n\nshows the origin, destination, route, time, date, size, duration of the\ncommunication or the type of underlying services.\n\nFor the purposes of this Act, access of any kind by a person to any computer\n(2)\nsystem, programme or data is obtained without authority if he knows that he is\n\n\f8\n\nnot entitled to access of the kind in question relating to the computer system,\nprogramme or data and\n\n(a)\n\n(b)\n\nhe accesses the computer system, programme or data; or\n\nhe  exceeds  any  right  or  permission  to  access  the  computer  system,\nprogramme or data from any person who may permit such access.\n\nA reference in this Act to any \"programme or data\" held in a computer\n\n(3)\nsystem includes a reference to\n\n(a)\n\n(b)\n\nany programme or data held in any removable storage medium which\nis for the time being in the computer system; or\n\nany programme or data held in any storage medium which is external\nto the computer system, but which is connected to it.\n\nFor the purposes of this Act, a modification of the contents of any computer\n(4)\nsystem takes place if, by the operation of any function of the computer system\nconcerned or of any other computer system\n\n(a)\n\n(b)\n\n(c)\n\nany programme or data held in the computer system is altered or erased;\n\nany programme or data is added to any programme or data held in the\ncomputer system; or\n\nany  act  occurs  which  impairs  the  normal  operation  of  any\ncomputer system,\n\nand any act which contributes towards such a modification shall be regarded as\ncausing it.\n\nAny modification referred to in subsection (4) is without authority if the\n\n(5)\nperson whose act causes the modification\n\n(a)\n\n(b)\n\nknows that he is not entitled to determine whether the modification\nshould be made; and\n\nhas not obtained the consent of the person who is entitled to consent to\nthe modification.\n\n\f9\n\nA reference in this Act to a programme includes a reference to a part of a\n\n(6)\nprogramme.\n\nApplication\n\n3.(1)\n\nThis Act applies to an act done or an omission made\n\n(a)\n\n(b)\n\n(c)\n\nin Barbados;\n\non a ship or aircraft registered in Barbados; or\n\nby  a  national  of  Barbados  outside  the  territory  of  Barbados,  if  the\nperson's conduct would also constitute an offence under the law of a\ncountry where the offence was committed.\n\nFor the purpose of paragraph (a) of subsection (1), an act is carried out in\n\n(2)\nBarbados if\n\n(a)\n\n(b)\n\nthe person is in Barbados when the act is committed; or\n\nthe person is outside Barbados at the time when the act is committed\nbut\n\n(i)\n\na computer system located in Barbados or electronic data storage\nmedium  located  in  Barbados  is  affected  by,  or  contains\ninformation about the act; or\n\n(ii)\n\ntransmission or effect of the act, or the damage resulting from the\nact, occurs in whole or in part within Barbados.\n\nThe Mutual Assistance in Criminal Matters Act, Cap. 140A shall apply to\n(3)\nthis Act in relation to an offence under this Act as if the offence were a serious\noffence within the meaning of section 2 of that Act.\n\n\f10\n\nPART II\n\nPROHIBITED CONDUCT\n\nIllegal access\n\n4.(1)\n\nA person who intentionally or recklessly and without authority,\n\n(a)\n\n(b)\n\n(c)\n\ngains access to the whole or any part of a computer system;\n\ncauses a programme to be executed; or\n\nuses a programme to gain access to any data,\n\nis guilty of an offence and is liable on conviction on indictment to a fine of $50\n000 or to imprisonment for a term of 5 years or to both.\n\nFor the purposes of subsection (1), the form in which any programme or\n(2)\ndata is accessed or obtained and, in particular, whether or not it represents a form\nin which it is capable of being executed is immaterial.\n\nModification of programme or data\n\n5.(1)\nA person who intentionally or recklessly and without authority causes\nany modification to a programme or data is guilty of an offence and is liable on\nconviction on indictment to a fine of $70 000 or to imprisonment for a term of 7\nyears or to both.\n\nFor the purposes of subsection (1), the act in question need not be directed\n\n(2)\nat\n\n(a)\n\n(b)\n\nany specifically identifiable programme or data or type of programme\nor data; or\n\nany  programme  or  data  that  is  held  in  a  specifically  identifiable\ncomputer system.\n\nFor  the  purposes  of  subsection  (1),  it  is  immaterial  whether  the\n\n(3)\nmodification is or is intended to be permanent or temporary.\n\n\f11\n\nInterfering with programme or data\n\n6.(1)\n\nA person who intentionally or recklessly and without authority,\n\n(a)\n\ncopies or moves a programme or data\n\n(i)\n\n(ii)\n\nto any storage medium other than that in which that programme\nor data is held; or\n\nto  a  different  location  in  the  storage  medium  in  which  that\nprogramme or data is held;\n\n(b)\n\ndestroys or erases a programme or data;\n\n(c)\n\ndamages a programme or data;\n\n(d)\n\nsuppress a programme or data;\n\n(e)\n\nadds, deletes or alters a programme or data;\n\n(f)\n\n(g)\n\nrenders a programme or data meaningless, useless or ineffective;\n\nobstructs, interrupts or interferes with the lawful use of a programme\nor data; or\n\n(h)\n\ndenies access to a programme or data,\n\nis guilty of an offence and is liable on conviction on indictment to a fine of $70\n000 or to imprisonment for a term of 7 years or to both.\n\nSubsection  (1)  applies  whether  the  person's  act  is  of  temporary  or\n\n(2)\npermanent effect.\n\nFor the purposes of subsection (1), the form in which a programme or data\n(3)\nis copied and, in particular, whether or not it represents a form in which it is\ncapable of being executed is immaterial.\n\n\f12\n\nInterfering with computer system\n\n7.\n\nA person who intentionally or recklessly and without authority,\n\n(a)\n\nhinders the functioning of a computer system by\n\n(i)\n\ncausing electromagnetic interference to a computer system;\n\n(ii)\n\naccessing or causing access to a computer system; or\n\n(iii)\n\ncorrupting a computer system by any means; or\n\n(b)\n\ninterferes with the functioning of a computer system,\n\nis guilty of an offence and is liable on conviction on indictment to a fine of $70\n000 or to imprisonment for a term of 7 years or to both.\n\nIllegal interception of data\n\n8.\nA person who intentionally and without authority, undertakes an act\nto intercept by technical means any non-public transmission to, from or within a\ncomputer system, including electromagnetic emissions from a computer system\ncarrying computer data, is guilty of an offence and is liable on conviction on\nindictment to a fine of $100 000 or to imprisonment for a term of 10 years or to\nboth.\n\nMisuse of devices\n\n9.\n\nA person who intentionally or recklessly and without authority,\n\n(a)\n\nproduces,  sells,  procures  for  use,  imports,  exports,  distributes  or\notherwise makes available\n\n(i)\n\n(ii)\n\na  device,  including  a  computer  programme,  that  is  primarily\ndesigned or adapted for the purpose of committing an offence; or\n\na computer password, access code or similar data by which the\nwhole  or  any  part  of  a  computer  system  is  capable  of  being\n\n\f13\n\naccessed,  with  the  intent  that  it  be  used  by  any  person  for  the\npurpose of committing an offence; or\n\n(b)\n\nhas an item mentioned in paragraph (a)(i) or (ii) in his possession with\nthe intent that it be used by himself  or any other  person for the purpose\nof committing an offence,\n\nis guilty of an offence and is liable on conviction on indictment to a fine of $70\n000 or to imprisonment for a term of 7 years or to both.\n\nAccess with intent to commit further offence\n\nA  person  who  intentionally  and  without  authority  uses  a  computer\n10.\nsystem to perform any function in order to secure access to any programme or\ndata  held  in  that  computer  system  or  in  any  other  computer  system  with  the\nintention  to  commit  a  further  offence  is  guilty  of  an  offence  and  is  liable  on\nconviction on indictment to a fine of $70 000 or to imprisonment for a term of 7\nyears or to both.\n\nDisclosure of access code\n\n11.(1)\nA  person  who  intentionally  or  recklessly  and  without  authority\ndiscloses any password, access code or any other means of gaining access to any\nprogramme or data held in a computer system is guilty of an offence and is liable\non summary conviction to a fine of $25 000 or to imprisonment for a term of 3\nyears or to both.\n\nA person who intentionally or recklessly and without authority discloses\n(2)\nany  password,  access  code  or  any  other  means  of  gaining  access  to  any\nprogramme or data held in a computer system for any unlawful gain, whether to\nhimself or to another person, knowing that it is likely to cause unlawful damage,\nis guilty of an offence and is liable on conviction on indictment to a fine of $70\n000 or to imprisonment for a term of 7 years or to both.\n\n\f14\n\nCritical information infrastructure system\n\n12.(1)\nFor  the  purposes  of  this  section  “critical  information  infrastructure\nsystem”  means  any  computer  system,  programme  or  data  that  supports  or\nperforms a function that relates to\n\n(a)\n\n(b)\n\n(c)\n\nelectricity generation or distribution;\n\ntelecommunications;\n\ngovernment services;\n\n(d)\n\nemergency services;\n\n(e)\n\nlaw enforcement, security or intelligence agencies;\n\n(f)\n\n(g)\n\npublic works; or\n\nany computer system, programme or data that may be designated as a\ncritical information infrastructure system by the Minister responsible\nfor the prevention of cybercrime, published in the Official Gazette,\n\nthat  is  so  vital  that  the  incapacity  or  destruction  of  such  computer  system,\nprogramme or data would have a debilitating impact on the security, national\neconomic security, national public health or safety or any combination of those\nmatters, in Barbados.\n\n(2)\n\nA person who without authority,\n\n(a)\n\n(b)\n\ngains access to; or\n\ninterferes with\n\na critical information infrastructure system is guilty of an offence and is liable\non conviction on indictment to a fine of $100 000 or to imprisonment for a term\nof 10 years or to both.\n\nA person who without authority gains access to or interferes with a critical\n(3)\ninformation infrastructure system in the course of the commission of any offence\n\n\f15\n\nis liable on conviction on indictment to a fine of $150 000 or to imprisonment\nfor a term of 12 years or to both.\n\nIt shall be a defence to a charge brought under subsection (2) or (3) to prove\n(4)\nthat access to or interference with a critical information infrastructure system was\nobtained inadvertently and with no intent to commit an offence.\n\nReceiving or giving of access to computer programme or data\n\n13.(1)\n\nA person who\n\n(a)\n\nintentionally or recklessly and without authority receives or is given\naccess to any programme or data; and\n\n(b)\n\nknows or believes that\n\n(i)\n\nthe programme or data was obtained without authority; or\n\n(ii)\n\naccess to the programme or data was obtained without authority,\n\nis guilty of an offence and is liable on conviction on indictment to a fine of $70\n000 or to imprisonment for a term of 7 years or to both.\n\nIt shall be a defence to a charge brought under subsection (1) to prove that\n\n(2)\nthe programme or data or access to the programme or data\n\n(a)\n\n(b)\n\n(c)\n\nwas received inadvertently and with no intent to commit an offence;\n\nwas subject to legal privilege; and\n\nwas  received  by  a  law  enforcement  officer  in  the  course  of  an\ninvestigation.\n\nComputer-related forgery\n\nA  person  who  intentionally  and  without  authority,  inputs,  alters,\n14.\ndeletes or suppresses a programme or data that results in inauthentic data being\nconsidered or acted on for any legal purpose as if it were authentic, whether or\nnot the data is directly readable and intelligible, is guilty of an offence and liable\n\n\f16\n\non conviction on indictment to a fine of $100 000 or to imprisonment for a term\nof 10 years or to both.\n\nComputer-related fraud\n\n15.\nA person who intentionally, fraudulently or dishonestly and without\nauthority, inputs, alters, deletes or suppresses any computer data or interferes\nwith the functioning of a computer system for the purpose of\n\n(a)\n\n(b)\n\nprocuring an economic benefit for himself or another person;\n\ncausing loss of property to a person;\n\nis guilty of an offence and is liable on conviction on indictment to a fine of $100\n000 or to imprisonment for a term of 10 years or to both.\n\nChild pornography\n\n16.(1)\n\nA person who intentionally or recklessly\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\npublishes child pornography through a computer system;\n\nproduces child pornography for the purpose of its publication through\na computer system;\n\npossesses child pornography in a computer system or on a computer\ndata storage medium for the purpose of publication; or\n\nprocures child pornography through a computer system for himself or\nfor another person,\n\nis guilty of an offence and is liable on conviction on indictment\n\n(i)\n\nin the case of an individual to a fine of $100 000 or to imprisonment\nfor a term of 10 years or to both; or\n\n(ii)\n\nin the case of a corporation, to a fine of $250 000.\n\nIt shall be a defence to a charge brought under subsection (1) if the person\n(2)\nestablishes that the child pornography was for a bona fide research, medical or\nlaw enforcement purpose.\n\n\f(3)\n\nFor the purposes of subsection (1),\n\n17\n\n(a)\n\n(b)\n\n“child” means a person under the age of 18 years;\n\n\"child pornography\" includes material that visually depicts\n\n(i)\n\n(ii)\n\na child engaged in sexually explicit conduct;\n\na person who appears to be a child engaged in sexually explicit\nconduct; or\n\n(iii)\n\nrealistic images representing a child engaged in sexually explicit\nconduct; and\n\n(c)\n\n\"publish\" includes\n\n(i)\n\n(ii)\n\n(iii)\n\ndistribute, transmit, disseminate, circulate, deliver, exhibit, lend\nfor gain, exchange, barter, sell or offer for sale, let on hire or offer\nto let on hire, offer in any other way, or make available in any\nway;\n\nhave in possession or custody, or under control, for the purpose\nof doing an act referred to in paragraph (b); or\n\nprint, photograph, copy or make in any other manner, whether of\nthe same or of a different kind or nature, for the purpose of doing\nan act referred to in paragraph (b).\n\nChild grooming\n\n17.\nA person who intentionally or recklessly uses a computer system to\nbefriend, manipulate, communicate with or establish a connection with a child\nin order to abuse the child, whether sexually or otherwise, is guilty of an offence\nand is liable on conviction on indictment\n\n(a)\n\nin the case of an individual to a fine of $100 000 or to imprisonment\nfor a term of 10 years or to both; or\n\n(b)\n\nin the case of a corporation, to a fine of $250 000.\n\n\f18\n\nOnline child sexual abuse\n\n18.(1)\nmeet a child for the purpose of\n\nA person who intentionally or recklessly uses a computer system to\n\n(a)\n\n(b)\n\nengaging in sexual activity with a child;\n\nengaging in sexual activity with the child where\n\n(i)\n\n(ii)\n\ncoercion, inducement, force or threat is used;\n\na  recognised  position  of  trust,  authority  or  influence  over  the\nchild, including within the family is abused; or\n\n(iii)\n\na child’s mental or physical disability or situation of dependence\nis abused\n\nis guilty of an offence.\n\nA  person  who  is  guilty  of  an  offence  under  subsection  (1)  is  liable  on\n\n(2)\nconviction on indictment\n\n(a)\n\nin the case of an individual to a fine of $100 000 or to imprisonment\nfor a term of 10 years or to both; or\n\n(b)\n\nin the case of a corporation to a fine of $250 000.\n\nMalicious communications\n\n19.(1)\npublish, broadcast or transmit computer data that\n\nA person who intentionally or recklessly uses a computer system to\n\n(a)\n\n(b)\n\nintimidates a person; or\n\nthreatens to\n\n(i)\n\nuse violence towards a person or a member of his family; or\n\n(ii)\n\ndamage the property of a person or the property of his family,\n\nis guilty of an offence and is liable on summary conviction to a fine of $70 000\nor to imprisonment for a term of 7 years or to both.\n\n\f19\n\n(2)\n\nA person who intentionally or recklessly uses a computer system\n\n(a)\n\n(b)\n\nto  publish,  broadcast  or  transmit  data  that  includes  private  sexual\nphotographs and videos without the consent of a person who appears\nin them, with intent to humiliate, harass or cause substantial emotional\ndistress to that person; or\n\nto  send  repeatedly  to  another  person  data  that  is  obscene,  vulgar,\nprofane, lewd or indecent with intent to humiliate or harass the other\nperson to the detriment of that person’s health, emotional well-being,\nself-esteem or reputation,\n\nis guilty of an offence and is liable on summary conviction to a fine of $70 000\nor to imprisonment for a term of 7 years or to both.\n\nA person who intentionally uses a computer system to disseminate any\n(3)\nimage or words, not caring whether they are true or false, and causes or is likely\nto cause or subject a person to ridicule, contempt or embarrassment, is guilty of\nan  offence  and  is  liable  on  summary  conviction  to  a  fine  of  $70  000  or  to\nimprisonment for a term of 7 years or to both.\n\n(4)\n\nFor the purposes of subsection (1),\n\n(a)\n\n“intimidate” means to cause\n\n(i)\n\n(ii)\n\nin the mind of a reasonable person injury to himself, any member\nof his family or any of his dependants;\n\nin the mind of a reasonable person an apprehension of violence\nor damage to any person or property; or\n\n(iii)\n\na person substantial emotional distress;\n\n(b)\n\n“injury”  includes  injury  or  damage  to  a  person  in  respect  of  his\nbusiness,  occupation,  profession,  employment  or  other  source  of\nincome.\n\n\f20\n\n(5)\nThe defences of truth, comment, triviality and privilege, whether absolute\nor qualified, provided for under the Defamation Act, Cap. 199 shall extend to a\nprosecution under subsection (3).\n\nCyber bullying\n\n20.(1)\n\nA person who intentionally uses a computer system\n\n(a)\n\n(b)\n\nto publish, broadcast or transmit data that is offensive, pornographic,\nindecent, vulgar, profane, obscene or of a menacing character or causes\nany such data to be so sent;\n\nfor  the  purpose  of  causing  annoyance,  inconvenience,  danger,\nobstruction, embarrassment, insult, injury, humiliation, intimidation,\nhatred, anxiety or causes substantial emotional distress to that person,\n\nis guilty of an offence and is liable on summary conviction to a fine of $70 000\nor to imprisonment for a term of 7 years or to both.\n\nNotwithstanding  subsection  (1)  a  person  shall  not  be  deemed  to  have\n\n(2)\ncommitted an offence if he does an act\n\n(a)\n\n(b)\n\nfor a bona fide scientific or medical research or law enforcement; or\n\nin compliance of and in accordance with the terms of a court order\nissued in exercise of any power under this Act or any law.\n\nCyber terrorism\n\n21.(1)\nA person who intentionally uses or causes to be accessed a computer\nsystem  for  the  purpose  of  terrorism  is  guilty  of  an  offence  and  is  liable  on\nconviction on indictment to imprisonment for a term of 25 years.\n\nFor the purposes of this section, “terrorism” has the meaning assigned to\n\n(2)\nit in section 3 of the Anti-Terrorism Act, Cap. 158.\n\n\f21\n\nAiding or abetting\n\n22.\nAct is guilty of that offence and is liable to the penalty of that offence.\n\nA person who aids or abets the commission of an offence under this\n\nPART III\n\nINVESTIGATION AND ENFORCEMENT\n\nSearch and seizure\n\n23.(1)\nWhere a Judge or magistrate is satisfied, on information on oath given\nby a police officer, that there are reasonable grounds for suspecting that an offence\nhas  been,  is  being  or  is  about  to  be  committed  in  any  place  and  that  there  is\nevidence that such an offence has been, is being or is about to be committed in\nthat place, the magistrate may issue a warrant authorising any police officer to\nenter  and  search  that  place,  including  any  computer  system,  using  such\nreasonable force as is necessary.\n\n(2)\n\nA warrant issued under this section may authorise a police officer to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nseize  or  similarly  secure  any  computer  system,  data,  programme,\ninformation,  document  or  thing  if  he  reasonably  believes  that  it  is\nevidence that an offence has been or is about to be committed;\n\ninspect and check the operation of any computer system referred to in\nparagraph (a);\n\nuse or cause to be used any computer system referred to in paragraph\n(a)  to  search  any  programme  or  data  held  in  or  available  to  such\ncomputer system;\n\nhave  access  to  any  information,  code  or  technology  which  has  the\ncapability of transforming or converting an encrypted programme or\ndata  held  in  or  available  to  the  computer  system  into  readable  and\n\n\f22\n\ncomprehensible  format  or  text,  for  the  purpose  of  investigating  any\noffence;\n\nconvert  an  encrypted  programme  or  data  held  in  another  computer\nsystem at the place specified in the warrant, where there are reasonable\ngrounds  for  believing  that  computer  data  connected  with  the\ncommission of the offence may be stored in that other system;\n\nmake and retain a copy of any programme or data held in the computer\nsystem referred to in paragraph (a) or (e) and any other programme or\ndata held in the computer system;\n\nmaintain the integrity of the relevant stored computer data; and\n\nrender  inaccessible  or  remove  computer  data  from  the  computer\nsystem.\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nWhere a Judge or magistrate is satisfied on the basis of an application by\n(3)\nthe Commissioner of Police or other gazetted officer that specified computer data\nor other information is required for the purpose of a criminal investigation or\ncriminal  proceedings,  the  Judge  or  magistrate  may  order  a  person  who  has\nknowledge about the functioning of a computer system or measures applied to\nprotect  the  computer  data  therein,  to  provide,  as  is  reasonable,  the  necessary\ninformation  to  enable  the  undertaking  of  the  measures  in  subsections  (1)  and\n(2).\n\nA warrant issued under this section shall authorise an approved person or\n(4)\na  person  who  has  knowledge  about  the  functioning  of  a  computer  system  or\nmeasures applied to protect the computer data to assist a police officer in the\nexecution of the warrant.\n\nA person who obstructs a police officer in the execution of his duty under\n(5)\nthis section or who fails to comply with a request under this section is guilty of\nan  offence  and  is  liable  on  summary  conviction  to  a  fine  of  $25  000  or  to\nimprisonment for a term of 2 years or to both.\n\n(6)\n\nFor the purposes of this section,\n\n\f23\n\n“encrypted  programme  or  data”  means  a  programme  or  data  which  has  been\ntransformed from its plain text version to an unreadable or incomprehensible\nformat,  regardless  of  the  technique  utilised  for  such  transformation  and\nirrespective of the medium in which such programme or data occurs or can\nbe found, for the purpose of protecting the content of such programme or\ndata;\n\n“plain  text  version”  means  a  programme  or  original  data  before  it  has  been\n\ntransformed to an unreadable or incomprehensible format.\n\nAssisting a police officer\n\n24.(1)\n\nA person who\n\n(a)\n\n(b)\n\nis  in  possession  or  control  of  a  computer  data  storage  medium  or\ncomputer system; or\n\nhas knowledge about the functioning of a computer system or measures\napplied to protect the computer data therein,\n\nthat  is  the  subject  of  a  search  or  a  seizure,  shall  assist  a  police  officer  in  the\nexecution of a warrant issued under section 23.\n\n(2)\n\nThe assistance referred to in subsection (1) may include the following:\n\n(a)\n\naccessing  and  using  a  computer  system  or  computer  data  storage\nmedium to search any computer data available to or in the system;\n\n(b)\n\nobtaining and copying computer data referred to in paragraph (a);\n\n(c)\n\n(d)\n\nusing equipment to make copies;\n\nobtaining  access  to  decryption  information  necessary  to  decrypt\ncomputer data required for the purpose of investigating the commission\nof the offence;\n\n(e)\n\nobtaining an intelligible output from a computer system in a plain text\nformat that can be read by a person;\n\n(f)\n\nmaintaining the integrity of the computer data; and\n\n\f24\n\n(g)\n\nrendering  inaccessible  or  removing  computer  data  in  the  computer\nsystem.\n\n(3)\nA person who fails without lawful excuse or justification to assist a police\nofficer in accordance with subsection (1) is guilty of an offence and is liable on\nsummary conviction to a fine of $25 000 or to imprisonment for a term of 2 years\nor to both.\n\nA person who seeks to prevent or prevents another person from assisting\n(4)\na police officer in the execution of a warrant issued under section 23 is guilty of\nan  offence  and  is  liable  on  summary  conviction  to  a  fine  of  $25  000  or  to\nimprisonment for a term of 2 years or to both.\n\nFor  the  purposes  of  this  section,  \"decryption  information\"  means\n(5)\ninformation or technology that enables a person to readily transform an encrypted\nprogramme or data from its unreadable and incomprehensible format to its plain\ntext version.\n\nRecord of seized data to be provided to owner\n\n25.(1)\nWhere  a  computer  system  or  computer  data  has  been  removed  or\nrendered  inaccessible  to  the  owner  or  person  who  has  control  of  the  system\nfollowing a search or a seizure under section 23, the person who made the search\nshall, at the time of the search or as soon as practicable after the search,\n\n(a)\n\nmake a list of what has been seized or rendered inaccessible, with the\ndate and time of the seizure; and\n\n(b)\n\ngive a copy of that list to\n\n(i)\n\nthe owner of the computer system or computer data;\n\n(ii)\n\nthe occupier of the premises; or\n\n(iii)\n\nthe person in control of the computer system or computer data.\n\n\f25\n\nSubject to subsection (3), a police officer or an approved person shall, on\n\n(2)\nrequest,\n\n(a)\n\npermit a person who had the custody or control of the computer system,\nor someone acting on behalf of that person, to gain access to and copy\ncomputer data on the system; or\n\n(b)\n\ngive the person referred to in paragraph (a), a copy of the computer\ndata.\n\nA police officer or an approved person may refuse to give access to or\n(3)\nprovide copies of computer data referred to in subsection (2) if he has reasonable\ngrounds for believing that giving the access or providing the copies\n\n(a)\n\n(b)\n\nwould constitute a criminal offence; or\n\nwould prejudice\n\n(i)\n\n(ii)\n\nthe  investigation  in  connection  with  which  the  search  and\nseizure was carried out;\n\nanother investigation connected to the one in respect of which the\nsearch and seizure was carried out; or\n\n(iii)\n\nany criminal proceedings that are pending or that may be brought\nin relation to any of those investigations.\n\nProduction of data for criminal proceedings\n\n26.(1)\nWhere a Judge or magistrate is satisfied on the basis of an application\nby a police officer that specified computer data or other information is required\nfor the purpose of a criminal investigation or criminal proceedings, the Judge or\nmagistrate may order that\n\n(a)\n\na  person  shall  submit  specified  computer  data  in  that  person’s\npossession  or  control,  which  is  stored  in  a  computer  system  or  a\ncomputer-data storage medium; or\n\n\f26\n\n(b)\n\na  service  provider  offering  services  in  Barbados  produce  subscriber\ninformation relating to such services that is in the service provider’s\npossession or control.\n\n(2)\nA person referred to in subsection (1) who discloses without authority any\ninformation in his possession or under his control is guilty of an offence and is\nliable on conviction on indictment,\n\n(a)\n\nin the case of an individual, to a fine of $70 000 or to imprisonment for\na term of 7 years or to both; or\n\n(b)\n\nin the case of a corporation, to a fine of $250 000.\n\nFor the purposes of subsection (1), “subscriber information” means any\n(3)\ninformation contained in the form of computer data or any other form that is held\nby a service provider, relating to subscribers of its services, other than traffic or\ncontent data, which can establish\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe type of communication service used;\n\nthe technical provisions taken relating to the communication service;\n\nthe period of service;\n\nthe subscriber’s identity, postal or geographic address, telephone and\nother access number, billing and payment information on the basis of\nthe service agreement or arrangement; and\n\nany other information on the site of the installation of communication\nequipment,  available  on  the  basis  of  the  service  agreement  or\narrangement.\n\nExpedited preservation and partial disclosure of traffic data\n\n27.\nWhere a Judge or magistrate is satisfied on the basis of an ex parte\napplication by the Commissioner of Police or other gazetted officer that specified\ndata  stored  in  a  computer  system  is  required  for  the  purpose  of  a  criminal\n\n\f27\n\ninvestigation or criminal proceedings, the Judge or magistrate may make an order\nto ensure that expeditious\n\n(a)\n\npreservation of traffic data is available regardless of whether one or\nmore  service  providers  was  involved  in  the  transmission  of  that\ncommunication; and\n\n(b)\n\ndisclosure of a sufficient amount of traffic data is given to enable the\nidentification of\n\n(i)\n\nthe service providers; and\n\n(ii)\n\nthe path through which the communication was transmitted.\n\nPreservation of data for criminal proceedings\n\nThe Commissioner of Police or any other gazetted officer may make\n28.(1)\nan ex parte application for a preservation order to a Judge or magistrate where\n\n(a)\n\n(b)\n\ncomputer data, including traffic data, stored in a computer system is\nrequired for the purposes of a criminal investigation; and\n\nthere are grounds to believe that the computer data, including traffic\ndata, stored in a computer system is particularly vulnerable to loss or\nmodification.\n\nWhere the Commissioner of Police or any other gazetted officer satisfies\n(2)\na  Judge  or  magistrate  on  the  basis  of  an  ex  parte  application  made  under\nsubsection (1), the Judge or magistrate may make an order requiring the person\nin control of the computer system to\n\n(a)\n\n(b)\n\n(c)\n\nensure that the computer data specified in the order is preserved for a\nperiod of up to 90 days;\n\nmaintain the integrity of the computer data for a period of up to 90\ndays; and\n\nkeep confidential any information or action relating to the preservation\norder.\n\n\f28\n\n(3)\nWhere the Commissioner of Police or other gazetted officer makes an ex\nparte application for an extension of a preservation order, a Judge or magistrate\nmay extend the preservation order beyond the 90 day period for a further period\nof up to 90 days.\n\nOrder for payment of compensation\n\nThe Court may make an order for the payment of compensation where\n29.(1)\na person is convicted of any offence and he causes damage to another person’s\ncomputer system, programme or data.\n\nA claim by a person for damages sustained by reason of the offence is\n(2)\ndeemed to have been satisfied to the extent of any amount which has been paid\nto that person under an order for compensation.\n\nAn order made under subsection (1) shall not prejudice any right to a civil\n(3)\nremedy for the recovery of damages beyond the amount of compensation paid\nunder the order.\n\n(4)\n\nAn order for compensation under this section is recoverable as a civil debt.\n\nFor the purposes of this section, a programme or data held in a computer\n\n(5)\nsystem is deemed to be the property of the owner of the computer system.\n\nRegulations.\n\n30.\neffect to this Act.\n\nThe Minister may make regulations generally for the purpose of giving\n\nConsequential amendments\n\n31.\nin the manner set out opposite thereto in the second column.\n\nThe enactments set out in the first column of the Schedule are amended\n\nRepeal\n\n32.\n\nThe Computer Misuse Act, Cap. 124B is repealed.\n\n\f29\n\nCommencement\n\n33.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f30\n\n L.R.O. 1998SCHEDULE(Section 31)CONSEQUENTIAL AMENDMENTSColumn 1EnactmentCopyright Act, Cap. 300Column 2AmendmentIn section 31(a) delete subsection (5) and substitute the following:\"(5) Copyright in a work is infringed by a person who, without the licence of the copyright owner, transmits the work by means of a computer system or telecommunications system (otherwise than by broadcasting or inclusion in a cable programme service) knowing or having reason to believe that infringing copies of the work will be made by means of the reception of the transmission in Barbados or elsewhere.\".(b) insert immediately after subsection (5) the  following new subsection:\"(5A) For the purposes of subsection (5) \"computer system\" means a device or a group of interconnected or related devices, one or more of which, pursuant to a programme, facilititates communication,  performs automatic processing of data or any other function.\".\f31\n\n L.R.O. 1998Column 1EnactmentDefamation Act, Cap. 199Extradition Act, Cap. 189Column 2AmendmentSection 34 is deleted.(a)In section 4, insert immediately after subsection (2)the following new subsection:\"(3) An order made under subsection (2) shall be subject to afﬁ rmative resolution.\".(b)In the Schedule insert immediately after paragraph40 the following new paragraph:\"41. Any offence under the Cybercrime Act, 2024 (2024-   ).\".Schedule - (Concl'd)CONSEQUENTIAL AMENDMENTS - (Concl'd)\f32\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}