{
  "bill_id": 743,
  "slug": "resolution-re-gob-to-guarantee-borrowing-by-komi-from-african-exportimport-bank",
  "title": "Resolution Re GoB to Guarantee Borrowing by KOMI from African Export-Import Bank",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/a40ed3c6f9e12bc07554811e93e3b450.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-12-07",
  "first_reading": "2023-12-05",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\n2023-11-01\n\nPARLIAMENT\n\nWHEREAS by paragraph (a) of section 3(1) of the Guarantee of Loans (Companies)\n\nAct, Cap. 96, the Government may, with the approval of Parliament, guarantee the borrowing of\n\nsuch sums by a company from a lending agency as is authorised by the Government;\n\nAND  WHEREAS  Kensington  Oval  Management  Incorporated,  a  company\n\nincorporated  under  the  Companies  Act,  Cap.  308  is  a  company  controlled  by  the\n\nGovernment within the meaning of section 2 of the Guarantee of Loans (Companies) Act, Cap. 96;\n\nAND WHEREAS Kensington Oval Management Incorporated is seeking a loan in the\n\nsum of USD$25.0 million from African Export-Import Bank on the terms and conditions set out in the\n\nSchedule for the purpose of ﬁ nancing the rehabilitation and maintenance of sport infrastructures ahead\n\nof the 2024 Cricket World Cup which is being held between June 4th and June 30th, 2024 in Barbados;\n\nAND WHEREAS by virtue of section 4 of the Guarantee of Loans (Companies)\n\nAct, Cap. 96 the aggregate amount of all borrowings by companies that are guaranteed by the\n\nGovernment shall not exceed $1,000,000,000 without taking into account any amount in respect\n\nof interest, commission and any other expenses secured by the guarantees; and the Minister of\n\nFinance has certiﬁ ed that the aggregate amount of all borrowings guaranteed by the Government\n\nand any further borrowings does not exceed the limit;\n\n\f2\n\nBE  IT  RESOLVED  that  Parliament  approve  the  guarantee  by  the  Minister  of  Finance  of\n\nthe  payment  of  the  principal  sum  of  USD$25.0  million  and  interest  thereon  to  be  borrowed  by\n\nKensington  Oval  Management  Incorporated  from  African  Export-Import  Bank  on  the  terms  and\n\nconditions set out in the Schedule hereto.\n\nAPPROVED by the House of Assembly this            day of                               , Two\n\nThousand and twenty-three.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                          ,  Two\n\nThousand and twenty-three.\n\n   President\n\n\f3\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nKensington Oval Management Incorporated\n\nAfrican Export-Import Bank\n\nGovernment of Barbados\n\nUSD$25.0 million\n\nTo ﬁ nance the rehabilitation and maintenance of sport infrastructures\nahead of the 2024 Cricket World Cup which is being held between\nJune 4th and June 30th, 2024 in Barbados.\n\nBorrower:\n\nFacility:\n\nGuarantor:\n\nAmount:\n\nPurpose:\n\nTerm:\n\nSeven years from the ﬁ rst disbursement date\n\nMoratorium period:\n\nTwo years from the Facility's ﬁ rst disbursement date.\n\nRepayment:\n\nInterest:\n\nDefault interest:\n\nAvailability period:\n\nDrawdown:\n\nTen equal semi-annual instalments.\n\nSeven per cent payable June 30th and December 31st.\n\nTwo per cent per annum higher than the interest rate applicable for\nloans.\n\nThe Facility will be available for utilization for a period aligned to the\nconstruction period from Facility signature date.\n\nThe Facility may be drawn down in one or multiple amounts during the\navailability period subject to a minimum drawdown of US$5 million.\n\n\f4\n\nSCHEDULE - (Concl'd)\n\nTERMS AND CONDITIONS - (Concl'd)\n\nPrepayment:\n\nLoans may be prepaid after the last day of the availability period in\nwhole or in part on 14 business days' prior notice but, if in part, by a\nminimum of US$5 million.\n\nAny prepayment shall be made with accrued interest on the amount\nprepaid and, subject to breakage costs, without premium or penalty.\n\nAny amount prepaid may not be redrawn and shall be applied against\nscheduled repayments in inverse chronological order.\n\nCommitment charge:\n\n0.25 per cent per annum on undisbursed amount.\n\nUpfront advisory fee:\n\nOne per cent of the Facility Amount, that is USD$250,000.00 due on\nthe date of signature of the Facility Agreement.\n\nGoverning law:\n\nEnglish law including for any non-contractual obligations.\n\n\f5\n\nADDENDUM\n\nThis  Resolution  seeks  the  approval  of  Parliament  in  respect  of  a  guarantee  by\n\nthe Government, for the borrowing by Kensington Oval Management Incorporated of the sum\n\nof USD$25.0 million from African Export-Import Bank on the  terms and conditions set out in\n\nthe  Schedule  for  the  purpose  of  financing  the  rehabilitation  and  maintenance  of  sport\n\ninfrastructures  ahead  of  the  2024  Cricket  World  Cup  which  is  being  held  between  June  4th\n\nand June 30th, 2024 in Barbados.  The sum of USD$25.0 million is within the limit of the amount\n\nmentioned in the Guarantee of Loans (Companies) Act, Cap. 96.\n\n"
}