{
  "bill_id": 745,
  "slug": "resolution-re-latin-american-development-bank-series-c",
  "title": "Resolution Re. Latin American Development Bank Series C",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/7c6ae55b510e751e52b3017091b46461.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2023-09-23",
  "first_reading": "2023-10-25",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\nPARLIAMENT\nWHEREAS by section 4A(1) of the Latin American Development Bank Act, 2015 (Act 2015-24) the Government of Barbados may, in accordance with such terms and conditions as may be agreed upon between the Government and the Latin American Development Bank (Corporacion Andina de Fomento), subscribe to 1,080 additional Series “C” shares of Common Capital Stock in the Bank for a value of USD 14,200 each;\nAND WHEREAS by section 4A(2) of the Act, the Government may, subject to the approval of Parliament, subscribe to further additional shares of Common Capital Stock of the Bank;\nAND WHEREAS the Government considers it expedient to subscribe to 3,522 further additional Series “C” shares of Common Capital Stock of the Bank for a value of USD 14,200 each and a total value of USD 50,012,400 in order to increase the level of participation of Barbados in the ownership of the Bank and increase access to funding for sustainable development projects from USD 200,000,000 to USD 400,000,000;\nAND WHEREAS the subscription to 3,522 further additional Series “C” shares of Common Capital Stock of the Bank are on the terms and conditions contained in an Ordinary Capital Share Subscription Agreement, the main provisions of which are set out in the Schedule;\nBEIT RESOLVED therefore that Parliament approve the subscription to 3,522 further additional Series “C” shares of Common Capital Stock of the Bank for the value of USD 50,012,400.\nAPPROVED by the House of Assembly this\nday of\n, Two\nThousand and Twenty-three.\nSpeaker\nAPPROVED by the Senate this\nday of\nThousand and Twenty-three.\nPresident\n, Two\nBank:\nSubscriber:\nNumber and Type of Shares:\nShare Value:\nTotal Share Value:\nPayment Period:\nPayment Schedule:\nSCHEDULE\nTERMS AND CONDITIONS\nLatin American Development Bank (Corporacién Andina de Fomento)\nGovernment of Barbados\n3,522 Series “C” shares of Common Capital Stock\nUSD 14,200\nUSD 50,012,400\n3 years\nInstallment 1 - USD 16,670,800 comprising 1,174 Series “C” shares of\nCommon Capital Stock payable before November 30, 2023.\nInstallment 2 - USD 16,670,800 comprising 1,174 Series “C” shares of\nCommon Capital Stock payable before September 30, 2024.\nInstallment 3 - USD 16,670,800 comprising 1,174 Series “C” shares of\nCommon Capital Stock payable before September 30, 2025.\nADDENDUM\nThis Resolution seeks the approval of Parliament to approve the subscription to 3522 further additional Series \"C\" shares of Common Capital Stock of the Latin American Development Bank (Corporacién Andina de Formento) for the value of USD 50,012,400.\n"
}