{
  "bill_id": 747,
  "slug": "law-revision-and-law-reform-amendment-act-2024",
  "title": "Law Revision and Law Reform (Amendment) Act, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/59a1d1c64032f789b300fa63d70c394b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-02-07",
  "first_reading": "2024-02-07",
  "gazette_date": "2024-02-29",
  "markdown": "2023-09-26\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Law  Revision  and  Law  Reform  Act,  2019  (Act\n2019-6)  to  give  greater  independence  to  the  Law  Reform  Commission  in  its\noperations and for matters related thereto.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nInsertion of new section 28A into Act 2019–6\n\nRepeal and replacement of Part III of Act 2019-6\n\nRepeal section 35 of Act 2019–6\n\nConsequential amendments\n\nCommencement\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\nSCHEDULE\n\nCONSEQUENTIAL AMENDMENTS\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Law Revision and Law Reform Act, 2019 (Act 2019-6)\nto give greater independence to the Law Reform Commission in its operations\nand for matters related thereto.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n(Amendment) Act, 2024.\n\nThis  Act  may  be  cited  as  the  Law  Revision  and  Law  Reform\n\nInsertion of new section 28A into Act 2019–6\n\nThe Law Revision and Law Reform Act, 2019 (Act 2019 -6), in this\n2.\nAct  referred  to  as  the  principal  Act,  is  amended  by  inserting  the  following\nsection after section 28:\n\n“Expenses in relation to law revision\n\n28A.\nThe expenses incurred for the purposes of the revision of the\nlaw under this Act and generally in respect of the administration of this\nAct in relation to law revision, shall be paid out of such money as may\nbe voted for that purpose by Parliament.”.\n\nRepeal and replacement of Part III of Act 2019-6\n\n3.\n(Act 2019-6), is deleted and the following is substituted:\n\nPart  III  of  the  Law  Revision  and  Law  Reform  Act,  2019\n\n“PART III\n\nLAW REFORM\n\nEstablishment of Law Reform Commission\n\n29.(1)\n\nThere shall be a Law Reform Commission.\n\nThe  Law  Reform  Commission  is  a  body  corporate  to  which\n\n(2)\nsection 21 of the Interpretation Act, Cap. 1 applies.\n\n\f5\n\nPurpose of Law Reform Commission\n\n30.\nreform of the law in Barbados.\n\nThe purpose of the Law Reform Commission is to promote\n\nAppointment of members of the Law Reform Commission\n\nThe  Attorney  General  shall  by  instrument,  appoint  a\n31.(1)\nChairman and such other persons as appear to him be suitably qualified\npursuant to subsection (2) to be Law Reform Commissioners.\n\nA person appointed to be a Law Reform Commissioner under\n(2)\nsubsection (1) shall be a person who holds or has held high judicial\noffice  or  a  person  who  is  an  experienced  legal  practitioner  or  an\nexperienced teacher of law in a university.\n\nA Law Reform Commissioner shall be appointed for such period,\n(3)\nnot  exceeding  5  years,  and  on  such  terms  and  conditions,  including\ncompensation, as may be determined by the Attorney-General at the\ntime of his appointment.\n\nA Law Reform Commissioner may at any time resign his office\n(4)\nby notice in writing addressed to the Law Reform Commissioner and\nthat person who ceases to be a Commissioner shall be eligible for re-\nappointment.\n\nWhere a Law Reform Commissioner is unable to fully perform\n(5)\nhis functions, the Attorney-General may appoint another person to be\na Commissioner in his stead.\n\nThe  appointment  of  a  Judge  as  a  member  of  the  Law  Reform\n(6)\nCommission does not affect the Judge’s tenure of the judicial office and\nfor all purposes, the Judge’s service as a member shall be taken to be\nservice as a Judge.\n\n\f6\n\nFunctions of the Commission\n\n32.(1)\nThe Law Reform Commission shall systematically keep the\nlaw  under  review  for  the  purpose  of  developing,  modernizing  and\nsimplifying the law.\n\n(2)\n\nThe Law Reform Commission shall have the following powers:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nto receive and consider any suggestions or formal proposals\nfor  the  reform  of  the  law  which  may  be  made  to  the\nCommission;\n\nto prepare and submit to the Attorney-General from time to\ntime, programmes for the examination of different branches\nof the law with a view to reform, including recommendations\nas to whether such examination should be carried out by the\nCommission or some other body;\n\nto undertake pursuant to any recommendations approved by\nthe Attorney-General, the examination of particular branches\nof the law and the formulation of proposals for reform;\n\nto  Ministries  and  Departments  of\n\nto provide at the instance of the Attorney-General, advice and\nthe\ninformation\nGovernment and other authorities which are concerned with\nproposals for the amendment or reform of any branch of the\nlaw;\n\n(e)\n\nto obtain such information as to the laws and legal systems\nof  other  countries  as  appears  to  the  Commission  likely  to\nfacilitate the performance of any of its functions.\n\nIn the exercise of the functions specified under this Act, the Law\n(3)\nReform Commissioners shall be subject to the general direction of the\nAttorney-General.\n\n\f7\n\nDirector of the Law Reform Commission\n\n33.(1)\nThe Law Reform Commission shall, with the approval of the\nAttorney-General, appoint a Director of the Law Reform Commission\nfor a term not exceeding 3 years on such terms and conditions as the\nCommission may determine.\n\nThe Director of the Law Reform Commission shall perform the\n(2)\nfunctions conferred on him by this Act and such other functions as may\nbe conferred on him by the Law Reform Commission.\n\nThe Director of the Law Reform Commission is subject to the\n(3)\ndirections of the Law Reform Commission and is responsible to the\nCommission for the management of its day-to day operations.\n\nThe Law Reform Commission shall pay the Director of the Law\n(4)\nReform  Commission  such  remuneration  and  allowances  as  the\nCommission determines.\n\nStaff of the Law Reform Commission\n\n34.(1)\nThe Law Reform Commission may employ such staff as it\nconsiders necessary for the proper carrying into effect the provisions\nof this Act.\n\n(2)\n\nStaff of the Law Reform Commission shall be\n\n(a)\n\n(b)\n\nemployed on such terms and conditions; and\n\npaid such remuneration,\n\nas the Commission determines.\n\nPension rights and service\n\n34A.(1)\nSubject to sections (2) and (3), the employees of the Law\nReform Commission shall be granted pension and related emoluments\nunder the Pensions Act , Cap. 25 as if they were public officers.\n\n\f8\n\n(2)\n\nWhere\n\n(a)\n\n(b)\n\na public officer is transferred to an office in service of the\nLaw Reform Commission; or\n\nan officer of the Law Reform Commission is transferred to\nan office in the public service,\n\nthe Pensions Act, Cap. 25 shall apply to that officer as if that officer's\nservice with the Law Reform Commission were other public service\nwithin  the  meaning  of  that  Act,  and  the  Pensions  Regulations,\n1947 (1947-20) shall apply to that officer accordingly.\n\nExperts\n\nThe  Law  Reform  Commission  may  appoint  or  engage\n34B.(1)\npersons having special or technical knowledge to assist the Commission\nin carrying out its functions.\n\nA person engaged pursuant to subsection (1) shall receive such\n\n(2)\nremuneration as the Law Reform Commission determines.\n\nSpecialized committees\n\n34C.(1)\nIn performing any of its functions under section 32, the Law\nReform Commission may appoint committees to provide advice and\ninformation, and to consider and report on any matter referred to the\nCommission.\n\nIn  appointing  persons  as  members  of  a  committee  under\n(2)\nsubsection  (1),  the  Law  Reform  Commission  shall  not  restrict\nconsideration to members of the legal profession.\n\nPersons appointed to a committee under this section shall receive\n\n(3)\nsuch remuneration as the Commission determines.\n\n\f9\n\nLaw reform programme\n\nThe Chairman of the Law Reform Commission shall at the\n34D.\nbeginning of each year, prepare a programme for Law Reform for that\nyear and submit it to the Attorney-General no later than 31st January of\nthat year.\n\nSubmission of report by Law Reform Commission\n\n34E.(1)\nThe  Law  Reform  Commission  shall,  in  respect  of  every\ncalendar year, submit a report of its proceedings in respect of law reform\nto the Attorney-General.\n\nThe  Attorney-General  shall  cause  the  report  referred  to  in\n(2)\nsubsection (1) to be laid before Parliament with any comments he thinks\nfit.\n\nThe report referred to in subsection (1) shall be published by the\n(3)\nLaw Reform Commission after consultation with the Attorney-General.\n\nFunds of the Law Reform Commission\n\n34F.\nresources of which shall comprise of\n\nThere is established a Law Reform Commission Fund, the\n\n(a)\n\n(b)\n\nsuch amounts as may be voted for the purpose by Parliament;\n\nall other amounts which may become payable to or vested in\nthe  Commission  in  respect  of  any  matter  incidental  to  its\nfunctions; and\n\n(c)\n\nsuch  other  moneys  as  may  become  available  to  the\nCommission from any other source approved by the Minister.\n\n\f10\n\nApplication of funds\n\nThe resources of the Fund referred to in section 34F, shall\n34G.\nbe applied towards discharging the obligations and the performance of\nany function of the Law Reform Commission under this Act.\n\nAccounts and audit\n\nThe Law Reform Commissioner shall keep proper books of\n34H.\naccount  of  its  revenues,  expenditures,  assets  and  liabilities  and\nimplement  International  Accounting  Standards  and  practices  in\naccordance  with  the  accounting  standards  and  standing  instructions\nissued  by\nthe  Public  Finance\nManagement Act, 2019 (Act 2019-1).\n\nthe  Accountant-General  under\n\nFinancial reports\n\nThe Law Reform Commission shall submit such reports and\n34I.\ninformation as required by Part IX of the Public Finance Management\nAct, 2019 (Act 2019-1).\n\nInterpretation for the purposes of sections 34J and 34K\n\n34J.\nFor  the  purposes  of  sections  34J  and  34K,  “former\ncommission” means the Law Reform Commission established before\nthe commencement of this Part.\n\nTransfer of assets and liabilities\n\n34K.(1)\n\nAll\n\n(a)\n\nin\n\nthe\nassets  vested\ncommencement of this Part are transferred to and vested in;\nand\n\nthe  former  commission  before\n\n(b)\n\nliabilities  incurred  by  the  former  commission  before  the\ncommencement of this Part are transferred to,\n\n\f11\n\nthe Law Reform Commission to the same extent and interest and in the\nsame manner as they were vested in the former commission.\n\n(2)\nAll  contracts  entered  into  by  or  on  behalf  of  the  former\ncommission shall be deemed to have been entered into by or on behalf\nof the Law Reform Commission.\n\nAppointments\n\n34L.\nAll appointments made by the former commission before the\ncommencement  of  this  Part,  shall  be  deemed  to  have  been  made  on\nbehalf of the Law Reform Commission and shall continue to be of full\nforce and effect until the date fixed in the instrument for the termination\nof the appointments.”.\n\nRepeal section 35 of Act 2019–6\n\n4.\n\nSection 35 of the principal Act is repealed.\n\nConsequential amendments\n\n5.\nthe manner specified in Column 2 of the Schedule.\n\nThe enactments set out in Column 1 of the Schedule are amended in\n\nCommencement\n\n6.\nproclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f12\n\nSCHEDULE\n\nCONSEQUENTIAL AMENDMENTS\n\n(Section 6)\n\nColumn 1\n\nEnactments\n\nColumn 2\n\nAmendments\n\n1. Public Finance Management\n\nAct, 2019 (Act 2019-1)\n\nThe First Schedule is amended by inserting immediately\nafter paragraph 13A the following:\n\n\"13A. Law Reform Commission”.\n\n2. Statutory Boards (Pensions)\n\nAct, Cap. 384\n\nThe First Schedule is amended by inserting immediately\nafter paragraph 9 the following:\n\n\"9A. Law Reform Commission\n\nState Counsel\".\n\nThe Second Schedule is amended by inserting\nimmediately after paragraph 9 the following:\n\"9A. The Law Reform Commission (established by the\nLaw Revision and Law Reform Act, 2019 (Act\n2019-6).”.\n\n\f13\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}