{
  "bill_id": 749,
  "slug": "african-exportimport-bank-bill-2024",
  "title": "African Export-Import Bank Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b399a4a9b92433e88547d7a0f774bdb2.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-01-30",
  "first_reading": "2024-01-31",
  "gazette_date": "2024-01-29",
  "markdown": "2024/01/17\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the implementation of the\n\n(a)\n\n(b)\n\nAgreement for the Establishment of a Partnership between Member\nStates of the Community and the African Export-Import Bank; and\n\nAgreement  between  the  Government  of  Barbados  and  the  African\nExport-Import  Bank  concerning  the  location  of  the  Caribbean\nCommunity Office of the African Export-Import Bank.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\nShort title\n\nInterpretation\n\nPART II\n\nFINANCIAL PROVISIONS RELATING TO THE PARTNERSHIP\nAGREEMENT\n\nFinancial provisions giving effect to the Partnership Agreement\n\nBorrowing\n\nDesignation of depository\n\nCertain provisions of Partnership Agreement given the force of law\n\nPART III\n\nPROVISIONS RELATING TO THE CARIBBEAN COMMUNITY OFFICE\nOF THE BANK\n\n7.\n\nFinancial provisions giving effect to the Caribbean Community Office\nAgreement\n\n8.\n\nCaribbean Community Office Agreement has the force of law\n\n\f3\n\n9.\n\nExemption from the provisions of the Immigration Act, Cap. 190\n\n10.\n\nRegulations made by the bank to be gazetted\n\n11.\n\nOffence to contravene Bank’s regulations\n\nFIRST SCHEDULE\n\nAgreement between the Government of Barbados and the African Export-Import\nBank concerning the location of the Caribbean Community Office of the African\nExport-Import Bank\n\nSECOND SCHEDULE\n\nAgreement for the Establishment of a Partnership between Member States of the\nCommunity and the African Export-Import Bank\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the implementation of the\n\n(a)\n\n(b)\n\nAgreement for the Establishment of a Partnership between Member\nStates of the Community and the African Export-Import Bank; and\n\nAgreement  between  the  Government  of  Barbados  and  the  African\nExport-Import  Bank  concerning  the  location  of  the  Caribbean\nCommunity Office of the African Export-Import Bank.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the African Export-Import Bank Act, 2024.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Bank” means the African Export-Import Bank established by the Agreement\nestablishing  the  African  Export-Import  Bank  signed  in  Abidjan,  Cote\nd’Ivoire on the 8th day of May, 1993 attached as Annex I of the Partnership\nAgreement;\n\n“Caribbean Community Office Agreement” means the Agreement between the\nGovernment of Barbados and the African Export-Import Bank Concerning\nthe Location of the Caribbean Community Office of the African Export-\nImport Bank, the text of which is set out in the First Schedule;\n\n“Caribbean Community Office” has the meaning assigned to it in Article 1 (d)\n\nof the Caribbean Community Office Agreement;\n\n“Partnership  Agreement”  means  the  Agreement  for  the  Establishment  of  a\nPartnership  between  Member  States  of  the  Community  and  the  African\nExport-Import Bank signed by Barbados on the 1st day of September, 2022\nat  Bridgetown,  Barbados,  the  text  of  which  is  set  out  in  the  Second\nSchedule;\n\n\f7\n\nPART II\n\nFINANCIAL PROVISIONS RELATING TO THE PARTNERSHIP\nAGREEMENT\n\nFinancial provisions giving effect to the Partnership Agreement\n\nAll sums required to be paid by the Government for the purpose of\n3.(1)\nmeeting  the  obligations  of  Barbados  under  the  Bank  Agreement  are  hereby\ncharged on and shall be paid out of the Consolidated Fund.\n\nAny sums received by the Government from the Bank pursuant to the Bank\n\n(2)\nAgreement shall be paid into the Consolidated Fund.\n\nBorrowing\n\nThe Minister may borrow from any person any sum or sums required\n4.(1)\nfor  payments  under  section  3  or  for  replacing  any  sum  or  sums  paid  out  the\nConsolidated  Fund  pursuant  to  that  section,  and  for  the  purpose  of  such\nborrowing, may create and issue any securities bearing such rate of interest and\nsubject to such conditions as to repayment, redemption or otherwise, as he thinks\nfit.\n\nThe principal and interest of any securities issued under subsection (1) and\n(2)\nany expenses incurred in connection with their issue shall be charged on an paid\nout of the Consolidated Fund.\n\nAny moneys raised by securities issued under subsection (1) shall be paid\n\n(3)\ninto the Consolidated Fund.\n\nDesignation of depository\n\n5.\nassets of the Bank may be designated as agreed upon with the Bank.\n\nA depository for the holdings of the currency of Barbados and other\n\n\f8\n\nCertain provisions of Partnership Agreement given the force of law\n\n6.\nXIV of the Partnership Agreement shall have the force of law in Barbados.\n\nThe provisions of Articles II, V, VI, VII, VIII, IX, X, XI, XII, XIII,\n\nPART III\n\nPROVISIONS RELATING TO THE CARIBBEAN COMMUNITY OFFICE\nOF THE BANK\n\nFinancial provisions giving effect to the Caribbean Community Office\nAgreement\n\nAll sums required to be paid by the Government for the purpose of\n7.\nmeeting  the  obligations  of  Barbados  under  the  Caribbean  Community  Office\nAgreement are hereby charged on and shall be paid out of the Consolidated Fund.\n\nCaribbean Community Office Agreement has the force of law\n\n8.\nin Barbados.\n\nThe Caribbean Community Office Agreement shall have force of law\n\nExemption from the provisions of the Immigration Act, Cap. 190\n\n9.\nNothing contained in the Immigration Act, Cap. 190 shall apply to the\npersons mentioned in Parts IX, X, XI, XII of the Caribbean Community Office\nAgreement have effect in relation to such persons as so to\n\n(a)\n\n(b)\n\n(c)\n\nrestrict their entry into Barbados;\n\nregulate the conditions of their stay in Barbados ; or\n\nprevent the entry into or require the removal from Barbados of any such\nperson  by  reason  of  any  activity  performed  by  such  person  in  his\nofficial capacity with respect to the Bank.\n\n\f9\n\nRegulations made by the bank to be gazetted\n\n10.(1)\nAll regulations made by the Bank pursuant to Bank to Article V of the\nCaribbean Community Office Agreement shall, as soon as possible after being\nmade, be published in the Official Gazette and on such publication shall come\ninto operation and have the force of law.\n\nAll such regulations shall be statutory instruments for the purposes of the\n\n(2)\nInterpretation Act, Cap. 1.\n\nOffence to contravene Bank’s regulations\n\nA person who contravenes any of the provisions of regulations made\n11.\nby the Bank pursuant to Article V of the Caribbean Community Office Agreement\nis guilty of an offence and, on summary conviction thereof, is liable to a fine of\n$2 000 or imprisonment for a term of 12 months or to both.\n\n\f10\n\nL.R.O. 1998FIRST SCHEDULE(Section 2)Agreement between the Government of Barbados andthe African Export-Import Bankconcerning the location of the Caribbean Community Oﬃ  ceof the African Export-Import Bank\f11\n\nL.R.O. 1998First Schedule - (Cont'd)\f12\n\nL.R.O. 1998First Schedule - (Cont'd)\f13\n\nL.R.O. 1998First Schedule - (Cont'd)\f14\n\nL.R.O. 1998First Schedule - (Cont'd)\f15\n\nL.R.O. 1998First Schedule - (Cont'd)\f16\n\nL.R.O. 1998First Schedule - (Cont'd)\f17\n\nL.R.O. 1998First Schedule - (Cont'd)\f18\n\nL.R.O. 1998First Schedule - (Cont'd)\f19\n\nL.R.O. 1998First Schedule - (Cont'd)\f20\n\nL.R.O. 1998First Schedule - (Cont'd)\f21\n\nL.R.O. 1998First Schedule - (Cont'd)\f22\n\nL.R.O. 1998First Schedule - (Cont'd)\f23\n\nL.R.O. 1998First Schedule - (Cont'd)\f24\n\nL.R.O. 1998First Schedule - (Concl'd)\f25\n\n L.R.O. 1998SECOND SCHEDULE(Section 2)Agreement for the Establishment of a Partnership between Member States of the Community and the African Export-Import Bank\f26\n\nL.R.O. 1998Second Schedule - (Cont'd)\f27\n\nL.R.O. 1998Second Schedule - (Cont'd)\f28\n\nL.R.O. 1998Second Schedule - (Cont'd)\f29\n\nL.R.O. 1998Second Schedule - (Cont'd)\f30\n\nL.R.O. 1998Second Schedule - (Cont'd)\f31\n\nL.R.O. 1998Second Schedule - (Cont'd)\f32\n\nL.R.O. 1998Second Schedule - (Cont'd)\f33\n\nL.R.O. 1998Second Schedule - (Cont'd)\f34\n\nL.R.O. 1998Second Schedule - (Cont'd)\f35\n\nL.R.O. 1998Second Schedule - (Cont'd)\f36\n\nL.R.O. 1998Second Schedule - (Cont'd)\f37\n\nL.R.O. 1998Second Schedule - (Cont'd)\f38\n\nL.R.O. 1998Second Schedule - (Cont'd)\f39\n\nL.R.O. 1998Second Schedule - (Cont'd)\f40\n\nL.R.O. 1998Second Schedule - (Cont'd)\f41\n\nL.R.O. 1998Second Schedule - (Cont'd)\f42\n\nL.R.O. 1998Second Schedule - (Concl'd)\f43\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}