{
  "bill_id": 74,
  "slug": "statistics-amendment-bill-2015",
  "title": "Statistics (Amendment) Bill, 2015",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/9300e40b292724f7b66fbcaf47df1a58.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2015-02-03",
  "first_reading": "2015-02-10",
  "second_reading": null,
  "gazette_date": "2015-02-23",
  "passed_date": null,
  "markdown": "Explanatory Memo at page 7\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Statistics Act, Cap. 192 to clarify the functions of\n\nthe Statistical Services Department and to provide for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of section 3 of Cap. 192\n\nAmendment of section 4 of Cap. 192\n\nAmendment of section 9 of Cap. 192\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Statistics Act.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Statistics (Amendment) Act, 2015.\n\n\f4\n\nAmendment of section 3 of Cap. 192\n\n2.\nAct, is deleted and the following is substituted:\n\nSection 3 of the Statistics Act, in this Act referred to as the principal\n\n“Functions of the Statistical Service\n\n3.\nService the duties of which shall be\n\nFor  the  purposes  of  this  Act,  there  shall  be  a  Statistical\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nto take any census in Barbados;\n\nto divide the parishes of Barbados into such smaller units as\nmay be required to facilitate the collection of data for any\ncensus in Barbados;\n\nto collect, compile, analyse, abstract, and publish statistical\ninformation  relating  to  the  social,  agricultural,  mining,\ncommercial, industrial, general activities and conditions of\nthe inhabitants of Barbados;\n\nto  collaborate  with  departments  of  Government  in  the\ncollection, compilation, analysis and publication of statistical\nrecords of the data related to the operation and administration\nof the departments of government; and\n\n(e)\n\nto  organise  a  co-ordinated  scheme  of  social  and  economic\nstatistics relating to Barbados.”.\n\nAmendment of section 4 of Cap. 192\n\n3.\nsubstituted :\n\nSection  4  of  the  principal  Act  is  deleted  and  the  following  is\n\n\f5\n\n“Delegation of the functions of the Director\n\n4.(1)\nThere shall be a Director of Statistical Service for the proper\nadministration of the provisions of this Act, and to provide for related\nmatters.\n\nThe Director may delegate in writing his powers and functions\n\n(2)\nunder this Act.\n\nThe  Director  may  appoint  such  suitable  persons  as  may  seem\n(3)\nnecessary to assist with the collection of data, and the administration\nof the Act.”.\n\nAmendment of section 9 of Cap. 192\n\n4.\nand substituting the following:\n\nSection 9 of the principal Act is amended by deleting subsection (3)\n\nNotwithstanding subsection (l), the Chief Electoral Officer may,\n“(3)\nin order to perform his functions under the Representation of the People\nAct, Cap. 12 and the National Registration Act, 2015 have access to the\ninformation obtained in any census.”.\n\n\f6\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2015.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2015.\n\nPresident\n\n\f   7\n\nSTATISTICS (AMENDMENT) ACT, 2015\n\nEXPLANATORY MEMORANDUM\n\nThe  Statistics  (Amendment)  Act,  2015  would  amend  the  Statistics  Act,\n\nCap. 192 to clarify the functions of the Statistical Services Department.\n\nClause 1:\n\nprovides for the short title of the Act.\n\nClause 2:\n\nClause 3:\n\nClause 4:\n\nrepeals  and  replaces  section  3  to  clarify  the  duties  of  the\nStatistical  Service  and  to  include  the  power  to  divide  the\nparishes of Barbados into smaller units whenever this may be\nrequired  for  the  collection  of  data  for  the  purposes  of  any\ncensus in Barbados.\n\nrepeals and replaces section 4 to ensure that the Director of\nStatistical  Service  is  allowed  to  delegate  his  powers  and\nfunctions under the Statistics Act, Cap. 192 by an instrument\nin writing, as well as to provide for the Director to be allowed\nto  appoint  suitable  persons  as  necessary  to  assist  with  the\nadministration of that Act.\n\nrepeals and replaces subsection (3) of section 9 to allow the\nChief Electoral Officer access to information obtained in any\ncensus  in  order  to  perform  his  functions  under  the\nRepresentation of the People Act, Cap. 12 and the National\nRegistration Act, 2015. (Act 2015 -)\n\ni\n\n"
}