{
  "bill_id": 750,
  "slug": "facilitation-of-international-maritime-traffic-bill-2024",
  "title": "Facilitation of International Maritime Traffic Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/826917e9037cceb4cbb5c7d90bef43e1.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-01-24",
  "first_reading": "2024-01-31",
  "gazette_date": null,
  "markdown": "2023-12-08\n\nOBJECTS AND REASONS\n\nThis  Bill  would  implement  the  Convention  on  Facilitation  of  International\n\nMaritime Traffic\n\n(a)\n\nto  make  provision  for  the  electronic  transmission  and  exchange  of\ninformation  in  order  to  facilitate  and  expedite  the  clearance  of\ninternational maritime traffic;\n\n(b)\n\nto create an enabling environment for a port community system; and\n\n(c)\n\nto provide for related matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nInterpretation\n\nConvention to have force of law\n\nApplication of Act\n\nAct to bind State\n\nPART II\n\nADMINISTRATION\n\nEstablishment of National Maritime Transport Facilitation Programme\n\nEstablishment of National Maritime Transport Facilitation Committee\n\nFunctions of Committee\n\nFunctions of Barbados Port Inc.\n\nPART III\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nARRIVAL, STAY AND DEPARTURE OF SHIPS\n\n10.\n\nEstablishment of Barbados Maritime Single Window\n\n11.\n\nProcedure for submitting documents\n\n\f3\n\n12.\n\nDocuments pre-arrival\n\n13.\n\nClearance of ship pre-arrival\n\n14.\n\nAmendment of documents on arrival\n\n15.\n\nShip arriving for medical emergency\n\n16.\n\nDocuments pre-departure\n\n17.\n\nClearance of ship pre-departure\n\n18.\n\nFailure to submit pre-arrival and pre-departure documents\n\n19.\n\nRequest for additional documents\n\n20.\n\nDocuments to be signed\n\n21.\n\nCorrection of errors\n\nPART IV\n\nARRIVAL AND DEPARTURE OF CRUISE SHIPS\n\n22.\n\nArrival of a cruise ship\n\n23.\n\nDocuments pre-arrival of a cruise ship\n\n24.\n\nDocuments on departure of a cruise ship\n\n25.\n\nClearance of cruise ship for departure\n\n\f4\n\nPART V\n\nARRIVAL AND DEPARTURE OF PASSENGERS AND CREW MEMBERS\n\n26.\n\nFinal Certificate of Clearance to be issued before disembarking ship\n\n27.\n\nDocuments required from passengers on arrival\n\n28.\n\nDocuments required from crew members on arrival\n\n29.\n\nPassengers and crew members arriving without documents\n\n30.\n\nShore Leave\n\n31.\n\nDocuments required from passengers and crew members on departure\n\n32.\n\nImproper documents\n\nPART VI\n\nSTOWAWAYS\n\n33.\n\nIncidences of stowaways and attempted stowaways to be reported\n\n34.\n\nShip owner to defray cost of maintaining stowaway\n\n35.\n\nTreatment of stowaways\n\nPART VII\n\nPORT STATE CONTROL INSPECTIONS\n\n36.\n\nInterpretation\n\n37.\n\nPort state control inspections\n\n\f5\n\n38.\n\nInspection results\n\n39.\n\nDetention of vessel\n\n40.\n\nRelease of vessel\n\n41.\n\nApplication to cruise ships\n\nPART VIII\n\nOFFENCES AND PENALTIES\n\n42.\n\nOffences relating to the submission of false documents\n\nPART IX\n\nMISCELLANEOUS\n\n43.\n\nMaritime Trade Facilitation Directives\n\n44.\n\nConfidentialty of data\n\n45.\n\nRetention of records\n\n46.\n\nSettlement of disputes\n\n47.\n\nConflict\n\n48.\n\nException to electronic submission of documents\n\n49.\n\nRegulations\n\n50.\n\nAmendment of Schedules\n\n51.\n\nConsequential amendments\n\n\f6\n\n52.\n\nRepeal\n\n\f7\n\nFIRST SCHEDULE\n\nNational Maritime Transport Facilitation Committee\n\nSECOND SCHEDULE\n\n1965 Convention on Facilitation Of International Maritime Traffic (FAL 1965)\n\nTHIRD SCHEDULE\n\nPre-arrival Documents\n\nFOURTH SCHEDULE\n\nDocuments relating to Stowaways\n\nFIFTH SCHEDULE\n\nList of officers to whom pre-arrival and pre-departure documents to be submitted\n\nSIXTH SCHEDULE\n\nCertificates of Clearance on Pre-Arrival and Arrival\n\nSEVENTH SCHEDULE\n\nForm of Notice of Intended Departure\n\nEIGHTH SCHEDULE\n\nCertificates of Clearance on Departure\n\nNINTH SCHEDULE\n\nList of officers to whom fines are to be paid for outstanding pre-arrival and pre-\ndeparture documents\n\n\f8\n\nTENTH SCHEDULE\n\nConsequential Amendments\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the implementation of the Convention on Facilitation\nof  International  Maritime  Traffic  to  make  provision  for  the  electronic\ntransmission and exchange of information in order to facilitate and expedite\nthe clearance of international maritime traffic; the establishment of an enabling\nenvironment for a port community system; and for related purposes.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f10\n\nShort title\n\n1.\nTraffic Act, 2024.\n\nThis Act may be cited as the Facilitation of International Maritime\n\nInterpretation\n\n2.(1)\n\nIn this Act,\n\n“advance cargo information” means a manifest, an airway bill, a bill of lading,\n\ninformation or data in respect of\n\n(a)\n\n(b)\n\ncargo  and  stores  including  all  imports,  exports  in  transit  and\ntransshipment of goods; or\n\nany package of which there is no bill of lading or airway bill on board\na ship;\n\n“advance  passenger  information”  means  the  information  in  respect  of  a\n\npassenger, crew member or other person transported in a ship;\n\n“attempted stowaway” means a person who is\n\n(a)\n\nsecreted on a ship, or in cargo which is subsequently loaded on the ship,\nwithout the consent of the shipowner or master; and\n\n(b)\n\ndetected on board the ship before it has departed from the port;\n\n“Barbados  Maritime  Single  Window”  means  the  national  single  service\nenvironment managed by the Barbados Port Inc., that covers maritime and\nport  administrative  procedures  for  the  purpose  of  clearing  vessels  in\nBarbados;\n\n“Barbados Maritime Transport Administration” or “Administration” means the\ndivision  within  the  Ministry  responsible  for  shipping  concerned  with\nmaritime transport affairs;\n\n“CARICOM Electronic Single Window” or CARICOM Single Window means\nthe  regional  single  service  environment  managed  by  the  JRCC  through\n\n\f11\n\nwhich maritime trade information, other than customs related information,\nis submitted;\n\n“clearance” means the process of obtaining the necessary permissions to facilitate\n\nthe clearance of a ship in Barbados\n\n(a)\n\n(b)\n\n(c)\n\nto enter or leave;\n\nto berth;\n\nto leave berth;\n\n(d)\n\nto embark or disembark passengers;\n\n(e)\n\nto import and export cargo; or\n\n(f)\n\nto complete any other ship-related activity;\n\n“coastal state” means a sovereign state that is not land locked and has territory\nconnected to the ocean or whose coastlines lie on exorheic basins which\nnaturally externally drain into rivers or oceans;\n\n“Committee”  means  the  National  Maritime  Transport  Facilitation  Committee\n\nestablished under section 7;\n\n“Convention”  means  the  International  Maritime  Organization  Convention  on\n\nFacilitation of International Maritime Traffic, 1965\n\n(a)\n\n(b)\n\nthe text of which is set out in the Second Schedule; and\n\nto which Barbados is a party;\n\n“cruise  ship”  means  a  ship  on  an  international  voyage  carrying  passengers\nparticipating in a group programme and accommodated on board for the\npurpose of making scheduled temporary tourist visits at one or more ports,\nand which during the voyage does not normally\n\n(a)\n\n(b)\n\nembark or disembark any other passengers; or\n\nload or discharge any cargo;\n\n\f12\n\n“customs  officer”  means  a  customs  officer  appointed  under  section  13  of  the\nPublic  Service  Act,  Cap.  29  and  includes  the  Comptroller  of  Customs,  a\nDeputy Comptroller of Customs, an Assistant Comptroller of Customs and\na Customs Guard;\n\n“document” includes information presenting data by electronic means or by non-\n\nelectronic means;\n\n“designated lead port state control officer” means the officer designated by the\nBarbados Maritime Transport Administration to lead on port state control\ninspections on the behalf of the Administration;\n\n“domestic  space”  means  the  countries  of  Anguilla,  Antigua  and  Barbuda,\nBahamas,  Belize,  Bermuda,  British  Virgin  Islands,  Cayman  Islands,\nDominica,  Grenada,  Guyana,  Haiti,  Jamaica,  Montserrat,  St.  Kitts  and\nNevis, St. Lucia, St. Vincent and the Grenadines, Suriname, Trinidad and\nTobago, Turks and Caicos Islands and any other country so designated under\nan enactment governing the customs system in Barbados;\n\n“free pratique” means permission for a ship\n\n(a)\n\n(b)\n\n(c)\n\nto enter a port;\n\nto embark or disembark passengers; or\n\nto discharge or load cargo or stores;\n\n“goods” means tangible products and includes animals and plants transported on\n\nan international voyage or for utilization on board a ship;\n\n“immigration officer” means an immigration officer appointed under section 13\nof  the  Public  Service  Act,  Cap.  29  and  includes  the  Chief  Immigration\nOfficer,  the  Deputy  Chief  Immigration  Officer,  an  Assistant  Chief\nImmigration Officer and a Senior Immigration Officer;\n\n“IMPACS” means the CARICOM Implementing Agency for Crime and Security\nthe  CARICOM\n\nestablished  under\nthe  Agreement  Establishing\nImplementation Agency for Crime and Security, 2006;\n\n\f13\n\n“International Health Regulations” means the regulations adopted by the World\nHealth Assembly on the 23rd May, 2005 which entered into force on the\n15th June, 2007 to which Barbados is a party;\n\n“JRCC” means the Joint Regional Communication Centre which is a sub-agency\nof  IMPACS  which  receives  advance  passenger  information  data  and\nadvance cargo information data;\n\n“maritime autonomous surface ship” means a ship which to a varying degree can\n\noperate independently of human interaction;\n\n“MARPOL” means the International Convention for the Prevention of Pollution\n\nfrom Ships, 1973 to which Barbados is a party;\n\n“master” means the person having command of a ship;\n\n“Minister” means the Minister responsible for Maritime Affairs;\n\n“non-coastal state” means a land locked state whose territory is not connected to\nthe ocean or whose coastlines lie on endorheic basins which internally drain\ninto lakes or swamps, and allows no natural outflow to rivers or oceans;\n\n“passenger ship” means a ship which carries more than 12 passengers;\n\n“passport” means a valid passport referring to the person producing the same,\nfurnished with a photograph of that person and duly issued to him by or on\nbehalf of the Government of the country of which he is a subject or citizen\nand for a period which, according to the law in force in that country, has not\nexpired, and includes a travel permit or other document establishing to the\nsatisfaction  of  an  immigration  officer  the  nationality  and  identity  of  the\nperson to whom it refers;\n\n“Port” means the Port of Bridgetown as described in the First Schedule to the\nBarbados Port Inc. (Transfer of Management and Vesting of Assets) Act,\nCap. 285B;\n\n“port”  includes  any  port,  terminal,  offshore  terminal,  ship  and  repair  yard  or\nroadstead  which  is  normally  used  for  the  loading,  unloading,  repair  and\nanchoring of ships or any other place at which a ship can call;\n\n\f14\n\n“port state control inspection” mean the inspection of a foreign vessel to verify\nthat the condition of the vessel and its equipment comply with international\nrequirements related to maritime safety, maritime labour safety, maritime\nsecurity and marine environmental protection;\n\n“Programme” means the National Maritime Transport Facilitation Programme\n\nestablished under section 5;\n\n“public health risk” means a likelihood of an event that may affect adversely the\nhealth of human populations with an emphasis on one which may spread\ninternationally or may present a serious and direct danger;\n\n“Seafarers’  Identity  Document”  means  the  form  of  identification  issued  to  a\nseafarer for the purpose of the Seafarers’ Identity Documents Convention,\n(Revised) 2003, ILO Convention No. 185, to which Barbados is a party;\n\n“ship” means a vessel which is designed, used or capable of being used solely or\npartly  for  navigation  in,  on,  through,  or  immediately  above  the  water,\nwithout  regard  to  method  or  lack  of  propulsion  and  includes  a  maritime\nautonomous surface ship;\n\n“ship agent” means\n\n(a)\n\n(b)\n\nthe party representing the owner of the ship; or\n\nthe charterer in port;\n\n“ship  owner”  means  a  person  who  owns  or  operates  a  ship  and  includes  any\nperson other than the ship agent acting on the behalf of the owner or the\noperator;\n\n“ship document” includes certificates and other documents which must be made\navailable by the master of the ship in order to demonstrate that the ship is\nin compliance with national and international regulations;\n\n“ship equipment” includes articles, other than the spare part of the ship, that are\non board a ship for use on the ship and which are removable but not of a\nconsumable  nature,  including  accessories  such  as  life  boats,  life-saving\ndevices, furniture, ship apparel and similar items;\n\n\f15\n\n“ship  spare  parts”  includes  articles  of  a  repair  or  replacement  nature  for\n\nincorporation into the ship in which they are carried;\n\n“ship stores” includes goods that are to be used in the ship, including consumable\ngoods,  goods  carried  for  sale  to  passengers  and  crew  members,  fuel  and\nlubricants but does not include ship equipment and ship spare parts;\n\n“shore leave” means permission for a crew member to go ashore during the stay\nof a ship in port within such geographical or time limits, if any, as may be\ndecided by the public authorities;\n\n“signature”or  “signed”  includes  any  symbol  executed  or  adopted,  or  any\nmethodology  or  procedure  employed  or  adopted  by  a  person  with  the\nintention  of  authenticating  a  record,  including  electronic  or  digital\nmethods;\n\n“SOLAS” means the International Convention for Safety of Life at Sea, 1974 to\n\nwhich Barbados is a party;\n\n“STCW”  means  the  International  Convention  on  Standards  of  Training,\nCertification and Watch keeping for Seafarers, 1978 to which Barbados is\na party;\n\n“stowaway” means a person who\n\n(a)\n\n(b)\n\nis secreted on a ship, or in cargo which is subsequently loaded on the\nship without the consent of the ship owner or master;\n\nis detected on board the ship after it has departed from a port, or in the\ncargo while unloading it in the port of arrival; and\n\n(c)\n\nis reported as a stowaway by the master to the appropriate authorities.\n\n(2)\n\nIn this Act, “Annex” shall be construed as a reference\n\n(a)\n\n(b)\n\nto the Annex to the Convention as modified from time to time; or\n\nwhere the Annex is replaced by an instrument, to that instrument.\n\n\f16\n\n(3)\n\nFor the purposes of subsection (2), the Annex is modified where\n\n(a)\n\n(b)\n\nomissions,  additions  or  other  alterations  to  the  text  take  effect  in\naccordance with Article VII of the Convention; or\n\na supplementary provision made under Article VII of the Convention\ntakes effect.\n\nA  modification  or  replacement  of  the  Annex  shall  come  into  force  in\n\n(4)\naccordance with Article VII(3) of the Convention.\n\nConvention to have force of law\n\n3.(1)\nwith the exception of standard 7.4, shall have the force of law in Barbados.\n\nSubject to this Act, the Convention set out in the Second Schedule,\n\nIn the event of any inconsistency between this Act and the Convention, the\n\n(2)\nConvention shall prevail to the extent of the inconsistency.\n\nApplication of Act\n\n4.\nThis Act shall apply to all passenger vessels and cargo vessels from\ncoastal  and  non-coastal  states,  the  governments  of  which  are  party  to  the\nConvention.\n\nAct to bind State\n\n5.\n\nThis Act shall bind the State.\n\n\f17\n\nPART II\n\nADMINISTRATION\n\nEstablishment of National Maritime Transport Facilitation\nProgramme\n\nThere  is  established  a  Programme  to  be  known  as  the  National\n6.(1)\nMaritime Transport Facilitation Programme for the adoption of measures under\nthe Convention to facilitate and expedite the clearance of international maritime\ntraffic which arrives at and departs from the Port.\n\n(2)\n\nThe Programme shall\n\n(a)\n\nset  the  standards  for  the  formalities,  documentary  requirements  and\nprocedures which should be applied on the arrival, stay and departure\nof a ship entering or leaving the Port, in relation to:\n\n(i)\n\nthe ship;\n\n(ii)\n\nthe crew and passengers;\n\n(iii)\n\nbaggage and cargo;\n\n(iv)\n\nfreight containers;\n\n(v)\n\ngoods;\n\n(vi)\n\npostal parcels; and\n\n(vii)\n\nhuman remains;\n\n(b)\n\nharmonize the formalities, documentary requirements and procedures\nset  out  in  the  Health  Services  Act,  Cap.  44,  the  Quarantine  Act,\nCap. 53, the Quarantine (Maritime) Regulations (S.I. 1947 No. 38) and\nany enactments governing the customs system and immigration system\nin Barbados with the standards set out under paragraph (a) for the safe\narrival, stay and departure of a ship into and from the Port;\n\n\f18\n\n(c)\n\ncreate a paperless system for the exchange of information, including\nthe  electronic  data  interchange  for  the  transmission  of  information\nrelating to maritime transport; and\n\n(d)\n\nprevent unnecessary delays to ships, persons and property on board\nships while in the Port.\n\nEstablishment of National Maritime Transport Facilitation\nCommittee\n\n7.(1)\nTransport Facilitation Committee.\n\nThere is established a committee to be known as the National Maritime\n\nThe Committee shall develop the Programme established under section 6\n(2)\nto facilitate and expedite the clearance of international maritime traffic which\narrives at and departs from the Port.\n\nThe  Committee  shall  submit  reports  to  the  Chief  Executive  Officer  of\n\n(3)\nBarbados Port Inc. every two years.\n\nThe First Schedule shall have effect with respect to the constitution of the\n\n(4)\nCommittee and otherwise in relation thereto.\n\nFunctions of Committee\n\n8.\n\nThe functions of the Committee are as follows:\n\n(a)\n\n(b)\n\n(c)\n\nto  implement  and  enforce  national  policies  and  enactments  on  the\nfacilitation  of  international  maritime  traffic  in  accordance  with  the\nProgramme established under section 6;\n\nto develop and maintain technological and administrative systems to\nsupport a Barbados Maritime Single Window;\n\nto  supervise  and  regulate  the  operations  of  the  Barbados  Maritime\nSingle Window in accordance with international best practices;\n\n(d)\n\nto advise the Minister on matters relating to this Act; and\n\n\f19\n\n(e)\n\nto do such other things as are necessary to effectively carry out the\npurposes of this Act.\n\nFunctions of Barbados Port Inc.\n\n9.(1)\nand expedite the clearance of international maritime traffic by\n\nThe Barbados Port Inc. shall implement the Programme to facilitate\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nestablishing and upgrading from time to time a maritime single window\nat the Port;\n\nestablishing  and  maintaining  a  monitoring,  review  and  evaluation\nmechanism  to  ensure  that  procedures  are  simplified  and  that\nadministrative burdens are reduced for ships engaged in international\nvoyages, arriving to, staying in and departing from the Port;\n\napplying the principles of efficiency, security and convenience;\n\ntreating  humanely  and  protecting  passengers,  crew,  seafarers  and\nstowaways who are on board a ship engaged in an international voyage\narriving to, staying in and departing from the Port;\n\nproviding training for port authorities to operate the maritime single\nwindow to ensure that international ships comply with the requirements\nunder this Act;\n\n(f)\n\ndeveloping and implementing a port community system development\nand management plan\n\n(i)\n\nto  connect  and  continuously  maintain  the  multiple  systems\noperated by the various entities within the port community system;\n\n(ii)\n\nto continuously facilitate and improve trade and commerce; and\n\n(g)\n\nto do such other things as are necessary to effectively carry out the\npurposes of this Act.\n\n\f20\n\nThe port community system development and management plan referred\n\n(2)\nto subsection (1)(f)\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nshall  be  developed  and  implemented,  subject  to  the  approval  of  the\nMinister, within 2 years after the coming into force of this Act;\n\nshall not take effect until notice of the approval of the plan is published\nin the Official Gazette;\n\nshall be reviewed no later than 5 years after notice of its approval is\npublished in the Official Gazette;\n\nmay be withdrawn where the Minister, after consultation with the Chief\nExecutive Officer of the Barbados Port Inc., considers it necessary to\ndo  so  and  the  plan  shall  cease  to  have  effect  when  notice  of  its\nwithdrawal is published in the Official Gazette;\n\nshall, where withdrawn under paragraph (d), be replaced with a new\nplan subject to the approval of the Minister and to publication in the\nOfficial Gazette.\n\nThe Chief Executive Officer of the Barbados Port Inc. shall be responsible\n\n(3)\nfor the general administration of this Act.\n\nPART III\n\nARRIVAL, STAY AND DEPARTURE OF SHIPS\n\nEstablishment of Barbados Maritime Single Window\n\n10.\nThere is established a maritime single window for Barbados, to be\nknown as the Barbados Maritime Single Window, to facilitate and expedite the\nclearance of international maritime traffic which arrives in Barbados from a port\noutside Barbados or departs from Barbados for a port outside Barbados.\n\n\f21\n\nProcedure for submitting documents\n\n11.(1)\nelectronic format, correct in all particulars,\n\nThe ship owner, ship agent or master of every ship shall submit in an\n\n(a)\n\nto the Chief Operations Officer of the JRCC through the CARICOM\nSingle  Window  all  documents,  except  documents  referred  to  in\nparagraph (b) and (c) relating to\n\n(i)\n\nthe arrival and stay of a ship in Barbados; and\n\n(ii)\n\nthe departure of a ship from Barbados;\n\n(b)\n\n(c)\n\nthe  Comptroller  of  Customs\n\nto\nManagement ASYCUDA all documents related to customs; and\n\nthrough  Electronic  Manifest\n\nto the designated lead port state control officer through the Barbados\nMaritime Single Window all documents relating to port state control\ninspections.\n\nAll documents submitted under subsection (1) shall be signed and dated\n\n(2)\nby\n\n(a)\n\n(b)\n\n(c)\n\nthe ship owner, ship agent or master;\n\na person authorized by the ship owner; or\n\na  person  approved  by  the  Chief  Executive  Officer  of  the  Port,\nComptroller  of  Customs,  Chief  Immigration  Officer,  Chief  Medical\nOfficer,  Chief  Environmental  Health  Officer  or  Chief  Agricultural\nOfficer, as the case may be.\n\nAll documents submitted under subsection (1)(a) and (b) shall thereafter\n(3)\nbe submitted to the Barbados Maritime Single Window by the Chief Operations\nOfficer of the JRCC and the Comptroller of Customs, as the case may be, as\nfollows:\n\n(a)\n\ndocuments related to immigration, to the Chief Immigration Officer;\n\n\f22\n\n(b)\n\n(c)\n\n(d)\n\ndocuments related to the health of passengers and crew, to the Chief\nMedical Officer;\n\ndocuments  related  to  the  sanitary  health  of  the  ship,  to  the  Chief\nEnvironmental Health Officer; and\n\ndocuments related to phytosanitary health and agriculture generally to\nthe Chief Agricultural Officer.\n\nDocuments pre-arrival\n\nThe ship owner, ship agent or master of every ship which intends to\n12.(1)\ncome to Barbados from a port outside Barbados and proposing to call at the Port\nshall submit the following documents\n\n(a)\n\nin the form set out in the Convention in the Second Schedule through\nthe CARICOM Single Window\n\n(i)\n\n(ii)\n\na General Declaration set out in Form 1;\n\na Cargo Declaration set out in Form 2 or a copy of the ship’s\nmanifest where the manifest contains the information required in\nthe Cargo Declaration;\n\n(iii)\n\na Ship’s Stores Declaration set out in Form 3;\n\n(iv)\n\na Crew’s Effects Declaration set out in Form 4;\n\n(v)\n\na Crew List set out in Form 5;\n\n(vi)\n\na Passenger List set out in Form 6, or a list compiled by the owner\nof  the  ship  if  that  list  contains  the  information  required  in  the\nPassenger List;\n\n(vii)\n\na Dangerous Goods Manifest set out in Form 7;\n\n(b)\n\nin  the  form  set  out  in  Part  A  of  the  Third  Schedule  through  the\nCARICOM Single Window\n\n(i)\n\nAdvanced  Notification  Form  for  Waste  Delivery  to  Port\nReception Facilities set out in Form 1;\n\n\f23\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\n(vi)\n\na List of Ports of Call set out in Form 2;\n\na Maritime Declaration of Health set out in Form 3;\n\nan  International  Certificate  of  Vaccination  or  Prophylaxis  set\nout in Form 4;\n\na Yellow Fever Vaccination List set out in Form 5;\n\nSecurity-related\nregulation XI-2/9.2 set out in Form 6;\n\ninformation  as  required  under  SOLAS\n\n(vii)\n\na  Ship  Sanitation  Control  Exemption  Certificate  &  Ship\nSanitation Control Certificate set out in Form 7;\n\n(viii)\n\na Letter Bill - Bulk Mail under the Universal Postal Convention\nset out in Form 8;\n\n(ix)\n\nShip Particulars set out in Form 9;\n\n(x)\n\n(xi)\n\nAdvanced Passenger Information set out in Form 10; and\n\na  clearance  certificate  or  clearance  notification  from  the  last\nport; and\n\n(xii)\n\ncertificate of vessel registration;\n\n(c)\n\n(d)\n\nin the form set out in Part B of the Third Schedule, through Electronic\nManifest Management ASYCUDA, Advanced Cargo Information;\n\nin the form set out in the relevant international maritime convention\nthrough the Barbados Maritime Single Window:\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\nSOLAS certificates;\n\nSTCW certificates;\n\nMARPOL certificates;\n\nmaritime  labour  certificate  for  vessels  500  gross  tonnes  and\nabove;\n\n\f24\n\n(v)\n\n(vi)\n\n(vii)\n\nDeclaration  of  Maritime  Labour  Compliance  for  vessels  500\ngross tonnes and above;\n\nInternational Ballast Water Management Certificate for vessels\n400 gross tonnes and above;\n\nInternational Anti-Fouling Systems Certificate for vessels 400\ngross  tonnes  and  above  but  not  including  floating  platforms,\nfloating  storage  units  and  floating  production  storage  and\noffloading vessels;\n\n(viii)\n\nDeclaration on Anti-fouling System for vessels 24 metres and\nabove in length and less than 400 gross tonnes but not including\nfixed or floating platforms, floating storage units and floating\nproduction storage and offloading vessels; and\n\n(ix)\n\nany other document specified in the Caribbean Memorandum of\nUnderstanding on Port State Control; and\n\n(e)\n\nwhere there are stowaways on board the ship, submit the details of the\nstowaway in the form set out in Part B of the Fourth Schedule through\nthe CARICOM Single Window.\n\n(2)\n\nIn the case of a ship arriving from within the domestic space\n\n(a)\n\n(b)\n\nthe  documents  referred  to  in  subsection  (1)(a),  (b)  and  (c)  shall  be\nsubmitted through the CARICOM Single Window no later than one\nhour in advance of the arrival of the ship;\n\nthe  documents  referred  to  in  subsection  (1)(d)  shall  be  submitted\nthrough the Barbados Maritime Single Window no later than twelve\nhours in advance of the arrival of the ship.\n\n(3)\n\nIn the case of a ship arriving from outside the domestic space,\n\n(a)\n\nthe  documents  referred  to  in  subsection  (1)(a),  (b)  and  (c)  shall  be\nsubmitted  through  the  CARICOM  Single  Window  no  later  than  24\nhours in advance of the arrival of the ship.\n\n\f25\n\n(b)\n\nthe  documents  referred  to  in  subsection  (1)(d)  shall  be  submitted\nthrough the Barbados Maritime Single Window no later than 24 hours\nin advance of the arrival of the ship.\n\n(4)\nNotwithstanding  subsections  (2)  and  (3),  the  Maritime  Declaration  of\nHealth shall be submitted between 1 hour and 48 hours in advance of the arrival\nof the ship in Barbados.\n\nNotwithstanding subsection (1), for a period of 12 months after the coming\n(5)\ninto  force  of  this  Act,  a  ship  owner,  ship  agent  or  master  may,  submit  the\ndocuments referred to in paragraphs (a) and (b)(iii) and (vi) of subsection (1) to\nthe Chief Executive Officer of the Port in original hard copy as follows:\n\n(a)\n\n(b)\n\n(c)\n\nfive copies of the General Declaration;\n\nfour copies of the Cargo Declaration;\n\nfour copies of the Ship Stores Declaration;\n\n(d)\n\ntwo copies of the Crew Effects Declaration;\n\n(e)\n\nfour copies of the Crew List;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\nfour copies of the Passenger List;\n\none copy of the Dangerous Goods Manifest;\n\none copy of the Maritime Declaration of Health; and\n\none  copy  of  security-related  information  as  required  under  SOLAS\nregulation XI-2/9.2.2.\n\nNotwithstanding section 11, a ship owner, ship agent or master shall submit\n(6)\nthe documents referred to in paragraph (a) of subsection (1) in original hard copy,\nin  circumstances  resulting  from  acts  beyond  the  reasonable  control  of  the\nBarbados Port Inc. which prevents the electronic submission of documents.\n\nThe  Fifth  Schedule  sets  out  the  officer  to  whom  the  Chief  Operations\n(7)\nOfficer of the JRCC shall submit the documents through the Barbados Maritime\nSingle Window.\n\n\f26\n\n(8)\nEvery document that is submitted through the Barbados Maritime Single\nWindow shall be retrieved, signed and dated by the respective officer in order to\nfacilitate and expedite the clearance of a ship.\n\nClearance of ship pre-arrival\n\nWhere the documents referred to in section 12 are submitted to the\n13.(1)\nBarbados  Maritime  Single  Window  and  retrieved,  signed  and  dated  by  the\nrespective  officer,  that  the  documents  are  correct  in  all  particulars,  the\nComptroller of Customs shall issue an electronic Final Certificate of Clearance\nfor Arrival to the ship owner, ship agent or master in the form set out in Part B\nof the Sixth Schedule no later than one hour before the ship arrives in Barbados.\n\nWhere the ship owner, ship agent or master is not issued a Final Certificate\n(2)\nof Clearance for Arrival, the Comptroller of Customs shall give reasons for not\nissuing a Final Certificate of Clearance for Arrival to the ship owner, ship agent\nor  master  in  an  electronic  form  and  shall  issue  an  electronic  Provisional\nCertificate of Clearance for Arrival in the form set out in Part A of the Sixth\nSchedule before the ship arrives in Barbados.\n\nA ship owner, ship agent or master who is issued a Provisional Certificate\n(3)\nof Clearance for Arrival under subsection (2) shall be issued a Final Certificate\nof Clearance for Arrival in the form set out in Part B of the Sixth Schedule after\nthe ship arrives in Barbados and is inspected by\n\n(a)\n\n(b)\n\n(c)\n\na customs officer;\n\nan immigration officer;\n\nan environmental health officer;\n\n(d)\n\nan environmental health specialist; and\n\n(e)\n\na port state control officer.\n\n\f27\n\nAmendment of documents on arrival\n\n14.(1)\nWhere  a  ship  owner,  ship  agent  or  master  submits  documents  in\naccordance with section 11 and the information submitted is no longer accurate\nbecause there is a change in the circumstances on the ship, the ship owner, ship\nagent or master shall resubmit the document to which the change is to be made\nthrough the Barbados Maritime Single Window on arrival in Barbados, without\nincurring a penalty.\n\nNotwithstanding subsection (1), where the document to be changed is the\n(2)\nCargo Manifest, the ship owner, ship agent or master shall resubmit the document\nto which the change is to be made through the Barbados Maritime Single Window\nwithin 72 hours after arrival in Barbados, without incurring a penalty.\n\nShip arriving for medical emergency\n\n15.(1)\npurpose of bringing ashore\n\nWhere a ship arrives in Barbados from a port outside Barbados for the\n\n(a)\n\n(b)\n\n(c)\n\na sick or an injured passenger or crew member;\n\na person rescued at sea;\n\nany other person who requires emergency medical treatment; or\n\n(d)\n\na person who requires treatment against\n\n(i)\n\na  notifiable  disease  set  out  in  the  First  Schedule  to  the  Health\nDiseases)\nServices\nRegulations (S.I. 1969 No. 179); or\n\n(Communicable\n\nNotifiable\n\nand\n\n(ii)\n\na public health emergency of international concern,\n\nthe  ship  owner,  ship  agent  or  master  shall  submit  the  documents  set  out  in\nsubsection (2).\n\n\f28\n\n(2)\nIn accordance with subsection (1), the ship owner, ship agent or master\nshall submit the following documents through the CARICOM SingleWindow:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nCrew  List  set  out  in  Form  5  of  the  Convention  in  the  Second\nSchedule;\n\nPassenger  List  set  out  in  Form  6  of  the  Convention  in  the  Second\nSchedule or a list compiled by the owner of the ship if that list contains\nthe information required in the Passenger List;\n\nMaritime Declaration of Health set out in Form 3 in Part A of the Third\nSchedule;\n\nInternational Certificate of Vaccination or Prophylaxis set out in Form\n4 in Part A of the Third Schedule; and\n\nCertificate  of  Vaccination  and  Re-Vaccination  set  out  in  the\nInternational Health Regulations.\n\nDocuments pre-departure\n\nThe ship owner, ship agent or master of every ship which intends to\n16.\ndepart  from  a  port  in  Barbados  shall  submit  through  the  CARICOM  Single\nWindow\n\n(a)\n\na  Notice  of  Intended  Departure  in  the  form  set  out  in  the  Seventh\nSchedule as follows:\n\n(i)\n\n(ii)\n\nin the case of a ship departing to a port within the domestic space,\n30 minutes in advance of the departure of the ship; and\n\nin the case of a ship departing to a port outside the domestic space,\nno less than 30 minutes or more than 4 hours in advance of the\ndeparture of the ship; and\n\n(b)\n\nin the form set out in the Convention in the Second Schedule\n\n(i)\n\na General Declaration set out in Form 1;\n\n\f29\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\na Cargo Declaration set out in Form 2, for cargo which was not\nthe subject of a declaration when the ship arrived in Barbados;\n\na  Ship’s  Stores  Declaration  set  out  in  Form  3,  for  ship  stores\nwhich were not the subject of a declaration when the ship arrived\nin Barbados;\n\na  Crew  List  set  out  in  Form  5,  where  there  is  a  change  in  the\nnumber or the composition of the crew that arrived in Barbados;\nand\n\na Passenger List set out in Form 6, or a list compiled by the owner\nof  the  ship  if  that  list  contains  the  information  required  in  the\nPassenger List.\n\nClearance of ship pre-departure\n\nA ship owner, ship agent or master of a ship who submits documents\n17.(1)\nin accordance with section 16 shall be issued an electronic Final Certificate of\nClearance for Departure in the form set out in Part B of the Eighth Schedule no\nlater than 4 hours before the ships departs from Barbados.\n\nWhere the ship owner, ship agent or master is not issued a Final Certificate\n(2)\nof Clearance for Departure, the Comptroller of Customs shall give reasons for\nnot issuing a Final Certificate of Clearance for Departure to the ship owner, ship\nagent or master in an electronic form and shall issue an electronic Provisional\nCertificate of Clearance for Departure in the form set out in Part B of the Eighth\nSchedule before the ship departs from Barbados.\n\nA ship owner, ship agent or master who is issued a Provisional Certificate\n(3)\nof Clearance for Departure under subsection (2) shall be issued a Final Certificate\nof Clearance for Departure in the form set out in Part B of the Eighth Schedule\nbefore the ship departs Barbados and is inspected by\n\n(a)\n\n(b)\n\na customs officer;\n\nan immigration officer;\n\n\f30\n\n(c)\n\nan environmental health officer;\n\n(d)\n\nan environmental health specialist; and\n\n(e)\n\na port state control officer, where the designated lead port state control\nofficer issues a result under section 38(b), (c) or (d).\n\nWhere a ship owner, ship agent or master does not receive a Provisional\n(4)\nCertificate of Clearance for Departure in accordance with subsection (2) and can\nprovide proof that the documents were submitted in accordance with section 16,\na Provisional Certificate of Clearance for Departure shall be issued immediately.\n\nFailure to submit pre-arrival and pre-departure documents\n\nA ship owner, ship agent or master who fails to submit a document\n18.(1)\nrequired under section 12 or 16 shall submit that document immediately on arrival\nor  departure  and  the  ship  owner,  ship  agent  or  master  is  liable  to  pay  the\nadministrative penalty set out in subsections (2) and (3) to the officer specified\nin  the  Ninth  Schedule  for  each  document  that  should  have  been  submitted  in\nadvance of the arrival or departure of the ship.\n\n(2)\n\nWhere a ship owner, ship agent or master fails to submit\n\n(a)\n\n(b)\n\na Maritime Declaration of Health set out in Form 3 in Part A of the\nThird Schedule; or\n\nSecurity-related  information  as  required  under  SOLAS  regulation\nXI-2/9.2 set out in Form 6 in Part A of the Third Schedule;\n\nthe administrative penalty shall not exceed $200 000.\n\nWhere  a  ship  owner,  ship  agent  or  master  fails  to  submit  Advanced\n(3)\nPassenger Information set out in Form 10 of Part A of the Third Schedule the\npenalty  shall  be  in  accordance  with  the  provisions  of  the  Immigration  Act,\nCap. 190.\n\nWhere a ship owner, ship agent or master fails to submit Advanced Cargo\n(4)\nInformation set out in the Form in Part B of the Third Schedule the penalty shall\nbe in accordance with the provisions of the Customs Act (Act 2021-34).\n\n\f31\n\nWhere  a  ship  owner,  ship  agent  or  master  fails  to  submit  any  other\n\n(3)\ndocument, the administrative penalty shall not exceed $150 000.\n\nRequest for additional documents\n\n19.\nThe Chief Executive Officer of the Port, Chief Immigration Officer,\nComptroller  of  Customs,  Chief  Medical  Officer,  Chief  Environmental  Health\nOfficer,  Chief  Operations  Officer  of  JRCC,  Chief  Agricultral  Officer  or\ndesignated lead port state control officer may, where necessary, request a ship\nowner, ship agent or master to submit documents in addition to those submitted\nunder section 12, 15 and 16.\n\nDocuments to be signed\n\nWhere  a  document  to  be  submitted  through  the  CARICOM  Single\n20.\nWindow is to be signed, that signature shall be in accordance with section 8(1)\nof the Electronic Transactions Act, Cap. 308B.\n\nCorrection of errors\n\n21.(1)\nWhere the ship owner, ship agent or master submits a document that\nis not correct in all particulars and the ship owner, ship agent or master can show\nthat the error in the particulars\n\n(a)\n\n(b)\n\n(c)\n\nwas inadvertent;\n\nwas not of a serious nature;\n\nwas not due to recurrent carelessness; and\n\n(d)\n\nwas not made to violate any\n\nthe ship owner, ship agent or master may amend the document and resubmit that\ndocument  through  the  CARICOM  Single  Window,  Electronic  Manifest\nManagement ASYCUDA or Barbados Maritime Single Window, as the case may\nbe.\n\nWhere the ship owner, ship agent or master submits a document specified\n(2)\nin  the  Ninth  Schedule  through  the  CARICOM  Single  Window,  Electronic\n\n\f32\n\nManifest Management ASYCUDA or Barbados Maritime Single Window, as the\ncase may be, that is not correct in all particulars and it is found that the error in\nthe particulars\n\n(a)\n\n(b)\n\n(c)\n\nwas intentional;\n\nwas of a serious nature;\n\nwas due to recurrent carelessness; and\n\n(d)\n\nwas made to violate any enactment,\n\nthe ship owner, ship agent or master is liable to pay a fine of $200 for each error\nthat is contained in the document.\n\nPART IV\n\nARRIVAL AND DEPARTURE OF CRUISE SHIPS\n\nArrival of a cruise ship\n\n22.\nin Barbados from a port outside Barbados.\n\nSections 11, 12, 13 and 14 shall apply to a cruise ship which arrives\n\nDocuments pre-arrival of a cruise ship\n\n23.\nNotwithstanding  subsection  (1)  of  section  12,  when  a  cruise  ship\narrives in Barbados from a port outside Barbados, the ship owner, ship agent or\nmaster of that ship\n\n(a)\n\nshall submit the following documents set out in the Convention in the\nSecond Schedule through the CARICOM Single Window:\n\n(i)\n\na General Declaration set out in Form 1;\n\n(ii)\n\na Ship’s Stores Declaration set out in Form 3;\n\n(iii)\n\na Crew’s Effects Declaration set out in Form 4\n\n\f33\n\n(iv)\n\na Crew List set out in Form 5;\n\n(v)\n\na Passenger List set out in Form 6, or a list compiled by the owner\nof  the  ship  if  that  list  contains  the  information  required  in  the\nPassenger List, and\n\n(b)\n\nshall submit the following documents set out in the Part A of the Third\nSchedule through the CARICOM Single Window:\n\n(i)\n\na List of Ports of Call set out in Form 2; and\n\n(ii)\n\na Maritime Declaration of Health set out in Form 3.\n\nDocuments on departure of a cruise ship\n\nNotwithstanding section 16, when a ship is scheduled to depart from\n24.\nBarbados for a port outside Barbados and Barbados is the first port of departure,\nthe ship owner, ship agent or master shall submit through the CARICOM Single\nWindow,  the  following  documents  set  out  in  the  Convention  in  the  Second\nSchedule:\n\n(a)\n\n(b)\n\n(c)\n\na General Declaration set out in Form 1;\n\na Crew List in Form 5; and\n\na Passenger List in Form 6, or a list compiled by the owner of the ship\nwhere that list contains the information required in the Passenger List.\n\nClearance of cruise ship for departure\n\n25.\nBarbados for a port outside Barbados.\n\nSection 17 shall apply to a cruise ship which intends to depart from\n\n\f34\n\nPART V\n\nARRIVAL AND DEPARTURE OF PASSENGERS AND CREW MEMBERS\n\nFinal Certificate of Clearance to be issued before disembarking ship\n\nNo  passenger  or  crew  member  shall  disembark  a  ship  including  a\n26.\ncruise ship which arrives in Barbados from a port outside Barbados unless that\nship has been issued a Final Certificate of Clearance on Arrival in the form set\nout in Part B of the Sixth Schedule.\n\nDocuments required from passengers on arrival\n\nWhen a Final Certificate of Clearance on Arrival in the form set out\n27.\nin Part B of the Sixth Schedule has been issued, a passenger who seeks to enter\nBarbados from a port outside Barbados must be the holder of a passport.\n\nDocuments required from crew members on arrival\n\nWhen a Final Certificate of Clearance on Arrival in the form set out\n28.\nin Part B of the Sixth Schedule has been issued, a crew member who seeks to\nenter Barbados from a port outside Barbados must be the holder of one of the\nfollowing:\n\n(a)\n\n(b)\n\na passport; or\n\na Seafarers’ Identity Document.\n\nPassengers and crew members arriving without documents\n\n29.\nA passenger or crew member who seeks to enter Barbados and is not\nthe holder of a passport or Seafarers’ Identity Document shall not be permitted\nto enter unless he\n\n(a)\n\nexplains to an immigration officer why he is not the holder of a passport\nor Seafarers’ Identity Document; and\n\n\f35\n\n(b)\n\nestablishes  his  identity  and  national  status  to  the  satisfaction  of  the\nimmigration officer.\n\nShore Leave\n\n30.(1)\nWhen a ship arrives in Barbados from a port outside Barbados and\nremains in the Port or anywhere in Barbados waters the master of the ship shall\ngrant shore leave to those crew members who are eligible to shore leave while\nthe ship is in the Port.\n\nA crew member shall not require a visa or special permit for the purpose\n\n(2)\nof shore leave granted in accordance with subsection (1).\n\nWhere shore leave has not been granted in accordance with subsection (1),\n\n(3)\nthe master of the ship shall provide written reasons to\n\n(a)\n\n(b)\n\nthe crew member whose shore leave was denied; and\n\nthe Chief Executive Officer of the Port.\n\nDocuments required from passengers and crew members on\ndeparture\n\n31.\nseeks to depart from Barbados for a port outside Barbados.\n\nSections 28 and 29 shall apply to a passenger or crew member who\n\nImproper documents\n\n32.\na port outside Barbados, or depart from Barbados for a port outside Barbados\n\nWhere a passenger or crew member seeking to enter Barbados from\n\n(a)\n\nfabricates  or  falsifies  any  passport,  identity  document,  seafarers’\ndocument or other document; or\n\n(b)\n\nuses, utters or possesses, or attempts to use, utter or possess,\n\n(i)\n\nany passport, identity document, seafarers’ identity document or\nother document which has not been lawfully issued or which he is\nnot entitled to use, utter or possess; or\n\n\f36\n\n(ii)\n\nany fabricated or falsified passport, identity document, seafarers’\nidentity  document  or  other  document  knowing  the  same  to  be\nfabricated or falsified,\n\nthat passenger or crew member is guilty of an offence and is liable on summary\nconviction to a fine of $20 000 or to imprisonment for 12 months or both.\n\nPART VI\n\nSTOWAWAYS\n\nIncidences of stowaways and attempted stowaways to be reported\n\nWhen a ship arrives in Barbados from a port outside Barbados and a\n33.(1)\nstowaway is discovered on board the ship, the ship owner, ship agent or master\nshall report immediately the discovery of the stowaway to the Chief Immigration\nOfficer and the Commissioner of Police in the form set out in Part B of the Fourth\nSchedule.\n\nWhen  a  ship  is  scheduled  to  depart  from  Barbados  for  a  port  outside\n(2)\nBarbados and an attempted stowaway is discovered on board the ship, the ship\nowner,  ship  agent  or  master  shall  report  immediately  the  discovery  of  the\nstowaway to the Chief Immigration Officer and the Commissioner of Police.\n\nShip owner to defray cost of maintaining stowaway\n\n34.\nWhere the ship owner, ship agent or master has reported the discovery\nof a stowaway or attempted stowaway in accordance with section 33 and the\nstowaway  or  attempted  stowaway  disembarks  the  ship  and  is  taken  into  the\ncustody of the Chief Immigration Officer, the ship owner shall be responsible for\nthe cost of maintaining the stowaway or attempted stowaway.\n\n\f37\n\nTreatment of stowaways\n\nThe conditions governing the detention, return and repatriation of an\n35.\nattempted  stowaway  or  a  stowaway  are  set  out  in  Part  A  of  the  Fourth\nSchedule.\n\nPART VII\n\nPORT STATE CONTROL INSPECTIONS\n\nInterpretation\n\n36.\n\nFor the purposes of this Part,\n\n“clear grounds” means evidence which warrants a more detailed inspection of\n\nthe ship, equipment and crew;\n\n“concentrated  inspection  campaign”  means  an  inspection  focused  on  specific\n\nareas where a higher risk of non-compliance could exist;\n\n“expanded  inspection”  means  an  inspection  of  the  following  vessels  that  fall\n\nunder a higher risk category to other ships\n\n(a)\n\n(b)\n\n(c)\n\nbulk carriers over 12 years old;\n\ngas and chemical tankers over 10 years old;\n\noil tankers over 15 years old;\n\n(d)\n\npassenger ships over 15 years old; or\n\n(e)\n\nany other type of vessel classified as high-risk.\n\n“initial inspection” includes\n\n(a)\n\nchecking of certificates and documents submitted in accordance with\nsubsection 12(1)(d);\n\n\f38\n\n(b)\n\n(c)\n\nchecking  that  the  condition  and  hygiene  of  the  vessel  satisfies\ninternational rules and standards;\n\nwhere  applicable,  verifying  whether  any  deficiencies  found  by  an\nauthority at a previous inspection are rectified in accordance with the\ntime specified in the inspection report;\n\n“more detailed inspection” means an inspection conducted by a port state control\nofficer where there are clear grounds for believing during the inspection that\nthe condition of the ship or of its equipment or crew does not substantially\nmeet the requirements of the relevant  international maritime convention.\n\nPort state control inspections\n\nWhere a ship owner, ship agent or master of every ship which intends\n37.\nto come to Barbados from a port outside Barbados and proposing to call at the\nPort  submits  the  documents  referred  to  under  section  12(1)(d)  through  the\nBarbados Maritime Single Window the designated lead port state control officer\nshall conduct an initial inspection.\n\nInspection results\n\n38.\nThe designated lead port state control officer shall issue in electronic\nformat in respect of each document submitted under section 12(1)(d) one of the\nfollowing results:\n\n(a)\n\n(b)\n\n(c)\n\npass on initial inspection;\n\nmore detailed inspection on arrival;\n\nexpanded inspection on arrival; or\n\n(d)\n\nconcentrated inspection on arrival.\n\nDetention of vessel\n\nWhere  the  designated  lead  port  state  control  officer  issues  a  result\n39.(1)\nunder section 38(b), (c) or (d), he may detain the vessel for it to be inspected on\narrival in Barbados.\n\n\f39\n\n(2)\nWhere a port state control officer conducts an inspection and identifies that\nthere are deficiencies on the vessel, the vessel shall continue to be detained in\nBarbados until the ship owner, ship agent or master rectifies the deficiencies.\n\nRelease of vessel\n\nWhere  a  port  state  control  officer  verifies  that  the  deficiencies\n40.(1)\nidentified pursuant to section 39(2) are rectified, the designated lead port state\ncontrol officer shall notify the vessel’s Flag Administration for the purpose of\nreviewing and verifying that the deficiencies have been rectified.\n\nWhere the vessel’s Flag Administration verifies that the deficiencies have\n(2)\nbeen rectified, the designated lead port state control officer shall issue a certificate\nwhich indicates that the deficiency is corrected and release the vessel so that it\nmay depart from Barbados to a port outside Barbados.\n\nWhere the deficiencies cannot be rectified in Barbados, the designated lead\n\n(3)\nport state control officer shall\n\n(a)\n\n(b)\n\n(c)\n\nissue a certificate indicating that the deficiency is to be rectified in the\nnext scheduled port;\n\nnotify the intended port and the vessel’s Flag Administration that the\ndeficiency is to be rectified in the next scheduled Port; and\n\nrelease the vessel so that it may depart Barbados for the next scheduled\nport.\n\nApplication to cruise ships\n\n41.\nBarbados from a port outside Barbados.\n\nThis Part shall apply to every cruise ship which intends to come to\n\n\f40\n\nPART VIII\n\nOFFENCES AND PENALTIES\n\nOffences relating to the submission of false documents\n\n42.(1)\n\nA ship owner, ship agent or master who\n\n(a)\n\nsubmits a false Crew’s Effects Declaration set out in Form 4 of the\nConvention in the Second Schedule is guilty of an offence and is liable\non summary conviction to a fine of $500 000;\n\n(b)\n\nsubmits a false\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\nGeneral Declaration set out in Form 1 of the Convention in the\nSecond Schedule;\n\nCargo  Declaration  set  out  in  Form  2  of  the  Convention  in  the\nSecond Schedule or a false copy of the ship’s Manifest;\n\nShip’s Store Declaration set out in Form 3 of the Convention in\nthe Second Schedule;\n\nCrew  List  set  out  in  Form  5  of  the  Convention  in  the  Second\nSchedule; or\n\nPassenger List set out in Form 6 of the Convention in the Second\nSchedule or a false copy of a compilation listing the passengers\non board the ship,\n\nis  guilty  of  an  offence  and  is  liable  on  summary  conviction  to  a\nfine of  $100 000; or\n\n(c)\n\nsubmits a false Dangerous Goods Manifest set out in Form 7 of the\nConvention in the Second Schedule is guilty of an offence and is liable\non summary conviction to a fine of $2 000 000.\n\n\f41\n\n(2)\n\nA ship owner, ship agent or master who\n\n(a)\n\nsubmits a false\n\n(i)\n\n(ii)\n\nMaritime Declaration of Health set out in Form 3 in Part A of the\nThird Schedule;\n\nInternational Certificate of Vaccination or Prophylaxis set out in\nForm 4 in Part A of the Third Schedule; or\n\n(iii)\n\nSecurity  information  as  required  under  SOLAS  regulation\nXI-2/9.2 set out in Form 6 of the Third Schedule\n\nis guilty of an offence and is liable on summary conviction to a fine of $2\n000 000.\n\n(b)\n\n(c)\n\nsubmits a false Ship Sanitation Control Exemption Certificate and Ship\nSanitation Control Certificate set out in Form 7 of Part A of the Third\nSchedule is guilty of an offence and is liable on summary conviction\nto a fine of $1 000 000; or\n\nsubmits  a  false  Letter  Bill  -  Bulk  Mail  under  the  Universal  Postal\nConvention  set  out  in  Form  8  of  the  Third  Schedule  is  guilty  of  an\noffence and is liable on summary conviction to a fine of $500 000.\n\nPART IX\n\nMISCELLANEOUS\n\nMaritime Trade Facilitation Directives\n\n43.\nThe Minister may by notice published in the Official Gazette issue a\nmaritime trade facilitation directive in respect of improving seaborne trade and\nfacilitating  and  expediting  the  clearance  of  international  maritime  traffic  in  a\ntimely and efficient manner.\n\n\f42\n\nConfidentialty of data\n\n44.\nBarbados Maritime Single Window and ensure that it is kept confidential.\n\nThe  Barbados  Port  Inc.  shall  secure  all  data  received  through  the\n\nRetention of records\n\n45.\nBarbados Maritime Single Window for a period not exceeding 7 years.\n\nThe Port shall keep a record of all documents received through the\n\nSettlement of disputes\n\nIn the case of a dispute between the ship owner, ship agent or master\n46.(1)\nand any person relating to the submission of any document in accordance with\nsection 11 the parties shall consult together with a view to settle the dispute by\nmediation.\n\nNothing in this section shall prevent the parties from seeking other methods\n\n(2)\nof dispute resolution,\n\nConflict\n\nIn the case of any conflict between the provisions under this Act and\n47.\nprovisions under any enactment relating to advance passenger information and\nadvance cargo information that enactment shall prevail.\n\nException to electronic submission of documents\n\n48.\nNotwithstanding section 11, a ship owner, ship agent or master shall\nsubmit  any  document  required  under  this  Act  in  original  hard  copy  in\ncircumstances resulting from acts beyond the reasonable control of the JRCC,\nthe Comptroller of Customs, or Barbados Port Inc. which prevents the electronic\nsubmission of documents.\n\n\f43\n\nRegulations\n\n49.\nAct.\n\nThe Minister may make regulations generally for giving effect to this\n\nAmendment of Schedules\n\nThe  Minister  may  by  order  amend  the  First  Schedule,  Fifth\n50.\nSchedule,  Sixth  Schedule,  Seventh  Schedule,  Eighth  Schedule  and  Ninth\nSchedule.\n\nConsequential amendments\n\n51.\namended in the manner set out opposite thereto in the second column.\n\nThe enactments set out in the first column of the Tenth Schedule are\n\nRepeal\n\n52.\n(Act 2021-33) is repealed.\n\nThe  Facilitation  of\n\nInternational  Maritime  Traffic  Act\n\n\f44\n\nFIRST SCHEDULE\n\nNational Maritime Transport Facilitation Committee\n\n(Sections 2 and 7(4))\n\nAppointment of members\n\n1.(1)\n\nThe Committee shall comprise of 13 members as follows:\n\n(a)\n\nthree representatives from the Barbados Port Inc.;\n\n(i)\n\n(ii)\n\none representative from Port Security;\n\none  representative  from  the  Port  Information  Technology\nDepartment;\n\n(iii)\n\none representative from the Port Corporate Department;\n\n(b)\n\ntwo representatives from Port Health;\n\n(c)\n\ntwo representatives from the Customs Department;\n\n(d)\n\ntwo representatives from the Immigration Department;\n\n(e)\n\none representative from a cruise tour operator organization;\n\n(f)\n\none representative from a local shipping company;\n\n(g)\n\ntwo persons appointed by the Minister as follows:\n\n(i)\n\none  person  who  appears  to  the  Minister  to  be  qualified  and\nexperienced  in  economics,  accounts,  finance,  tax,  law,  public\nadministration or business or such other area as, in the opinion of\nthe Minister, is required for the discharge of the functions of the\nCommittee; and\n\n(ii)\n\none person nominated by the most representative organisation of\nemployees from among its members.\n\n\f45\n\n(2)\n\nA member shall subject to the provisions of this Schedule\n\n(a)\n\n(b)\n\nhold office for a term not exceeding 3 years; and\n\nbe eligible for reappointment.\n\n(3)\nThe Minister shall, pursuant to subparagraph (3), determine the term of\noffice of a member in such a manner that in any one year the respective terms of\noffice of no more than 3 members expire.\n\nChairman and Deputy Chairman\n\n2.\nbe Deputy Chairman, of the Committee.\n\nThe Minister shall appoint a member to be Chairman, and another to\n\nResignation\n\n3.(1)\naddressed to the Minister.\n\nThe  Chairman  may  resign  his  office  by  instrument  in  writing\n\nA member, other than the Chairman, may resign his office by instrument\n(2)\nin writing addressed to the Chairman, who shall forthwith forward the instrument\nto the Minister.\n\nA resignation takes effect from the date on which the Minister receives the\n\n(3)\ninstrument.\n\nTemporary leave of absence\n\n4.\n\nThe Minister may, in writing, grant leave of absence to a member.\n\nTempor ary appointment\n\n5.\nWhere a member is, or is likely to be, unable to perform the functions\nof his office for more than 30 days, whether as a result of absence from Barbados,\nillness or other cause, the Minister may appoint a person to act in the place of the\nmember.\n\n\f46\n\nRevocation of appointment\n\n6.\n\nThe Minister shall revoke the appointment of a member who\n\n(a)\n\n(b)\n\n(c)\n\nfails to carry out any of his functions under this Act;\n\nbecomes of unsound mind or becomes permanently unable to perform\nhis functions by reason of ill health;\n\nis convicted of an offence involving fraud or dishonesty or, in the case\nof any other offence, is sentenced to a term of imprisonment;\n\n(d)\n\n## is guilty of serious misconduct in relation to his functions;\n\n(e)\n\nis bankrupt or compounds with or suspends payment to his creditors;\nor\n\n(f)\n\nfails to declare his interest in a matter before the Committee.\n\nVacancies\n\n7.(1)\n\nA vacancy in the membership of the Committee arises on\n\n(a)\n\n(b)\n\n(c)\n\nthe death or resignation of a member;\n\nthe revocation of the appointment of a member; or\n\nthe  absence  of  a  member  from  4  consecutive  meetings  of  the\nCommittee without the approval of the Minister.\n\nA person who is appointed to fill a vacancy referred to in subparagraph (1)\n(2)\nshall hold office only for the unexpired portion of the term of the former member\nconcerned.\n\nDisqualification\n\n8.\n\nA person who\n\n(a)\n\nis a member of Parliament;\n\n\f47\n\n(b)\n\n(c)\n\nother than a person specified in paragraph 1(a)(ii) or (iii), is a public\nofficer within the meaning of the Public Service Act, Cap. 29; or\n\nwere he a member, would have to be removed from office pursuant to\nparagraph 6,\n\nis not eligible to be a member.\n\nGazetting of appointments\n\n9.\nCommittee shall be notified in the Official Gazette.\n\nThe appointment, resignation, death or removal of a member of the\n\nSeal and execution of documents\n\n10.(1)\n\nThe seal of the Committee shall be\n\n(a)\n\nkept in the custody of the Chairman, the Deputy Chairman or the person\nperforming the functions of secretary to the Committee and may be\naffixed  to  documents  or  instruments  pursuant  to  a  resolution  of  the\nCommittee, in the presence of any 2 of the persons referred to in this\nsubparagraph; and\n\n(b)\n\nauthenticated by the signature of the Chairman or the Deputy Chairman\nor the person performing the functions of secretary to the Committee.\n\nAll documents or instruments made by the Committee, other than those\n(2)\nrequired by law to be under seal, and all decisions of the Committee shall be\nsignified under the hand of the Chairman or the Deputy Chairman or the person\nperforming the functions of secretary to the Committee.\n\nMeetings\n\n11.(1)\nThe Committee shall meet quarterly or as often as may be necessary\nor expedient for the transaction of its business; and such meetings shall be held\nat such places and times and on such days as the Committee may determine.\n\nThe Chairman, or in the event of his absence from Barbados or inability\n(2)\nto act as such, the Deputy Chairman, may at any time call a special meeting of\n\n\f48\n\nthe Committee and shall call such a meeting within 7 days of the receipt by him\nof a request for the purpose addressed to him in writing and signed by not less\nthan 3 members.\n\nThe Chairman, or in his absence, the Deputy Chairman, shall preside at all\n\n(3)\nmeetings of the Committee.\n\nWhere the Chairman and the Deputy Chairman are absent from a meeting,\n(4)\nthe members present shall elect a member from among their number to preside\nat the meeting.\n\n(5)\n\nFive members shall constitute a quorum.\n\nThe decisions of the Committee shall be by a majority of votes and in a\n(6)\ncase where the voting is equal, the Chairman or other person presiding at the\nmeeting shall, in addition to an original vote, have a casting vote.\n\nMinutes  of  each  meeting  shall  be  kept  by  the  person  performing  the\n(7)\nfunctions of secretary to the Committee or by such other officer as the Committee\nappoints for the purpose and shall be confirmed by the Committee and signed by\nthe Chairman or Deputy Chairman at the next meeting of the Committee.\n\nAttendance of non-members at meetings\n\n12.\nThe Committee may invite any person to attend any of its meetings to\nassist or advise it with respect to any matter under its consideration, but a person\nso invited does not have a right to vote.\n\nCommittee may regulate proceedings\n\n13.\nits own proceedings.\n\nSubject to the provisions of this Schedule, the Committee may regulate\n\n\f49\n\nSECOND SCHEDULE\n\n(Sections 2, 3(1), 12(1)(a), 15(2)(a), (b), 16(b), 23(a), 24, 42(1))\n\n1965 Convention on Facilitation Of International Maritime Traffic (FAL 1965)\n\nAdopted in London, England on 9 April 1965\n\nTHE CONTRACTING GOVERNMENTS:\n\nDESIRING  to  facilitate  maritime  traffic  by  simplifying  and  reducing  to  a  minimum  the\nformalities, documentary requirements and procedures on the arrival, stay and departure of ships\nengaged in international voyages;\n\nHAVE AGREED as follows:\n\n# ARTICLE I\n\nThe  Contracting  Governments  undertake  to  adopt,  in  accordance  with  the  provisions  of  the\npresent Convention and its Annex, all appropriate measures to facilitate and expedite international\nmaritime traffic and to prevent unnecessary delays to ships and to persons and property on board.\n\n# ARTICLE II\n\n(1) The Contracting Governments undertake to co-operate, in accordance with the provisions of\nthe present Convention, in the formulation and application of measures for the facilitation of the\narrival, stay and departure of ships. Such measures shall be, to the fullest extent practicable, not\nless  favourable  than  measures  applied  in  respect  of  other  means  of  international  transport;\nhowever, these measures may differ according to particular requirements.\n\n(2)  The  measures  for  the  facilitation  of  international  maritime  traffic  provided  for  under  the\npresent Convention and its Annex apply equally to the ships of coastal and non-coastal States the\nGovernments of which are Parties to the present Convention.\n\n(3) The provisions of the present Convention do not apply to warships or pleasure yachts.\n\n\f50\n\nARTICLE III\n\nThe Contracting Governments undertake to co-operate in securing the highest practicable degree\nof uniformity in formalities, documentary requirements and procedures in all matters in which\nsuch uniformity will facilitate and improve international maritime traffic and keep to a minimum\nany  alterations  in  formalities,  documentary  requirements  and  procedures  necessary  to  meet\nspecial requirements of a domestic nature.\n\n# ARTICLE IV\n\nWith a view to achieving the ends set forth in the preceding Articles of the present Convention,\nthe  Contracting  Governments  undertake  to  co-operate  with  each  other  or  through  the  Inter-\nGovernmental  Maritime  Consultative  Organization  (hereinafter  called  the  \"Organization\")  in\nmatters  relating  to  formalities,  documentary  requirements  and  procedures,  as  well  as  their\napplication to international maritime traffic.\n\n# ARTICLE V\n\n(1)  Nothing  in  the  present  Convention  or  its  Annex  shall  be  interpreted  as  preventing  the\napplication of any wider facilities which a Contracting Government grants or may grant in future\nin respect of international maritime traffic under its national laws or the provisions of any other\ninternational agreement.\n\n(2) Nothing in the present Convention or its Annex shall be interpreted as precluding a Contracting\nGovernment from applying temporary measures considered by that Government to be necessary\nto preserve public morality, order and security or to prevent the introduction or spread of diseases\nor pests affecting public health, animals or plants.\n\n(3) All matters that are not expressly provided for in the present Convention remain subject to\nthe legislation of the Contracting Governments.\n\nFor the purposes of the present Convention and its Annex:\n\n# ARTICLE VI\n\n(a)\n\n\"Standards\"  are  those  measures  the  uniform  application  of  which  by  Contracting\nGovernments in accordance with the Convention is necessary and practicable in order\nto facilitate international maritime traffic;\n\n\f51\n\n(b)\n\n\"Recommended  Practices\"  are  those  measures  the  application  of  which  by\nContracting Governments is desirable in order to facilitate international maritime\ntraffic.\n\n# ARTICLE VII\n\n(1) The Annex to the present Convention may be amended by the Contracting Governments,\neither at the proposal of one of them or by a conference convened for that purpose.\n\n(2) Any Contracting Government may propose an amendment to the Annex by forwarding a draft\namendment  to  the  Secretary-General  of  the  Organization  (hererinafter  called  the  \"Secretary-\nGeneral\"):\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nUpon the express request of a Contracting Government, the Secretary-General shall\ncommunicate any such proposal directly to all Contracting Governments for their\nconsideration and acceptance. If he receives no such express request, the Secretary-\nGeneral  may  proceed  to  such  consultations  as  he  deems  advisable  before\ncommunicating the proposal to the Contracting Governments;\n\nEach Contracting Government shall notify the Secretary-General within one year\nfrom the receipt of any such communication whether or not it accepts the proposal;\n\nAny such notification shall be made in writing to the Secretary-General who shall\ninform all Contracting Governments of its receipt;\n\nAny amendment to the Annex under this paragraph shall enter into force six months\nafter the date on which the amendment is accepted by a majority of the Contracting\nGovernments;\n\nThe Secretary-General shall inform all Contracting Governments of any amendment\nwhich enters into force under this paragraph, together with the date on which such\namendment shall enter into force.\n\n(3) A conference of the Contracting Governments to consider amendments to the Annex shall be\nconvened by the Secretary-General upon the request of at least one-third of these Governments.\nEvery  amendment  adopted  by  such  conference  by  a  two-thirds  majority  of  the  Contracting\nGovernments present and voting shall enter into force six months after the date on which the\nSecretary-General notifies the Contracting Governments of the amendment adopted.\n\n(4) The Secretary-General shall notify promptly all signatory Governments of the adoption and\nentry into force of any amendment under this Article.\n\n\f52\n\nARTICLE VIII\n\n(1) Any Contracting Government that finds it impracticable to comply with any Standard by\nbringing its own formalities, documentary requirements or procedures into full accord with it or\nwhich deems it necessary for special reasons to adopt formalities, documentary requirements or\nprocedures differing from that Standard, shall so inform the Secretary-General and notify him of\nthe differences between its own practice and such Standard. Such notification shall be made as\nsoon as possible after entry into force of the present Convention for the Government concerned,\nor after the adoption of such differing formalities, documentary requirements or procedures.\n\n(2) Notification by a Contracting Government of any such difference in the case of an amendment\nto a Standard or of a newly adopted Standard shall be made to the Secretary-General as soon as\npossible  after  the  entry  into  force  of  such  amended  or  newly  adopted  Standard,  or  after  the\nadoption of such differing formalities, documentary requirements or procedures and may include\nan  indication  of  the  action  proposed  to  bring  the  formalities,  documentary  requirements  or\nprocedures into full accord with the amended or newly adopted Standard.\n\n(3) Contracting Governments are urged to bring their formalities, documentary requirements and\nprocedures into accord with the Recommended Practices insofar as practicable. As soon as any\nContracting Government brings its own formalities, documentary requirements and procedures\ninto accord with any Recommended Practice, it shall notify the Secretary-General thereof.\n\n(4) The Secretary-General shall inform the Contracting Governments of any notification made\nto him in accordance with the preceding paragraphs of this Article.\n\n# ARTICLE IX\n\nThe Secretary-General shall convene a conference of the Contracting Governments for revision\nor amendment of the present Convention at the request of not less than one-third of the Contracting\nGovernments. Any revision or amendments shall be adopted by a two-thirds majority vote of the\nConference and then certified and communicated by the Secretary-General to all Contracting\nGovernments for their acceptance. One year after the acceptance of the revision or amendments\nby two-thirds of the Contracting Governments, each revision or amendment shall enter into force\nfor  all  Contracting  Governments  except  those  which,  before  its  entry  into  force,  make  a\ndeclaration that they do not accept the revision or amendment. The Conference may by a two-\nthirds majority vote determine at the time of its adoption that a revision or amendment is of such\na nature that any Contracting Government which has made such a declaration and which does\nnot accept the revision or amendment within a period of one year after the revision or amendment\nenters into force shall, upon the expiration of this period, cease to be a party to the Convention.\n\n\f53\n\nARTICLE X\n\n(1) The present Convention shall remain open for signature for six months from this day's date\nand shall thereafter remain open for accession.\n\n(2)  The  Governments  of  States  Members  of  the  United  Nations,  or  of  any  of  the  specialized\nagencies, or the International Atomic Energy Agency, or Parties to the Statute of the International\nCourt of Justice may become Parties to the present Convention by:\n\n(a)\n\n(b)\n\n(c)\n\nsignature without reservation as to acceptance;\n\nsignature with reservation as to acceptance followed by acceptance; or\n\naccession.\n\nAcceptance or accession shall be effected by the deposit of an instrument with the Secretary-\nGeneral.\n\n(3) The Government of any State not entitled to become a Party under paragraph 2 of this Article\nmay apply through the Secretary-General to become a Party and shall be admitted as a Party in\naccordance with paragraph 2, provided that its application has been approved by two-thirds of\nthe Members of the Organization other than Associate Members.\n\n# ARTICLE XI\n\nThe  present  Convention  shall  enter  into  force  sixty  days  after  the  date  upon  which  the\nGovernments of at least ten States have either signed it without reservation as to acceptance or\nhave deposited instruments of acceptance or accession. It shall enter into force for a Government\nwhich subsequently accepts it or accedes to it sixty days after the deposit of the instrument of\nacceptance or accession.\n\n# ARTICLE XII\n\nThree  years  after  entry  into  force  of  the  present  Convention  with  respect  to  a  Contracting\nGovernment,  such  Government  may  denounce  it  by  notification  in  writing  addressed  to  the\nSecretary- General who shall notify all Contracting Governments of the content and date of receipt\nof any such notification. Such denunciation shall take effect one year, or such longer period as\nmay be specified in the notification, after its receipt by the Secretary-General.\n\n\f54\n\nARTICLE XIII\n\n(1) (a) The United Nations in cases where they are the administering authority for a territory, or\nany Contracting Government responsible for the international relations of a territory, shall as\nsoon as possible consult with such territory in an endeavour to extend the present Convention to\nthat territory, and may at any time by notification in writing given to the Secretary-General declare\nthat the Convention shall extend to such territory.\n\n(b)\n\n(c)\n\n(d)\n\nThe present Convention shall from the date of the receipt of the notification or from\nsuch other date as may be specified in the notification extend to the territory named\ntherein.\n\nThe provisions of Article VIII of the present Convention shall apply to any territory\nto which the Convention is extended in accordance with the present Article; for this\npurpose,  the  expression  \"its  own  formalities,  documentary  requirements  or\nprocedures\" shall include those in force in that territory.\n\nThe present Convention shall cease to extend to any territory one year after the receipt\nby the Secretary-General of a notification to this effect, or on such later date as may\nbe specified therein.\n\n(2) The Secretary-General shall inform all the Contracting Governments of the extension of the\npresent Convention to any territory under paragraph 1 of this Article, stating in each case the date\nfrom which the Convention has been so extended.\n\n# ARTICLE XIV\n\nThe Secretary-General shall inform all signatory Governments, all Contracting Governments and\nall Members of the Organization of:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe signatures affixed to the present Convention and the dates thereof;\n\nthe deposit of instruments of acceptance and accession together with the dates of their\ndeposit;\n\nthe date on which the Convention enters into force in accordance with Article XI;\n\nany  notification  received  in  accordance  with  Articles  XII  and  XIII  and  the  date\nthereof;\n\n(e)\n\nthe convening of any conference under Articles VII or IX.\n\n\f55\n\nARTICLE XV\n\nThe present Convention and its Annex shall be deposited with the Secretary-General who shall\ntransmit certified copies thereof to signatory Governments and to acceding Governments. As\nsoon as the present Convention enters into force, it shall be registered by the Secretary-General\nin accordance with Article 102 of the Charter of the United Nations.\n\n# ARTICLE XVI\n\nThe present Convention and its Annex shall be established in the English and French languages,\nboth  texts  being  equally  authentic.  Official  translations  shall  be  prepared  in  the  Russian  and\nSpanish languages and shall be deposited with the signed originals.\n\nIN  WITNESS  WHEREOF  the  undersigned  being  duly  authorized  by  their  respective\nGovernments for that purpose have signed the present Convention.\n\nDONE at London this ninth day of April 1965.\n\n# ANNEX\n\nSection 1 - Definitions and general provisions\n\nA.\n\nDefinitions\n\nFor the purpose of the provisions of this annex, the following meanings shall be attributed to the\nterms listed:\n\nAttempted stowaway. A person who is secreted on a ship, or in cargo which is subsequently loaded\non the ship, without the consent of the shipowner or the master or any other responsible person,\nand who is detected on board the ship before it has departed from the port.\n\nCargo. Any goods, wares, merchandise, and articles of every kind whatsoever carried on a ship,\nother than mail, ship's stores, ship's spare parts, ship's equipment, cargo transport units not carried\nunder a contract of carriage with a shipper, crew's effects and passengers' accompanied baggage.\n\nCargo transport unit (CTU). A freight container, swap-body, vehicle, railway wagon or any other\nsimilar unit.\n\nClearance. Accomplishment of customs and/or other formalities necessary to:\n\n\f56\n\n(a)\n\n(b)\n\n(c)\n\nPermit goods to enter home use, to be exported or to be placed under another customs\nprocedure (so called customs clearance),\n\nPermit persons to enter the territory of a State, or\n\nPermit a ship to enter or depart a port within the territory of a State.\n\nCrew's effects. Clothing, items in everyday use and other articles, which may include currency,\nbelonging to the crew and carried on the ship.\n\nCrew member. Any person actually employed for duties on board during a voyage in the working\nor service of a ship and included in the crew list.\n\nCruise  ship.  A  ship  on  an  international  voyage  carrying  passengers  participating  in  a  group\nprogramme and accommodated aboard, for the purpose of making scheduled temporary tourist\nvisits at one or more different ports, and which during the voyage does not normally:\n\n(a)\n\n(b)\n\nembark or disembark any other passengers;\n\nload or discharge any cargo.\n\nDocument. Information presenting data by electronic means or by non-electronic means.\n\nEstimated time of arrival (ETA). Time when a ship estimates it will arrive at the pilot station\nserving a port or, when it expects to enter a specific location in the port area, where port regulations\napply.\n\nFreight  container.  An  article  of  transport  equipment  that  is  of  a  permanent  character  and\naccordingly strong enough to be suitable for repeated use; specially designed to facilitate the\ntransport of goods, by one or other modes of transport, without intermediate reloading: designed\nto  be  secured  and/or  readily  handled,  having  fittings  for  these  purposes,  and  approved  in\naccordance with the International Convention for Safe Containers (CSC), 1972, as amended. The\nterm \"freight container\" includes neither vehicle nor packaging; however a freight container that\nis carried on a chassis is included.\n\nISPS  Code.  The  \"International  Ship  and  Port  Facility  Security  (ISPS)  Code\"  adopted  on  12\nDecember  2002  by  resolution  2  of  the  Conference  of  Contracting  Governments  to  the\nInternational Convention for the Safety of Life at Sea, 1974 (SOLAS), as may be amended by\nthe Organization.\n\nManifest.  Document  recapitulating  the  various  data  from  bills  of  lading  and  other  transport\ndocuments issued for the carriage of goods on board ships.\n\n\fMaster. The person having command of a ship.\n\n# 57\n\nPassenger in transit. A passenger who arrives by ship from a foreign country for the purpose of\ncontinuing his/her journey by ship or some other means of transport to a foreign country.\n\nPassengers'  accompanied  baggage.  Property,  which  may  include  currency,  carried  for  a\npassenger on the same ship as the passenger, whether in his/her personal possession or not, so\nlong as it is not carried under a contract of carriage of goods or other similar agreement.\n\nPort. Any port, terminal, offshore terminal, ship and repair yard or roadstead which is normally\nused for the loading, unloading, repair and anchoring of ships, or any other place at which a ship\ncan call.\n\nPostal items. Correspondence and other objects tendered to be carried by a ship for carriage by\npostal administrations and intended for delivery to postal administrations in the ship's ports of\ncall.\n\nPublic  authorities.  The  agencies  or  officials  in  a  State  responsible  for  the  application  and\nenforcement of the laws and regulations of that State which relate to any aspect of the Standards\nand Recommended Practices contained in this annex.\n\nRelease. Action taken by customs authorities to permit goods undergoing clearance to be placed\nat the disposal of the persons concerned.\n\nSecurity  measures.  Measures  developed  and  implemented  in  accordance  with  international\nagreements to improve security on board ships, in port areas, facilities and of goods moving in\nthe international supply chain to detect and prevent unlawful acts.\n\nShip agent. The party representing the ship's owner and/or charterer (the Principal) in port. If so\ninstructed, the agent is responsible to the Principal for arranging, together with the port, a berth,\nall relevant port and husbandry services, tending to the requirements of the master and crew,\nclearing the ship with the port and other authorities (including preparation and submission of\nappropriate documentation) along with releasing or receiving cargo on behalf of the Principal.\n\nShipowner. One who owns or operates a ship, whether a person, a corporation or other legal entity,\nand any person other than the ship agent acting on behalf of the owner or operator.\n\nShip's documents. Certificates and other documents which must be made available by a ship's\nmaster in order to demonstrate the ship's compliance with international or national regulations.\n\n\f58\n\nShip's equipment. Articles, other than ship's spare parts, on board a ship for use thereon, which\nare removable but not of a consumable nature, including accessories such as lifeboats, life-saving\ndevices, furniture, ship's apparel and similar items.\n\nShip's spare parts. Articles of a repair or replacement nature for incorporation into the ship in\nwhich they are carried.\n\nShip's stores. Goods for use in the ship, including consumable goods, goods carried for sale to\npassengers and crew members, fuel and lubricants, but excluding ship's equipment and ship's\nspare parts.\n\nShipper. The party named on the bill of lading or waybill as shipper and/or who concludes a\ncontract  of  carriage  (or  in  whose  name  or  on  whose  behalf  a  contract  of  carriage  has  been\nconcluded) with a carrier. The shipper is known also as the sender.\n\nShore leave. Permission for a crew member to be ashore during the ship's stay in port within such\ngeographical or time limits, if any, as may be decided by the public authorities.\n\nSingle Window. A facility that allows submission of standardized information covered by the\nConvention to a single entry point.\n\nStowaway. A person who is secreted on a ship, or in cargo which is subsequently loaded on the\nship, without the consent of the shipowner or the master or any other responsible person and who\nis detected on board the ship after it has departed from a port, or in the cargo while unloading it\nin the port of arrival, and is reported as a stowaway by the master to the appropriate authorities.\n\nTemporary admission. The customs procedure under which certain goods can be brought into a\ncustoms territory conditionally relieved, totally or partially, from payment of import duties and\ntaxes and without application of import prohibitions or restrictions of economic character; such\ngoods must be imported for a specific purpose and must be intended for re-exportation within a\nspecified period and without having undergone any change except normal depreciation owing to\nthe use made of them.\n\nTime of arrival. Time when a ship first comes to rest, whether at anchor or at a dock, in a port.\n\nTransport document. Information evidencing a contract of carriage between a shipowner and a\nshipper, such as a sea waybill, a bill of lading or a multi-modal transport document.\n\nB.\n\nGeneral Provisions\n\n\f59\n\nIn conjunction with paragraph 2 of article V of the Convention, the provisions of this annex shall\nnot  preclude  public  authorities  from  taking  such  appropriate  measures,  including  calling  for\nfurther  information,  as  may  be  necessary  in  cases  of  suspected  fraud,  or  to  deal  with  special\nproblems constituting a grave danger to public order (ordre public), public security or public\nhealth, such as unlawful acts against the safety of maritime traffic and illicit trafficking in narcotic\ndrugs and psychotropic substances, or to prevent the introduction or spread of disease or pests\naffecting animals or plants.\n\n1.1.\nbe furnished, and shall keep the number of items to a minimum.\n\nStandard. Public authorities shall in all cases require only essential information to\n\n1.1.1.\n\nNot in use.\n\n1.2.\nRecommended  Practice.  Notwithstanding  the  fact  that  documents  for  certain\npurposes may be separately prescribed and required in this annex, public authorities, bearing in\nmind the interests of those who are required to complete the documents as well as the purposes\nfor which they are to be used, should provide for any two or more such documents that are to be\nsubmitted by the same party to be combined into one in any case in which this is practicable and\nin which an appreciable degree of facilitation would result.\n\n1.3.\nRecommended  Practice.  Measures  and  procedures  imposed  by  Contracting\nGovernments for the purposes of security or preventing the trafficking of narcotics should be\nefficient.  Such  measures  and  procedures  (e.g.  risk  management  and  cross-checking  of\ninformation) should be implemented in such a manner as to cause a minimum of interference\nwith, and to prevent unnecessary delays to, ships and persons or property on board.\n\nC.\n\nSystems for the electronic exchange of information\n\n1.3bis.\nof systems for the electronic exchange of information by 8 April 2019.\n\nStandard. Public authorities shall take all necessary measures for the establishment\n\n1.3ter.\nStandard. Public authorities, when introducing systems for the electronic exchange\nof information to assist clearance processes, shall provide shipowners and other parties concerned\nwith the necessary information about the systems requirements and give an adequate period of\ntransition before the use of the systems are made mandatory. A period of no less than 12 months\nfor  transition  to  the  mandatory  use  of  the  systems  shall  be  provided  from  the  date  of  the\nintroduction of such systems.\n\n\f60\n\n1.3quart.\nRecommended Practice. Public authorities should, for a transitional period, allow\nfor the submission of required information for clearance processes in both electronic and paper\nform.\n\n1.3quin.\nRecommended  Practice.  Contracting  Governments  should  encourage  public\nauthorities to introduce arrangements to enable the submission of all the information required by\npublic authorities in connection with the arrival, stay and departure of ships, persons and cargo,\navoiding duplication, to a \"Single Window\".\n\nConsideration should also be given to such a Single Window serving as the mechanism through\nwhich  the  public  authorities  communicate  decisions  and  other  information  covered  by  this\nConvention.\n\n1.4.\n\n1.5.\n\nNot in use.\n\nNot in use.\n\n1.6.\nStandard. Public authorities, when introducing systems for the electronic exchange\nof information for clearance processes, shall limit the information they require from shipowners\nand other parties concerned to that required by the FAL Convention.\n\n1.6bis.\nStandard. When introducing systems for the electronic exchange of information\nrequired by public authorities for the arrival, stay and departure of the ship, persons and cargo to\nfacilitate clearance processes, Contracting Governments shall encourage public authorities and\nother parties concerned (shipowners, handling companies, seaports, and/or cargo agents, etc.) to\nexchange  data  in  conformity  with  the  relevant  UN  Standards,  including  UN  Electronic  Data\nInterchange for Administration, Commerce and Transport (UN/EDIFACT) Standards, or other\ninternationally agreed Standards, such as the XML Standard.\n\n1.6ter.\nRecommended  Practice.  When  introducing  new  electronic  message  formats,\npublic authorities should continue to allow for the usage of existing electronic message formats\nin agreement with the parties concerned.\n\n1.7.\nthe electronic exchange of information for clearance processes, public authorities should:\n\nRecommended Practice. When planning for, introducing or modifying systems for\n\n(a)\n\n(b)\n\n(c)\n\nafford all interested parties, from the outset, the opportunity for consultation;\n\nevaluate existing procedures and eliminate those which are unnecessary;\n\ndetermine those procedures which are to be computerized;\n\n\f61\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nuse  United  Nations  (UN)  Recommendations,  WCO  Information  Packages  and\nrelevant ISO Standards to the maximum extent practicable;\n\nadapt these systems for multimodal applications;\n\ntake  appropriate  steps  to  minimize  the  cost  of  implementing  these  systems  to\noperators and other private parties; and\n\ngive  attention  to  the  desirability  of  obtaining  compatibility  with  other  relevant\ninformation systems.\n\n1.7.1.\nRecommended  Practice.  Contracting  Governments  should  encourage  public\nauthorities and other parties concerned to cooperate or participate directly in the development of\nelectronic systems using internationally agreed Standards with a view to enhancing the exchange\nof information relating to the arrival, stay and departure of ships, persons and cargo and assuring\ninter-operability between the systems of public authorities and other parties concerned.\n\n1.8.\n\nNot in use.\n\n1.8.1.\n\nNot in use.\n\nD.\n\nIllicit drug trafficking\n\n1.9.\nRecommended Practice. Public authorities should seek to establish cooperation\narrangements with shipowners and other parties concerned to improve their ability to combat\ndrug smuggling, while providing enhanced facilitation. Such arrangements could be based on the\nWorld Customs Organization Memoranda of Understanding and the associated guidelines.\n\n1.10.\nStandard.  Where,  as  part  of  cooperation  arrangements,  public  authorities,\nshipowners, and other parties concerned are provided access to sensitive commercial and other\ninformation, the information shall be treated confidentially.\n\nE.\n\nControl techniques.\n\n1.11.\ncontrol procedures related to:\n\nStandard.  Public  authorities  shall  use  risk  management  to  enhance  their  border\n\nthe release/clearance of cargo;\n\nsecurity requirements; and\n\ntheir ability to target smuggling,\n\n\f62\n\nthereby facilitating the legitimate circulation of persons and goods.\n\nSection 2 - Arrival, stay and departure of the ship\n# This  section  contains  the  provisions  concerning  the  formalities  required  of shipowners by the public authorities on the arrival, stay and departure of the ship and shall not be read so as to preclude a requirement for the presentation, for inspection  by  the  appropriate  authorities,  of  certificates  and  other  documents made  available  by  the  ship  pertaining  to  its  registry,  measurement,  safety, manning and other related matters.\n\nA.\n\nGeneral\n\nStandard.  Public  authorities  shall  not  require  for  their  retention,  on  arrival  or\n2.1.\ndeparture of ships to which the Convention applies, any documents other than those covered by\nthe present section. The documents in question are:\n\nGeneral Declaration\n\nCargo Declaration\n\nShip's Stores Declaration\n\nCrew's Effects Declaration\n\nCrew List\n\nPassenger List\n\nDangerous Goods Manifest\n\nThe document required under the Universal Postal Convention for mail\n\nMaritime Declaration of Health\n\nSecurity-related information as required under SOLAS regulation XI-2/9.2.2\n\nAdvance electronic cargo information for customs risk assessment purposes\n\nAdvanced Notification Form for Waste Delivery to Port Reception Facilities, when\ncommunicated to the Organization.\n\nStandard. Contracting Governments shall not require consular formalities, charges\n2.1.1.\nor  fees  in  connection  with  documents  for  the  clearance  of  ships,  including  the  electronic\nsubmission of documents.\n\n\f63\n\n2.1.2.\nStandard. Public authorities shall develop procedures for the lodgement of pre-\narrival and pre-departure information in order to facilitate the processing of such information for\nthe expedited subsequent release/clearance of cargo and persons.\n\n2.1.3.\nRecommended Practice. National legislation should specify the conditions for the\nlodgement  of  pre-arrival  and  pre-departure  information.  With  regard  to  the  point  in  time  of\ntransmission of the pre-arrival information, it should not normally be set before the moment the\nship has left the country of departure. However, national legislation could, in addition to the basic\nrule, also specify the exceptions from this principle where required, e.g. for voyages of short\nduration.\n\n2.1.3bis.\nRecommended Practice. Public authorities should, for the submission of advance\nelectronic cargo information for customs risk assessment purposes, take into account the time\nlimits specified in the WCO SAFE Framework of Standards.\n\n2.1.4.\nRecommended Practice. Public authorities should not require the lodgement of a\nseparate  General  Declaration,  Cargo  Declaration,  Crew  List,  Passenger  List  and  Dangerous\nGoods Manifest if the data elements contained in these documents are included in the pre-arrival\nor pre-departure information or in the ship's manifest.\n\n2.1.5.\ninformation in subsequent procedures where such data is required.\n\nStandard.  Public  authorities  shall  reuse  the  pre-arrival  and  pre-departure\n\nB.\n\nContents and purpose of documents\n\n2.2.\ndeparture providing data required by public authorities relating to the ship.\n\nStandard.  The  General  Declaration  shall  be  the  basic  document  on  arrival  and\n\n2.2.1.\nfor both the arrival and the departure of the ship.\n\nRecommended Practice. The same form of General Declaration should be accepted\n\n2.2.2.\nrequire more than the following data:\n\nRecommended Practice. In the General Declaration, public authorities should not\n\nname, type and IMO number of ship\n\ncall sign\n\nflag State of ship\n\nvoyage number\n\n\f64\n\nparticulars regarding registry\n\nparticulars regarding tonnage\n\nname of master\n\nname and contact details of ship's agent\n\nbrief description of the cargo\n\nnumber of crew\n\nnumber of passengers\n\nbrief particulars of voyage\n\ndate and time of arrival/departure\n\nport of arrival/departure\n\nthe ship's requirements in terms of waste and residue reception facilities\n\nlast port of call/next port of call.\n\n2.2.3.\nStandard. Public authorities shall accept that the General Declaration is either dated\nand signed by the master, the ship's agent or some other person duly authorized by the master, or\nauthenticated in a manner acceptable to the public authority concerned.\n\n2.3.\nStandard.  The  Cargo  Declaration  shall  be  the  basic  document  on  arrival  and\ndeparture providing data required by public authorities relating to the cargo. However, particulars\nof any dangerous cargo may also be required to be furnished separately.\n\n2.3.1.\nrequire more than the following data:\n\nRecommended Practice. In the Cargo Declaration, public authorities should not\n\n(a)\n\non arrival\n\nname and IMO number of ship\n\nflag State of ship\n\nname of master\n\nvoyage number\n\nport of loading\n\nport where report is made\n\n\f65\n\nfreight container identification, where appropriate; marks and numbers; number and\nkind  of  packages;  quantity  and  description  of  the  goods  or,  if  available,  the\nHarmonized System (HS) code\n\ntransport document numbers for cargo to be discharged at the port in question\n\nports at which cargo remaining on board will be discharged\n\noriginal ports of shipment in respect of goods shipped under multimodal transport\ndocuments or through bills of lading\n\n(b)\n\non departure\n\nname and IMO number of ship\n\nflag State of ship\n\nname of master\n\nvoyage number\n\nport of discharge\n\nin respect of goods loaded at the port in question: freight container identification,\nwhere appropriate; marks and numbers; number and kind of packages; quantity and\ndescription of the goods or, if available, the Harmonized System (HS) code\n\ntransport document numbers for cargo loaded at the port in question.\n\n2.3.2.\nonly brief details of the minimum essential items of information to be furnished.\n\nStandard. In respect of cargo remaining on board, public authorities shall require\n\n2.3.3.\nStandard. Public authorities shall accept that the Cargo Declaration is either dated\nand signed by the master, the shipowner issuing the transport document, the ship's agent or some\nother person duly authorized by the master, or authenticated in a manner acceptable to the public\nauthority concerned.\n\n2.3.4.\nStandard. Public authorities shall accept in place of the Cargo Declaration a copy\nof the ship's manifest provided it contains at least the information required in accordance with\nRecommended Practice 2.3.1 and Standard 2.3.2 and is signed or authenticated, and dated, in\naccordance with Standard 2.3.3.\n\nRecommended Practice. As an alternative to Standard 2.3.4, public authorities may\n2.3.4.1.\naccept a copy of the transport document signed or authenticated in accordance with Standard\n2.3.3, or certified as a true copy, if the nature and quantity of cargo make this practicable and\n\n\f66\n\nprovided that any data required and identified in accordance with Recommended Practice 2.3.1\nand Standard 2.3.2 which does not appear in such documents is also furnished elsewhere and\nduly certified.\n\n2.3.5.\nStandard. Public authorities shall allow unmanifested parcels in possession of the\nmaster to be omitted from the Cargo Declaration provided that particulars of these parcels are\nfurnished separately.\n\n2.4.\ndeparture providing information required by public authorities relating to ship's stores.\n\nStandard. The Ship's Stores Declaration shall be the basic document on arrival and\n\n2.4.1.\nStandard. Public authorities shall accept that the Ship's Stores Declaration is either\ndated and signed by the master or by some other ship's officer duly authorized by the master and\nhaving personal knowledge of the facts regarding the ship's stores, or authenticated in a manner\nacceptable to the public authority concerned.\n\n2.5.\nStandard. The Crew's Effects Declaration shall be the basic document providing\ninformation required by public authorities relating to crew's effects. It shall not be required on\ndeparture.\n\n2.5.1.\nStandard.  Public  authorities  shall  accept  that  the  Crew's  Effects  Declaration  is\neither dated and signed by the master or by some other ship's officer duly authorized by the master,\nor authenticated in a manner acceptable to the public authority concerned. For the purpose of\nonboard verification, the public authorities may also require each crew member to sign or verify\nin a manner acceptable to the public authorities the declaration relating to his/her personal effects.\n\n2.5.2.\nRecommended Practice. Public authorities should normally require particulars of\nonly those crew's effects which would not qualify for relief from customs duties and taxes or\nwhich are subject to prohibitions or restrictions.\n\n2.6.\nStandard. The Crew List shall be the basic document required by public authorities\ncontaining data relating to the number and composition of the crew on the arrival and departure\nof a ship.\n\n2.6.1.\nfollowing data:\n\nStandard.  In  the  Crew  List,  public  authorities  shall  not  require  more  than  the\n\nname and IMO number of ship\n\nflag State of ship\n\n\f67\n\ncall sign\n\nvoyage number\n\nfamily name\n\ngive names\n\nnationality\n\nrank or rating\n\ngender\n\ndate and place of birth\n\nnature and number of identity document\n\nissuing State of identity document\n\nexpiry date of identity document\n\nport and date of arrival/departure of the ship\n\nlast pot of call.\n\n2.6.2.\nStandard.  Public  authorities  shall  accept  that  the  Crew  List  is  either  dated  and\nsigned by the master or by some other ship's officer duly authorized by the master, or authenticated\nin a manner acceptable to the public authority concerned.\n\n2.6.3.\n\nNot in use.\n\n2.6.4.\nRecommended Practice. The Passenger List shall be the basic document required\nby public authorities containing the data relating to passengers on the arrival and departure of a\nship.\n\n2.7.\nfollowing data:\n\nStandard.  In  the  Crew  List,  public  authorities  shall  not  require  more  than  the\n\n2.7.1.\n\nNot in use.\n\nRecommended  Practice.  Public  authorities  should  not  require  embarkation  or\n2.7.2.\ndisembarkation cards in addition to Passenger Lists in respect of passengers whose names appear\non those Lists. However, where public authorities have special problems constituting a grave\ndanger to public health, a person on an international voyage may on arrival be required to give a\ndestination address in writing.\n\n\f68\n\n2.7.3.\nfollowing data\n\nStandard. In the Passenger List, public authorities shall not require more than the\n\nname and IMO number of ship\n\ncall sign\n\nflag State of ship\n\nvoyage number\n\nfamily name\n\ngive names\n\nnationality\n\ndate of birth\n\nplace of birth\n\ngender\n\ntype of identity document\n\nserial number if identity or travel document\n\nissuing State of identity document\n\nexpiry date of identity document\n\nport of embarkation\n\nport and date of arrival/departure of the ship\n\ntransit passenger or not.\n\n2.7.4.\nRecommended  Practice.  A  list  compiled  by  the  shipowners  for  their  own  use\nshould be accepted in place of the Passenger List, provided it contains at least the information\nrequired in accordance with Standard 2.7.3 and is dated and signed or authenticated in accordance\nwith Standard 2.7.5.\n\n2.7.5.\nStandard. Public authorities shall accept that the Passenger List is either dated and\nsigned by the master, the ship's agent or some other person duly authorized by the master, or\nauthenticated in a manner acceptable to the public authority concerned.\n\n2.8.\npublic authorities with the information regarding dangerous goods.\n\nStandard. The Dangerous Goods Manifest shall be the basic document providing\n\n\f69\n\n2.8.1.\nmore than the following information:\n\nStandard. In the Dangerous Goods Manifest public authorities shall not require\n\nname of ship\n\nIMO number\n\ncall sign\n\nflag State of ship\n\nport of loading\n\nport of discharge\n\nstowage position\n\nreference number\n\nmarks and numbers\n\nfreight container identification No(s).\n\nvehicle registration No(s).\n\nUN Number\n\nproper shipping name/(Technical Specifications)\n\nclass/(subsidiary risk(s))\n\npacking group\n\nadditional information/marine pollutant/flash point/etc.\n\nnumber and kind of packages\n\nmass (kg) or volume (L)\n\nEmS\n\nshipping agent.\n\n2.9.\nStandard. Public authorities shall not require on arrival or departure of the ship any\nwritten declaration in respect of postal items other than that prescribed in the Universal Postal\nConvention, provided the latter is actually produced. In the absence of such a document, the postal\nobjects (number and weight) must be shown in the Cargo Declaration.\n\n\f70\n\n2.10.\nStandard.  The  Maritime  Declaration  of  Health  shall  be  the  basic  document\ncontaining the data required by port health authorities relating to the state of health on board a\nship during the voyage and on arrival at a port.\n\nC.\n\nDocuments on arrival\n\n2.11.\n1.3ter, public authorities shall in respect of a ship's arrival in port not require more than:\n\nStandard.  Until  the  expiration  of  the  transitional  period  referred  to  in  Standard\n\n5 copies of the General Declaration\n\n4 copies of the Cargo Declaration\n\n4 copies of the Ship's Stores Declaration\n\n2 copies of the Crew's Effects Declaration\n\n4 copies of the Crew List\n\n4 copies of the Passenger List\n\n1 copy of the Dangerous Goods Manifest\n\n1 copy of the Maritime Declaration of Health\n\n1  copy  of  the  security-related  information  as  required  under  SOLAS  regulation\nXI-2/9.2.2\n\n1 copy of the Advanced Notification Form for Waste Delivery to Port Reception\nFacilities when communicated to the Organization.\n\nUpon expiration of the transitional period, paper copies shall not be required except in case of\nforce majeure where means of electronic transmission are unavailable.\n\nD.\n\nDocuments on departure\n\n2.12.\n1.3ter, public authorities shall in respect of a ship's departure from port not require more than:\n\nStandard.  Until  the  expiration  of  the  transitional  period  referred  to  in  Standard\n\n5 copies of the General Declaration\n\n4 copies of the Cargo Declaration\n\n3 copies of the Ship's Stores Declaration\n\n2 copies of the Crew List\n\n\f71\n\n2 copies of the Passenger List\n\n1 copy of the Dangerous Goods Manifest.\n\nUpon expiration of the transitional period, paper copies shall not be required except in case of\nforce majeure where means of electronic transmission are unavailable.\n\n2.12.1.\nStandard. A new Cargo Declaration shall not be required on departure from a port\nin respect of cargo which has been the subject of a declaration on arrival in that port and which\nhas remained on board.\n\n2.12.2.\nRecommended Practice. A separate Ship's Stores Declaration on departure should\nnot be required in respect of ship's stores which have been the subject of a declaration on arrival,\nnor in respect of stores shipped in the port and covered by another customs document presented\nfor the purpose in that port.\n\n2.12.3.\nStandard. Where public authorities require information about the crew of a ship on\nits departure from the port, one of the copies of the Crew List presented on arrival at the port shall\nbe accepted on departure, provided it is signed again by the master or an officer duly authorized\nby  him/her,  and  endorsed  or  authenticated  in  a  manner  acceptable  to  the  public  authority\nconcerned, to indicate any change in the number or composition of the crew at the time of the\nship's departure or to indicate that no such change has occurred during the ship's stay in the port.\n\n2.13.\n\nNot in use.\n\nE.\n\nConsecutive calls at two or more ports in the same State\n\n2.14.\nStandard. Taking into account the procedures carried out on the arrival of a ship at\nthe first port of call in the territory of a State, shipowners shall only be obligated to submit required\ninformation once to the public authorities of a State. The formalities and documents required by\nthe public authorities at any subsequent port of call in that country visited without intermediate\ncall at a port in another country shall be kept to a minimum.\n\nF.\n\nCompletion of documents\n\nRecommended  Practice.  Public  authorities  should  as  far  as  possible  accept  the\n2.15.\ndocuments provided for in this annex, except as regards Standard 3.7, irrespective of the language\nin which the required data is furnished thereon, provided that they may require a written or oral\ntranslation into one of the official languages of their country or of the Organization when they\ndeem it necessary.\n\n\f72\n\n2.16.\nStandard. If public authorities require documents in paper form, they shall accept\ndocuments  conveyed  by  any  legible  and  understandable  medium,  including  documents\nhandwritten in ink or indelible pencil or produced by the use of information technology.\n\n2.16.1.\nStandard. Public authorities shall accept a signature, when required, in handwriting,\nin facsimile, perforated, stamped, in symbols, or made by any other mechanical or electronic\nmeans,  if  such  acceptance  is  not  inconsistent  with  national  laws.  The  authentication  of\ninformation submitted on non-paper media shall be in a manner that is acceptable to the public\nauthority concerned and which facilitates the electronic submission of the information by the\nparties concerned irrespective of their residence.\n\n2.17.\nStandard.  Public  authorities  of  the  country  of  any  intended  port  of  arrival,\ndischarge,  or  transit  shall  not  require  any  document  relating  to  the  ship,  its  cargo,  stores,\npassengers  or  crew,  as  mentioned  in  this  section,  to  be  legalized,  verified,  authenticated,  or\npreviously dealt with by any of their representatives abroad. This shall not be deemed to preclude\na requirement for the presentation of a passport or other identity document of a passenger or crew\nmember for visa or similar purposes.\n\nG.\n\nErrors and amendments in documentation and penalties therefor\n\n2.18.\nStandard. Public authorities shall, without delaying the ship, allow correction of\nerrors in a document provided for in this annex which they are satisfied are inadvertent, not of a\nserious  nature,  not  due  to  recurrent  carelessness  and  not  made  with  intent  to  violate  laws  or\nregulations, on the condition that these errors are discovered before the document is fully checked\nand the corrections can be effected without delay.\n\n2.19.\nStandard. If errors are found in the data transmitted as provided for in appendix 1\nof this annex, which have been signed by or on behalf of a shipowner or master, or otherwise\nauthenticated, no penalties shall be imposed until an opportunity has been given to satisfy the\npublic authorities that the errors were inadvertent, not of a serious nature, not due to recurrent\ncarelessness and not made with intent to violate the laws or regulations of the port State.\n\n2.19bis.\nsubmitted in accordance with applicable laws and regulations.\n\nStandard.  Public  authorities  shall  allow  for  amendments  to  information  already\n\nSpecial measures of facilitation for ships calling at ports in order to put ashore\nH.\nsick  or  injured  crew  members,  passengers,  persons  rescued  at  sea  or  other  persons  for\nemergency medical treatment\n\n\f73\n\n2.20.\nStandard. Public authorities shall seek the cooperation of shipowners to ensure that,\nwhen ships intend to call at ports for the sole purpose of putting ashore sick or injured crew\nmembers, passengers, persons rescued at sea, or other persons for emergency medical treatment,\nthe master shall give the public authorities as much notice as possible of that intention, with the\nfullest possible details of the sickness or injury and of the identity of the persons.\n\n2.21.\nStandard.  Public  authorities  shall,  by  the  fastest  channels  available,  inform  the\nmaster, before the arrival of the ship, of the documentation and the procedures necessary to put\nthe sick or injured persons ashore expeditiously and to clear the ship without delay.\n\n2.22.\nStandard. With regard to ships calling at ports for this purpose and intending to\nleave again immediately, public authorities shall give priority in berthing if the state of the sick\nperson or the sea conditions do not allow a safe disembarkation in the roads or harbour approaches.\n\n2.23.\nStandard. With regard to ships calling at ports for this purpose and intending to\nleave again immediately, public authorities shall not require the documents mentioned in Standard\n2.1  with  the  exception  of  the  Maritime  Declaration  of  Health,  and,  if  it  is  indispensable,  the\nGeneral  Declaration.  Public  authorities  shall  in  such  situations  waive  the  time  limits  for  the\nsubmission of the documents.\n\n2.24.\nStandard. Where public authorities require the General Declaration, this document\nshall not contain more data than those mentioned in Recommended Practice 2.2.2 and, wherever\npossible, shall contain less.\n\n2.25.\nStandard. Where the public authorities apply control measures related to the arrival\nof a ship prior to sick or injured persons being put ashore, emergency medical treatment and\nmeasures for the protection of public health shall take precedence over these control measures.\n\n2.26.\nStandard. Where the public authorities apply control measures related to the arrival\nof a ship prior to sick or injured persons being put ashore, emergency medical treatment and\nmeasures for the protection of public health shall take precedence over these control measures.\n\n2.27.\nStandard. Emergency medical treatment and measures for the protection of public\nhealth shall take precedence over any control measures which public authorities may apply to\nsick or injured persons being put ashore.\n\nSection 3 - Arrival and departure of persons\n\nThis section contains the provisions concerning the formalities required by public authorities\nfrom crew and passengers on the arrival or departure of a ship.\n\n\f74\n\nA.\n\nArrival and departure requirements and procedures\n\n3.1.\nwith information relating to the individual passenger on arrival or departure of a ship.\n\nStandard. A valid passport shall be the basic document providing public authorities\n\n3.1.1.\nRecommended Practice. Contracting Governments should as far as possible agree,\nby bilateral or multilateral agreements, to accept official documents of identity in lieu of passports.\n\n3.2.\nStandard. Public authorities shall make arrangements whereby passports, or official\ndocuments of identity accepted in their place, from ship's passengers need be inspected by the\nimmigration authorities only once at the time of arrival and once at the time of departure. In\naddition, these passports or official documents of identity may be required to be produced for the\npurpose  of  verification  or  identification  in  connection  with  customs  and  other  formalities  on\narrival and departure.\n\n3.3.\nStandard.  After  individual  presentation  of  passports  or  official  documents  of\nidentity accepted in their place, public authorities shall hand back such documents immediately\nafter examination rather than withholding them for the purpose of obtaining additional control,\nunless there is some obstacle to the admission of a passenger to the territory.\n\n3.3.1.\nStandard. Each Contracting Government shall ensure that the public authorities\nseize  fraudulent,  falsified  or  counterfeit  travel  documents  of  inadmissible  persons.  Such\ndocuments shall be removed from circulation and returned to the appropriate authorities when\npracticable. In place of a seized document, a covering letter shall be issued by the removing State\nand attached to it will be a photocopy of the forged travel documents, if available, as well as any\nimportant information. The covering letter and its attachment shall be handed over to the operator\nresponsible for the removal of the inadmissible person. It will serve to give information to the\nauthorities at the transit and/or the original point of embarkation.\n\n3.3.2.\nStandard. Contracting Governments shall accept for examination a person being\nreturned from his/her point of disembarkation after having been found inadmissible if this person\nhad embarked in their territory. Contracting Governments shall not return such a person to the\ncountry where he or she was earlier found to be inadmissible.\n\nStandard.  Before  passengers  and  crew  are  accepted  for  examination  as  to  their\n3.3.3.\nadmissibility  into  the  State,  responsibility  for  their  custody  and  care  shall  remain  with  the\nshipowner.\n\nRecommended Practice. After acceptance of passengers and crew for examination,\n3.3.4.\nwhether conditional or unconditional and if the persons concerned are under the physical control\n\n\f75\n\nof the public authorities, the public authorities should be responsible for their custody and care\nuntil they are admitted for entry or are found to be inadmissible.\n\n3.3.5.\nStandard. The obligation of a shipowner to transport any person away from the\nterritory of a State shall terminate from the moment such a person has been definitely admitted\ninto that State.\n\n3.3.6.\nStandard. Where a person is found to be inadmissible, the public authorities shall,\nwithout  unreasonable  delay,  inform  the  shipowner  and  consult  the  shipowner  regarding  the\narrangements for removal. The shipowner is responsible for the costs of stay and removal of an\ninadmissible person and, in the case where the person is transferred back to the custody of the\nshipowner, the shipowner shall be responsible for effecting his/her prompt removal to:\n\nthe country of embarkation; or\n\nto any other place where the person is admissible.\n\n3.3.7.\npracticable, to establish the validity and authenticity of passports and visas.\n\nStandard.  Contracting  Governments  and  shipowners  shall  cooperate,  where\n\n3.4.\nRecommended Practice. Public authorities should not require from embarking or\ndisembarking  passengers,  or  from  shipowners  on  their  behalf,  any  information  in  writing\nsupplementary to or repeating that already presented in their passports or official documents of\nidentity, other than as necessary to complete any documents provided for in this annex.\n\n3.5.\nRecommended Practice. Public authorities which require written supplementary\ninformation, other than as necessary to complete any documents provided for in this annex, from\nembarking or disembarking passengers should limit requirements for further identification of\npassengers  to  the  items  set  forth  in  Recommended  Practice  3.6  (embarkation/disembarkation\ncard). Public authorities should accept the embarkation/disembarkation card when completed by\nthe passenger and should not require that it be completed or checked by the shipowner. Legible\nhandwritten script should be accepted on the card, except where the form specifies block lettering.\nOne  copy  only  of  the  embarkation/disembarkation  card,  which  may  include  one  or  more\nsimultaneously prepared carbon copies, should be required from each passenger.\n\n3.6.\nauthorities should not require more than the following information:\n\nRecommended  Practice.  In\n\nthe  embarkation/disembarkation  card,  public\n\nfamily name\n\ngive names\n\n\f76\n\nnationality\n\nnumber and expiry date of passport or other official identity document\n\ndate of birth\n\nplace of birth\n\nport of embarkation/disembarkation\n\ngender\n\ndestination address\n\nsignature.\n\n3.7.\nStandard. In cases where evidence of protection against yellow fever is required\nfrom  persons  on  board  a  ship,  public  authorities  shall  accept  the  International  Certificate  of\nVaccination or Re-Vaccination in the forms provided for in the International Health Regulations.\n\n3.8.\nRecommended Practice. Medical examination of persons on board or of persons\ndisembarking  from  ships  should  normally  be  limited  to  those  persons  arriving  from  an  area\ninfected with quarantinable diseases within the incubation period of the disease concerned (as\nstated in the International Health Regulations). Additional medical examination may, however,\nbe required in accordance with the International Health Regulations.\n\n3.9.\nRecommended  Practice.  Public  authorities  should  normally  perform  customs\ninspections  of  inbound  passengers'  accompanied  baggage  on  a  sampling  or  selective  basis.\nWritten declarations in respect of passengers' accompanied baggage should be dispensed with as\nfar as possible.\n\n3.9.1.\nRecommended  Practice.  Public  authorities  should,  wherever  possible,  waive\ninspections of accompanied baggage of departing passengers, with due regard to the possible\nneed to impose appropriate security measures preferably by automated means to facilitate review.\n\n3.9.2.\nRecommended Practice. Where inspection of accompanied baggage of departing\npassengers cannot be waived completely, such inspection should normally be performed on a\nsampling or selective basis.\n\nStandard. A passport or an identity document issued in accordance with relevant\n3.10.\nILO Conventions, or else a valid and duly recognized seafarer's identity document, shall be the\nbasic document providing public authorities with information relating to the individual member\nof the crew on arrival or departure of a ship.\n\n\f77\n\n3.10.1.\nmore than the following information:\n\nStandard. In the seafarer's identity document, public authorities shall not require\n\nfamily name\n\ngive names\n\ngender\n\ndate and place of birth\n\nnationality\n\nphysical characteristics\n\nphotograph (authenticated)\n\nsignature\n\ndate of expiry (if any)\n\nissuing public authority.\n\n3.10.2.\npassenger by any means of transportation for the purpose of:\n\nStandard.  When  it  is  necessary  for  a  seafarer  to  enter  or  leave  a  country  as  a\n\n(a)\n\n(b)\n\njoining his/her ship or transferring to another ship,\n\npassing in transit to join his/her ship in another country, or for repatriation, or for any\nother purpose approved by the authorities of the country concerned,\n\npublic authorities shall accept from that seafarer in place of a passport the valid seafarer's identity\ndocument, when this document guarantees the readmission of the bearer to the country which\nissued the document.\n\n3.10.3.\nRecommended  Practice.  Public  authorities  should  not  normally  require\npresentation  of  individual  identity  documents  or  of  information  supplementing  the  seafarer's\nidentity document in respect of members of the crew other than that given in the Crew List.\n\nB.\n\nMeasures to facilitate clearance of passengers, crew and baggage\n\nRecommended  Practice.  Public  authorities  should,  with  the  cooperation  of\n3.11.\nshipowners and port authorities and/or port administration, take appropriate measures to the end\nthat satisfactory port traffic flow arrangements may be provided so that passengers, crew and\nbaggage  can  be  cleared  rapidly,  should  provide  adequate  personnel,  and  should  ensure  that\nadequate installations are provided, particular attention being paid to baggage loading, unloading\n\n\f78\n\nand conveyance arrangements (including the use of mechanized systems) and to points where\npassenger delays are frequently found to occur. Arrangements should be made, when necessary,\nfor passage under shelter between the ship and the point where the passenger and crew check is\nto be made. Such arrangements and installations should be flexible and capable of expansion to\nmeet increased security measures during higher security levels.\n\n3.11.1.\n\nRecommended Practice. Public authorities should:\n\n(a)\n\nin cooperation with shipowners and port authorities, introduce suitable arrangements,\nsuch as:\n\n(i)\n\n(ii)\n\n(iii)\n\nan  individual  and  continuous  method  of  processing  passengers  and\nbaggage;\n\na system which would permit passengers readily to identify and obtain\ntheir checked baggage as soon as it is placed in an area where it may be\nclaimed; and\n\nensuring that facilities and services are available to meet the needs of\nelderly and disabled passengers;\n\n(b)\n\nensure that port authorities take all necessary measures so that:\n\n(i)\n\n(ii)\n\neasy and speedy access for passengers and their baggage, to and from\nlocal transport, is provided; and\n\nif crews are required to report to premises for governmental purposes,\nthose premises should be readily accessible, and as close to one another\nas practicable.\n\n3.11.2.\nRecommended Practice. Public authorities should consider, as a means of ensuring\nprompt clearance, the introduction of the dual-channel system for the clearance of passengers,\nand their baggage and private road vehicles.\n\n3.12.\nStandard.  Public  authorities  shall  require  that  shipowners  ensure  that  ship's\npersonnel  take  all  appropriate  measures  which  will  help  expedite  arrival  procedures  for\npassengers and crew. These measures may include:\n\n(a)\n\nfurnishing  public  authorities  concerned  with  an  advance  message  giving  the  best\nestimated  time  of  arrival,  followed  by  information  as  to  any  change  in  time,  and\nstating the itinerary of the voyage where this may affect inspection requirements;\n\n(b)\n\nhaving ship's documents ready for prompt review;\n\n\f79\n\n(c)\n\n(d)\n\nproviding for ladders or other means of boarding to be rigged while the ship is en\nroute to berth or anchorage; and\n\nproviding for prompt, orderly assembling and presentation of persons on board, with\nnecessary  documents,  for  inspection,  with  attention  to  arrangements  for  relieving\ncrew members for this purpose from essential duties in engine-rooms and elsewhere.\n\n3.13.\nRecommended Practice. The practice of entering names on passenger and crew\ndocuments should be to put the family name or names first. Where both paternal and maternal\nfamily names are used, the paternal family name should be placed first. Where for married women\nboth the husband's and wife's paternal family names are used, the husband's paternal family name\nshould be placed first.\n\n3.14.\npresent on board a ship for examination as to their admissibility into the State.\n\nStandard.  Public  authorities  shall,  without  unreasonable  delay,  accept  persons\n\n3.15.\nRecommended  Practice.  Public  authorities  should  not  impose  unreasonable  or\ndisproportionate fines upon shipowners, in the event that any control document in possession of\na passenger is found by public authorities to be inadequate, or if, for that reason, the passenger\nis found to be inadmissible to the State.\n\n3.15.1.\nStandard. Public authorities shall encourage shipowners to take precautions at the\npoint of embarkation with a view to ensuring that passengers are in possession of any control\ndocuments prescribed by the receiving or transit States.\n\n3.15.2.\nStandard.  When  a  person  is  found  to  be  inadmissible  and  is  removed  from  the\nterritory of the State, the shipowner shall not be precluded from recovering, from such a person,\nany costs arising from his/her inadmissibility.\n\n3.15.3.\nRecommended Practice. For use at marine terminals and on board ships in order\nto facilitate and expedite international maritime traffic, public authorities should implement or,\nwhere the matter does not come within their jurisdiction, recommend responsible parties in their\ncountry to implement standardized international signs and symbols developed or accepted by the\nOrganization in cooperation with other appropriate international organizations and which, to the\ngreatest extent practicable, are common to all modes of transport.\n\nC.\n\nSpecial facilities for marine transport of elderly and disabled passengers\n\n\f80\n\n3.16.\nRecommended Practice. Measures should be taken to ensure that all necessary\ninformation on transport and safety is readily available for passengers who have impaired hearing\nor vision.\n\n3.17.\nRecommended Practice. For elderly and disabled passengers being set down or\npicked up at a terminal building, reserved points should be located as close as possible to main\nentrances. These should be clearly marked with appropriate signs. Access routes should be free\nof obstacles.\n\n3.18.\nRecommended Practice. Where access to public services is limited, every effort\nshould be made to provide accessible and reasonably priced public transportation services by\nadapting current and planned services or by providing special arrangements for passengers who\nhave impaired mobility.\n\n3.19.\nRecommended  Practice.  Provisions  of  suitable  facilities  should  be  made  in\nterminals and on ships, as appropriate, to allow safe embarkation and disembarkation for elderly\nand disabled passengers.\n\nD.\n\nFacilitation for ships engaged on cruises and for cruise passengers\n\n3.20.\nStandard.  Public  authorities  shall  authorize  granting  of  pratique  by  electronic\nmeans to a cruise ship when, on the basis of information received from it prior to its arrival, the\nhealth authority for the intended port of arrival is of the opinion that its arrival will not result in\nthe introduction or spread of a quarantinable disease.\n\n3.21.\nRecommended Practice. For cruise ships, the General Declaration, the Passenger\nList and the Crew List should be required only at the first port of arrival and final port of departure\nin a country, provided that there has been no change in the circumstances of the voyage.\n\n3.22.\nDeclaration shall be required only at the first port of arrival in a country.\n\nStandard. For cruise ships, the Ship's Stores Declaration and the Crew's Effects\n\n3.23.\nin the possession of cruise passengers.\n\nStandard. Passports or other official documents of identity shall at all times remain\n\nRecommended Practice. If a cruise ship stays at any port within the Contracting\n3.24.\nGovernment's territory for less than 72 hours, it should not be necessary for cruise passengers to\nhave visas, except in special circumstances determined by the public authorities concerned.\n\n\f81\n\n3.25.\nexercised by public authorities.\n\nStandard. Cruise passengers shall not be unduly delayed by the control measures\n\n3.26.\nStandard.  In  general,  except  for  security  purposes  and  for  the  purposes  of\nestablishing  identity  and  admissibility,  cruise  passengers  shall  not  be  subject  to  personal\nexamination by public authorities responsible for immigration control.\n\n3.27.\nStandard. If a cruise ship calls consecutively at more than one port in the same\ncountry, passengers shall, in general, be examined by public authorities at the first port of arrival\nand at the final port of departure only.\n\n3.28.\nRecommended  Practice.  To  facilitate  their  prompt  disembarkation,  the  inward\ncontrol of passengers on a cruise ship, where practicable, should be carried out on board before\narrival at the place of disembarkation.\n\n3.29.\nRecommended Practice. Cruise passengers who disembark at one port and rejoin\nthe same ship at another port in the same country should enjoy the same facilities as passengers\nwho disembark and rejoin a cruise ship at the same port.\n\n3.30.\nhealth control necessary for cruise passengers.\n\nRecommended Practice. The Maritime Declaration of Health should be the only\n\n3.31.\nduring the ship's stay in port.\n\nStandard. Duty-free ship's stores shall be allowed aboard ship for cruise passengers\n\n3.32.\nStandard. Cruise passengers shall not normally be required to provide a written\ndeclaration for their personal effects. However, in the case of articles which involve a high amount\nof  customs  duties  and  other  taxes  and  charges,  a  written  declaration  and  a  security  may  be\nrequired.\n\n3.33.\ncontrol.\n\n3.34.\npassengers.\n\nRecommended Practice. Cruise passengers should not be subject to any currency\n\nStandard.  Embarkation/disembarkation  cards  shall  not  be  necessary  for  cruise\n\n3.35.\n\nNot in use.\n\nE.\n\nSpecial measures of facilitation for passengers in transit\n\n\f82\n\n3.36.\nStandard. A passenger in transit who remains on board the ship on which he or she\narrived and departs with it shall not normally be subjected to routine control by public authorities\nexcept in extraordinary circumstances determined by the public authorities concerned.\n\n3.37.\npassport or other identity document.\n\nRecommended Practice. A passenger in transit should be allowed to retain his/her\n\n3.38.\nRecommended Practice. A passenger in transit who remains on board the ship on\nwhich he or she arrived and departs with it should not be required to complete a disembarkation/\nembarkation card.\n\n3.39.\nRecommended Practice. A passenger in transit who is continuing his/her journey\nfrom the same port in the same ship should normally be granted temporary permission to go\nashore  during  the  ship's  stay  in  port  if  he/she  so  wishes  subject  to  the  public  authorities'\nadmissibility and visa requirements.\n\n3.40.\nRecommended Practice. A passenger in transit who is continuing his/her journey\nfrom the same port in the same ship should not be required to have a visa, except in special\ncircumstances determined by the public authorities concerned.\n\n3.41.\nRecommended Practice. A passenger in transit who is continuing his/her journey\nfrom the same port in the same ship should not normally be required to give a written Customs\nDeclaration.\n\n3.42.\nRecommended Practice. A passenger in transit who leaves the ship at one port and\nembarks in the same ship at a different port in the same country should enjoy the same facilities\nas a passenger who arrives and departs in the same ship at the same port.\n\nF.\n\nMeasures of facilitation for ships engaged in scientific services\n\n3.43.\nRecommended Practice. A ship engaged in scientific services carries personnel\nwho are necessarily engaged on the ship for such scientific purposes of the voyage. If so identified,\nsuch personnel should be granted facilities at least as favourable as those granted to the crew\nmembers of that ship.\n\nG.\nengaged in international voyages - shore leave\n\nFurther measures of facilitation for foreigners belonging to the crews of ships\n\nStandard. Crew members shall be allowed ashore by the public authorities while\n3.44.\nthe ship on which they arrive is in port, provided that the formalities on arrival of the ship have\n\n\f83\n\nbeen fulfilled and the public authorities have no reason to refuse permission to come ashore for\nreasons of public health, public safety or public order. Shore leave shall be allowed in a manner\nwhich excludes discrimination such as on the grounds of nationality, race, colour, sex, religion,\npolitical opinion, or social origin and irrespective of the flag State of the ship on which they are\nemployed, engaged or work.\n\n3.44bis.\nStandard.  In  any  case  where  permission  for  shore  leave  has  been  refused,  the\nrelevant public authorities shall communicate their reasons for shore leave denial to the seafarer\nconcerned and the master. If requested by the seafarer concerned or the master, such reasons shall\nbe provided in writing.\n\n3.45.\nshore leave.\n\nStandard. Crew members shall not be required to hold a visa for the purpose of\n\n3.46.\nleave, should not normally be subjected to personal checks.\n\nRecommended Practice. Crew members, before going on or returning from shore\n\n3.47.\nleave pass, for the purpose of shore leave.\n\nStandard. Crew members shall not be required to have a special permit, e.g. a shore\n\n3.48.\nRecommended  Practice.  If  crew  members  are  required  to  carry  documents  of\nidentity with them when they are on shore leave, these documents should be limited to those\nmentioned in Standard 3.10.\n\n3.49.\nRecommended Practice. Public authorities should provide a system of pre-arrival\nclearance to allow the crew of ships which call regularly at their ports to obtain advance approval\nfor  temporary  shore  leave.  Where  a  ship  has  no  adverse  immigration  record  and  is  locally\nrepresented by a shipowner or a reputable agent of the shipowner, the public authorities should\nnormally,  after  satisfactory  consideration  of  such  pre-arrival  particulars  as  they  may  require,\npermit the ship to proceed directly to its berth and be subject to no further routine immigration\nformalities, unless otherwise required by the public authorities.\n\nSection 4 - Stowaways\n\nA.\n\nGeneral Principles\n\nStandard.  The  provisions  in  this  section  shall  be  applied  in  accordance  with\n4.1.\ninternational  protection  principles  as  set  out  in  international  instruments,  such  as  the  UN\nConvention relating to the Status of Refugees of 28 July 1951 and the UN Protocol relating to\nthe Status of Refugees of 31 January 1967, and relevant national legislation.\n\n\f84\n\n4.2.\nStandard.  Public  authorities,  port  authorities,  shipowners  and  masters  shall\ncooperate to the fullest extent possible in order to prevent stowaway incidents and to resolve\nstowaway cases expeditiously and secure that an early return or repatriation of the stowaway will\ntake place. All appropriate measures shall be taken in order to avoid situations where stowaways\nmust stay on board ships for an unreasonable amount of time.\n\nB.\n\n4.3.\n\nPreventive measures\n\nShip/Port preventive measures\n\n4.3.1.\n\nPort/terminal authorities\n\n4.3.1.1.\nStandard. Contracting Governments shall ensure that the necessary infrastructure,\nand operational and security arrangements for the purpose of preventing persons attempting to\nstowaway on board ships from gaining access to port installations and to ships, are established\nin all their ports, taking into consideration when developing these arrangements the size of the\nport, and what type of cargo is shipped from the port. This should be done in close cooperation\nwith relevant public authorities, shipowners and shoreside entities, with the aim of preventing\nstowaway occurrences in the individual port.\n\n4.3.1.2.\nRecommended  Practice.  Operational  arrangements  and/or  port  facility  security\nplans should at least be equivalent to those contained in the relevant text of section B/16 of the\nISPS Code.\n\n4.3.2.\n\nShipowner/Master\n\n4.3.2.1.\nStandard. Contracting Governments shall require that shipowners and masters, as\nwell as other responsible persons have security arrangements in place which, as far as practicable,\nwill  prevent  intending  stowaways  from  getting  aboard  the  ship,  and,  if  this  fails,  as  far  as\npracticable, will detect them before the ship leaves port.\n\n4.3.2.2.\nRecommended Practice. When calling at ports and during stay in ports, where there\nis risk of stowaway embarkation, operational arrangements and/or ship security plans should at\nleast be equivalent to those contained in the relevant text of paragraph B/9 of the ISPS Code.\n\nStandard. Contracting Governments shall require that ships entitled to fly their flag,\n4.3.2.3.\nexcept passenger ships, when departing from a port, where there is risk of stowaway embarkation,\nhave  undergone  a  thorough  search  in  accordance  with  a  specific  plan  or  schedule,  and  with\npriorities given to places where stowaways might hide taking into account the specific ship type\nand its operations. Search methods which are likely to harm secreted stowaways shall not be used.\n\n\f85\n\n4.3.2.4.\nStandard.  Contracting  Governments  shall  require  that  fumigation  or  sealing  of\nships  entitled  to  fly  their  flag  may  not  be  carried  out  until  a  search  which  is  as  thorough  as\npracticable  of  the  areas  to  be  fumigated  or  sealed  has  taken  place  in  order  to  ensure  that  no\nstowaways are present in those areas.\n\n4.3.3.\n\nNational Sanctions\n\n4.3.3.1.\nStandard. Where appropriate, Contracting Governments shall incorporate into their\nnational legislation legal grounds to allow prosecution of stowaways, attempted stowaways and\nany individual or company aiding a stowaway or an attempted stowaway with the intention to\nfacilitate access to the port area, any ship, cargo or freight containers.\n\nC.\n\n4.4.\n\nTreatment of the stowaway while on board\n\nGeneral principles – Humane treatment\n\n4.4.1.\nStandard. Stowaways shall not be permitted to work on board the ship, except in\nemergency situations or in relation to the stowaway's accommodation and provisioning on board.\n\n4.4.2.\nStandard.  Contracting  Governments  shall  require  that  masters  operating  ships\nentitled to fly their flag take appropriate measures to ensure the security, general health, welfare\nand safety of the stowaway while he/she is on board, including providing him/her with adequate\nprovisioning, accommodation, proper medical attention and sanitary facilities.\n\n4.5.\n\nWork on board\n\n4.5.1.\nStandard. Stowaways shall not be permitted to work on board the ship, except in\nemergency situations or in relation to the stowaway's accommodation and provisioning on board.\n\n4.6.\n\nQuestioning and notification by the master\n\n4.6.1.\nStandard. Contracting Governments shall require masters to take practicable steps\nto  establish  the  identity,  including  nationality/citizenship  of  the  stowaway  and  the  port  of\nembarkation of the stowaway, and to notify the existence of the stowaway along with relevant\ndetails to the public authorities of the first planned port of call. This information shall also be\nprovided to the shipowner, public authorities at the port of embarkation, the flag State and, if\nnecessary, subsequent ports of call.\n\n4.6.2.\nshould use the form as specified in appendix 3.\n\nRecommended Practice. When gathering relevant details for notification, masters\n\n\f86\n\n4.6.3.\nStandard. Contracting Governments shall instruct masters operating ships entitled\nto fly their flag that when a stowaway declares himself/herself to be a refugee, this information\nshall be treated as confidential to the extent necessary for the security of the stowaway.\n\n4.7.\n\nNotification to the International Maritime Organization\n\n4.7.1.\nbecome aware to the Secretary-General of the International Maritime Organization.\n\nStandard.  Public  authorities  shall  report  all  stowaway  incidents  of  which  they\n\nD.\n\nDeviation from the planned route\n\n4.8.\nStandard. Public authorities shall urge all shipowners operating ships entitled to\nfly  their  flag  to  instruct  their  masters  not  to  deviate  from  the  planned  voyage  to  seek  the\ndisembarkation of stowaways discovered on board the ship after it has left the territorial waters\nof the country where the stowaways embarked, unless:\n\npermission to disembark the stowaway has been granted by the public authorities of\nthe State to whose port the ship deviates; or\n\nrepatriation  has  been  arranged  elsewhere  with  sufficient  documentation  and\npermission for disembarkation; or\n\nthere are extenuating safety, security, health or compassionate reasons; or\n\nattempts to disembark in other ports on the planned voyage have failed and deviation\nis necessary in order to avoid that the stowaway remain on board for a significant\nperiod of time.\n\nE.\n\n4.9.\n\nDisembarkation and return of a stowaway\n\nThe State of the first port of call according to the voyage plan\n\n4.9.1.\nStandard. Public authorities in the country of the ship's first scheduled port of call\nafter discovery of a stowaway shall decide in accordance with national legislation whether the\nstowaway  is  admissible  to  that  State  and  shall  do  their  utmost  to  cooperate  with  the  parties\ninvolved in resolving the issue.\n\nStandard. Public authorities in the country of the ship's first scheduled port of call\n4.9.2.\nafter discovery of a stowaway shall allow disembarkation of the stowaway, when the stowaway\nis in possession of valid travel documents for return, and the public authorities are satisfied that\ntimely arrangements have been or will be made for repatriation and all the requisites for transit\nfulfilled.\n\n\f87\n\n4.9.3.\nStandard. Public authorities in the country of the ship's first scheduled port of call\nafter  discovery  of  a  stowaway  shall  allow  disembarkation  of  the  stowaway  when  the  public\nauthorities are satisfied that they or the shipowner will obtain valid travel documents, make timely\narrangements  for  repatriation  of  the  stowaway,  and  fulfil  all  the  requisites  for  transit.  Public\nauthorities shall, further, favourably consider allowing disembarkation of the stowaway, when it\nis  impracticable  for  the  stowaway  to  remain  on  the  ship  or  other  factors  exist  which  would\npreclude the stowaway remaining on the ship. Such factors may include, but are not limited to,\nwhen:\n\na case is unresolved at the time of sailing of the ship; or\n\nthe presence on board of the stowaway would endanger the safe operation of the ship,\nthe health of the crew or the stowaway.\n\n4.10.\n\nSubsequent ports of call\n\n4.9.1.\nStandard. When disembarkation of a stowaway has failed in the first scheduled port\nof call after discovery of the stowaway, public authorities of subsequent ports of call shall examine\nthe stowaway as for disembarkation in accordance with Standards 4.9.1, 4.9.2 and 4.9.3.\n\n4.11.\n\nState of Nationality or Right of Residence\n\n4.11.1.\nStandard. Public authorities shall in accordance with international law accept the\nreturn of stowaways with full nationality/citizenship status or accept the return of stowaways who\nin accordance with their national legislation have a right of residence in their State.\n\n4.11.2.\nStandard. Public authorities shall, when possible, assist in determining the identity\nand nationality/citizenship of stowaways claiming to be a national or having a right of residence\nin their State. Where possible, the local embassy, consulate or other diplomatic representation of\nthe country of the stowaway's nationality will be required to assist in verifying the stowaway's\nnationality and providing emergency travel documentation.\n\n4.12.\n\nState of Embarkation\n\n4.12.1.\nStandard. When it has been established to their satisfaction that stowaways have\nembarked  a  ship  in  a  port  in  their  State,  public  authorities  shall  accept  for  examination  such\nstowaways  being  returned  from  their  point  of  disembarkation  after  having  been  found\ninadmissible  there.  The  public  authorities  of  the  State  of  embarkation  shall  not  return  such\nstowaways to the country where they were earlier found to be inadmissible.\n\n\f88\n\n4.12.2.\nStandard.  When  it  has  been  established  to  their  satisfaction  that  attempted\nstowaways  have  embarked  a  ship  in  a  port  in  their  State,  public  authorities  shall  accept\ndisembarkation of attempted stowaways, and of stowaways found on board the ship while it is\nstill in their territorial waters or if applicable according to the national legislation of that State in\nthe area of immigration jurisdiction of that State. No penalty or charge in respect of detention or\nremoval costs shall be imposed on the shipowner.\n\n4.12.3.\nStandard. When an attempted stowaway has not been disembarked at the port of\nembarkation,  he/she  is  to  be  treated  as  a  stowaway  in  accordance  with  the  regulation  of  this\nsection.\n\n4.13.\n\nThe flag State\n\n4.13.1.\ncooperate with the master/shipowner or the appropriate public authority at ports of call in:\n\nStandard.  The  public  authorities  of  the  flag  State  of  the  ship  shall  assist  and\n\nidentifying the stowaway and determining his/her nationality;\n\nmaking representations to the relevant public authority to assist in the removal of the\nstowaway from the ship at the first available opportunity; and\n\nmaking arrangements for the removal or repatriation of the stowaway.\n\n4.14.\n\nReturn of stowaways\n\n4.14.1.\nRecommended  Practice.  When  a  stowaway  has  inadequate  documents,  public\nauthorities should, whenever practicable and to an extent compatible with national legislation\nand security requirements, issue a covering letter with a photograph of the stowaway and any\nother important information or, alternatively, a suitable travel document accepted by the public\nauthorities involved. The covering letter, authorizing the return of the stowaway either to his/her\ncountry of origin or to the point where the stowaway commenced his/her journey, as appropriate,\nby any means of transportation and specifying any other conditions imposed by the authorities,\nshould be handed over to the operator affecting the removal of the stowaway. This letter will\ninclude information required by the authorities at transit points and/or the point of disembarkation.\n\n4.14.2.\nRecommended Practice. Public authorities in the State where the stowaway has\ndisembarked should contact the relevant public authorities at transit points during the return of a\nstowaway, in order to inform them of the status of the stowaway. In addition public authorities\nin countries of transit during the return of any stowaway should allow, subject to normal visa\nrequirements  and  national  security  concerns,  the  transit  through  their  ports  and  airports  of\n\n\f89\n\nstowaways travelling under the removal instructions or directions of public authorities of the\ncountry of the port of disembarkation.\n\n4.14.3.\nRecommended  Practice.  When  a  port  State  has  refused  disembarkation  of  a\nstowaway, that State should, without undue delay, notify the flag State of the ship carrying the\nstowaway of the reasons for refusing disembarkation.\n\n4.15.\n\nCost of return and maintenance of stowaways\n\n4.15.1.\nRecommended Practice. The public authorities of the State where a stowaway has\nbeen disembarked should generally inform the shipowner on whose ship the stowaway was found,\nas far as practicable, of the level of cost of detention and return and any additional costs for the\ndocumentation  of  the  stowaway,  if  the  shipowner  is  to  cover  these  costs.  In  addition,  public\nauthorities  should  cooperate  with  the  shipowner  to  keep  such  costs  to  a  minimum  as  far  as\npracticable and according to national legislation, if they are to be covered by the shipowner.\n\n4.15.2.\nRecommended Practice. The period during which shipowners are held liable to\ndefray costs of maintenance of a stowaway by public authorities in the State where the stowaway\nhas been disembarked should be kept to a minimum.\n\n4.15.3.\nStandard.  Public  authorities  shall,  according  to  national  legislation,  consider\nmitigation  of  penalties  against  ships  where  the  master  of  the  ship  has  properly  declared  the\nexistence of a stowaway to the appropriate authorities in the port of arrival, and has shown that\nall reasonable preventive measures had been taken to prevent stowaways gaining access to the\nship.\n\n4.15.4.\nRecommended  Practice.  Public  authorities  should,  according  to  national\nlegislation,  consider  mitigation  of  other  charges  that  might  otherwise  be  applicable,  when\nshipowners have cooperated with the control authorities to the satisfaction of those authorities in\nmeasures designed to prevent the transportation of stowaways.\n\nSection 5 - Arrival, stay and departure of cargo and other articles\n\nThis section contains the provisions concerning the formalities required by public authorities\nfrom the shipowner, his/her agent or the master of the ship.\n\nA.\n\nGeneral\n\nRecommended  Practice.  Public  authorities  should,  with  the  cooperation  of\n5.1.\nshipowners, port authorities and port facilities and terminals, take appropriate measures to ensure\n\n\f90\n\nthat  port  time  may  be  kept  to  a  minimum,  should  provide  satisfactory  port  traffic  flow\narrangements, and should frequently review all procedures in connection with the arrival and\ndeparture  of  ships,  including  arrangements  for  embarkation  and  disembarkation,  loading  and\nunloading, servicing and the like and the security measures associated therewith. They should\nalso make arrangements whereby cargo ships and their loads can be entered and cleared, in so\nfar as may be practicable, at the ship working area.\n\n5.2.\nRecommended  Practice.  Public  authorities  should,  with  the  cooperation  of\nshipowners, port authorities and port facilities and terminals, take appropriate measures to ensure\nthat  satisfactory  port  traffic  flow  arrangements  are  provided  so  that  handling  and  clearance\nprocedures for cargo will be smooth and uncomplicated. These arrangements should cover all\nphases from the time the ship arrives at the dock for unloading and public authority clearance,\nand also free zones, storage facilities, warehousing and onward movement of cargo if required.\nThere should be convenient and direct access between the free zone, storage facilities and cargo\nwarehouse and the public authority clearance area, which should be located close to the dock area\nwith, whenever possible, easy access and transfer capabilities and infrastructure.\n\n5.3.\nRecommended  Practice.  Public  authorities  should  encourage  owners  and/or\noperators of marine cargo terminals to equip them with storage facilities for special cargo (e.g.\nvaluable goods, perishable shipments, human remains, radioactive and other dangerous goods,\nas well as live animals), as appropriate; those areas of marine cargo terminals in which general\nand special cargo and postal items are stored prior to shipment by sea or importation should\nimplement access control measures at least equivalent to those contained in the relevant text of\nparagraph B/16 of the ISPS Code.\n\n5.3bis.\nRecommended Practice. Public authorities should require only a minimum of data\nnecessary for the identification of the cargo that is to be placed in storage prior to release or re-\nexport or importation, and should, whenever available, use the information contained in the pre-\narrival declaration for this purpose.\n\n5.4.\nStandard. A Contracting Government which continues to require export, import\nand transhipment licences or permits for certain types of goods shall establish simple procedures\nwhereby such licences or permits can be obtained and renewed rapidly.\n\nRecommended  Practice.  When  the  nature  of  a  consignment  could  attract  the\n5.5.\nattention of different agencies authorized to carry out inspections, such as customs and veterinary\nor sanitary controllers, Contracting Governments should authorize either customs or one of the\nother agencies to carry out the required procedures or, where that is not feasible, take all necessary\nsteps  to  ensure  that  such  inspections  are  carried  out  simultaneously  at  one  place  and  with  a\n\n\f91\n\nminimum  of  delay  and  whenever  possible  carried  out  upon  prior  coordination  with  the  party\nhaving custody of the consignment.\n\n5.6.\nRecommended Practice. Public authorities should provide simplified procedures\nfor the prompt clearance of private gift packages and trade samples not exceeding a certain value\nor quantity which should be set at as high a level as possible.\n\nB.\n\nClearance of cargo\n\n5.7.\nStandard.  Public  authorities  shall,  subject  to  compliance  with  any  national\nprohibitions  or  restrictions  and  any  measures  required  for  port  security  or  the  prevention  of\ntrafficking  of  narcotics,  grant  priority  clearance  to  live  animals,  perishable  goods  and  other\nconsignments of an urgent nature.\n\n5.7.1.\nRecommended Practice. In order to protect the quality of goods awaiting clearance,\npublic authorities should, in collaboration with all the concerned parties, take all measures to\npermit practical, safe and reliable storage of goods at the port.\n\n5.8.\nRecommended Practice. Contracting Governments should facilitate the temporary\nadmission of specialized cargo-handling equipment arriving by ships and used on shore at ports\nof call for loading, unloading and handling cargo.\n\n5.9.\n\nNot in use.\n\n5.10.\nRecommended  Practice.  Public  authorities  should  provide  procedures  for  the\nclearance  of  cargo  based  on  the  relevant  provisions  of  and  associated  guidelines  to  the\nInternational Convention on the simplification and harmonization of Customs procedures – the\nrevised Kyoto Convention.\n\n5.10.1.\nfor authorized persons allowing:\n\nRecommended Practice. Public authorities should introduce simplified procedures\n\n(a)\n\nrelease  of  the  goods  on  the  provision  of  the  minimum  information  necessary  to\nidentify the goods, to accurately identify and assess risk as it relates to concerns such\nas health, safety and security, and permit the subsequent completion of the final goods\ndeclaration;\n\n(b)\n\nclearance of the goods at the declarants premises or another place authorized by the\nrelevant public authority; and\n\n\f92\n\n(c)\n\nsubmission of a single goods declaration for all imports or exports in a given period\nwhere goods are imported or exported frequently by the same person.\n\n5.11.\nnecessary to ensure compliance with applicable law.\n\nStandard.  Public  authorities  shall  limit  physical  interventions  to  the  minimum\n\n5.12.\nRecommended Practice. Public authorities should, on the basis of a valid request,\nconduct physical examinations of cargo, where necessary, at the point where it is loaded into its\nmeans of transport and while loading is in progress, either at the dockside or, in the case of unitized\ncargo, at the place where the freight container is packed and sealed.\n\n5.13.\nstatistics do not significantly reduce the efficiency of maritime trade.\n\nStandard.  Public  authorities  shall  ensure  that  requirements  for  collection  of\n\n5.14.\nRecommended Practice. Public authorities should use systems for the electronic\nexchange of information for the purposes of obtaining information in order to accelerate and\nsimplify storage, clearance and re-export processes.\n\n5.14.1.\nprocedure covering goods from another State awaiting loading.\n\nRecommended  Practice.  Public  authorities  should  quickly  terminate  the  transit\n\nC.\n\nFreight containers and pallets\n\n5.15.\nStandard. Public authorities shall, in conformity with their respective regulations,\npermit the temporary admission of freight containers, pallets and freight container equipment and\naccessories that are affixed to the container or are being transported separately without payment\nof customs duties and other taxes and charges and shall facilitate their use in maritime traffic.\n\n5.16.\nRecommended  Practice.  Public  authorities  should  provide  in  their  regulations,\nreferred  to  in  Standard  5.15,  for  the  acceptance  of  a  simple  declaration  to  the  effect  that\ntemporarily imported freight containers, pallets and freight container equipment and accessories\nwill be re-exported within the time limit set by the State concerned. Such declaration may take\nthe form of an oral declaration or any other act acceptable to the authorities.\n\nStandard.  Public  authorities  shall  permit  freight  containers,  pallets  and  freight\n5.17.\ncontainer  equipment  and  accessories  entering  the  territory  of  a  State  under  the  provisions  of\nStandard 5.15 to depart the limits of the port of arrival for clearance of imported cargo and/or\nloading  of  export  cargo  under  simplified  control  procedures  and  with  a  minimum  of\ndocumentation.\n\n\f93\n\n5.18.\nStandard.  Contracting  Governments  shall  permit  the  temporary  admission  of\ncomponent parts of freight containers without payment of customs duties and other taxes and\ncharges when these parts are needed for the repair of freight containers already admitted under\nthe terms of Standard 5.15.\n\nD.\n\nCargo not discharged at the port of intended destination\n\n5.19.\nStandard. Where any cargo listed on the Cargo Declaration is not discharged at the\nport of intended destination, public authorities shall permit amendment of the Cargo Declaration\nand shall not impose penalties if satisfied that the cargo was not in fact loaded on the ship, or, if\nloaded, was landed at another port.\n\n5.20.\nStandard. When, by error or for another valid reason, any cargo is discharged at a\nport other than the port of intended destination, public authorities shall facilitate reloading or\nonward movement to its intended destination. This provision does not apply to prohibited or\nrestricted cargo.\n\nE.\n\nLimitation of shipowner's responsibilities\n\n5.21.\nStandard.  Public  authorities  shall  not  require  a  shipowner  to  place  special\ninformation for use of such authorities on a transport document or a copy thereof, unless the\nshipowner is, or is acting for, the importer or exporter.\n\n5.22.\nStandard.  Public  authorities  shall  not  hold  the  shipowner  responsible  for  the\npresentation  or  accuracy  of  documents  which  are  required  of  the  importer  or  exporter  in\nconnection with the clearance of cargo, unless the shipowner is, or is acting for, the importer or\nexporter.\n\n5.23.\nStandard. The shipowner shall be obliged to provide the information regarding the\nentry or exit of goods known to the shipowner at the time of lodging such data and as set out in\nthe  transport  document  that  evidences  the  bill  of  lading.  Thus,  the  shipowner  can  base  the\nlodgement on data provided by the shipper customer, unless the shipowner has reason to believe\nthat the data provided is untrue.\n\nRecommended Practice. Public authorities should implement regulations pursuant\n5.24.\nto which the person who initiates and contractually agrees with a party (e.g. a consolidator, a\nfreight forwarder or a shipowner) for the carriage of a maritime cargo shipment to the territory\nof another State must provide complete and accurate cargo shipment information to that party.\n\n\f94\n\nSection  6  -  Public  health  and  quarantine,  including  sanitary  measures  for  animals  and\nplants\n\n6.1.\nStandard.  Public  authorities  of  a  State  not  Party  to  the  International  Health\nRegulations shall endeavour to apply the relevant provisions for these Regulations to international\nshipping.\n\n6.2.\nRecommended  Practice.  Contracting  Governments  having  certain  interests  in\ncommon  owing  to  their  health,  geographical,  social  or  economic  conditions  should  conclude\nspecial arrangements pursuant to article 85 of the International Health Regulations when such\narrangements will facilitate the application of those Regulations.\n\n6.3.\nRecommended  Practice.  Where  Sanitary  Certificates  or  similar  documents  are\nrequired in respect of shipments of certain animals, plants or products thereof, such certificates\nand documents should be simple and widely publicized and Contracting Governments should\ncooperate with a view to standardizing such requirements.\n\n6.4.\nRecommended Practice. Public authorities should authorize granting of pratique\nby electronic means to a ship when, on the basis of information received from it prior to its arrival,\nthe health authority for the intended port of arrival is of the opinion that its arrival will not result\nin  the  introduction  or  spread  of  a  quarantinable  disease.  Health  authorities  should  as  far  as\npracticable be allowed to join a ship prior to entry of the ship into port.\n\n6.4.1.\nStandard.  Public  authorities  shall  seek  the  cooperation  of  shipowners  to  ensure\ncompliance with any requirement that illness on a ship is to be reported promptly by electronic\nmeans  to  health  authorities  for  the  port  for  which  the  ship  is  destined,  in  order  to  facilitate\nprovision for the presence of any special medical personnel and equipment necessary for health\nprocedures on arrival.\n\n6.5.\nStandard. Public authorities shall make arrangements to enable all travel agencies\nand others concerned to make available to passengers, sufficiently in advance of departure, lists\nof  the  vaccinations  required  by  the  public  authorities  of  the  countries  concerned,  as  well  as\nvaccination  certificate  forms  conforming  to  the  International  Health  Regulations.  Public\nauthorities shall take all possible measures to have vaccinators use the International Certificates\nof Vaccination or Re-Vaccination in order to assure uniform acceptance.\n\nRecommended  Practice.  Public  authorities  should  provide  facilities  for  the\n6.6.\ncompletion of International Certificates of Vaccination or Re-Vaccination as well as facilities for\nvaccination at as many ports as feasible.\n\n\f95\n\n6.7.\nStandard.  Public  authorities  shall  ensure  that  sanitary  measures  and  health\nformalities are initiated forthwith, completed without delay, and applied without discrimination.\n\n6.8.\nRecommended  Practice.  To  ensure,  interalia,  efficient  maritime  traffic,  public\nauthorities should maintain at as many ports as feasible adequate facilities for the administration\nof public health, animal and agricultural quarantine measures.\n\n6.9.\nStandard. There shall be maintained readily available at as many ports in a State\nas  feasible  such  medical  facilities  as  may  be  reasonable  and  practicable  for  the  emergency\ntreatment of crews and passengers.\n\n6.10.\nStandard. Except in the case of an emergency constituting a grave danger to public\nhealth, a ship which is not infected or suspected of being infected with a quarantinable disease\nshall not, on account of any other epidemic disease, be prevented by the health authorities for a\nport from discharging or loading cargo or stores or taking on fuel or water.\n\n6.11.\nRecommended Practice. Shipments of animals, animal raw materials, crude animal\nproducts, animal foodstuffs and quarantinable plant products should be permitted in specified\ncircumstances and when the certification requirements have been met at the time of discharge.\n\nSection 7- Miscellaneous provisions\n\nA.\n\nBonds and other forms of security\n\n7.1.\nRecommended Practice. Where public authorities require bonds or other forms of\nsecurity  from  shipowners  to  cover  liabilities  under  the  customs,  immigration,  public  health,\nagricultural quarantine or similar laws and regulations of a State, they should permit the use of\na single comprehensive bond or other form of security wherever possible.\n\nB.\n\nServices at ports\n\n7.2.\nRecommended Practice. The normal services of public authorities at a port should\nbe provided without charge during normal working hours. Public authorities should establish\nnormal working hours for their services at ports consistent with the usual periods of substantial\nworkload.\n\nStandard.  Contracting  Governments  shall  adopt  all  practicable  measures  to\n7.3.\norganize the normal services of public authorities at ports in order to avoid unnecessary delay of\nships after their arrival or when ready to depart and reduce the time for completion of formalities\n\n\f96\n\nto a minimum, provided that sufficient notice of estimated time of arrival or departure shall be\ngiven to the public authorities.\n\n7.4.\nStandard.  No  charge  shall  be  made  by  a  health  authority  for  any  medical\nexamination, or any supplementary examination, whether bacteriological or otherwise, carried\nout at any time of the day or night, if such examination is required to ascertain the health of the\nperson  examined,  nor  for  visit  to  and  inspection  of  a  ship  for  quarantine  purposes  except\ninspection of a ship for the issue of a Ship Sanitation Control Certificate or Ship Sanitation Control\nExemption Certificate, nor shall a charge be made for any vaccination of a person arriving by\nship nor for a certificate thereof. However, where measures other than these are necessary in\nrespect of a ship or its passengers or crew and charges are made for them by a health authority,\nsuch charges shall be made in accordance with a single tariff which shall be uniform to the territory\nconcerned and they shall be levied without distinction as to the nationality, domicile or residence\nof any person concerned or as to the nationality, flag, registry or ownership of the ship.\n\n7.5.\nRecommended  Practice.  When  the  services  of  public  authorities  are  provided\noutside  the  regular  working  hours  referred  to  in  Recommended  Practice  7.2,  they  should  be\nprovided on terms which shall be moderate and not exceed the actual cost of the services rendered.\n\n7.6.\nStandard. Where the volume of traffic at a port warrants, public authorities shall\nensure that services are provided for the accomplishment of the formalities in respect of cargo\nand baggage, regardless of value or type.\n\n7.7.\nRecommended  Practice.  Contracting  Governments  should  endeavour  to  make\narrangements whereby one Government will permit another Government certain facilities before\nor during the voyage to examine ships, passengers, crew, baggage, cargo and documentation for\ncustoms, immigration, public health, plant and animal quarantine purposes when such action will\nfacilitate clearance upon arrival in the latter State.\n\nC.\n\nEmergency assistance\n\n7.8.\nengaged in\n\nStandard.  Public  authorities  shall  facilitate  the  arrival  and  departure  of  ships\n\ndisaster relief work;\n\nthe rescue of persons in distress at sea in order to provide a place of safety for such\npersons;\n\nthe combating or prevention of marine pollution; or\n\n\f97\n\nother emergency operations designated to enhance maritime safety, the safety of life\nat sea, the safety of the population or the protection of the marine environment.\n\n7.9.\nStandard. Public authorities shall, to the greatest extent possible, facilitate the entry\nand clearance of persons, cargo, material and equipment required to deal with situations described\nin Standard 7.8.\n\n7.10.\nequipment needed to implement security measures.\n\nStandard. Public authorities shall grant prompt customs clearance of specialized\n\nD.\n\nNational facilitation committees\n\n7.11.\nRecommended  Practice.  Each  Contracting  Government  should  consider\nestablishing,  in  close  cooperation  with  the  maritime  industry,  a  national  maritime  transport\nfacilitation programme based on the facilitation requirements of this annex and ensure that the\nobjective of its facilitation programme should be to adopt all practical measures to facilitate the\nmovement of ships, cargo, crews, passengers, mail and stores, by removing unnecessary obstacles\nand delays.\n\n7.12.\nRecommended Practice. Each Contracting Government should establish a national\nmaritime  transport  facilitation  Committee  or  a  similar  national  coordinating  body,  for  the\nencouragement  of  the  adoption  and  implementation  of  facilitation  measures,  between\ngovernmental departments, agencies and other organizations concerned with, or responsible for,\nvarious aspects of international maritime traffic, as well as port authorities, port facilities and\nterminals and shipowners.\n\n\f98\n\nL.R.O. 1998THIRD SCHEDULE(Section 12(1)(b))Pre-arrival DocumentsFacilitation of International Maritime Traﬃ  c Act, 2024 (Act 2024-     )PART A(Section 12(1)(b)(i))FORM 1Advanced Notiﬁ cation Form for Waste Deliveryto Port Reception Facilities   Notiﬁ cation of the Delivery of Waste to: The master of a ship should forward the information below to the designated authority atleast 1 hour in advance of arrival or on departure of the previous port if the voyage is less than 24 hours from within the domestic space and 24 hours from outside the domestic space.This form shall be retained on board the vessel along with the appropriate Oil RB, Cargo RB or Garbage RB.(Name of port or terminal)DELIVERY FROM SHIPS (ANF)1.SHIP PARTICULARS1.1  Name of ship:1.2  IMO number:1.3 Gross tonnage:1.4 Type of ship:1.5 Owner or master:1.6 Distinctive number or letters:1.7 Flag State:Oil tankerOther cargo shipChemical tankerPassenger ship Bulk carrierRo-roContainerOther (specify)\f99\n\n L.R.O. 19982. PORT AND VOYAGE PARTICULARS2.1 Location/Terminal name and POC:2.2 Arrival Date and Time: 2.3 Departure Date and Time:2.4 Last Port and Country: 2.5 Next Port and Country (if known):2.6 Last Port where waste was delivered: 2.7 Date of Last Delivery: 2.8 Next Port of Delivery (if known):2.9 Person submitting this form is (if other than the master): 3. TYPE AND AMOUNT OF WASTE FOR DISCHARGE TO FACILITYMARPOL Annex I - OilOily bilge waterOily residues (sludge)Oily tank washingsDirty ballast waterScale and sludge from tank cleaningOther (please specify)MARPOL Annex II - NLSCategory X substanceCategory Y substanceCategory Z substanceOS - other substancesQuantity (m3)Quantity(m3)/Name11  Indicate the proper shipping name of the NLS involved.Third Schedule - (Cont'd)\f100\n\n L.R.O. 1998MARPOL Annex IV - SewageMARPOL Annex V - GarbageA. Plastics B. Food wastesC. Domestic waste (e.g. paper products, rags, glass, metal, bottles, crockery, etc.)D. Cooking oilE. Incinerator ashesF. Operational wastesG. Cargo residues2H. Animal carcass(es) I. Fishing gearMARPOL Annex VI -  Air pollutionOzone-depleting substances and equipment containing such substances Exhaust gas-cleaning residuesQuantity (m3)Quantity (m3)Quantity (m3)2  Indicate the proper shipping name of the dry cargo.Third Schedule - (Cont'd)\f101\n\n L.R.O. 1998Name of ship:IMO number:Please state below the approximate amount of waste and residues remaining on board and the percentage of maximum storage capacity. If delivering all waste on board at this port please strike through this table and tick the box below.  If delivering some or no waste, pleasecomplete all columns.I conﬁ rm that I am delivering all the waste held on board this vessel (as shown on page 1) at this portAmount of waste retained on board (m3)Port at which remaining waste will be delivered (if known) Estimate amount of waste to be generated between notiﬁ cation and next port of call (m3) TypeMaximumdedicatedstorage capacity (m3) MARPOL  Annex  I  -  OilOily bilge waterOily residues (sludge)Oily tank washingsDirty ballast waterScale and sludge fromtank cleaningOther (please specify) MARPOL  Annex  II  -  NLS3Category X substanceCategory Y substanceCategory Z substanceOS - other substances3  Indicate the proper shipping name of the NLS involved. Third Schedule - (Cont'd)\f102\n\n L.R.O. 1998TypeA. Plastics B. Food wastesC. Domestic waste (e.g.  paper products, rags, glass, metal, bottles, crockery, etc.D. Cooking oilE. Incinerator ashesF. Operational wastesG. Cargo residues4H. Animal carcass(es) I. Fishing gearAmount of waste retained on board (m3)Port at which remaining waste will be delivered (if known) Estimate amount of waste to be generated between notiﬁ cation and next port of call (m3) Maximumdedicatedstorage capacity (m3) DateTimeName and PositionSignature4  Indicate the proper shipping name of the dry cargo. MARPOL Annex IV - SewageSewageMARPOL Annex V - GarbageThird Schedule - (Cont'd)\f103\n\nL.R.O. 1998(Sections 12(1)(b)(ii) and 23(b)(i))Facilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-     )FORM 2List of Ports of Calls ArrivalDepartureName of ShipPort of Arrival/DepartureNationality of VesselNo.12345678910Name of PortDate of ArrivalDate of DepartureCountryDate of Arrival/DepartureNext PortShip's StampName of MasterSignature by Master, Authorized Agent or Oﬃ  cerDateThird Schedule - (Cont'd)\f104\n\nL.R.O. 1998(Sections 12(1)(b)(iii), 15(2)(c), 18(2)(a), 23, 23(b)(ii) and 42(2)(a)(i))Facilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-     )FORM 3Maritime Declaration of HealthTo be completed and submitted to the competent authorities by the masters of ships arrivingfrom foreign ports.Submitted at the port of: Date:Name of ship or inland navigation vessel: Registration/IMO No.: Arriving from: Sailing to:(Nationality)/(Flag of vessel): Master’s name:Gross tonnage (ship):Tonnage (inland navigation vessel):Valid Sanitation Control Exemption/Control Certiﬁ cate carried on board?   Issued at:Date:YesNoThird Schedule - (Cont'd)\f105\n\n L.R.O. 1998Re-inspection required?Has ship/vessel visited an aﬀ ected area identiﬁ ed by the World Health Organization?Port and date of visit:List ports of call from commencement of voyage with dates of departure, or within past thirtydays, whichever is shorter:On the request of the competent authority at the port of arrival, list crew members, passengers orother persons who have joined ship/vessel since international voyage began or within pastthirty days, whichever is shorter, including all ports/countries visited in this period (addadditional names to the attached schedule):(1) Name: joined from: (1)  (2)  (3)(2) Name: joined from: (1)  (2)  (3)(3) Name: joined from: (1)  (2)  (3)Number of crew members on board:  Number of passengers on board:YesNoYesNoThird Schedule - (Cont'd)\f106\n\n L.R.O. 1998Health questions(1) Has any person died on board during the voyage otherwise than as a result of  accident? If yes, state particulars in attached schedule. Total no. of deaths(2) Is there on board or has there been during the international voyage any case of disease  which you suspect to be of an infectious nature?  If yes, state particulars in attached schedule.(3) Has the total number of ill passengers during the voyage been greater than normal/ expected?  How many ill persons?  (4) Is there any ill person on board now? If yes, state particulars in attached schedule.(5) Was a medical practitioner consulted?   If yes, state particulars of medical treatment or advice provided in attached schedule.(6) Are you aware of any condition on board which may lead to infection or spread of disease?   If yes, state particulars in attached schedule.(7) Has any sanitary measure (e.g. quarantine, isolation, disinfection or decontamination)  been applied on board? If yes, specify type, place and date:YesNoNoYesNoYesNoYesNoYesNoYesNoYesThird Schedule - (Cont'd)\f107\n\n L.R.O. 1998(8) Have any stowaways been found on board?  If yes, where did they join the ship? (if known)(9) Is there a sick animal or pet on board?Note: In the absence of a surgeon, the master should regard the following symptoms as grounds for suspecting the existence of a disease of an infectious nature: (a) fever, persisting for several days or accompanied by:(i) prostration;(ii) decreased consciousness;(iii)  glandular swelling;(iv) jaundice;(v) cough or shortness of breath;(vi) unusual bleeding; or(vii) paralysis.(b) with or without fever:(i) any acute skin rash or eruption;(ii) severe vomiting (other than sea sickness);(iii) severe diarrhoea; or(iv) recurrent convulsions.I hereby declare that the particulars and answers to the questions given in this Declaration of Health (including the schedule) are true and correct to the best of my knowledge and belief.YesNoYesNoSignature of MasterCountersignature Ship’s Surgeon (if carried)DateThird Schedule - (Cont'd)\f108\n\n L.R.O. 1998ATTACHMENT TO MARITIME DECLARATION OF HEALTHNameSexClassorratingAgePort, date joinedship/vesselNature of illnessDate of onset of symptomsReportedto a portmedicaloﬃ  cer?Disposal of case1Drugs,medicines,or othertreatmentgiven to patientCommentsNationality1 State:  (1) whether the person recovered, is still ill or died; and  (2) whether the person is still on board, was evacuated (including the name of the port or airport), or was buried at sea. Third Schedule - (Cont'd)\f109\n\nL.R.O. 1998(Sections 12(1)(b)(iv), 15(2)(d), and 42(2)(a)(ii))Facilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-     )FORM 4International Certiﬁ cate of Vaccinationor Prophylaxis  This is to certify that     ,                ,born on  , national of   , as evidenced by nationalidentiﬁ cation document no., whose signature followshas on the date indicated been vaccinated or received prophylaxis against:   in accordance with the International Health Regulations.  namedate of birthsexnationalitysignaturename of disease or conditionThird Schedule - (Cont'd)\f110\n\n L.R.O. 1998Vaccine orprophylaxisManufacturer andBatch No. of vaccine or prophylaxisOﬃ  cial stamp of administering centreDateSignature and professional status ofsupervising clinicianCertiﬁ catevalid fromuntil This certiﬁ cate is valid only if the vaccine or prophylaxis used has been approved by the World Health Organization.This certiﬁ cate must be signed in the hand of the clinician, who shall be a medical practitioner or other authorized health worker, supervising the administration of the vaccine or prophylaxis. The certiﬁ cate must also bear the oﬃ  cial stamp of the administering centre; however, this shall not be an accepted substitute for the signature. Any amendment of this certiﬁ cate, or erasure, or failure to complete any part of it, may render it invalid.The validity of this certificate shall extend until the date indicated for the particular vaccination or prophylaxis. The certiﬁ cate shall be fully completed in English or in French.  The certiﬁ cate may also be completed in another language on the same document, in addition to either English or French.(DD/MM/YYYY)(DD/MM/YYYY)1.2.3.4.Third Schedule - (Cont'd)\f111\n\nL.R.O. 1998(Section 12(1)(b)(v))Facilitation of International Maritime Traﬃ  c Act, 2024 (Act 2024-     )FORM 5Yellow Fever Vaccination ListDate of BirthExpiryGiven NameNationalityYellow Fever Vaccination Date12345678RankFamily NameName of MasterShip's StampThird Schedule - (Cont'd)\f112\n\nL.R.O. 1998(Sections 12(1)(b)(vi) and 18(2)(b))Facilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-     )FORM 6Standard Data Set of Security-Related Information1Particulars of the ship and contact details1.1 IMO Number1, 2: 1.2 Name of ship1, 2:1.3 Port of registry1, 2:1.4 Flag State1,2:1.5 Type of ship1:1.6 Call Sign:1.7 Inmarsat call numbers3:1.8 Gross Tonnage1:1.9 Name of Company1,2:Third Schedule - (Cont'd)\f113\n\n L.R.O. 19981.10 IMO Company identiﬁ cation number2:1.11 Name and 24-hour contact details of the Company Security Oﬃ  cer4:2. Port and port facility information2.1 Port of arrival and port facility where the ship is to berth, if known:2.2 Expected date and time of arrival of the ship in port (paragraph B/4.39.3 of the ISPS Code):2.3 Primary purpose of call:3. Information required by SOLAS regulation XI-2/9.2.13.1 The ship is provided (SOLAS regulation 9.2.1.1) with a valid:- International Ship Security Certiﬁ cate- Interim International Ship Security Certiﬁ cate3.1.1 The certiﬁ cate indicated in 3.1 has been issued by and which expires on   .3.1.2 If the ship is not provided with a valid International Ship Security Certiﬁ cate or a valid Interim International Ship Security Certiﬁ cate, explain why.3.1.2.1 Does the ship have an approved ship security plan on board?YesNoYesNo(Date of expiry1)Government1, 2 or the Recognized Security Organization1, 2) (Name of the Contracting YesNoThird Schedule - (Cont'd)\f114\n\n L.R.O. 19983.2 Current security level (SOLAS regulation XI-2/9.2.1.2):3.2.1 Location of the ship at the time the report is made (paragraph B/4.39.2 of the ISPS Code):3.3 List the last ten calls, in chronological order with the most recent call first, at port facilities at which the ship conducted ship/port interface5 together with the security level at which the ship operated (SOLAS regulation XI-2/9.2.1.3):3.3.1 Did the ship, during the period specified in 3.3, take any special or additional security measures, beyond those specified in the approved ship security plan?No.Port, Country, Port Facility and UNLOCODE3Security levelFrom6DateTo6YesNoThird Schedule - (Cont'd)\f115\n\n L.R.O. 19983.3.2 If the answer to 3.3.1 is YES, for each of such occasions please indicate the special or additional security measures which were taken by the ship (SOLAS regulation XI-2/9.2.1.4):Special oradditionalsecuritymeasuresPort, Country, Port Facility and UNLOCODE3From6DateTo6No.Third Schedule - (Cont'd)\f116\n\n L.R.O. 19983.4 List the ship-to-ship activities7, in chronological order with the most recent ship-to-ship activity ﬁ rst, which have been carried out during the period speciﬁ ed in 3.3:3.4.1 Have the ship security procedures, speciﬁ ed in the approved ship security plan, been maintained during each of the ship-to-ship activities specified in 3.4 (SOLAS regulation XI-2/9.2.1.5)? Location or Latitude and LongitudeShip-to-ship activityNo.From6DateTo6Not applicableYesNoThird Schedule - (Cont'd)\f117\n\n L.R.O. 19983.4.2 If the answer to 3.4.1 is NO, identify the ship-to-ship activities for which the ship  security procedures were not maintained and indicate, for each, the security measures which were applied in lieu: 3.5 Provide a general description of cargo aboard the ship (SOLAS regulation XI-2/9.2.1.6 and paragraph B/4.39.5 of the ISPS Code):3.5.1 Is the ship carrying any dangerous substances8 as cargo?3.5.2 If the answer to 3.5.1 is YES, provide details or attach a copy of the Dangerous Goods Manifest (IMO FAL Form 7).Security measures appliedShip-to-ship activityNo.From6DateTo6YesNoThird Schedule - (Cont'd)\f118\n\n L.R.O. 19983.6 A copy of the ship’s Crew List (IMO FAL Form 5) is attached (SOLAS regulation  XI-2/9.2.1.6 and paragraph B/4.39.4 of the ISPS Code)3.7 A copy of the ship’s Passenger List (IMO FAL Form 6) is attached (SOLAS  regulation XI-2/9.2.1.6 and paragraph B/4.39.6 of the ISPS Code)4. Other security-related information4.1 Is there any security-related matter you wish to report? 4.1.1 If the answer to 4.1 is YES, provide details9:5. Agent of the ship at the intended port of arrival 5.1 Name and contact details (telephone number) of the agent of the ship at the intended   port of arrival:6. Identiﬁ cation of the person providing the information6.1 Name:6.2 Title or position10: 6.3 Signature:This report is dated at on . YesNo(time and date)(place)Third Schedule - (Cont'd)\f119\n\n L.R.O. 1998EXPLANATORY NOTES1. As appearing on the ship’s International Ship Security Certiﬁ cate or the ship’s Interim International Ship Security Certiﬁ cate. 2. If a copy of the ship’s current Continuous Synopsis Record (CSR) is submitted there is no need to complete this entry.3. If available.4. Refer to paragraph 27 of the Guidance relating to the implementation of SOLAS chapter XI-2 and of the ISPS Code (MSC/Circ.1132).5. Ship/port interface means the interactions that occur when a ship is directly and immediately aﬀ ected by actions involving the movement of persons, goods or the provisions of port services to or from the ship (SOLAS regulation XI-2/1.1.8).6. Provide the date.7. Ship-to-ship activity means any activity not related to a port facility that involves the transfer of goods or persons from one ship to another (SOLAS regulation XI-2/1.1.10). Information would not normally be required to include records of transfers of pilots or of customs, immigration or security oﬃ  cials nor bunkering, lighting, loading of supplies and unloading of waste by ship within port facilities as these would normally fall within the auspices of the Port Facility Security Plan (PFSP) (paragraph B/4.38 of the ISPS Code). Ascertaining whether these activities fall within the PFSP should form part of the dialogue between the Ship Security Oﬃ  cer and the Port Facility Security Oﬃ  cer.  It should be remembered that the physical boundaries of port facilities may not always coincide with the boundaries of the port or harbour authority.Third Schedule - (Cont'd)\f120\n\n L.R.O. 19988. Dangerous substances as cargo means the carriage of substances, materials and articles covered by the IMDG Code and falling under the following classes of dangerous goods irrespective of whether these are carried in bulk or packaged form:− Class 1:  Explosives− Class 2.1: Flammable gas− Class 2.3: Toxic gases− Class 3: Flammable liquids− Class 4.1: Flammable solids, self-reactive substances and desensitized explosives− Class 5.1: Oxidizing substances− Class 6.1: Toxic substances− Class 6.2: Infectious substances− Class 7: Radioactive material− Class 8: Corrosive substances This information may be extracted from the Dangerous Goods Manifest (IMO FAL Form 7) or the whole Dangerous Goods Manifest may be submitted.9. Other security-related matters include but are not limited to the carriage of stowaways or any persons rescued at sea.  When reporting stowaways please see the Guidelines on the allocation of responsibilities to seek the successful resolution of stowaway cases adopted by the Organization with resolution A.871(20).  This resolution provides in the Appendix to the Annex a Stowaway details report which should be completed and forwarded to the extent that is practically possible.  When reporting persons rescued at sea please see the guidance provided in paragraph B/4.38.3 of the ISPS Code.10. Master, Ship Security Oﬃ  cer, Company Security Oﬃ  cer or Agent of the ship at the intended port of arrival.Third Schedule - (Cont'd)\f121\n\nL.R.O. 1998(Sections 12(1)(b)(vii) and 42(2)(b))Facilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-     )FORM 7 Ship Sanitation Control Exemption Certiﬁ cate/Ship Sanitation Control Certiﬁ cate Port of Date:This Certiﬁ cate records the inspection and (1) exemption from control or (2) control measures appliedName of ship or inland navigation vesselFlag Registration/IMO No.At the time of inspection the holds were unladen/laden with tonnes of cargoName and address of inspecting oﬃ  cerThird Schedule - (Cont'd)\f122\n\n L.R.O. 1998Sample results2Evidence found1Ship Sanitation Control Exemption Certiﬁ cateAreas, [systems, and services] inspectedGalleyPantryStoresHold(s)/cargoQuarters:-crew- oﬃ  cers- passengers- deckPotable waterSewageBallast tanksSolid and medical wasteStanding waterEngine roomMedical facilitiesOther areas speciﬁ ed - see attachedNote areas not applicable, by marking N/ADocuments reviewedMedical logShip’s logOtherNo evidence found. Ship/vessel is exempted from control measures.1(a) Evidence of infection or contamination, including: vectors in all stages of growth; animal reservoirs for vectors; rodents or other species that could carry human disease, microbiological, chemical and other risks to human health; signs of inadequate sanitary measures. (b) Information concerning any human cases (to be included in the Maritime Declaration of Health).2 Results from samples taken on board.  Analysis to be provided to ship’s master by most expedient means and, if re-inspection is required, to the next appropriate port of call coinciding with the re-inspection date speciﬁ ed in this certiﬁ cate.  Sanitation Control Exemption Certiﬁ cates and Sanitation Control Certiﬁ cates are valid for a maximum of six months but the validity period may be extended by one month if inspection cannot be carried out at the port and there is no evidence of infection or contamination.Name and designation of issuing oﬃ  cerSignature and sealDateThird Schedule - (Cont'd)\f123\n\n L.R.O. 1998Control measures appliedRe-inspection dateComments regardingconditions foundShip Sanitation Control Certiﬁ cateNo evidence found. Ship/vessel is exempted from control measures.1(a) Evidence of infection or contamination, including: vectors in all stages of growth; animal reservoirs for vectors; rodents or other species that could carry human disease, microbiological, chemical and other risks to human health; signs of inadequate sanitary measures. (b) Information concerning any human cases (to be included in the Maritime Declaration of Health).2 Results from samples taken on board.  Analysis to be provided to ship’s master by most expedient means and, if re- inspection is required, to the next appropriate port of call coinciding with the re-inspection date speciﬁ ed in this certiﬁ cate.  Sanitation Control Exemption Certiﬁ cates and Sanitation Control Certiﬁ cates are valid for a maximum of six months  but the validity period may be extended by one month if inspection cannot be carried out at the port and there is no evidence of infection or contamination.Name and designation of issuing oﬃ  cerSignature and sealDateThird Schedule - (Cont'd)\f124\n\n L.R.O. 1998SampleresultsEvidence foundControlmeasures appliedRe-inspectiondateComments regardingconditions foundAreas/facilities/systems inspected1Food Source Storage Preparation ServiceWater Source Storage DistributionWaste Holding Treatment DisposalSwimming pools/spas Equipment Operation Medical facilities Equipment and  medical devices  Operation MedicinesOther areas inspectedDocuments reviewedAttachment to Model Ship Sanitation Control Exemption Certiﬁ cate/Ship Sanitation Control Certiﬁ cate1 Indicate when the areas listed are not applicable by marking N/A.Third Schedule - (Cont'd)\f125\n\nL.R.O. 1998Dispatch-IDCN 44 trial note attachedLETTER BILL Bulk mailCN 32OriginPrevious number Origin OE and IMPC  codeSub-classDispatch No.DateDestination OE and IMPC codeCategoryYearTransportation(Sections 12(1)(b)(viii) and 42(2)(c))Facilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-     )FORM 8OperatorsDestination1 Receptacle labels and typesReceptacle labelsTotalReceptacle typesOthersTraysBagsNumber of labelsRedVioletReceptacles in mailReceptaclesto be returnedEmpty receptacles being returnedTotal weightThird Schedule - (Cont'd)\f126\n\n L.R.O. 19982 Number of items and weight per formatFormatNumber of receptaclesWeightNumber of itemsP or SGEMixed mailNumber ofspecial listsNumber ofitems exemptfrom additionalterminal duesTotal numberof itemsNumber of receptacles containingNumber ofinner packetscontainingNumber ofitems subjectto additionalterminal duesRegistered items3 Identiﬁ ed itemsTracked itemsInsured items4 Miscellaneous informationNumber of CN 65 billsPresence of COD:unregistered itemsregistered itemsDispatching oﬃ  ce of exchange signatureOﬃ  ce of exchange of destination signatureThird Schedule - (Cont'd)\f127\n\nL.R.O. 1998(Section 12(1)(b)(ix))Facilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-     )FORM 9Ship ParticularsThird Schedule - (Cont'd)1. Name of ship2. Flag3. IMO number4. Type of Ship5. Gross Tonnage6. Net Tonnage7. Year of Build8. Builder9. Deadweight10. Lightship weight11. Draught12. Speed\f128\n\nL.R.O. 1998(Sections 12(1)(b)(x) and 18(3))Facilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-     )FORM 10Advanced Passenger InformationA. Data relating to the voyage 1. (Ship) Identiﬁ cation   IMO or registration number. 2. Registration   Ship registration number. 3. Country of Registration   Country where ship is registered. 4. Agent or Owner   Name of agent for the ship or, where no agent, name of owner. 5. Call Sign (if applicable) 6. Scheduled Departure Date  Date of scheduled departure of ship based on local time of departure from location.Third Schedule - (Cont'd)\f129\n\n L.R.O. 1998Third Schedule - (Cont'd) 7. Scheduled Departure Time   Time of scheduled departure of ship based on local time of departure from location. 8. Scheduled Arrival Date   Date of scheduled arrival of ship based on local time of arrival at location. 9. Scheduled Arrival Time   Time of scheduled arrival of ship based on local time of arrival at location.10. Last Place or Port of Call of Ship   Ship departed from this last place or port of call to go to a place or port of call.11. Place or Port of Initial Arrival of Ship   Place or port of call in the country of destination where the ship arrives from the last    place or port of call of ship initial arrival.12. Subsequent Place or Port of Call Within the Country or Domestic Space13. Number of Passengers on Board Ship   Total number of passengers on board ship.14. Number of Crew Members on Board Ship   Total number of crew on board ship.\f130\n\n L.R.O. 1998B. Data relating to each individual on board a ship   Core Data Elements of the Oﬃ  cial Travel Documents 1. Oﬃ  cial Travel Document Number   Passport or other oﬃ  cial travel document number. 2. Issuing State or Organisation of the Oﬃ  cial Travel Document   Name of the state or organisation responsible for the issuance of the oﬃ  cial travel   document. 3. Oﬃ  cial Travel Document Type   Indicator to identify type of oﬃ  cial travel document. 4. Expiration Date of Oﬃ  cial Travel Document   Expiration date of the oﬃ  cial travel document. 5. Surname and Given Name(s)   Family name and given name(s) of the holder as they appear on the oﬃ  cial travel document. 6. Nationality   Nationality of the holder of the travel document. 7. Date of Birth   Date of birth of the holder of the travel document. 8. Gender   Gender of the holder of the travel document.Third Schedule - (Cont'd)\f131\n\n L.R.O. 1998 9. Place of Birth   Please give City and Country of birth.10. Place or Port of Original Embarkation   Place or port on that journey where traveller ﬁ rst boarded for foreign travel.11. Place or Port of Clearance   Place or port where the traveller is cleared by the border control agencies.12. Place or Port of Onward Foreign Destination   Foreign place or port where the traveller is transiting.13. Passenger Name Record (PNR) Data   As available in the traveller's Passenger Name Record (PNR) in the carrier's    Reservation System including all historical changes to the PNR listed.  Must include:(1) PNR record locator(2) Date of reservation or issue of ticket(3) Date(s) of intended travel(4) Surname and Given Name(s)(5) Address and contact information (telephone number, e-mail address)(6) All forms of payment information, including billing address(7) Complete travel itinerary for speciﬁ c PNR(8) Frequent ﬂ yer information(9) Travel agency or travel agentThird Schedule - (Cont'd)\f132\n\n L.R.O. 1998(10) Travel status of passenger, including conﬁ rmations, check-in status, no show or go show information(11) Split or divided PNR information(12) General remarks (including all available information on unaccompanied minors under 18 years, such as name and gender of the minor, language(s) spoken, name and contact details of guardian on departure and relationship to the minor, name and contact details of guardian on arrival and relationship to the minor,  departure and arrival agent)(13) Ticketing ﬁ eld information, including ticket number, date of ticket issuance and one-way tickets, Automated Ticket Fare Quote ﬁ elds(14) Seat number and other seat information(15) Code share information(16) All baggage information(17) Number and other names of travellers on PNR(18) Any Advanced Passenger Information (API) data collected(19) All historical changes to the PNR listed in numbers 1 to 18Third Schedule - (Cont'd)\f133\n\n L.R.O. 1998C. Additional Data 1. Visa Number (if applicable)  2. Place of Issue of the visa   Place where visa was issued 3. Date of Issue of the visa   Date when visa was issued 4. Other Document Number used for Travel (if applicable)   The other document number used for travel when the oﬃ  cial travel document is   not required 5. Other Document Number used for Travel (if applicable)   Type of other document used for travel (supporting travel document) 6. Primary Residence   Country of primary residence    (Country where passenger resides most of the year)   Address    (location identiﬁ cation such as: street name and number)   City   State/Province/Country   Postal CodeThird Schedule - (Cont'd)\f134\n\n L.R.O. 1998D. Data relating to the Reporting Party   Reporting Party Name   Reporting Party Telephone Number   Reporting Party Facsimile Number   Reporting Party Electronic Mail AddressThird Schedule - (Cont'd)\f135\n\nL.R.O. 1998(Sections 12(1)(c) and 18(4))Facilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-     )PART BAdvanced Cargo InformationElectronic Manifest Management AsycudaA. Maritime Cargo Data MessagesCargo Manifest:To be submitted by master or ship agentMaster Waybill:To be submitted by master orship agentHouse Waybill:To be submitted by Freight Forwarded or RepresentativesResponse Message:To be handled by the ﬁ ling partyThird Schedule - (Cont'd)\f136\n\n L.R.O. 1998B. Cargo for Discharge in Barbados Data relating to the ManifestData relating to the Manifest:Voyage number  (A number assigned by local Shipping Agent for ships)Date and Time of submissionCarrier  (Name of ship)Scheduled Departure Date  (Date of departure of ship)Scheduled Arrival Date  (Date of arrival of ship)Scheduled Arrival Time  (Time of arrival of ship)Place of Departure  (The last foreign port or place of call for ship)Destination  (Port or place in the country of destination where the ship ﬁ rst reports)Subsequent Place or Port of call within the country (Optional)Third Schedule - (Cont'd)\f137\n\n L.R.O. 1998Agent: Name  Authorised representative of the ship (where available)Owner  (Name of owner of ship)Transport: Mode  (The manner in which the goods are imported or exported)Transport: Name  (Name of the importing or exporting ship)Transport: Nationality  (Nationality of ship as determined by its port of registry)Transport: Place (Optional)  (Port of registry)Registration (Optional)(International registration number including, in respect of ships, the International MaritimeOrganisation or Lloyd's registration number)Master (Optional)  (Name of ship's captain)Total: BillsTotal: PackagesTotal: ContainersThird Schedule - (Cont'd)\f138\n\n L.R.O. 1998Total: Gross (Optional)Tonnage: Net  (Ship's registered tonnage)Date of last discharge (Optional)  (Date ship last discharged cargo at any port)C. Data relating to Container ManagementContainer: Number  (The BIC identiﬁ cation number of containers)Container: Type  (Type of containers e.g. 20 feet, refrigerated)Empty/Full Indicator  (Whether full container load or less than container load)Seals  (The number of the security seal(s) aﬃ  xed to the container door)Marks(Marks or numbers of the seal(s) aﬃ  xed to the container door)Sealing Party  (The authority that aﬃ  xed the seal(s) to the containers)Total ContainersTransport Document Reference NumberThird Schedule - (Cont'd)\f139\n\n L.R.O. 1998D. Data relating to individual Bills of LadingManifest Line Number  (Number indicating the order of bills of lading on a manifest)Transport Document Type  (Type of document issued by ship, bills of lading or waybills)Transport Document Reference NumberPurpose of Shipment  (Whether for import, export, in transit or transhipment)Unique Cargo Reference (Optional)Place of loadingPlace of dischargeExporterExporter AddressConsigneeNotify  (Either the consignee or the name and phone number of the representative)Total ContainersPackages: KindPackages: Marks and NumbersThird Schedule - (Cont'd)\f140\n\n L.R.O. 1998Quantity: PackageQuantity: Gross MassVolume: Cubic Measurement (cbm)Description of Goods  (pursuant to applicable law)Freight Indicator  (payment status, whether prepaid or payment on collection)Amount and CurrencyValues:Customs (Optional)Insurance (Optional)Freight (Optional)Additional SealsAdditional InformationThird Schedule - (Cont'd)\f141\n\n L.R.O. 1998ADVANCED CARGO INFORMATION ELECTRONIC MANIFESTMANAGEMENT ASYCUDA CARGO MANIFEST DATA FIELDSNo.Tracking No.123456789DATA FIELDSGeneral InformationOﬃ  ce of departure or arrivalVoyage numberDate of departureTime of departureDate of arrivalTime of arrivalPlace of departurePlace of destinationPort of last callDESCRIPTIONGeneral details with respect tovoyage and ShipCode  of   the   Customs   Departmentﬁ ling of departure or arrivalVoyage number which uniquely identiﬁ es the current journey of the means of transport Date when the ship leaves the place of departureEstimated time when the ship departs the place of departureEstimated date when the ship arrives at the place of destinationEstimated time when the shiparrives at the place of destinationPlace (LOCODE) where currentvoyage begins on the ship Place (LOCODE) where currentvoyage ends on the shipThe place of (LOCODE) wherethe ship last reported before docking at the place of arrival.MANDATORYYESYESYESYESYESYESYESYESYESYESThird Schedule - (Cont'd)\f142\n\n L.R.O. 1998No.Tracking No.1011DATA FIELDSGeneral InformationShip codeAgentDESCRIPTIONGeneral details with respect tovoyage and ShipShip code assigned to the party undertaking the transport of the goodsCode of the agent in charge ofthe ship reporting during the stay in portMANDATORYYESYESYESSHIPPING INFORMATIONNo.Tracking No.1213141516DATA FIELDSGeneral InformationBillsPackagesVehiclesContainersGross WeightDESCRIPTIONGeneral details with respect tovoyage and Ship Total number of waybills onmanifestTotal number of packages onmanifestTotal number of motor vehicleson manifestTotal number of containers onmanifestTotal gross weight contained inthe manifestMANDATORYYESYESYESYESYESYESTOTALSThird Schedule - (Cont'd)\f143\n\n L.R.O. 1998No.Tracking No.17181920212223DATA FIELDSGeneral InformationModeNationalityIdentityRegistrationPlaceDateMaster or CommanderDESCRIPTIONGeneral details with respect tovoyage and ShipIdentifying the mode of transportFlag or Nationality of means of transportName of shipRegistration number of shipPort where the ship was registeredDate of dischargeName of Master or Commander of the shipMANDATORYYESYESYESYESYESNONOYESTRANSPORTNo.Tracking No.242526DATA FIELDSGeneral InformationGross TonnageNet TonnageOﬃ  ce of destinationDESCRIPTIONGeneral details with respect tovoyage and ShipNet tonnage plus maximumallotted cargo weight per voyageCarrier's base weightOﬃ  ce of destination.  Code ofthe Customs Department ofdestination in case of transitMANDATORYYESYESConditional or OptionalTONNAGEThird Schedule - (Cont'd)\f144\n\n L.R.O. 1998CO-LOADERNo.Tracking No.27DATA FIELDSGeneral InformationCo-loader codeDESCRIPTIONGeneral details with respect tovoyage and ShipCarrier code of the party sharingthe ship or aircraft when multipleparties involvedWAYBILL SEGMENT: Bill of ladingNo.Tracking No.28DESCRIPTIONGeneral details with respect tovoyage and ShipThe Code of the DepartmentMANDATORYYESMANDATORYYESConditional or OptionalDATA FIELDSGeneral InformationOﬃ  ce CodeDATA FIELDSGeneral InformationWaybill referencenumberWaybill typeDESCRIPTIONGeneral details with respect tovoyage and ShipThis is the \"Identiﬁ er\" of thetransport document. This is the reference assigned by the carrier oragent (e.g. bill of lading; it is unique in the manifest)Alphanumeric code for the type oftransport documentMANDATORYYESYESYESGeneral InformationNo.Tracking No.2930Third Schedule - (Cont'd)\f145\n\n L.R.O. 1998DATA FIELDSGeneral InformationNatureWaybill linePrevious documentUCRPlace of loadingPlace of unloadingFAS/LinerDESCRIPTIONGeneral details with respect tovoyage and ShipCode of the document: export-22,import-23, transit-24, transhipment-28, FROB-26The 'line number' is a sequencenumber used to identify each item-bill of lading in the manifestReference of the previousdocument (master waybill) whenconsolidated cargoUnique consignment referencenumberPlace (LOCODE) where the goods were orignally loaded onthe shipPlace (LOCODE) where thegoods will be ultimatelyunloaded or discharged from the shipTerms of condition for transported goods (accepted values F or L)MANDATORYYESYESYESConditional or OptionalNOYESYESYESGeneral Information - (Concl'd)No.Tracking No.31323334353637Third Schedule - (Cont'd)\f146\n\n L.R.O. 1998No.Tracking No.38394041DATA FIELDSGeneral InformationCarrierCarrier NameCarrier AddressShipping agentDESCRIPTIONGeneral details with respect tovoyage and Ship Carrier code, name and addressof the party undertaking thetransport of the goods.The name of the shipping linetransporting cargo to and from BarbadosThe address of the shipping linetransporting cargo to and from BarbadosCode of the shipping agent in charge of the ship managementduring the stay in portMANDATORYYESYESYESYESYESCARRIERNo.Tracking No.424344DATA FIELDSGeneral InformationExporter codeName of ExporterAddress of ExporterDESCRIPTIONGeneral details with respect tovoyage and ShipExporter codeName of ExporterAddress of ExporterMANDATORYYESNOYESYESEXPORTER OR SHIPPERThird Schedule - (Cont'd)\f147\n\n L.R.O. 1998No.Tracking No.4546DATA FIELDSGeneral InformationPlace of loading oncurrent transportPlace of discharge fromcurrent transportDESCRIPTIONGeneral details with respect tovoyage and ShipPlace (LOCODE) where thegoods were loaded on currenttransport (if there was a changeof ship, it would be recorded here)Place (LOCODE) where the goods will be discharged from current transport (if there was further transhipment to be done, it would be recorded here)MANDATORYYESYES or OptionalYES or OptionalTRANSPORTNo.Tracking No.474849DATA FIELDSGeneral InformationNotify codeNotify nameNotify addressDESCRIPTIONGeneral details with respect tovoyage and ShipCode of the notifying partyName of the notifying partyAddress of the notifying partyMANDATORYYESNOYESYESNOTIFYThird Schedule - (Cont'd)\f148\n\n L.R.O. 1998No.Tracking No.505152DATA FIELDSGeneral InformationConsigneeConsignee nameConsignee addressDESCRIPTIONGeneral details with respect tovoyage and ShipConsignee code (TIN)Name of the consigneeFull address of the consigneeMANDATORYYESNO or OptionalYESYESCONSIGNEENo.Tracking No.5354555657DATA FIELDSGeneral InformationTotal containersPackages codesMarks and NdrManifested packagesTotal vehiclesDESCRIPTIONGeneral details with respect tovoyage and Ship Total number of containers for this transport documentKind of packages (packagingtype code)Marks and numbersNumber of packages as indicatedon the waybillTotal number of vehicles for thiswaybillMANDATORYYESYESYESYESYESYESGOOD DETAILSThird Schedule - (Cont'd)\f149\n\n L.R.O. 1998No.Tracking No.5859606162636465DATA FIELDSGeneral InformationManifested gross weightVolume (CBM)Description of goodsH.S. CodeUNDGPlace of OriginPlace of DestinationLocationDESCRIPTIONGeneral details with respect tovoyage and ShipGross weight as indicated on the waybill.  This ﬁ eld must beaccurately captured as the data are compared to the \"Totals\"information of the generalsegment.Volume of the goods in cubicmetresCommercial description of thegoods from the waybill data (e.g.clothes, machines...)Tariﬀ  code for goodsDangerous goods code (UNDG)Place where goods are loadedinto container for shipment (freetext area)Place where goods will beunloaded from container (freetext area)Code of the place where thegoods are located in a shed orcontainer parkMANDATORYYESYESNO or MandatoryYESNO or OptionalConditionalNO or OptionalNO or OptionalNO or OptionalGOOD DETAILS - (Concl'd)Third Schedule - (Cont'd)\f150\n\n L.R.O. 1998No.Tracking No.6667686970717273747576777879DATA FIELDSGeneral InformationValue or freight codeP/CFreight value amountFreight currencyCustoms valueCustoms currencyInsurance valueInsurance currencyTransport valueTransport currencySeal number of sealsMarks of sealsPartyInformationDESCRIPTIONGeneral details with respect tovoyage and Ship Value or freight codePrepaid or collect indicator forthe value codeAmount of the value codeCurrency code for the value codeCustoms value of goodsCustoms currency codeInsurance cost of the goodsInsurance currency codeOverall freight costOverall freight currency codeNumber of seals aﬃ  xed on non-containerized cargoDescription marks or referencesnumber of sealsCode of the party having aﬃ  xedthe sealsAdditional information whenrequiredMANDATORYYESYESConditional or MandatoryYESYESYES or OptionalYES or OptionalYESYESYESYESConditional or OptionalConditional or OptionalConditional or OptionalNO or OptionalDECLARED VALUES AND SEAL DETAILSThird Schedule - (Cont'd)\f151\n\n L.R.O. 1998CONTAINER SEGMENTNo.Tracking No.808182838485868788899091DATA FIELDSGeneral InformationContainer NumberNumber of packagesContainer TypeE/FSeal NumberSealing PartyEmpty WeightGoods WeightMin. Temp. CEMax. Temp. CEHumidityDangerous CodeDESCRIPTIONGeneral details with respect tovoyage and Ship Container number(s) for container(s) relating to waybillNumber of packages in containerContainer size-typeEmpty or Full indicatorQuantity of seals aﬃ  xed and sealnumbers (3 ﬁ elds)Party aﬃ  xing the sealsEmpty weight of container (KG)Weight  of   goods   in   container (KG)Minimum temperature in celsiusfor refrigerated containersMaximum temperature in celsiusfor refrigerated containersTemperature in celsius that thegoods should be storedUNDG code for dangerousgoodsMANDATORYYESYESYESYESYESYES or OptionalYES or OptionalYES or OptionalYESConditional or OptionalConditional or OptionalConditional or OptionalConditional or OptionalThird Schedule - (Cont'd)\f152\n\n L.R.O. 1998CONTAINER SEGMENT - (Concl'd)No.Tracking No.9293949596DATA FIELDSGeneral InformationH.S. CodeGoods DescriptionContainer DispositionVolumeContainer line codeDESCRIPTIONGeneral details with respect tovoyage and Ship Tariﬀ  Code for goods in containerDescription of goods incontainer(Cargo disposition, acceptedvalues \"CY. CFS and P. UNSTUFF). Required onlywhen BL nature 23 and container is not emptyVolume of cargo per containerCode identifying shippingcontainer ownerMANDATORYYESNo or OptionalYESConditionalYESYESThird Schedule - (Cont'd)\f153\n\n L.R.O. 1998VEHICLE SEGMENT No.Tracking No.979899100101102103104DATA FIELDSGeneral InformationChassis NumberEngine NumberEngine SizeOdometer ReadingMake or BrandYearColourNew or UsedDESCRIPTIONGeneral details with respect tovoyage and ShipChassis number of vehicleEngine number of vehicleEngine (cc) or (kw)Mileage of vehicleMake and brand of vehicleYear of manufactureColour of vehicleIf vehicle new or usedMANDATORYYESYESYES or OptionalYESYES or OptionalYESYESYES or OptionalYES or OptionalThird Schedule - (Cont'd)\f154\n\n L.R.O. 1998DATA SUBMISSION TIME FRAME 1. The information set out in the Advanced Cargo Information System Data Fields(a) for incoming cargo by ship:(i) containerized cargo: 24 hours before arrival at ﬁ rst port in the country of destination;(ii) bulk or break bulk: 24 hours before arrival at ﬁ rst port in the country of destination;(b) for outgoing cargo by ship:(i) containerized cargo: 24 hours before loading at port of departure;(ii) bulk or break bulk: 24 hours before departure to the ﬁ rst port in the country of destination.Third Schedule - (Concl'd)\f155\n\n L.R.O. 1998FOURTH SCHEDULE(Sections 12(1)(e), 33(1) and 35)Documents relating to StowawaysPART A REVISED GUIDELINES ON THE PREVENTION OF ACCESS BY STOWAWAYS AND THE ALLOCATION OF RESPONSIBILITIES TO SEEK THE SUCCESSFUL RESOLUTION OF STOWAWAY CASESTHE FACILITATION COMMITTEE,HAVING CONSIDERED the general purposes of the Convention on Facilitation of International Maritime Traﬃ  c, 1965, as amended (FAL Convention), and in particular article III thereof,RECALLING the provisions of resolution A.1027(26) on Application and revision of the Guidelines on the allocation of responsibilities to seek the successful resolution of stowaway cases (resolution A.871(20)),RECALLING ALSO that the International Convention Relating to Stowaways, which attempted to establish an internationally acceptable regime for dealing with stowaways, has not yet come into force,RECALLING  FURTHER  that  it  adopted,  in  accordance  with  article VII(2)(a)  of the FAL Convention, at its twenty-ninth session, on 10 January 2002, amendments to the Convention on  Facilitation  of  International  Maritime  Traﬃ  c, 1965,  as  amended (resolution FAL.7(29)), which introduced a new section 4 on Stowaways in the annex to the FAL Convention, prescribing Standards and Recommended Practices on matters relating to stowaways (the FAL provisions on stowaways), which entered into force on 1 May 2003,RECALLING IN ADDITION that, for the purposes of this resolution, a stowaway is deﬁ ned as a person who is secreted on a ship or in cargo which is subsequently loaded on the ship, without the consent of the shipowner or the master or any other responsible person, and who is detected on board the ship after it has departed from a port, or in the cargo while unloading it in the port of arrival, and is reported as a stowaway by the master to the appropriate authorities,\f156\n\n L.R.O. 1998NOTING with concern the number of incidents involving stowaways, the consequent potential for disruption of maritime traﬃ  c, the impact such incidents may have on the safe operation of ships and the considerable risks faced by stowaways, including loss of life,NOTING ALSO that several Member States which are also Contracting Governments to the FAL Convention:(a) have notiﬁ ed the Secretary-General, in accordance with article VIII(1) of the FAL Convention (in relation to the Standards speciﬁ ed in section 4 of the annex to the FAL Convention) either that they ﬁ nd it impracticable to comply with the  above-mentioned Standards or of diﬀ erences between their own practices and those Standards; or(b) have not yet notiﬁ ed the Secretary-General, in accordance with article VIII(3) of the FAL Convention, that they have brought their formalities, documentary  requirements and procedures into accord in so far as practicable with the  Recommended Practices speciﬁ ed  in  section 4  of  the  annex  to  the  FAL  Convention,RECALLING that resolution A.1027(26) expressed conviction of the need to align, to the extent possible and desirable, the Guidelines with the FAL provisions on stowaways and to revise them in a manner that reﬂ ects developments in eﬀ orts undertaken to prevent stowaways, as well as to provide guidance and recommendations, taking into account the FAL provisions on stowaways, on measures which can be implemented by vessels to prevent cases involving stowaways,TAKING INTO ACCOUNT that some stowaways may be asylum seekers and refugees, which should entitle them to such relevant procedures as those provided by international instruments and national legislation,BEING AWARE that considerable diﬃ  culties continue to be encountered by masters and shipping companies, shipowners and ship operators when stowaways are to be disembarked from ships into the care of the appropriate authorities,AGREEING that the existence of such guidance should in no way be regarded as condoning or encouraging the practice of stowing away and other illegal migration, and should not undermine eﬀ orts to combat the separate problems of alien smuggling or human traﬃ  cking,Fourth Schedule - (Cont'd)\f157\n\n L.R.O. 1998AGREEING ALSO that the provisions of this resolution should, in  accordance  with resolution A.1027(26), be considered as being of relevance only with respect to:(a)  Member   States  which   are   not   Contracting   Governments   to    the   FAL Convention; and(b) Member States which are Contracting Governments to the FAL Convention and which:(i)  have notiﬁ ed the Secretary-General, in accordance with article VIII(1) of the FAL Convention (in relation to the Standards speciﬁ ed in section 4 of the annex to the FAL Convention) either that they ﬁ nd it impracticable to  comply with the aforementioned Standards or of diﬀ erences between their own  practices and those Standards; or(ii) have not yet notiﬁ ed the Secretary-General, in accordance with article VIII(3) of the FAL Convention, that they have brought their formalities,  documentary requirements and procedures into accord in so far as practicable with the Recommended Practices speciﬁ ed in section 4 of the annex to the FAL Convention,BELIEVING that, at present, stowaway cases can best be resolved through close cooperation among all authorities and persons concerned,BELIEVING ALSO that, in normal circumstances, through such cooperation, stowaways should, as soon as practicable, be removed from the ship concerned and returned to thecountry of nationality/citizenship or to the port of embarkation, or to any other country whichwould accept them, RECOGNIZING that stowaway incidents should be dealt with humanely by all Parties involved, giving due consideration to the operational safety of the ship and its crew,WHILST URGING national authorities, port authorities, shipowners and masters to take all reasonable precautions to prevent stowaways gaining access to vessels,NOTING that the Maritime Safety Committee, at its eighty-eighth session, adopted the Revised guidelines on the prevention of access by stowaways and the allocation of responsibilities to seek the successful resolution of stowaway cases (resolution MSC.312(88)),NOTING ALSO that, at its thirty-seventh session, it adopted the Revised guidelines on the prevention of access by stowaways and the allocation of responsibilities to seek the successful resolution of stowaway cases (resolution FAL.11(37)),Fourth Schedule - (Cont'd)\f158\n\n L.R.O. 1998RECALLING that, at its fortieth session,  it  adopted  amendments  to  the  annex  to  the  FAL Convention (resolution FAL.12(40)), which included amendments to section 4 (Stowaways),AGREEING that these amendments should be reﬂ ected in the revised guidelines as adopted by resolution FAL.11(37),NOTING that the Maritime Safety Committee, at its ninety-ninth session, adopted the Revised guidelines on the prevention of access by stowaways and the allocation of responsibilities to seek the successful resolution of stowaway cases (resolution MSC.448(99)),1 ADOPTS the Revised guidelines on the prevention of access by stowaways and the allocation of responsibilities to seek the successful resolution of stowaway cases, set out in the annex to the present resolution;2 URGES Governments to implement in their national policies and practices the amended procedures recommended in the annexed Guidelines;3 ALSO URGES Governments to deal with stowaway cases in a spirit of cooperation with other parties concerned, on the basis of the allocation of responsibilities set out in the annexed Guidelines as from 1 July 2018;4 INVITES shipping companies, shipowners and ship operators to take on the relevant responsibilities set out in the annexed Guidelines and to guide their masters and crews as to their respective responsibilities in stowaway cases;5 INVITES Governments to develop, in cooperation with the industry, comprehensive strategies to improve access control and prevent intending stowaways from gaining access to ships;6 RESOLVES to continue to monitor the eﬀ ectiveness of the annexed Revised guidelines on the basis of information provided by Governments and the industry, to keep them under review and to take such further action, including the development of a relevant binding instrument, as may be considered necessary in light of the developments;7 REVOKES resolution FAL.11(37) on Revised guidelines on the prevention of access by stowaways and the allocation of responsibilities to seek the successful resolution of stowaway cases;8 REQUESTS the Assembly to endorse the action taken by the Maritime Safety Committee and the Facilitation Committee.Fourth Schedule - (Cont'd)\f159\n\n L.R.O. 1998REVISED GUIDELINES ON THE PREVENTION OF ACCESS BY STOWAWAYS AND THE ALLOCATION OF RESPONSIBILITIES TO SEEK THE SUCCESSFUL RESOLUTION OF STOWAWAY CASES1 Introduction1.1 Masters, shipowners, public authorities, port authorities and other stakeholders,including those providing security services ashore, have a responsibility to cooperate to the fullest extent possible in order:.1 to prevent stowaway incidents; and.2 to resolve stowaway cases expeditiously and secure that an early return or repatriation of the stowaway will take place; all appropriate measures should be taken in order to avoid situations where stowaways must stay on board ships for an unreasonable amount of time.1.2 However, no matter how eﬀ ective port and ship security measures are, it is recognized that there will still be occasions when stowaways gain access to vessels, either secreted in the cargo or by surreptitious boarding.1.3 The resolution of stowaway cases is diﬃ  cult because of diﬀ erent national legislation in each of the several potentially involved States: the State of embarkation, the State of disembarkation, the ﬂ ag State of the ship, the State of apparent, claimed or actual nationality/ citizenship or right of residence of the stowaway, and States of transit during repatriation.2 Deﬁ nitionsFor the purpose of these Guidelines, the following meanings shall be attributed to the terms listed:.1 Attempted stowaway. A person who is secreted on a ship, or in cargo which is subsequently loaded on the ship, without the consent of the shipowner or the master or any other responsible person, and who is detected on board the ship before it has departed from the port..2 Port. Any port, terminal, oﬀ shore terminal, ship and repair yard or roadstead which is normally used for the loading, unloading, repair and anchoring of ships, or any other place at which a ship can call.Fourth Schedule - (Cont'd)\f160\n\n L.R.O. 1998.3 Public authorities. The agencies or oﬃ  cials in a State responsible for the application and enforcement of the laws and regulations of that State which relate to any aspect of the present Guidelines..4 Security measures. Measures developed and implemented in accordance with international agreements to improve security on board ships and in port areas and facilities, and of goods moving in the international supply chain, to detect and prevent unlawful acts.1.5 Shipowner. One who owns or operates a ship, whether a person, a corporation or other legal entity, and any person acting on behalf of the owner or operator..6 Stowaway. A person who is secreted on a ship, or in cargo which is subsequently loaded on the ship, without the consent of the shipowner or the master or any other responsible person and who is detected on board the ship after it has departed from a port, or in the cargo while unloading it in the port of arrival, and is reported as a stowaway by the master to the appropriate authorities.3 Basic principlesOn the basis of the experience thus far, the application of the following basic principles have been useful in preventing stowaway incidents and have been helpful in the speedy resolution of stowaway cases:.1 Stowaway incidents should be dealt with in a manner consistent with humanitarian principles. Due consideration must always be given to the operational safety of the ship and to the safety and well-being of the stowaway..2 Public authorities, port authorities, shipowners and masters should cooperate to the fullest extent possible in order to prevent stowaway incidents._________1 Reference is made to chapter XI-2 of the International Convention for the Safety of Life at Sea, 1974, as amended (1974 SOLAS Convention) and the International Ship and Port Facility Security Code, as amended (ISPS Code); and to the Convention for the Suppression of Unlawful Acts against the Safety of Maritime Navigation, 1988 (1988 SUA Convention) and its 2005 Protocol (2005 SUA Protocol).Fourth Schedule - (Cont'd)\f161\n\n L.R.O. 1998.3 Shipowners, masters, port authorities and public authorities should have adequate security arrangements in place which, as far as practicable, will prevent intending stowaways from getting aboard a ship or, if this fails, will detect them before the ship leaves port or, at the latest, before it arrives at the next port of call..4 Adequate, frequent and well-timed searches minimize the risk of having to deal with a stowaway case and may also save the life of a stowaway who may, for example, be hiding in a place which is subsequently sealed and/or chemically treated..5 Public authorities, port authorities, shipowners and masters should cooperate to the fullest extent possible in order to resolve stowaway cases expeditiously and secure that an early return or repatriation of the stowaway will take place. All appropriate measures should be taken in order to avoid situations where stowaways must stay on board ships for an unreasonable amount of time..6 Stowaways arriving at or entering a State without the required documents are, in general, illegal entrants. Decisions on dealing with such situations are the prerogative of the States where such arrival or entry occurs..7 Stowaway asylum seekers should be treated in accordance with international protection principles as set out in international instruments, such as the provisions of the United Nations Convention relating to the Status of Refugees of 28 July 1951 and of the United Nations Protocol relating to the Status of Refugees of 31 January 1967 and relevant national legislation.2.8 Every eﬀ ort should be made to avoid situations where a stowaway has to be  detained on board a ship indeﬁ nitely. In this regard States should cooperate with the shipowner in arranging the disembarkation of a stowaway to an appropriate State..9 States should accept the return of stowaways who have full nationality/ citizenship status in that State, or have a right of residence in that State..10 Where the nationality or citizenship or right of residence cannot be established, the State of the original port of embarkation of a stowaway should accept the return of such a stowaway for examination pending ﬁ nal case disposition._________2 In addition, public authorities may wish to consider the non-binding conclusion of the UNHCR Executive Committee on Stowaway Asylum Seekers (1988, No. 53 (XXXIX)).Fourth Schedule - (Cont'd)\f162\n\n L.R.O. 19984 Preventive measures4.1 Port/terminal authorities4.1.1 States and port and terminal owners, operators and authorities should ensure that the necessary infrastructure, and operational and security arrangements for the purpose of preventing persons attempting to stowaway on board ships from gaining access to portinstallations and to ships, are established in all their ports, taking into consideration when developing these arrangements the size of the port, and what type of cargo is shipped from the port. This should be done in close cooperation with relevant public authorities, shipowners and shore-side entities, with the aim of preventing stowaway occurrences in the individual port.4.1.2 Operational arrangements and/or port facility security plans should at least be equivalent to those contained in the relevant text of section B/16 of the ISPS Code.34.2 Shipowner/Master4.2.1 Shipowners and masters should ensure that adequate security arrangements are in place which, as far as practicable, will prevent intending stowaways from getting aboard the ship, and, if this fails, as far as practicable, will detect them before the ship  leaves  port or,  at the latest, before it arrives at the next port of call.4.2.2 When calling at ports and during stay in ports, where there is risk of stowaway embarkation, operational arrangements and/or ship security plans should at least be equivalent to those contained in the relevant text of paragraph B/9 of the ISPS Code.44.2.3 When departing from a port, where there is risk of stowaway embarkation, a ship should undergo a thorough search in accordance with a speciﬁ c plan or schedule, and with priorities given to places where stowaways might hide taking into account the speciﬁ c ship type and its operations. Search methods which are likely to harm secreted stowaways should not be used.4.2.4 Fumigation or sealing should not be carried out until a thorough search of the areas to be fumigated or sealed has taken place in order to ensure that no stowaways are present in those areas._________3 Recommended Practice 4.3.1.2 of the FAL Convention.4 Recommended Practice 4.3.2.2 of the FAL Convention.Fourth Schedule - (Cont'd)\f163\n\n L.R.O. 19985 Responsibilities in relation to the resolution of stowaway cases5.1 Questioning and notiﬁ cation by the masterIt is the responsibility of the master of the ship which ﬁ nds any stowaways on board:.1 to make every eﬀ ort to determine immediately the port of embarkation of the stowaway;.2 to take practical steps to establish the identity, including the nationality/ citizenship and the right of residence, of the stowaway;.3 to prepare a statement containing all available information relevant to the stowaway for presentation to the appropriate authorities (for example, the public authorities at the port of embarkation, the ﬂ ag State and, if necessary, subsequent ports of call) and the shipowner; in this respect the reporting form provided in the appendix should be used and completed as far as practicable;.4 to notify the existence of a stowaway and any relevant details to the shipowner and appropriate authorities at the port of embarkation, the next port of call and the ﬂ ag State, with the understanding that when a stowaway declares himself or herself to be a refugee, this information should be treated as conﬁ dential to the extent necessary for the security of the stowaway; to ensure conﬁ dentiality in these cases no information should be forwarded to authorities public or private in the country of origin or residence of the stowaway;.5 not to depart from the planned voyage to seek the disembarkation of a stowaway discovered on board the ship after it has left the territorial waters of the State where the stowaways embarked, unless permission to disembark the stowaway has been granted by the public authorities of the State to whose port the ship deviates, or repatriation has been arranged elsewhere with suﬃ  cient documentation and permission given for disembarkation, or unless there are extenuating safety, security, health or compassionate reasons, or attempts to disembark in other ports on the planned voyage have failed and deviation is necessary in order to avoid that the stowaway remain on board for a signiﬁ cant period of time;.6 to ensure that the stowaway is presented to the appropriate authorities at the next port of call in accordance with their requirements;Fourth Schedule - (Cont'd)\f164\n\n L.R.O. 1998.7 to take appropriate measures to ensure the security, general health, welfare and safety of the stowaway until disembarkation, including providing him or her with adequate provisioning, accommodation, proper medical attention and sanitary facilities;.8 to ensure that stowaways are not permitted to work on board the ship, except in emergency situations or in relation to the stowaway's accommodation and provisioning on board; and.9 to ensure that stowaways are treated humanely, consistent with the basic principles.5.2 The shipownerIt is the responsibility of the shipowner of the ship on which stowaways are found:.1 to ensure that the existence of, and any relevant information on, the stowaway has been notiﬁ ed to the appropriate authorities at the port of embarkation, the next port of call and the ﬂ ag State;.2 to comply with any removal directions made by the competent national authorities at the port of disembarkation; and.3 to cover any applicable costs relating to the removal, detention, care and disembarkation of the stowaway in accordance with the legislation of the States which may be involved.5.3 The State of the ﬁ rst port of call according to the voyage planIt is the responsibility of the State of ﬁ rst port of call according to the voyage plan after the discovery of the stowaway:.1 to accept the stowaway for examination in accordance with the national laws of that State and, where the competent national authority considers that it would facilitate matters, to allow the shipowner and the competent or appointed P&I Club correspondent to have access to the stowaway;Fourth Schedule - (Cont'd)\f165\n\n L.R.O. 1998.2 to favourably consider allowing disembarkation and provide, as necessary and in accordance with national law, secure accommodation which may be at the expense of the shipowner, where:.1 a case is unresolved at the time of sailing of the ship; or.2 the stowaway is in possession of valid documents for return and the public authorities are satisﬁ ed that timely arrangements have been or will be made for repatriation and all the requisites for transit fulﬁ lled; or.3 other factors make it impractical for the stowaway to remain on the ship; such factors may include but are not limited to cases where a stowaway's presence on board would endanger the safe and secure operation of the ship, the health of the crew or the stowaway;.3 to make every eﬀ ort to cooperate in the identiﬁ cation of the stowaway and the establishment of his or her nationality/citizenship or right of residence;.4 to make every eﬀ ort to cooperate in establishing the validity and authenticity of a stowaway's documents and, when a stowaway has inadequate documents, to whenever practicable and to an extent compatible with national legislation and security requirements issue a covering letter with a photograph of the stowaway and any other important information, or alternatively, a suitable travel document accepted by the public authorities involved; the covering letter authorizing the return of the stowaway either to his or her State of origin or to the point where the stowaway commenced his or her journey, as appropriate, by any means of transportation and specifying any other conditions imposed by the authorities, should be handed over to the operator eﬀ ecting the removal of the stowaway; this letter will include information required by the authorities at transit points and/or the point of disembarkation;.5 to give directions for the removal of the stowaway to the port of embarkation, State of nationality/citizenship or right of residence or to some other State to which lawful directions may be made, in cooperation with the shipowner;.6 to inform the shipowner on whose ship the stowaway was found, as far as practicable, of the level of cost of detention and return and any additional costs for the documentation of the stowaway, if the shipowner is to cover these costs; in addition, public authorities should cooperate with the shipowner toFourth Schedule - (Cont'd)\f166\n\n L.R.O. 1998 keep such costs to a minimum, as far as practicable, and according to national legislation, if they are to be covered by the shipowner, as well as keeping to a minimum the period during which shipowners are held liable to defray costs of maintenance of a stowaway by public authorities;.7 to consider mitigation of charges that might otherwise be applicable when shipowners have cooperated with the control authorities to the satisfaction of those authorities in measures designed to prevent the transportation of stowaways; or where the master has properly declared the existence of a stowaway to the appropriate authorities in the port of arrival, and has shown that all reasonable preventive measures had been taken to prevent stowaways gaining access to the ship;.8 to issue, if necessary, in the event that the stowaway has no identiﬁ cation and/or travel documents, a document attesting to the circumstances of embarkation and arrival to facilitate the return of the stowaway either to his or her State of origin, to the State of the port of embarkation, or to any other State to which lawful directions can be made, by any means of transport;.9 to provide the document to the transport operator eﬀ ecting the removal of the stowaway;.10. to take proper account of the interests of, and implications for, the shipowner when directing detention and setting removal directions, so far as is consistent with the maintenance of control, their duties or obligations to the stowaway under the law, and the cost to public funds;.11 to report incidents of stowaways of which they become aware to the Organization;5.12 to cooperate with the ﬂ ag State of the ship in identifying the stowaway and their nationality/citizenship and right of residence, to assist in removal of the stowaway from the ship, and to make arrangements for removal or repatriation; and.13 if disembarkation is refused, to notify the ﬂ ag State of the ship the reasons for refusing disembarkation._________5 Refer to FAL.2/Circ.50/Rev.3 on Information on stowaway incidents, as may be amended.Fourth Schedule - (Cont'd)\f167\n\n L.R.O. 19985.4 Subsequent ports of callWhen the disembarkation of a stowaway has not been possible at the ﬁ rst port of call, it is the responsibility of the State of the subsequent port of call to follow the guidance provided in paragraph 5.3.5.5 State of embarkationIt is the responsibility of the State of the original port of embarkation of the stowaway (i.e. the State where the stowaway ﬁ rst boarded the ship):.1 to accept any returned stowaway having nationality/citizenship or right of residence;.2 to accept a stowaway back for examination where the port of embarkation is identiﬁ ed to the satisfaction of the public authorities of the receiving State; the public authorities of the State of embarkation should not return such stowaways to the State where they were earlier found to be inadmissible;.3 to apprehend and detain the attempted stowaway, where permitted by national legislation, if the attempted stowaway is discovered before sailing either on the ship or in cargo due to be loaded; to refer the attempted stowaway to local authorities for prosecution, and/or, where applicable, to the immigration authorities for examination and possible removal; no charge is to be imposed on the shipowner in respect of detention or removal costs, and no penalty is to be imposed;.4 to apprehend and detain the stowaway, where permitted by national legislation, if the stowaway is discovered while the ship is still in the territorial waters of the State of the port of his or her embarkation, or in another port in the same State (not having called at a port in another State in the meantime); no charge is to be imposed on the shipowner in respect of detention or removal costs, and no penalty is to be imposed;.5 to report incidents of stowaways or attempted stowaways of which they become aware to the Organization;6 and.6 to reassess the preventative arrangements and measures in place and to verify the implementation and eﬀ ectiveness of any corrective actions._________6 Refer to FAL.2/Circ.50/Rev.3 on Information on stowaway incidents, as may be amended. Fourth Schedule - (Cont'd)\f168\n\n L.R.O. 19985.6 State of nationality or right of residenceIt is the responsibility of the apparent or claimed State of nationality/citizenship of the stowaway and/or of the apparent or claimed State of residence of the stowaway:.1 to make every eﬀ ort to assist in determining the identity and nationality/ citizenship or the rights of residence of the stowaway and to document the stowaway, accordingly once satisﬁ ed that he or she holds the nationality/ citizenship or the right of residence claimed; where possible, the local embassy, consulate or other  diplomatic representation of the country of the stowaway's nationality will be required to assist in verifying the stowaway's nationality and providing emergency travel documentation;.2 to accept the stowaway where nationality/citizenship or right of residence is established; and.3 to report incidents of stowaways of which they become aware to the Organization.75.7 The ﬂ ag StateIt is the responsibility of the ﬂ ag State of the ship:.1 to be willing, if practicable, to assist the master/shipowner or the appropriate authority at the port of disembarkation in identifying the stowaway and determining his or her nationality/citizenship or right of residence;.2 to be prepared to make representations to the relevant authority to assist in the removal of the stowaway from the ship at the ﬁ rst available opportunity;.3 to be prepared to assist the master/shipowner or the authority at the port of disembarkation in making arrangements for the removal or repatriation of the stowaway; and.4 to report incidents of stowaways of which they become aware to the Organization.5.8 States of transit during repatriationIt is the responsibility of any States of transit during repatriation to allow, subject to normal visa requirements and national security concerns, the transit through their ports and airports of stowaways travelling under the removal instructions or directions of the State of the port of disembarkation._________7 Refer to FAL.2/Circ.50/Rev.3 on Information on stowaway incidents, as may be amended.Fourth Schedule - (Cont'd)\f169\n\nL.R.O. 1998Facilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-     )PART BFORM OF STOWAWAY DETAILS REFERRED TO IN RECOMMENDEDPRACTICE 4.6.2 OF THE CONVENTION ON FACILITATION OF INTERNATIONAL MARITIME TRAFFIC 1965, AS AMENDEDSHIP DETAILSName of ship: IMO number:Flag:Company:Company address:Agent in next port:Agent address:IRCS:Inmarsat number:Date of birth:Place of birth:Claimed nationality:Home address:Country of domicile:ID document type,e.g. passport no.:ID card no. orSeaman's book no.:If yes,When issued:Where issued:Fourth Schedule - (Cont'd)\f170\n\n L.R.O. 1998FORM OF STOWAWAY DETAILS REFERRED TO IN RECOMMENDED PRACTICE 4.6.2 OF THE CONVENTION ON FACILITATION OF INTERNATIONAL MARITIME TRAFFIC 1965, AS AMENDED - (Cont'd)Port of registry: Name of master:STOWAWAY DETAILSDate/time found on board:Place of boarding:8 Country of boarding:Date/time of boarding:Intended ﬁ nal destination:Stated reasons for boarding the ship:9Surname:Given name:Name by which known:Gender:Date of expiry:Issued by: Photograph of the stowaway:General physical descriptionof the stowaway:Photograph if available _________8 \"Place of boarding\" should include port, port facility number, berth and terminal information (FAL.7/Circ.1, related to the Uniﬁ ed interpretation of appendix 3 to the FAL Convention). 9 If the stowaway declares himself or herself to be a refugee or an asylum seeker, this information shall be treated as conﬁ dential to the extent necessary to the security of the stowaway.Fourth Schedule - (Cont'd)\f171\n\n L.R.O. 1998FORM OF STOWAWAY DETAILS REFERRED TO IN RECOMMENDED PRACTICE 4.6.2 OF THE CONVENTION ON FACILITATION OF INTERNATIONAL MARITIME TRAFFIC 1965, AS AMENDED - (Cont'd)First language:Spoken:Read:Written:Other languages:Spoken: Read:Written:Other details:(1) Method of boarding, including other persons involved (e.g. crew, port workers, etc.), and   whether the stowaway was secreted in cargo/container or hidden in the ship:(2) Inventory of the stowaway's possessions:Fourth Schedule - (Cont'd)\f172\n\n L.R.O. 1998FORM OF STOWAWAY DETAILS REFERRED TO IN RECOMMENDED PRACTICE 4.6.2 OF THE CONVENTION ON FACILITATION OF INTERNATIONAL MARITIME TRAFFIC 1965, AS AMENDED - (Concl'd)(3) Statement made by the stowaway:(4) Care provided to the stowaway (ﬁ rst aid, clothing, food):Date(s) of interview(s):Stowaway's signature: Master's signature:Date: Date:Fourth Schedule - (Concl'd)\f173\n\nL.R.O. 1998FIFTH SCHEDULE(Sections 12(7) and 50)List of oﬃ  cers to whom pre-arrival andpre-departure documents to be submittedFacilitation of International Maritime Traﬃ  c Act, 2024 (Act 2024-     )DocumentPhytosanitary documentsOther agricultural related informationCrew ListPassenger ListAdvanced Notiﬁ cation Form for Waste DeliveryList of Ports of CallMaritime Declaration of HealthInternational Certiﬁ cation of VaccinationYellow Fever Vaccination ListShip Sanitation Control Exemption Certiﬁ cateShip Sanitation Control Certiﬁ cateOﬃ  cerChief Agricultural Oﬃ  cerChief Environmental Health Oﬃ  cer\f174\n\n L.R.O. 1998DocumentSecurity-related informationStowaway documentsAdvanced Passenger InformationList of Ports of CallAdvanced Passenger InformationAdvanced Cargo InformationGeneral DeclarationCargo Declaration/Ship ManifestShip's Stores DeclarationCrew's Eﬀ ects DeclarationDangerous Good's ManifestAdvanced Cargo InformationSOLAS certiﬁ catesSTCW certiﬁ catesMARPOL certiﬁ cates;Maritime labour certiﬁ cate Declaration of Maritime Labour Compliance International Ballast Water Management Certiﬁ cateInternational Anti-fouling Systems Certiﬁ cate Declaration on Anti-fouling System any other document speciﬁ ed in the CaribbeanMemorandum of UnderstandingOﬃ  cerChief Executive Oﬃ  cer, Barbados Port Inc.Chief Immigration Oﬃ  cerComptroller of CustomsFifth Schedule - (Concl'd)Chief Operations Oﬃ  cer, JRCCDesignated Lead Port State Control Oﬃ  cer\f175\n\nL.R.O. 1998SIXTH SCHEDULE(Sections 13, 26, 27, 28 and 50)Certiﬁ cates of Clearance on Pre-Arrival and ArrivalFacilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-     )PART AFORM OF PROVISIONAL CERTIFICATE OF CLEARANCE FOR ARRIVALShip Name:Type of Ship:Gross Tonnage:IMO Number:Call Sign:Port of Registry:Date of Registry:Passenger Amount (where applicable):Date and time of virtual arrival in Barbados:Expected date and time of actual arrival in Barbados:Issued by:Date of issue:Time of issue:\f176\n\n L.R.O. 1998This is to certify that the pre-arrival documents submitted through the Barbados MaritimeSingle Window, relating to , in accordance with section 12 of the Facilitation of International Maritime Traﬃ  c Act, 2024 (Act 2024- ) have been examined and the information has been veriﬁ ed and is in order.The is granted Provisional Clearance to enter thePort of Bridgetown in accordance with section 13 of the Facilitation of International MaritimeTraﬃ  c Act, 2024 and shall be subject to on-board inspection on arrival at the Port.Name of ShipName of ShipSixth Schedule - (Cont'd)\f177\n\nL.R.O. 1998Facilitation of International Maritime Traﬃ  c Act, 2024 (Act 2024-     )PART BFORM OF CERTIFICATE OF CLEARANCE FOR ARRIVALShip Name:Type of Ship:Gross Tonnage:IMO Number:Call Sign:Port of Registry:Date of Registry:Passenger Amount (where applicable):Date and time of arrival in Barbados:Date and time of actual arrival in Barbados:Issued by:Date of issue:Time of issue:Sixth Schedule - (Cont'd)\f178\n\n L.R.O. 1998In accordance with section 13 of the Facilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-   ) - the Ship has been inspected and has satisﬁ ed the requirements of the Immigration Act, Cap. 190, Customs Act, Cap. 66 andHealth Services (Assignment of Public Inspectors to Private Businesses) Regulations, 1986(S.I. 1986 No. 143).The Ship   is granted Final Clearance to enter the Port of Bridgetown.  Issued by:Date of Issue:Time of Issue:Name of ShipName of ShipSixth Schedule - (Concl'd)\f179\n\nL.R.O. 1998SEVENTH SCHEDULE(Sections 16 and 50)Form of Notice of Intended DepartureFacilitation of International Maritime Traﬃ  c Act, 2024 (Act 2024-     )FORM OF NOTICE OF INTENDED DEPARTUREPort Authority (Marine Section)PortofName of Ship:  Nationality:Tons: Gross Net:Name of Master: Number of Crew:Arrived from: Date:Cargo imported:  Bill of Lading Packages: Tons:Number of Passengers Arrived:Bound to:Cargo imported:  Bill of Lading Packages:Tons:Deck Cargo Outwards:  Tons c.ftAnimalsNumber of Mail bags shipped:Number of Passengers embarked:19Owners/Agents.\f180\n\nL.R.O. 1998EIGHTH SCHEDULE(Sections 12, 17(1) and (2), 50)Certiﬁ cates of Clearance on DepartureFacilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-     )PART APROVISIONAL CERTIFICATE OF CLEARANCE FOR DEPARTUREShip Name:Type of Ship:Gross Tonnage:IMO Number:Call Sign:Port of Registry:Date of Registry:Passenger Amount (where applicable):Date and time of virtual departure from Barbados:Expected date and time of actual departure from Barbados:\f181\n\n L.R.O. 1998This is to certify that the pre-departure documents submitted through the Barbados MaritimeSingle Window in accordance with section 16 of the Facilitation of International Maritime Traﬃ  c Act, 2024 (Act 2024-    ) have been examined and the information has been veriﬁ ed and is in order.   The   is granted Provisional Clearance to depart from the Port of Bridgetown in accordance with section 17 of the Facilitation of International Maritime Traﬃ  c Act, 2024 and shall be subject to on-board inspection prior to departure from the Port.Issued by:Date of Issue:Time of Issue:Name of ShipSignatureStampEighth Schedule - (Cont'd)\f182\n\nL.R.O. 1998Facilitation of International Maritime Traﬃ  c Act, 2024 (Act 2024-     )PART BFORM OF FINAL CERTIFICATE OF CLEARANCE ON DEPARTUREShip Name:Type of Ship:Gross Tonnage:IMO Number:Call Sign:Port of Registry:Date of Registry:Passenger Amount (where applicable):Date and time of departure from Barbados:Date and time of actual departure from Barbados:Eighth Schedule - (Cont'd)\f183\n\n L.R.O. 1998 In accordance with section 17(2) of the Facilitation of International Maritime Traﬃ  c Act,2024 (Act 2024-    ) - the   has been inspected and has satisﬁ ed the requirements of the Immigration Act, Cap. 190, Customs Act, Cap. 66 and Health Services (Assignment of Public Inspectors to Private Businesses)  Regulations, 1986 (S.I. 1986 No. 143).                     The     is granted Final Clearance to depart from the Port. Issued by:Date of Issue:Time of Issue:Name of ShipName of ShipStampEighth Schedule - (Concl'd)\f184\n\nL.R.O. 1998NINTH SCHEDULE(Sections 18(1), (2) and 50)List of oﬃ  cers to whom ﬁ nes are to be paid foroutstanding pre-arrival and pre-departure documentsFacilitation of International Maritime Traﬃ  c Act, 2024(Act 2024-     )Oﬃ  cerChief Agricultural Oﬃ  cerChief Environmental Health Oﬃ  cerDocumentPhytosanitary documentsOther agricultural related informationCrew ListPassenger ListMaritime Declaration of HealthInternational Certiﬁ cation of VaccinationYellow Fever Vaccination ListShip Sanitation Control Exemption Certiﬁ cateShip Sanitation Control Certiﬁ cate\f185\n\n L.R.O. 1998Oﬃ  cerChief Executive Oﬃ  cer, Barbados Port Inc.Chief Immigration Oﬃ  cerComptroller of CustomsDesignated Lead Port State Control Oﬃ  cerDocumentSecurity-related informationStowaway documentsList of Ports of CallGeneral DeclarationCargo Declaration/Ship ManifestShip's Stores DeclarationCrew's Eﬀ ects DeclarationDangerous Good's ManifestLetter Bulk - Bulk mailSOLAS certiﬁ catesSTCW certiﬁ catesMARPOL certiﬁ catesMaritime labour certiﬁ cate Declaration of Maritime Labour Compliance International Ballast Water Management Certiﬁ cateInternational Anti-fouling Systems Certiﬁ cate Declaration on Anti-fouling System any other document speciﬁ ed in the CaribbeanMemorandum of UnderstandingNinth Schedule - (Concl'd)\f186\n\n L.R.O. 1998TENTH SCHEDULE(Section 51)CONSEQUENTIAL AMENDMENTSColumn 1EnactmentBarbados Harbours Regulations, 1961(L.N. 1961 No. 11)Column 2Amendments1. Revoke regulations 12, 13, 17 and 35. 2. Delete regulation 22 and substitute thefollowing:''Master to deliver ship registrycertiﬁ cate  22. The master of a ship which has arrived in Barbados from a port outside of Barbados shall on enteringa harbour produce the ship's registry certiﬁ cate at the request of an authorisedemployee.''.3. Delete regulation 103 and substitute thefollowing:''Dangerous Goods Manifest 103. (1) The ship owner, ship agent or master of every ship having on board any dangerous goods shall submita Dangerous Goods Manifest in accordance with section 12 of the Facilitation of International Maritime  Traﬃ  c Act, 2024 (Act 2024-     ).\f187\n\n L.R.O. 1998Column 1EnactmentBarbados Harbours Regulations, 1961 (L.N. 1961 No. 11) - (Concl'd)Quarantine Act, Cap. 53Quarantine (Maritime) Regulations,1947 (S.I. 1947 No. 38) Column 2Amendments (2) Where the ship owner,  ship agentor master fails to submit a DangerousGoods Manifest in accordance withsubsection (1) and dangerous goods are landed in Barbados, the management may  (a) order the dangerous goods to be  placed on board the ship on which which they have arrived;(b) destroy the dangerous goods; or (c) otherwise deal with the dangerousgoods as it considers necessaryat the risk and expense of the ship on which they arrived.''.4. Delete the Second Schedule.In section 12, delete the words \"nine hundredand sixty dollars\" wherever they appear andsubstitute the words \"one hundred thousanddollars\".1. In regulation 2, (a) in the deﬁ nition \"approved port\" deletethe words \"deratisation certiﬁ cate\" and  Tenth Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f188\n\n L.R.O. 1998Column 1EnactmentQuarantine (Maritime) Regulations, 1947 (S.I. 1947 No. 38) - (Cont'd)Column 2Amendments \"deratisation exemption certiﬁ cate\" andsubstitute the words \"Ship  SanitationControl Exemption Certiﬁ cate\" and \"Ship Sanitation Control Certiﬁ cate\" set out in Schedule  E\";(b) delete the deﬁ nition \"deratisation certiﬁ cate\" and \"deratisation exemptioncertiﬁ cate\";(c) in the deﬁ ntion \"valid\" delete the words\"deratisation certiﬁ cate or deratisation exemption certiﬁ cate\" and substitute the words \"Ship Sanitation Control ExemptionCertiﬁ cate\" or \"Ship Sanitation ControlCertiﬁ cate\" set out in Schedule E.\".2. Delete regulation 4 and substitute the following:\"Declaration of health 4. (1) The master of a shipapproaching the Island from a foreignport shall submit a Maritime Declarationof Health set out in Schedule A through the Barbados Maritime Single Window.Tenth Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f189\n\n L.R.O. 1998Column 1EnactmentQuarantine (Maritime) Regulations, 1947 (S.I. 1947 No. 38) - (Cont'd)Column 2Amendments(2)For the purposes of this section\"Barbados Maritime Single Window\" has the meaning assigned to it in the Facilitation of International Maritime Traﬃ  c Act, 2024 (Act 2024-    ).3.Delete Schedule A and substitute the following:Tenth Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f190\n\nL.R.O. 1998CONSEQUENTIAL AMENDMENTS - (Cont'd)\"SCHEDULE A(Regulations 4 and 5)Maritime Declaration of HealthTo be completed and submitted to the competent authorities by the masters of ships arrivingfrom foreign ports.Submitted at the port of: Date:Name of ship or inland navigation vessel: Registration/IMO No.: Arriving from: Sailing to:(Nationality)/(Flag of vessel): Master’s name:Gross tonnage (ship):Tonnage (inland navigation vessel):Valid Sanitation Control Exemption/Control Certiﬁ cate carried on board?   Issued at:Date:YesNoTenth Schedule - (Cont'd)\f191\n\n L.R.O. 1998Re-inspection required?Has ship/vessel visited an aﬀ ected area identiﬁ ed by the World Health Organization?Port and date of visit:List ports of call from commencement of voyage with dates of departure, or within past 30days, whichever is shorter:On the request of the competent authority at the port of arrival, list crew members, passengers orother persons who have joined ship/vessel since international voyage began or within past30 days, whichever is shorter, including all ports/countries visited in this period (addadditional names to the attached schedule):(1) Name: joined from: (1)  (2)  (3)(2) Name: joined from: (1)  (2)  (3)(3) Name: joined from: (1)  (2)  (3)Number of crew members on board:  Number of passengers on board:YesNoYesNoCONSEQUENTIAL AMENDMENTS - (Cont'd)Tenth Schedule - (Cont'd)\f192\n\n L.R.O. 1998YesNoNoYesNoYesNoYesNoYesNoYesNoYesCONSEQUENTIAL AMENDMENTS - (Cont'd)Tenth Schedule - (Cont'd)Health questions(1) Has any person died on board during the voyage otherwise than as a result of  accident? If yes, state particulars in attached schedule. Total no. of deaths(2) Is there on board or has there been during the international voyage any case of disease  which you suspect to be of an infectious nature?  If yes, state particulars in attached schedule.(3) Has the total number of ill passengers during the voyage been greater than normal/ expected?  How many ill persons?  (4) Is there any ill person on board now? If yes, state particulars in attached schedule.(5) Was a medical practitioner consulted?   If yes, state particulars of medical treatment or advice provided in attached schedule.(6) Are you aware of any condition on board which may lead to infection or spread of disease?   If yes, state particulars in attached schedule.(7) Has any sanitary measure (e.g. quarantine, isolation, disinfection or decontamination)  been applied on board? If yes, specify type, place and date:\f193\n\n L.R.O. 1998YesNoYesNoSignature of MasterCountersignature Ship’s Surgeon (if carried)DateCONSEQUENTIAL AMENDMENTS - (Cont'd)Tenth Schedule - (Cont'd)(8) Have any stowaways been found on board?  If yes, where did they join the ship? (if known)(9) Is there a sick animal or pet on board?Note: In the absence of a surgeon, the master should regard the following symptoms as grounds for suspecting the existence of a disease of an infectious nature: (a) fever, persisting for several days or accompanied by:(i) prostration;(ii) decreased consciousness;(iii)  glandular swelling;(iv) jaundice;(v) cough or shortness of breath;(vi) unusual bleeding; or(vii) paralysis;(b) with or without fever:(i) any acute skin rash or eruption;(ii) severe vomiting (other than sea sickness);(iii) severe diarrhoea; or(iv) recurrent convulsions.I hereby declare that the particulars and answers to the questions given in this Declaration of Health (including the schedule) are true and correct to the best of my knowledge and belief.\f194\n\n L.R.O. 1998ATTACHMENT TO MARITIME DECLARATION OF HEALTHNameSexClassorratingAgePort, date joinedship/vesselNature of illnessDate of onset of symptomsReportedto a portmedicaloﬃ  cer?Disposal of case1Drugs,medicines,or othertreatmentgiven to patientCommentsNationality1 State:  (1) whether the person recovered, is still ill or died; and  (2) whether the person is still on board, was evacuated (including the name of the port or airport), or was buried at sea.\". CONSEQUENTIAL AMENDMENTS - (Cont'd)Tenth Schedule - (Cont'd)\f195\n\n L.R.O. 1998Column 1EnactmentQuarantine (Maritime) Regulations, 1947 (S.I. 1947 No. 38) - (Cont'd)Column 2Amendments4. In regulation 5, delete paragraph 4 and substitute the following: \"(4) When a ship is grantedradio pratique, the master shallimmediately on arrival at  a port ofthe Island, deliver or cause to be delivered to the environmental healthoﬃ  cer the Maritime Declaration of Health set out in Schedule A , theship's bill of health (if any) and theShip Sanitation Control Exemption Certiﬁ cate or the Ship Sanitation Control Certiﬁ cate set out inSchedule out in Schedule E;\".5. In Part VI, delete the Part Heading \"Deratisation of Ships\" and substitute the Part Heading\"Sanitizing of Ships\".Tenth Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f196\n\n L.R.O. 1998Column 1EnactmentQuarantine (Maritime) Regulations, 1947 (S.I. 1947 No. 38) - (Cont'd)Column 2Amendments6. In regulation 27,(a) in paragraph (1) delete the words \"deratisation certiﬁ cate or deratisation exemption certiﬁ cate\" and substitute thewords \"Ship Sanitation Control ExemptionCertiﬁ cate or \"Ship Sanitation ControlCertiﬁ cate\";(b) in paragraph (2) delete the words\"deratisation exemption certiﬁ cate\" and substitute the words \"Ship SanitationControl Exemption Certiﬁ cate\";(c) in paragraph (4), delete the words  \"deratisation certiﬁ cate or deratisation  exemption certiﬁ cate\" and substitute thewords \"Ship Sanitation Control  ExemptionCertiﬁ cate or Ship Sanitation ControlCertiﬁ cate\"; and  CONSEQUENTIAL AMENDMENTS - (Cont'd)Tenth Schedule - (Cont'd)\f197\n\n L.R.O. 1998Column 1EnactmentQuarantine (Maritime) Regulations, 1947 (S.I. 1947 No. 38) - (Concl'd)Column 2Amendments7. In regulation 28,(a) delete the words \"deratisation certiﬁ cateor deratisation exemption certiﬁ cate\"appearing immediately after the word \"valid\" and substitute  the words  \"ShipSanitation Control Exemption Certiﬁ cateor Ship Sanitation Control Certiﬁ cate\";and(b) delete the words \"deratisation certiﬁ cate\"appearing at the end of the regulationand substitute the words \"Ship SanitationControl Exemption Certiﬁ cate or ShipSanitation Control Certifcate\".8. In regulation 29, delete the words \"Deratisationcertiﬁ cates and deratisation exemption certiﬁ cates\" and substitute the words \"ShipSanitation Control Exemption Certiﬁ catesand Ship Sanitation Control Certiﬁ cates\".9. In  regulation 31,  in paragraph (1) delete  the words \"valid deratisation certiﬁ cates or validderatisation exemption certiﬁ cates\" and substitute the words \"valid Ship Sanitation Control Exemption certiﬁ cates or valid ShipSanitation Control Certiﬁ cates\".10. Delete Schedule E and substitute the following:CONSEQUENTIAL AMENDMENTS - (Concl'd)Tenth Schedule - (Cont'd)\f198\n\nL.R.O. 1998\"SCHEDULE E(Regulations 2, 27, 28, 29 and 31)Ship Sanitation Control Exemption Certiﬁ cate/Ship Sanitation Control Certiﬁ catePort of  Date:This Certiﬁ cate records the inspection and (1) exemption from control or (2) control measures appliedName of ship or inland navigation vesselFlag Registration/IMO No.At the time of inspection the holds were unladen/laden with tonnes of cargoName and address of inspecting oﬃ  cerTenth Schedule - (Cont'd)\f199\n\n L.R.O. 1998Sample results2Evidence found1Ship Sanitation Control Exemption Certiﬁ cateDocuments reviewedMedical logShip’s logOtherNo evidence found. Ship/vessel is exempted from control measures.1(a) Evidence of infection or contamination, including: vectors in all stages of growth; animal reservoirs for vectors; rodents or other species that could carry human disease, microbiological, chemical and other risks to human health; signs of inadequate sanitary measures. (b) Information concerning any human cases (to be included in the Maritime Declaration of Health).2 Results from samples taken on board.  Analysis to be provided to ship’s master by most expedient means and, if re-inspection is required, to the next appropriate port of call coinciding with the re-inspection date speciﬁ ed in this certiﬁ cate.  Sanitation Control Exemption Certiﬁ cates and Sanitation Control Certiﬁ cates are valid for a maximum of 6 months but the validity period may be extended by one month if inspection cannot be carried out at the port and there is no evidence of infection or contamination.Tenth Schedule - (Cont'd)Areas, [systems, and services] inspectedGalleyPantryStoresHold(s)/cargoQuarters:- crew- oﬃ  cers- passengers- deckPotable waterSewageBallast tanksSolid and medical wasteStanding waterEngine roomMedical facilitiesOther areas speciﬁ ed - see attachedNote areas not applicable, by marking N/ADocuments reviewedMedical logShip’s logOtherName and designation of issuing oﬃ  cerSignature and sealDate\f200\n\n L.R.O. 1998Control measures appliedRe-inspection dateComments regardingconditions foundShip Sanitation Control Certiﬁ cateNo evidence found. Ship/vessel is exempted from control measures.1(a) Evidence of infection or contamination, including: vectors in all stages of growth; animal reservoirs for vectors; rodents or other species that could carry human disease, microbiological, chemical and other risks to human health; signs of inadequate sanitary measures. (b) Information concerning any human cases (to be included in the Maritime Declaration of Health).2 Results from samples taken on board.  Analysis to be provided to ship’s master by most expedient means and, if re- inspection is required, to the next appropriate port of call coinciding with the re-inspection date speciﬁ ed in this certiﬁ cate.  Sanitation Control Exemption Certiﬁ cates and Sanitation Control Certiﬁ cates are valid for a maximum of six months  but the validity period may be extended by one month if inspection cannot be carried out at the port and there is no evidence of infection or contamination.Name and designation of issuing oﬃ  cerSignature and sealDateTenth Schedule - (Cont'd)\f201\n\n L.R.O. 1998SampleresultsEvidence foundControlmeasures appliedRe-inspectiondateComments regardingconditions foundAreas/facilities/systems inspected1Food Source Storage Preparation ServiceWater Source Storage DistributionWaste Holding Treatment DisposalSwimming pools/spas Equipment Operation Medical facilities Equipment and  medical devices  Operation MedicinesOther areas inspectedDocuments reviewedAttachment to Model Ship Sanitation Control Exemption Certiﬁ cate/Ship Sanitation Control Certiﬁ cateTenth Schedule - (Concl'd)1 Indicate when the areas listed are not applicable by marking N/A.\".\f202\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}