{
  "bill_id": 753,
  "slug": "transport-authority-amendment-act-2024",
  "title": "Transport Authority (Amendment) Act, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/005b094e54fe2542a2e8f745a39d4796.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-02-07",
  "first_reading": "2024-02-07",
  "gazette_date": "2024-02-12",
  "markdown": "Draft 1: 2023-11-27\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Transport  Authority  Act,  Cap.  295A  to  make\nprovision for the Transport Authority to cancel or suspend any licence issued in\nrespect of authorising a person to drive or act as a conductor on a public service\nvehicle, motor omnibus, minibus or route-taxi; and for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of section 2 of Cap. 295A\n\nAmendment of section 23 of Cap. 295A\n\nAmendment of section 31 of Cap. 295A\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Transport Authority Act, Cap. 295A to make provision\nfor the Transport Authority to cancel or suspend any licence issued in respect\nof authorising a person to drive or act as a conductor on a public service vehicle,\nmotor omnibus, minibus or route-taxi.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n2024.\n\nThis Act may be cited as the Transport Authority (Amendment) Act,\n\nAmendment of section 2 of Cap. 295A\n\nSection  2  of  the  Transport  Authority  Act,  Cap.  295A  in  this  Act\n2.\nreferred  to  as  the  principal  Act  is  amended  by  inserting  in  the  appropriate\nalphabetical order the following new definitions:\n\n“ “licence” means\n\n(a)\n\n(b)\n\na  driving  licence  to  drive  a  public  service  vehicle,  motor\nomnibus,  minibus  or  route-taxi  issued  pursuant  to  section\n23(1A); or\n\na licence or authorization to act as a conductor on a public\nservice vehicle, motor omnibus, minibus or route-taxi issued\npursuant to section 23(1A);\n\n“permit ” means a permit issued pursuant to section 23(1) to operate a\nmotor vehicle as a public service vehicle, motor omnibus, minibus\nor route taxi; ”.\n\nAmendment of section 23 of Cap. 295A\n\n3.\nSection  23  of  the  principal  Act  is  amended  in  paragraph  (b)  of\nsubsection (1A) by deleting the word “it” appearing immediately after the word\n“licence”.\n\nAmendment of section 31 of Cap. 295A\n\n4.\nand substituting the following:\n\nSection 31 of the principal Act is amended by deleting paragraph (f)\n\n\f5\n\n“(f)\n\nissuing licences in respect of public service vehicles, motor\nomnibuses, minibuses and route taxis;”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}