{
  "bill_id": 754,
  "slug": "labour-clauses-concessions-act-2024",
  "title": "Labour Clauses (Concessions) Act, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/10b0027ffff76c6ea1913fa3778281d9.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-02-14",
  "first_reading": "2024-02-14",
  "gazette_date": "2024-02-12",
  "markdown": "2024/02/05\n\nOBJECTS AND REASONS\n\nThis Bill would make provision for the conditions applicable to concessions\n\ngranted to employers.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nShort title\n\nInterpretation\n\nLabour clauses\n\nConditions applicable to concessions\n\nAppeal\n\nRegulations\n\nAmendment of Schedules\n\nConsequential amendments\n\nFIRST SCHEDULE\n\nConcessions Enactments\n\nSECOND SCHEDULE\n\nLabour Clauses\n\nTHIRD SCHEDULE\n\nLabour Enactments\n\nFOURTH SCHEDULE\n\nConsequential Amendments\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  make  provision  for  the  conditions  applicable  to  concessions\n\ngranted to employers.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n2024.\n\nThis  Act  may  be  cited  as  the  Labour  Clauses  (Concessions)  Act,\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Barbados Revenue Appeals Tribunal” means the Barbados Revenue Appeals\nthe  Barbados  Revenue  Authority  Act\n\nTribunal  established  under\n(Act 2014-1);\n\n“concession” may include\n\n(a)\n\nan exemption, waiver or remit of a tax under an enactment set out in\nthe First Schedule; or\n\n(b)\n\na benefit granted to an employer having received an approval of\n\n(i)\n\n(ii)\n\nthe status of the employer as an approved entity as defined in an\nenactment;\n\nthe  status  of  an  approved  product  or  an  approved  project,  as\ndefined in an enactment, developed by the employer; or\n\n(iii)\n\nthe status referred to in subparagraphs (i) and (ii);\n\n“employee” means an individual who has entered into or works under a contract\n\nof employment;\n\n“employer” in relation to an employee means\n\n(a)\n\n(b)\n\n(c)\n\nthe person by whom the employee is employed;\n\nthe person in whose organization the employee is employed; or\n\nthe  operator  of  an  establishment  where  the  employee  is  engaged  to\nwork;\n\n\f5\n\n“Employment  Rights  Tribunal”  means  the  Employment  Rights  Tribunal\n\nestablished under the Employment Rights Act, 2012 (Act 2012-9);\n\n“tax” means import duty, consumption tax, income tax or any other tax, duty or\n\nimpost.\n\nLabour clauses\n\n3.(1)\nrelation to employees and employers referred to under this Act.\n\nThe labour clauses set out in the Second Schedule shall have effect in\n\nA Minister referred to in the Second Schedule shall carry out such actions\n(2)\nas  are  required  in  relation  to  the  employers  and  employees  referred  to  in\nsubsection  (1)  in  accordance  with  the  labour  clauses  set  out  in  the  Second\nSchedule.\n\nThe Chief Labour Officer shall carry out such actions as are required in\n(3)\nrelation  to  the  employers  and  employees  referred  to  in  subsection  (1)  in\naccordance with the labour clauses set out in the Second Schedule.\n\nWhere a dispute arises as to what wages ought to be paid or what hours or\n(4)\nother  working  conditions  ought  to  be  observed  in  accordance  with  the\nrequirements of paragraph 1 of the Second Schedule, the dispute shall be referred\nto the Employment Rights Tribunal by the Chief Labour Officer.\n\nConditions applicable to concessions\n\n4.(1)\nemployer fails to comply with\n\nNotwithstanding  anything  contained  in  any  enactment,  where  an\n\n(a)\n\n(b)\n\nthe labour clauses set out in the Second Schedule\n\nthe enactments set out in the Third Schedule or any other enactment\nrelating to labour,\n\na concession granted under any enactment may be suspended or revoked by the\nMinister responsible for the enactment under which the concession is granted on\nconsultation with the Minister responsible for labour.\n\n\f6\n\n(2)\nA decision made under subsection (1) in regard to an employer shall be\ncommunicated to that employer, in writing, within 7 days of the making of that\ndecision.\n\nAppeal\n\nA person aggrieved by a decision made under section 4(1) may, within\n5.\n7  days  after  receiving  the  decision,  appeal  to  the  Barbados  Revenue  Appeals\nTribunal.\n\nRegulations\n\n6.(1)\nfor the purposes of giving effect to this Act.\n\nThe Minister responsible for labour may make regulations generally\n\nThe  regulations  made  under  subsection  (1)  shall  be  subject  to  negative\n\n(2)\nresolution.\n\nAmendment of Schedules\n\n7.\nSchedule, Second Schedule and Third Schedule.\n\nThe Minister responsible for labour may, by order, amend the First\n\nConsequential amendments\n\n8.\namended in the manner specified in Column 2 of the Fourth Schedule.\n\nThe  enactments  set  out  in  Column  1  of  the  Fourth  Schedule  are\n\n\f7\n\nFIRST SCHEDULE\n\nConcessions Enactments\n\n(Section 2)\n\n1. Duties, Taxes and Other Payments (Exemption) Act, 2023 (Act 2023-14)\n\n2. Shipping (Incentives) Act, Cap. 90A\n\n3. Small Business Development Act, Cap. 318C\n\n4. Special Development Areas Act, Cap. 237A\n\n5. Tourism Development Act, Cap. 341\n\n\f8\n\nSECOND SCHEDULE\n\nLabour Clauses\n\n(Sections 3,4 and 7)\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nAn  employer  shall  pay  the  rates  of  wages  and  observe  hours  and  other  conditions  of\nemployment that are not less favourable than those established in the trade, industry or\nsector for which he has been granted a concession pursuant to any enactment.\n\nThe rates of wages, hours and conditions of employment shall be established by agreement\nor arbitration between the most representative organisation of employers and the most\nrepresentative organisation of employees engaged in the trade, industry or sector to which\nthe concession relates.\n\nWhere there are no established rates, hours or other conditions as defined in paragraph 1,\nthe  Chief  Labour  Officer,  after  consultation  with  representatives  of  employers  and\nemployees, shall establish and publish in the Official Gazette a schedule setting out fair\nand reasonable rates and conditions which are to be observed by the employer, having\nregard to persons employed in a capacity and in general circumstances similar to those\nengaged by the employer.\n\nAn employer shall keep records of wages and records of time worked of an employee in\nthe execution of tasks or duties under the award of the concession or other benefit and the\nrecords shall be kept in electronic form or otherwise to be made available for inspection\nof any person authorized by the Chief Labour Officer in accordance with the provisions\nof the Labour Department Act, Cap. 23.\n\nAn employer shall treat an employee pursuant to a grant of concessions as a person insured\nunder section 12(1) of the National Insurance Act, Cap. 47.\n\nAn employer shall recognize the freedom of their employees to be members of a registered\ntrade union and recognize their right to bargain collectively.\n\nWhere  there  is  a  default  in  the  payment  of  any  money  in  respect  of  wages  or  other\nentitlements of an employee, that employee may make a claim for the payment of unpaid\nwages or other entitlements in accordance with any enactment governing the protection\nof wages or other entitlements in Barbados.\n\nThe employer shall from time to time furnish to the relevant Minister under a relevant\nenactment such further detailed information and evidence as the Minister, on consultation\nwith  the  Chief  Labour  Officer,  may  deem  necessary  in  order  to  satisfy  him  that  the\nconditions set out in the provisions of this Schedule have been complied with.\n\n\f9\n\nTHIRD SCHEDULE\n\nLabour Enactments\n\n(Section 4 and 7)\n\n1. Employment Rights Act, 2012 (Act 2012-9)\n\n2. Employment (Prevention of Discrimination) Act, 2020 (Act 2020-26)\n\n3. Employment (Sexual Harassment Prevention) Act, 2017 (Act 2017-21)\n\n4. Labour Clauses (Public Contracts) Act, Cap. 349\n\n5. Labour Department Act, Cap. 23\n\n6. Protection of Wages Act, Cap. 351\n\n7. Safety and Health at Work Act, Cap. 356\n\n8. Shops Act, 2015 (Act 2015-30)\n\n\f10\n\nFOURTH SCHEDULE\n\nConsequential Amendments\n\n(Section 8)\n\nColumn 1\n\nEnactments\n\nColumn 2\n\nAmendments\n\n1. Barbados Revenue Authority Act, 2014 (Act\n\n2014-1)\n\n2. Employment Rights Act, 2012 (Act 2012-9)\n\nIn the First Schedule, delete paragraph 12\nand substitute the following:\n\n“12. Labour Clauses (Concessions) Act,\n2024 (Act 2024- ).”.\n\nSection 7(2) is deleted and the following\nis substituted:\n\n“(2) The jurisdiction of the Tribunal is to\ndetermine  complaints  made  to  it  under\nthis Act or under any other enactment that\nprovides for enforcement by the Tribunal\nor the determination of disputes referred\nto the Tribunal under any enactment, and\nsubject to section 48, to make awards and\nother  decisions  in  relation  to  those\ncomplaints\nits\npowers.\".\n\nin  accordance  with\n\n\f11\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}