{
  "bill_id": 755,
  "slug": "financial-institutions-amendment-act-2024",
  "title": "Financial Institutions (Amendment) Act, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/d6a849497099904372c144b82ea227b9.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-02-07",
  "first_reading": "2024-02-07",
  "gazette_date": "2024-02-12",
  "markdown": "2024-02-06\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Financial Institutions Act, Cap. 324A to provide\n\nfor\n\n(a)\n\n(b)\n\n(c)\n\nthe Central Bank to exercise a discretion to require a licensee to disclose\nthe basis for imposing a fee or charge;\n\nthe period of notice within which a licensee informs the Central Bank\nof the imposition or variation of a fee or charge;\n\nthe period of notice for the Central Bank to advise a licensee in respect\nof the imposition of a proposed fee or charge;\n\n(d)\n\nthe Central Bank to issue directives;\n\n(e)\n\nthe Central Bank to make regulations relating to the imposition of fees\nand charges; and\n\n(f)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 43 of Cap. 324A\n\nRepeal and replacement of section 95 of Cap. 324A\n\nRepeal and replacement of section 114A of Cap. 324A\n\nAmendment of section 115 of Cap. 324A\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Financial Institutions Act, Cap. 324A.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n2024.\n\nThis Act may be cited as the Financial Institutions (Amendment) Act,\n\n\f4\n\nAmendment of section 43 of Cap. 324A\n\n2.\nThe Financial Institutions Act, Cap. 324A in this Act referred to as\nthe  principal  Act  is  amended  by  deleting  section  43  and  substituting  the\nfollowing:\n\n“Financial statements\n\n43.(1)\nA licensee, in relation to its operations, shall on a solo basis\nand also on a consolidated basis if applicable, submit to the Central\nBank in the prescribed form,\n\n(a)\n\n(b)\n\nnot later than 21 days after the end of each month, or such\nother period as the Central Bank may in any particular case\ndetermine,  a  monthly  statement  showing  the  assets  and\nliabilities  of  the  licensee  accompanied  by  a  statement\nshowing the amounts of all outstanding unsecured advances\nor unsecured credit; and\n\nnot later than 21 days after the end of each quarter ending on\n31st  March,  30th  June,  30th  September  and  31st  December\nrespectively, or such other period as the Central Bank may in\nany particular case determine, returns containing statements\nof\n\n(i)\n\nassets and liabilities;\n\n(ii)\n\nloans and advances; and\n\n(iii)\n\nearnings and expenses.\n\nThe Central Bank may require a licensee to submit within such\n\n(2)\nperiod and in such manner as the Central Bank determines,\n\n(a)\n\nany financial data required by the Central Bank; and\n\n\f5\n\n(b)\n\nsuch returns in addition to those specified in subsection (1)\nas the Central Bank requires.\n\nThe  Central  Bank  may  require  a  licensee  to  submit  such\n\n(3)\ninformation that it considers necessary\n\n(a)\n\nto  facilitate  an  understanding  of  any  statement  or  return\nfurnished by that licensee under subsection (1) or (2); and\n\n(b)\n\nin  respect  of  any  holding  company,  financial  holding\ncompany, subsidiary or affiliate of the licensee,\nand the information shall be submitted within such time and in such\nmanner as the Central Bank requires.\n\nThe  Central  Bank  may  require  a  licensee  to  show  separately,\n\n(4)\namounts of unsecured credit.\n\n(5)\n\nA licensee shall disclose all large exposures to the Central Bank.\n\nThe assets that a Barbados bank which is a licensee holds for its\n(6)\nown  account  shall  be  shown  separately;  and  its  equity  interests  in\nsubsidiaries shall be separately disclosed.\n\nThe Central Bank may publish in the Official Gazette and in a\n(7)\ndaily  newspaper  published  and  circulating  in  Barbados  information\nsubmitted on the quarterly returns of each licensee under this section\nbut no information in respect of the affairs of a particular customer of\na licensee shall be so published.”.\n\nRepeal and replacement of section 95 of Cap. 324A\n\n3.\nthe following:\n\nThe principal Act is amended by deleting section 95 and substituting\n\n\f6\n\n“Fees and charges\n\n95.(1)\nWhere,  in  the  opinion  of  the  Central  Bank,  a  licensee  is\nimposing a fee or charge that is unreasonable, the Central Bank shall\nrequire the licensee to disclose the basis for the fee or charge.\n\nNotwithstanding  subsection  (1),  a  licensee  under  Part  II  that\n(2)\nintends to impose a fee or charge or vary an existing fee or charge shall\nsubmit written notice to the Central Bank of its intention 60 days before\nthe proposed date that the licensee intends to impose or vary the fee or\ncharge.\n\nWhere the Central Bank receives written notice in accordance\n(3)\nwith  subsection  (2),  it  shall,  within  30  days  of  receiving  the  notice,\ninform the licensee in writing whether it objects to the fee or charge to\nbe imposed or varied and shall issue a directive to the licensee stating\nany action that the licensee is required to take, if any, in relation to the\nproposed fee.”.\n\nRepeal and replacement of section 114A of Cap. 324A\n\n4.\nsubstituted:\n\nSection  114A  of  the  principal  Act  is  deleted  and  the  following\n\n“Power to issue guidelines and directives\n\n114A.\nmatter that it considers necessary\n\nThe Central Bank may issue guidelines and directives on any\n\n(a)\n\n(b)\n\n(c)\n\nto ensure the safety and soundness of licensees;\n\nrespecting the operation of common trust funds;\n\nrespecting the information to be recorded in relation to trust\naccounts of a licensee;\n\n\f7\n\n(d)\n\napproving the manner of using, investing or managing any\nproperty or funds outside or within Barbados by a licensee;\n\n(e)\n\nin respect of loans and other assets; and\n\n(f)\n\ngenerally to provide for the conduct of licensees.”.\n\nAmendment of section 115 of Cap. 324A\n\n5.\n(j) and substituting the following:\n\nSection 115 of the principal Act is amended by deleting paragraph\n\n“(j)\n\nin respect of the imposition of fees and charges; and\n\n(k)\n\ngenerally for giving effect to the provisions of this Act.”.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}