{
  "bill_id": 756,
  "slug": "resolution-re-vesting-of-lands-at-castle-grant-plantation-st-joseph",
  "title": "Resolution Re: Vesting of lands at Castle Grant Plantation, St Joseph",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/2faf82f14b34417329dfee982429ec89.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2024-02-13",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "PARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the  Crown\n\nLands  (Vesting  and  Disposal)  Act,  Cap.  225  approve  the  vesting  in  National  Housing\n\nCorporation  of  two  parcels  of  land  situate  at  Castle  Grant  Plantation  in  the  parish  of\n\nSaint  Joseph  in  this  Island,  more  particularly  described  in  the  Schedules  hereto\n\nfor a public purpose, namely for housing development.\n\nAPPROVED by the House of Assembly this          day of\n\nTwo Thousand and Twenty-Four.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this\n\nday  of\n\nTwo Thousand and Twenty-Four.\n\n,\n\n,\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL THAT  that  land  situate  at  Castle  Grant  Plantation  in  the  parish  of  Saint\n\nJoseph in this Island and being the Lot 01A containing by admeasurement 0.747 hectares or\n\nthereabouts (inclusive of 0.031 hectares in road) abutting and bounding on the lots numbered\n\n108,  31,  29,  27,  25,  23,  21,  19,  17  and  15  now  or  formerly  of  Branchbury  Tenantry\n\non  lands  now  or  formerly  of  Retreat  Plantation  (Lot  LS01)  on  a  cart  road  which  leads  to\n\nSt. Ann’s Church in one direction and on a road which leads to Highway 3A in the other direction\n\nor  however  else  the  same  may  abut  and  bound  as  shown  and  delineated  on  a  plan  certiﬁ ed\n\non the 22nd day of February, 2022 by Gregory StC. Hutchinson, Land Surveyor and recorded\n\nin  the  Lands  and  Surveys  Department  on  the  4th  day  of  March,  2022  as  Plan  No.  328/2022.\n\n\f3\n\nSECOND SCHEDULE\n\nALL THAT land situate at Castle Grant Plantation in the parish of Saint Joseph\n\nin this Island and being the Lot 01C containing by admeasurement 4.142 hectares or thereabouts\n\n(inclusive of 0.025 hectares in road) abutting and bounding on Lot A1 on a buﬀ er zone 5 metres\n\nwide on lands now or formerly of Castle Grant Plantation (Lot 01B) on lands now or formerly of\n\nthe Estate of T. E. Aurelien, deceased on land now or formerly of Lammings Plantation on lands\n\nnow or formerly S & S Investment Ltd. on a public road known as Highway 3A which leads to\n\nBlackmans in one direction and to Airy Hill in the other direction or however else the same may\n\nabut and bound as shown and delineated on a plan certiﬁ ed on the 22nd day of February, 2022 by\n\nGregory StC. Hutchinson, Land Surveyor and recorded in the Lands and Surveys Department\n\non the 4th day of March, 2022 as Plan No. 328/2022.\n\n\f4\n\nADDENDUM\n\n  By Agreement dated 20th August, 2021 between Cordova Enterprises Limited and the\n\nMinister with responsibility for Town and Country Planning the two parcels of land described\n\nin the Schedules hereto were to be conveyed to the State as a planning obligation.\n\n  By Conveyance dated the 29th day of March, 2023 made between Cordova Enterprises\n\nLimited and the State, the two parcels of land described in the Schedules hereto were conveyed\n\nto the State in accordance with the terms and conditions of the Planning Obligations Agreement.\n\n  The Cabinet at its meeting held on the 11th day of May, 2023 considered Note (23) 411/\n\nMHLM 25 and approved the proposal to vest the two parcels of land described in the Schedules\n\nin National Housing Corporation for housing development.\n\n  In accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal)\n\nAct, Cap. 225 the approval of Parliament is now sought for the vesting in National Housing\n\nCorporation of the two parcels of land described in the Schedules hereto for housing development.\n\n"
}