{
  "bill_id": 757,
  "slug": "caribbean-community-movement-of-skilled-nationals-amendment-act-2024",
  "title": "Caribbean Community (Movement of Skilled Nationals) (Amendment) Act, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/489a1531c39e99b14f59f68c4681d3bf.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-03-06",
  "first_reading": "2024-03-11",
  "gazette_date": "2024-02-26",
  "markdown": "2023-09-27\n\nOBJECTS AND REASONS\n\nThis  Bill  would  amend  the  Caribbean  Community  (Movement  of  Skilled\nNationals)  Act,  Cap.  186A  to  make  better  provision  for  agricultural  workers,\ndomestic workers and private security officers.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nAmendment of section 2 of Cap. 186A\n\nAmendment of the First Schedule of Cap. 186A\n\nAmendment of Cap. 186A\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  amend  the  Caribbean  Community  (Movement  of  Skilled\n\nNationals) Act, Cap. 186A.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\nSkilled Nationals) (Amendment) Act, 2024.\n\nThis Act may be cited as the Caribbean Community (Movement of\n\nAmendment of section 2 of Cap. 186A\n\nSection  2(1)  of  the  Caribbean  Community  (Movement  of  Skilled\n2.\nNationals)  Act,  Cap.  186A,  in  this  Act  referred  to  as  the  principal  Act,  is\namended by\n\n(a)\n\n(b)\n\ndeleting  the  definitions  of  “agricultural  worker”,  household\ndomestic” and “security guard”; and\n\ninserting  in  the  appropriate  alphabetical  order  the  following\ndefinitions:\n\n“ “agricultural worker” means a person who engages in\n\n(a)\n\n(b)\n\ncrop farm production; or\n\nlivestock farm production;\n\n“crop  farm  production”  includes  growing  trees  or  crops,  harvesting\n\nfields or trees and gathering fruits or plants;\n\n“domestic work” includes\n\n(a)\n\n(b)\n\nsweeping,  vacuuming,  cleaning,  washing,  polishing  items,\ntaking care of linen, purchasing supplies, preparing food and\nserving  meals  for  a  household  within  a  private  residential\nhome;\n\nthe provision of personal care and assistance to a person in a\nprivate residential household with his daily living activities\nwhere that person is need of such care due to ageing, illness,\ninjury or any other physical condition; and\n\n\f5\n\n(c)\n\nthe provision of care and supervision of a child in a private\nresidential home;\n\n“domestic worker” means a person who is employed to engage to in\n\ndomestic work;\n\n“livestock farm production” includes\n\n(a)\n\n(b)\n\nthe breeding and tending of animals; and\n\naquaculture;\n\n“private security officer” means a person who provides services\n\n(a)\n\n(b)\n\n(c)\n\nfor the protection of persons or property;\n\nto prevent the destruction of property; or\n\nto prevent the theft or unlawful taking of property.”.\n\nAmendment of the First Schedule of Cap. 186A\n\nParagraph 2 of Part B of the First Schedule is amended by deleting\n3.\nthe  words  “household  domestics  and  security  guards”  and  substituting  the\nwords “domestic workers and private security officers”.\n\nAmendment of Cap. 186A\n\n4.\n\nThe principal Act is amended by deleting the words\n\n(a)\n\n(b)\n\n“household  domestic”  wherever  they  appear  and  substituting  the\nwords “domestic worker”; and\n\n“security guard” wherever they appear and substituting the words\n“private security officer”.\n\n\f6\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}