{
  "bill_id": 76,
  "slug": "representation-of-the-people-amendment-bill-2015",
  "title": "Representation of the People (Amendment) Bill, 2015",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/1352205dba1c920585faa9b7da0da8db.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2015-02-03",
  "first_reading": "2015-02-10",
  "second_reading": null,
  "gazette_date": "2015-02-23",
  "passed_date": null,
  "markdown": "Explanatory Memo at page 14\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Representation of the People Act, Cap. 12 to\n\n(a)\n\n(b)\n\nmake  better  provision  for  the  duties  and  functions  performed  by\nelection officials;\n\nmake  better  provision  for  the  preparation  and  maintenance  of  the\nregister of electors;\n\n(c)\n\nrepeal section 25; and\n\n(d)\n\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nAmendment of Section 2 of Cap. 12\n\nAmendment of section 6 of Cap. 12\n\nAmendment of section 7 of Cap. 12\n\nAmendment of section 8 of Cap. 12\n\nAmendment of section 9 of Cap. 12\n\nAmendment of section 10 of Cap. 12\n\nAmendment of section 12 of Cap. 12\n\nInsertion of section 12A of Cap. 12\n\n10.\n\nAmendment of section 13 of Cap. 12\n\n11.\n\nAmendment of section 18 of Cap. 12\n\n12.\n\nRepeal of section 25 of Cap. 12\n\n13.\n\nAmendment of section 26 of Cap. 12\n\n14.\n\nAmendment of section 68 of Cap. 12\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Representation of the People Act.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n(Amendment) Act, 2015.\n\nThis  Act  may  be  cited  as  the  Representation  of  the  People\n\n\f4\n\nAmendment of Section 2 of Cap. 12\n\n2.\nto as the principal Act, is amended by\n\nSection 2 of the Representation of the People Act, in this Act referred\n\n(a)\n\ndeleting  the  definitions  of  “Chief  Registering  Officer”  and\n“registering  officer”  and  substituting  the  following  definitions  in\nalphabetical order:\n\n“  “Chief  Registering  Officer”  means  the  person  designated  as  Chief\n\nRegistering Officer under section 12;\n\n“registering officer” means a person appointed as a registering officer\n\nunder section 12 or a person acting in that office;”; and\n\n(b)\n\ninserting the following definitions in alphabetical order:\n\n“  “enumerator”  means  a  person  appointed  as  an  enumerator  under\n\nsection 12 or a person acting in that office;\n\n“identification  card”  means  an  identification  card  issued  under  the\n\nNational Registration Act, 2015 (Act 2015 - );”.\n\nAmendment of section 6 of Cap. 12\n\n3.\n\nSection 6 of the principal Act is amended by\n\n(a)\n\ndeleting subsection(4) and substituting the following:\n\n“(4)\n\nNo person may\n\n(a)\n\n(b)\n\nat  an  election,  vote  as  an  elector  in  more  than  one\nconstituency;\n\nat an election, vote as an elector more than once in the same\nconstituency;\n\n\f5\n\n(c)\n\nvote as an elector, without first producing his identification\ncard to verify his identity to the satisfaction of the presiding\nofficer  unless  he  may  to  the  satisfaction  of  the  presiding\nofficer prove\n\n(i)\n\nthat the identification card issued to him has been lost,\nstolen, defaced, damaged, tampered with or destroyed;\nand\n\n(ii)\n\nhis  identity  by  producing  an  identification  document\nwhich\n\n(A)\n\nbears his name and a photograph of him; and\n\n(B)\n\nstates his national registration number; or\n\n(d)\n\nvote as an elector where his name is on the register of electors\nfor  a  constituency  but  he  cannot  produce  an  identification\ncard  or  an  identification  document,  unless  the  presiding\nofficer reviews the electoral registration record or the register\nof  electors  and  is  satisfied  by  the  information  and  the\nphotograph therein that the person is the person named on the\nregister of electors.”; and\n\n(b)\n\ninserting immediately after subsection (4) the following:\n\n“(5)\n\nFor the purposes of this section,\n\n“identification document” means a valid driving licence issued under\n\nthe Road Traffic Act, Cap. 295 or a valid passport.”.\n\nAmendment of section 7 of Cap. 12\n\n4.\nand substituting the following:\n\nSection 7 of the principal Act is amended by deleting subsection (1)\n\n\f6\n\n“7.(1)\nSubject to section 8, and any other enactment imposing any\ndisqualification for registration as an elector, a person is qualified to be\nregistered as an elector for a constituency if, on the qualifying date, he\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nis a citizen of Barbados;\n\nis a Commonwealth citizen (other than a citizen of Barbados)\nwho has resided in Barbados for a period of at least three years\nimmediately before the qualifying date;\n\nis 18 years of age or over;\n\nis registered under the National Registration Act, 2015 (Act\n2015 - ); and\n\nhas  resided  in  the  constituency  for  a  period  of  at  least  3\nmonths  before  that  qualifying  date,  or,  but  for  the\ncircumstances entitling him to vote at a Mission, would have\nbeen  resident  at  the  address  at  which  he  was  ordinarily\nresident  in  that  constituency  immediately  before  leaving\nBarbados.”.\n\nAmendment of section 8 of Cap. 12\n\n5.\n\nSection 8 of the principal Act is amended by\n\n(a)\n\ndeleting paragraph (d) and substituting the following:\n\n“(d)\n\nis not registered under the National Registration Act, 2015\n(Act 2015 - )or is disqualified for registration as an elector\nunder any other enactment; or ”; and\n\n(b)\n\ninserting the following new paragraph after paragraph (d):\n\n“(e)\n\nhas failed to be registered in an enumeration conducted under\nsection 12 of this Act.”.\n\n\f7\n\nAmendment of section 9 of Cap. 12\n\n6.\n\nSection 9 of the principal Act is amended by:\n\n(a)\n\ndeleting subsection (1) and substituting the following:\n\nA person registered pursuant to this Act shall remain registered\n\n“(1)\nunless and until his name is deleted from the register because\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nhe has died;\n\nan objection to his registration has been allowed;\n\nthough not a foreign service elector, he has been absent from\nBarbados for a continuous period of more than 5 years; or\n\nhe has become disqualified for registration as an elector under\nthis Act or any other enactment imposing disqualifications\nfor registration as an elector.”; and\n\n(b)\n\ndeleting subsection (2) and substituting the following:\n\n“(2)\nFor  the  purposes  of  deleting  from  the  register  of  electors,  the\nnames of persons referred to in subsection (1), the Commission shall\nfirst publish once in the Official Gazette a list of the names and a notice\nof the intention to delete those names from the register of electors, and\nthen publish twice in at least two newspapers in circulation in Barbados,\nat intervals of not less than 7 days apart, a list of the names and a notice\nof its intention to delete those names from the register of electors.”.\n\nAmendment of section 10 of Cap. 12\n\n7.\nthe following:\n\nThe principal Act is amended by deleting section 10 and substituting\n\n\f8\n\n“Duty of an Occupier\n\n10.(1)\nEvery  occupier  of  a  house  shall,  when  interviewed  by  a\nregistering  officer  or  enumerator,  furnish  the  registering  officer  or\nenumerator with the names of every person living in that house who,\nto the best of his knowledge, is qualified to be registered as an elector\nfor that constituency.\n\nWhere a building is let in separate apartments, flats or lodgings,\n(2)\nthe person receiving the rent payable by the tenants or lodgers, whether\non his own account or as the agent of another person, shall, if requested\nso to do by or on behalf of the registering officer or enumerator, furnish\nthe registering officer or enumerator with the name of every tenant or\nlodger by whom the rent of an apartment, flat or lodging is payable.\n\n(3)\n\nFor the purposes of this section,\n\n“house” means a dwelling house, and includes any building or part of\n\na building occupied as a separate dwelling;\n\n“occupier” in relation to any building let in separate apartments, flats\nor lodgings, means the tenant, lodger or other person by whom the\nrent for such apartment, flat or lodging is payable.”.\n\nAmendment of section 12 of Cap. 12\n\n8.\nthe following:\n\nThe principal Act is amended by deleting section 12 and substituting\n\n“Registering Officers\n\n12.(1)\nOfficer for the purposes of this Act.\n\nThe Chief Electoral Officer shall be the Chief Registering\n\n\f9\n\nFor the purposes of the registration of electors and the conduct\n\n(2)\nof any enumeration there shall be\n\n(a)\n\n(b)\n\nsubject  to  this  section,  a  registering  officer  for  each\nconstituency who shall be appointed by the Commission after\nconsultation with the Chief Registering Officer; and\n\nas many enumerators as may be deemed necessary and the\nenumerators  shall  be  appointed  by  the  Commission  after\nconsultation with the Chief Registering Officer.\n\nNotwithstanding  paragraph  2(a),  where  the  circumstances  so\n(3)\nrequire, a registering officer may act for more than one constituency.\n\nThe  Chief  Registering  Officer  shall  supervise  and  direct  a\n(4)\nregistering officer or an enumerator in the performance of the functions\nunder  this  Act,  and  the  registering  officer  or  the  enumerator  shall\ncomply  with  any  general  or  specific  directions  which  the  Chief\nRegistering Officer may give.\n\nEach registering officer and enumerator shall, as long as he acts\n(5)\nin that capacity, receive such remuneration as may be prescribed from\nmoneys voted for the purpose by Parliament.”.\n\nInsertion of section 12A of Cap. 12\n\n9.\nimmediately after section 12:\n\nThe  principal  Act  is  amended  by  inserting  the  following  section\n\n“Powers of entry\n\n12A.\nThe Chief Registering Officer or any person acting on his\nbehalf may upon the production of his authorisation, enter any dwelling\nhouse, institution of learning, or any premises where persons reside or\nare employed and in either case make such enquires and collect any\n\n\f10\n\ninformation which may be necessary for the performance of any duties\nor functions under the Act or for any purpose connected with\n\n(a)\n\n(b)\n\n(c)\n\nthe registering of an elector;\n\nassessing the number of eligible voters in any premises;\n\nassessing\nconstituency; and\n\nthe  boundaries  or  boundary\n\nlines\n\nin  any\n\n(d)\n\ngiving effect to the purposes of this Act.”.\n\nAmendment of section 13 of Cap. 12\n\n10.\nthe following:\n\nThe principal Act is amended by deleting section 13 and substituting\n\n“Registers of electors\n\n13.(1)\nThe Commission shall cause to be prepared and shall publish\nno later than the 31st of January in every year a register of electors and\na register of foreign service electors which shall include persons who\nare\n\n(a)\n\nrecorded  in  the  National  Register,  established  under  the\nNational Registration Act, 2015 (Act 2015 - ); and\n\n(b)\n\nregistered as an elector under this Act.\n\nThe  register  of  electors  referred  to  in  subsection  (1)  shall,  in\n\n(2)\nrespect of each elector contain the following particulars:\n\n(a)\n\n(b)\n\n(c)\n\nthe full name of the elector;\n\nthe national registration number of the elector;\n\nthe gender of the elector;\n\n(d)\n\nthe address of the elector;\n\n\f11\n\n(e)\n\nthe constituency in which the elector resides; and\n\n(f)\n\nthe polling district in which the elector resides.\n\n(3)\nThe register of electors in respect of a constituency shall contain\nthe  particulars  of  an  elector  who  is  ordinarily  resident  in  that\nconstituency and shall include the following persons:\n\n(a)\n\n(b)\n\n(c)\n\na person who was registered in the register of electors which\nwas last published for that constituency unless that elector\nshould be removed in accordance with subsection (4) or any\nother provision of this Act;\n\na person who was registered in the revised register of electors\nor the register of electors published by virtue of section 18,\nand published since the date on which the register referred to\nin paragraph (a) was published; and\n\nany person registered under the National Registration Act,\n2015 (Act 2015 - ) who qualifies as an elector, but who was\nnot  registered  as  an  elector,  and  included  in  any  of  the\nregisters referred to in paragraphs (a) and (b).\n\nA  Register  referred  to  in  subsection  (1),  in  respect  of  a\n(4)\nconstituency,  shall  not  contain  the  name  of  any  person  who,  in  the\nopinion  of  the  Commission,  appears  since  the  publication  of  the\nregisters referred to in subsection (1)\n\n(a)\n\n(b)\n\n(c)\n\nto have died;\n\nto have left Barbados on or before the 31st December of the\nimmediately  preceding  year  to  be  no  longer  ordinarily\nresident in that constituency, not being a citizen of Barbados;\n\nto have been absent from Barbados for a continuous period\nexceeding 5 years, being a citizen of Barbados and not being\na foreign service elector; or\n\n(d)\n\nto have become ordinarily resident in another constituency.\n\n\f12\n\n(5)\nThe  Commission  in  the  exercise  of  the  functions  under  this\nsection and section 14 shall give directions to the Chief Registering\nOfficer  and  the  Chief  Registering  Officer  shall  comply  with  those\ndirections. ”.\n\nAmendment of section 18 of Cap. 12\n\n11.\nand substituting the following:\n\nSection 18 of the principal Act is amended by deleting subsection(4)\n\nThe register for elections must contain the constituency, polling\n“(4)\ndistrict, full name, national registration number, gender, and address of\nevery person qualified under this Act to be registered as an elector or a\nforeign service elector for the constituency.”\n\nRepeal of section 25 of Cap. 12\n\n12.\n\nSection 25 of the principal Act is repealed.\n\nAmendment of section 26 of Cap. 12\n\n13.\n(2).\n\nSection 26 of the principal Act is amended by deleting subsection\n\nAmendment of section 68 of Cap. 12\n\n14.\ndeleting paragraph (e).\n\nSection  68  of  the  principal  Act  is  amended  in  subsection  (1)  by\n\n\f13\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2015.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2015.\n\nPresident\n\n\f14\n\nREPRESENTATION OF THE PEOPLE (AMENDMENT) ACT, 2015\n\nEXPLANATORY MEMORANDUM\n\nThe Representation of the People (Amendment) Act, 2015 would amend the\nRepresentation of the People Act, Cap. 12 to make better provision for the duties\nand functions performed by election officials in addition to the preparation and\nmaintenance of the register of electors.\n\nClause 1:\n\nprovides for the short title of the Act.\n\nClause 2:\n\nClause 3:\n\nprovides for the amendment of section 2 of the Representation\nof the People Act, Cap. 12 to repeal, modify and replace certain\ndefinitions  used  in  that  Act  and  to  insert  the  definitions  of\ncertain new words into that Act.\n\nprovides for the amendment of section 6 of the Representation\nof  the  People  Act,  Cap.  12  by  repealing  and  replacing\nsubsection (4) to stipulate that at an election a voter may not\nvote more than once in the same constituency nor in more than\none  constituency  and  that  the  voter  must  produce  his\nidentification card or if lost or destroyed another identification\ndocument.  Where  the  voter  fails  to  produce  a  form  of\nidentification,  he  may  not  be  allowed  to  vote  unless  the\npresiding  officer,  after  reviewing  the  electoral  registration\nrecord or the register of electors is satisfied by the information\nand photograph therein that the voter is the person named on\nthe  register  of  electors.  Section  6  is  also  amended  by  the\ninsertion  of  a  new  subsection  -  subsection  (5)  is  added  to\ndefine identification document, this phrase is defined to mean\na valid driving licence or valid passport.\n\nClause 4:\n\nprovides for the amendment of section 7 of the Representation\nof  the  People  Act,  Cap.  12  by  repealing  an  replacing\n\ni\n\n\fREPRESENTATION OF THE PEOPLE\n(AMENDMENT) ACT, 2015\n\nsubsection (1) to set out the qualifications for registration as\nan  elector.  These  include  citizenship  of  Barbados  or\ncommonwealth citizenship if residing in Barbados for a period\nof  at  least  3  years  immediately  before  the  qualifying  date,\nbeing 18 years of age or older, registration under the National\nRegistration Act, 2015 (Act 2015- ) and residence within the\nconstituency  for  a  period  of  at  least  3  months  before  the\nqualifying date, or, but for the circumstances entitling him to\nvote at a Mission, would have been resident at the address at\nwhich  he  was  ordinarily  resident  in  that  constituency\nimmediately before leaving Barbados.\n\nprovides for the amendment of section 8 of the Representation\nof  the  People  Act,  Cap.  12  by  repealing  and  replacing\nparagraph  (d)  to  provide  that  a  person  is  disqualified  for\nregistration  as  an  elector  if  he  is  not  registered  under  the\nNational  Registration  Act,  2015  (Act  2015  -  )  or  if  he  is\ndisqualified under any other enactment. Paragraph (e) is added\nto  include  that  a  person  who  failed  to  be  registered  in  an\nenumeration\nthe\nRepresentation of the People Act, Cap. 12 is also disqualified\nfor registration as an elector.\n\nconducted  under\n\nsection  12  of\n\nprovides for the amendment of section 9 of the Representation\nof  the  People  Act,  Cap.  12  by  repealing  and  replacing\nsubsection  (1)  to  provide  for  a  person  who  is  registered\npursuant to that Act to remain registered unless and until his\nname  is  removed  from  the  register  because  of  named\ncircumstances.  Subsection  (2)  is  repealed  and  replaced  to\nrequire the Commission to publish in the Official Gazette and\nin the daily newspapers the names of persons registered in the\nregister of electors prior to their removal.\n\nii\n\nClause  5:\n\nClause  6:\n\n\fClause 7:\n\nClause 8:\n\nClause 9:\n\nClause 10:\n\nREPRESENTATION OF THE PEOPLE\n(AMENDMENT) ACT, 2015\n\nrepeals and replaces section 10 of the Representation of the\nPeople  Act,  Cap.  12  to  require  the  occupier  of  a  house  or\nlodging to furnish a registering officer or enumerator with the\nnames of every person or tenant or lodger living in the house\nor lodging who is qualified to be registered as an elector for\nthat constituency.\n\nrepeals and replaces section 12 of the Representation of the\nPeople  Act,  Cap.  12  to  stipulate  that  the  Chief  Electoral\nOfficer is the Chief Registering Officer who shall supervise\nand  direct  a  registering  officer  or  enumerator  in  the\nperformance of his functions. It also provides for a registering\nofficer  for  each  constituency,  notwithstanding\nthat  a\nregistering officer may act for more than one constituency;\nand as many enumerators as may be deemed necessary. These\nposts must be filled by the Commission after consultation with\nthe  Chief  Registering  Officer  and  registering  officer  or\nenumerator  will  receive  remuneration  as  prescribed  from\nmoneys voted for the purpose by Parliament..\n\ninserts a new section after section 12 of the Representation of\nthe People Act, Cap. 12 to allow the Chief Registering Officer\nor any person acting on his behalf upon the production of his\nauthorisation,  power  to  enter  any  premises  where  people\nreside  or  work  to  make  enquiries  or  collect  information\nnecessary  for  the  performance  of  any  duties  or  functions\ndesignated under that Act.\n\nthe  amendment  of  section  13  of\n\nthe\nprovides  for\nRepresentation  of  the  People  Act,  Cap.  12  to  require  the\nCommission to publish every year a register of electors and\nforeign service electors entitled to vote in an election. It also\nlists the required content of the register of electors in respect\nof  each  elector.  It  further  specifies  the  qualifications  to  be\n\niii\n\n\fREPRESENTATION OF THE PEOPLE\n(AMENDMENT) ACT, 2015\n\nsatisfied in order to be included in the register of electors and\nalso provides the circumstances under which the Commission\nmay have a name removed from the register of electors. It also\nprovides for the Commission in the exercise of its functions\nunder section 13 or 14 of the Representation of the People\nAct, Cap. 12 to give directions to the Chief Registering Officer\nwho shall comply with those directions.\n\nthe  amendment  of  section  18  of\n\nprovides  for\nthe\nRepresentation of the People Act, Cap. 12 by repealing and\nreplacing subsection (4) to stipulate the contents of the register\nfor elections as it relates to every person qualified under that\nAct to be registered as an elector or a foreign service elector\nfor the constituency.\n\nrepeals  section  25  of  the  Representation  of  the  People  Act,\nCap. 12.\n\nthe  amendment  of  section  26  of\n\nthe\nprovides  for\nRepresentation of the People Act, Cap. 12 by repealing section\n(2).\n\nthe  amendment  of  section  68  of\n\nthe\nprovides  for\nRepresentation  of  the  People  Act,  Cap.  12  by  repealing\nparagraph (e) of subsection (1).\n\nClause 11:\n\nClause 12:\n\nClause 13:\n\nClause 14:\n\niv\n\n"
}