{
  "bill_id": 770,
  "slug": "criminal-procedure-amendment-bill-2024",
  "title": "Criminal Procedure (Amendment) Bill 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/11aaee16c4797246e040b04b03bb755e.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-06-12",
  "first_reading": "2024-04-23",
  "gazette_date": "2024-04-29",
  "markdown": "2024-03-19\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Criminal Procedure Act, Cap. 127 in order to enable\n\nan accused person to elect to be tried by a judge sitting alone.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nRepeal and replacement of section 3 of Cap. 127\n\nAmendment of section 7 of Cap. 127\n\nInsertion of sections 7B, 7C, 7D and 7E into Cap. 127\n\nRepeal and replacement of section 8 of Cap. 127\n\nAmendment of section 9 of Cap. 127\n\nRepeal and replacement of section 9A of Cap. 127\n\nAmendment of section 10 of Cap. 127\n\nInsertion of Schedule into Cap. 127\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nAmendment to enactments\n\nFIRST SCHEDULE\n\nForm A\n\nSECOND SCHEDULE\n\nConsequential Amendments\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Criminal Procedure Act, Cap. 127 in order to enable\n\nan accused person to opt to elect to be tried by a judge sitting alone.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n2024.\n\nThis Act may be cited as the Criminal Procedure (Amendment) Act,\n\nRepeal and replacement of section 3 of Cap. 127\n\nThe Criminal Procedure Act, Cap. 127 in this Act referred to as the\n2.\nprincipal Act, is amended by deleting section 3 and substituting the following:\n\n“Mode of trial\n\n3.\nEvery  person  against  whom  a  bill  of  indictment  has  been\npreferred shall, subject to the provisions of this Act, be tried by a Judge\nsitting  with  a  jury  unless  he  elects  to  be  tried  by  a  Judge  sitting\nalone.”.\n\nAmendment of section 7 of Cap. 127\n\n3.\nand substituting the following:\n\nSection 7 of the principal Act is amended by deleting subsection (1)\n\n“(1)\nThe judge shall, if a person arraigned on indictment pleads “not\nguilty”, inform the person that he may elect to be tried by a Judge sitting\nalone or a Judge sitting with a jury.\n\n(1A)\nWhere  the  person  referred  to  in  subsection  (1)  upon  being\narraigned, elects to be tried by a Judge sitting alone, the court shall only\nmake an order that the person be tried by a judge sitting alone if it is\nsatisfied that the person\n\n(a)\n\nhas sought and received legal advice from an attorney-at-law\nin relation to a trial by a Judge sitting alone; and\n\n\f5\n\n(b)\n\nhas filed with the Registrar of the Supreme Court a certificate\nin the form set out as Form A in the First Schedule.\n\n(1B)\nWhere  a  person  is  not  represented  by  an  attorney-at-law  and\nelects to be tried by a Judge sitting alone, the Court shall make an order\nthat the person be tried by a Judge sitting alone if it is satisfied that the\nperson\n\n(a)\n\nis competent and has waived his right to consult an attorney-\nat-law for legal advice in relation to a trial by a Judge sitting\nalone; and\n\n(b)\n\nhas filed with the Registrar of the Supreme Court a certificate\nin the form set out as Form B in the First Schedule.\n\nThe Court shall not make an order for a trial by a Judge sitting\n\n(1C)\nalone unless it is satisfied that\n\n(a)\n\nin  the  case  of  a  joint  trial,  all  other  accused  persons  have\nelected to be tried by a Judge sitting alone and each accused\nperson has filed a certificate in the form set out as Form A or\nB in the First Schedule, as the case may be, in accordance\nwith subsection (1A) or (1B); and\n\n(b)\n\nwhere 2 or more charges are to be tried together, the accused\nperson  has  elected  to  be  tried  by  a  Judge  sitting  alone  in\nrespect of all the charges.\n\nSubject to subsection (1E), where the first hearing after the filing\n(1D)\nof  an  indictment  against  an  accused  person  took  place  before  the\ncommencement of this section\n\n(a)\n\nthe Registrar of the Supreme Court shall cause to be served\non the accused person, a notice informing him that he may,\nat least 60 days before the date fixed for his trial, apply to the\nCourt for a trial by a Judge sitting alone; and\n\n\f6\n\n(b)\n\nthe person may apply to the Court for a trial by a Judge sitting\nalone.\n\n(1E)\nThe Court shall not proceed to try the person by a Judge sitting\nalone  unless  it  is  satisfied  that  the  accused  person  understands  the\ndifference between a trial by a Judge sitting alone and a trial by a Judge\nsitting with a jury.\n\n(1F)\n\nThe Court shall not proceed to trial by a Judge sitting alone\n\n(a)\n\n(b)\n\nif there are 2 or more accused, unless all accused have elected\nto be tried by a Judge sitting alone; and\n\nif there are 2 or more charges in the indictment unless the\naccused  has  elected  to  be  tried  by  a  Judge  sitting  alone  in\nrespect of all charges.\n\nAn accused who has elected for trial by a Judge sitting alone may\n(1G)\nwithdraw his election before his trial begins and elect to be tried by a\nJudge sitting with a jury.”.\n\nInsertion of sections 7B, 7C, 7D and 7E into Cap. 127\n\n4.\n7A, the following new sections:\n\nThe principal Act is amended by inserting immediately after section\n\n“Jurisdiction of the Judge\n\n7B.\n\nIn a trial by a Judge sitting alone, the Judge shall have\n\n(a)\n\n(b)\n\nthe power, authority and jurisdiction which he would have\nhad in a trial by jury; and\n\nthe power to determine any question and to make any finding\nwhich would have been required to be determined or made\nby a jury.\n\n\f7\n\nReferences to jury in other enactments\n\n7C.(1)\nA reference in this Act or in any other enactment to a jury,\nthe verdict of a jury or the finding of a jury shall be read, in relation to\na trial by a Judge sitting alone, as a reference to the Judge, the verdict\nof the Judge or the finding of the Judge, as the case may be.\n\nFor the purposes of a trial by a Judge sitting alone, the provisions\n(2)\nof this Act or any other enactment, insofar as they are predicated on a\ntrial by a Judge sitting with a jury, shall be read and construed with such\nmodifications,  adaptations,  qualifications  and  exceptions  as  may  be\nnecessary to bring them into conformity with a trial by a Judge sitting\nalone.\n\nJudge to give reasons for decision\n\nWhen the case on both sides is closed in a trial by a Judge\n7D.(1)\nsitting alone, the Judge shall, as soon as reasonably practicable and in\nany event before the expiration of 14 days, deliver his verdict and, in\nthe case of a conviction, he shall give a written judgment setting out\n\n(a)\n\n(b)\n\nthe principles of law applied by the Judge; and\n\nthe findings of fact on which the Judge relied.\n\nIf any other law requires a warning to be given to a jury in any\n(2)\nsuch case, the Judge sitting alone shall take the warning into account\nin dealing with the case.\n\nSubject to subsection (4), where an accused person is acquitted\n(3)\nin a trial by a Judge sitting alone, the Judge may give reasons for his\nverdict.\n\nWhere  the  prosecution  requests  reasons  for  an  acquittal,  the\n\n(4)\nJudge shall give reasons within 14 days of that request.\n\n\f8\n\n(5)\nWhere a Judge fails to deliver his judgment or give reasons for\nan acquittal within the period specified in subsection (1) or (4), as the\ncase may be, he shall convene the Court and inform the parties of the\nfurther time required for completion.\n\nRight of accused to elect to be tried by Judge alone\n\nAn  accused  person  against  whom  an  indictment  was\n7E.\npreferred before the commencement of this section may elect to be tried\nby a Judge sitting alone.\n\nPerson indicted for high treason or treason\n\n7F.\nto elect to be tried by a Judge sitting alone. ”.\n\nA person indicted for high treason or treason is not entitled\n\nRepeal and replacement of section 8 of Cap. 127\n\n5.\nsubstituted:\n\nSection  8  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Addressing the jury or judge sitting alone\n\n8.\nUpon every trial on indictment for an offence, whether the\nprisoners or defendants or any of them are defended by an attorney-at-\nlaw or not, each and every such prisoner or defendant, or his or their\nattorney-at-law  respectively,  may,  before  addressing  the  jury  or  the\nJudge,  as  the  case  may  be,  at  his  discretion,  elect  to  examine  such\nwitnesses  as  he  or  they  may  think  fit  and,  when  all  the  evidence  is\nconcluded, to address the jury or the Judge, and the right of reply and\npractice and course of proceedings, save as hereby altered, shall be as\nat present.”.\n\n\f9\n\nAmendment of section 9 of Cap. 127\n\n6.\n\nSection 9 of the principal Act is amended by deleting\n\n(a)\n\nsubsection (1) and substituting the following:\n\n“(1)\nWhere,  upon  the  trial  of  any  indictment  for  any  arrestable\noffence, except murder or manslaughter, the indictment alleges that the\ndefendant  did  wound  any  person  and  the  jury  are,  or  the  judge  is,\nsatisfied that the defendant is guilty of the wounding charged in such\nindictment but not satisfied that the defendant is guilty of the arrestable\noffence charged in such indictment, then and in every such case the jury\nor the Judge may acquit the defendant of such arrestable offence and\nfind him guilty of unlawfully wounding and thereupon such defendant\nshall be liable to be punished in the same manner as if he had been\nconvicted  upon  an  indictment  for  the  offence  of  unlawfully\nwounding.”; and\n\n(b)\n\nsubsection (3) and substituting the following:\n\n“(3)\nWhere, upon the trial of any person charged with any offence, it\nappears to the jury or the Judge, as the case may be, upon the evidence\nthat the defendant did not complete the offence charged but that he was\nguilty only of an attempt to commit the same, such person shall not by\nreason thereof be entitled to be acquitted but the jury or the Judge shall\nbe at liberty to return as the verdict that the defendant is not guilty of\nthe offence charged but is guilty of an attempt to commit the same, and\nthereupon such person shall be liable to be punished in the same manner\nas if he had been convicted upon an indictment for attempting to commit\nthe particular offence charged in the same indictment.”.\n\n\f10\n\nRepeal and replacement of section 9A of Cap. 127\n\n7.\nsubstituting the following:\n\nThe  principal  Act  is  amended  by  deleting  subsection  9A  and\n\n“Special verdict where accused person found guilty, but\ninsane at date of act charged\n\n9A.\nWhere,  in  an  indictment,  any  act  is  charged  against  any\nperson as an offence, and it is given in evidence on the trial of such\nperson for that offence that he was insane, so as not to be responsible\naccording to law for his actions at the time when the act was done, then,\nif it appears to the jury or the Judge, as the case may be, before whom\nsuch person is tried that he did the act charged, but was insane when he\ndid the act, the jury or the Judge, shall return a special verdict to the\neffect that the accused person is not guilty of the act charged against\nhim, by reason of insanity.”.\n\nAmendment of section 10 of Cap. 127\n\n8.\nafter subsection (2) the following:\n\nSection 10 of the principal Act is amended by inserting immediately\n\nSubsection  (1)  does  not  apply  to  a  trial  by  a  Judge  sitting\n\n“(3)\nalone.”.\n\nInsertion of Schedule into Cap. 127\n\n9.\nprincipal Act, the Schedule as set out in the First Schedule to this Act.\n\nThe principal Act is amended by inserting as the Schedule to the\n\n\f11\n\nAmendment to enactments\n\n10.\namended in the manner set out opposite thereto in Column 2.\n\nThe  enactments  set  out  in  Column  1  of  the  Second  Schedule  are\n\n\f12\n\nL.R.O. 1998FIRST SCHEDULE(Section 9)\"SCHEDULE(Section 7(1A) and (1B))FORM ANo.IN THE SUPREME COURT OF JUDICATUREHIGH COURT(Criminal Division)BETWEEN:The StatevA.BCERTIFICATE OF WAIVER OF LEGAL ADVICE ON ELECTING FOR A TRIAL BY JUDGE SITTING ALONEI, , conﬁ rm that I have sought and received advice from the   undersigned Attorney-at-law on electing to be tried by a Judge sitting alone. The undersigned Attorney-at-law has advised me of my rights, of possible defences, of the penalties and of the consequences and the implications of electing to be tried by a Judge sitting alone. I have had suﬃ  cient time to confer with the undersigned Attorney-at-law concerning this mode of trial.  (Name of Accused Person)\f13\n\nL.R.O. 1998I understand the implications of electing to be tried by a Judge sitting alone and agree to this mode of trial without reservation. No promise, inducement, threat, coercion or force of any kind was employed to secure my election of this mode of trial. I voluntarily and of my free will agree to it.Dated thisday of, 20    ...................  Name of Accused PersonName of Attorney-at-LawFirst Schedule - (Cont'd)Signature of Accused PersonSignature of Attorney-at-Law\f14\n\nL.R.O. 1998FORM BNo.IN THE SUPREME COURT OF JUDICATUREHIGH COURT(Criminal Division)BETWEEN:The StatevA.BCERTIFICATE OF CONFIRMATION OF LEGAL ADVICE ON ELECTING FOR A TRIAL BY JUDGE SITTING ALONEI, , conﬁ rm that I have not sought and received advice from   any Attorney-at-law on the matter of me electing to be tried by a Judge sitting alone. I have waived my right to consult an Attorney-at-law for legal advice in relation to a trial by a Judge sitting alone. I elect to be tried by a Judge sitting alone and agree to it without reservation. No promise, inducement, threat, coercion or force of any kind was employed to secure myelection of this mode of trial. I voluntarily and of my free will agree to it. I am satisﬁ ed withrepresenting myself in this matter.Dated thisday of, 20    .First Schedule - (Concl'd) (Name of Accused Person)Name of Accused PersonSignature of Accused Person\".\f15\n\nL.R.O. 1998SECOND SCHEDULE(Section 6)CONSEQUENTIAL AMENDMENTSColumn 1Enactments1.Criminal Appeal Act,Cap. 113AColumn 2Amendments1.In section 4(1)(a), immediately after the word \"jury\" insertthe words \"or Judge, as the case may be.\".2.In section 5, immediately after the word \"jury\" whereverit appears insert the words \"or Judge\".3.Delete section 7 and substitute the following:\"Conviction on special verdict7.Where a special verdict had been found bya jury or a judge, then on an appeal againstconviction, if the Court considers that a wrongconclusion was arrived at by the court of trialregarding the eﬀ ect of the verdict, the Court may,instead of allowing the appeal, order suchconclusion to be recorded as appears to the Courtto be in law required by the verdict; and the Courtmay pass such sentence in substitution for thesentence passed at the trial as may be authorizedby law.\".4.In section 9(1), immediately after the word \"jury\" insertthe words \"or judge\".5.In section 10(1), immediately after the word \"jury\"appearing in paragraphs (a) and (b) insert the words \"orjudge\".\f16\n\nL.R.O. 1998Column 1Enactments1.Criminal Appeal Act,Cap. 113A - (Concl'd)2.Evidence Act, Cap. 121Column 2Amendments6.In section 10(3), immediately after the word \"jury\" insertthe words \"or judge\".7.Delete section 12(1) and substitute the following:\"(1) Where the question of a person’s ﬁ tness to be tried is to be determined and the jury has returned, or the judge has made a ﬁ nding of unﬁ tness, the person may appeal to the Court against the ﬁ nding.\".8.In section 13(1)(a), immediately after the word \"jury\"insert the words \"or judge\".9.Delete section 15(2)(c) and substitute the following:\"(c) an oﬀ ence charged in an alternative count of the indictment in respect of which the jury were discharged from giving or the judge declined to give a verdict in consequence of convicting him of the oﬀ ence of which he was convicted at the original trial.\".10.In section 17(1), immediately after the word \"jury\" insertthe word \"or judge\".1.Delete section 102(4) and substitute the following:\"(4) Where(a)it is not reasonably open to ﬁ nd theaccused guilty on the basis ofidentiﬁ cation evidence;CONSEQUENTIAL AMENDMENTS - (Cont'd)Second Schedule - (Cont'd)\f17\n\nL.R.O. 1998CONSEQUENTIAL AMENDMENTS - (Cont'd)Column 1Enactments2.Evidence Act, Cap. 121 -(Cont'd)3. Offences Against the Person Act, Cap. 141Column 2Amendments(b)there are no special circumstances of thekind mentioned in subsection (2)(a); and(c)there is no evidence of the kindmentioned in subsection (2)(b)if there is a jury, the Judge shall direct the jury to acquit the accused or if the Judge is sitting alone, he shall acquit the accused.\". 1.Delete section 4(6) and substitute the following:\"(6) Where on a trial for murder(a)evidence is given that the accusedwas, at the time of the alleged oﬀ ence,suﬀ ering from such abnormality of mindas is specified in subsection (1); and(b)the accused is convicted ofmanslaughter,the court shall, if there is a jury, require the jury to declare whether the accused was so convicted by them on the ground of such abnormality of mind, and, if the conviction was on that ground, the court may instead of passing such sentence as is provided by law for that oﬀ ence, order the person so convicted to be detained in custody in such place as the Court appoints, until the State’s pleasure is known and thereupon the State may give such order for the safe custody of the person during the State’s pleasure.\".Second Schedule - (Cont'd)\f18\n\nL.R.O. 1998Column 1Enactments3.Offences Against the Person Act, Cap. 141-(Cont'd)Column 2Amendments2.Delete section 5 and substitute the following:\"Provocation5.Where on a charge of murder there isevidence on which the judge or jury, as the casemay be, can ﬁ nd that the accused was provoked,whether by things done or by things said orby both together, to lose his self-control, thequestion whether the provocation was enough tomake a reasonable man do as he did shall be leftto be determined by the judge or jury; and indetermining that question, the judge or jury shalltake into account everything both done andsaid according to the eﬀ ect which, in his or theiropinion as the case may be, it would have on areasonable man.\".3.Delete section 46 and substitute the following:\"Alternative verdicts46.(1) If on the trial of an indictment for murderor manslaughter the jury are or the Judge is of theopinion that the accused aided, abetted, counselledor procured the suicide of the person in question, thejury or the Judge may ﬁ nd him guilty of that oﬀ ence.(2)Where on the trial of a woman for themurder of her newly-born child the jury are or theJudge is of the opinion that she by any wilful act oromission caused its death, but at the time of the actor omission the balance of her mind was disturbedby reason of her not having fully recovered fromSecond Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f19\n\nL.R.O. 1998Column 1Enactments3.Offences Against the Person Act, Cap. 141-(Concl'd)4.Sexual Offences Act,Cap. 154Column 2Amendmentsthe eﬀ ect of giving birth to the child or by reason of the eﬀ ect of lactation consequent on the birth of the child, the jury or the judge may return a verdict of infanticide.(3)Where any person tried for the murder ofany child is acquitted thereof, it shall be lawful forthe jury or the Judge by whose verdict such personis acquitted to ﬁ nd, where it so appears in evidence,that the child had recently been born and that suchperson did, by some secret disposition of the deadbody of such child, endeavour to conceal the birththereof, and thereupon the court may pass suchsentence as if such person had been convicted uponan indictment for the concealment of the birth.\".1.Delete section 24(1) and substitute the following:\"(1) Where at a trial for an oﬀ ence under this Act the jury, if there is a jury has to consider whether a person believed that another was consenting to sexual intercourse or to any other sexual act, the Judge shall direct the jury that the presence or absence of reasonable grounds for such a belief, is a matter to which the jury is to have regard, in conjunction with any other relevant matter, in considering whether that person so believed.\".2.In subsections (1) and (2) of section 36 immediately afterthe word \"jury\" wherever it appears insert the words \"orJudge\".Second Schedule - (Cont'd)CONSEQUENTIAL AMENDMENTS - (Cont'd)\f20\n\nL.R.O. 1998Column 1Enactments5.Theft Act, Cap. 155Column 2Amendments1.Delete section 22(2) and substitute the following:\"(2) Where on a trial of an indictment for theft, the jury or the Judge is not satisfied that theaccused committed the theft, but it is proved to the satisfaction of the jury or the Judge that the accused committed an oﬀ ence under subsection (1), the jury or the Judge may ﬁ nd the accused guilty of that oﬀ ence.\".2.Delete section 30(2) and substitute the following:\"(2) On the trial of 2 or more persons indicted for jointly handling any stolen property the jury or the Judge may ﬁ nd any of the accused guilty if the jury or the Judge is satisﬁ ed that he handled all or any part of the stolen property, whether or not he did so jointly with the other accused or any of them.\".Second Schedule - (Concl'd)CONSEQUENTIAL AMENDMENTS - (Concl'd)\f21\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}