{
  "bill_id": 771,
  "slug": "storm-water-management-bill-2024",
  "title": "Storm Water Management Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/5c121377fd8d485913f2dc4a1428227e.pdf",
  "current_stage": "House of Assembly",
  "chamber": "",
  "notice_date": "2024-04-12",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "2024-03-27\n\nOBJECTS AND REASONS\n\nThis Bill would provide for\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe management of storm water;\n\nthe  execution  of  works  necessary  to  prevent  flooding  and  control\nflooding and inundations caused by excessive rains and by high tides;\n\nthe mitigation of injury to persons from the movement of storm water;\n\nthe prevention and the mitigation of the effects of the movement of\nstorm water on the health of persons;\n\n(e)\n\nthe reduction of property damage caused by flooding; and\n\n(f)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nAct binds the State\n\nAdministration of Act\n\nDeclaration of flood area\n\nCoastal zone management\n\nFlood works to be executed in accordance with plans\n\nPower to execute flood works\n\nPower to enter and execute flood works\n\n10.\n\nPower to execute urgent flood works\n\n11.\n\nRemoval of buildings, trees, growing crops, etc.\n\n12.\n\nPower to inspect\n\n13.\n\nRequirement for storm drainage\n\n14.\n\nDuty of land owner\n\n15.\n\nDuty to submit plan\n\n\f3\n\n16.\n\nDuty to adhere to Building Code\n\n17.\n\nExecution of works for protection of persons and lands from floods and\ninundations\n\n18.\n\nOwner or occupier of land to pay for flood works\n\n19.\n\nBuilding and crops prohibited in flood area without permission\n\n20.\n\nProhibition on disposal of storm water\n\n21.\n\nDisposal of garbage, debris, etc.\n\n22.\n\nErection of fences, walls, etc.\n\n23.\n\nDisposal of construction materials\n\n24.\n\nRestriction on placement of infrastructure\n\n25.\n\nRestriction on obstructing draining infrastructure\n\n26.\n\nPower to remove obstruction in emergency\n\n27.\n\nPower of the State to take lands\n\n28.\n\nCompensation\n\n29.\n\nMatters disregarded in computing compensation\n\n30.\n\nArbitration\n\n31.\n\nNotices\n\n32.\n\nOffences\n\n\f4\n\n33.\n\nRecovery of costs\n\n34.\n\nRepeal\n\n35.\n\nCommencement\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  provide  for  the  management  of  storm  water,  the  execution  of\nworks necessary to prevent flooding and inundations caused be excessive rains\nand by high tides, mitigation injury to persons from the movement of storm\nwater,  the  prevention  and  the  mitigation  of  the  effects  of  the  movement  of\nstorm water on the health of persons, the reduction of property damage caused\nby flooding and for related matters\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n\nThis Act may be cited as the Storm Water Management Act, 2024.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Chief Technical Officer” means the Chief Technical Officer in the Ministry of\n\nTransport and Works;\n\n“Director of Planning and Development” has the meaning assigned to it by the\n\nPlanning and Development Act, 2019 (Act 2019-5);\n\n“drainage reserve” means the regulated area adjacent to and including a drainage\n\nway;\n\n“emergency works” includes flood works required to mitigate identified potential\ndangers, loss of life or damage to property, prior, during or after a rainfall\nevent or past event that can result in a major floor hazard;\n\n“flood area” means any area declared by the Minister to be a flood area under\n\nsection 5;\n\n“flood plain” means any land area susceptible to being inundated by flood waters\n\nfrom any source;\n\n“flood works” includes\n\n(a)\n\nthe  entire  or  partial  construction,  alteration,  repair,  improvement,\ncleaning,  raising,  lowering  or  grading  of  any  bank,  channel  or\nwatercourse or any land adjacent to such bank, channel or watercourse;\n\n(b)\n\nthe digging or clearing of wells and drains;\n\n(c)\n\nthe removal of any plant, trees, growing crops, building, structure or\nany other thing that prevents the free drainage of water\n\n\f7\n\nwhich is necessary for the protection of persons and lands from floods and\ninundations, prevention of damage to property and mitigation of flood risk\nto existing and future developments;\n\n“flood zone” means the flood risk for a particular area;\n\n“highways” has the meaning assigned to it by the Highways Act, Cap. 289;\n\n“land” includes messauges, buildings, erections, tenements and hereditaments of\nany tenure, and rights and easements in, over, under or in respect of the\nsame;\n\n“Minister” means the Minister responsible for storm water management;\n\n“owner” means the person for the time being receiving the rack rent of the land\nin connection with which the word is used, whether on his own account, or\nas agent or trustee for any other person, or who would so receive the same\nif the land were let at a rack rent;\n\n“premises” includes lands and streets;\n\n“storm water” means surface water or runoff generated rainfall;\n\n“storm  water  infrastructure”  means  infrastructure  associated  with  drainage  of\n\nstorm water;\n\n“watershed” means an area of land that drains all the streams and rainfall to a\ncommon outlet such as the outflow of a reservoir, mouth of a bay, or any\npoint along a stream channel.\n\nAct binds the State\n\n3.\n\nThis Act binds the State.\n\nAdministration of Act\n\n4.\nadministration of this Act.\n\nThe  Chief  Technical  Officer  shall  be  responsible  for\n\nthe\n\n\f8\n\nDeclaration of flood area\n\n5.(1)\nby order declare an area to be a flood area.\n\nThe Minister may, after consultation with the Chief Technical Officer,\n\n(2)\nThe  Minister  shall,  before  he  makes  an  order  under  subsection  (1),  lay\nbefore  both  Houses  of  Parliament,  a  map  delineating  the  boundaries  of  the\nproposed flood area.\n\nCoastal zone management\n\n6.\nregard to the following:\n\nThe Chief Technical Officer shall in exercise of his functions, have\n\n(a)\n\n(b)\n\nthe coastal zone management plan referred to under the Coastal Zone\nManagement Act, Cap. 394;\n\nthe  physical  development  plan  referred  to  under  the  Planning\nDevelopment Act, 2019 (Act 2019-5);\n\n(c)\n\nthe Marine Pollution Control Act, Cap. 392A.\n\nFlood works to be executed in accordance with plans\n\n7.(1)\nThe Chief Technical Officer may, from time to time, prepare or cause\nto be prepared plans for the approval of the Minister for the execution of flood\nworks in any flood area.\n\nA  land  developer  shall  submit  to  the  Chief  Technical  Officer  and  the\n(2)\nDirector of Planning and Development a plan or map detailing the outline of the\nwatershed for consideration by the Chief Technical Officer and the Director of\nPlanning and Development detailing the estimated amount of water runoff for\nthe proposed land development.\n\nThe plan or map referred to in subsection (2), shall be submitted through\n(3)\nthe office of the Director of Planning and Development, who shall forward the\nsame to the Chief Technical Officer for consideration.\n\n\f9\n\n(4)\nThe flood plans prepared under subsection (1) shall show the limits of the\nflood area, the line level and type of flood works which are in the opinion of the\nChief  Technical  Officer,  necessary  for  protecting  persons  and  premises  from\nfloods and inundations.\n\nWhere flood works or watershed plans have been approved, written notice\n(5)\nthereof shall be given to any person whose land, premises, plants, trees or growing\ncrops may be affected by such flood works.\n\nA  copy  of  flood  works  or  watershed  plans  shall  be  submitted  to  the\n\n(6)\noffice\n\n(a)\n\n(b)\n\nthe Registrar of Titles; and\n\nthe Director of Planning and Development.\n\nA person may apply to the Registrar of Titles to inspect the flood works or\n\n(7)\nwatershed plan free of charge.\n\nWhere a land developer fails to submit a plan referred to in subsection (2),\n\n(8)\nthe development shall not be considered for approval.\n\nPower to execute flood works\n\n8.\nThe Chief Technical Officer may execute, carry out and complete all\nor any of the flood works in such flood areas as are specified in the plan prepared\nunder section 7.\n\nPower to enter and execute flood works\n\n9.(1)\n\nThe Chief Technical Officer or anyone authorised by him\n\n(a)\n\nmay  enter  upon  any  premises  for  the  purpose  of  doing  any  work\nnecessary for\n\n(i)\n\nthe preparation of plans,\n\n(ii)\n\nthe estimation and preparation of flood works to be executed; or\n\n(iii)\n\nan evaluation of compensation to be paid;\n\n\f10\n\n(b)\n\n(c)\n\nmay enter upon a private premises represented in a plan approved under\nsection 7 and execute any flood works; or\n\nmay, in the execution of flood works, carry the flood works through,\nalong, across or under premises, sidewalk or cellar.\n\nFor the purposes of entering upon premises pursuant to subsection (1) the\n(2)\nChief  Technical  Officer  or  any  person  authorised  by  him  shall  give  notice  in\nwriting to the owner or occupier of the premises no less than 48 hours before\nentry.\n\nThe Chief Technical Officer shall before executing planned flood works,\n(3)\ngive the owner or occupier of the land intended to be affected by the flood works,\nnotice in writing no less than 14 days before the commencement of the proposed\nworks.\n\nPower to execute urgent flood works\n\n10.\nis immediate danger of flooding either\n\nNotwithstanding sections 5, 7, 8 and 9, where flooding occurs or there\n\n(a)\n\n(b)\n\nin a location that is not included in an area declared to be a flood area;\nor\n\nin an area declared to be a flood area but in respect of which plans have\nnot been prepared or approved in accordance with section 7,\n\nthe  Chief  Technical  Officer  may  enter  without  prior  notice,  upon  a  private\npremises in such location or area and execute such flood disaster preparation or\nemergency response works as are necessary to prevent flooding or facilitate the\ndrainage of flood waters.\n\nRemoval of buildings, trees, growing crops, etc.\n\nWhenever the flood works or any part of such works to be executed\n11.(1)\nin a flood area consist of the removal of a building, structure or any plants, trees\nor growing crops, or any other matter or thing, the Chief Technical Officer may\n\n\f11\n\nby notice require the owner to remove the same within such time as the Chief\nTechnical Officer thinks fit.\n\nWhen in the execution of any flood works a person is required to remove\n(2)\nany building, structure, plants, trees, growing crops or any other thing as provided\nin subsection (1), the owner of the buildings, plants, trees, growing crops or other\nthings  shall  be  entitled  to  such  reasonable  allowance  towards  the  expense  of\nremoving the same.\n\nPower to inspect\n\nThe Chief Technical Officer or any person authorised by him may\n12.(1)\nenter any private premises for the purpose of inspecting drainage infrastructure\nand enforcing maintenance on the premises thereof.\n\nWhere the Chief Technical Officer or any person authorised by him enters\n(2)\na premises pursuant to subsection (1) and finds that the premises are in need of\nmaintenance he shall give notice to the owner or occupier of the premises.\n\nA notice under subsection (2) shall set out the nature of the maintenance\n\n(3)\nrequired and the prescribed time for the maintenance to be completed.\n\nA  land  owner  or  occupier  fails  to  comply  with  the  notice  issued  under\n\n(4)\nsubsection (2), is guilty of an offence and is liable to a fine of $10 000.\n\nRequirement for storm drainage\n\n13.(1)\n\nA landowner shall install an on-site storm water disposal system.\n\nA landowner who resides in a known flood zone or flood prone area shall\n\n(2)\nnot dispose of storm water on a public road or public drainage infrastructure.\n\nA land developer shall construct or cause to be constructed in every land\n(3)\ndevelopment  projects  adequate  drainage  systems  to  mitigate  against  flooding\nwithin the development area.\n\nA land developer shall comply with the Barbados National Building Code\n\n(4)\nreferred to in the Planning Development Act, 2019 (Act 2019-5).\n\n\f12\n\nA person who fails to comply with the subsection (2) and subsection (4) is\n\n(5)\nguilty of an offence and is liable to a fine of $10 000.\n\nDuty of land owner\n\n14.(1)\nA land owner or occupier shall keep access to outfalls or to beaches,\nas the case may be, free and clear from all restriction for the purposes of this Act.\n\nA person who fails to comply with the requirements of subsection (1) is\n(2)\nguilty  of  an  offence  and  is  liable  on  indictment  to  a  fine  of  $20  000  or  to\nimprisonment to a term of 2 years or to both.\n\nDuty to submit plan\n\nA land developer shall submit to the Chief Technical Officer and the\n15.(1)\nDirector  of  Planning  and  Development  a  storm  water  drainage  plan  for  the\nproposed development area\n\n(2)\n\nThe plan referred to in subsection (1) shall contain the following:\n\n(a)\n\n(b)\n\n(c)\n\nname of the proposed development;\n\nlocation of the proposed development;\n\nlocation of the storm water drainage systems;\n\n(d)\n\nnumber of systems to be installed;\n\n(e)\n\n(f)\n\nthe estimate storm water generate from a one in 50 year return storm;\nand\n\nany other relevant information that the Chief Technical Officer or the\nDirector of Planning and Development may require.\n\nDuty to adhere to Building Code\n\n16.(1)\nAn owner or occupier of land shall adhere to the drainage requirements\nof the Barbados National Building Code in force as determined by the Barbados\nNational Standards Institution.\n\n\f13\n\nAn  owner  or  occupier  who  fails  to  adhere  to  the  Barbados  National\n\n(2)\nBuilding Code, is guilty of an offence and is liable to a fine of $10 000.\n\nExecution of works for protection of persons and lands from floods\nand inundations\n\nFor the protection of persons and lands from floods and inundations\n17.(1)\nevery owner or occupier of lands on which there are suck wells shall, at least\nonce a year, clean or cause the suck wells to be cleaned.\n\nWhere it appears to the Chief Technical Officer that an owner or occupier\n(2)\nof lands on which there are suck wells has refused to comply with the provisions\nof subsection (1) the Chief Technical Officer may serve or cause to be served on\nthe  owner  or  occupier  of  such  lands  a  notice  in  writing  signed  by  the  Chief\nTechnical Officer or by any person authorised by the Chief Technical Officer in\nthat  behalf  requiring  the  owner  or  occupier  to  execute  works  as  the  Chief\nTechnical Officer considers necessary.\n\nWhere personal service of a notice under subsection (2) cannot be effected,\n(3)\nwhether  by  reason  of  absence  of  the  owner  or  occupier  from  Barbados  or\notherwise, the Chief Technical Officer may, on an affidavit that the owner cannot\nbe found, direct that notice be served\n\n(a)\n\n(b)\n\nby affixing a copy thereof to a conspicuous part of the premises; and\n\nby publishing the notice in a daily newspaper circulated in Barbados.\n\nA notice referred to in subsection (2) shall specify the nature of the works\n(4)\nto be executed and the period of time for the execution of the works, after the\nexpiration of which period the Chief Technical Officer may cause the works to\nbe carried out if they have not previously been carried out.\n\nWhere  flood  works  are  executed  by  the  Chief  Technical  Officer  in\n(5)\naccordance with subsection (4) the Chief Technical Officer shall demand, from\nthe owner or occupier of the land on which the flood works were carried out,\npayment of the actual costs incurred.\n\n\f14\n\nOwner or occupier of land to pay for flood works\n\n18.(1)\nWhere  an  owner  or  occupier  of  land  injures,  obstructs  or  alters  a\nhighway thereby adversely interfering with the drainage of the highway he shall\npay to the State the actual costs of any flood works required to be carried out by\nthe Chief Technical Officer to rectify the owner's injury, obstruction or alteration\nof the highway.\n\nWhere a land owner or occupier builds or constructs any structure inclusive\n(2)\nof  enclosures  that  obstructs,  blocks  or  prevents  the  proper  inspection  and  or\nmaintenance  of  storm  water  critical  infrastructure,  it  shall  be  removed  at  the\nexpense of the owner or occupier.\n\nA land owner or occupier who contrary to a warning by the Chief Technical\n(3)\nOfficer or his agent, builds or constructs any structure inclusive of enclosures\nthat obstructs, blocks or prevents the proper inspection and or maintenance of\nstorm water critical infrastructure, shall have that structure or enclosure removed\nat the expense of the owner or occupier.\n\nAny salvageable material removed under subsection (2) shall be stored at\n(4)\na depot for no more than 28 days after the removal pending the collection by the\nowner or occupier of the land.\n\nWhere the owner or occupier fails to remove the material mentioned under\n(5)\nsubsection (2) within the period referred to in subsection (3), the material shall\nbe disposed of and the owner or occupier shall not be entitled to any compensation\nrelating thereto.\n\nBuilding and crops prohibited in flood area without permission\n\n19.(1)\nNo person shall, on or in a flood area, erect or cause or permit to be\nerected any building therein or grow, cultivate or allow to be grown or cultivated\nany shrub, tree, plant or any growing crop therein without the written permission\nof the Minister and upon such terms and conditions as the Minister may prescribe.\n\n\f15\n\n(2)\nAny person who contravenes this section shall be guilty of an offence and\nshall be liable on conviction by a court of summary jurisdiction to a fine of $25\n000 or to a term of imprisonment for 3 years or to both.\n\nProhibition on disposal of storm water\n\nNo person shall dispose of any water, waste water or any debris on or\n20.(1)\nin  a  storm  water  infrastructure  without  the  written  permission  of  the  Chief\nTechnical Officer.\n\nWhere  the  Chief  Technical  Officer  issues  permission  pursuant  to\n(2)\nsubsection (1) that permission shall be given on such terms and conditions as the\nChief Technical Officer deems fit.\n\nA person who contravenes subsection (2) is guilty of an offence and is\n\n(3)\nliable to a fine of $20 000.\n\nDisposal of garbage, debris, etc.\n\nA person who disposes of garbage, debris, bulk waste or any other\n21.\nwaste that blocks, causes to be blocked or threatens the free movement of water\nin or around drainage infrastructure, water courses or water drains is guilty of an\noffence and is liable to a fine of $20 000 or to imprisonment for a term of 2 years\nor to both.\n\nErection of fences, walls, etc.\n\n22.(1)\n\nNo person shall\n\n(a)\n\n(b)\n\n(c)\n\nerect a fence;\n\nerect a wall or cause a wall to be erected;\n\nconstruct or develop any form of fence or hedge; or\n\n(d)\n\nconstruct or caused to be constructed any encumbrance,\n\non or over any drainage infrastructure.\n\n\f16\n\n(2)\nA person who contravenes subsection (1) is guilty of an offence and is\nliable to a fine of $10 000 or to imprisonment to a term of 12 months or to both.\n\nDisposal of construction materials\n\n23.(1)\nNo person shall dispose of or caused to be disposed any construction\nmaterials within any environs of the roads, water ways or drainage conveyance\nsystems.\n\nA person who contravenes subsection (1) is guilty of an offence and is\n(2)\nliable on summary conviction to a fine of $10 000 or to imprisonment to a term\nof 12 months or to both.\n\nRestriction on placement of infrastructure\n\nNo utility company, its agents or employees shall place or cause to be\n24.(1)\nplaced on, in or over any drainage infrastructure, any materials belonging to the\ncompany.\n\nA person who contravenes subsection (1) is guilty of an offence and is\n\n(2)\nliable to a fine of $20 000.\n\nRestriction on obstructing draining infrastructure\n\n25.\ninfrastructure that restricts access to that infrastructure.\n\nNo person shall park any vehicle or place any object over any drainage\n\nPower to remove obstruction in emergency\n\n26.(1)\nWhere an emergency access is required, the Chief Technical Officer\nor any person authorised by the Chief Technical Officer may move or caused to\nbe  moved  any  vehicle  or  thing  that  restricts  access  to  the  area  where  the\nemergency exists.\n\nThe owner of the vehicle or thing removed, shall be liable for all costs\n\n(2)\nassociated with the removal of the vehicle under subsection (1).\n\n\f17\n\nPower of the State to take lands\n\nWhenever for the purpose of executing any flood works in accordance\n27.\nwith this Act, it is in the opinion of the Minister necessary to take any premises\nor  lands,  the  State  may  take  and  use  such  premises  and  lands  which  may  be\nrequired for the purpose of executing such works and shall for such purpose have\nand exercise all the powers conferred upon the State by the Land Acquisition\nAct, Cap. 228 in relation to the taking of lands for public purposes.\n\nCompensation\n\nSubject to section 10, any person may claim compensation for any\n28.(1)\ndamage caused by the execution of flood works or in respect of any lands or\ninterest taken, used or injuriously affected.\n\nWhen any person liable to execute flood works and the Minister are unable\n(2)\nto agree as to the amount of compensation, if any, the same shall be determined\nby arbitration in accordance with this Act.\n\nMatters disregarded in computing compensation\n\n29.(1)\nprovisions in a flood area, namely any provision which\n\nNo compensation shall be payable in respect of any of the following\n\n(a)\n\n(b)\n\nprohibits or restricts building operations permanently on the ground\nthat  by  reason  of  the  situation  or  nature  of  the  land,  the  erection  of\ndwellings thereon would be likely to involve danger or injury to health\nor to the life and safety of the residents of such dwellings; or\n\nprohibits, otherwise than by way of prohibiting building operations,\nthe use of land for a purpose likely to involve danger or injury to health\nor  to  the  life  and  safety  of  persons  resorting  thereto  or  restricts,\notherwise than by way of restricting building operations, the use of land\nso far as may be necessary for preventing such danger or injury.\n\n\f18\n\n(2)\nThe fact that any land was used or capable of being used for the erection\nof dwellings prior to the date of commencement of this Act, shall not be taken\ninto account in the assessment of compensation and no account shall be taken of\nthe rental value of such land.\n\nAny enhancement of the value of other land shall be taken into account in\n\n(3)\nthe assessment of compensation.\n\nWhere the Minister has declared an area to be a flood area in accordance\n(4)\nwith sections 5 and 7 and it is proved to the satisfaction of the Minister that the\nowner or occupier of any land or building in such area was given due notice prior\nto such declaration whether before or after the commencement of this Act to the\neffect  that  no  building  should  be  erected  thereon,  no  compensation  shall  be\npayable in respect of any building in such flood area, the erection of which was\nbegun after due notice was so given.\n\nArbitration\n\nAny question in dispute which is required by any provision of this Act\n30.(1)\nto be settled by arbitration shall be referred to the determination of 2 arbitrators,\none to be appointed by each party to the dispute or to an umpire in case such\narbitrators fail to agree such umpire to be chosen by the arbitrators before entering\nupon the matters submitted to them.\n\nWhere, for the space of 14 days after such dispute arises and after a request\n(2)\nin  writing,  in  which  shall  be  stated  the  matter  so  required  to  be  referred  to\narbitration, is served by the one party on the other party to appoint an arbitrator,\nsuch last-mentioned party fails to appoint such arbitrator, then upon such failure\nthe party making such request and having himself appointed an arbitrator may\nappoint such arbitrator to act on behalf of both parties, and such arbitrator may\nproceed to hear and determine the matter which shall be in dispute.\n\nThe award or determination of the question in dispute by a single arbitrator,\n(3)\nthe arbitrators or the umpire, as the case may be, shall be final and binding on\nthe parties in difference and every submission to arbitration under this section\n\n\f19\n\nshall be deemed to be an arbitration within the Arbitration Act, Cap. 110, and be\nsubject to the provisions relating to arbitration contained in that Act.\n\nNotices\n\n31.(1)\nAny notice under this Act may be served on the owner or occupier of\nany premises by leaving it with the occupier of such premises or with some other\nperson in residence of his abode; and, if there is no occupier, by putting up such\nnotice or plan in a conspicuous part of the premises.\n\nWhere planned maintenance of drainage infrastructure is scheduled, the\n(2)\nChief Technical Officer shall issue notice to the land owners and occupiers in the\nlocation in which the planned drainage works are to be conducted.\n\nNotice issued under subsection (2) shall be not less than 7 days before the\n\n(3)\ncommencement of the drainage works.\n\nOffences\n\n32.\n\nAny person who\n\n(a)\n\n(b)\n\n(c)\n\nassaults, resists, obstructs or intimidates the Chief Technical Officer\nor  any  person  authorised  by  the  Chief  Technical  Officer  in  the\nexecution of his duties under this Act;\n\nuses  abusive  language,  indecent  or  insulting  language  to  the  Chief\nTechnical  Officer  or  any  person  authorised  by  the  Chief  Technical\nOfficer in the execution of his duties under this Act;\n\ninterferes with or hinders the Chief Technical Officer or any person\nauthorised by the Chief Technical Officer in the execution of his duties\nunder this Act; or\n\n(d)\n\ncontravenes the provisions of this Act,\n\nis guilty of an offence and is liable on summary conviction to a fine of $10 000\nor to imprisonment for a term of 12 months or to both.\n\n\f20\n\nRecovery of costs\n\n33.\nThe costs of carrying out flood works by the Chief Technical Officer\nunder sections 18 or 19 is a debt due to the State and is recoverable in summary\nproceedings before a magistrate for District “A” notwithstanding that the costs\nexceed the monetary limit on the jurisdiction of the Magistrate’s Court.\n\nRepeal\n\n34.\n\nThe Prevention of Floods Act, Cap. 235 is repealed.\n\nCommencement\n\n35.\nproclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n"
}