{
  "bill_id": 773,
  "slug": "icc-cricket-world-cup-west-indies-bill-2024",
  "title": "ICC Cricket World Cup West Indies Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/e63554d3098c8cf3e70ebe9dbc30b472.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-04-24",
  "first_reading": "2024-05-03",
  "gazette_date": "2024-04-29",
  "markdown": "2024-04-23\n\nOBJECTS AND REASONS\n\nThis Bill would make provision for the efficient and effective staging of ICC\n\nCricket World Cup West Indies, 2024 and for related purposes.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nAct to bind the State\n\nPART II\n\nCWC 2024 SPECIAL ARRANGEMENTS\n\nDeclaration of CWC 2024 venue and match period\n\nCWI to have unrestricted control of CWC 2024 stadia during match period\n\nDeliveries within CWC 2024 venues\n\nSale and distribution of CWC 2024 tickets\n\nWork Permits\n\nImport and export duties\n\n10.\n\nExemption from income and other taxes\n\n11.\n\nExemption from taxes on CWC 2024 tickets\n\n\f3\n\n12.\n\nExemption from foreign exchange regulations\n\n13.\n\nEntry into and exit from a stadium in a CWC 2024 venue\n\n14.\n\nUnauthorized entry\n\n15.\n\nReserved areas and reserved seats\n\n16.\n\nMembers entitlements during a match period\n\n17.\n\nConduct within CWC 2024 venue\n\n18.\n\nProhibited or restricted items in CWC 2024 venue\n\n19.\n\nSurrender of prohibited items\n\n20.\n\nSale of goods or services\n\n21.\n\nPower to photograph certain persons\n\n22.\n\nRequirement to state name and address\n\nPART III\n\nCONTROL OF ADVERTISING\n\n23.\n\nProhibition of certain advertisements on building and structures\n\n24.\n\nCommercial broadcasting, telecasting, recording or filming\n\n25.\n\nProhibition of ambush marketing\n\n26.\n\nPromotional use of CWC 2024 tickets\n\n\f4\n\nPART IV\n\nPROTECTION OF CWC 2024 MARKS, INDICIA AND IMAGES\n\n27.\n\nProhibition of unauthorized use of CWC 2024 mark\n\n28.\n\nInfringement of mark of IBC, ICC, CWI etc\n\n29.\n\nCWC 2024 indicia and images\n\n30.\n\nApplication of CWC 2024 indicia and images\n\n31.\n\nLicence to use CWC 2024 indicia or CWC 2024 images for commercial\npurposes\n\n32.\n\nProhibition of unlicensed use of CWC 2024 indicia or CWC 2024 images\n\n33.\n\nProvision of information\n\n34.\n\nPowers of custom officers in relation to certain imports\n\n35.\n\nNotice of detention\n\n36.\n\nRelease of goods: no application for injunction\n\n37.\n\nPower of Comptroller to retain control of goods\n\n38.\n\nPreservation of existing rights\n\nPART V\n\nREMEDIES\n\n39.\n\nInjunctions\n\n\f5\n\n40.\n\nCorrective advertisements\n\n41.\n\nDamages\n\n42.\n\nAccount of profits\n\n43.\n\nLimitation\n\n44.\n\nDestruction or delivery of goods\n\n45.\n\nOther remedies\n\n46.\n\nCompensation\n\nPART VI\n\nMISCELLANEOUS\n\n47.\n\nOffences by corporations\n\n48.\n\nRegulations\n\n49.\n\nReferences\n\n50.\n\nAmendment by order schedules\n\n51.\n\nExpiry of Act\n\nFIRST SCHEDULE\n\nSECOND SCHEDULE\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  make  provision  for  the  efficient  and  effective  staging  of  ICC\n\nCricket World Cup West Indies, 2024 and for related purposes.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f8\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n2024.\n\nThis Act may be cited as the ICC Cricket World Cup West Indies Act,\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“advertisement”  means  any  written,  illustrated,  visual  or  other  descriptive\nmaterial  or  oral  statement,  communication,  representation  or  reference\ndistributed to members of the public or brought to their notice in any manner\nwith the intention to\n\n(a)\n\n(b)\n\n(c)\n\npromote the sale or leasing of goods;\n\nencourage the use of any service; or\n\ndraw attention to the nature, properties, advantages or uses of goods or\nany service or to the manner in, conditions on or prices at which\n\n(i)\n\ngoods may be purchased, leased or otherwise acquired; or\n\n(ii)\n\nany service is rendered or provided;\n\n“authorized person” means a person authorized in writing by CWI to represent\n\nit;\n\n“Commissioner” means the Commissioner of Police;\n\n“Comptroller” means the Comptroller of Customs;\n\n“customs  officer”  means  an  officer  within  the  meaning  of  the  Customs  Act,\n\n2021 (Act 2021-34);\n\n\f9\n\n“CWC 2024” means the ICC Cricket World Cup West Indies, 2024 and includes,\n\na CWC 2024 activity;\n\n“CWC  2024  activity”  means  a  match,  a  CWC  2024  related  function  or  other\n\nactivity authorized by CWI;\n\n“CWC 2024 logo” means any official logo of CWC 2024;\n\n“CWC 2024 mark” means the CWC 2024 logo, CWC 2024 title, CWC 2024\nmascot, and the image or likeness of the CWC 2024 trophy, the ICC mark,\nany mark belonging to CWI and any other marks, whether in the form of\nwords, logos, devices, indicia, or anything else, developed for or used by or\nwith the consent of IBC in connection with the CWC 2024, and includes all\nregistrations or applications to register the same in Barbados but excludes\nany such marks to the extent that they are owned by an official sponsor,\nofficial  supplier,  official  broadcaster  or  other  media  or  commercial\nrepresentative appointed and approved by CWI;\n\n“CWC 2024 mascot” means the official mascot of CWC 2024;\n\n“CWC 2024 official” means\n\n(a)\n\n(b)\n\nan employee of CWI; or\n\na person authorized by CWC 2024 to carry out functions on its behalf;\n\n“CWC 2024 ticket” means a ticket issued by CWI permitting entry to a CWC\n\n2024 activity and includes a CWI accreditation;\n\n“CWC 2024 title” means ICC Cricket World Cup West Indies 2024 or such other\n\nname as may be determined by IBC;\n\n“CWC  2024  venue”  means  a  place  declared  as  such  under  section  4  for  the\n\npurposes of CWC 2024;\n\n“CWI” means Cricket West Indies Inc., a company incorporated under the laws\n\nof the British Virgin Islands;\n\n\f10\n\n“dangerous weapon” means any\n\n(a)\n\n(b)\n\n(c)\n\nexplosive;\n\nincendiary device or material;\n\nfirearm;\n\n(d)\n\ngas;\n\n(e)\n\nmaterial;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nweapon;\n\nglass of any description;\n\narticle, object or instrument;\n\nobject that may be used as a missile;\n\nsuch other object as may be prescribed as a dangerous object;\n\nwhich may be used to maim, disfigure, disable or cause bodily harm or death\nto a person;\n\n“designated person” means\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nIBC, ICC, CWI and their respective employees, consultants, officials,\nagents and representatives;\n\nICC members and their respective employees, consultants, officials,\nagents and representatives;\n\nmembers of the delegation of any participating team including players,\ncoaches, medical doctors and officials;\n\nIBC  partners  or  CWI  partners  and  their  respective  employees,\nconsultants, officials, agents and representatives;\n\nmedia representatives who are accredited by IBC in respect of the CWC\n2024; and\n\n(f)\n\nany other person who is accredited by IBC in respect of CWC 2024;\n\n\f11\n\n“document” means recorded information regardless of form or medium;\n\n“IBC” means ICC Business Corporation FZ LLC, a company incorporated under\n\nthe regulations of the Dubai Development Authority;\n\n“ICC” means the International Cricket Council, a company limited by guarantee\n\nand incorporated in the British Virgin Islands;\n\n“income” includes basic salary, appearance fees, endorsement fees, prize money,\n\nand man-of-the-match and man-of-the-series awards;\n\n“licensed user” means a person in relation to whom a licence under section 31 is\n\nin force;\n\n“match” means a match including a warm-up match, that forms part of CWC\n2024  and  includes  a  performance  or  formalities  held  or  conducted  in\nconjunction with a match;\n\n“match period” means a period declared as such by the Minister under section\n\n4 for the purposes of CWC 2024;\n\n“Minister” means the Minister responsible for Sports;\n\n“official broadcaster” means a broadcaster appointed and approved by IBC in\n\nrelation to CWC 2024;\n\n“official sponsor” means a sponsor appointed and approved by IBC in relation\n\nto CWC 2024;\n\n“official  supplier”  means  a  supplier  of  products  or  services  appointed  as  the\nofficial supplier of such products or services for CWC 2024 by IBC;\n\n“participating team” means an ICC member country team competing in CWC\n\n2024;\n\n“permitted entrant” means\n\n(a)\n\nthe holder of a CWC 2024 ticket that entitles the holder to be within\nspecific areas of a CWC 2024 venue;\n\n\f12\n\n(b)\n\nany other person who is, under a general or specific authorisation or\naccreditation granted by or on behalf of CWI, entitled to be in the CWC\n2024 venue;\n\n“person” means a natural person, a body corporate or an unincorporated body;\n\n“playing field” means the playing field at which a match is being played or is to\nbe played and includes any area between the playing field and any structure\nintended to be a barrier between the players and the spectators;\n\n“police officer” means a member of the Barbados Police Service;\n\n“promote”  in  relation  to  an  activity,  includes  to  organise,  conduct  or  give\n\npublicity to that activity;\n\n“reserved area” means an area within a CWC 2024 venue to which access is\n\n(a)\n\n(b)\n\nlimited to persons holding certain types of CWC 2024 tickets; or\n\notherwise restricted;\n\n“service mark” means a visible sign used or to be used in connection with or in\nrelation to any services for the purpose of distinguishing, in the course of\ntrade or business, the services provided by one person from those provided\nby another person;\n\n“sign”  includes  a  word,  personal  name,  design,  letter,  numeral,  a  colour,  a\n\ncombination of colours, the shape of goods or their packaging;\n\n“squad” means the members of a participating team comprising 15 players and\n\nup to 6 non-playing officials;\n\n“stadium” means the whole premises of any stadium, ground or place at which\nany match, the opening ceremony or the closing ceremony of CWC 2024 is\nscheduled to take place;\n\n“tax” includes any fee, levy or surcharge;\n\n\f13\n\n“trade mark” means a visible sign used or to be used upon, with or in relation to\nany  goods  for  the  purpose  of  distinguishing,  in  the  course  of  trade  or\nbusiness, the goods of one person from those of another person;\n\n“vehicle” means a conveyance that is designed to be propelled or drawn by any\n\nmeans, whether or not capable of being so propelled or drawn.\n\nAct to bind the State\n\n3.\n\nThis Act binds the State.\n\nPART II\n\nCWC 2024 SPECIAL ARRANGEMENTS\n\nDeclaration of CWC 2024 venue and match period\n\nThe  Minister,  after  consultation  with  the  CWI,  shall  by  notice\n4.(1)\npublished in the Official Gazette and in at least one newspaper in daily circulation\nin Barbados,\n\n(a)\n\ndeclare any area within the control of CWI, that is reasonably required\nfor the staging of a CWC 2024 activity, as a CWC 2024 venue;\n\n(i)\n\ndate\n\n(i)\n\n(ii)\n\n(b)\n\nstipulate within the notice referred to in subsection (1) the\n\nwith effect from which the area will be regarded as a CWC 2024\nvenue; and\n\non which the area ceases to be regarded as a CWC 2024 venue,\nwhich date may not be later than 7 days after the completion or\ntermination of CWC 2024; and\n\n(c)\n\ndeclare a period as a match period.\n\n\f14\n\n(2)\nA  notice  published  under  subsection  (1)  shall  state  the  reason  for  the\ndeclaration,  and  shall  be  subject  to  such  conditions  as  the  Minister  may\nimpose.\n\nFor  the  purposes  of  subsection  (l)(a),  areas  reasonably  required  for  the\n\n(3)\nstaging of a CWC activity\n\n(a)\n\nmay include areas that are to be used for a purpose ancillary to the\nholding of a CWC 2024 activity;\n\n(b)\n\nmay comprise 2 or more non-contiguous areas; and\n\n(c)\n\nshall not include\n\n(i)\n\n(ii)\n\nan airport or a seaport;\n\nany  area  which  is  protected  or  reserved  under  any  other\nenactment; or\n\n(iii)\n\nany private property, except with the consent of the owner.\n\nCWI to have unrestricted control of CWC 2024 stadia during match\nperiod\n\n5.(1)\ncontrol of a stadium so declared pursuant to section 4(1).\n\nCWI shall, for the duration of a match period have full and unrestricted\n\nThe power given to CWI under subsection (1) shall be subject to the rights\n(2)\nof any authority responsible for public health, disaster management or national\nsecurity.\n\nDeliveries within CWC 2024 venues\n\n6.(1)\ndirection, to\n\nThe  Commissioner  may  in  relation  to  any  match  period  issues\n\n(a)\n\nregulate or prohibit the making of deliveries within any CWC 2024\nvenue;\n\n\f15\n\n(b)\n\n(c)\n\nregulate or prohibit the loading or unloading of vehicles within any\nCWC 2024 venue; or\n\nimpose restrictions, relating to the standing, stopping, or parking of\nvehicles within a CWC 2024 venue.\n\n(2)\n\nA direction by the Commissioner under subsection (1) may apply\n\n(a)\n\n(b)\n\n(c)\n\nto an entire CWC 2024 venue, or part of a venue;\n\nto vehicles of a specified class or description;\n\non such days only as are specified in the direction;\n\n(d)\n\nduring such periods on those days as are specified in the direction; and\n\n(e)\n\nsubject to such conditions as are specified in the direction.\n\nA person who contravenes a direction under this section is guilty of an\n\n(3)\noffence and is liable on summary conviction to a fine of $20 000.\n\nNothing in this section limits the power of the Commissioner to restrict\n\n(4)\naccess to or use of any road pursuant to any other law.\n\nSale and distribution of CWC 2024 tickets\n\n7.(1)\n2024 tickets.\n\nCWI shall be responsible for the production and distribution of CWC\n\nNo person shall, without the written authorisation of CWI sell any CWC\n(2)\n2024 ticket or an article that is represented to be such a ticket for admission to a\nCWC 2024 activity.\n\n(3)\n\nFor the purposes of subsection (2) \"sell\" includes\n\n(a)\n\n(b)\n\n(c)\n\nsell by wholesale, retail, auction or tender;\n\nhire;\n\nbarter or exchange;\n\n(d)\n\nsupply for profit;\n\n\f16\n\noffer for sale or hire, receive for sale or hire, have in possession for\nsale or hire, or expose or exhibit for sale or hire;\n\nconduct negotiations for sale or hire;\n\nconsign or deliver for sale or hire;\n\nsolicit for sale or hire;\n\ndonate, transfer or in any way dispose of a ticket for gain or profit; and\n\ncause or permit anything referred to in paragraphs (a) to (i).\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nA person who contravenes subsection (2) is guilty of an offence and is\n\n(4)\nliable on summary conviction to a fine of $50 000.\n\nWork Permits\n\nAny permit to work in Barbados in relation to CWC 2024, and any\n8.(1)\napproval or documentation required for such purpose by any designated person\nshall  be  provided  by  the  Chief  Immigration  Officer  within  7  days  of  being\nrequested and shall remain valid and effective until the conclusion of CWC 2024.\n\nThe work permits referred to in subsection (1) shall be provided within the\n(2)\nperiod so stated where the applicant complies with the requirements stipulated\nby the Chief Immigration Officer.\n\nImport and export duties\n\n9.(1)\n\nNotwithstanding any provision of any law to the contrary\n\n(a)\n\n(b)\n\n(c)\n\npersonal effects;\n\nfood, food supplements and beverages;\n\nmedical supplies, medical instruments and pharmaceuticals;\n\n(d)\n\nsporting equipment;\n\n(e)\n\npromotional, signage and decorative materials;\n\n\f17\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nphotographic  and  audio-visual  equipment  and  supplies  including\nbroadcast equipment and supplies;\n\ndocuments, printed matter, computers and other office equipment;\n\ngifts, awards, trophies, medals and flags;\n\nuniforms, costumes and other clothing; and\n\nproducts that the licensee intend to distribute as promotional items and\nproducts of the licensee, including automobiles, which are supplied to\nCWI and IBC,\n\nin connection with the organization and staging of CWC 2024, shall be exempt\nfrom  import  duty,  or  other  impost  in  accordance  with  the  Customs  Act,  2021\n(Act 2021-34) or any other enactment relating to the imposition of duties.\n\nNotwithstanding any provision of any law to the contrary, a person who is\n(2)\nparticipating in, organizing or staging the CWC 2024, shall be permitted to export\nsuch goods without any duty, or other impost in accordance with the Custom Acts,\n2021 (Act 2021-34) or any other enactment relating to the imposition of duties.\n\nFor the purposes of subsection (1), \"duty\" includes any tax chargeable on\n\n(3)\nthe importation of goods into Barbados.\n\nExemption from income and other taxes\n\n10.(1)\nIncome arising from CWC 2024 earned by a designated person, who\nis not ordinarily resident of Barbados, shall be exempt from taxes and duties of\nevery description.\n\nCWI, ICC and IBC, its subsidiaries and associates shall be exempt from\n\n(2)\ntaxes and duties of every description.\n\nExemption from taxes on CWC 2024 tickets\n\n11.\ndescription.\n\nCWC  2024  tickets  shall  be  exempt  from  taxes  and  duties  of  every\n\n\f18\n\nExemption from foreign exchange regulations\n\nIncome arising from CWC 2024 earned by a designated person, who\n12.\nis not ordinarily resident of Barbados, shall be exempt from foreign exchange\nrestrictions.\n\nEntry into and exit from a stadium in a CWC 2024 venue\n\n13.(1)\npermitted entrant.\n\nNo person shall enter a stadium during a match period unless he is a\n\nNo  person  shall  enter  or  leave  a  stadium  during  a  match  period  except\n(2)\nthrough an entrance or exit designated by CWI or as otherwise permitted by CWI.\n\nA person who contravenes any provision of this section commits an offence\n\n(3)\nand is liable on summary conviction to a fine of $20 000.\n\nUnauthorized entry\n\n14.(1)\nenter or be present in or on\n\nUnless authorized by CWI, no person shall, during a match period,\n\n(a)\n\n(b)\n\n(c)\n\nany part of a playing field;\n\nany other part of a stadium if it is indicated that entry into that part is\nnot permitted; or\n\nany part of any other CWC 2024 venue if it is indicated that entry into\nthat part is not permitted.\n\nFor the purposes of subsection (l)(b) and (c), an indication that entry is not\n\n(2)\npermitted may be given in the following manner:\n\n(a)\n\n(b)\n\n(c)\n\nan advertisement;\n\na pamphlet;\n\nthe conditions attached to a CWC 2024 ticket;\n\n(d)\n\na direction of a police officer or an authorized person;\n\n\f19\n\n(e)\n\na fence, chain or barrier around the part or across an entrance into the\npart; or\n\n(f)\n\na sign erected in, at or near an entrance.\n\n(3)\n\nA person who contravenes subsection (1) may be\n\n(a)\n\n(b)\n\nordered by a police officer or an authorized person to leave a CWC\n2024 venue, or part thereof;\n\nremoved from the CWC 2024 venue, or part thereof, by a police officer\nwhere that person refuses to comply with an order under paragraph\n(a).\n\nA person who contravenes subsection (1) is guilty of an offence and is\n\n(4)\nliable on summary conviction to a fine of $5 000.\n\nReserved areas and reserved seats\n\n15.(1)\n\nCWI may for the duration of a match period, set aside\n\n(a)\n\n(b)\n\nany area within a CWC 2024 venue as a reserved area; or\n\nany seat within a CWC 2024 venue as a reserved seat.\n\nNo person shall enter or remain in a reserved area or occupy a reserved\n\n(2)\nseat unless that person is\n\n(a)\n\n(b)\n\nthe holder of a CWC 2024 ticket conferring entitlement to do so; or\n\notherwise authorized so to do by or on behalf of CWI.\n\nA police officer or an authorized person who has reasonable grounds to\n(3)\nsuspect that a person who is in a reserved area or reserved seat is not entitled to\nbe  in  the  area  or  seat,  may  request  that  person  to  produce  evidence  of  his\nentitlement to enter or remain in the reserved area or to occupy the reserved seat.\n\nA person who fails to comply with a request under subsection (3) may be\n(4)\nordered by a police officer or an authorized person to leave the reserved area,\nreserved seat or the CWC 2024 venue.\n\n\f20\n\nA  person  who  refuses  to  comply  with  an  order  given  under  subsection\n\n(5)\n(4)\n\n(a)\n\n(b)\n\nmay be removed from the CWC 2024 venue by a police officer; and\n\nis guilty of an offence and is liable on summary conviction to a fine of\n$5 000.\n\nMembers entitlements during a match period\n\n16.(1)\nThis section applies to the members of any organisation, association,\nclub or similar body or a person who has any entitlement in a stadium whether\nthrough the exercise of rights or otherwise.\n\n(2)\n\nDuring a match period\n\n(a)\n\n(b)\n\na member referred to in subsection (1), is not entitled to exercise any\nright, entitlement or privilege of membership;\n\nthe holder of a club card or guest card or similar facility is not entitled\nto exercise any right or privilege otherwise conferred on the holder;\nand\n\n(c)\n\na person otherwise entitled or privileged, is not entitled to exercise any\nright, entitlement or privilege,\n\nin relation to a stadium, or any part of it, including the right to obtain entry to the\nstadium or to use any facilities for seating, eating, drinking, sport or recreation\nprovided at or in relation to the stadium.\n\nA  person  referred  to  in  subsection  (2)  who  seeks  to  exercise  any  right,\n\n(3)\nentitlement or privilege may be\n\n(a)\n\n(b)\n\nordered by a police officer or an authorized person to leave the stadium;\nor\n\nremoved from the stadium, by a police officer where that person refuses\nto comply with an order given under paragraph (a).\n\n\f21\n\nThe owners of the stadium, CWI, ICC, or IBC shall not be liable as a result\n\n(4)\nof the operation of this section\n\n(a)\n\n(b)\n\n(c)\n\nfor any suit, action or proceeding;\n\nto pay compensation to a member, guest or club card holder or to any\nother person referred to under subsection (2); or\n\nto reimburse any person referred to in paragraph (b), for the whole or\na portion of any payment made by such person to obtain certain rights,\nentitlements or privileges.\n\nConduct within CWC 2024 venue\n\n17.(1)\n\nA person shall not in any CWC 2024 venue\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nmisuse, deface, damage or tamper with any building, vomitory, seat,\nchair,  table,  structure,  vehicle,  craft,  truck,  pipe,  tap,  tap-fitting,\nconduit, electrical equipment, wiring or sign;\n\nexcavate or cause to be excavated any part of a CWC 2024 venue unless\nauthorized by CWI;\n\nerect any structure, erect or display any sign, banner or other thing, in\ncontravention of this Act unless authorized by CWI;\n\nblock  any  stair,  step,  aisle,  gangway,  overpass,  underpass,  pontoon,\nbridge, entry, exit or other thoroughfare unless authorized by CWI;\n\nthrow any stone, bottle or missile, or throw or use any other dangerous\nobject;\n\ndisrupt, interrupt, or behave in a manner that may disrupt or interrupt,\nany CWC 2024 activity or disrupt, or interfere with, the comfort of\npersons at a CWC 2024 activity;\n\n(g)\n\ninterfere with the equipment of a person taking part in a CWC 2024\nactivity;\n\n\f22\n\n(h)\n\noperate or use a loud hailer, public address system or other broadcast\ndevice or any other device that may interfere with electronic or radio\ncommunications unless authorized by CWI;\n\n(i)\n\nconduct public surveys or opinion polls, or solicit money, donations or\nsubscriptions from members of the public unless authorized by CWI;\n\n(j)\n\nact or conduct himself in such a way as to\n\n(i)\n\nadversely  affect  the  safety  of  the  public  within  the  stadium  or\nother CWC 2024 venue;\n\n(ii)\n\ninterfere with any person taking part in a CWC 2024 activity;\n\n(iii)\n\n(iv)\n\ninterfere with the equipment of a person taking part in a CWC\n2024 activity; or\n\nadversely  affect  the  efficient  operation  and  staging  of  a  CWC\n2024 activity; or\n\n(k)\n\nengage in the conduct described in section 25.\n\nA police officer may dismantle or remove any structure erected or any sign,\n\n(2)\nbanner or other thing displayed in contravention of this section.\n\n(3)\n\nA person who contravenes subsection (1)\n\n(a)\n\nmay be\n\n(i)\n\n(ii)\n\nordered by an authorized person or a police officer to leave the\nCWC 2024 venue; or\n\nremoved  from  the  CWC  2024  venue  by  a  police  officer  if  that\nperson refuses to comply with an order under paragraph (a); and\n\n(b)\n\nis guilty of an offence and is liable on summary conviction to a fine\nof $50 000.\n\nA police officer may take possession of anything used or capable of being\n\n(4)\nused to contravene this section.\n\n\f23\n\nWhere possession of an item is taken under subsection (4), the item shall\n\n(5)\nbe lodged with CWI.\n\n(6)\nAn item lodged with CWI shall, except where the person is charged, be\navailable for collection within 48 hours after possession of it was taken at such\nplace as is notified to the person from whom it was taken.\n\nFor  the  purposes  of  subsection  (1)(j)(ii)  and  section  18(2)(f),  \"a  person\n\n(7)\ntaking part in a CWC 2024 activity\" means\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\na member of a squad;\n\na person, including an umpire or a match referee, engaged in the control\nor management of the CWC 2024 activity;\n\na member of a class of persons authorized to enter the playing field; or\n\nany person involved in the production, transmission or broadcast of a\nCWC activity whether by television, radio, internet, or wireless service\nor otherwise.\n\nProhibited or restricted items in CWC 2024 venue\n\n18.(1)\nvenue, during a match period\n\nNo person shall, bring into or have in his possession at a CWC 2024\n\n(a)\n\nany weapon or dangerous object or article capable of being used as a\nweapon;\n\n(b)\n\nany animal other than a guide dog if the person is blind; or\n\n(c)\n\nany article specified in Part I of the First Schedule.\n\nNo person shall, bring into or have in his possession at a CWC 2024 venue\n\n(2)\nduring a match period, any article\n\n(a)\n\nwhich may be used to\n\n(i)\n\n(ii)\n\nerect a structure;\n\ndeface or damage any structure within that venue;\n\n\f24\n\n(iii)\n\n(iv)\n\n(v)\n\n(vi)\n\nadversely affect the safety of the public within that venue;\n\ndisrupt or interrupt a CWC 2024 activity;\n\ninterfere  with  the  comfort  of  persons  within  the  CWC  2024\nvenue or their enjoyment of a CWC 2024 activity;\n\ndistract, hinder or interfere with a person taking part in a CWC\n2024 activity or the equipment of that person;\n\n(vii)\n\nengage in conduct prohibited under section 25;\n\n(viii)\n\notherwise affect the efficient operation and staging of a CWC\n2024 activity; or\n\n(b)\n\nspecified in Part II of the First Schedule except where those articles\nare sold at the venue.\n\n(3)\n\nA person who contravenes subsection (1) may be\n\n(a)\n\n(b)\n\nordered by an authorized person to leave the CWC 2024 venue; or\n\nremoved from the CWC 2024 venue by a police officer, if that person\nrefuses to comply with an order under paragraph (a).\n\nA person who contravenes subsection (1) is guilty of an offence and is\n\n(4)\nliable on summary conviction to a fine of $50 000.\n\nSurrender of prohibited items\n\n19.(1)\n\nAn authorized person may request a person to surrender any item that\n\n(a)\n\nis prohibited under section 18(1) or restricted under section 18(2)(b)\nor that may be used in a manner to contravene section 18(2), which is\nin  his  possession  at  any  security  point  or  entrance  of  a  CWC  2024\nvenue; or\n\n(b)\n\nhas been brought into a CWC 2024 venue\n\n(i)\n\nin contravention of section 18(1), 18(2)(b); or\n\n(ii)\n\nthat may be used to contravene section 18(2).\n\n\f25\n\n(2)\n\nA person who refuses to surrender an item when requested to do so under\n\n(a)\n\n(b)\n\nsubsection (l)(a) may be refused entry to a CWC 2024 venue; or\n\nsubsection (l)(b) may be\n\n(i)\n\n(ii)\n\nordered by an authorized person to leave the CWC 2024 venue;\nor\n\nremoved from the CWC 2024 venue by a police officer, if that\nperson refuses to comply with an order under subparagraph (i).\n\nAn authorized person, on taking possession of an item under this section\n(3)\nshall give a receipt to the person from whom it was taken, indicating the nature\nof the item and the date and time when possession of it was taken by the authorized\nperson.\n\n(4)\n\nAn item referred to in subsection (3) shall\n\n(a)\n\n(b)\n\nbe lodged with CWI; and\n\nexcept where the person is charged, be available for collection within\n48 hours after possession of it was taken at such place as is notified to\nthe person from whom it was taken.\n\nSale of goods or services\n\n20.(1)\n\nNo person shall, without the written authorization of CWI\n\n(a)\n\n(b)\n\nhawk, sell, offer, display for sale or distribute to members of the public,\nany goods, services, flyers or pamphlets;\n\ncollect  money  or  orders  from  members  of  the  public  for  goods  or\nservices,\n\nin a CWC 2024 venue during a match period.\n\n(2)\n\nA person who contravenes subsection (1) may be\n\n(a)\n\nordered by an authorized person to leave the CWC 2024 venue; or\n\n\f26\n\n(b)\n\nremoved  from  the  CWC  2024  venue  by  a  police  officer  where  that\nperson refuses to comply with an order under paragraph (a).\n\nA person who contravenes subsection (1) is guilty of an offence and is\n\n(3)\nliable on summary conviction to a fine of $5 000.\n\nPower to photograph certain persons\n\nAn  authorized  person  who  suspects,  on  reasonable  grounds,  that  a\n21.(1)\nperson  in  a  CWC  2024  venue  has  committed  or  has  been  involved  in  the\ncommission of an offence in contravention of this Part may take a photograph or\nmake another form of image including a closed circuit television recording of\nthat person.\n\n(2)\n\nA photograph taken under subsection (1)\n\n(a)\n\n(b)\n\nmay only be used for the purpose of identification; and\n\nexcept where the person is charged, shall be destroyed by CWI within\n7 days of the completion or termination of CWC 2024.\n\nRequirement to state name and address\n\n22.(1)\nA police officer who suspects, on reasonable grounds, that a person\nin a CWC 2024 venue has committed, or has been involved in the commission\nof, a contravention of this Part may require the person to state his full name and\naddress.\n\nA person who fails, without reasonable cause to comply with a requirement\n(2)\nunder subsection (1) or who, in purported compliance with such a requirement,\nfurnishes information that the person knows to be false or misleading in a material\nparticular is guilty of an offence and is liable on summary conviction to a fine of\n$5 000 and may be\n\n(a)\n\n(b)\n\nordered by a police officer to leave the CWC 2024 venue; or\n\nremoved  from  the  CWC  2024  venue  by  a  police  officer  where  that\nperson refuses to comply with an order under paragraph (a).\n\n\f27\n\nPART III\n\nCONTROL OF ADVERTISING\n\nProhibition of certain advertisements on building and structures\n\nSubject to existing contractual rights, a person who is the owner or\n23.(1)\noccupier  of,  or  the  holder  of  a  lease  or  licence  relating  to  land,  a  building  or\nstructure  on  land  within  a  CWC  2024  venue  shall  not  cause  or  permit  any\nadvertisement or advertising material to be displayed or fixed to or placed on, or\nto remain on, the land, building or structure except as authorized in writing by\nCWI.\n\nCWI or an authorized person may erase or remove any advertisement or\n(2)\nadvertising  material  fixed  or  placed  on  any  land,  building  or  structure  in\ncontravention of subsection (1).\n\nIn exercising its powers under subsection (2), CWI shall take such steps\n\n(3)\nas are necessary to ensure that as little damage as possible is caused.\n\nCommercial broadcasting, telecasting, recording or filming\n\n24.(1)\nNo person shall, other than for personal use, broadcast, narrowcast,\ntelecast,  transmit,  record,  publish,  disseminate,  reproduce  or  circulate  by  any\nmeans, including without limitation utilizing\n\n(a)\n\n(b)\n\n(c)\n\ntelevision;\n\nradio;\n\nsatellite;\n\n(d)\n\nthe internet; or\n\n(e)\n\nany wireless service\n\nany audio, video, photograph, text or data or any other information relating to a\nCWC 2024 activity or any part of such activity, without the approval of CWI.\n\n\f28\n\nA person who contravenes subsection (1) is guilty of an offence and is\n\n(2)\nliable on summary conviction to a fine of $75 000.\n\nAn application for approval under this section shall be made to CWI in\n\n(3)\nsuch form and manner as may be determined by CWI.\n\nAny  approval  granted  under  subsection  (3)  shall  be  subject  to  such\n\n(4)\nconditions as CWI thinks fit.\n\nA  police  officer  may  take  possession  of  any  item  that  is  used  in\n\n(5)\ncontravention of this section if\n\n(a)\n\nthe police officer has directed, the person concerned to stop the use of\nthe article; and\n\n(b)\n\nthe person continues to use the article in contravention of this section.\n\n(6)\n\nA person who uses any article in contravention of this section may be\n\n(a)\n\n(b)\n\nordered by an authorized person to leave the CWC 2024 venue; or\n\nremoved from the CWC 2024 venue by a police officer, if that person\nrefuses to comply with an order under paragraph (a).\n\nThe  broadcasting,  telecasting,  recording  or  filming  of  any  information\n(7)\nrelating to a CWC 2024 activity for the purpose of provision of information or\nfor the purposes of criticism or review is not by itself sufficient to amount to a\ncontravention of subsection (1).\n\nA police officer on taking possession of an item under this section shall\n(8)\ngive the item to an authorized person who shall give a receipt to the person from\nwhom it was taken.\n\nThe receipt referred to in subsection (9) shall indicate the nature of the item\n(9)\nand the date and time when possession of it was taken by the authorized person.\n\n(10)\n\nThe item referred to in subsection (9) shall\n\n(a)\n\nbe lodged with CWI; and\n\n\f29\n\n(b)\n\nexcept where the person is charged, be available for collection within\n48 hours after possession of it is taken at such place as is notified to\nthe person from whom it was taken.\n\nProhibition of ambush marketing\n\nExcept  with  the  written  authorization  of  CWI,  a  person  shall  not\n25.(1)\nwilfully  broadcast,  display,  make,  publish  or  televise  any  advertisement,\ncommunication,  statement,  mark  or  image  or  cause  or  authorize  any\nadvertisement,  communication,  statement,  mark  or  image  to  be  broadcast,\ndisplayed, made, published, televised, or carried on, cause or authorize any other\nactivity which\n\n(a)\n\n(b)\n\nrelates to or is connected with CWC 2024;\n\nimplies or suggests a contractual or other connection or association of\nthat  person  with  CWC  2024  or  a  person  officially  associated  or\ninvolved in CWC 2024; and\n\n(c)\n\nis intended to\n\n(i)\n\n(ii)\n\nassociate that person with CWC 2024 or exploit the publicity or\ngoodwill of CWC 2024, in order for that person to gain a benefit\nof any kind;\n\ndiminish  the  status  of  an  official  sponsor,  official  supplier,\nofficial broadcaster or other licensee with regard to CWC 2024;\nor\n\n(iii)\n\nimply  that  the  person  is  an  official  sponsor,  official  supplier,\nofficial broadcaster or other licensee with regard to CWC 2024.\n\nNo person shall, in relation to CWC 2024, use or cause to be used, a mark,\n(2)\nimage, statement or brand in a manner calculated to achieve publicity for that\nmark, image, statement or brand with which that mark, image, statement or brand\nis associated and thereby deriving any special promotional benefit from CWC\n2024 without the prior authority of CWI.\n\n\f30\n\nFor the purpose of subsection (2), the use of a mark, image or statement\n\n(3)\nincludes\n\n(a)\n\n(b)\n\nany visual representation of the mark, image or statement upon or in\nrelation to goods or in relation to the rendering of services;\n\nany audible representation of the mark, image or statement in relation\nto goods or the rendering of services; or\n\n(c)\n\nthe use of the mark, image or statement in promotional activities\n\nwhich  in  any  way  directly  or  indirectly,  is  or  is  intended  to  be  brought  into\nassociation with, imply a connection with or allude to CWC 2024.\n\nA person who contravenes this section is guilty of an offence and is liable\n\n(4)\non summary conviction to a fine of $75 000.\n\nPromotional use of CWC 2024 tickets\n\nNo  person  shall  use  a  CWC  2024  ticket  in  relation  to  any  form  of\n26.(1)\ncommercial activity or as a prize in any lottery, competition, game or promotion\nwithout the prior written approval of CWI.\n\nA person who contravenes subsection (1) is guilty of an offence and is\n\n(2)\nliable on summary conviction to a fine of $40 000.\n\nPART IV\n\nPROTECTION OF CWC 2024 MARKS, INDICIA AND IMAGES\n\nProhibition of unauthorized use of CWC 2024 mark\n\n27.(1)\nauthorization of the owner of that mark.\n\nNo  person  shall  use  a  CWC  2024  mark  without  the  written\n\n\f31\n\n(2)\nRegistration by IBC of a CWC 2024 mark under the Trade Marks Act,\nCap. 319 shall vest in IBC, from the date of registration until 31st December, 2025\n\n(a)\n\n(b)\n\nthe right to its exclusive use in connection with the goods or services\nfor which they are registered; and\n\nthe exclusive right to prevent any other person from using any such\nmark without the authority of IBC.\n\nSubsection (2)(b) extends to the use of an identical or confusingly similar\n\n(3)\nmark in connection with goods or services where the use\n\n(a)\n\n(b)\n\nhas caused or is likely to cause confusion; or\n\ntakes unfair advantage of or is detrimental to, the distinctive character\nor the repute of a CWC 2024 mark.\n\nInfringement of mark of IBC, ICC, CWI etc\n\nThis  section  applies  to  goods,  material,  and  articles  described  in\n28.(1)\nsection 49C of the Trade Marks Act, Cap. 319 that infringe a CWC 2024 mark\nor any other mark of IBC, ICC or CWI.\n\n(2)\nA person who, with intent to gain for himself or another, or with intent to\ncause loss to another, and without the consent of the proprietor of the mark in\nquestion, buys, sells, imports or exports any goods to which this section applies\nis guilty of an offence and is liable on summary conviction to\n\n(a)\n\n(b)\n\nin the case of a first conviction, to a fine of $40 000; and\n\nin the case of a second or subsequent conviction, to a fine of $75 000.\n\nThe  provisions  of  Trade  Marks  Act,  Cap.  319  shall  apply  in  the\n\n(3)\ndetermination of whether or not a mark has been infringed.\n\nCWC 2024 indicia and images\n\n29.(1)\n\nFor the purposes of this Part\n\n\f“CWC 2024 indicia” means\n\n32\n\n(a)\n\n(b)\n\nany item set out in Part I of the Second Schedule; or\n\na  combination  of  any  of  the  items  listed  in  Part  II  of  the  Second\nSchedule,\n\nand where appropriate, includes a CWC 2024 mark;\n\n“CWC 2024 images” means any visual or aural representations or a combination\nof both that, to a reasonable person, in the circumstances of the presentation,\nwould suggest a connection with CWC 2024 including the picture, whether\nphotographic or otherwise, likeness or image of any squad member, squad\nor part of a squad and where appropriate, includes a CWC 2024 mark;\n\n“covering” includes packaging, frame, wrapper, container, stopper, lid or cap;\n\n“label” includes a band or ticket.\n\nCWC 2024 indicia that are represented in a language other than English\n\n(2)\nare to be taken to be CWC 2024 indicia.\n\nIndicia and images so closely resembling CWC 2024 indicia or CWC 2024\n(3)\nimages as are likely to be mistaken, by a reasonable person, shall be regarded as\nCWC 2024 indicia or CWC 2024 images.\n\nApplication of CWC 2024 indicia and images\n\n30.(1)\nare applied to goods or services if such indicia or images are\n\nFor the purposes of this Part, CWC 2024 indicia or CWC 2024 images\n\n(a)\n\nin the case of goods,\n\n(i)\n\n(ii)\n\nwoven in, impressed on, worked into, affixed or annexed to the\ngoods; or\n\napplied to any covering, document, label, reel or thing in or with\nwhich the goods are, or are intended to be, dealt with or provided\nin the course of trade or the promotion of trade; or\n\n\f(b)\n\nin the case of goods or services,\n\n33\n\n(i)\n\n(ii)\n\nused on a signboard or in an advertisement, including a television\nor radio advertisement, that promotes the goods or services; or\n\nused in an invoice, price list, catalogue, brochure, business letter,\nbusiness  paper  or  any  other  commercial  document  or  any\npromotional material that relates to the goods or services.\n\nFor the purposes of subsection (1), an advertisement promotes goods or\n\n(2)\nservices where\n\n(3)\n\n(a)\n\n(b)\n\nIf\n\n(a)\n\n(b)\n\nit promotes a particular person who provides goods or services; and\n\na reasonable person would conclude, that it was designed to enhance\nthe commercial image of the person referred to in paragraph (a).\n\ngoods are imported into Barbados for the purpose of sale or distribution\nby a person; and\n\nwhen imported, the goods have applied to them any CWC 2024 indicia\nor CWC 2024 images,\n\nthat person shall be taken to have applied the indicia or images to the goods.\n\nLicence to use CWC 2024 indicia or CWC 2024 images for commercial\npurposes\n\n31.(1)\nCWI or IBC may license a person to use all or any one or more of\nCWC  2024  indicia  or  CWC  2024  images  for  commercial  purposes  in  such\ncircumstances as may be determined by CWI or IBC.\n\nA  licensed  user  may  only  use  for  commercial  purposes  the  CWC  2024\n(2)\nindicia or CWC 2024 images that he is licensed to use and may only use such\nindicia or images in accordance with the licence.\n\n\f34\n\nProhibition of unlicensed use of CWC 2024 indicia or CWC 2024\nimages\n\n32.(1)\n\nNo person, other than CWI, IBC or a licensed user, shall use\n\n(a)\n\n(b)\n\nany CWC 2024 indicia listed in Part I of the Second Schedule; or\n\nany other CWC 2024 indicia or any CWC 2024 images\n\nfor commercial purposes.\n\nCWC  2024  indicia  or  CWC  2024  images  are  used  by  a  person  for\n\n(2)\ncommercial purposes if that person causes such indicia or images\n\n(a)\n\nto be applied to his goods or services\n\n(i)\n\nfor advertising or promotional purposes; or\n\n(ii)\n\nin a manner that is likely to enhance the demand for the goods or\nservices; and\n\n(b)\n\nto a reasonable person, the application would suggest that, that person\nis or was a sponsor of a CWC 2024 activity, or is or was associated or\nconnected with CWC 2024 or a CWC 2024 activity.\n\nWhere goods or services which have applied to them CWC indicia or CWC\n(3)\nimages are used for commercial purposes by a person other than CWI, IBC or a\nlicensed user, any person who\n\n(a)\n\n(b)\n\n(c)\n\nsupplies, or offers to supply, such goods or services;\n\nexposes such goods for supply; or\n\nkeeps such goods for supply, whether or not by him,\n\nshall be taken to have used the CWC 2024 indicia or images for commercial\npurposes.\n\n\f35\n\nProvision of information\n\nThe  use  of  a  CWC  2024  mark,  CWC  2024  indicia  or  CWC  2024\n33.\nimages for the purposes of, or in connection with, the provision of information\nor for the purposes of criticism or review is not by itself sufficient to\n\n(a)\n\n(b)\n\namount to a contravention of section 27; or\n\nsuggest  a  sponsorship,  or  the  provision  of  other  support,  for  the\npurposes of section 32(2)(b).\n\nPowers of custom officers in relation to certain imports\n\nWhere goods have applied to them any CWC 2024 mark, CWC 2024\n34.(1)\nindicia or CWC 2024 images which the importer is not authorized or licensed\nunder this Act to use for commercial purposes, a customs officer may detain the\ngoods for further investigation.\n\nGoods detained under this section shall be kept in such secure place as the\n\n(2)\nComptroller directs.\n\nNotice of detention\n\n35.(1)\nComptroller shall notify CWI or IBC of the detention.\n\nWhere goods have been detained or confiscated under section 34, the\n\nCWI, or IBC or a licensed user may, within 21 days of the receipt of the\n(2)\nnotice make an application for an injunction under section 39 and shall give the\nComptroller written notice of such application.\n\n\f36\n\nRelease of goods: no application for injunction\n\n36.(1)\n\nThe Comptroller shall release goods detained under section 34\n\n(a)\n\nunless within the period mentioned in section 35(2), CWI, IBC or a\nlicensed user has\n\n(i)\n\nmade an application for an injunction under section 39 in relation\nto the goods; and\n\n(ii)\n\ngiven to the Comptroller written notice of the application;\n\n(b)\n\nwhere CWI, IBC or if applicable the licensed user, has by written notice\nto the Comptroller consented to the release of the goods.\n\nExcept  where  the  Comptroller  has  been  notified  in  accordance  with\n(2)\nsubsection (1) that an application has been made in relation to the goods, the\nComptroller may, in his own determination, release the seized goods before the\nexpiration of the period mentioned in section 35(2) if the Comptroller, having\nregard  to  information  that  has  come  to  his  knowledge  after  the  goods  were\ndetained, does not have reasonable grounds for believing that section 27 or 32\nwould be contravened by the importation of the goods.\n\nPower of Comptroller to retain control of goods\n\n37.\nNothing  in  this  Part  authorizes  the  Comptroller  to  dispose  of  any\ndetained goods where the Comptroller is required or allowed to retain control of\nthe goods under any other law.\n\nPreservation of existing rights\n\n38.(1)\nimages, shall not affect rights conferred by law on a person in relation to\n\nThe provisions of this Act relating to CWC 2024 indicia or CWC 2024\n\n(a)\n\n(b)\n\na trademark that is registered under the Trade Marks Act, Cap. 319; or\n\nan  industrial  design  that  is  registered  under  the  Industrial  Designs\nAct, Cap. 309A\n\n\f37\n\nwhich was so registered before the commencement of this Act in relation to the\nindicia or image.\n\nNothing in this Act affects the use of the indicia or image by a person who,\n(2)\nbefore the commencement of this Act, was entitled to prevent another person\nfrom using the indicia or image or similar indicia or image, for the purpose of\npassing off.\n\nThis Act does not apply to the use of a business name in connection with\n\n(3)\na business where\n\n(a)\n\n(b)\n\nthe name is registered in relation to the business under the Registration\nof Business Names Act, Cap. 317; and\n\nthe name was so registered immediately before the commencement of\nthis Act in relation to the business.\n\nThis Act does not apply in relation to the use of the name of an incorporated\n\n(4)\ncompany where the company\n\n(a)\n\n(b)\n\n(c)\n\nwas in existence immediately before the date of commencement of this\nAct;\n\nuses the name in connection with a business carried on by the company;\nand\n\nused the name in connection with the business immediately before the\ncommencement of this Act.\n\n\f38\n\nPART V\n\nREMEDIES\n\nInjunctions\n\nWhere a person has engaged, is engaging, or is proposing to engage\n39.(1)\nin conduct in contravention of sections 7, 20, 23 to 26, 27, 28 and 32 the Court\nmay on application by CWI, IBC or a licensed user, grant an injunction\n\n(a)\n\n(b)\n\nrestraining the person from engaging in the conduct; and\n\nwhere,  in  the  Court's  opinion,  it  is  desirable  to  do  so,  requiring  the\nperson to take such action as the Court sees fit, including, in the case\nof a sign, the erasure or removal of the sign.\n\nThe Court may grant an interim injunction pending the determination of\n\n(2)\nan application under subsection (1).\n\nNothing in this Part limits or shall be construed as limiting any rights or\n\n(3)\nremedies available under the Trade Marks Act, Cap. 319.\n\n(4)\n\nFor the purpose of this Part \"Court\" means the High Court.\n\nCorrective advertisements\n\n40.\nWhere, on an application under section 39 the Court is satisfied that\na person has engaged in conduct constituting a contravention of section 27 or\n32, the Court may make an order requiring the person\n\n(a)\n\nby such means, including a broadcast or internet publication, as the\nCourt thinks fit;\n\n(b)\n\nat the person's own expense; and\n\n(c)\n\nat the times specified in the order,\n\nto publish advertisements, in accordance with the order.\n\n\f39\n\nDamages\n\nWhere CWI, IBC or a licensed user suffers loss or damage as a result\n41.\nof anything done in contravention of section 27 or 32 , the amount of the loss or\ndamage may be recovered by action in the Court.\n\nAccount of profits\n\nWhere, on the application of CWI, IBC or a licensed user, the Court\n42.\nis satisfied that a person has engaged in conduct in contravention of section 27 or\n32, the Court may make an order granting relief by way of an account of profits.\n\nLimitation\n\n43.\ncontravention of section 27 or 32, to both\n\nCWI, IBC or a licensed user is not entitled, in respect of the same\n\n(a)\n\n(b)\n\nthe recovery of loss or damages under section 41; and\n\ndamages based on an account of profits under section 42.\n\nDestruction or delivery of goods\n\nWhere, on the application of CWI, IBC or a licensed user, the Court\n44.(1)\nis satisfied that a person has contravened section 27 or 32 in relation to goods,\nthe Court may order that the goods be\n\n(a)\n\n(b)\n\n(c)\n\ndestroyed;\n\ndelivered up to CWI, IBC or to the licensed user; or\n\notherwise dealt with in such manner as the Court thinks fit.\n\nA Court may make an order under this section whether or not an injunction\n\n(2)\nis granted under section 39.\n\nWhere  the  Court  makes  an  order  under  this  section,  the  person  against\n\n(3)\nwhom the order is granted shall bear the expenses occasioned by the order.\n\n\f40\n\nOther remedies\n\n45.(1)\nprovided by any law\n\nThe remedies provided under this Part are in addition to any remedy\n\n(a)\n\nthat confers any rights or powers on CWI, IBC or a licensed user in\nrelation  to  conduct  of  a  kind  that  constitutes  a  contravention  of\nsection 27 or 32;\n\n(b)\n\nrelating to engaging in conduct that is misleading or deceptive and, in\nparticular, in relation to representations\n\n(i)\n\n(ii)\n\nthat goods or services have sponsorship or approval that they do\nnot have; or\n\nthat a corporation has a sponsorship, approval or affiliation that it\ndoes not have.\n\nThe  reference  in  subsection  (1)  to  particular  representations  does  not\n(2)\npreclude  the  application  of  any  law  to  conduct  of  a  kind  that  constitutes  a\ncontravention of section 27 or 32.\n\nThe Court may make any order, the effect of which would be to deprive\n(3)\nan  offender  of  any  economic  gain  from  the  goods  in  relation  to  which  the\ncontravention occurred.\n\nCompensation\n\n46.(1)\nWhere by virtue of any provision of this Act, any right of a person\nunder any law is infringed, that person is entitled to compensation as assessed by\nthe Court.\n\nIn determining claims for compensation for the infringement of any right\n\n(2)\nunder this Act, the Court may take into consideration\n\n(a)\n\nin the case of infringement of property rights, the market value of the\nproperty on the date of the infringement;\n\n\f41\n\n(b)\n\n(c)\n\n(d)\n\nany  damage  sustained  by  the  person  at  the  time  of  awarding\ncompensation;\n\nthe damage, if any, sustained by the person at the time of awarding\ncompensation by reason of the infringement affecting his other rights\nor his earnings; or\n\nif in the consequence of the infringement the person is compelled to\nchange  his  residence  or  place  of  business,  the  reasonable  expenses\nincidental to the change.\n\nThe Court in assessing compensation to be paid under subsection (1), shall\n\n(3)\nnot take into consideration\n\n(a)\n\n(b)\n\n(c)\n\nthe degree of urgency or necessity which has led to the infringement;\n\nany disinclination of the person to consent to the infringement; or\n\nany  damage  sustained  by  the  person  which,  if  caused  by  a  private\nperson, would not render the private person liable to an action.\n\nIn  determining  claims  for  compensation  for  infringement  of  property\n(4)\nrights, the Court shall have power to consider and award to the person in respect\nof  compensation  for  the  infringement,  in  addition  to  the  matters  specified  in\nsubsection (2), any sum not exceeding $10 000 000.\n\nNothing in this section limits or shall be construed as limiting any written\n\n(5)\nlaw respecting compensation for the infringement of rights.\n\nPART VI\n\nMISCELLANEOUS\n\nOffences by corporations\n\n47.(1)\nWhere an offence under this Act which has been committed by a body\ncorporate is proved to have been committed with the consent or connivance of,\n\n\f42\n\nor to be attributable to any neglect on the part of, a director, manager, secretary\nor other similar officer of the body corporate, or any person who was purporting\nto act in any such capacity, he as well as the body corporate, shall be guilty of\nthat offence and shall be liable to be proceeded against and punished accordingly.\n\nWhere  the  affairs  of  a  body  corporate  are  managed  by  its  members,\n(2)\nsubsection  (1)  shall  apply  in  relation  to  the  acts  and  defaults  of  a  member  in\nconnection with his functions of management as if he were a director of the body\ncorporate.\n\nRegulations\n\n48.(1)\n\nThe Minister may make regulations prescribing matters\n\n(a)\n\n(b)\n\nrequired or permitted by this Act to be prescribed; or\n\nfor carrying out or giving effect to this Act.\n\n(2)\n\nWithout limiting the generality of subsection (1),\n\n(a)\n\nthe regulations may provide for\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\nthe  organisation,  management  and  control  of  a  CWC  2024\nactivity and the carrying out of works or activities, or providing\nservices for the safe and orderly conduct of such CWC activity;\n\nthe control, management and use of a CWC 2024 venue and the\ncarrying out of works or activities or providing services in, on or\nnear a CWC 2024 venue for the safe and orderly management\nand use of the CWC 2024 venue;\n\nthe prohibition or regulation of entry into a CWC 2024 venue or\npart of such venue; or\n\nthe  prohibition  or  regulation  of  the  conduct  or  activities  of\npersons for the purpose of the safe and orderly conduct of CWC\n2024 activities or the safe and orderly use of a CWC 2024 venue;\nor\n\n\f43\n\n(b)\n\nthe Minister responsible for Immigration may pursuant to section 31\nof the Immigration Act, Cap. 190 make regulations with respect to\n\n(i)\n\nany visa or class of visas in respect of a person who requires a visa\nfor entry into and departure from Barbados; and\n\n(ii)\n\nany approval or document required for such purpose.\n\nReferences\n\n49.\n\nIn this Act, a reference to\n\n(a)\n\n\"the provision of information\" includes a reference to the reporting of\nnews and the presentation of current affairs; and\n\n(b)\n\n\"criticism\" or \"review\" includes a reference to criticism or review\n\n(i)\n\nin a newspaper, magazine or similar periodical;\n\n(ii)\n\nin a broadcast; or\n\n(iii)\n\nin a cinematograph film.\n\nAmendment by order schedules\n\n50.\n\nThe Minister may by order amend any of the Schedules to this Act.\n\nExpiry of Act\n\n51.\n\nThis Act expires on 30th June, 2024.\n\n\f44\n\nL.R.O. 1998FIRST SCHEDULE(Sections 18(1)(c) and 18(2)(b))PART IProhibited ItemsThe following items shall be prohibited at all CWC 2024 venues:1.Animals (other than service animals).2.Bicycles.3.Commercial Video/Photographic/Audio Equipment.4.Compressed gas cannisters and other ﬂ ammable items.5.Dangerous Items/Weapons (including but not limited to ﬁ rearms, explosive, knives,ﬂ ares, ﬁ reworks and laser pointers).6.Drones or unmanned aerial vehicles.7.Glass bottles or metal cans.8.Narcotics (other than prescribed).9.Oﬀ ensive or Political signage.10.Promotional or Commercial Material.\f45\n\n L.R.O. 1998First Schedule - (Concl'd)PART IIRestricted ItemsThe following items shall be restricted at all CWC 2024 venues:1. Coolers/lunch boxes larger than 30x30x30cm.2. Fold up chairs not intended for mounds.3. Large banners and ﬂ ags, ﬂ ag sticks above 1.6m in length.4. Musical instruments that cannot ﬁ t under your seat or on your lap or is louder than 70 dB.5. Tents/Umbrellas not intended for mounds.\f46\n\nL.R.O. 1998SECOND SCHEDULE(Sections 29(1)(a) and (b), 32(1)(a))PART ITwenty20 World CupT20 World CupWorld Cup CricketTwenty20 2024T20 2024Column IAntiguaAntigua and BarbudaBarbadosBarbudaCaribbeanGuyanaSt. LuciaSt. VincentSt. Vincent and the GrenadinesColumn IITwenty20 World CupT20 World CupWorld Cup CricketTwenty20 2024T20 2024PART IIAny combination of words, one part of which is from Column 1 and one part of which is from Column II.\f47\n\n L.R.O. 1998Column IThe GrenadinesTrinidadTrinidad and TobagoTobagoWest IndiesWindiesColumn IIPART II - (Cont'd)Second Schedule - (Cont'd)\f48\n\n L.R.O. 1998Column ICricket VenuesAntigua Recreational GroundArnos Vale Cricket GroundArnos Vale 2Bourda Cricket GroundBrian Lara Cricket AcademyCoolidge Cricket GroundDarren Sammy Cricket GroundDiego Martin Sporting ComplexEverest Cricket Ground Gros Islet Cricket FieldGuyana National StadiumGuyana Police Force Cricket GroundKensington OvalMindoo Philip ParkPolice Sports Club Cricket Ground at WeymouthQueens Park OvalSion Hill Cricket GroundSir Frank Worrel Cricket Ground (UWI Spec)Sir Vivian Richards StadiumThree W's Oval Windward Cricket GroundSecond Schedule - (Concl'd)Column II\f49\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}