{
  "bill_id": 774,
  "slug": "visiting-police-forces-icc-cricket-world-cup-2024-bill-2024",
  "title": "Visiting Police Forces (ICC Cricket World Cup 2024) Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/35406b279fed12a1748c246eefbd604e.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-04-24",
  "first_reading": "2024-05-03",
  "gazette_date": "2024-04-29",
  "markdown": "2024-04-15\n\nOBJECTS AND REASONS\n\nThis  Bill  would  regulate  the  performance  of  official  duties  in  Barbados  by\nmembers of police forces visiting Barbados and civilian personnel attached to\nthose forces during the period of Cricket World Cup, 2024 and for related matters.\n\n\f2\n\nArrangement of Sections\n\nPreliminary\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nApplication of the Act\n\nShort title\n\nInterpretation\n\nAct to bind the State\n\nApplication\n\nDesignated States\n\nOperational direction\n\nPowers and Immunities of Visiting Police Forces\n\nStatus of members of visiting police forces\n\nImmunity from prosecution\n\nJurisdiction\n\n9.\n\nCriminal Jurisdiction\n\n10.\n\nCertificate concerning official duty\n\n11.\n\nTrial by court having primary right\n\n12.\n\nFirearms\n\n\f3\n\nClaims Against Visiting Police Forces\n\n13.\n\nClaims against designated States\n\n14.\n\nEnforcement of judgement\n\n15.\n\nShips\n\n16.\n\nOfficial duty\n\n17.\n\nArbitration\n\n18.\n\nTax and residence\n\n19.\n\nSalaries\n\n20.\n\nService vehicle\n\nTaxation\n\n21.\n\nCustoms duties and other taxes\n\n22.\n\nEnactments relating to the police service\n\nMiscellaneous\n\n23.\n\nCoroner’s inquest\n\n24.\n\nExpiry of Act\n\nSCHEDULE\n\nDesignated States\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  regulate  the  performance  of  official  duties  in  Barbados  by\nmembers of police forces visiting Barbados and civilian personnel attached to\nthose  forces  during  the  period  of  Cricket  World  Cup,  2024  and  for  related\nmatters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPreliminary\n\nShort title\n\n1.\nWorld Cup 2024) Act, 2024.\n\nThis  Act  may  be  cited  as  the  Visiting  Police  Forces  (ICC  Cricket\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“CARICOM”  means  the  Caribbean  Community  established  by  the  Revised\n\nTreaty of Chaguaramas signed in the Bahamas on 5th July, 2001;\n\n“civilian personnel” means the civilian component of a visiting police force;\n\n“Commissioner” means the Commissioner of Police of Barbados;\n\n“court” means a court of ordinary criminal jurisdiction in Barbados and includes\n\na court of summary jurisdiction;\n\n“designated state” means a state that is designated under section 5;\n\n“Police Service” means the Barbados Police Service;\n\n“Member State” means a Member State of CARICOM;\n\n“Treaty on Security Assistance” or “the Treaty” means the Treaty on Security\nAssistance among CARICOM Member States signed at Basseterre in St.\nKitts and Nevis on 6th July, 2006, including any amendments or protocols\nthereto;\n\n“visiting police force” means the members of any police force of a designated\nstate present in Barbados in connection with official duties for the purposes\nof this Act.\n\n\f7\n\nApplication of the Act\n\nAct to bind the State\n\n3.\n\nThis Act binds the State.\n\nApplication\n\n4.\npersonnel of a state designated pursuant to section 5.\n\nThis Act applies in respect of visiting police forces and the civilian\n\nDesignated States\n\n5.(1)\npurposes of this Act.\n\nThe  countries  listed  in  the  Schedule  are  designated  states  for  the\n\n(2)\n\nThe Minister may by order amend the Schedule.\n\nOperational direction\n\nFor the purposes of this Act and Article 10 1.(a) of the Treaty, the\n6.\nCommissioner shall be responsible for the operational direction of the visiting\npolice forces.\n\nPowers and Immunities of Visiting Police Forces\n\nStatus of members of visiting police forces\n\n7.(1)\nAny  member  of  a  visiting  police  force  who  is  sent  to  Barbados  to\nperform  police  duties  similar  to  duties  performed  by  him  in  his  State  during\nCricket World Cup, 2024 shall, while on duty in Barbados, perform the same\nduties under and in accordance with the directions of the Commissioner in the\nsame manner and in all respects as if he were a member of the Police Service.\n\nSubject to this Act, the members of a visiting police force shall have the\n(2)\nsame  rights,  powers,  privileges  and  immunities  as  are  conferred  by  law  on\n\n\f8\n\nmembers of the Police Service as may be necessary for the performance of their\nduties.\n\nImmunity from prosecution\n\n8.(1)\nNotwithstanding section 7(2), the members of a visiting police force\nshall be immune from prosecution in criminal court proceedings in Barbados in\nrespect of actions taken in the course of their official duties.\n\nThe immunity specified in subsection (1) may be waived in respect of any\n(2)\nmember of a visiting police force, by the competent authority of the designated\nstate of the visiting police force.\n\nJurisdiction\n\nCriminal Jurisdiction\n\nSubject to subsection (2) and section 8, the court has the primary right\n9.(1)\nto exercise jurisdiction in respect of any act that constitutes an offence against\nany law in force in Barbados that is committed by a member of a visiting police\nforce.\n\nWith respect to the alleged commission of an offence by a member of a\n\n(2)\nvisiting police force in relation to\n\n(a)\n\n(b)\n\nthe property or security of the designated state; or\n\nthe person or property of another member of the visiting police force,\n\nthe  competent  court  of  the  relevant  designated  state  has  the  primary  right  to\nexercise jurisdiction.\n\nCertificate concerning official duty\n\n10.\nA certificate of the Commissioner that anything alleged to have been\ndone by a member of a visiting police force of a designated state was or was not\ndone in the performance of official duty, is receivable in evidence in any court\nand for the purposes of this Act is prima facie proof of that fact.\n\n\f9\n\nTrial by court having primary right\n\nWhere under section 9 a competent court of a designated state has the\n11.\nprimary right to exercise jurisdiction, the court having the primary right has the\nright to deal with charges against alleged offenders in the first instance, but that\nright may be waived by the designated state.\n\nFirearms\n\n12.\nMembers of a visiting police force acting in the course of their duties,\nmay, if authorized to do so by the Commissioner, possess and carry explosives,\nammunition and firearms.\n\nClaims Against Visiting Police Forces\n\nClaims against designated States\n\n13.\n\nFor the purposes of the Crown Proceedings Act, Cap. 197\n\n(a)\n\na tort committed by a member of a visiting police force while acting\nwithin the scope of his official duties or employment shall be deemed\nto have been committed by a public officer within the meaning of the\nsection 2 of the Public Service Act, Cap. 29 while acting within the\nscope of his official duties or employment;\n\n(b)\n\nproperty owned, occupied, possessed or controlled by a visiting police\nforce shall be deemed to be owned, occupied, possessed or controlled\nby the State; and\n\n(c)\n\na service motor vehicle of a visiting police force shall be deemed to be\nowned by the State.\n\nEnforcement of judgement\n\n14.\nA member of a visiting police force is not subject to any proceedings\nfor the enforcement of any judgment given against him in Barbados in respect of\n\n\f10\n\na matter that arose while he was acting within the scope of his official duties or\nemployment.\n\nShips\n\n15.\nExcept  where  section  13  may  be  made  applicable  by  order  of  the\nMinister in respect of the ships of any particular designated state, that section\ndoes not apply to a claim arising out of or in connection with the navigation,\noperation or salvage of a ship or the loading, carriage or discharge of cargo, unless\nthe claim is a claim arising out of death or injury to the person.\n\nOfficial duty\n\n16.\nparties arises under sections 13 to 17 as to whether\n\nWhere a question that cannot be settled by negotiation between the\n\n(a)\n\n(b)\n\na member of a visiting police force was acting within the scope of his\nofficial duties or employment; or\n\na matter in respect of which judgment was given against a member of\na visiting police force arose while he was acting within the scope of\nhis official duties or employment,\n\nthe  question  must  be  submitted  to  an  arbitrator  appointed  in  accordance  with\nsection 17, and for the purposes of sections 13 to 17, the decision of the arbitrator\nis final and conclusive.\n\nArbitration\n\n17.(1)\nAn  arbitrator  must  be  appointed  for  the  purposes  of  section  16  by\nagreement between the designated state concerned and Barbados from among\nthe nationals of Barbados who hold or have held high judicial office.\n\nIf the designated state and Barbados are unable, within 2 months, to agree\n(2)\nupon an arbitrator, either the designated state or Barbados may request any person\ndesignated  in  an  agreement  with  the  designated  state  or  acceptable  to  the\n\n\f11\n\ndesignated state and Barbados to appoint the arbitrator from among the nationals\nof Barbados who have held high judicial office.\n\nTaxation\n\nTax and residence\n\nWhere the liability for any form of taxation in Barbados depends upon\n18.\nresidence or domicile, a period during which a member of a visiting police force\nis in Barbados by reason of his being a member of the visiting police force shall,\nfor the purposes of that taxation, be deemed not to be a period of residence in\nBarbados and not to create a change of residence or domicile.\n\nSalaries\n\n19.(1)\nA  member  of  a  visiting  police  force  is  exempt  from  taxation  in\nBarbados on the salary and emoluments paid to him as a member of a visiting\npolice force by a designated state and in respect of any tangible movable property\nthat is in Barbados temporarily by reason of his presence in Barbados in that\ncapacity.\n\nFor the purposes of section 18 and this section, the term \"member of a\n(2)\nvisiting police force\" does not include a citizen of Barbados who is resident or\nordinarily resident in Barbados.\n\nService vehicle\n\n20.\nNo tax or fee is payable in respect of the licensing or registration of\nservice vehicles of a visiting police force or in respect of the use of those vehicles\non any road in Barbados.\n\nCustoms duties and other taxes\n\n21.(1)\nA  visiting  police  force  may  import  into  Barbados,  equipment,\nprovisions, supplies and other goods for the exclusive use of the visiting police\nforce free of customs duty and any tax.\n\n\f12\n\n(2)\nA member of a visiting police force may, at the time of his first arrival to\ntake up service in Barbados, import his personal effects free of customs duty and\nany tax.\n\n(3)\nNo customs duty or any tax is payable on any fuel, oil or lubricants intended\nfor use exclusively in the service vehicles, aircraft or vessels of a visiting police\nforce during the performance of the official duties of the members of the visiting\npolice force.\n\nMiscellaneous\n\nEnactments relating to the police service\n\n22.(1)\nor person,\n\n(a)\n\n(b)\n\nWhere under any enactment a power is exercisable by any authority\n\nrespecting the Police Service, its members, or any person connected\ntherewith; or\n\nrespecting any property used or to be used for the purposes of the Police\nService, or for taking possession of any property to be so used, or for\nacquiring, whether by agreement or compulsorily, any property so used\nor to be so used,\n\nthe Minister may by order provide that the power be exercisable by that authority\nor person, as the case may be, in the case of a visiting police force to any extent\nto which it would be exercisable if the visiting police force were a part of the\nPolice Service.\n\n(2)\n\nThe Minister may by order\n\n(a)\n\nexempt  a  visiting  police  force  or  its  members,  any  other  person\nconnected therewith or any property used or to be used for the purposes\nthereof from the operation of any enactment specified in the order to\nany extent to which the force, members, persons or property would be,\nor would be capable of being exempted, if the visiting police force were\na part of the Police Service; and\n\n\f13\n\n(b)\n\nconfer on that visiting police force or any members, persons or property\nreferred to in paragraph (a) any other privilege or immunity specified\nin the order, being a privilege or immunity that would be enjoyed by\nor would be capable of being conferred on the visiting police force,\nmembers,  persons  or  property,  if  the  force  were  part  of  the  Police\nService.\n\nWhere under any enactment the doing of anything is prohibited, restricted\n\n(3)\nor required in relation to\n\n(a)\n\nthe  Police  Service,  its  members,  or  any  other  person  connected\ntherewith; or\n\n(b)\n\nany property used or to be used for the purposes of the Police Service,\n\nthe Minister may by order extend the prohibition, restriction or requirement to\nany visiting police force in the same manner as if the visiting police force were\na part of the Police Service.\n\nAn  order  made  under  this  section  may  contain  such  incidental,\n(4)\nconsequential and supplementary provisions as the Minister thinks necessary for\nthe purposes of the order, including provisions for applying, modifying, adapting\nor suspending any enactment.\n\nSubsections  (1)  and  (4)  apply  whether  the  power  is  exercisable,  or  the\n(5)\nprohibition,  restriction  or  requirement  is  imposed,  by  a  provision  expressly\nrelating to the Police Service or by a more general provision; and subsection (3)\napplies whether the exemption, privilege or immunity subsists, or is capable of\nbeing conferred, by virtue of such a provision or by reason of any enactment not\nbinding the State.\n\nCoroner’s inquest\n\n23.(1)\nWhere a coroner who has jurisdiction to hold a coroner's inquest into\na death is satisfied that the deceased person at the time of his death had a relevant\nassociation  with  a  visiting  police  force,  then,  unless  the  President  otherwise\n\n\f14\n\ndirects, the coroner may not hold the inquest, or, if the coroner has started the\ninquest but has not completed it, the coroner shall adjourn the inquest.\n\nSubject to subsection (1), a coroner referred to in that subsection shall,\n(2)\nunless  the  President  otherwise  directs,  adjourn  the  inquest  if  the  coroner  is\nsatisfied\n\n(a)\n\nthat a person who is subject to the jurisdiction of the competent courts\nof  a  designated  state  has  been  charged  before  such  court  with  the\nhomicide of the deceased person referred to in subsection (1), whether\nor not that charge has been dealt with; or\n\n(b)\n\nthat  a  person  referred  to  in  paragraph  (a)  is  being  detained  by  an\nauthority of a visiting police force with a view to being so charged.\n\nWhere an inquest is adjourned under this section, the coroner may resume\n\n(3)\nthe inquest only on the direction of the President.\n\nWhere an inquest that was adjourned under this section is resumed, the\n(4)\ncoroner shall proceed in all respects as if the inquest had not been previously\nbegun.\n\n(5)\n\nIn this section,\n\n(a)\n\n\"homicide\"  includes  murder,  manslaughter,  infanticide  and  any\noffence under the law of the country in question that is analogous to\nany of those offences;\n\n(b)\n\nreferences  to  a  person  having  a  relevant  association  with  a  visiting\npolice force are references to his being at the time\n\n(i)\n\n(ii)\n\na member of the visiting police force or a member of a civilian\ncomponent of that force; or\n\na  person  who,  not  being  a  citizen  of  Barbados  or  a  permanent\nresident  thereof  within  the  meaning  of  the  Immigration  Act,\nCap. 190, is a member of the visiting police force or of a civilian\ncomponent of that force.\n\n\f15\n\n(6)\nIn determining for the purposes of this section whether a person is, or was\nat any time, a permanent resident of Barbados, no account shall be taken of any\nperiod during which he has been, or intends to be present in Barbados,\n\n(a)\n\n(b)\n\nas a member of a visiting police force or of a civilian component of\nsuch a force; or\n\nas a dependant of a member of a visiting police force or of a civilian\ncomponent of such a force.\n\nExpiry of Act\n\n24.\n\nThis Act expires on 30th June, 2024.\n\n\f16\n\nSCHEDULE\n\nDesignated States\n\n(Section 5(1))\n\nMember States of the Caribbean Community\n\nAssociate Members states of the Caribbean Community\n\nSouth Africa\n\nCanada\n\nUnited Kingdom\n\nFrance\n\nThe Netherlands Antilles\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n\f17\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}