{
  "bill_id": 783,
  "slug": "notaries-public-bill-2024",
  "title": "Notaries Public Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/ceaacba7252a7006b63daf9d25540d1b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-05-08",
  "first_reading": "2024-05-15",
  "gazette_date": "2024-03-11",
  "markdown": "2024-03-28\n\nOBJECTS AND REASONS\n\nThis Bill would revise the law relating to the appointment and regulation of\n\nNotaries Public in Barbados and provide for related matters.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nInterpretation\n\nAppointment as a notary public\n\nApplication and authorisation to be appointed as Notary public\n\nAppointment of notary public\n\nNotary Public Certificate\n\nRoll of notaries public\n\nRenewal and payment of fees\n\nNotarial acts\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nFees\n\n11.\n\nProceedings for misconduct: suspension or revocation\n\n12.\n\nNotarial Acts Register\n\n13.\n\nDuty to notify Registrar of changes and events\n\n14.\n\nPower to obtain information\n\n15.\n\nPenalty for misfeasance\n\n\f3\n\n16.\n\nOffences\n\n17.\n\nRegulations\n\n18.\n\nAmendment of Schedules\n\n19.\n\nRepeal of Act 2017–9\n\n20.\n\nCommencement\n\n\f4\n\nFIRST SCHEDULE\n\nNotaries Public - Ex Officio\n\nSECOND SCHEDULE\n\nNotary Public Application\n\nTHIRD SCHEDULE\n\nImpression of Notarial Seal\n\nFOURTH SCHEDULE\n\nForm of Oath\n\nFIFTH SCHEDULE\n\nApplication, Registration and Renewal Fees\n\nSIXTH SCHEDULE\n\nNotary Public Certificate\n\nSEVENTH SCHEDULE\n\nNotarial Acts and Fees\n\nEIGHTH SCHEDULE\n\nNotarial Acts Register\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  revise  the  law  relating  to  the  appointment  and  regulation  of\n\nNotaries Public in Barbados and provide for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\nShort title\n\n1.\n\nThis Act may be cited as the Notaries Public Act, 2024.\n\n\f6\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“attorney-at-law” has the meaning assigned to it by the Legal Profession Act,\n\nCap. 370A;\n\n“Minister” means the Minister responsible for notaries public;\n\n“Registrar” means the Registrar of the Supreme Court.\n\nAppointment as a notary public\n\n3.(1)\nrequirements for appointment under this Act.\n\nA  person  may  be  appointed  as  a  notary  public  if  he  satisfies  the\n\nAny  person  holding  or  acting  in  a  public  office  specified  in  the  First\n\n(2)\nSchedule shall be ex officio a notary public for Barbados.\n\n(3)\n\nA person may be appointed as a notary public if that person\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nis a citizen or permanent resident of Barbados;\n\nis  the  holder  of  a  CARICOM  Skilled  National  Certificate  and  is\nordinarily resident in Barbados;\n\nhas never been convicted of an offence punishable by imprisonment;\n\nhas never been found guilty of any act that constitutes misconduct in\na professional respect or misconduct under this Act;\n\n(e)\n\nhas not been adjudged bankrupt; and\n\n(f)\n\nmeets any of the criteria specified in this section.\n\nA person referred to in subsection (3) is eligible for appointment if that\n\n(4)\nperson\n\n(a)\n\nis an attorney-at-law\n\n(i)\n\nwho has been practising law in Barbados for at least 15 years; and\n\n\f7\n\n(ii)\n\nwho is in good standing with the Barbados Bar Association; or\n\n(b)\n\nis a certified public or chartered accountant\n\n(i)\n\nwho has been practising in Barbados for at least 15 years; and\n\n(ii)\n\nwho is in good standing with a recognised accounting body.\n\n(c)\n\npossesses  at  least  15  years  professional  or  business  experience  in\nBarbados and is of good character.\n\nEvery  person  other  than  an  attorney-at-law  shall  complete  a  course  of\n\n(5)\ntraining prescribed by the Attorney-General.\n\nApplication and authorisation to be appointed as Notary public\n\nSubject  to  subsection  3,  a  person  who  wishes  to  be  appointed  as  a\n4.(1)\nnotary public shall submit an application in writing to the Registrar in the form\nset out in the Second Schedule.\n\nAn application made under subsection (1), shall be accompanied by the\n\n(2)\nfollowing documents:\n\n(a)\n\n(b)\n\nproof of the applicant’s citizenship or permanent residence;\n\n2 character references, one from among the following persons:\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\nan employer or former employer;\n\na Justice of the peace;\n\na notary public;\n\na minister of religion;\n\na police officer of the rank of inspector or above,\n\n(vi)\n\na certified public or chartered accountant;\n\n(vii)\n\nan attorney-at-law;\n\n(viii)\n\na medical doctor; or\n\n(ix)\n\na member of Parliament.\n\n\f8\n\n(c)\n\n(d)\n\na police certificate of character issued within 3 months of the date of\nthe application;\n\na photograph of the applicant, certified by any one of the persons listed\nat paragraph (b) to be a true likeness of the applicant;\n\n(e)\n\nproof of admission to practise law in Barbados;\n\n(f)\n\nproof  of  qualification  as  a  certified  public  accountant  or  chartered\naccountant; and\n\n(g)\n\nany other information that the Registrar may require.\n\nThe Registrar shall, upon receipt of the application, review the application\n(3)\nand if satisfied that he is fit for appointment, appoint the applicant or if not so\nsatisfied refuse to appoint him.\n\nAppointment of notary public\n\n5.(1)\n\nOn receipt of the application, pursuant to\n\n(a)\n\nsection 4(3)(a) and upon the applicant subscribing to the oath set out\nin the Fourth Schedule, the Registrar may appoint the applicant; or\n\n(b)\n\nsection 4(3)(b) refuse to appoint the applicant.\n\nIf the Registrar refuses to appoint an applicant, the Registrar shall inform\n\n(2)\nthe applicant giving the applicant the reasons for refusal.\n\nEvery person appointed as a notary public shall deposit with the Registrar\n(3)\nan  impression  of  the  embossed  notarial  seal,  in  the  form  set  out  in  the  Third\nSchedule, to be used by him in his capacity as notary public and pay the prescribed\nfee to the Registrar.\n\nNotary Public Certificate\n\n6.(1)\nUpon  appointment  as  a  notary  public,  and  the  payment  of  the\nregistration fee set out in the Fifth Schedule, the Registrar shall issue a Notary\nPublic Certificate to the person appointed a notary public, in the form set out in\nthe Sixth Schedule.\n\n\f9\n\nThe Notary Public Certificate referred to in subsection (1) shall be valid\n\n(2)\nuntil the 31st day of January in the following year in which it was issued.\n\n(3)\n\nThe Registrar shall cause to be published in the Official Gazette,\n\n(a)\n\n(b)\n\nin the month of February in every year, an alphabetical list of persons\nwho  have  at  the  31st January  in  that  year  obtained  a  Notary  Public\nCertificate;\n\nas soon as practicable after he obtains a Notary Public Certificate, the\nname  of  any  person  obtaining  a  Notary  Public  Certificate  after  the\n31st January in any year.\n\nRoll of notaries public\n\nThe Registrar shall keep a register, which may be in an electronic form,\n7.(1)\nto be known as the “Register of Notaries Public” in which the Registrar shall\nregister\n\n(a)\n\n(b)\n\n(c)\n\nthe name of every person appointed as a notary public under this Act;\n\nthe date of appointment of the person;\n\nthe address of the person; and\n\n(d)\n\nthe profession of the person.\n\nThe  Registrar  shall  endorse  the  Register  of  Notaries  Public  with  an\n\n(2)\nappropriate notation if an appointment\n\n(a)\n\n(b)\n\nlapses under section 8;\n\nlapses by virtue of the notary public’s residency outside of Barbados\nfor more than 12 months; or\n\n(c)\n\nis suspended or renewed.\n\nThe Registrar shall remove from the roll, the name of any person whose\n\n(3)\nappointment has been revoked under this Act.\n\n\f10\n\nThe  Registrar  shall  cause  to  be  published  annually,  a  list  of  all  current\n\n(4)\nnotaries public in the Official Gazette and any relevant Government websites.\n\nRenewal and payment of fees\n\n8.(1)\nA notary public shall, on or before the 31st day of January in each year\nfollowing the year of his first appointment, pay the prescribed annual renewal\nfee as set out in the Fifth Schedule.\n\nWhere a notary public fails to pay the prescribed renewal fee by the date\n(2)\nspecified in subsection (1), his appointment as a notary public shall lapse and he\nshall cease to perform any notarial act.\n\nSubject to subsection (5), a notary public may pay an annual renewal fee\n\n(3)\nat a later date, with an additional penalty equal to one-half of the annual fee.\n\nUpon  payment  of  the  penalty  and  the  fee  subsection  (3),  the  lapsed\n(4)\nappointment shall be reinstated and an endorsement for renewal made on the date\nof the payment.\n\nWhere an appointment lapses for a period of more than 6 months, without\n\n(5)\nreasonable cause or excuse, the notary public’s appointment shall be revoked.\n\nNotarial acts\n\n9.(1)\n\nA notary public may perform\n\n(a)\n\n(b)\n\nthe notarial acts set out in the column I of the Seventh Schedule;\n\nany act that is required to be performed by a notary public\n\n(i)\n\nunder any other enactment; and\n\n(ii)\n\nin accordance with the provisions of any treaty or agreement to\nwhich Barbados is a party; or\n\n(c)\n\nall the powers and authorities exercisable by custom to a notary public.\n\nNotwithstanding the requirement in law to exercise the powers of a notary\n(2)\npublic in the physical presence of an individual, regulations made under this Act\n\n\f11\n\nmay prescribe the conditions for the notary public to exercise his notarial powers\nremotely.\n\nIn any case where the circumstances surrounding a request for the notary\n(3)\npublic to do any act referred to in subsection (1) appears suspicious, the notary\npublic shall refuse to act.\n\nWhen any notarial act shall be refused to be noted or done, the notary public\n(4)\nso refusing shall mark in the logbook, bill of exchange or other document, his\nrefusal with his signature and the date of refusal subscribed thereon.\n\nA person aggrieved by the refusal of a notary public to perform a notarial\n\n(5)\nact may apply to Registrar for a review of the notary public’s refusal.\n\nFees\n\n10.(1)\nthe Seventh Schedule, the fee set out in column II of that Schedule.\n\nA notary public shall charge for each notarial act set out in column I\n\nA notary public who charges a high fee than that prescribed for a notarial\n\n(2)\nact commits an act of misconduct.\n\nAll fees collected by a notary public who is a public officer listed in the\n\n(3)\nFirst Schedule, shall be paid into the Consolidated Fund.\n\nNotwithstanding subsection (1), a notary public, other than a notary public\n(4)\nex officio, may waive the fee set out in the Seventh Schedule for any notarial act\ndone.\n\nThe sum set out in the Seventh Schedule shall apply notwithstanding any\n\n(5)\nenactment providing for a different sum for that notarial act.\n\nProceedings for misconduct: suspension or revocation\n\n11.(1)\nRegistrar if the notary public\n\nThe  appointment  of  a  notary  public  may  be  suspended  by  the\n\n(a)\n\nallows his name to be used by another person to perform notarial acts;\n\n\f12\n\n(b)\n\ncharges or accepts a fee for a notarial act in contravention of section 9;\nor\n\n(c)\n\nfails to file a notice in accordance with section 13, with the Registrar.\n\nThe appointment of a notary public may be revoked, if the notary public\n\n(2)\nis\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nconvicted of an offence punishable by imprisonment;\n\nadjudged bankrupt;\n\ndeemed  unfit  and  the  High  Court  has  made  an  order  appointing  a\nreceiver for that notary public; or\n\nfound  guilty  of  any  act  that  constitutes  misconduct  whether  in  his\ncapacity as a notary public or in his profession or occupation; or\n\n(e)\n\nhas been or has been found negligent in the discharge of his duty;\n\n(2)\n\nWhere the appointment of notary public is\n\n(a)\n\n(b)\n\nsuspended; or\n\nrevoked,\n\nthe Registrar shall endorse a notation of the suspension in the Register of Notaries\nPublic or remove the name of the notary public from the register, as the case may\nbe.\n\nA person who has reason to believe that a notary public has committed an\n(3)\nact of misconduct, may make a complaint on oath to the Registrar setting out the\nnature of the alleged misconduct.\n\nThe Registrar shall refer the complaint referred to in subsection (3) to the\n\n(4)\nAttorney General.\n\nThe Attorney General shall investigate the complaint made in accordance\n(5)\nwith subsection (3) and report his findings to the Registrar and give the Registrar\nsuch  directions  as  the  Attorney  General  deems  fit  and  the  Registrar  shall\nfollowing those directions.\n\n\f13\n\n(6)\nNotwithstanding  subsections  (1)  to  (6),  the  Registrar  may  revoke  the\nappointment of any notary public if the Registrar has reasonable cause to believe\nthat the notary public is unfit, incapable or incompetent to carry out the duties of\nthe office.\n\nWhere a notary’s public appointment has been suspended or revoked, the\n(7)\nRegistrar shall cause a notice of the suspension or revocation to be published in\nthe Official Gazette and by any other means that would bring it to the attention\nof members of the public.\n\nA notary public who is aggrieved by a decision of the Registrar given under\n\n(8)\nsubsection (6) may appeal to the Attorney General.\n\nNotarial Acts Register\n\nEvery notary public shall keep and maintain a register to be called a\n12.(1)\n“Notarial Acts Register” in the form set out in the Eighth Schedule in which he\nshall record the details of every notarial act done by him and shall preserve the\nrecord for a period of at least 7 years from the execution of the act.\n\n(2)\n\nA notary public whose appointment has\n\n(a)\n\n(b)\n\n(c)\n\nlapsed;\n\nbeen suspended; or\n\nbeen revoked,\n\nshall within 14 days of the date of the lapse, suspension or revocation, as the case\nmay be, deliver all Notarial Acts Registers in his possession to the Registrar.\n\nA  person  who,  not  being  a  notary  public,  comes  into  possession  of  a\n\n(3)\nNotarial Acts Register shall immediately deliver the Register to the Registrar.\n\nA notary public or any other person who contravenes this section is guilty\n\n(4)\nof an offence and is liable to a fine of $1 000.\n\n\f14\n\nDuty to notify Registrar of changes and events\n\n13.(1)\nfollowing events, notify the Registrar in writing of\n\nA notary public shall, within 30 days of the occurrence of any of the\n\n(a)\n\na change to his name under the Change of Name Act, Cap. 212A or\nunder any other enactment;\n\n(b)\n\na change of his address;\n\n(c)\n\na change of his status, nationality or permanent resident; and\n\n(d)\n\na change of his profession or occupation.\n\nA notary public shall, with 7 days of the occurrence of any of the following\n\n(2)\nevents, notify the Registrar in writing\n\n(a)\n\n(b)\n\nif he is convicted of an offence punishable by imprisonment;\n\nof the decision by a professional body that he is guilty of professional\nmisconduct; or\n\n(c)\n\nof an adjudication that he is bankrupt.\n\nThe Registrar shall revoke the appointment of a notary public to whom\n\n(3)\nsubsection (2), applies.\n\nPower to obtain information\n\nThe Registrar may, for the purpose of ascertaining whether a notary\n14.\npublic is in compliance with this Act, and the conditions of his appointment, by\nnotice in writing require the notary public to\n\n(a)\n\n(b)\n\nfurnish the information required to be kept by the notary public under\nsection 7(1);\n\nproduce a copy of the Notarial Acts Register required to be kept by the\nnotary public under section 11; and\n\n(c)\n\nproduce any other information that the Registrar requires.\n\n\f15\n\nPenalty for misfeasance\n\n15.\n\nAny notary public who\n\n(a)\n\n(b)\n\nwilfully certifies or propounds any false statement or document; or\n\nfraudulently or with intent to deceive, conceals, withholds or perverts\nany fact pertinent to the subject of a notarial act,\n\nis guilty of an offence and is liable on summary conviction to a fine of $10 000\nor to imprisonment for a term of 3 years or to both and in addition, the Registrar\nshall revoke his appointment.\n\nOffences\n\n16.(1)\n\nA person who\n\n(a)\n\n(b)\n\nperforms any notarial act without having been appointed as a notary\nunder this Act; or\n\nholds himself out to be a notary public or receives any fees or reward\nas a notary public,\n\nwithout having been appointed as a notary public is guilty of an offence and is\nliable on summary conviction to a fine of $10 000 or to imprisonment for a term\nof 3 years or to both.\n\nA notary public who performs any notarial act while his appointment has\n(2)\nbeen  suspended  or  revoked  is  guilty  of  an  offence  and  is  liable  on  summary\nconviction to a fine of $10 000 or to imprisonment for a term of 3 years or to\nboth.\n\nThis section does not affect the power of any consular officer in Barbados\n\n(3)\nto do any notarial act which he is authorised to do.\n\n\f16\n\nRegulations\n\n17.\n\nThe Minister may make regulations prescribing\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe fees which may be charged for the execution of any notarial act;\n\nthe fees payable upon the application and renewal as a notary public;\n\nthe conduct of notaries, including record keeping protocols;\n\nthe manner in which the Registrar shall store, preserve or dispose of\nseals and certificates submitted to the Registrar;\n\n(e)\n\ntraining courses and other educational materials for notaries;\n\n(f)\n\n(g)\n\nthe accreditation of any person, agency or educational institution for\nthe delivery of training courses;\n\nany other matter related to the discharge of the duties or functions of\nnotaries; and\n\n(h)\n\nanything that is authorised or required by this Act to be prescribed.\n\nAmendment of Schedules\n\n18.\n\nThe Minister may by Order amend the Schedules to this Act.\n\nRepeal of Act 2017–9\n\n19.\n\nThe Notaries Public Act, 2017 (Act 2017-9) is repealed.\n\nCommencement\n\n20.\nproclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f17\n\nFIRST SCHEDULE\n\nNotaries Public - Ex Officio\n\n(Section 3(2))\n\nSolicitor-General\n\nDeputy Solicitor-General\n\nPermanent Secretary in the Ministry responsible for Foreign Affairs\n\nPermanent Secretary in the Ministry responsible for Home Affairs\n\nPermanent Secretary in the Ministry responsible for International Business\n\nPermanent Secretary in the Office of the Attorney General\nPermanent Secretary in the Prime Minister’s Office\n\nDeputy Permanent Secretary in the Ministry responsible for Foreign Affairs\n\nDeputy Permanent Secretary in the Ministry of Home Affairs\n\nDeputy Permanent Secretary in the Ministry responsible for International Business\n\nDeputy Permanent Secretary in the Ministry responsible for the Office of the Attorney\nGeneral\n\nSupervisor of Insolvency\n\nRegistrar of the Supreme Court\n\nDeputy Registrar of the Supreme Court\n\nAssistant Registrar of the Supreme Court\n\nRegistrar of Corporate Affairs and Intellectual Property Office\n\nDeputy Registrar of Corporate Affairs and Intellectual Property Office\n\nAssistant Registrar of Corporate Affairs and Intellectual Property Office\n\nRegistrar of the Land Registry\n\nDeputy Registrar of the Land Registry\n\nAssistant Registrar of the Land Registry\n\nDirector of International Business\n\nDeputy Director International Business\n\nCabinet Secretary, Cabinet Office\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n(g)\n\n(h)\n\n(i)\n\n(j)\n\n(k)\n\n(l)\n\n(m)\n\n(n)\n\n(o)\n\n(p)\n\n(q)\n\n(r)\n\n(s)\n\n(t)\n\n(u)\n\n(v)\n\n(w)\n\n(x)\n\n\f18\n\nL.R.O. 1998SECOND SCHEDULE(Section 4(1))Notaries Public Act, 2024(Act 2024-    )Notary Public Application1. Name of the applicant:2. Gender: 3 Date of birth:4. Place of birth:5. Nationality:6. Address:Place passport sizedphotograph of applicanthereFemaleMale\f19\n\n L.R.O. 1998Second Schedule - (Cont'd)7. Contact information:           8. Status in Barbados: 9. Employment status:10. If employed, state your profession or occupation:11. Professional or other qualiﬁ cations:12. Work experience:.13. Has your application to become a notary public ever been denied:14. If your answer to question 13 is \"yes\", please give reason for this below:(Telephone number) (Home)(Facsimile number)(Email address)Self-employedEmployedRetiredYesNo(Telephone number) (Cell)(Telephone number) (Work) (Ext.)Permanent residentCitizen\f20\n\n L.R.O. 1998Second Schedule - (Cont'd)15. Were you  previously appointed as a Notary Public?           16. If your answer is \"yes\", please state when you were appointed a notary public and in which jurisdiction you were appointed a notary public.17. If your answer to question 15 is \"yes\", was your appointment revoked, suspended, or lapsed? If so, please provide an explanation. I,      of     apply, in accordance with the Notaries Public Act, 2024 (Act 2024-  ) to be appointed as a notarypublic. I certify that the information set out in this application concerning myself is true and that I have not been convicted of any crime punishable with imprisonment, nor have I been found guilty of any act that constitutes misconduct in a professional respect or misconduct under this act. Dated this day of     , 20       .Signed: YesNo(Applicant)\f21\n\n L.R.O. 1998Second Schedule - (Concl'd)INSTRUCTIONS TO APPLICANTThis application form shall be accompanied by the following documents:(a) two character references provided by an employer or former employer, a justice of the peace,a notary public, a minister of religion, a police oﬃ  cer of the rank of inspector or above,a medical doctor, a certified public or chartered accountant, a member of theLegislative Assembly or an attorney-at-law;(b) police certiﬁ cate of character;(c) a photograph of the applicant certiﬁ ed by a justice of  the peace, a notary public, a minister of religion, a police oﬃ  cer of the rank of inspector or above, a medical doctor, a certiﬁ ed public or chartered accountant, a member of Parliament or an attorney-at-law to be a true likeness of the applicant;(d) proof of professional or other qualiﬁ cation;(e) proof of citizenship or permanent residency status;(f) certiﬁ cate of good standing as required by section 3(3)(a) for an attorney-at-law andsection 3(3)(b) for a certiﬁ ed public or chartered accountant; and(g) such other documents as the Registrar or the President may require.An applicant may provide the information required at items 10, 11 and 12 in a curriculum vitaeof no more than three (3) pages.\f22\n\nL.R.O. 1998THIRD SCHEDULE(Section 5(3))Notaries Public Act, 2024(Act 2024-    )Impression of Notarial SealPlace Impression of Notarial Seal here\f23\n\nFOURTH SCHEDULE\n\nForm of Oath\n\n(Section 5(1)(a))\n\nI,                                        do swear that I will faithfully exercise the office of a notary public. I\nwill faithfully carry out such notarial duties as may be required for any party or between any\nparties requiring the same, and I will not add or diminish anything without the knowledge and\nconsent of such party or parties that may alter the substance of the facts. I will not make or attest\nany act, contract or instrument in which I shall know there is violence or fraud or is contrary to\nlaw; and in all things I will act uprightly and justly in the business of a notary public according\nto the best of my skill and ability.\nSo help me God.\n\n\f24\n\nL.R.O. 1998FIFTH SCHEDULE(Sections 6(1) and 8(1))Notaries Public Act, 2024(Act 2024-       )Application, Registration and Renewal FeesType of Fee1.Registration Fee2.Annual Renewal FeeAmount payable$1000.001000.00\f25\n\nL.R.O. 1998SIXTH SCHEDULE(Section 6)Notaries Public Act, 2024(Act 2024-    )Notary Public Certiﬁ catePursuant to the Notaries Public Act, 2024 (Act 2024-  ) it is hereby certiﬁ ed that         whose name is registered on the Roll is entitled to practise as a Notary Public during the year 20and for ensuing January.Dated thisday of20              .Registrar of the Supreme Court\f26\n\nL.R.O. 1998SEVENTH SCHEDULE(Sections 9(1)(a), 10(1), 10(4) and 10(5))Notaries Public Act, 2024(Act 2024-       )Notarial Acts and FeesColumn IColumn IINotarial ActIssue of a notarial certiﬁ cateCertiﬁ cation of exhibits (per exhibit)Aﬃ  xing notarial seal (per seal)Witnessing the execution of any documentAttestation of any documentAdministering of oaths and aﬃ  rmationsPresenting and noting protest on:Bill of Exchange or promissory noteExtending protest on Bill of Exchange or promissory noteFees$50.0010.0050.0020.0050.0050.0050.0050.00\f27\n\n L.R.O. 1998Seventh Schedule - (Concl'd) Column I - (Concl'd)Column II - (Concl'd)Fees $25.0050.0020.0050.0050.00Notarial ActMinute or noting ship protestExtending ship protest according to complication and lengthFurnishing copy of extended protestDeclaration to ship protest for the Master and each additionaldeclarantAny act not speciﬁ ed in this Schedule or in any other enactment\f28\n\nL.R.O. 1998EIGHTH SCHEDULE(Section 12(1))Notaries Public Act, 2024(Act 2024-       )Notarial Acts RegisterNature of Notarial ActFee chargedDate of  Notarial ActName of parties to documentTitle and date of document(if applicable)Name of person whose signature has been veriﬁ ed or to whom oath administered\f29\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}