{
  "bill_id": 784,
  "slug": "barbados-blue-green-bank-bill-2024",
  "title": "Barbados Blue Green Bank Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3240ba0b40d3ae1ae027f9bcf8022035.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-06-12",
  "first_reading": "2024-06-26",
  "gazette_date": "2024-06-10",
  "markdown": "2024/06/26\n\nOBJECTS AND REASONS\n\nThis Bill would make provision for\n\n(a)\n\n(b)\n\nthe  establishment,  governance  and  operations  of  the  Barbados  Blue\nGreen Bank;\n\nthe facilitation of the financing of the sustainable green and blue sectors\nof the economy for the assistance of creditors and investors and the\nstimulation of innovation within the financial sector to mobilise the\nsecurities and loans markets in these sectors;\n\n(c)\n\nthe facilitation of investment projects in pursuit of climate resilient and\nclimate adaptation strategies;\n\n(d)\n\nthe investment functions of the Bank; and\n\n(e)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nPurpose and construction\n\nApplication\n\nPART II\n\nADMINISTRATION\n\nEstablishment of the Bank\n\nHead Office and agents of the Bank\n\nFunctions of the Bank\n\nRestrictions on business activities\n\nBoard\n\n10.\n\nDelegation of functions\n\n11.\n\nConflict of interest\n\n\f3\n\n12.\n\nImmunity\n\n13.\n\nChief Executive Officer\n\n14.\n\nStaff\n\n15.\n\nEmployment of public officers\n\n16.\n\nPrivate pension plan\n\n17.\n\nConfidentiality\n\n18.\n\nCommittees\n\n19.\n\nExperts\n\nPART III\n\nFINANCIAL PROVISIONS\n\n20.\n\nEstablishment of Special Account\n\n21.\n\nFunds\n\n22.\n\nBorrowing powers\n\n23.\n\nGuarantee of loans\n\n24.\n\nReceipt of gifts or grants\n\n25.\n\nFinancial year\n\n26.\n\nAccounts and audit\n\n27.\n\nReports\n\n\f28.\n\nAuthorised capital\n\n29.\n\nSubscription for shares\n\n30.\n\nPayment of subscriptions\n\n4\n\nPART IV\n\nINVESTMENT\n\n31.\n\nInvestment functions\n\n32.\n\nInvestment Committee\n\n33.\n\nComplying investments\n\n34.\n\nPerformance of investment functions\n\n35.\n\nInvestment mandate and policies\n\nPART V\n\nMISCELLANEOUS\n\n36.\n\nOffences\n\n37.\n\nAmendment of Schedule\n\n38.\n\nRegulations\n\nSCHEDULE\n\nCONSTITUTION OF THE BOARD\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  make  provision  for  the  facilitation  of  the  financing  of  the\nsustainable  green  and  blue  sectors  of  the  economy  for  the  assistance  of\ncreditors  and  investors;  the  stimulation  of  innovation  within  the  financial\nsector  to  mobilise  the  securities  and  loans  markets;  and  mobilising  private\nsector investments and directing international finance to projects aligned with\nnational priorities.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Barbados Blue Green Bank Act, 2024.\n\nInterpretation\n\n2.(1)\n\nFor the purposes of this Act,\n\n“account” means the Barbados Blue Green Bank Special Account established by\n\nsection 20;\n\n“asset” means any\n\n(a)\n\n(b)\n\n(c)\n\nkind of real or personal property;\n\nlegal or equitable estate or interest in real or personal property; or\n\nlegal or equitable right;\n\n“Bank” means the Barbados Blue Green Bank established by section 5;\n\n“bank”  means  a  company  carrying  on  banking  business  under  the  Financial\n\nInstitutions Act, Cap. 324A;\n\n“banking business” has the meaning assigned to it by section 2 of the Financial\n\nInstitutions Act, Cap. 324A;\n\n“blue  economy”  means  the  sustainable  use  of  ocean  resources  to  benefit\neconomies, livelihoods and the preservation or regeneration of ocean eco-\nsystem health;\n\n“Board”  means  the  Board  of  Directors  of  the  Barbados  Blue  Green  Bank\n\nestablished under section 9;\n\n“capital base” means the sum of stated capital and published reserves of the Bank\n\nand any other capital account approved by the Central Bank;\n\n\f7\n\n“Central Bank” means the Central Bank of Barbados referred to under the Central\n\nBank of Barbados Act, 2020 (Act 2020-30);\n\n“Chief Executive Officer”or “CEO” means the Chief Executive Officer of the\n\nBank;\n\n“clean energy technologies” means any one or more of the following:\n\n(a)\n\n(b)\n\n(c)\n\nenergy efficient technologies;\n\nlow-emission technologies;\n\nrenewable energy technologies;\n\n“control” means the power of a person\n\n(a)\n\n(b)\n\n(c)\n\neither alone or with a related party;\n\nwith another person;\n\nby an agreement; or\n\n(d)\n\nin any other manner,\n\n(i)\n\n(ii)\n\nto  exercise  more  than  50  per  cent  of  the  voting  rights  at  any\nmeeting of shareholders of the Bank or an affiliate of the Bank;\n\nto elect a majority of the directors of the Bank or an affiliate of\nthe Bank;\n\n(iii)\n\nto exercise dominant influence over the conduct of the business\nand affairs of the Bank or an affiliate of the Bank\n\nand the term “controlling interest” shall be construed accordingly;\n\n“energy efficient technologies” includes technologies that are related to energy\n\nconservation technologies or demand management technologies;\n\n“exposure”  has  the  meaning  assigned  to  it  by  section  2  of  the  Financial\n\nInstitutions Act, Cap. 324A;\n\n“financial group” means a group whose activities include banking business and\n\nany other ancillary business approved by the Central Bank;\n\n\f8\n\n“financial holding company” means a company engaged in\n\n(a)\n\n(b)\n\nestablishing  or  acquiring  financial  entities  and  administering  the\nholdings of the financial group it controls;\n\nproviding banking and ancillary services to subsidiaries and affiliated\ncompanies in the financial group it controls; or\n\n(c)\n\nany other ancillary business approved by the Central Bank;\n\n“financial institutions” includes commercial banks, securities companies, trust\ncompanies,  finance  companies,  companies  trading  in  mutual  funds,\nmerchant banks and money or value transmission service providers;\n\n“foreign bank” means a bank incorporated outside of Barbados;\n\n“green economy” means the kind of economy that reduces environmental risks\nand  ecological  threats  or  dangers  by  encouraging  economic  activity  that\npreserves or regenerates the environment;\n\n“group” has the meaning assigned to it by section 2 of the Financial Institutions\n\nAct, Cap. 324A;\n\n“holding  company”  and  “subsidiary”  have  the  meanings  assigned  in  the\n\nCompanies Act, Cap. 308;\n\n“investment” means any mode of application of money or financial assets for the\npurpose of gaining a return (whether by way of income, capital gain or other\nform of return) and includes giving a guarantee;\n\n“investment function” means the functions described in section 31(1);\n\n“large exposure” means an exposure to a person or group that is greater than or\n\nequal to 10 per cent of the Bank's capital base;\n\n“low-emission  technology”  means  a  technology  that  complies  with  written\nguidelines made by the Board to the effect that the technology is a low-\nemission technology;\n\n“Minister” means the Minister responsible for Finance;\n\n\f9\n\n“public officer” has the meaning assigned to it by section 2 of the Public Service\n\nAct, Cap. 29;\n\n“renewable energy technologies” includes\n\n(a)\n\n(b)\n\nhybrid technologies that integrate renewable energy technologies; and\n\ntechnologies that are related to renewable energy;\n\n“unsecured  advances”  or  “unsecured  credit”  has  the  meanings  assigned  by\n\nsection 2 of the Financial Institutions Act, Cap. 324A.\n\n(2)\n\nFor the purposes of this Act\n\n(a)\n\none body corporate is affiliated with another body corporate if one of\nthem is a subsidiary of the other, or both are subsidiaries of the same\nbody corporate, or each of them is controlled by the same person; and\n\n(b)\n\nif 2 bodies corporate are affiliated with a third body corporate at the\nsame time, they are affiliated with each other.\n\nPurpose and construction\n\n3.(1)\nThe purpose of this Act is to establish a mechanism, functioning with\nminimal involvement of the Government, to facilitate the financing of clients\nwho are engaged in the development of the blue and green sectors of the economy.\n\nThis  Act  shall  receive  such  fair,  large  and  liberal  construction  and\n\n(2)\ninterpretation as will best ensure the attainment of its purposes.\n\nApplication\n\n4.(1)\n\nThe\n\n(a)\n\n(b)\n\n(c)\n\nCentral Bank of Barbados Act, 2020 (Act 2020-30);\n\nFinancial Institutions Act, Cap. 324A;\n\nFinancial  Services  Commissions  Act,  2010  (Act  2010-21)  and  the\nspecified enactments defined under that Act,\n\n\f10\n\ntogether with the statutory instruments, Directives and Guidelines issued under\nthe Acts specified in paragraphs (a), (b) and (c), shall apply mutatis mutandis to\nthe Bank and any entity affiliated to it.\n\nThe  provisions  of\n\n(2)\n(Act 2019-1) shall not apply to the Bank or any entity affiliated to the Bank.\n\nthe  Public  Finance  Management  Act,  2019\n\nPART II\n\nADMINISTRATION\n\nEstablishment of the Bank\n\nThere is hereby established a Bank to be known as the Barbados Blue\n5.(1)\nGreen  Bank  for  the  purpose  of  financing  clients  who  are  engaged  in  the\ndevelopment of the blue and green sectors of the economy.\n\n(2)\n\nSection 21 of the Interpretation Act, Cap. 1 shall apply to the Bank.\n\nHead Office and agents of the Bank\n\n6.\nThe Bank shall have its head office in Barbados and may appoint such\nagents  and  correspondents  in  and  outside  of  Barbados  for  the  efficacious\nperformance of its functions under this Act.\n\nFunctions of the Bank\n\n7.(1)\n\nThe Bank shall have the following functions:\n\n(a)\n\n(b)\n\n(c)\n\nto receive grants, loans or other forms of financing;\n\nto make grants, loans, advances or allow overdrafts;\n\nto invest directly or indirectly in clean energy technologies, that is to\nsay,  energy  efficient  technologies,  low-emission  technologies  or\nrenewable energy technologies;\n\n\f11\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\n(k)\n\n(l)\n\nto invest directly or indirectly in projects designed to promote climate\nresilience and climate adaptation;\n\nto invest directly and indirectly in sustainable, green and blue projects\nor instruments that generate revenues;\n\nto provide investment analysis or advice and issue securities;\n\nto  stimulate  innovation  in  the  financial  sector  and  to  mobilise  the\nsecurities and loan markets;\n\nto  enter  into  partnerships  with  private  parties  for  the  purpose  of\nattaining the Bank's objectives;\n\nto liaise with relevant persons and bodies for the purpose of facilitating\nits investment function;\n\nto engage in lending funds to finance projects or trade whether national\nor international;\n\nto  enter  into  and,  where  necessary,  finance  guarantees  including\nperformance guarantees, bid bonds, advance payment bonds;\n\nto  provide  capital  market  or  merchant  banking  services  including\nissuing bonds, making private placements or dealing in commercial\npaper,  underwriting  debts,  managing  private  sector  investments  and\ntrading in financial instruments;\n\n(m)\n\nto settle or operate loan accounts and provide management services\nrelated thereto;\n\n(n)\n\n(o)\n\n(p)\n\nto settle transactions in domestic or international currencies, managing\nforeign exchange;\n\nto  provide  advisory  services  including  financial  structuring,  risk\nmanagement and arranging credit to financial institutions;\n\nto promote, effect, induce, underwrite, participate in, manage and carry\nout any issue of loans or shares, stock or debentures of any company,\n\n\f12\n\ncorporation or association, and lend or provide money for the purpose\nof any such issue;\n\n(q)\n\nto issue electronic transfers and to grant and issue Letters of Credit;\n\n(r)\n\n(s)\n\n(t)\n\n(u)\n\n(v)\n\n(w)\n\nto purchase and sell treasury bills and securities of or guaranteed by\nthe Government and such other governments or international financial\ninstitutions as may be specified by the Board;\n\nto purchase and sell foreign currencies and foreign bills of exchange;\n\nto borrow money for the purpose of conducting the Bank's business\nand  in  the  exercise  of  its  borrowing  powers,  the  Bank  may  issue\ndebentures  or  bonds  on  such  terms  and  conditions  as  the  Board\ndetermines;\n\nto undertake on behalf of customers and correspondents the purchase,\nsale,  collection  and  payment  of  money,  securities  and  credit\ninstruments;\n\nto  enter  into  contracts  of  such  kinds  as  the  Board  may  determine\nincluding contracts of indemnity, suretyship or guarantee;\n\nto do such things as are incidental or conducive to the performance of\nthe foregoing functions.\n\nIn  the  exercise  of  its  functions  under  this  section,  the  Board  shall  not\n(2)\nauthorise any advance, loan or overdraft facility directly or indirectly upon the\nsecurity of any shares in the Bank\n\n(a)\n\n(b)\n\n(c)\n\nto a director or his spouse;\n\nto any individual, firm or company in which a director or his spouse is\na partner, director, officer, or managing agent;\n\nto any individual, firm or company in any case where a director or his\nspouse is a guarantor;\n\n(d)\n\nto any other related party; or\n\n\f13\n\n(e)\n\nto any political party, organisation or association or to an individual\nfor political purposes.\n\n(3)\n\nFor the purposes of subsection (2), the word “related party” means\n\n(a)\n\nthe holding companies, financial holding companies, subsidiaries or\naffiliates  of  the  Bank  and  the  directors  and  senior  officers  of  such\ncompanies;\n\n(b)\n\nany person that the Bank exerts control over or that exerts control over\nthe Bank;\n\n(c)\n\nany person who holds more than 20 per cent of the Bank's shares;\n\n(d)\n\nan entity in which the Bank owns at least 20 per cent of the shares;\n\n(e)\n\na director or senior officer of the Bank;\n\n(f)\n\n(g)\n\n(h)\n\nan  immediate  relative  of  a  director  or  senior  officer  of  the  Bank  or\nimmediate relative of a director or senior officer of a holding company,\na financial holding company, a subsidiary or an affiliate of the Bank;\n\nany firm which is controlled by a director or senior officer of the Bank\nor controlled by an immediate relative of a director or senior officer of\nthe Bank;\n\nany  person,  firm  or  corporation,  where  the  credit  facilities  of  that\nperson,  firm  or  corporation  are  guaranteed  by  a  director  or  senior\nofficer of the Bank or guaranteed by an immediate relative of a director\nor senior officer of the Bank; or\n\n(i)\n\nany other similar person or group of persons determined by the Central\nBank.\n\nWhere the Board decides to make a grant, loan, advance or other forms of\n(4)\nfinancing available to a related party, the Board shall apply the provisions of\nsection 21 of the Financial Institutions Act, Cap. 324A.\n\n\f14\n\nRestrictions on business activities\n\n8.(1)\nThe Bank shall offer wholesale banking services only to other banks\nand  financial  institutions,  Government  agencies,  real  estate  developers  and\nsimilar enterprises as the Bank may determine.\n\n(2)\n\nSubject to subsection (3), the Bank\n\n(a)\n\nshall not directly or indirectly incur exposures to one person or group\nso that\n\n(i)\n\n(ii)\n\nthe total value of such exposures at any time exceeds 25 per cent\nof the capital base of the Bank;\n\nwhere a portion of the exposures referred to in subparagraph (i) is\nunsecured credit facilities, that portion exceeds 10 per cent of the\ncapital base of the Bank;\n\n(b)\n\nshall not directly or indirectly incur any large exposure to a person or\na  group  where  by  so  doing  the  aggregate  amount  of  all  such  large\nexposures would exceed 800 per cent of the capital base or such other\nlimit as the Central Bank determines;\n\n(c)\n\nshall not incur exposures to a related party\n\n(i)\n\n(ii)\n\non  terms  and  conditions  more  favourable  than  the  terms  and\nconditions generally applicable to borrowers;\n\nso that the total value of such exposures at any time exceeds 10\nper cent of the capital base of the Bank;\n\n(iii)\n\nso  that  the  aggregate  amount  of  such  exposures  referred  to  in\nsubparagraph (ii) exceeds 25 per cent of the capital base;\n\nexcept  that  an  equity  investment  in  a  wholly  owned  subsidiary  that  is  a\nfinancial institution shall not be taken into account in the determination of\nan exposure;\n\n\f15\n\n(d)\n\nshall not grant unsecured credit facilities of an aggregate amount in\nexcess  of  $40  000  or  one  per  cent  of  the  capital  base  of  the  Bank,\nwhichever is the greater or give any financial guarantee in excess of\nsuch amount without security, or incur any other liability in excess of\nthat amount without security\n\n(i)\n\n(ii)\n\nto or on behalf of any of its directors whether or not such credit\nfacilities, financial guarantees or liabilities are obtained by or on\naccount of the directors jointly or severally;\n\nto or on behalf of any person in whom it or any of its directors is\ninterested as a director, partner, manager or agent or as guarantor;\nor\n\n(iii)\n\nto  its  holding  company,  its  financial  holding  company,  any\nsubsidiary, an affiliate or to any of its directors;\n\n(e)\n\nshall  not  grant  to  its  officers  or  employees  unsecured  advances  or\nunsecured  credit  which  exceed  in  aggregate  for  any  one  officer  or\nemployee, one year's emoluments of that officer or employee; and\n\n(f)\n\nshall not\n\n(i)\n\n(ii)\n\nacquire, deal in or underwrite its own shares or the shares of its\nholding company or its financial holding company; or\n\ngrant any credit facility secured by its own shares or the shares of\nits holding company or its financial holding company or the shares\nof a subsidiary of the Bank.\n\n(3)\n\nThe provisions of subsection (2)(a) shall not apply to\n\n(a)\n\n(b)\n\nany financial exposures to the Government, statutory corporation or\nany other person where repayment is guaranteed by the Government;\n\ntransactions in respect of which the portion thereof in excess of 25 per\ncent of the capital base of the Bank is fully supported by collateral in\nthe form of cash deposits or securities issued by the Government; or\n\n\f16\n\n(c)\n\nexposures in such other form as the Central Bank may determine.\n\nBoard\n\n9.(1)\nThere  shall  be  a  Board  of  Directors  of  the  Bank  which  shall  be\nresponsible for the policy and general administration of the Bank, including the\nappointment and management of staff and the efficient management of resources\nand contracts of the Bank.\n\nThe Board shall meet as often as the business of the Bank requires, but not\n\n(2)\nless frequently than once every quarter.\n\nThe  Schedule  applies  with  respect  to  the  appointment,  constitution  and\n\n(3)\nfunctioning of the Board and otherwise in relation thereto.\n\nDelegation of functions\n\nThe Board may delegate to the Chairman, a committee of the Board\n10.(1)\nor the Chief Executive Officer, such of its functions as it thinks expedient for the\npurpose of effectively transacting the business of the Board.\n\n(2)\n\nThe delegation of a function pursuant to section (1)\n\n(a)\n\n(b)\n\ndoes not prevent the Board from discharging that function; and\n\nmay at any time be revoked by the Board.\n\nConflict of interest\n\n11.(1)\nA  director  who  is  in  any  way  directly  or  indirectly  interested  in  a\ncontract or proposed contract with the Bank or any other matter with which the\nBank is concerned, shall declare the nature and extent of his interest at the first\nmeeting of the Board at which it is practicable for him to do so.\n\nA director shall not take part in any deliberation or decision of the Board\n(2)\nin respect of any contract or proposed contract with the Board or any other matter\nwith  which  the  Board  is  concerned,  in  which  he  has  any  pecuniary  interest,\nwhether directly or indirectly.\n\n\f17\n\n(3)\nFor the purposes of this section, a director shall be treated as having an\nindirect interest in a contract or proposed contract with the Board or in any other\nmatter with which the Board is concerned if he is\n\n(a)\n\n(b)\n\n(c)\n\na director;\n\na shareholder;\n\na partner;\n\n(d)\n\nan employee; or\n\n(e)\n\na fee-earning consultant\n\nof a company or other association of persons that is a party to such other matter\nwith which the Bank is concerned.\n\nA director mentioned in subsections (1), (2) and (3) shall not vote on a\n\n(4)\ncontract or proposed contract to that with which the Bank is concerned.\n\nA  director  and  any  employee  of  the  Bank  shall  not  accept  a  gift  or  an\n(5)\nadvantage  for  himself  or  on  behalf  of  persons  with  whom  they  have  family,\nbusiness  or  financial  connections,  if  the  acceptance  might  result  or  give  the\nappearance  of  resulting  in  a  diminution  of  the  impartial  performance  of  his\nduties.\n\nWhere a person to whom this section applies contravenes this section, he\n(6)\nis guilty of an offence and is liable on conviction on indictment to a fine of $50\n000 or to imprisonment for 3 years or both.\n\nImmunity\n\n12.(1)\nNo legal proceedings shall be brought or instituted personally against\nany  director  in  respect  of  any  act  done  in  good  faith  in  the  performance  or\nexecution or intended execution of his functions under this Act.\n\nWhere a director of the Board is exempt from liability by reason only of\n(2)\nsubsection (1), the Bank is liable to the extent that it would have been had the\ndirector been an employee or agent of the Bank.\n\n\f18\n\nChief Executive Officer\n\n13.(1)\nCommission, there shall be a Chief Executive Officer of the Bank.\n\nSubject to the approval of the Central Bank and the Financial Services\n\nNotwithstanding the provisions in any contract between the Bank and the\n\n(2)\nCEO, the CEO shall also be responsible for\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe day-to-day administration of the Bank;\n\nensuring that decisions and policies of the Board are carried out;\n\nmanaging the assets and liabilities of the Bank in accordance with the\nlaw;\n\naccounting  for  and  reporting  in  a  timely  manner  on  all  monies  and\nproperty received by or under the control of the Bank;\n\ndoing all things necessary or convenient to be done for or in connection\nwith the performance of his duties.\n\nThe CEO shall receive such remuneration and allowances as the Board\n\n(3)\ndetermines.\n\n(4)\n\nThe CEO shall be an ex officio member of the Board.\n\nThe CEO may resign his appointment by giving the Chairman of the Board\n(5)\nwritten notice of his resignation in accordance with the terms of his contract of\nemployment.\n\nStaff\n\n14.(1)\nperforming its functions and exercising its powers.\n\nThe  Bank  may  employ  such  staff  as  it  considers  necessary  for\n\nAn employee shall be employed on such terms and conditions as the Board\n\n(2)\ndetermines in writing.\n\n\f19\n\nEmployment of public officers\n\n15.(1)\nWhere a public officer accepts employment with the Bank he shall be\nemployed on terms and conditions no less favourable than those to which he was\nentitled before the commencement of this Act.\n\nWhere  a  public  officer  is  seconded  or  temporarily  transferred  from  a\n(2)\npensionable  office  within  the  meaning  of  section  2(1)  of  the  Pensions  Act,\nCap. 25 to perform any service with the Bank, his service with the Bank shall,\nunless the President otherwise decides, count for pension under that Act as if the\nofficer had not been so seconded or transferred.\n\nWhere the services of a person employed by the Bank are on loan to the\n(3)\nGovernment that person is entitled to such benefits and terms of employment as\nare applicable to the post which he occupies, and the service with the Bank shall\nbe  taken  into  account  as  continuous  service  with  the  Government  and  the\nPensions Act and the Pensions Regulations, 1947 (1947/20) shall apply to him\nas if his service with the Bank were service within the meaning of that Act.\n\nWhere  a  public  officer  is  transferred  to  the  service  of  the  Bank  in\n(4)\naccordance with subsection (3), the Bank shall refund to the Consolidated Fund\nall moneys payable as pension in respect of the service of that officer with the\nBank.\n\nWhere a public officer who has pensionable service is transferred to or\n(5)\nbecomes employed in the service of the Bank, his service with the Bank shall,\nwhether or not there was a break in service, be aggregated with his service in the\npublic service and his pension shall be calculated in accordance with the Pensions\nAct and the Pensions Regulations, 1947 as if all of his service was service in the\npublic service.\n\nPrivate pension plan\n\nSubject  to  section  15,  the  Bank  shall,  within  2  years  of  the\n16.\ncommencement of this Act, provide for the establishment of a pension plan for\nthe benefit of the staff of the Bank.\n\n\f20\n\nConfidentiality\n\n17.(1)\nExcept for the purpose of the performance of his duties or the exercise\nof his functions or when lawfully required to do so by any court or under the\nprovisions of any law, no director, member of any committee or employee of the\nBank shall disclose to any person any material information relating to the affairs\nof the Bank or any other bank, financial institution, person, firm, company or\norganisation which he has acquired in the performance of his duties or exercise\nof his functions.\n\nA person who contravenes subsection (1) is guilty of an offence and is\n(2)\nliable on summary conviction to a fine of $25 000 or to imprisonment for 2 years\nor both.\n\nCommittees\n\n18.(1)\nperformance of the Board's or the Bank's functions.\n\nThe  Board  may  establish  committees  to  advise  or  assist  in  the\n\n(2)\n\nA committee may be constituted\n\n(a)\n\n(b)\n\n(c)\n\nwholly by members of the Board;\n\nwholly by persons who are not Board members; or\n\npartly by Board members and partly by other persons.\n\nThe Board may determine, in relation to a committee established under\n\n(3)\nthis section\n\n(a)\n\n(b)\n\nthe terms of reference of the committee;\n\nthe  terms  and  conditions  of  appointment  of  the  members  of  the\ncommittee; and\n\n(c)\n\nany procedures to be followed by the committee.\n\nWhere a committee, appointed under subsection (2) performs a function,\n\n(4)\nit is deemed to have been performed by the Board.\n\n\f21\n\n(5)\nWhere  the  Board  decides  that  a  member  of  a  committee  is  to  be\nremunerated, that member shall be paid such remuneration and allowances, if\nany, as the Board determines.\n\nExperts\n\n19.\nfunctions and on such terms and conditions as determined by the Board.\n\nThe Bank may engage consultants to assist in the performance of its\n\nPART III\n\nFINANCIAL PROVISIONS\n\nEstablishment of Special Account\n\n20.\nestablished.\n\nThe  Special  Account  of  the  Barbados  Blue  Green  Bank  is  hereby\n\nFunds\n\n21.(1)\n\nThe funds of the Bank shall consist of\n\n(a)\n\n(b)\n\nmoney paid to the Bank under section 30;\n\nany other money received by the Bank.\n\n(2)\n\nThe Bank's money shall be applied only\n\n(a)\n\n(b)\n\nin performing its investment functions;\n\nin  paying  or  discharging  the  costs,  expenses  and  other  obligations\nincurred by the Bank in performing its functions as set out in section\n7; and\n\n(c)\n\nin  paying  any  remuneration  and  allowances  payable  to  any  person\npursuant to this Act.\n\n\f22\n\nBorrowing powers\n\nThe Bank may, with the approval of the Board, borrow any money it\n22.\nrequires for meeting any of its obligations or performing any of its functions,\nprovided that the Board takes into account the following:\n\n(a)\n\n(b)\n\n(c)\n\nthe amount and sources of the loan;\n\nthe terms and conditions on which the loan may be obtained; and\n\nthe  solvency  of  the  Bank’s  financial  position  at  the  time  of  the\nborrowing.\n\nGuarantee of loans\n\nThe  Government  may,  with  the  approval  of  Parliament,  in  such\n23.\nmanner and on such terms and conditions as may be specified, guarantee a loan\nto the Bank together with any interest or other charges payable.\n\nReceipt of gifts or grants\n\n24.\nThe Bank may accept a gift or grant of money or a gift or grant of a\nfinancial asset provided that the Board authorises the Bank in writing to accept\nthe gift or grant.\n\nFinancial year\n\n25.\nJanuary to 31st December in any calendar year.\n\nThe financial year of the Bank shall be the calendar year, namely, 1st\n\nAccounts and audit\n\n26.(1)\nThe Bank shall keep proper accounts and other records in relation to\nthe business of the Bank, and shall prepare annually, a statement of accounts in\na form that complies with generally acceptable commercial accounting standards.\n\nThe accounts of the Bank shall be audited at least once every financial year\n\n(2)\nby an external auditor appointed by the Board.\n\n\f23\n\nReports\n\nThe  Bank  shall,  no  later  than  the  15th  day  of  the  month  following,\n27.(1)\nprepare a statement of the condition of the Bank as at the close of business on\nthe last business day of each quarter, and shall transmit a copy of the statement\nto the Board and the shareholders.\n\n(2)\n\nWithin 3 months after the close of each financial year the Board shall\n\n(a)\n\ntransmit to the shareholders a copy of its annual accounts certified by\nits auditor; and\n\n(b)\n\nsubmit also a report on its operations during the year.\n\nWithin 4 months of the close of each financial year, the Bank shall publish\n\n(3)\na report providing information on the extent to which the Bank has been able\n\n(a)\n\nto implement its environmental, social and governance strategies and\ngoals; and\n\n(b)\n\nto deal with the impact of its business on the environment.\n\nAuthorised capital\n\n28.(1)\nSubject to this section, the initial authorised share capital of the Bank\nshall be $500 million, divided into such shares and issued on such terms as the\nDirectors shall determine at the first meeting of the Board.\n\nThe  shares  shall  be  available  for  subscription  by  shareholders  in\n\n(2)\naccordance with section 29.\n\n(3)\n\nThe original authorised capital stock shall be divided into paid-up shares.\n\nThe authorised capital stock may be increased by the Board at such time\n(4)\nand on such terms and conditions as it may determine by a vote of not less than\ntwo-thirds of the total number of Directors present and voting.\n\n\f24\n\n(5)\nNotwithstanding subsection (4), the Board shall increase the authorised\ncapital of the Bank pursuant to any directive issued in that regard by the Central\nBank or the Financial Services Commission.\n\nSubscription for shares\n\nA  shareholder  shall  subscribe  for  shares  of  the  capital  stock  of  the\n29.(1)\nBank and the authorised capital stock shall at all times be held or be available for\nsubscription.\n\nIn case of an increase in the authorised capital stock, each shareholder shall\n(2)\nhave  a  right  to  subscribe,  on  such  terms  and  conditions  as  the  Board  shall\ndetermine, for a proportion of the increase of stock equivalent to the proportion\nwhich its previously subscribed stock bears to the total subscribed capital stock\nimmediately before such increase.\n\nThe Board may, at the request of a shareholder, approve an increase of the\n(3)\nsubscription of such shareholder on such terms and conditions as the Board may\ndetermine.\n\nShares initially subscribed for by a shareholder shall be issued on such\n\n(4)\nterms as the Board determines.\n\nThe Government shall subscribe for a portion of the initial paid-up capital\n\n(5)\nand may subscribe for such other amounts as it determines.\n\n(6)\n\nShares shall not be pledged and encumbered in any manner.\n\nLiability of shareholders in respect of their shares shall be limited to the\n\n(7)\nunpaid portion of their issue price.\n\nPayment of subscriptions\n\n30.(1)\nthe shares for which it has subscribed.\n\nNotwithstanding subsection (2), a shareholder may pay fully for all\n\n\f25\n\n(2)\nPayment of an amount due in respect of shares initially subscribed for by\na shareholder but not fully paid-up, may be made in 6 instalments provided that\nthe first instalment is equal to 40 per cent of the total amount subscribed for.\n\nThe first instalment shall be paid by each shareholder within 90 days after\n\n(3)\nthe date on which a shareholder subscribes for shares.\n\n(4)\n\nThe other 5 instalments shall be paid as the Board may determine.\n\nPART IV\n\nINVESTMENT\n\nInvestment functions\n\nThe  investment  functions  of  the  Bank  are  to  invest,  directly  or\n31.(1)\nindirectly, in clean energy technologies, climate mitigation, climate resilient and\nclimate  adaptation  projects  or  programmes  in  the  sustainable  green  and  blue\nsectors of the economy.\n\nNotwithstanding  subsection  (1),  the  Bank  may  perform  its  investment\n\n(2)\nfunctions by doing any or all of the following:\n\n(a)\n\n(b)\n\n(c)\n\nin  businesses  or  projects  for\n\nthe  development  or\ninvesting\ncommercialisation of, or in relation to the use of green and sustainable\ntechnologies;\n\ninvesting in businesses or projects pursuing climate mitigation, climate\nresilient or climate adaptation strategies;\n\ninvesting in businesses that supply goods or services needed to develop\nor commercialise, or needed for use in the blue and green sectors of\nthe economy;\n\n(d)\n\ngiving guarantees in accordance with section 7.\n\n\f26\n\n(3)\nIn performing its investment functions, the Bank shall seek to ensure a\nbalance between its investments in renewable energy, other climate mitigation\ntechnologies and climate adaptation projects.\n\n(4)\nThe Bank may perform its investment functions by making investments\nitself through companies, subsidiaries, agencies or other investment vehicles or\nby any combination of these.\n\nAn  investment  may  be  an  investment  for  the  purposes  of  the  Bank's\n\n(5)\ninvestment functions, regardless of the means by which it is made.\n\nInvestment Committee\n\n32.(1)\npersons.\n\nThere shall be an Investment Committee comprising no more than 9\n\nThe  functions  of  the  Investment  Committee  are  to  advise  the  Board  on\n(2)\ninvestment policies and to perform such other duties as may be delegated by the\nBoard with regard to investment matters.\n\nIn  the  absence  of  the  Chairman,  the  Deputy  Chairman  shall  preside  at\n\n(3)\nmeetings of the Committee.\n\n(4)\n\n(5)\n\nSix members shall constitute a quorum.\n\nThe Investment Committee shall regulate its own procedure.\n\nComplying investments\n\n33.(1)\nThe Board shall take all reasonable steps to ensure that investments\nfor the purposes of the Bank’s investment functions are at all times complying\ninvestments.\n\n(2)\n\nComplying investments are investments that are\n\n(a)\n\n(b)\n\n(c)\n\nin sustainable, blue and green technologies;\n\nin climate adaptation and resilience; and\n\nnot in a prohibited technology.\n\n\f27\n\nThe fact that an investment has ceased to be, or never was, a complying\n\n(3)\ninvestment, does not affect the validity of any transaction.\n\n(4)\nFor the purposes of this section, an investment does not cease to be an\ninvestment in clean energy technology only because the technology to which the\ninvestment relates has, since the investment was made, ceased to qualify as a\nclean energy technology because\n\n(a)\n\n(b)\n\nits performance has not met reasonable expectations that existed at the\ntime when the investment was made; or\n\ndifferent standards for measuring clean energy technologies are being\napplied than were being applied at the time when the investment was\nmade.\n\nPerformance of investment functions\n\nWhere an asset held by the Bank for the purposes of the investment\n34.\nfunction of the Bank ceases to be, or never was, a worthwhile investment in the\nopinion of the Board, the Bank shall act as soon as practicable to protect its capital\nand  conform  with  regulatory  capital  requirements,  which  may  include\nimmediately realising the asset as soon as practicable after the Bank becomes\naware that the asset has ceased to be, or never was, a worthwhile asset.\n\nInvestment mandate and policies\n\n35.(1)\nwritten policies to be complied with by the Bank in respect of the following:\n\nThe investment mandate of the Bank requires the Board to formulate\n\n(a)\n\n(b)\n\nthe investment strategy of the Bank;\n\nbenchmarks for assessing the performance of the Bank's investments\nand the Bank itself;\n\n(c)\n\nrisk management for the Bank's investments and the Board itself.\n\nCopies of the policies referred to in subsection (1) shall be published on\n\n(2)\nthe Bank's website.\n\n\f28\n\nThe Board shall conduct periodic reviews of the policies and where there\n(3)\nis  a  change  in  the  investment  mandate,  the  Board  shall  review  the  affected\npolicies.\n\nThe Bank shall comply with the policies but a failure to do so does not\n\n(4)\naffect the validity of any transaction.\n\nPART V\n\nMISCELLANEOUS\n\nOffences\n\n36.(1)\n\nAny person who\n\n(a)\n\n(b)\n\n(c)\n\nobtains financial assistance from the Bank under this Act by means of\nany false representation;\n\nwilfully applies any loan made to him by the Bank or guaranteed by\nthe Bank under this Act to any purpose other than the purpose for which\nthe loan was made;\n\nhaving obtained a loan from the Bank or the guarantee by the Bank of\na loan under this Act, wilfully destroys any security given in respect\nof such loan or guarantee, is guilty of an offence.\n\nIn any proceedings in respect of an offence under subsection (1)(b), the\n(2)\nonus of proving that he acted in good faith and without knowledge that he was\nnot  entitled  so  to  apply  the  loan  or  any  part  thereof  shall  be  upon  the  person\ncharged.\n\nA  person  guilty  of  an  offence  under  this  Act  is  liable  on  summary\n\n(3)\nconviction to a fine of $25 000 or to imprisonment for 2 years or both.\n\nAmendment of Schedule\n\n37.\n\nThe Minister may by order amend the Schedule.\n\n\f29\n\nRegulations\n\n38.\nprovisions of this Act.\n\nThe Minister may make regulations generally for giving effect to the\n\n\f30\n\nSCHEDULE\n\nCONSTITUTION OF THE BOARD\n\n(Section 9)\n\nComposition of the Board of Directors\n\n1.(1)\n\nThe Board of Directors shall consist of no more than 11 members.\n\n(2)\n\nThe directors shall be appointed as follows:\n\n(a)\n\n(b)\n\n(c)\n\ntwo shall be appointed for 2 years;\n\nfour shall be appointed for 3 years;\n\nthree shall be appointed for 4 years; and\n\n(d)\n\ntwo shall be appointed for 5 years.\n\nQualifications for appointment\n\n2.(1)\nbe appointed by the shareholders at an Annual General Meeting.\n\nSubject to any provisions of any relevant enactment, directors shall\n\n(2)\nA  person  eligible  for  appointment  as  a  Board  member  must  have\nsubstantial experience or expertise and professional credibility and significant\nstanding in at least one of the following fields:\n\n(a)\n\n(b)\n\nbanking and finance;\n\nventure  capital,  private  equity  or  investment  by  way  of  lending  or\nprovision of credit;\n\n(c)\n\neconomics;\n\n(d)\n\nengineering;\n\n(e)\n\nenergy technologies;\n\n(f)\n\ngovernment funding programmes or bodies;\n\n\f31\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nthe environment sector;\n\naccountancy;\n\nlaw;\n\nclimate change; and\n\n(k)\n\nclimate resilience.\n\nAppointment of first directors\n\n3.(1)\nWhere, at the date of commencement of this Act, the Government is\nthe sole shareholder in the Bank, the Minister shall appoint 3 persons to be the\nfirst directors of the Bank in accordance with the requirements of paragraphs 1\nand 2 of this Schedule.\n\nWithin 14 days after at least 4 shareholders have subscribed for shares, the\n(2)\nauthority of the Minister to appoint directors under subparagraph (1) hereof shall\ncease and, thereafter, the shareholders shall appoint the remaining directors.\n\nMeetings of the Board\n\n4.(1)\nbut not less frequently than once every quarter.\n\nThe Board shall meet as often as the business of the Board requires,\n\n(2)\n\nThe Chairman shall preside at all meetings at which he is present.\n\nDuties of directors\n\n5.(1)\n\nEvery director shall, in exercising his duties,\n\n(a)\n\n(b)\n\nact honestly and in good faith with a view to the best interests of the\nBank; and\n\nexercise the care, diligence and skill that a reasonably prudent person\nwould exercise in comparable circumstances.\n\nIn determining the best interests of the Bank, a director must have regard\n(2)\nto the interests of the Bank as well as the interests of the employees in general.\n\n\f32\n\nChairman and Deputy Chairman\n\n6.(1)\n\nThe Board of Directors shall appoint\n\n(a)\n\n(b)\n\none of the directors to be Chairman of the Board; and\n\nanother director to be the Deputy Chairman.\n\nIn the case of absence of the Chairman or his inability to act as such, the\n\n(2)\nDeputy Chairman shall perform the functions of the Chairman.\n\nWhere both the Chairman and the Deputy Chairman are absent, or in the\n(3)\nevent  of  their  inability  to  act  thereat,  the  directors  present  and  constituting  a\nquorum  shall  elect  a  Chairman  from  among  their  number  to  preside  at  the\nmeeting.\n\nTenure of Members\n\nA Board member shall hold office for a period in accordance with\n7.\nparagraph  1(2)  of  this  Schedule  and  may  be  eligible  for  one  further\nreappointment.\n\nResignation\n\n9.\nof the Board written notice of such resignation.\n\nA director may resign his office at any time by giving the Chairman\n\nRemoval\n\n10.\nin the Companies Act, Cap. 308.\n\nDirectors may be removed in accordance with the procedure set out\n\nRemuneration\n\n11.\nbe determined by the Board.\n\nDirectors shall be paid such remuneration, fees and allowances as may\n\n\f33\n\nSpecial Meeting\n\nThe Chairman, or in the event of his absence or inability to act as such,\n12.\nthe Deputy Chairman, may at any time call a special meeting of the Board and\nmust  call  such  a  meeting  within  7  days  of  the  receipt  by  him  of  a  written\nrequisition for that purpose addressed to him and signed by any 3 directors.\n\nDecisions of the Board\n\n13.\nDecisions of the Board shall be by a majority of votes, and in any case\nwhere the voting is equal the Chairman presiding at the meeting shall have a\ncasting vote in addition to having an original vote.\n\nMinutes\n\nMinutes of each meeting shall be kept by the Secretary or such other\n14.\nofficer as the Board appoints for the purpose and shall be confirmed by the Board\nand signed by the Chairman or person presiding at the next meeting of the Board.\n\nValidity of proceedings\n\nThe validity of any proceedings of the Board shall not be affected by\n15.\nany vacancy among the directors or by any defect in the appointment of a director.\n\nSeal and execution of documents\n\n16.(1)\n\nThe seal of the Bank shall be\n\n(a)\n\nkept in the custody of the Chairman, Deputy Chairman or the Secretary\nto the Board, and may be affixed to instruments pursuant to a resolution\nof the Board and in the presence of the Chairman and the Secretary;\nand\n\n(b)\n\nauthenticated by the signature of any of the 3 persons mentioned in\nsubparagraph (a).\n\n\f34\n\n(2)\nAll documents or instruments made by the Board, other than those required\nby law to be under seal and all decisions of the Board shall be signified under the\nhand of the Chairman or the Deputy Chairman or the Secretary.\n\nQuorum\n\n17.\nquorum:\n\n(a)\n\n(b)\n\n(c)\n\nThe  following  arrangements  shall  apply  to  the  determination  of  a\n\nwhere there are 3 directors, 2 shall constitute a quorum;\n\nwhere there are 4 to 5 directors, 3 shall constitute a quorum;\n\nwhere there are 6 to 7 directors, 5 shall constitute a quorum; and\n\n(d)\n\nwhere there are 8 to 11 directors, 7 shall constitute a quorum.\n\nTemporary Leave of Absence\n\nThe Board may grant leave of absence to any director on such terms\n18.\nand conditions as may be agreed between the director and the Chairman of the\nBoard.\n\nVacancies\n\n19.\nWhere a member of the Board is absent from 3 consecutive meetings\nof the Board without excuse or approval, the seat of that director on the Board\nshall become vacant.\n\nTermination of Appointment\n\n20.\n\nThe Board may terminate the appointment of a director of the Board\n\n(a)\n\nif  the  director  is  unable  to  perform  his  duties  or  office  because  of\nphysical or mental incapacity;\n\n(b)\n\nif the director is declared bankrupt; or\n\n(c)\n\ncompounds with his creditors.\n\n\f35\n\nRegulation of proceedings\n\n21.\n\nThe Board may regulate its own proceedings.\n\n"
}