{
  "bill_id": 786,
  "slug": "resolution-to-take-note-of-20232028-national-policy-on-ageing",
  "title": "Resolution to take note of 2023-2028 National Policy on Ageing.",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/0268ed36968c1d06a323513218b39e16.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2024-04-25",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "RESOLUTION NO\n\nPARLIAMENT\n\nWHEREAS  the  Government  has  signaled  its  intention  to  promote  healthy  and\nactive ageing for the elderly and to ensure that they live with dignity in their remaining\nyears having made a significant contribution to the development of the country;\n\nAND WHEREAS the Government of Barbados is cognizant that Barbados is now\n\nan aged society;\n\nAND WHEREAS the Government of Barbados recognizes that by 2050 one in\n\nevery five persons will be over the age of 65;\n\nAND WHEREAS it is recognized that there is abuse of the elderly in various ways\n\nincluding financial abuse;\n\nAND WHEREAS the policy recognizes the significant role that the elderly can\ncontinue to play in national development if they are given more opportunities to contribute\nin various ways according to their abilities as the Government seeks to expand the silver\neconomy;\n\nAND WHEREAS the Government has engaged in extensive consultations with\n\nstakeholders within the social policy space on the National Policy on Ageing;\n\nAND WHEREAS the Cabinet has approved the National Policy on Ageing;\n\nAND  WHEREAS  the  Policy  has  been  laid  in  Parliament  to  foster  parliamentary\n\ndebate on this document;\n\nAND WHEREAS the policy recognizes eight thematic areas which are fundamental\nto  promoting  healthy  and  active  ageing  and  protecting  the  rights  of  the  elderly  and\npreventing their abuse, namely:\n\nFinancial and economic security;\nSocial security;\n\ni)\nii)\niii)  Health and health systems;\niv)  Physical and built environment;\nv)\nvi)  Legislation;\nvii)  Long term care; and\nviii)  Pandemics, disasters and emergency situations.\n\nSocial environment;\n\n\fBE IT RESOLVED that the Parliament of Barbados take note of the 2023-2028\n\nNational Policy on Ageing.\n\nAPPROVED by the House of Assembly this             day of\n\n2024.\n\nAPPROVED by the Senate this\n\n         day of                                          2024\n\nSpeaker\n\nPresident\n\n"
}