{
  "bill_id": 787,
  "slug": "resolution-to-take-note-of-barbados-population-policy-2023",
  "title": "Resolution to take note of Barbados Population Policy 2023",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/6010797976730c484ab2f5f1ad53f4e1.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-07-17",
  "first_reading": "2024-12-18",
  "gazette_date": null,
  "markdown": "# Barbados Population Policy\n\n## Barbados Population Commission\nRevised 1 February 2024\n\n1\n\n\fTable of Contents\n\nAcknowledgements ..................................................................................................................................... 4\n\nExecutive Summary ..................................................................................................................................... 5\n\nIntroduction .............................................................................................................................................. 11\n\nBarbados Development Context ............................................................................................................... 14\n\nOverview of the Population Dynamics ...................................................................................................... 16\n\nThe Population Dilemma ........................................................................................................................... 27\n\nThe Role and Vision of the Barbados Population Policy ............................................................................ 27\n\nOverarching Population Policy Objective .................................................................................................. 30\n\nPolicy Goal 1: Ensure a Population Size Sufficient to Sustain Adequate Levels of Social\nCare, Productivity, Labour Force Participation and Revenue for Inclusive and Sustainable\nDevelopment ............................................................................................................................................. 31\n\nSub-goal 1.1 Increase the Population of Persons of Working Age ............................................................ 34\n\nSub-Goal 1. 2: Enhance Family Wellbeing to Support Reproductive Decision Making ............................. 38\n\nPolicy Goal 2: Provide Barbadians and Non-Nationals Now and in the Future with\nOpportunities for Personal Development ................................................................................................. 41\n\nSub-goal 2.1: Promote and Strengthen the Care Economy ....................................................................... 41\n\nSub-goal 2.2: Expand Access to Quality Health Care and Wellness Service Interventions ....................... 43\n\nSub-goal 2.3: Improve the Capacity and Proficiency of the Labour Force with Access to Expanded\nEconomic Opportunities............................................................................................................................ 44\n\nPolicy Goal 3: Promote Integrated Settlement Development and Safeguard the\nEcological Balance ..................................................................................................................................... 48\n\nSub-goal 3.1: Reconcile Population Redistribution, Land Use and Settlement Patterns .......................... 48\n\nSub-goal 3.2: Ensure the Efficient Management of Natural Resources and the Environment ................. 49\n\nSub-goal 3.3: Strengthen Collective Resilience to the Impacts of a Changing Climate ............................. 51\n\nImplementation Framework ..................................................................................................................... 54\n\nConclusion ................................................................................................................................................. 55\n\nPopulation Policy Goals and Action Plan ................................................................................................... 57\n\nAppendix 1: Derivation of Population Size 2021 Census ........................................................................... 74\n\nAppendix 2: Population projections 2020-2050 based on the maintenance of a replacement rate since\n1980 ........................................................................................................................................................... 75\n\n2\n\n\fAppendix 3: An Examination of the Population Density and Gross Domestic Product per capita ........... 76\n\nAppendix 4: Technical Note on the potential relationship impact of population growth on economic\ngrowth ....................................................................................................................................................... 79\n\nAppendix 5: Potential Impact OECD Policy (Global minimum tax rate) on ability to make Tax/ fiscal\nPolicy ......................................................................................................................................................... 88\n\nAppendix 6: Consultations ........................................................................................................................ 89\n\nFigures\nFigure 1 Barbados Population Growth Rate- Census Year .......................................................................... 16\nFigure 2: Total Fertility Rates 1960-2017, Barbados ................................................................................... 18\nFigure 3:Live Births and Deaths- 1950 to 2020 ........................................................................................... 19\nFigure 4: Age Dependency Ratio in Barbados 1960 to 2021 ....................................................................... 20\nFigure 5: Barbados Population Pyramid, 2010 ............................................................................................ 21\nFigure 6: Barbados Population Pyramid, 2021 ............................................................................................ 22\nFigure 7: Projected Barbados Population Pyramid, 2040 ............................................................................ 22\nFigure 8:Projected Dependency Ratios in Barbados, 2020 to 2050 ............................................................ 27\n\n3\n\n\f Acknowledgements\n\nThe preparation of the draft Population Policy was led by the Barbados Population Commission\nestablished in January 2019. Members of the Commission are:\n\nDr. Yolanda Alleyne\nMs. Wainelle Alleyne-Jones (Deputy Chair)\nMs. Paula Byer\nMs. Roberta Clarke (Chair)\nDr. Jonathan Lashley\nDr. Madhuvanti M. Murphy\nMr. Pierce Rudder\nMr. Delano A Scantlebury\nMrs. Janelle Scantlebury-Mounsey\nMr. Jehroum Wood\n\nIn its work, the Commission has been supported by the Economic Affairs and Investment Division\nof  the  Ministry  of  Finance,  Economic  Affairs  and  Investment  and  by  Ms.  Wynelle  Savory,  Mr.\nPatrick McCaskie and Ms. Carolyn Waithe. The Commission had the guidance of Dr. Godfrey St.\nBernard,  Demographer of  Sir  Arthur  Lewis  Institute  for  Social  and Economic  Studies  (SALISES),\nUniversity of the West Indies.\n\nThe Commission thanks UNFPA for its support and input into the Population Situation Analysis\nand the draft Population Policy.\n\nThe Commission also appreciates the guidance received from representatives of the public sector\nand social partners and the public at a series of consultations convened between August 2020\nand April 2023.\n\n4\n\n\f Executive Summary\n\nBarbados has amongst the lowest population growth rates in CARICOM. The total population has\ngrown by just 16.5% in the last 60 years. Since 1960, birth and fertility rates have consistently\nfallen, and fertility rates have remained below replacement since 1980. Offsetting this decline has\nbeen  only  a  modest  rise  in  immigration  levels  alongside  a  decline  in  outward  migration  of\nBarbadians.  This  combination  of  factors  has  resulted  an  aging  population  structure.  Based  on\nbirth,  death  and  migration  rates,  actual  population  decline  was  expected  to  be  evident  in  the\n2030s.\n\nHowever, inconsistent with these projections, the 2021 Population Census estimates show for the\nfirst time since 1960, an actual population decline.  There are approximately 10,000 fewer persons\nresiding in Barbados in 2021 than there was in 2010.\n\nAn  aging  population,  without  any  intervention  will  result  in  consequential  decreases  in  the\nworkforce, increases in the care responsibility by a minority for the majority of the population;\ndeclines  in  government  revenues  as  the  employment  related  tax-base  contracts  and  a  likely\ndecline in economic, social and cultural dynamism.\n\nOver the next 30 years, the dependency ratio will grow to nearly two dependents per person of\nworking-age, placing strains on families and social care and security systems. Care of the elderly\nis expected to nearly double in its demand of financing from just under 20 percent of total health\nexpenditure  to  nearly  40  percent.  The  social  and  economic  costs  of  an  ageing  society  with  a\npreponderance of retired persons are broad, complex and conditional on responses.\n\nThe  current  population  structure  is  the  unintended  result  of  improvements  in  socio-economic\nconditions and the realization of human rights. With greater access to quality education, labour\nforce  opportunities  and  health  care,  including  sexual  and  reproductive  services,  Barbados  has\nseen a steady decline in birth and death rates in the post-independence period.\n\nThis population decline presents a challenge to Barbados maintaining and advancing its social and\neconomic and achievements. On the other hand, controlling the size of the population has the\nbenefits  of  reducing  the  human  footprint  on  the  environment  including  through  reduction  in\nwaste, demand for scarce water and maintaining a level of green spaces needed for sustaining\necological management.\n\nTo achieve its vision of a Barbados that is modern, socially just, innovative and productive, the\nGovernment  of  Barbados,  looking  forward,  seeks  to  respond  to  the  negative  consequences  of\npopulation decline while maintaining the positive aspects related to availability of green spaces\nand ecological balance.\n\nThis Population Policy, an instrument of planning for the future, affirms the aspirations for social\n\n5\n\n\fjustice, sustainable and inclusive development. Its overarching purpose is:\n\n“To  promote  sustainable  and  inclusive  development  and  good  quality  of  life  for\nBarbadians and residents without compromising environmental sustainability and the\nability of future generations to meet their needs.”\n\nIt outlines three inter-related policy goals. The first, which is a demographic, proposes short- and\nlong-term  approaches  to  ensuring  and maintaining  a  population  structure  to  ensure  adequate\nlevels  of  care  and  economic  and  social  vibrancy;  the  second  speaks  to  human  security  for  all\npresent  and future  generations;  and  the  third  goal  addresses  the  management  of interactions\nbetween  people  and  the  environment  to  secure  the  ecological  balance  now  and  for  future\ngenerations.\n\nThis objective can be realized through the pursuit of demographic and non-demographic\ngoals as follows:\n\nPolicy Goal 1: Ensure a Population\nSize Sufficient to Grow and Sustain\nAdequate Levels of Social Care,\nProductivity, Labour Force Participation\nand Revenue for Inclusive\nDevelopment\n\n• Sub-Goal 1.1: Increase the\npopulation of persons of\nworking age.\n\n• Sub-Goal 1.2: Enhance Family\n\nWellbeing to Support Reproductive\nDecision Making\n\nPolicy Goal 2: Provide\nBarbadians and Non-Nationals\nNow and in the Future with\nOpportunities for Personal\nDevelopment\n\n• Sub-Goal 2.1: Promote\n\nand Strengthen the Care\nEconomy across the\nLifecycle and for the\nVulnerable Populations\n\n• Sub-Goal 2.2: Expand Access\nto Quality Health Care and\nWellness Service\nInterventions\n\n• Sub-Goal 2.3: Improve\n\nCapacity and Proficiency of\nthe Labour Force with\nAccess to Expanded\nOpportunities\n\nPolicy Goal 3: Promote Integrated,\nSettlement Development and\nSafeguard the Ecological Balance.\n\n•\n\n•\n\n•\n• Sub-Goal 3.1: Reconcile Population\n\nRedistribution, Land Use and\nSettlement Patterns\n\n• Sub-Goal 3.2: Ensure the Efficient\n\nManagement of Natural Resources\nand the Environment.\n\n• Sub-Goal 3.3: Strengthen\n\nCollective Resilience to the\nImpacts of Changing Climate\n\nThe Policy addresses domains beyond those that are directly related to the size and structure of\nthe population. It does so because how the state responds to the needs of the population, how\nthe  people  take  care  for  each  other  and  how  the  ecology  and  environment  is  managed  and\nregulated  all  have  a  direct  interactive  effect  on  population  dynamics.  There  is  a  reciprocal\nrelationship between the capacity of the state to care for its people (through education, health,\nenvironmental management, social protection, human rights etc.) and the size and capacities of\nthe population to make contributions to the state through, for example, labour force participation\nand taxation measures and to communities and families through social care.\n\nThis Policy does not stand on its own but rather should be considered as a component of the\nintegrated and sectoral policy approaches that reflect the aspirations of Barbadians for a society\n\n6\n\n\fcharacterized by economic development, environmental sustainability, ecological balance, social\njustice  and  security,  food  security,  universal  access  to  sexual  and  reproductive  health,  social\ninclusion, gender equality and human rights.\n\nWhile  promoting  population  growth,  the  Population  Policy  is  not  prescriptive  about  increase\ntargets. Rather, it speaks to three main ways to achieve growth in population size. The first is\nthrough managed migration, an approach that is likely to increase the population of working age\npersons in the short- and medium term. The second is through policies that promote repatriation\nof  Barbadians  or  their  continuous  engagement  with  social  and  economic  life  though  resident\nelsewhere. The third is by supporting reproductive decision-making through the strengthening of\nan enabling and supportive environment for families.\n\nThere  are  ways  of  devising  targets  for  the  population  growth  though  with  varying  degrees  of\ncredibility.\n\nOne way would be based on the projection of what the size of the population would have been if\nfertility rates were maintained at 2.1 since 1980s and assuming the continuation of death and\nmigration trends. In such a scenario, by 2020 the population would have been 360,000 and by\n2050, it would be an estimated 400,000.\n\nAnother way of arriving at a numerical target would be to calculate actual and projected labour\nforce  needs  which  respond  to  existing  labour  force  gaps  and  to  projections  of  the  skills  and\nnumbers  of  persons  needed  to  meet  industrial  development  plans.  Setting  such  a  numerical\ntarget for an increase in the working age population has some urgency but must be informed by\nindustrial and labour force policies.\n\nAnother approach is to link population size to desired economic growth targets. The potential\nimpact,  whether  beneficial,  detrimental  or  non-existent,  between  population  growth  and\neconomic growth is, however, a complex matter. Economic growth is influenced by the structure,\nsize or composition of a country’s population but also by other factors including the social and\neconomic history of the country and the surrounding region, the structure of the economy, its\nlocation in the global political economy, and existing social and finance infrastructure and policies,\nparticularly in the areas of health, sanitation, education and governance.1\n\nIt is also possible to be guided by the population size of countries which have higher population\ndensities and higher GDP per capita than Barbados. This would include countries like Bermuda\nand Singapore. But this would be simplistic, and could not withstand scrutiny. It should be noted\nthat there are countries with a lower population density than Barbados but with a higher GDP per\ncapita (Aruba, San Marino, Republic of Korea and the Netherlands).2 And there are many countries\nwith larger populations and very poor social and economic development indicators.\n\nGiven these complexities, the Population Policy does not recommend a specific numerical goal\n\n1 See Appendix 3: Technical Note on the Potential Relationship/Impact of Population Growth on Economic Growth.\n2 Appendix 3: Technical Note: An Examination of the Population Density and Gross Domestic Product per capita\n\n7\n\n\ffor population growth, though it does recommend an incremental increase in population size can\nbe achieved through, the adoption a managed migration policy.\n\nAs  a  justifiable  starting  point,  the  formulation  of  population  targets  can  be  informed  by\nconsidering the size that the population that the country would have realized if the replacement\nfertility rate had been maintained since 1980. In this regard, by 2050, the population would have\nbeen approximately 400,000.\n\nWhile  there  is  a  lack  of  consensus  on  the  nexus  of  population  growth  and  economic  growth,\ninvestment in social capital is recognised has as a catalyst to the development of countries, which\nis also why the Population Policy includes a goal on providing Barbadians and Non-Nationals Now\nand in the Future are with Opportunities for Personal and Social Capital Development.\n\nThe demographic and supporting non-demographic goals are:\n\nGoal 1: Ensure a Population Size Sufficient to Grow and Sustain Adequate Levels of Social Care,\nProductivity, Labour Force Participation and Revenue for Inclusive Development\n\nSub-goal 1.1: Increase the Population of Persons of Working Age\n  Extend the categories of persons entitled to citizenship and permanent residence;\n  Retain and encourage repatriation of Barbadians and stem the brain drain; and\n  Promote managed migration of persons who can bring capabilities and resources to invest in\nthe future of Barbados and to contribute to areas of the economy where there are unmet\nlabour and skills requirements.\n\nSub-Goal 1. 2: Enhance Family Wellbeing to Support Reproductive Decision Making\n  Reduce the structural barriers to childbearing and support fertility decision-making\n  Ensure  non-discriminatory  and  age-appropriate  access  to  sexual  and  reproductive\n\ninformation, and services across the life cycle.\n\nPolicy  Goal  2:  Provide  Barbadians  and  Non-Nationals  Now  and  in  the  Future  are  with\nOpportunities for Personal Development\n\nSub-goal 2.1: Promote and Strengthen the Care Economy across the Lifecycle and for the\nVulnerable Population\n  Promote workplace practices that support caregiving responsibilities.\n  Promote, recognise and support equitable sharing of care responsibilities within families and\n\nbetween families and the state across the life cycle.\n\nSub-goal 2.2: Expand Access to Quality Health Care and Wellness Service Interventions\n\n\n\nImprove the capacity of health professionals in prevention, primary care, early rehabilitative\ncare, specialist and allied health areas,\n\n  Generate incentives to influence and promote healthy lifestyles and nutrition,\n\n\nImprove physical infrastructure that is conducive to greater levels of participation in physical\n8\n\n\factivities across the life cycle.\n\nSub-goal 2.3: Improve the Capacity and Proficiency of the Labour Force with Access to Expanded\nOpportunities\n\n\nImprove  primary,  secondary,  and  tertiary  education  to  strengthen  the  delivery  of  science,\ntechnology,  engineering,  and  mathematics  (STEM)  subjects  and  inculcate  innovation,\nentrepreneurial behaviour and issues related to the acquisition of soft skills.\n\n  Promotion of technical and vocational education and training (TVET) and the implementation\nof a dual-track TVET system where institutional instruction is complemented by practical work\nand experience.\n\n  Establish  partnerships  with\n\nfaith-based\norganizations, and labour unions, specifically targeting youth not in employment, education,\nor  training  (NEET)  to  assist  them  with  capitalizing  on  such  opportunities  for  training  and\nprospects for becoming employable and/or employed.\n\nfamilies,  community-based  organizations,\n\n  Continued  development  of  labour  market  data  systems  and  development  of  institutional\nlinkages for the realisation of a comprehensive labour market information system which is\naccessible and current.\n\nPolicy  Goal  3:  Promote  Integrated  Settlement  Development  and  Safeguard  the  Ecological\nBalance\n\nSub-goal 3.1: Reconcile Population Redistribution, Land Use and Settlement Patterns\n  Promotion of the designation of Predominantly Residential Areas to be areas located within\nthe  Urban  Corridor,  Stable  Suburban  Areas  and  National  Park  Villages,  and intended  to  be\ndeveloped as compact and complete communities.\n\n  Designate an extensive area outside of the Urban Corridor and National Park as a  Working\nLandscape  for  the  harmonious  co-existence  and  management  of  agricultural  production,\nrenewable energy initiatives, resource extraction, solid waste management and a mixture of\nessential infrastructural services.\n\nSub-goal 3.2: Ensure the Efficient Management of Natural Resources and the Environment\n  Strengthen an integrated decision-making framework for development initiatives to safeguard\n\nour essential ecosystem services and reduce vulnerability to natural hazards.\n\n  Ensure  that  environmental,  legal,  economic  and  social  tenets  of  Barbados’  Sustainable\nDevelopment Policy are considered in the management of population structure and size as\nwell as any population development strategies.\n\nSub-goal 3.3: Strengthen Collective Resilience to the Impacts of a Changing Climate\n  Promote forward planning through the utilisation of the national, regional and community\nphysical  development  plans  to  integrate  climate  change  as  a  cross-cutting  consideration\nacross all components of land use planning, natural resources management and development\nmanagement.\nIntroduce ecosystem-based interventions combined with existing strategies to improve\n\n\n\n9\n\n\fecosystem health, address climate change and known coastal hazards.\n\n  Strengthen governance and partnerships between the public sector, private organisations and\nnon- governmental organisations to harness scarce resources and build capacity to combat\nthe effects of climate change and the wider spectrum of disaster risk management activities.\n\n###  Implementation Framework\n\nThe Population Policy is cross-sectoral and multidimensional, and its implementation will depend\non the engagement of the Government, social partners, civil society actors, trade unions, private\nsector and communities. It should be accompanied by a plan of action developed by an Inter-\nsectoral  Implementation  Group  (ISIG)  which  will  be  the  framework  for  the  design,  financing,\nmonitoring and evaluation, collaboration, and coordination of the Plan. The Plan of Action should\nidentify responsible and lead agencies  for the implementation of the goals and sub-goals. The\nplan of action should contain time-bound commitments and be adequately resourced to ensure\naccountability for implementation.\n\nCross-cutting themes:\n\nRecurring themes from the consultations which informed this Policy are i) gender equality in the\nsharing  of  care  responsibilities  and  ii) the urgency of  education  reform away  from testing  and\ntowards an affirmative experience that draws out and values the diversities of individual skills and\ncompetencies  and  grows  cultural  confidence;  and  iii)  the  strengthening  of  environmental\nmanagement.\n\nFamily and community caregiving is still a gendered experience, given the traditional division of\nlabour which ascribes to women the predominant responsibility for care of children, the elderly\nand vulnerable populations. This work continues to go under-valued and under-recognised. While\nthere are cultural shifts, these must be accelerated through regulation, resources and education\nso that women and men can contribute to family and public life in ways that broaden their choices\nbased on mutual obligations to care and protect families.\n\nThe education sector should strengthen diverse civic engagement, labour market productivity,\nsecurity and more comprehensive experiences of fairness and inclusion. An education sector re-\nenvisaged away from the colonial and post-colonial focus on testing and realigned to the rounded\ndevelopment needs of individuals and communities is also desirable to respond to the causes and\nconsequences of the projected population trends.\n\nBarbados  has  championed  environmental  management,  and  this  must  be  sustained  and\namplified.  The  Policy  seeks  to  outline  strategies  for  managing  the  interactions  between  the\npopulation  and  the  natural  environment  to  secure  the  ecological  balance  needed  for  a  good\nquality of life now and for future generations.\n\n10\n\n\f Introduction\n\nThe Government of Barbados, sensitive to the demographic transition into an aging population,\nconstituted a National Population Commission (NPC) to analyse the implications and to prepare\nan evidence-based population policy for the period 2024-2040. This population policy outlines\nstrategies that will increase the likelihood that Barbados continues to have a population size and\nbalanced  age  structure  to  achieve  its  economic,  social  and  cultural  development  goals.  The\nBarbados Population Policy is part of planning for the future.\n\nThe Barbados Population Policy responds to projections in population structure and size based\non trends over the last 40 years:\n\n●  Consistent fertility rates below the replacement rate of 2.1 children per woman;\n●  Growth in the proportion of the elderly population;\n●  Declining percentage of persons of working age; and\n●  Higher dependency ratios due to a reducing number of persons of working age and greater\n\nproportion of elderly persons.\n\nThese trends can negatively affect economic growth, impede the capacity of the state to raise\nrevenue to meet the social care and security needs of its population, including the financing of\nuniversal  health  care,  social  security  and  education.  Additionally,  the  aging  nature  of  the\npopulation  means  that  there  will  be  increased  numbers  of  people  requiring  care  and  being\ndependent on a decreasing number of persons of working age. Declining proportions of working\nage  people  will  also  affect  the  labour  force  and  may  undermine  the  prospects  of  sustaining  a\ndynamic and diversified economy.\n\nApart from addressing the demographic trends, the Population Policy recognizes that a socially\ncohesive population is the precondition for the attainment of a modern, caring, innovative, and\nproductive society and economy. Barbadians and residents must have expanded and equitable\nopportunities to meet personal development goals, and to make contributions to the culture and\neconomy  grounded  in  feelings  of  belonging  and  obligations  of  mutual  care,  and  care  for  the\nenvironment.\n\nBarbados  should  be  characterized  by  inclusive  development,  environmental  sustainability,\necological  balance,  social  security,  food  security,  universal  access  to  sexual  and  reproductive\nhealth, social inclusion, gender equality and human rights.\n\nA population policy is part of a suite of policy measures to address the current and anticipated\ndevelopmental challenges and opportunities. Barbados is heavily dependent for its revenue on\nthe services sector and in particular tourism. With limited manufacturing, most goods used by the\npopulation are imported. This has led to balance of trade deficits over many years and increasing\nindebtedness to meet Barbados’ fuel and food needs.\n\n11\n\n\fResponding  to  an  economic  structure  that  is  dependent  on  tourism  and  with  insufficient\ndiversification, one of the goals of the government is to regenerate and sustain an economy that\nis  driven  by  and  benefits  Barbadians  who  are  equipped  with  the  capabilities  to  innovate  and\nproduce for self-reliance and to compete in the dynamic global market. As such, the population\nshould  be  knowledge-based  and  skilled  for  a  diversity  of  occupations,  thereby  increasing  the\nprospects for attracting value-added industries and providing decent working conditions.\n\nThe  post-independence  social  contract  recognizes  the  state’s  obligation  to  provide  universal\naccess to quality free education and training, quality universal healthcare, access to affordable\nland  and  housing,  the  protection  of  public  spaces  and  the  environment,  respect  for  diversity,\nfundamental freedoms, rights and responsibilities and equality under the law. The ability of the\ncountry  to  achieve  these  goals  is  critically  dependent  upon  population  structure  and  size,  its\ngrowth, its spatial distribution and its socio-demographic profile.\n\nThis  Population  Policy  affirms  the  aspirations  for  social  justice,  sustainable  and  inclusive\ndevelopment. The overarching purpose of the Barbados National Population Policy is:\n\n“To promote sustainable and inclusive development and good quality of life for Barbadians and\nresidents  without  compromising  environmental  sustainability  and  the  ability  of  future\ngenerations to meet their needs.”\n\nIt outlines three inter-related policy goals. The first, which is a demographic, proposes short- and\nlong-term approaches to maintaining a population structure to ensure adequate levels of care\nand economic and social vibrancy; the second speaks to human security for all present and future\ngenerations; and the third goal addresses the management of interactions between people and\nthe environment to secure the ecological balance now and for future generations.\n\nThe Policy addresses domains beyond those that are directly related to the size and structure of\nthe population (beyond demography). The Population Policy necessarily touches on and should\ncomplement other policy spaces, such as economic affairs, social protection and development,\ngender equality, urban planning, education, labour, the environment and health.\nIt does so because how the state and people take care of each other, and how the ecology and\nenvironment is managed, and regulated has a direct interactive effect on population dynamics.\nFor this reason, across the goals, the Population Policy emphasizes the need for contribution and\ncare. There is a reciprocal relationship between the capacity of the state to take care of its people\n(through  education,  health,  environmental  management,  social  protection,  human  rights  etc.)\nand  the  capacities  of  the  population  to  make  contributions  to  the  state  through  taxation\nmeasures and to communities and families through social care. Increasing the population size and\nstrengthening a diversity of capacities of the current population creates more opportunities for\nmore  people  to  contribute  to  the  economy,  government  revenue,  the  labour  market,  social\ndevelopment and cultural expression.\n\n12\n\n\fProcess of Policy Formulation\n\nUnder  the  auspices  of  the  Ministry  of  Finance,  Economic  Affairs  and  Investment,  a  National\nPopulation Commission (NPC) was commissioned in 2019. A Population Situational Analysis (PSA)\nwas developed based on broad stakeholder consultations and a review of the relevant literature.\nThis exercise was completed during the first quarter of 2020 and outlines the issues arising from\nan aging population to which this Population Policy responds.\n\nThis Policy was informed by the Barbados PSA and by a series of consultations with a wide cross-\nsection of stakeholder groups between July 2022 and April2023 (See Appendix 1). Through these\nconsultations, the Population Commission was guided in the development of the priority realms\nof policy that would respond to and ameliorate the challenging consequences of a declining and\naging population.\n\n13\n\n\f Barbados Development Context\n\nBarbados, like many other countries, is grappling with the lingering impacts of the Coronavirus\n(COVID-19), on the social and economic development of the country. As of June 7, 2023, there\nwere  over  767.6  million  confirmed  cases  and  approximately  6.9  million  deaths  worldwide,\nassociated with the Coronavirus pandemic. In addition to the human toll, the pandemic had a\nsevere impact on the economy, because of the preventive measures instituted globally to contain\nthe spread of the virus, inclusive of partial and full economic shutdowns as well as travel and trade\nrestrictions.  Consequently,  the  local  economy  contracted  by  12.7  per  cent  in  2020,  with  the\nAccommodation and Food services industry being the most impacted with a decline of 58.3 per\ncent recorded.\n\nFurthermore,  the  COVID-19  along  with  several  recent  natural  disasters3,  have  dampened  the\ncountry’s substantial progress towards achieving macro-economic and fiscal stability through the\nimplementation of the Barbados Economic Recovery and Transformation Plan, 2018 (BERT 2018).\nThe BERT was introduced in October 2018 as part of a four-year International Monetary Fund\n(IMF)  agreement  under  the  Extended  Fund  Facility  (EFF)  and  sought  to  rectify  the  country’s\neconomic  challenges  through  measures  to  “restore  macroeconomic  and  debt  sustainability,\naddress  falling  reserves,  and  increase  growth”4.  Within  the  decade  prior  to  2018,  the  local\neconomy  was  characterised  by  low  growth;  averaging  -0.4  per  cent  between  2008  to  2017;\nunsustainable high levels of debt, which stood at approximately 176.3 per cent of GDP at end of\n2017/18; and low foreign exchange reserves, which stood at 6.1 weeks of import cover in 2017,\nwell below the accepted international standard of twelve weeks of import cover. The country’s\nreputation as a credible borrower was also in dispute, due to multiple downgrades by credit rating\nagencies, which undermined its capacity to access the capital markets at favourable conditions.\n\nThrough the implementation of the BERT 2018, critical structural reforms were implemented in\nthe areas of growth, tax administration, State Owned- Enterprises (SOE); and fiscal, public sector\nand monetary policy. By March 2020, the gross foreign reserves increased to 18.6 weeks of import\ncover; while public debt was reduced to 117.4 percent of GDP in FY2019/20. However, the onset\nof the pandemic and recent natural disasters required extensive policy responses to alleviate the\ncurrent challenges and ameliorate the impact on household and livelihoods. As a result of the\nincrease required in public expenditure along with the contraction of the overall economy, public\ndebt to GDP rose to 151.2 per cent by the end of FY 2020/21.\n\nDespite the extensive changes in the global and local landscapes, Barbados’ economy remains\ninsufficiently diversified, with service-related industries representing the main drivers of growth.\nOver the period, 2008 to 2022, Accommodation and Food services  (12.0 per cent), Real Estate\n(9.6 per cent) and Wholesale & Retail Trade (8.9 per cent), accounted for the highest share of GDP\non average. While on average, Wholesale & Retail Trade (19.9 per cent), Accommodation\n\n3 Hurricane Elsa and the ash fall from the eruption of the La Soufriere Volcano from St. Vincent,\n4 Barbados Request for An Extended Arrangement Under the Extended Fund Facility, September 17, 2018, page 1.\n\n14\n\n\fand Food services (14.5 per cent) and Construction, Mining & Quarrying (12. 4 per cent) industries\nprovided the largest source of employment.\n\nPrivate employment has and continues to be the predominant form of employment in Barbados.\nGovernment  employment  has  increased  modestly,  while  the  most  significant  change  in\nemployment status has been among the self-employed. Self-employment increased from 12 per\ncent of the employed in 1995 to 18 per cent in 2022.\n\nThe rate of labour force participation has been declining since 1995. This is especially stark for\nyouth whose numbers have declined by almost 50 per cent between 1995 and 2017, and youth\nunemployment stands at 35.1% as at 2022. The rate of inactivity among youth is high in part due\nto youth being in education or job training. However, there is an estimated 18 per cent of youth\nin  2010,  who  were  not  in  employment,  education  or  training  (NEET).  There  has  also  been  an\nincrease in the number of people who are unemployed for an extended period.\n\nThe effects of the pandemic on the economy increased levels of unemployment, from a rate of\n10.1 per cent in 2019 to 14.1 per cent in 2021. However, as the country enters a post-COVID-19\nperiod,  there  are  favourable  signs  recovery,  particular  in  the  tourism  sector,  with  stay-over\narrivals rebounding to 63.9 per cent of pre-COVID- 19 levels in 2022. Unemployment fell to 8.4\nper cent in 2022 and an improvement was also observed in the country fiscal position as debt to\nGDP ratio fell to 125 per cent GDP in July 2022.\n\nTo  support  of  the  country’s  recovery  process,  the  Government  of  Barbados  introduced  the\nBarbados Economic Recovery and Transformation Plan 2.0 in 2022, which seeks to maintain the\ngains achieved under BERT 2018 and complete the intended “structural reforms to better position\nthe country for macroeconomic stability and medium-term growth.” This will include the pursuit\nof:\n  a growth policy that advances developments in the areas of energy, tourism, transport and\nagriculture; enhances the local business environment; and incentivise the green transition and\nbuilding climate resilient infrastructure.\nthe requisite fiscal strategy and public sector reforms to support entry into international\ncapital markets;\n\n\n\n  a debt management strategy, to position the country towards a path of debt sustainability;\n\n\n\nand\ninitiatives which promote social cohesion and eradicate poverty, inclusive of investments in\nskill training and education, and low- income housing.\n\n15\n\n\f Overview of the Population Dynamics\n\nThe Barbados Population Situation Analysis (PSA) outlines current Barbadian population dynamics\nand the impact on economic development, labour market conditions, spatial planning and the\nuse of health services and environmental management. Key trends which shape the Population\nPolicy include:\n\nPopulation Size and Growth\n\nIn 1960, the size of the population of Barbados was approximately 230,980. At the time of the\n2010 Population and Housing Census, the population of Barbados was approximately 277,821 of\nwhich 52 percent were female and 48 percent male. By the 2021 Population and Housing Census,\nthe population was estimated at 269,090 persons, a decrease of 8,731 persons since 2010.5 In\nessence, between 1960 and 2021 the population of Barbados only increased by 16.5%.\n\nFigure 1 Barbados Population Growth Rate- Census Year\n\n### Barbados Population Growth\n\n300,000\n\n250,000\n\nn\no\ni\nt\na\nu\np\no\nP\n\nl\n\n200,000\n\n150,000\n\n100,000\n\n50,000\n\n0\n\nPopulation\n\n1844 1851 1861 1871 1881 1891 1911 1921 1946 1960 1970 1980 1990 2000 2010 2021\nCensus Years\n\nCurrent age and sex structure\n\nThe 2021 Census also shows that 21% of the population is under 18, 59% of the population is\nbetween 20-64, (and 21% are between 50-64) and 19% are over 64.\n\n5 See Appendix 1: Technical Note on Population Size at 2021\n\n16\n\n\f5 Year Age-Group\n\nSex\n\nPercentage\n\nBoth Sexes  Male\n\nFemale  Both Sexes  Male\n\nFemale\n\nAll Ages\n\n269,090\n\n130,037\n\n139,053\n\n0 - 4.\n5 - 9.\n10 - 14.\n15 - 19.\n20 - 24.\n25 - 29.\n30 - 34.\n35 - 39.\n40 - 44.\n45 - 49.\n50 - 54.\n55 - 59.\n60 - 64.\n65 - 69.\n70 - 74.\n75 - 79.\n80 - 84.\n85 & Over\n\n11,916\n16,393\n14,535\n17,211\n16,117\n15,955\n16,215\n17,495\n17,341\n18,609\n18,507\n19,655\n19,123\n17,590\n12,958\n8,324\n5,609\n5,537\n\n6,238\n8,523\n7,557\n8,798\n8,304\n7,930\n7,990\n8,398\n8,238\n8,906\n9,081\n9,204\n8,993\n8,051\n6,034\n3,594\n2,344\n1,854\n\n5,678\n7,870\n6,978\n8,413\n7,813\n8,025\n8,225\n9,097\n9,103\n9,703\n9,426\n10,451\n10,130\n9,539\n6,924\n4,730\n3,265\n3,683\n\n4%\n6%\n5%\n6%\n6%\n6%\n6%\n7%\n6%\n7%\n7%\n7%\n7%\n7%\n5%\n3%\n2%\n2%\n100%\n\n2%\n3%\n3%\n3%\n3%\n3%\n3%\n3%\n3%\n3%\n3%\n3%\n3%\n3%\n2%\n1%\n1%\n1%\n48%\n\n2%\n3%\n3%\n3%\n3%\n3%\n3%\n3%\n3%\n4%\n4%\n4%\n4%\n4%\n3%\n2%\n1%\n1%\n52%\n\nLive Births and Fertility\n\nThe number of live births in Barbados has declined from a maximum of more than 7,000 annually\nduring the 1950s and early 1960s to a low in the vicinity of 2,500 in 2018. The total fertility rate\n(the average number of live births per woman in the reproductive age groups) declined from 4.3\nin 1960 to 1.8 in 2017. Barbados is therefore currently below the replacement fertility level of 2.1\nchildren per woman. Adolescent fertility, while significant, declined from 50.5 per 1,000 girls aged\n15-19 in 2000 to 33.6 per 1,000 girls aged 15-19 in 2015.6\n\n6 Source: United Nations Population Division. World Population Prospects 2019. File FERT/7: Age specific fertility\nrates estimates by region, subregion, and country. Available at\n https://population.un.org/wpp/Download/Standard/Fertility/\n\n17\n\n\fFigure 2: Total Fertility Rates 1960-2020, Barbados7\n\n### Total Fertility Rate\n\ne\nt\na\nR\ny\nt\ni\nl\ni\nt\nr\ne\nF\n\n5\n\n4\n\n3\n\n2\n\n1\n\n0\n\n1960\n\n1970\n\n1980\n\n1990\nYear\n\n2000\n\n2010\n\n2020\n\nDeaths and Mortality\n\nBetween  1950  and  the  mid-1980s,  the  annual  number  of  deaths  declined  notably.  The  life\nexpectancy  at  birth  for  2021  was  estimated  to  be  77.4  years,  which  is  amongst  the  most\nfavourable for  CARICOM  countries.  This  is  attributable  to  improvements  in  public  health  care,\nwater and sanitation, as well as the positive impacts of public health on infant and child mortality.\n\nis\n\nThe health profile of Barbados has significantly changed over the past 50 years. There has been a\ntransition from diseases related to malnutrition, poor sanitation and infections to a disease profile\nthat\nimpacted  by  chronic  non-communicable  diseases  (NCDs),  new  and  emerging\ncommunicable diseases, a rapidly aging population and climate change. The primary burden for\nthe health system is related to NCDs. Among the Barbadian population, almost 40% have one or\nmore  of  the  risk  factors  for  NCDs.  Not  unexpectedly,  there  has  been  an  uptick  in  death  rates\nassociated with an aging population and prevalence of NCDs.\n\nPopulation Growth Due to Natural Increase\n\nThis steady decline in the number of live births, and the rising number of deaths (associated with\nthe aging Barbadian population) means that the population growth rate will continue to fall. At\nthe point where the number of live births and the number of deaths is equal, the population of\nBarbados will stop increasing, unless offset by high levels of net migration.\n\n7 https://databank.worldbank.org/source/population-estimates-and-projections\n\n18\n\n\fFigure 3:Live Births and Deaths- 1950 to 2020\n\nLive Births and Deaths\n\n9000\n\n8000\n\n7000\n\n6000\n\nn\no\ni\nt\na\nu\np\no\nP\n\nl\n\n5000\n\n4000\n\n3000\n\n2000\n\n1000\n\n0\n\nBirths\n\nDeaths\n\n ear\n\nInternational Migration\n\nBarbadians, like other Caribbean people, have emigrated primarily for educational, income and\nquality of life considerations. Such emigration was most marked in the post-independence period\nbetween  1965-1980.  With  the  tightening  up  of  immigration  laws  in  the  traditional  receiving\ncounties (UK, US, and Canada), emigration has decreased significantly though there continues to\nbe movement between Caribbean states, especially since the institution of free movement in the\nCaribbean Single Market and Economy regime.\n\nImmigration  has  also  been  significant  and  the  UN  projects  that  as  much  as  12  percent  of  the\nresident population of Barbados are immigrants, mainly from other Caribbean countries such as\nGuyana, St. Vincent and the Grenadines, St. Lucia and Trinidad and Tobago. Over half (55 percent)\nare women and three quarters are aged 15-64 years.8\n\nStill, it is estimated that Barbados has a net loss of population of approximately 400 persons per\nannum due to migration; that is, the number of emigrants from Barbados exceeds the number of\nimmigrants entering Barbados by on average 400 persons.\n\n8 UN DESA : International Migrant Stock. Country Profile Barbados 2019\n\n19\n\n\fChanging Age Dependency Burden\n\nDeclining  fertility  rates  have  resulted  in  smaller  families  with  a  smaller  burden  of  childcare\nobligations (fewer children in the home). As a result, the youth dependency ratio (the population\nyounger  than  15  years  relative  to  the  working-age  population,  15-64  years)  has  been  steadily\ndecreasing and was 29 per 100 as of 2016. This decreasing burden of care for the young however\ncontinues  to  be  offset  by  increases  in  the  elderly  dependency  ratio  (population  of  older\ndependents over 64 years relative to the working-age population aged 15-64 years) which in 2016\nwas estimated at 22 per 100 and expected to reach 33.3 per 100 by 2025.\n\nThe overall age dependency ratio in Barbados is calculated to be 49 per 100 in 2021. This is a\nsignificant decrease from 75.7 in 1960.9 Given the stabilization of fertility rates and the increases\nin  the  population  65  years  or  older,  there  will  be  fewer  people  of  working  age  in  contrast  to\npopulations under 15 and over 64.\n\nFigure 4: Age Dependency Ratio in Barbados 1960 to 2021\n\n## Age Dependency Ratio 1960-2021\n\no\ni\nt\na\nR\n\n100\n\n50\n\n0\n\n1960\n\n1970\n\n1980\n\n1990\n\n2000\n\n2010\n\n2013\n\n2015\n\n2021\n\nYear\n\nAge dependency ratio\n\nOld\n\nYoung\n\nSource: World Bank Data: https://data.worldbank.org/\n\nPopulation Redistribution\n\nTwo-thirds of the population resides along the “Urban Corridor” situated less than two kilometres\nfrom the coastline. Economic activity related to tourism and infrastructure concentration in and\nnear coastal zones increases Barbados’ vulnerability to the impacts of climate change such as sea\nlevel  rise  and  storm  surge.  Coastal  zone  development  has  also  degraded  marine  habitats,\nespecially coral reefs which have declined in mass by 70% since the 1970s.\n\nThere  has  been  outward  migration  from  St. Michael and the  City of  Bridgetown  and  from the\neastern parishes of St. John, St. Joseph and St. Andrew between 1970 and 2010. Concomitantly,\n\n9 https://databank.worldbank.org/source/population-estimates-and-projections\n\n20\n\n\fthere has been population growth in suburban and peri-urban areas in the parishes of St. James,\nSt. Thomas, St. George and Christ Church, and in many rural areas of the parish of St. Philip. In\nthese parishes, there has been significant land conversion from traditionally agricultural use to\nresidential and commercial development.\n\nPopulation Density\n\nUsing the latest census data, Barbados had an overall population density of 622 people per square\nkilometre. Even though this is a decrease from 2010 (666), Barbados still has the highest density\namong  member  states  of  the  Caribbean  Community  (CARICOM),  though  not  as  high  as  non-\nCARICOM countries of St. Maarten and Bermuda, which have population densities of 1,261 and\n1,185 persons per square kilometre, respectively.\n\nProjected Population Size in Barbados 2020-2040\n\nPrior to the data from the 2021 census, projections based on fertility and mortality trends, and\nwith  no  catastrophic  events  resulting  in  migration  to  or  from  Barbados,  suggested  that  the\npopulation  of  Barbados  was  expected  to  peak  at  290,000  sometime  around  2029  and  then\nprojected to begin a gradual decline in its size in the 2030s.\n\nWithin that scenario, the size of the working-age population, 15-64 years, was projected to peak\naround the year 2021/2022 at 189,730. While the proportion of those under 15 was expected to\ncontinue to decline, with consistent increases in the number of elderly people aged 65 years or\nolder  between  2020-2050.  However,  the  population  size  data  for  2021  already  suggests\npopulation decline- 269,090 from 277,821 in 2010.\n\nFigure 5: Barbados Population Pyramid, 2010\n\n21\n\n\fFigure 6: Barbados Population Pyramid, 2021\n\nFigure 7: Projected Barbados Population Pyramid, 2040\n\nProjected Non-demographic impacts\n\nPossible decreases in state revenue\n\nOne of the main sources of government revenue is taxation on income as well as on consumption\nof  goods  and  services.  Reduced  population,  particularly  in  the  cohort  of  the  working  age,  can\ndecrease revenue derived from employment-related taxation measures. Similarly, decreases in\npopulation size can also affect the levels of consumption and therefore revenue generated\n\n22\n\n\fthrough  value-added tax.  Given  the  structure of the  current economy  and  labour  market,  it  is\nunlikely that the levels of taxation derived from employment and consumption, can be increased\nto offset the reduced numbers of persons of working age.\n\nDecreases  in  taxation  revenues  will  directly  impact  the  state’s  capacity  to  maintain  and\nstrengthen social development approaches such as universal education and health care, as well\nas infrastructure, and economic development measures.\n\nState revenue needs can be addressed through macroeconomic approaches that focus on such\nactivities as attracting foreign direct investment and expanding domestic production and exports.\nHowever, revenue flows from taxation on investments are subject to international taxation rules\nand are not within the control of the Barbadian state. 10\n\nSocial Security and Social Protection\n\nSimilarly, declining numbers of people of working age and increases in retired persons has a direct\nimpact  on  the  sustainability  of  the  social  security  scheme.  In  all  but  one  year  since  2014,\nexpenditure  exceeded  contribution  income  under  this  programme.  Between  2018-2020,  the\nnumber  of  NIS  contributors  decreased  each  year,  while  the  number  of  pensioners  and  total\npension payouts increased each year. With continued population trends, the total expenditure of\nthe National Insurance Fund is expected to exceed total income each year and therefore, the Fund\nis expected to be depleted between 2034 and 2041.11\n\nWhile there are demands on the state to provide national assistance and care facilities for the\nelderly, other sub-populations are beneficiaries of social protection through a variety of state-\nsponsored programmes. There are also cash and in-kind benefits including National Assistance\nGrants, food vouchers, disability grants, foster grants and assistance with rental, burial and house\nrepair. For the benefit of children attending school, there are student support schemes including\nschool feeding programmes, uniforms provision, textbooks loan programmes, examination fee\nsubsidies and free transport. Day care services are made available by the state and target poor\ninfants and young children, while a range of social care services targeting different constituents\n\n10 In October 2021, 137 countries under the Organisation for Economic Co-Operation and Development (OECD)/G20\nInclusive Framework for Base Erosion and Profit Shifting Project, agreed to a two-pillar strategy to reform the global\ntax regime, to tackle tax avoidance, improve the coherence of international tax rules, ensure a more transparent tax\nenvironment and address the tax challenges arising from digitalization. Part of the reform is said to be to dissuade\nunproductive/ ineffective tax competition among countries, by instituting a floor corporate tax rate. The long-term\nimplications of these global rules domestically is unknown but it is recognized that the adoption of these measures,\neffectively removes the ability of developing countries such as Barbados to utilize low tax based incentives as part of\ntheir toolkit to attract investment and compete on the global stage.\nSee Technical Note 3: the Potential Impact OECD Policy (Global minimum tax rate) on ability to make Tax/ fiscal Policy\n\n11 Barbados National Insurance Scheme 17th Actuarial Review of the National Insurance Fund, Unemployment Fund\nand Severance Fund as of December 31, 2020. July 22, 2022\n\n23\n\n\finclude counselling for troubled families and children, counselling services for abused women,\nhomes for children and the elderly, and home-based care for the elderly.\n\nThe  anticipated  reductions  in  income  and  consumption  taxation  revenue  due  todeclining\npopulations  of  working  age,  unless  offset  by other  taxation  measures,  will  also  jeopardize  the\nstate’s  capacity  to  maintain  and  expand  social  protection.  State  incapacity  to  deliver  social\nprotection services is also likely to have a disproportionately negative effect on women given the\ntraditional division of labour within which women bear the responsibility of care for children, the\nsick and the elderly.\n\nLabour Supply\n\nCurrent  trends, if they persist,  will  yield declines  in  the  prospective  numbers  of  young  people\nentering the labour market during periods when increasingly larger numbers of older people will\nbe  exiting the  labour  market.  Such  changes  will  place  increasing  levels of  stress  on  the  labour\nforce which would witness a decline in its size commencing in 2035.\n\nThe impact on the economy because of these changes in the supply of labour include declines in\nthe savings rate as older persons draw down on their assets to support themselves, likely declines\nin productivity, creativity and innovation, and taxation revenue reductions. Additionally, as the\npopulation ages, the state will have to increase provisions for social security and social protection\nprogrammes  targeting  a  large  and  growing  elderly  population,  especially  those  who  would  be\nliving on the margins and classified among the vulnerable because they are poor and/or without\nfamily support.\n\nHealth Care\n\nProjected  increases  in  the  number  of  persons  over  65  are  accompanied  by  the  prevalence  of\nchronic non-communicable diseases, especially diabetes and hypertension. Barbados has been\ncharacterized as having an adult population that is overweight (2 in every 3 people) and obese (1\nin every 3 people) with females being more overweight/obese than males. For the period 2020-\n2050, forecasts indicate that the care of the elderly may account for just under 20 percent of total\nhealth expenditure. This is further compounded by the fact that the growing population of elderly\npersons may create a need for increasingly greater allocations of space in elder care facilities due\nprincipally to concomitant changes in the family dynamics, work arrangements and the structure\nof households.\n\nFamily Arrangements and Care\n\nA larger proportion of men live alone than women whose households tend to be larger and may\nnot  include  employed  male  adults.  Poor  female-headed  households  have  higher  dependency\nlevels amounting to 74.8% non-earners per household compared to 68.6% in the case of poor\nmale-headed households.\n\n24\n\n\fIn Barbados, elderly persons mostly live within private households with just 4% being resident in\ninstitutions of care.\n\nA higher proportion of older adults receive rather than provide support, regardless of  whether\nthey live with or away from their children. Women, and in particular daughters, are principally\nthe  primary  caretakers  of  the  elderly  providing  them  with  physical,  emotional  and  financial\nsupport. Moreover, elderly mothers have higher odds of receiving all forms of support from their\nchildren  when  compared  to  fathers.  Among  those  in  institutions  of  care,  63%  are  men  and  in\ngeneral, older men are more likely than older women to be isolated from familial networks of\ncare.\n\nIt  is  likely  that  more  older  men  are  in  institutional  care  because  of  being  isolated  from  their\nfamilies due to life choices made during their working ages. Certainly, nearly one third of men live\nalone according to the 2010 census. Adult women are less likely to live alone, having  regard to\nthe female realm of responsibility for the care of children and the elderly.\n\nPlanning for care of the elderly will have to include a focus on socialization to ensure that, on an\nequal  basis  with  women,  men  understand  the  obligation  and  value  of  sharing  of  care\nresponsibilities across their life cycle, and for the emotional, physical and material care of their\nchildren. That will ensure their integration, on a basis of reciprocity, within familial care bonds.\n\nSpatial Infrastructure and the Environment\n\nTraditionally,  there  has  been  a  concentration  of  residential  and  commercial  properties  along\nnarrow  coastal  strips  of  land  primarily  along  the  west  and  south-western  coastal  areas  of\nBarbados. There are the usual concerns surrounding that balance between changes in population\nsize attributes and the supply of housing and land use choices.\n\nPopulation  redistribution  away  from  coastal  areas  has  resulted\nin  new  housing  units\nmushrooming in spaces previously the preserve of agricultural production. This population spread\nhas been  accompanied by a  reliance on  the  private ownership of  automobiles,  the  number  of\nwhich has increased notably in Barbados during the last two decades. The average annual growth\nrate  in  the  motor  vehicular  population  in  Barbados  has  been  3.85%,  notably  greater  than  the\nacceptable standard of 2.5% which prevails internationally. The continued car-centric planning\nevidenced  by  the  rise  of  several  sub-urban  shopping  complexes  and  new  suburban  dormitory\nsettlements without basic neighbourhood services may be linked to increased inactivity among\nindividuals  and  chronic  non-communicable  diseases  as  well  as  the  slow  death  of  traditionally\nvibrant  historic  coastal  centres  like  the  capital,  Bridgetown,  as  many  businesses  and  residents\nhave moved away.\n\nPolicies promoting increased population must be accompanied by a land use policy to prevent\nand/or  mitigate  habitat  loss,  pressure  on  biodiversity  and  reduced  cultivable  land,  the  latter\nplacing threats on the island’s capacity to build resilience regarding its food security.\n\n25\n\n\finfrastructural\n\nincreases  will  require\n\nintegrated  solid  waste\nPopulation\nmanagement systems, public utility networks, transportation systems and health and educational\nservices.  This  has  implications  for  the  delivery  of  quality housing  stock,  social  and  community\nservices and commuting patterns. The State’s capacity to increase the nation’s water supply in\naccordance  with  prospective  increases  in  population  size  at  the  national  level  and  more\nparticularly within emergent urban enclaves are major concerns to be considered.\n\ninvestments\n\nin\n\n26\n\n\f The Population Dilemma\n\nBarbados is likely to have progressed past that window of opportunity known as the demographic\ndividend characterized by a relatively large working-age population due to declining fertility and\nincreasingly smaller populations in the childhood stages of the life cycle, and relatively smaller\nbut gradually growing elderly populations. Such an age structure is highly advantageous because\nit results in increased proportions of people of working age being active in the economy and as\ncare providers for young and elderly dependents.\n\nAlready by 2021, Barbados has seen an actual decline in population, a decline that was projected\nto  take place  a  decade  later.  Without  any interventions,  the  size  and  structure  of  Barbados  is\ncertain to continue in a manner consistent with a rapidly aging society with a high dependency\nratio.\n\nFigure 8:Projected Dependency Ratios in Barbados, 2020 to 2050\n\nf\no\nn\no\ns\nr\ne\np\nr\ne\np\ns\nt\nn\ne\nd\nn\ne\np\ne\nD\n\ne\ng\na\ng\nn\ni\nk\nr\no\nw\n\n0.8\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n2020\n\n2025\nYoung Dependents\n\n2030\n\n2035\n\nOld Dependents\n\n2040\n\n2045\nTotal Dependents\n\n2050\n\nSource: Barbados Statistical Service\n\nPopulation aging has social and economic implications. These include an eventual decline in the\npopulation of working age, declining rates of labour force participation and workforce shortages\nas  retirees  outnumber  new  entrants  to  the  workforce.  There  are  also  likely  to  be  greater\nprospects  of  a  decline  in  savings  rate  as  older  persons  draw  down  on  their  assets  to  support\nthemselves; a decline in productivity and innovation; and increased burden of care not only for\nfamily members but also for the state through social security and social protection programmes.\n\nWith an aging population, the fiscal balancing act of ensuring revenue generation sufficient to\nmeet core public sector expenditure is threatened. Economic productivity and dynamism cannot\nbe assured without a working-population that is well-educated, versatile, innovative, creative and\nsufficient in size to make the contributions needed to care for children, the elderly and others\nwho are dependent on the state.\n\nGiven  the  current  population  projections,  unless  interventions  are  developed,  Barbados  will\nbecome a steadily greying society and the state’s capacity to maintain the expected social\n\n27\n\n\finvestments  will  be  compromised  and  the  benefits  of  a  more  youthful  population  will  be\ndiminished.\n\nIt must be pointed out that a shrinking population can also have positive effects, particularly for\nthe  environment.  The  benefits  can  include  reduced  strain  on  resources  (e.g.,  less  traffic\ncongestion,  pollution,  waste,  water  use  etc.),  decreased  dependencies  at  individual  and\nhousehold  levels,  reduced  state  expenditure  on  some  kinds  of  infrastructure  associated  with\npopulation  usage  and  greater  levels  of  disposable  income  for  some.  A  low  or  no  growth\npopulation  trend  can  also  enhance  the  expansion  and  access  to  green  spaces  important  for\ncommunity life and wellbeing.\n\nAdditionally, there are technologies available to undertake many tasks previously associated with\npeople across a range of sectors in both the public and private sectors. Automation, digitalization,\nuse of robotics and artificial intelligence are replacing traditional jobs, and particularly relatively\nunskilled  and  low  paying  sectors.  Automation  is  also  associated  with  increased  efficiency,\nproductivity and economic growth  and therefore population size and structure needs must be\naligned with the effects of the acceleration of use of technologies and artificial intelligence.\n\nStill,  the  negative  consequences of  an  aging  population  must  be addressed to  ensure that  the\nBarbadian state can fulfil its social contract and has the capacity to facilitate a decent quality of\nlife  across  the  life  cycle.  The  challenge  in  increasing  the  population  size  is  to  ensure  that  all\nresidents  can  enjoy  productive  lives  and  attain  personal  development  goals  while  centring\necological and environmental conservation.\n\n28\n\n\f The Role and Vision of the Barbados Population Policy\n\nThe  socio-economic  objectives  of  the  government  can  be  gleaned  from  the  two  Barbados\nEconomic  Recovery  and Transformation  Plans  (BERT)  2018  and  2022. This  plan  is  projected to\ntransform  the  public  finances  and  the  economy  of  Barbados  toward  promoting  a  new,  high-\nskilled, knowledge-based and more diversified economy. The objectives outlined are seen also as\na  precondition  for  reducing  poverty  and  inequality  through  increasing  resources  available  for\nsocial expenditure, generating employment and maintaining social protection schemes. It aims to\nrestore debt and fiscal sustainability, and key to this is investments in skills.\n\nThe ability of the country to embark on activities to achieve these social, economic, institutional\nand environmental goals is partly dependent on the size, growth, distribution and structure of its\npopulation as well as its investment in its human capital. Additionally, the nature and scope of\nthese activities ought to be formulated, designed and implemented to optimally serve the future\nneeds of the Barbadian population of all generations.\n\nA population policy complements and should be aligned to national and sectoral development\npolicies in so far as it outlines how the population size and structure can contribute to the meeting\nof economic, social and environmental development objectives.\n\nThis Population Policy responds primarily to the challenges associated with an aging population\nand complements measures for achieving the short and long-term developmental objectives. It is\npredicated on the understanding that Barbados is a social democratic state where the state has\nobligations:\n\n●  The state has the primary responsibility for human resource development (education, health)\n\nand the social protection of vulnerable populations.\n\n●  The state has a regulatory obligation regarding the ‘market’ - labour laws, financial\n\nregulations, industrial policy etc.\n\n●  The state has an obligation to regulate the use of natural resources to preserve benefits for\n\ncurrent and future generations.\n\n●  The state has an obligation to establish regulatory frameworks for the orderly and progressive\n\ndevelopment of land.\n\n●  The state has redistributive obligations using tax and non-tax measures to address poverty\n\nand inequalities.\n\n●  The state has an obligation to establish protective measures to secure its population and\n\neconomy from extreme climatic events.\n\n●  The state has a role to facilitate social interaction at household and community levels to\n\npromote social care, social solidarity and cultural vibrancy and resilience.\n\n29\n\n\fPopulation Policy Principles and Goals\n\nThe Population Policy is guided by national development aspirations and policies, and national,\nregional, and international human rights commitments to fairness, equality, non-discrimination\nand social justice. In accordance with the International Conference on Population Development\nand the Sustainable Development Goals, the Policy places individual dignity and human rights at\nthe heart of development.\n\nIt is predicated on Caribbean regionalism and is informed by the Revised Treaty of Chaguaramas\nand the CARICOM Single Market and Economy. The Policy must be implemented in a manner that\nis consistent with ecological balance and environmental sustainability.\n\nOverarching Population Policy Objective\n\nThe overarching policy objective of the Barbados Population Policy is:\n\n“To promote sustainable and inclusive development and good quality of life for Barbadians and\nresidents  without  compromising  environmental  sustainability  and  the  ability  of  future\ngenerations to meet their needs.”\n\nThis objective can be realized through the pursuit of demographic and non-demographic\ngoals as follows:\n\nPolicy Goal 1: Ensure a Population\nsize Sufficient to Grow and Sustain\nAdequate  Levels  of  Social  Care,\nForce\nProductivity,\nParticipation  and  Revenue\nfor\nInclusive Development\nDevelopment\n\nLabour\n\nSub-Goal 1.1: Increase the\nPopulation  of  Persons  of\nworking age.\n\nSub-Goal  1.2:  Enhance  Family\nWellbeing to Support Reproductive\nDecision Making\n\nPolicy Goal 2: Provide Barbadians\nand Non-Nationals Now and in the\nFuture with Opportunities for\nPersonal Development\n\nPolicy Goal 3: Promote Integrated,\nSettlement Development and\nSafeguard the Ecological Balance.\n\nthe\n\nSub-Goal  2.1:  Promote  and\nCare\nStrengthen\nEconomy across the Lifecycle\nand\nfor  the  Vulnerable\nPopulations\n\nSub-Goal  2.2:  Expand  Access  to\nQuality  Health\nand\nWellness Service Interventions\n\nCare\n\nSub-Goal 2.3: Improve Capacity\nand  Proficiency  of the  Labour\nForce with Access to Expanded\nOpportunities\n\nSub-Goal\n3.1:\nPopulation Redistribution, Land\nUse and Settlement Patterns.\n\nReconcile\n\nSub-Goal 3.2: Ensure the Efficient\nNatural\nManagement\nResources and the Environment.\n\nof\n\nSub-Goal  3.3:  Strengthen\nCollective  Resilience  to  the\nImpacts  of  a  Changing\nClimate.\n\n30\n\n\fPolicy Goal 1: Ensure a Population Size Sufficient to Grow and Sustain Adequate Levels of\nSocial  Care,  Productivity,  Labour  Force  Participation  and  Revenue  for\nInclusive\nDevelopment\n\nBarbados needs both short-term and long-term approaches to ensure that it has the capacities\nthat provide a foundation for the State and for the people to take care of each other now and in\nthe future. Capabilities for caregiving are regenerated within the family and household through\nintergenerational care, access to education, health, social services, and employment. The State is\ncapacitated through the generation of income and taxation revenue to maintain, modernise and\nexpand social security and infrastructure and reduce poverty through education, health and social\nprotection mechanisms.\n\nAn increase in population size, and especially those of working age, is just one component of such\napproaches.\n\nLabour force gaps and their effects can also be addressed through realignment of educational\nprocesses to address structural barriers to achievement, and to meet current and projected skill\nand expertise needs. The use of automation, information, digitization and artificial intelligence\ntechnologies can also offset the negative effects of a reduced working age population. All these\nmeasures should also enhance productivity.\n\nStill, there is a certain irreducibility to the need for human care across the life cycle. And with an\neconomy that is oriented towards the service industries, maintaining a working age population\nsize that reduces dependency rates, and allows for sustained and reliable contributions to the\nlabour market, government revenue through taxation and social insurance schemes is vital.\n\nIn defining the size and structure of the population needed in the future, sustainability is a key\nconsideration.  Account  must  be  taken  of  natural  resources,  preservation  of  biodiversity,\nenvironmental  and  infrastructural  carrying  capacity,  support  for  cultural  and  technological\ncreativity and  the  state’s  capacity to  provide basic  services.  Population size  increases must  be\ninformed by the limits beyond which human use will deplete the country’s non-renewable natural\nresources.\n\nBut carrying capacity is not static and can be expanded by the application of technology which\nadapts  and  expands  infrastructural  and  other  resources  and  services.  The  application  of\nagricultural technologies can increase food yields, desalination plants can increase water supply,\nand  efficient  public  transportation  can  lead  to  less  congestion  and  a  reduction  of  private  car\nusage. Regulations can be put in place that improve the collection of water, the use of vehicles\nand mandatory recycling to reduce the demand for waste disposal services. All these approaches\nto expanding carrying capacity require careful planning and significant capital outlay.\n\nConsideration  of  resources  and  infrastructural  and  environmental  carrying  capacity  must  also\ntake  account  of  the  fact  that  Barbados  has  a  transient  tourist  population  of  approximately\n500,000 annually. There are also cultural dimensions to carrying capacity given concerns for\n\n31\n\n\fpopulation  density,  the  association  of  large  families  with  poverty  and  the  strong  sense  of\nBarbadian identity.\n\nWith these caveats and considerations, an incremental approach to population growth over the\nperiod 2021-2050 which would contribute directly to meeting unmet labour force needs and bring\nin added human resources, is recommended. This would include an increase the population in\nthe short-term in response to economic and labour force needs (migration), and an expansion of\nthe options of the population to make reproductive decisions towards child bearing with possible\nimpacts on increased fertility rates in the medium term.\n\nWhile this Policy does not prescribe a number by which the population should be increased, it is\nevident  that  the  phenomenon  of  an  ageing  and  eventually  declining  population  must  be\naddressed as part of planning for the future.\n\nThe policy outlines three main approaches to increasing the population to meet the current and\nfuture  development  goals.  The  first  is  through  managed  migration,  an  approach  targeted  at\nincreasing the population of working age persons in the short- and medium term. This approach\nis recommended to meet immediate or projected labour force gaps to drive economic growth.\nThe  second  is  through  policies  that  promote  repatriation  of  Barbadians,  either  permanent,\ntemporarily  or  transitory.  The  third  is  through  supporting  pro-fertility,  reproductive  decision-\nmaking through the strengthening of an enabling and supportive environment for families. This is\na longer-term strategy, the quantitative outcomes of which are unpredictable and uncertain given\nthe non-negotiability of women’s rights to decide the number and spacing of their children.\n\nThere  are  ways  in  which  population  growth  targets,  (immediately  through  the  promotion  of\nimmigration and longer-term through a combination of migration and increases in birth rates),\ncan be devised but with varying degrees of credibility.\n\nOne way would be based on the projection of what the size of the population would have been if\nfertility rates were maintained at 2.1 and without any dramatic variation in the trends of death\nor  migration  rates.  Under  these  circumstances  Barbados  would  have  a  population  of\napproximately 400,000 by 2050, that is, a natural increase of approximately 185,000 people.12\n\nAnother way of arriving at a numerical target would be to calculate actual and projected labour\nforce needs which correspond to existing labour force gaps and to projections of the skills and\nnumbers of persons that could support the implementation of an industrial development plan.\nThese policy parameters are not currently available.\n\nHowever setting and meeting such a numerical target based on labour force needs, and especially\nfor  short-  and  medium-term  growth  in  the  population  of  working  age,  has  some  urgency.\nAttention should be given to the development of a migration policy informed by labour force and\nsocial/human capital needs analyses and produced through inter-ministerial collaboration.\n\n12 See Appendix 2 for population projections based the maintenance of fertility replacement rate since 1980..\n\n32\n\n\fOne approach which is not recommended is to link population size in a linear manner to economic\ngrowth and development. The potential impact whether beneficial, detrimental or non-existent,\nbetween population growth and economic growth/development is a complex matter, which is\ninfluenced  not  only  by  the  structure,  size  or  composition  of  a  country’s  population  but  other\nfactors including the social and economic history of the country and the surrounding region, the\nstructure and size of the economy, the stage of country’s development, its location in the global\npolitical economy, and existing social and finance infrastructure and policies, particularly in the\nareas of health, sanitation, education and governance.13\n\nIt is also possible to be guided by the population size of countries which have higher population\ndensities and higher GDP per capita than Barbados. This would include countries like Bermuda\nand Singapore. But again, this would be simplistic, and any such number for targeted population\ngrowth through managed migration could not withstand scrutiny. It should be noted that there\nare countries with a lower population density than Barbados but with a higher GDP per capita\n(Aruba, San Marino, Republic of Korea and the Netherlands).14 And there are many countries with\nlarger populations and very poor social and economic development indicators.\n\nThe  Population  Policy  recommends  an  incremental  approach  that  uses  the  projected\npopulation size based on replacement rate as a starting point for annual targets over the next\n10-15 years. The Policy also recommends the immediate development of a Managed Migration\nPolicy that would specify the skills and competencies which are needed in the labour force as well\nas to drive desired and planned industrial development.\n\nElements informing the incremental approach include:\n\n●  annual targets for migration informed by needed skill sets and the absorptive capacity of the\n\nlabour market;\n\n●  availability of housing and needed social services;\n●  maintenance  of  a  data  management  system  which  collects  data  on  migrants,  including\nlocation of settlement, sectors of employment, numbers of accompanying family members;\nand\n\n●  periodic review and revision upwards or downwards of the migration targets based on the\n\nabove variables and on the economic climate and human and social capital needs.\n\nPopulation  growth  through  migration  should  not  be  at  the  expense  or  displacement  of\nemployment (existing or prospective) for those already in Barbados and must be mindful of the\nstate fiscal limits to invest in infrastructural and social services adaptations to meet the needs of\nrapid population increases in the short-term.\n\nFor long-term population stabilization, two main approaches are recommended for increasing the\npopulation  size:  the  implementation  of  a  managed  migration  policy  to  attract  working  age\npersons  into  Barbados  and  a  policy  that  enhances  family  wellbeing  to  support  reproductive\n\n13 See Appendix 4: Technical Note: The Potential Relationship and Impact of Population on Economic Growth.\n14 Appendix 3: Technical Note: An Examination of the Population Density and Gross Domestic Product per capita\n\n33\n\n\fdecision making for those who wish to have children.\n\nSub-goal 1.1 Increase the Population of Persons of Working Age\n\nGiven Barbados’ advanced stage of aging and below-replacement fertility, natural increases are\nlikely  to  be  negligible  or  non-existent.  Pro-population  growth  approaches  which  increase  the\nproportion of persons of working age should:\n\n  Extend the categories of persons entitled to citizenship and permanent residence;\n  Retain and encourage repatriation of Barbadians and stem the brain drain; and\n  Promote managed migration of persons who can bring capabilities and resources to invest in\nthe future of Barbados and to contribute to areas of the economy where there are unmet\nlabour and skills requirements.\n\nSuch  approaches  increase  the  likelihood  of  meeting  the  immediate  and  medium-term  unmet\nlabour  force  needs;  increasing  the  amount  of  persons  contributing  to  government  revenue\nthrough direct and indirect taxation, contributing to the economic vibrancy and engaging in care\nwork in families and the community.\n\ni.\n\nExtending the categories of persons entitled to citizenship and permanent\nresidence\n\nThere are already approaches aimed at encouraging persons to live and work in Barbados. These\ninclude  the  CARICOM  Single  Market  and  Economy  (CSME)  that  enables  CARICOM  nationals  in\nspecified categories to move and work freely within the region, contingent on certification. Under\nthe  CSME,  not  only  do  CARICOM  nationals  and  their  families  come  to  live  and  work,  but  also\nBarbadians  are  similarly  unrestricted  in  moving  to  other  CARICOM  countries.  Barbados  is  the\nnumber one destination country under CSME, having received the most CARICOM nationals.15\n\nThis  policy  should  be  extended  to  allow  free  movement  of  all  persons  from  CARICOM,  as  is\nplanned by CARICOM.\n\nDraft  legislation  under  consideration  seeks  to  expand  the  categories  of  those  entitled  to\ncitizenship as follows:\n\n●  persons born outside Barbados, if either one of their grandparents or great-grandparents is\n\nor was a Citizen of Barbados, whether by birth, descent, naturalization or otherwise;\n\n●  persons who are permanent residents and have resided in Barbados for a total of 1,095 days\n\nduring the last 6 years immediately preceding the date of application;\n\n●  a person who is an immigrant and has been an immigrant for a period exceeding 3 years;\n●  a national (and their dependents and spouse) of a CARICOM member state who has resided\n\n15 IOM: Free Movement of Persons in the Caribbean: Economic and Security Dimensions. 2019\n\n34\n\n\fin Barbados for at least 5 years; and\n\n●  a  person  (and  spouse  and  dependents)  who  not  being  nationals  of  CARICOM  has  been\n\nresident in Barbados for 6 years.\n\nLikewise,  the  Immigration  Bill  provides  administrative  pathways  to  permanent  residence  to\nexpanded categories of persons:\n\n●  a child of a person who is a permanent resident of Barbados and residing in Barbados;\n●  a person who by reason of his age, education, experience, financial resources and skills is not\na  citizen  or  permanent  resident  of  Barbados  and  can  establish  himself  economically  in\nBarbados.\n\nThese proposed legislative reforms which expand the categories of persons eligible for citizenship\nand permanent residence, also make provisions for administrative processes that should reduce\nprocessing time for the granting of the applied status.\n\nThe Commission recommends that these Bills be reviewed and enacted, but subject to further\nconsideration  of  terms of  eligibility to  cost-free  access  to  education and  health  care based  on\ncertain  requirements  such  as  period  of  residence,  tax  contributions  or  investments.  This  is  to\nmitigate uptake of citizenship for purposes of access to services without contributions through\ntaxation.\n\nTemporary Residence: During the COVID-19 pandemic, the government introduced the Barbados\nWelcome Stamp Programme which facilitated the temporary relocation for persons who wished\nto work remotely from Barbados. This should be continued.\n\nii.\n\nRetaining and repatriating Barbadians\n\nIt  is  estimated  that  the  number  of  Barbadians  living  abroad  totals  almost  30  percent  of  the\ndomestic resident population. Traditional migration pathways to North Atlantic countries have\nbeen associated with higher incomes, expanded occupational opportunities, social security and a\nbetter quality of life. Emigration represents brain and skills drain even while it also represents a\nsource  of  remittances  and  opportunities  for  Barbadians  within  and  outside  Barbados.  Still,\nBarbados ought to be the home that its people want to return to after studying or having living\nexperiences outside of its borders.\n\nWhile  recognising  that  mobility  across  borders  is  a  feature  of  Barbadian  culture  and  of\nglobalisation, the underlying factors that drive out-migration efforts must be addressed. Policy\napproaches to expand economic and labour opportunities, and strengthen social cohesion and\nsecurity include:\n\nincreased access to affordable land for productive uses;\n\n●\n●  education reform that responds to and values the diversity of capacities needed in the\n\nsociety and economy;\n\n35\n\n\f●\n\n●\n\nimproved delivery of public services to support private sector development and job\ncreation;\nincreased productivity in high-skilled occupations, many of which are in the public sector;\nand\n\n●  tax concessions for the initial years of employment.\n\n Repatriation\n\nBarbadians  who  live  elsewhere  should  be  encouraged  to  return,  either  for  periods  of  time  or\npermanently. Returning provides opportunities to give back through engagement in the labour\nforce and through community engagement.\n\nWhile there are complex push and pull factors that inform decisions to leave, remain or return,\nthere are some measures that can facilitate the decision making to repatriate. These include:\n\n●  ready availability of information on social security and health care entitlements;\n\naccommodation/housing;\njob opportunities and education for children;\n\n●\n●  continued untaxed import of vehicles and other belongings, and the granting of a residence\n\npermit and citizenship to family members;\n\n●  access to affordable land and housing;\n●  reduced bureaucracy to the establishment of new businesses; and\n●  creation and subsidisation of innovation laboratories for youth entrepreneurs.\n\n Partial Repatriation\n\nIn the world of increased connectivity and mobility, drawing on the lessons from the Barbados\nWelcome  Stamp  Programme  (remote  work  programme),  Barbadians  abroad  can  also  be\nencouraged to contribute actively and/or to see Barbados as a co- location for work and life. This\nwould  not  require  a  complete  repatriation  but  allow  them  to  maintain  the  benefits  of  their\nmigratory country as well as benefits of a closer association, physical or virtual, to Barbados.\n\nApproaches that may facilitate periodic relocation and contribution include:\n\n●  development of a structured give back/pay forward scheme through which Barbadians in the\n\ndiaspora can maintain connectivity and contribution to Barbados’ social development;\n\n●  easy accessibility of school places for children;\n●  affordable housing;\n●  establishment and marketing of linkages between the diaspora community and professional\n\ninstitutions for volunteering and participation; and\n\n●  tax incentives, e.g., duty free concessions or VAT exemptions for specified periods.\n\n36\n\n\fiii.\n\nManaged Migration\n\nOrdinarily, managed migration policies support economic and labour market objectives. They are\ndriven by labour market needs, derived from an understanding of over and under supply of labour\nas well as an identification of projected growth within and between industrial sectors.\n\nManaged migration policies address temporary and permanent labour migration. They seek to\nattract  skilled  individuals  that  drive  economic  growth  and  innovation  and  can  be  informed  by\nconsiderations such as vocational preparation, occupational demand and arranged employment.\nOtherwise, the migrant policy can be informed by a human capital focus that places emphasis on\nfactors such as age, language proficiency, skills and education and is largely supply driven.\n\nThere  are  both  opportunities  and  costs  associated  with  labour  migration  programmes.\nImmigration can exacerbate socio-economic inequalities. As a component of a population policy,\nthe efficiency and productivity gains of managed migration must be closely considered along with\nthe distributional impact and dislocation that migration flows might generate.\n\nGiven the declining population of working age, a multi-sectoral managed migration policy should\nbe developed with the objective of increasing the size and expertise of the working age population\nas a short and medium-term approach to the consequences of an aging and declining population.\nThe scale of managed migration is obviously context specific and the target for Barbados has to\nbe set through considerations of labour force and human capital needs.\n\nSuch a policy should promote Barbados as a desirable location to live and work for people who\ncan bring capabilities and resources to invest in the future of Barbados and to contribute to areas\nof the economy where there are unmet labour and skills requirements.\n\nIt should speak to sectors that are or could be drivers of growth and for which new or added skills\nare needed. Sectors identified as the key drivers of growth include heritage tourism, renewable\nICT,  electricity,  energy,  graphic  design  and  animation,  software  development,  specialty  rum,\npharmaceuticals  and  biotech  products.16  A  managed  migration  policy  should  be  based  on\nassessment of whether the needed skills to grow these sectors are available in Barbados, can be\ndeveloped in the short to medium term and/or should be augmented by migration.\n\nThe  implementation  of  such  a  migration  policy  should  be  closely  monitored  to  ensure  that\nmigrants are integrated in a fair manner and that Barbadians are not displaced from the labour\nmarket or otherwise disadvantaged.\n\nSuch a policy should allow for migrants arriving with family members and ensure access to health\nand education for minors as well as to work permits for partners. At the same time, care and\n\n16 The Ministry of Labour, Social Security and Third Sector (MLSP) in collaboration with the Inter-American\nDevelopment Bank (IDB): The ‘Roadmap for Identifying Strategic Growth Sectors in Barbados Project, 2023\n\n37\n\n\fattention  ought  to  be  placed  on  making  allowances  for  the  implications  associated  with  the\nincreased demand for a variety of age-determined services and use of infrastructure.\n\nThe managed migration policy should specify short and medium-term targets for increasing the\nworking age population which can be adjusted, having regard to the changing economic, social\nand cultural profile of the country, and its developmental objectives and opportunities, and based\non continuous assessment of the impact of migration.\n\nIn summary, a managed migration policy should:\n\n●  Be  informed  by  an  industrial  policy  and  based  on  a  robust  migration  and  labour  market\ninformation systems. Such systems would provide a systemic basis for evaluating the demand\nfor and supply of labour by sector.\n\n●  Remove obstacles associated with immigration protocols/initiatives that are likely to inhibit\n\nprospective investment and labour services.\n\n●  Review  bureaucratic  requirements  for  the  timely  granting  of  CSME  skilled  national\n\ncertification.\n\n●  Secure migrant integration through policies that support:\n\no  Labour force mobility\no  Pathways to citizenship or permanent residence\no  Family reunion\no  Access to affordable health care and education by accompanying family members\no  Access to financial services\n\n●  Promote  dialogue  and  interaction  with  Barbadians  to  facilitate  integration  and  multi-\n\nculturalism while securing and advancing Barbadian cultural identity and values.\n\n●  Devise data collection systems to monitor changes in population distribution due to managed\nmigration and analyse the implications of such changes, on, for example, demands for social\nservices, education and health services, infrastructure, and security.\n\nSuch a policy is multi-sectoral, responding to considerations of the labour force, infrastructure,\ntransportation,  access  to  services,  industrial  policy.  The  development,  implementation  and\nmonitoring of such a policy should be undertaken by an inter-ministerial team.\n\nSub-Goal 1. 2: Enhance Family Wellbeing to Support Reproductive Decision Making\n\nOne long term approach to increasing population size is through supporting reproductive decision\nmaking of people who wish to have children. For those who wish to have children, policies should\naddress the impediments or barriers to childbearing.\n\nIn addition to deliberate decision making on the timing, number and spacing of children, reduced\nfertility is also associated with limitations in the supporting environment for those who may want\nchildren.  Poverty,\ninadequate  workplace  policies,  time\nconstraints and the absence of social support are factors informing the decision against\n\ninadequate  childcare  resources,\n\n38\n\n\fchildbearing. The gender division of labour may also act as a barrier to childbearing given that\nwomen continue to carry an unequal care burden for children and the elderly.\n\nThe  Population  Policy  recommends  a  framework  to  support  reproductive  decision  making\nconsistent with human rights, and in particular women’s unfettered rights to reproductive self-\ndetermination  to  decide  on  the  number  and  spacing  of  children.  This  framework  should  also\nrespond to the barriers to childbearing for those who would like children and/or are considering\ntheir options.\n\nThe objectives within this goal are:\n\n●  To reduce the structural barriers to childbearing and support fertility decision-making\n●  To ensure non-discriminatory and age-appropriate access to sexual and reproductive\n\ninformation, and services across the life cycle.\n\nReducing Barriers to Fertility\n\nPolicy prescriptions must respect women’s rights to make decisions regarding the number, timing\nand spacing of children. The state is obligated to ensure that people, and in particular women,\nhave access to reproductive information, services: including affordable contraception, and safe\nand non- stigmatized termination of pregnancy.\n\nIn addition, the state should also address the barriers to childbearing. These barriers include the\ndisproportionate  care\ninsufficiency,\ninadequate/insufficient  childcare  facilities,  inadequate  workplace  accommodation  for  parents\nand fertility constraints.\n\nfor  children  on  women,\n\nresponsibility\n\nincome\n\nThe responsibility for the care of children, while primarily the role of families, also must be borne\nby the state through the provision  of day care facilities and cash transfers for low-income and\nmiddle-income households. Within families and between parents a more equitable contribution\nto the financial, physical and emotional care must be nurtured. Recognizing the diversity of family\nforms, family wellbeing must be promoted and is linked to positive child and youth development,\ngender equal culture, community solidarity, a caring and empathetic citizenry and a productive\nand engaged labour force.\n\nActions to reduce the structural barriers to childbearing and support fertility decision-making.\ninclude the following components:\n\nSocial Protection and Social Services\n\n●  Child benefit subsidies especially for low- and middle-income single parents\n●  Provision of free or highly subsidized quality childcare, especially for children below the age\n\nof 3\n\n●  Subsidized housing for low-income single parent households\n\n39\n\n\f●  Tax concessions for families with dependent children\n●  Subsidies for childcare materials\n●  Building on existing initiatives such as PAREDOS, develop a case management approach to\n\nsupport parents and families for social care support.\n\n●  Ensure the implementation of a gender-responsive child support legal framework.\n●  Provide community counselling centres to support parents.\n\nSocial Norms Changes\n\n●  Promoting equal sharing of unpaid care work between women and men.\n●  Use school-based approaches to address restrictive gender roles, relations and stereotypes.\n\nLabour Force Measures\n\n●  Strengthened parental protection legislative scheme.\n●  Provisions for longer periods of maternity leave, depending on the number of children under\n\nschool going age in the household.\n\n●  Establish paternity leave and shared parental leave measures.\n●  Promote flexible working arrangements. This includes part-time work, compressed work\n\nweeks, tele-commuting and working from home, alternative office spaces and job-sharing.\n\nAccess to Health Care\n\n●  Ensure access to affordable fertility assessments and treatments for women and men.\n●\n\nIncrease  education  and  training  for  health  care  providers  regarding  fertility  preservation,\ninfertility diagnosis, safety and effectiveness of infertility treatment options and referral to\nproviders of infertility care.\n\nComplementary to removing structural barriers to fertility, children and young adults should have\naccess to science-based, non-discriminatory sexual and reproductive education and services. To\naddress  adolescent  fertility  and  teenage  parenting,  age-appropriate  comprehensive  life  skills\neducation  should  be  a  part  of  the  school  curriculum.  This  curriculum  should  emphasize  the\nprinciples of full bodily autonomy, that is, the right to make choices, respect for self and others\nand provide accurate information about human development, anatomy and reproductive health.\nSuch  an  approach  should  equip  youth  with  the  knowledge  required  to  make  sexual  and\nreproductive decisions responsibly, keeping them protected from coercion, sexually transmitted\ninfections and unintended pregnancy.\n\nNon-discriminatory and age-appropriate access to sexual and reproductive information and\nservices should be ensured through:\n\n●  age-appropriate  and  non-discriminatory  comprehensive  life  skills  education  in  schools\n\nconsistent with the developing capacities of young people; and\n\n●  access to sexual and reproductive services, including for adolescents and youth.\n\n40\n\n\fPolicy Goal 2: Provide Barbadians and Non-Nationals Now and in the Future with\nOpportunities for Personal Development\n\nWhile there is a need to respond to the projected impacts of population decline, including through\nthe encouragement of in-migration, a primary concern of the policy is that in its implementation,\nthose who call Barbados home now and in the future are assured of a decent quality of life and\nhave opportunities for self and community development.\n\nSub-goal 2.1: Promote and Strengthen the Care Economy across the Lifecycle and for\nthe Vulnerable Population\n\nPeople who are vulnerable because of age, infirmity and/or disability must be assured of dignified\nlives  through  the  provision  of  material,  physical,  social  and  psychological  care.  This  multi-\ndimensional care should be shared within families and between families and state institutions.\n\nThe  provision  of  quality  care  is  essential  for  the  reproduction  of  a  well-adjusted  and  socially\nengaged society. It is the part of human activity that contributes to the wellbeing of the present\nand  future  labour  force  and  the  population.  Care  has  material,  social,  physical  and  emotional\ndimensions.  It  is  done  by  the  state  through  health,  education  and  social  service  institutions.\nHowever, daily and nurturing care is largely the responsibility of families. Within families, people,\nand  especially  persons  dependent  or  vulnerable  because  of  age  or  infirmity,  are  assured  food\nsecurity, shelter, clothing and emotional health.\n\nSocial care is also a very gendered experience. While both women and men have been historically\nengaged in labour outside the home, the division of labour ascribes to women the role of primary\nfamily caretakers, though increasingly more men are engaging actively in the care of children. This\ncare work is generally undervalued and rendered invisible. Because of this traditional division of\nlabour,  many  women  of  working  age  have  a  triple  responsibility;  not  only  do  they  have  to  be\neconomic providers, but they must also provide care (in all its components) for their children and\ntheir parents. Women also are the main providers of care for persons with short- term or with\nchronic sicknesses and/or disabilities. They do so even while many are in the lowest paid sectors\nof the economy.\n\nYet social protection schemes do not recognize this care economy and there are no provisions\nmade within pension schemes, especially for those whose main work has been in the domestic\nsphere. The care economy must be made visible; it must be recognised, reduced and redistributed\nthrough  the  sharing  of  responsibilities.  The  value  of  reciprocity  and  inter-generational\ndependence must be recognized as a core national value.\n\nElderly Care and Participation\n\nMany of the elderly suffer from chronic illnesses and families may be hard pressed over the long\nhaul to provide quality care. They may also live alone and are outside of circles of care. This is\n\n41\n\n\fespecially the case for elderly men who are more likely than women to be isolated from their\nfamilies, having not been involved in the care of the children. Given the shrinking size of families\nand  low  fertility  rates,  the  care  responsibilities  are  increasingly  concentrated  on  few  persons\nwithin nuclear-type families.\n\nFamily caregiving over a prolonged period can be stressful, especially for those family members\nwho are not trained. Care givers can be challenged to provide the level of quality care required\nby those who are dependent on them because of income insufficiency, anxiety and competing\nclaims on time especially if employed or with caring responsibilities for young children. Supporting\nfamily  care  is  therefore  essential  given  the  growth  of  the  aging  population  with  NCDs.  That\nsupport  is  not  only  advantageous  to  the  care  givers,  but  to  the  care  recipients  and  for  public\nsystems.  State  systems  to  support  the  primary  caretakers  of  the  elderly,  persons  living  with\nchronic diseases and the young must be addressed.\n\nEqually, it is important to acknowledge the diversity of capacities of vulnerable populations and\nnot  assume  the  need  for  only  care.  People  live  longer  lives  and  wish  to  continue  to  make\ncontributions to society but may be sidelined and excluded because of stereotypes about aging\nand disability status. In addition to the provision of high quality and accessible care, the Policy\naffirms active aging and recommends the integration and participation of older persons in public\nlife.\n\nThis  integration  should  be  enabled  through  encouragement  of  economic,  political,  social  and\ncultural  participation  in  public  life,  through  accessible  and  affordable  infrastructure  (housing,\ntransportation)  and  integration  in  community  life  and  the  promotion  of  intergenerational\nrelationships.\n\nThe following approaches are recommended with the objective of promoting the valuing and non-\ndiscriminatory sharing of care work in families, households and communities:\n\n●  Recognise the full-time and/or part-time domestic care contributions in pension schemes\n\nwithin the National Insurance Scheme.\n\n●  Promote workplace practices that support caregiving responsibilities.\n●  Support in-home caretaking through the provision of trained and remunerated caretakers.\n●  Provide tax breaks or provide cash grants for low-income caregivers who, within the confines\n\nof their private household, provide care for elderly persons or other dependents.\n\n●  Establish support groups and counselling programmes for caregivers.\n●  Promote family-friendly policies in the workplace for those caring for elderly family members\n\n(including flexible work schedules and telecommuting).\n\nElderly Care Recommendations:\n\n●  Review and adopt the draft National Policy on Aging which addresses caregiving and its\n\nintegration and participation.\n\n●  Review the functioning of residential institutions and strengthen protocols for care facilities.\n\n42\n\n\f●  Work with civil society community-based organisations to promote social circles for exercise,\n\nrecreation and interaction.\n\n●  Encourage ‘on the job’ intergenerational mentorships.\n●  Ensure transportation affordability and accessibility to encourage mobility across the life cycle\n\nand different abilities.\n\n●  Reduce taxes on commodities for the elderly.\n\nSub-goal 2.2: Expand Access to Quality Health Care and Wellness Service Interventions\n\nThe health and wellness sectors are oriented to meeting the needs of people across the life cycle.\nOf  particular  focus  considering  the  population  trends,  is  the  need  for  targeted  approaches  to\naddress the long- term care needs of a growing elderly population though not overlooking the\nneeds of specific populations such as those with disabilities, children and young persons.\n\nRespect  for  autonomy  and  the  patient’s personal  values  must  be  considered  in  health-related\ndecision-making, with people having access to the relevant information to make informed choices\nrelated to health care interventions, including the nature of care (e.g., palliative) and the timeline\nfor interventions.\n\nHealth education and services must continue to promote wellness through healthier nutritional\npractices as well as greater levels of physical activity, across the life cycle for NCD prevention. To\nsupport  this,  facilities  for  exercise  must  be  appropriate  for  all  ages  and  abilities.  Actions  to\nstrengthen disease prevention and control across the life cycle should include the following:\n\n●\n\nIncreased training and capacity of health professionals in prevention, primary care, early\nrehabilitative care, gerontology, dentistry and other needed specialist and allied health areas.\n\n●  Reinforcement of health and wellness clinics with specific focus on:\n\no  women’s health and wellness;\no  support and self-management of treatment regimens; and\no  men’s health and wellness.\n\n●  Use policy measures such as taxation as incentives to influence and promote healthy nutrition,\nincluding  consumption  of  locally produced  food (e.g., increase  taxes  on  food  items high  in\nsugar, salt and trans-fats, as well as ultra-processed foods while subsidizing nutritious food\noptions)\nIncrease availability of land and support agricultural practices that increase the supply of local\nfruits and vegetables.\nImprove physical infrastructure that is conducive to greater levels of participation in physical\nactivities across the life cycle.\n\n●\n\n●\n\nIn addition to the potential impact of such measures in strengthening the health and social well-\nbeing  of  resident  populations  in  Barbados,  they  also  contribute  overwhelmingly  to  promoting\nlifestyle  practices  consistent  with  a  model  of  disease  prevention,  especially  those  classified  as\nchronic, non-communicable diseases (NCDs).\n\n43\n\n\fAt community levels, infrastructural development should consider the spatial requirements that\nsupport participation in public spaces, mobility and recreational needs of aging populations and\npeople living with disabilities. To this end, the following strategies are proffered:\n\n●  Develop and encourage safe social spaces at the community level that are also responsive to\nthe mobility and recreational needs of specific populations including the elderly and persons\nliving with disabilities, and which provide opportunities for intergenerational interactions at\ncommunity levels.\n\n●  Ensure  that  all  private  and  public  buildings  and  facilities  make  provision  to  incorporate\n\nmeasures that permit ease of access and mobility for persons with disabilities.\n\nSub-goal 2.3: Improve the Capacity and Proficiency of the Labour Force with Access to\nExpanded Opportunities\n\nTo attain sustainable socioeconomic development, measures must be pursued that will bolster\nemployment  opportunities  in  a  diversified  economy,  especially  for  the  youth,  while  removing\nlimitations  on  those  who  wish  to  continue  in  the  labour  market  beyond  what  is  now  the\nretirement age.\n\nThe  economic  impacts  of  COVID  -19  and  the  associated  disruption  of  the  tourism  industry\nreinforce the need for a more diversified economy with attention to growing other productive\nsectors that generate national income and employment.\n\nIn  promoting  diversification,  attention  must  be  given  to  alignment  between  education  and\ntraining  opportunities  at  the  tertiary  level  and  prospective  and  emerging  productive  sectors,\nwhether  in  services,  the  industrial  and  energy  sectors,  agriculture  or  information  technology.\nSpecific growth sectors identified for the county over the next 10 to 15 years include: heritage\ntourism, renewable energy, graphic design and animation, software development, specialty rum,\npharmaceuticals, and biotech products17. In addition, a Labour Market Information System can\nsupport that alignment between education and training and labour market needs.\n\nIn Barbados, high proportions of youth populations continue to be not in employment, education,\nor training (NEET). Early and long periods out of school and the productive sectors of the society\nand  the  economy  for  youth,  and  in  particular  young  men,  is  associated  with  disaffection  and\nparticipation in subcultures marked by substance abuse and criminal activity. This is especially so\nfor youth who come from fragmented families and disadvantaged communities.\n\nEnsuring that young people leave the education system with self-esteem, accomplishments,\n\n17 Comment from Ministry of Labour, Social Security and Third Sector in relation to recent studies:\nRoadmap for Identifying Strategic Growth Sectors in Barbados Project, Skills for the Future Project\nand the 2022 BERT/BEST Programme of the Government of Barbados.\n\n44\n\n\fcapabilities and a sense of purpose within their communities is critical to their engagement in the\neconomy in ways that contribute to the society and further their personal development goals.\n\nIncreasing labour force participation therefore is best attainable if the foundations for self-esteem\nand  personal  drive  are  secured  in  primary  and  secondary  schools  and  in  post-secondary\ninstitutions, and young people are prepared to participate in the labour market and empowered\nand  supported  to  innovate  and  create.  Education  reform  is  needed  to  expand  from  the  post-\ncolonial  preoccupation  with  certification  at  all  stages  of  schooling,  and  re-oriented  to  foster\nconfidence, critical thinking, empathy and life skills needed for flexibility and resilience. Young\npeople should be better prepared for the world of work and community participation through the\ndevelopment of a diversity of capabilities and interests.\n\nEntrepreneurial ventures have increasingly been encouraged in Barbados. Pre-COVID-19 data on\nthe labour force characteristics in Barbados has shown that more men than women were self-\nemployed,  and  that  self-employment  was  gaining  prominence  as  a  means  of  engaging  male\nworkers in the labour market.\n\nLabour  market  policy  is  needed  to  address  the  challenges  associated  with  labour  force\nprecariousness especially for youth, women, people living with disabilities and those categorized\nas elderly who desire to remain active in the economy beyond the age of retirement. There also\nneeds to be provision for reducing stereotyping and discrimination predicated upon age, gender,\ndisability  status  and  citizenship.  In  this  vein,  any  strategies  to  emanate  from  a  labour  market\npolicy, and indeed the population policy, should be cognizant of other existing initiatives, or those\nunder development, such as the National Policy for Persons with Disabilities.\n\nIn addition to ensuring that youth are actively and constructively engaged in the labour force and\ntheir communities, the Policy promotes the active and voluntary engagement of elderly persons\nin the economy. Persons over the age of 67 (the current retirement age) should have the option\nof continued employment though this would have to be balanced against the employment needs\nof  youth  and  would  also  depend  on  the  sector  of  employment  and  the  implications  for  the\nNational Insurance Scheme.\n\nThe following policy strategies are recommended:\n\nEducation sector\n\n●  Review  and  improve  curricula  and  teaching  methods  in  primary,  secondary  and  tertiary\neducation  as  they  relate  to  science,  technology,  engineering  and  mathematics  (STEM)\nsubjects.\n\n●  Review  and  improve  curricula  and  teaching  methods  in  secondary,  post-secondary  and\ntertiary  education  to  inculcate  innovation,  entrepreneurial  behaviour  and  issues  related to\nthe acquisition of soft skills (conflict resolution, leadership, communication, inter- personal\nskills etc.) financial literacy and job-seeking skills.\n\n●  Any review  should be accompanied by relevant accreditation  (e.g.,  Barbados Accreditation\n\n45\n\n\fCouncil) to ensure international acceptance to the benefit of current student retention and\nattraction of external students.\n\nTechnical and vocational training\n\n●  Enhance skill sets of the current workforce to meet the demands of new jobs in emergent\nindustries  (heritage  tourism,  renewable  energy,  graphic  design  and  animation,  software\ndevelopment, specialty rum, pharmaceuticals, and biotech products).\n\n●  Provide  opportunities  for  structured  arrangements  that  would  permit  qualification  and\ncertification for persons providing care services in the home, whether serving the needs of\nchildren, the elderly or the disabled.\n\n●  Promote technical and vocational education and training (TVET) and the implementation of a\ndual-track TVET system where institutional instruction is complemented by practical work and\nexperience. This can be facilitated through the implementation of the Barbados Qualifications\nand Credit Framework (BQCF) to be operationalised by the Barbados Accreditation Council. 18\n\nPartnerships\n\n●  Dissemination of information on employment and education/training opportunities for NEET\nyouth  by  relevant  government  agencies  including  through  families,  community-based\norganizations, faith-based organizations and labour unions as gateways to NEET youth.\n\n●  Encourage investment in training in both the private and public sectors especially with respect\nto improving the quality of vocational training with a heavy emphasis on the acquisition of\ndigital skills.\nImplement  incentives  for  industry-academia  linkages  to  enhance  collaborative  capacities\nacross industry and academia. This allows for greater matching of the supply and demand for\nskills.\n\n●\n\n●  Encourage investment and partnership agreements that will foster participation in research\nand  development  initiatives  involving  the  public  sector,  the  business  community  and\nacademia.\n\n●  Commission  dedicated  ministries  and  research  support  centres  and  science  councils  to\n\nprovide for a one-stop-shop for innovators.\n\nRegulatory and Administrative Processes\n\n●  Review the mandatory age of retirement to provide choice to persons who wish to and can\n\ncontinue employment.\n\n●  Promote an agenda consistent with the attainment of decent work in keeping with ILO’s\n\nDecent Work protocols.\n\n●  Continue development of labour market data systems and development of institutional\n\n18 The BQCF is intended to “restructure the country’s system of qualifications in a vertical and horizontal way that\nwill expand the pathways to attaining qualifications and facilitate the validation of skills obtained through non-\nformal and informal means”- Comment from Barbados Accreditation Council on the Draft Population Policy.\n\n46\n\n\flinkages for the realisation of a comprehensive labour market information system which is\naccessible and current.\n\n47\n\n\fPolicy Goal 3: Promote Integrated Settlement Development and Safeguard the Ecological\nBalance\n\nSub-goal 3.1: Reconcile Population Redistribution, Land Use and Settlement Patterns\n\nNotwithstanding the stabilization in population growth, there has been a significant increase in\nthe conversion of agricultural land to fulfil residential and commercial purposes. That along with\nthe diversion from traditional food production practices has increased the country’s dependence\non food imports, which has negative implications for food security and national health outcomes.\n\nBridgetown and communities in the greater Bridgetown area are threatened by urban decay due\nto sub-urbanization. Reinvestment in Bridgetown and surrounding older urban areas is needed to\nrepurpose vacant and derelict properties to productive use.\n\nTraffic  congestion  in  and  around  the  Greater  Bridgetown  area  is  an  ongoing  problem.  Such\ncongestion is primarily due to decentralization of residential areas. Despite having expanded the\nisland’s development footprint by 60 percent and almost doubling the number of cars over the\nlast  two  decades,  there  has  been  little  expansion  in  transport  infrastructure  capacity.  The\ntransportation network of highways and roads is fundamentally the same as it was dating back to\nthe 1990s.\n\nTo  date,  Barbados  is  the  only  CARICOM  member  state  with  a  government  approved  national\nPhysical Development Plan (PDP) as an integrated framework to guide the physical development\nof  the  country  and  support  the  continued  health  and  prosperity  of  its  citizens.  The  current\nBarbados Physical Development Plan offers detailed policy guidelines that are endorsed in this\nPopulation Policy. It seeks  inter alia to promote the efficient use of land and services through\ncompact, contiguous and mixed-use development through:\n\n●  Protection of community cores, namely, the commercial, residential and cultural heart and\ncentral  places  of  Barbados,  providing  the  densest  concentration  of  people,  buildings,  and\nactivities.  The  community  cores  of  Bridgetown,  Speightstown,  Oistins,  Holetown,  Six  Cross\nRoads, Warrens, Wildey, Belleplaine and Bathsheba are identified in the Community Plans of\nthe NDP. Each core is defined in a place-specific manner, and policies to encourage vibrant,\nwalkable and prosperous cores are tailored to the distinct possibilities of that community.\n\n●  Encouragement of higher density residential development within the Urban Corridor.\n●  Promotion of the designation of Predominantly Residential Areas to be areas located within\nthe  Urban  Corridor,  Stable  Suburban  Areas  and  National  Park Villages, and  intended  to  be\ndeveloped as compact and complete communities.\n\nThe PDP also encourages the design and development of compact, well-connected and complete\ncommunities through:\n\n●  Encouragement of major development facilities and essential services infrastructure (health-\nrelated,  police  stations,  post  offices,  libraries,  community  centres)  in  Regional  and  Local\n\n48\n\n\fCentres or near other central community facilities and considering the distribution of such\nfacilities based on population service areas rather than on the parish system;\n\n●  Review of school locations to ensure proximity to urban settlement areas and well serviced\nby  transportation  options  and  to  respond  to  rising  or  falling  populations  of  school  age\nchildren.\nIncorporate adaptive reuse of public and heritage buildings;\n\n●\n●  Designation of an extensive area outside of the Urban Corridor and National Park as a Working\nLandscape  for  the  harmonious  co-existence  and  management  of  agricultural  production,\nrenewable energy initiatives, resource extraction, solid waste management and a mixture of\nessential infrastructural services.\n\n●  Review transport routes based on population changes and commuting patterns and ensure\naccess for all to safe, age and gender responsive, affordable, accessible and sustainable urban\nmobility and sea transport systems;\n\n●  Promotion  and  incentivization  of  transit  use  and  active  transport  while  dis-incentivizing\nprivate  automobile  usage,  including  through  transport  terminals,  park  and  ride  transfer\npoints, rendezvous for car-pooling and bus transfer points.\nInstitution of the requirement for EIAs and SIAs for any significant expansion of existing or\ndevelopment of new sporting complexes or similar facilities dedicated to serving communities\nor the national public.\n\n●\n\nSub-goal 3.2: Ensure the Efficient Management of Natural Resources and the Environment\n\nThe  demand  for  water  is  influenced  by  urban  sprawl,  needed  and/or  anticipated  increases  in\nagricultural  production  and  transient  tourist  populations.  Yet  Barbados  suffers  from  water\nscarcity that is related to climate change due principally to higher temperatures and the increased\nintensity  of  droughts  and  variability  of  rainfall  events.  Barbados’  aged  water  distribution\ninfrastructure is strained by increased water consumption. Changes in population distribution and\nhousing stock must consider supply and demand for water resources and so, significant attention\nmust be given to water conservation, capture, distribution and efficient water use.\n\nIn Barbados, agricultural production (produce and livestock) has declined significantly, and the\nfishing industry has  suffered  a  two  percent  decline  from  overfishing  and  climate  change  since\n2000  despite  various  policy  reforms  and  interventions.  Food  importation  accounts  for\napproximately one quarter of all imports and 80 percent of all food consumed is imported. In\n2020,  Barbados had  a food  import bill  of  more than  BBD$  664.7 million.  Actions  to  safeguard\necological  balance  must  be  informed  by  an  understanding  of  the  interactions  and  linkages\nlivelihoods  and  environmental\nbetween  agriculture,  trade,  health  and  nutrition,  rural\nsustainability.\n\nMost of the population of Barbados (66 percent in 2010) resides along the “urban corridor” within\ntwo kilometres of the coastline. As a result, the island’s population is vulnerable to sea level rise\nand  adverse  weather  systems  such  as  hurricanes.  The  concentration  of  population  and\ninfrastructure in and near coastal zones has also degraded marine habitats with land-based\n\n49\n\n\factivities being a major contributor to the deterioration of marine ecosystems. The coral reefs\nprovide protection to the fishing ecosystem and against beach erosion. The destruction of this\nnatural habitat therefore is not only environmentally catastrophic but also can negatively affect\neconomic activity in the tourism sector. This reality underpins the importance of strong coastal\nzone management, including the establishment of marine protected areas, sustainable tourism\npractices, and initiatives to promote coral reef conservation and restoration.\n\nUrban and residential infrastructure development and higher levels of consumption increase the\ngeneration of waste and demand for improved waste management. Between 1949 and 2015, the\namount of waste recorded entering the Mangrove Pond landfill has increased from 45 tonnes per\nday to approximately 1000 tonnes per day. Since 2005, national waste diversion and management\nstrategies have effectively reduced the quantity of waste entering the landfill. However, increased\npopulation coupled with expanding residential and urban areas will result in an increased burden\non  municipal  waste  collection.  This  may  inadvertently  cause  illegal  dumping  and  waste\nstockpiling, negatively impacting human and environmental health.\n\nTo strengthen an integrated decision-making framework for development initiatives to safeguard\nour  essential  ecosystem  services  and  reduce  vulnerability  to  natural  hazards,  the  following\nrecommendations are made:\n\n●  Encourage Integrated Water Resource Management approaches and water efficient systems\nin community development plans as well as public, private and household building design.\n●  Strengthen  the  protection  of  water  resources  alongside  economic  development  and\npopulation  expansion  through  integrated  water  use  and  supply  plans  for  proposed\ndevelopments.\nInstitute\nimpact  statements  as  pre-\nrequirements for new major developments proposed on or adjacent to lands designated for\nagricultural use.\n\nlegislative  arrangements  requesting  agricultural\n\n●\n\n●  Reinforce the protection and continued existence of food and agricultural areas within the\n\n●\n\nurban corridors of Barbados.\nInstitute legislation for applications for infrastructural development within 30 metres of the\ncoast to be subject to EIAs, SIAs and other supporting technical studies.\n\n●  Encourage  new  development,  as  well  as  institutional,  community  facilities  and  national\ninfrastructure projects outside of Natural Hazard Areas. Strengthen regulations, monitoring\nand  enforcement  for  pollution  control  as  it  relates  to  water pollution,  illegal  dumping  and\nhabitat disruption.\n\n●  Encourage  the  inclusion  of  design  measures  for  climate  change  resiliency  that  must  be\n\nincorporated into site plans for new facilities.\n\n●  Ensure  that  environmental,  legal,  economic  and  social  tenets  of  Barbados’  Sustainable\nDevelopment Policy are considered in the management of population structure and size as\nwell as any population development strategies.\n\n●  Ensure that economic and social valuation tools and methodologies are incorporated into the\ndecision-making process of natural resource use and population development strategies.\n\n50\n\n\fSub-goal 3.3: Strengthen Collective Resilience to the Impacts of a Changing Climate\n\nBarbados and other small island developing states remain the most vulnerable countries in the\nworld to climate change. This is the case even though collectively small island states contribute\nless than 1% to global greenhouse gas emissions that ultimately cause climate change.\n\nBarbados  is  highly  vulnerable  to  hurricanes  and  other  natural  hazards  and  is  particularly\nsusceptible to the potential impacts of climate change, including coastal inundation and sea level\nrise, an increase in tidal and storm surge levels, coastal erosion, rising temperatures, changes in\nrainfall patterns, drought and more frequent and intense tropical cyclones.\n\nAnalyses of regional climate models and projections suggest that ongoing global climatic changes\nhave largely contributed to an average of nearly 5 to 20 per cent decline in seasonal rainfall in the\nCaribbean. Alongside the devastation that disasters continue to inflict on people in the region,\ncountries are also grappling with coastal inundation and saltwater intrusion due to sea level rise\nestimated at 1.4 to 3.4 mm per annum.19\n\nEfforts to limit the temperature increase to 1.5 degrees Celsius are imperative. Studies show that\nthe difference between 1.5 degrees and 2 degrees Celsius, the threshold called for in the Paris\nAgreement,  would  mean  10-centimeter  higher  global  sea-level  rise  by  the  start  of  the  next\ncentury, longer heat waves, and would put virtually all tropical coral reefs at risk of dying off.\n\nCoral reefs and other coastal ecosystems play a vital role in shoreline protection, beach creation,\nfish  nurseries,  recreational  activities  and  education  and  training  among  other  things.20  This\ntemperature increase has had considerable heat stress impacts on marine and terrestrial species\npopulations.  Humans  can  also  be  affected  by  these  increased  temperatures,  and  vulnerable\ncommunities such as those within an aging demographic may be especially susceptible to health\nimpacts because of heat stress.\n\nFurther to the biophysical and social impacts, high-energy climatic events have had disastrous\neffects on island economies in the Caribbean. Countries have experienced over 200% losses in\nGDP  from  just  one  hurricane21.  These  GDP  losses  are  then  compounded  by  further  losses  in\nemployment, public health expenditure, food production capacity, education system efficiency\nand  natural  ecosystem  productivity.  This  vulnerability  and  combination  of  multi-dimensional\nimpacts can be considered a threat to national security.\n\n19\n\n https://publications.iom.int/books/migration-environment-disaster-and-climate-change-data-eastern-\n\n caribbean-\n regional overview\n\n20\n\n https://www.caribbeanclimate.bz/blog/tag/1-5-degree-celsius/\n\n21\n\n https://thedocs.worldbank.org/en/doc/7276af45227db85e778cd1586c68e040-0350082021/original/mpo-\n\n dma.pdf)\n\n51\n\n\fBarbados has begun to implement adaptation measures to address climate impacts and build a\nresilient  society  while  demonstrating  a  commitment  to  reduce  greenhouse  gas  emissions  by\ntransitioning to a low-carbon economy by 2030. Key policy instruments in use with integrated\napproaches to reduce the impacts of climate changes include the Barbados Physical Development\nPlan, the Draft Integrated Coastal Zone Management Plan (2020-2030) and the Government’s\nmodel integrated development framework represented in the Roofs to Reefs Programme.\n\nTo secure climate resilient development across all sectors and levels of governance, the following\nshould be undertaken:\n\n●  Promote forward planning through the utilisation of the national, regional and community\nphysical  development  plans  to  integrate  climate  change  as  a  cross-cutting  consideration\nacross all components of land use planning, natural resources management and development\nmanagement.\nIntroduce  ecosystem-based  interventions  combined  with  existing  strategies  to  improve\necosystem health, address climate change and known coastal hazards.\n\n●\n\n●  Strengthen governance and partnerships between the public sector, private organisations and\nnon- governmental organisations to harness scarce resources and build capacity to combat\nthe effects of climate change and the wider spectrum of disaster risk management activities.\n●  Encourage the inclusion of design measures for climate change adaptation and resiliency that\n\nmust be incorporated into site plans for new facilities.\nImprove technical capacity and sustainable livelihoods in climate resilience.\n\n●\n●  Promote  regeneration  and  conservation  practices  wherever  possible  to  ensure  the\n\n●\n\npreservation and improvement of natural habitats.\nImplement  risk  resilient  integrated  coastal  zone  management  to  safeguard  livelihoods,\ninvestments and natural ecosystems in the face of a range of coastal hazards including climate\nchange.\n\n●  Encourage  investment  into  climate  resilience  and  habitat  regeneration  projects  by  new\n\n●\n\ninfrastructural and economic development initiatives.\nIncrease  the  overall  health  and resiliency of natural  habitats  and  avoid the degradation of\necosystems which support livelihoods and infrastructure.\n\n●  Encourage  energy  efficient  technologies  and  the  use  of  renewable  energy  generation\n\nelements for all new infrastructure developments.\n\n52\n\n\f53\n\n\f Implementation Framework\n\nThe Population Policy is cross-sectoral and its implementation will depend on the engagement of\nthe  Government,  social  partners,  civil  society  actors,  trade  unions,  private  sector  and\ncommunities.  It  should  be  accompanied  by  a  plan  of  action  developed  by  an  Inter-sectoral\nImplementation Group (ISIG) that is accountable and reporting to the National Strategic Council.\n\nThe Plan of Action should be the framework for the design, financing, monitoring and evaluation,\ncollaboration and coordination of the Plan. It should identify responsible and lead agencies for\nthe  implementation  of the  goals  and  sub-goals. The  plan  of  action  should  contain time-bound\ncommitments and be adequately resourced to ensure accountability for implementation. The ISIG\nshould constitute a sub-committee to develop the managed migration policy.\n\nThis ISIG should be chaired by the Ministry of Economic Affairs, with thematic sub-committees\nco-chaired by relevant line ministries and civil society Implementation Group partners. The ISIG\nwould have the following responsibilities:\n\n●  Development of a time-bound and resourced action plan.\n●  Providing leadership and coordinating and mobilizing support for population programmes.\n●  Tracking and assessing the impact of population programmes and making policy\n\nrecommendations based on the assessment results.\n\n●  Assisting stakeholders and partners in the integration of priority population interventions.\n●  Oversight on implementation of the Action Plan work towards achieving its main objectives,\n\nwhich include: -\n\n●  To improve knowledge and information base on population issues.\n●  To improve policy framework and environment for population issues.\n●  To enhance capacity for programme planning, coordination, monitoring and evaluation.\n●  Coordinate the development and implementation of an M&E framework for the Plan of\n\nAction.\n\nThe ISIG should report to the Cabinet through National Strategic Council Team on its work and\nthe progress of implementation at least twice a year to ensure political will and connectivity.\n\nA Monitoring and Evaluation framework is essential for the accountability of responsible agencies\nfor  the  effective  implementation  of  the  Population  Policy  and  the  Plan  of  Action.  Periodic\nmonitoring will promote sectoral engagement and oversight as well as communications across\ngovernmental departments and with social partners. An M&E framework will also be important\nfor continuous engagement with the public to get their feedback and recommendations on the\nimplementation of the Policy.\n\nThe M&E framework should also include sectoral frameworks to monitor activities in support of\nthe Policy goals. All assessments should be made available to the public.\n\n54\n\n\f Conclusion\n\nThe Policy promotes measures for a vibrant society and economy characterized by Barbadians\nand  other  resident  populations  who  are  engaged,  empowered  and  resilient  to  contribute  to\nsustainable and inclusive development and take care of each other with the support of a strong\nand engaged state.\n\nThe Policy is concerned with addressing the issues that flow from an aging population through\nrecommendations  for  targets  for  population  increases  through  managed  migration  as  well  as\nthrough  interventions  that  may  spur  an  increase  in  fertility  rates.  The  Policy  also  prioritises\nmeasures  that  will  address  the  quality-of-life  concerns  of  present  Barbadians  and  residents,\nincluding under- and unemployment of youth. The Policy measures are consistent with Barbados\nas a caring society especially those who belong to vulnerable sub-populations such as disabled\npersons, the elderly, and children. The family as a basic unit of a caring society is affirmed with\nattention paid to the sharing of the care burden between women and men, consistent with the\ncore value of gender equality.\n\nCivil  society,  the  public  sector,  the  private  sector,  regulatory  mechanisms,  faith-based\norganizations, community groups and the family have critical roles to play in setting the stage to\nachieve the objectives that lend credence to the perception that Barbados is a caring society.\n\nRecurring themes from the consultations which informed this Policy are i) gender equality in the\nsharing  of  care  responsibilities  and  ii) the urgency of  education  reform away  from testing  and\ntowards an affirmative experience that draws out and values the diversities of individual skills and\ncompetencies  and  grows  cultural  confidence;  and  iii)  the  strengthening  of  environmental\nmanagement.\n\nFamily and community caregiving is still a gendered experience given the traditional division of\nlabour which ascribes to women the predominant responsibility for care of children, the elderly\nand vulnerable populations. This work continues to go under-valued and under-recognised. While\nthere are cultural shifts, these must be accelerated through regulation, resources and education\nso that women and men can contribute to family and public life in ways that broaden their choices\nbased on mutual obligations to care and protect families.\n\nThe education sector should strengthen diverse civic engagement, labour market productivity,\nsecurity and more comprehensive experiences of fairness and inclusion. An education sector re-\nenvisaged away from the colonial and post-colonial focus on testing and realigned to the rounded\ndevelopment needs of individuals and communities is also desirable to respond to the causes and\nconsequences of the projected population trends.\n\nBarbados  has  championed  environmental  management,  and  this  must  be  sustained  and\namplified.  The  Policy  seeks  to  outline  strategies  for  managing  the  interactions  between  the\npopulation and the natural environment to secure the ecological balance needed for a good\n\n55\n\n\fquality of life now and for future generations.\n\n56\n\n\f Population Policy Goals and Action Plan\n\nThe Barbados Population Policy is based upon one demographic goal, that is, a goal that\nseeks to increase the population size and structure and two (2) non-demographic goals.\nThe demographic goal facilitates changes in migration and fertility outcomes that would\nresult in an incremental increase in population size. The non- demographic goals outline\napproaches  to  secure  a  quality  of  life  for  all  without  discrimination  and  to  ensure\nenvironmental sustainability. Within each family of goals, specific objectives and actions\nare  set  out  as  are  the  principal  domains  of  population  policy-related  activities.  These\nprincipal  domains\nimplementation  of  the\nPopulation Policy.\n\ninstitutional  responsibilities  for\n\nindicate\n\nThe  Barbados  Population  Policy\npromotes sustainable and inclusive\ndevelopment  and  good  quality  of\nlife  for   Barbadians   and residents\nwithout\ncompromising\nenvironmental  sustainability  and\nthe ability of future generations to\nmeet their needs.\n\nPolicy Goal 1: Ensure a Population Size Sufficient to Grow and Sustain Adequate Levels of Social Care, Productivity, Labour Force\nParticipation and Revenue for Inclusive Development\n\nSub-goal 1.1: Increase the Population of Persons of Working Age\n\nDomains\nPopulation Dynamics\n\nObjectives\nTo  increase  access  to  public  and  private\ninstitutions  for  skilled  workers  to  address\nunmet  labour  force  requirements  in  a  timely\nmanner.\n\nActions\n\n●  Extend  the  categories  of  persons\nentitled to citizenship and permanent\nresidence;\n\n●  Retain  and encourage  repatriation  of\nBarbadians and stem the brain drain;\nand\n\n●  Promote  managed  migration  of\npersons who can bring capabilities and\nresources  to  invest  in  the  future  of\nBarbados and to contribute to areas of\nthe economy where there  are\nunmet labour and skills requirements.\n\n57\n\n\fTo develop and implement a managed\nmigration policy\n\n●  Develop  and\n\nimplement  a  managed\nmigration policy that should be informed\nby  an  industrial  policy  and  based  on  a\nrobust labour market information system.\nSuch  a  system  would  provide  a  systemic\nbasis  for  evaluating  the  demand  for  and\nsupply of labour by sector.\n\n●  Remove\n\nobstacles\n\nassociated  with\nimmigration protocols/initiatives that are\nlikely  to  inhibit  prospective  investment\nand labour services\n\n●  Review bureaucratic requirements for the\ntimely  granting  of  CSME  skilled  national\ncertification.\n●  Secure  migrant\n\nintegration\n\nthrough\n\npolicies that support:\n\no  Labour force mobility\no  Pathways\n\nto\n\ncitizenship  or\n\npermanent residence\n\no  Family reunion\no  Access  to  affordable  health  care\nand  education  by  accompanying\nfamily members\n\no  Access to financial services\n\n●  Promote  dialogue  and  interaction  with\nBarbadians  to  facilitate  integration  and\nmulti-culturalism  while  securing  and\nadvancing Barbadian cultural identity and\nvalues.\n\n●  Devise data collection systems to monitor\nchanges in population distribution due to\nmanaged migration and analyse the\nimplications of such changes, on, for\n\n58\n\n\fexample,  demands  for  social  services,\neducation\nservices,\ninfrastructure, and security.\n\nhealth\n\nand\n\nTo prevent and reverse the brain drain\nphenomenon.\n\nRetention:\n\n●  Education  reform  that  responds  to\nand  values  the  diversity of  capacities\nneeded in the society and economy.\n\n●  Access\n\nto\n\naffordable\n\nland\n\nfor\n\n●\n\nproductive uses.\nIncreasing  productivity  in  high-skilled\noccupations, many of which are in the\npublic sector.\nImprove the delivery of public services\nto\nsector\ndevelopment and job creation.\n●  Provision of tax concessions for  the\n\nsupport\n\nprivate\n\n●\n\ninitial years of employment\n\nRepatriation\n\n●  Extension of accessible basic services,\nincluding the supply of information on\nsocial\nsecurity   and   health  care\nentitlements,\n  job\naccommodation/housing,\nopportunities  and  education    for\nchildren, continued untaxed import of\nvehicles and other belongings and the\ngranting of a residence permit and\ncitizenship to family members.\nIntegration  support:  facilitate  access\ninformation  and\nto  employment\neducational\nand\ninvestment opportunities.\n\ninstitutions\n\n●\n\n59\n\n\f●  Facilitate access to affordable land\n\nand housing.\n\n●  Reduce bureaucracy related to the\nestablishment of new businesses.\n\n●  Create  and\n\ninnovation\nlaboratories for youth entrepreneurs.\n\nsubsidise\n\nPeriodic and Partial Return\n\n●  Facilitate  easy  accessibility  of  school\n\nplaces for children\n●  Affordable housing\n●  Establishment  and  marketing  of\nthe  diaspora\nprofessional\nfor  volunteering  and\n\nlinkages  between\nand\ncommunity\ninstitutions\nparticipation\n\n●  Tax incentives e.g., duty  free\nconcessions, VAT exemptions\n\nActions\nAddressing\nchildbearing:\n\nstructural\n\nbarriers\n\nto\n\nSocial protection and social services\n●  Provision  of  child  benefit  subsidies\nespecially for low-income single parents\n●  Provision  of  free  or  highly  subsidized\nquality  childcare,  especially  for  children\nbelow the age of 3\n\n●  Subsidize  housing  for  low-income  single\n\nparent households\n\n●  Provision  of  tax  concessions  for  families\n\nwith dependent children\n\nSub-goal 1.2: Enhance Family Wellbeing to Support Reproductive Decision Making\n\nreduce\n\nObjectives\nTo\nto\nchildbearing  and  support  fertility  decision-\nmaking\n\nstructural  barriers\n\nthe\n\nDomains\nPopulation dynamics\n\nGender Equality, Equity and\nEmpowerment of\nWomen\n\nThe Family, its Roles,\nRights, Composition\nand Structure\n\nReproductive Information, Rights and Health\nServices\n\n60\n\n\f●  Provision  of  Subsidies\n\nfor  childcare\n\nmaterials\n\n●  Building  on  existing  initiatives  such  as\nPAREDOS,  develop  a  case  management\napproach to support parents and families\nfor social care support.\n\n●  Ensure  the  implementation  of  a  gender-\nresponsive child support legal framework.\n●  Provide community counselling centres to\n\nsupport parents.\n\nSocial norms changes\n●  Promoting  equal  sharing  of  unpaid  care\n\nwork between women and men.\n\n●  Use  school-based  approaches  to  address\nrestrictive  gender  roles,  relations  and\nstereotypes.\n\nLabour force measures\n●  Strengthened\n\nparental\n\nlegislative scheme\n\nprotection\n\n●  Provisions for longer periods of maternity\nleave,  depending  on  the  number  of\nchildren  under  school  going  age  in  the\nhousehold; and\n●  Establish  paternity\n\nleave  and  shared\n\nparental leave measures.\n\n●  Promote  flexible  working  arrangements.\nThis includes part-time work, compressed\nwork weeks, tele-commuting and working\nfrom home, alternative office spaces and\njob-sharing\n\nAccess to Health Care\n\n61\n\n\f●\n\n●  Ensure  access\n\nto  affordable\n\nfertility\nassessments  and  treatments  for  women\nand men\nIncrease education and training for health\ncare\nfertility\npreservation,  infertility  diagnosis,  safety\nand  effectiveness  of  infertility  treatment\noptions  and  referral  to  providers  of\ninfertility care.\n\nregarding\n\nproviders\n\nReproductive Rights and Reproductive Health\n\nYouth Development\n\nTo  ensure  non-discriminatory  and  age-\nappropriate access to sexual and reproductive\ninformation, and\nservices across the life cycle.\n\n●  Adopt  Age-appropriate  and  non-\ndiscriminatory  comprehensive\nlife\nskills  education  in  schools  consistent\nwith  the  developing  capacities  of\nyoung people.\n\n●  Ensure  access  to  quality  sexual  and\nreproductive services, including for\nadolescents and youth\n\nPolicy Goal 2: Provide Barbadians and Non-Nationals in Barbados Now and in the Future with Opportunities for Personal Development\nSub-goal 2.1: Promote and Strengthen the Care Economy across the Lifecycle and for the Vulnerable Populations\nDomains\nGender equality, equity, and empowerment of\nwomen\n\n●  Actions\n●  Promote  the  equal  sharing  of  care\n\nObjectives\nTo\ninclusive sharing of care work in families,\nhouseholds and communities.\n\nwork within families.\n\nvaluing  and\n\npromote\n\nthe\n\nMale\n\nresponsibilities and participation\n\n62\n\n●  Promote  the  value  of  sharing  care\nresponsibilities and ending restrictive\nin  the  school\ngender  stereotypes\nsystem.\n\n●  Recognise  the  full-time  and/or  part-\ntime  domestic  care  contributions  in\npension  schemes  within  the  National\nInsurance Scheme.\n\n●  Promote workplace practices that\n\n\freflect  provision  and  allowances  for\ncaregiving  arrangements\nin  family\nsettings.\n●  Ensure  the\n\nfull-time\nand/or part-time domestic care givers\nin pension schemes within  the\nNational Insurance Scheme.\n\ninclusion  of\n\nTo support home caregiving for the elderly and\nother dependents.\n\nPopulation dynamics\n\nIntegrated population and\nstrategies\n\ndevelopment\n\nNational Policy on the Elderly\n\nTo ensure that people who are vulnerable\nbecause of age, illness and/or disability lead\ndignified lives, receiving adequate physical,\nsocial and psychological care.\n\n63\n\n●  Reduce taxes on commodities for the\n\nelderly.\n\n●  Provide tax breaks or cash allowances\nfor  caregivers  who,  within\nthe\nconfines  of  their  private  household,\nprovide  care  for  elderly  people  or\nother dependents.\n\n●  Train  a  cadre  of  people  who  can\nprovide  remunerated  and  temporary\ncare  to  give  primary  care  givers\nperiodic respite.\n\n●  Promote family-friendly policies in the\nworkplace for those caring for elderly\nfamily  members  (including  flexible\nwork schedules and telecommuting).\n●  Develop  a  national  caregiver  support\nprogramme  that  includes  individual\nsupport  groups  and\ncounselling,\ntraining.\n\n●  Review  and  adoption  of  the  draft\nNational  Policy  on  Aging  which\naddresses  caregiving  and  integration\nand participation.\n\n●  Review  the  functioning  of  residential\ninstitutions for vulnerable populations\nas an input into strengthening\nprotocols for care facilities.\n\n\f●  Promote,  recognise  and  support  in-\nhome\nthe\nprovision of trained and remunerated\ncaretakers.\n\ncaretaking\n\nthrough\n\n●  Work  with  civil  society  community-\nbased organisations to promote social\ncircles for exercise and interaction.\n‘on\n\n●  Encourage\n\njob’\n\nthe\n\nSub-goal 2.2: Expand Access to Quality Health Care and Wellness Service Interventions\nDomains\nHealth and wellness sector\n\nObjectives\nTo increase training and capacity of healthcare\nproviders.\n\nPrimary health care\n\nTo  strengthen  prevention  and  control\napproaches across the life cycle.\n\nTo support participation in public spaces by\npersons of all generations and abilities.\n\n64\n\nintergenerational mentorships.\n\n●  Ensure\ntransportation  affordability\nand\nencourage\nto\nmobility  across  the  life  cycle  and\ndifferent abilities.\n\naccessibility\n\n●  Actions\n●\ntraining  and  capacity  of\nIncrease\nin  prevention,\nhealthcare  providers\nprimary care, early rehabilitative  care,\ngerontology,\nnon-communicable\ndiseases,  dentistry  and  other  needed\nspecialist areas including allied health.\n●  Assess  and  provide  human  resources\nfor  health  and  wellness,  for  example,\nincreasing  the  number  of  available\nposts in specialist areas.\n\n●  Reinforcement  of  health  and\nwellness\ninclude\nclinics\nsupport services that take a holistic\napproach  to  health  and  wellness\nwith specific focus on:\n\nthat\n\ni.  women’s health and wellness;\nii.  support and self-management of\n\ntreatment regimens; and\niii.  men’s health and wellness.\n\n\f●  Use policy measures such as taxation of\nunhealthy  foods  and  subsidies  on\nhealthy foods as incentives to influence\nand  promote  healthy  nutrition,\nincluding production and consumption\nof locally produced food.\nIncrease  availability  of\nland  and\nsupport  agricultural  practices  that\nincrease the supply of local fruits and\nvegetables.\n\n●\n\n●  Develop  and  encourage  safe  social\nspaces that are also responsive to the\nmobility  and  recreational  needs  of\nand  which\nspecific  populations,\nfor\nprovide\nintergenerational\nat\ncommunity levels.\n\nopportunities\n\ninteractions\n\n●  Ensure  that  all  private  and  public\nbuildings and facilities make provision\nto incorporate measures that  permit\nease of access and mobility for persons\nwith disabilities.\n\nSub-goal 2.3: Improve the Capacity and Proficiency of the Labour Force with Access to Expanded Opportunities\n\nDomains\nHuman resources, Education, population\nand sustainable development\n\nPartnership with the private sector\n\nEducation\n\nNational policies and plans of action for\nchildren and youth, elderly persons\n\nObjectives\nTo prepare potential workforce for entering\nand  productively  participating  in  the  labour\nforce (hard and soft skills).\n\nTo enhance the skill sets of potential entrants\nand  those  currently  in  the  labour  force  to\nmatch  the  skills  required  in  all  sectors,\nincluding new emerging sectors.\n\nActions\nEducation sector\n●  Review  and  improve  curricula  and\nin  primary,\nteaching  methods\nsecondary and tertiary education as\nthey  relate  to  science,  technology,\nengineering\nand  mathematics\n(STEM) subjects.\n\n●  Review  and\n\nimprove  curricula  and\nteaching methods in secondary, post-\n\n65\n\n\fTo promote entry and retention in the labour\nforce  through  the  provision  of  decent\nworking  conditions,  training  opportunities\nand opportunities for advancement.\n\nTo  encourage  NEET  youth  to  participate  in\nthe formal labour market.\n\nTo prevent and reverse the skills drain.\n\nsecondary  and  tertiary  education  to\ninculcate  innovation,  entrepreneurial\nbehaviour  and  issues  related  to  the\nacquisition  of  soft  skills\n(conflict\nresolution, leadership, communication,\ninter-  personal  skills  etc.),  financial\nliteracy and job-seeking skills.\n\n●  Facilitate  the  relevant  accreditation\n(e.g.,  Barbados  Accreditation  Council)\nof any reviewed or amended curricula\nto  ensure  international  acceptance  to\nthe  benefit  of\nstudent\nretention  and  attraction  of  external\nstudents.\n\ncurrent\n\nTechnical and vocational training\n●  Enhancement  of  skill  sets  of  the\ncurrent  workforce  to  meet  the\ndemands of new jobs in emergent\nindustries\ntourism,\n(heritage\nrenewable  energy,  graphic  design\nsoftware\nand\nrum,\ndevelopment,\npharmaceuticals,\nbiotech\nproducts).\n●  Provision\n\nspecialty\nand\n\nopportunities\n\nanimation,\n\nof\n\nfor\n\nstructured arrangements that would\npermit qualification and certification\nfor persons providing care services in\nthe home, whether serving the needs\nof children, the elderly or the disabled.\nPromotion\nvocational education and  training\n(TVET)  and the  implementation of a\n\n  technical\n\nand\n\n  of\n\n66\n\n\fdual-track\n\ncomprehensive\nsystem\ninstruction\npractical work and experience.\n\nTVET\nwhere\ninstitutional\nis  complemented  by\n\n●  Facilitate  Research  and  Development\nand\n\nproductivity\n\nenhance\n\nto\ncompetitiveness.\n\n●  Targeted\n\ndissemination\n\nof\ninformation  on  employment\neducation/training\nand\nopportunities for NEET youth by\nrelevant government agencies.\n\nPartnerships\n●  Encourage investment in training in\nboth the private and public sectors\nespecially with respect to improving\nthe  quality  of  vocational  training\nwith  a  heavy  emphasis  on  the\nacquisition of digital skills.\n\nand\n\n●  Establish  partnerships  with  families,\ncommunity-based organizations, faith-\nbased  organizations\nlabour\nunions, specifically targeting youth not\nin employment, education, or training\n(NEET)  to  directly  inform  them  of\nopportunities  and  assist  them  with\ncapitalizing  on  such  opportunities  for\ntraining  and  prospects  for  becoming\nemployable and/or employed.\nImplementation  of  incentives  for\nto\nindustry-academia\nenhance  collaborative  capacities\nacross industry and academia. This\n\nlinkages\n\n●\n\n67\n\n\fallows  for  greater  matching  of  the\nsupply and demand for skills.\n\n●  Encourage investment and partnership\nfoster\nthat\nagreements\nparticipation\nand\nin\ndevelopment  initiatives  involving  the\npublic sector, the business community\nand academia.\n\nwill\nresearch\n\n●  Commission\n\ndedicated  ministries,\nresearch  support  centres  and  science\ncouncils to provide for a one-stop-shop\nfor innovators.\n\nRegulatory and administrative processes\n●  Review  of\nretirement\n\nthe  mandatory  age  of\n\n●  Promote  agenda  consistent  with  the\nattainment of decent work in keeping\nwith ILO’s Decent Work protocols.\n\n●  Continued  development  of\n\ninstitutional\n\nlabour\nmarket data systems and development\nof\nthe\nrealisation of a comprehensive  labour\nmarket  information  system  which  is\naccessible and current\n\nlinkages\n\nfor\n\nPolicy Goal 3: Promote Integrated Settlement Development and Safeguard the Ecological Balance\nSub-goal 3.1: Reconcile Population Redistribution, Land Use and Settlement Patterns\nDomains\nPopulation growth, urbanization, and internal\nmigration/commuting\n\nObjectives\nTo promote the efficient use and management\nintegrated,\nservices\nland  and\nof\nsustainable, resilient\ndevelopment.\n\nfor\n\n●  Actions\n●  Adopt  the  current  Barbados  Physical\nDevelopment Plan with detailed policy\nguidelines that inter alia seek\nto:\n\n68\n\n\fPopulation redistribution and health care\n\nTo encourage the design and development of\ncompact,  well-connected  and\ncomplete\ncommunities  with  a  distinct  sustainable\nworking landscape.\n\nPolicy and environment\n\n69\n\n●  Promote the efficient use of land and\nservices through compact, contiguous\nand mixed-use development.\n\n●  Encourage  vibrant,  walkable,  and\nprosperous  cores  are  tailored  to  the\neach\npossibilities\ndistinct\ncommunity (commercial, residential,\nand cultural spaces).\n\nof\n\n●  Promote\n\nthe\n\ndesignation\n\nlocated  within\n\nof\nPredominantly Residential Areas to be\nareas\nthe  Urban\nCorridor,  Stable  Suburban  Areas  and\nNational Park Villages and intended to\nbe  developed  as  compact  and\ncomplete communities.\n\n●  Protection  of  community  cores,  namely,\nthe  commercial,  residential  and  cultural\nheart  and  central  places  of  Barbados,\nproviding  the  densest  concentration  of\npeople, buildings, and activities.\nhigher\n\ndensity\nof\nresidential development within the Urban\nCorridor.\n\n●  Encouragement\n\nand\n\nessential\n(health-related,\n\n●  Encouragement  of  major  development\nservices\nfacilities\ninfrastructure\npolice\nstations, post offices, libraries, community\ncentres) in Regional and Local Centres\n●  Review  of  school  locations  to  ensure\nproximity  to  urban  settlement  areas  and\nwell  serviced  by  transportation  options\nand  to  respond  to  rising  or  falling\npopulations of school age children.\nIncorporate  adaptive  reuse  of  public  and\n\n●\n\n\fheritage buildings;\n\n●  Designation  of  an  extensive  area  outside\nof the Urban Corridor and National Park as\na Working Landscape for the harmonious\nco-existence\nof\nagricultural production, renewable energy\ninitiatives,\nsolid\nwaste  management  and  a  mixture  of\nessential infrastructural services.\n\nresource  extraction,\n\nand  management\n\n●  Review\n\ntransport\n\nroutes  based  on\npopulation  changes  and  commuting\npatterns and ensure access for all to safe,\nage  and  gender  responsive,  affordable,\naccessible and sustainable urban mobility\nand sea transport systems;\n\n●  Promotion  and  incentivization  of  transit\n\n●\n\nuse and active transport\nInstitution of the requirement for EIAs and\nSIAs  for  any  significant  expansion  of\nexisting  or  development  of  new  sporting\nto\ncomplexes  or\nserving  communities  or  the  national\npublic.\n\nfacilities  dedicated\n\n●  Actions\n●  Encourage Integrated Water Resource\nManagement  approaches  and  water\nefficient\ncommunity\ndevelopment  plans  as  well  as  public,\nprivate  and  household  building\ndesign.\n\nsystems\n\nin\n\nSub-goal 3.2: Ensure Efficient Management of Natural Resources and the Environment\nDomains\nNational policies and plans of action\n\nObjectives\nTo strengthen an integrated decision-making\nframework  for  development  initiatives  to\nsafeguard  our  essential  ecosystem  services\nand reduce vulnerability to natural hazards.\n\nHealth promotion\n\nLand use\n\nManagement of natural resources\n\n70\n\n\fPopulation and environment\n\nand\n\nalongside\n\n●  Strengthen  the  protection  of  water\nresources\neconomic\npopulation\ndevelopment\nexpansion  through  integrated  water\nuse  and  supply  plans  for  proposed\ndevelopments.\nlegislative  arrangements\nInstitute\nrequesting\nimpact\nstatements  as  pre-requirements  for\nnew  major  developments  proposed\non or adjacent to lands designated for\nagricultural use.\nthe\n\n●  Reinforce\n\nagricultural\n\nprotection\n\n●\n\nand\ncontinued  existence  of  food  and\nagricultural  areas  within  the  urban\ncorridors of Barbados.\nInstitute  legislation  for  applications\nfor\ndevelopment\nwithin  30  metres  of  the  coast  to  be\nsubject  to  EIAs,  SIAs  and  other\nsupporting technical studies.\n\ninfrastructural\n\n●\n\n●  Encourage new development, as well\nas  institutional,  community  facilities\nand  national  infrastructure  projects\noutside of Natural Hazard Areas.\n●  Strengthen  regulations,  monitoring\nand enforcement for pollution control\nas it relates to water pollution, illegal\ndumping and habitat disruption.\n●  Encourage  the  inclusion  of  design\n\nmeasures for climate change\nresiliency  that  must  be  incorporated\ninto site plans for new facilities.\n\n71\n\n\fSub-Goal 3.3 Strengthen Collective Resilience to Impacts of a Changing Climate\nDomains\nNational policies and plans of action\n\nObjectives\nTo promote climate resilient development\nacross all sectors and levels of governance.\n\nManagement of natural resources\n\nManagement of development and land use\n\n●  Ensure  that  economic  and  social\nvaluation tools and methodologies are\nincorporated into the decision-making\nprocess  of  natural  resource  use  and\npopulation development strategies.\n\nActions\n●  National, regional and community physical\ndevelopment  plans  to  integrate  climate\nchange as a cross-cutting consideration.\nIntroduce  ecosystem-based  interventions\ncombined  with  existing  strategies  to\nimprove  ecosystem  health,  address\nclimate  change  and  known  coastal\nhazards.\n\n●\n\nthe  public\n\n●  Strengthen  governance  and  partnerships\nsector,  private\nbetween\norganisations  and  non-  governmental\norganisations to build capacity to combat\nthe  effects  of  climate  change  and  the\nrisk\nof\nwider\nmanagement activities.\n\nspectrum\n\ndisaster\n\n●  Encourage\n\nthe\n\ninclusion  of  design\nmeasures  for  climate  change  adaptation\nand  resiliency  that  must  be  incorporated\ninto site plans for new facilities.\nImprove\ncapacity\ntechnical\nsustainable livelihoods in climate\nresilience.\n\nand\n\n●\n\n72\n\n\f●\n\n●  Promote  regeneration  and  conservation\npractices wherever possible to ensure the\npreservation and improvement of natural\nhabitats.\nImplement risk resilient integrated coastal\nsafeguard\nzone  management\nto\nlivelihoods,\ninvestments  and  natural\necosystems  in  the  face  of  a  range  of\ncoastal hazards including climate change.\nclimate\nregeneration\ninfrastructural  and\n\n●  Encourage\nresilience\nprojects  by  new\neconomic development initiatives.\nIncrease the overall health and resiliency\nof  natural  habitats  and  avoid\nthe\ndegradation of ecosystems which support\nlivelihoods and infrastructure.\n\ninvestment\nand  habitat\n\ninto\n\n●\n\n●  Encourage  energy  efficient  technologies\nand\nrenewable  energy\ngeneration      elements      for      all    new\ninfrastructure developments\n\nthe  use  of\n\n73\n\n\f Appendix 1: Derivation of Population Size 2021 Census\n\nThe  total  resident  population  estimates  were  derived  from  the  corresponding  2010  Census\nestimates,  adjusted  by  subsequent births  and  deaths  which occurred each  year  to  1st  August\n2021, with an adjustment for net migration over the intervening period.  This method was utilised\nto counteract the large undercount.\n\nCollected  data  were  also  compiled  on  the  institutionalized  population  and  the  homeless\npopulation,  along  with  the  tabulated  Census  population,  as  at  1st  August  2021,  to  derive  an\nestimate of the undercount in this Census.\n\nThe  total  resident  population  estimates  were  disaggregated  by  age-groups,  based  on  ratios\nderived  from  the  tabulated  Census  results.  The  disaggregation  by  parish  was  based  on  ratios\nderived from an analysis of administrative data utilised by the department.\n\n74\n\n\f Appendix 2: Population projections 2020-2050 based on the maintenance of a\n replacement rate since 1980\n\nWhile specifying the number of working-age people needed in Barbados to ensure social and economic\n\nvibrancy could seem arbitrary, and especially when not sufficiently informed by labour force data and an\n\nindustrial policy framework, it is possible to establish credible and justifiable targets for population\n\ngrowth based on the maintenance of the fertility replacement rate.\n\nShould the fertility rate stayed at the replacement rate (2.1) since 1980, the population of Barbados would\n\nhave exceeded 360,000 by 2020 and would just fall short of eclipsing 400,000 by 2050.\n\nPopulation Projections for Missing People Model – Barbados Five ear Intervals 2020-2050\n\nYear\n2020\n2025\n2030\n2035\n2040\n2045\n2050\n\nProjected Population at fertility rate of 2.1\n360450\n372685\n382473\n389418\n393754\n396198\n397622\n\n75\n\n\f Appendix 3: An Examination of the Population Density and Gross Domestic\n## Product per capita22\n\nWhile there may be a link between population size and economic growth, this link would be complex\nand uncertain given history, global economic conditions, variations in productivity and external stresses\nand shocks. In seeking to explore potentially feasible population sizes for Barbados, the following data\nhighlights data on population density and GDP per capita.\n\nDrawing on population and GDP data from the World Bank’s World Development Indicators database23,\nthe following tables and charts outline the relevant population densities for countries with a GDP per\ncapita higher than Barbados, and population densities over 500 persons per square kilometre; Barbados’\npopulation density is 653 persons per square kilometre.\nTable 1: GDP per capita, Population Density, Population and Land Area for selected countries for 2020\n\nSelected\nCountries\nMonaco\n\nBermuda\n\nSingapore\n\nNetherlands\n\nHong Kong SAR,\nChina\nSan Marino\n\nMacao SAR, China\n\nKorea, Rep.\n\nAruba\n\nMalta\n\nSint Maarten\n(Dutch part)\nBahrain\n\nBarbados\n\nGDP per capita (constant\n2015 US$)\n166911\n\nPopulation density (people\nper sq. km)\n18215\n\nPopulation,\ntotal\n36922\n\nLand Area\n(square km)\n2.027\n\n99745\n\n59176\n\n46303\n\n41451\n\n41416\n\n34562\n\n31372\n\n25824\n\n25619\n\n23791\n\n22579\n\n14856\n\n1183\n\n7919\n\n518\n\n7125\n\n567\n\n20556\n\n531\n\n592\n\n1610\n\n1244\n\n1882\n\n653\n\n63893\n\n5685807\n\n17441500\n\n7481000\n\n34007\n\n676283\n\n51836239\n\n106585\n\n515332\n\n42310\n\n1477469\n\n280693\n\n54\n\n718\n\n33670\n\n1050\n\n60\n\n32.9\n\n97600\n\n180\n\n320\n\n34\n\n785\n\n430\n\nSource: World Development Indicators (2023)\n\nAs shown in Table 1, there are 12 countries with a GDP per capita higher than Barbados and with\npopulation densities in excess of 500 persons per square kilometre. GDP per capita ranges from\nUS$22,579 (Bahrain) to US$166,911 (Monaco). Population density ranges from 518 persons per square\nkilometre (Netherlands) to 20,566 (Macao SAR, China). It should be noted that there are four countries\nwith a lower population density than Barbados but with a higher GDP per capita (Aruba, San Marino,\nRepublic of Korea and the Netherlands).\n\n22 Prepared by Dr. Jonathan Lashley, member of the Barbados Population Commission\n23\n\n https://databank.worldbank.org/source/world-development-indicators#\n\n76\n\n\fFigure 9: Population density by GDP per capita for Selected Countries (2020)\n\n25000\n\n20000\n\n15000\n\n10000\n\nMacao\n\nSAR, China\n\nMonaco\n\nHong Ko\n\nng SAR, Chin\n\nSaingapore\n\nSint Maart\npar\n\n5000\n\nBahrain\n\nBarbados\n\nen (Dutch\nt)\nMalta Aru\nKore\n\nba\n\nSan\n\nMarino\n\na, Rep.\n\nNetherlands\n\nBe\n\nrmuda\n\n)\n\nm\nk\ne\nr\na\nu\nq\ns\n\nr\ne\np\ns\nn\no\ns\nr\ne\np\n(\n\ny\nt\ni\ns\nn\ne\nD\nn\no\ni\nt\na\nu\np\no\nP\n\nl\n\n0\n\n0\n\n20000\n\n40000\n\n60000\n\n80000\n\n100000\n\n120000\n\n140000\n\n160000\n\n180000\n\nGDP per capita\n\nFigure 1 presents population density by GDP per capita. The data highlights some outliers, namely\nMonaco, Macao and Hong Kong (SAR, China), and Singapore in relation to both population density and\nGDP per capita. Bermuda, Netherlands, and San Marino can also be considered as outliers in relation to\nGDP per capita.\nTable 2: Selected Countries by GDP per capita with Barbados’ Population at Equivalent Population Density\n\nCountry\nMacao SAR, China\nMonaco\nSingapore\nHong Kong SAR, China\nBahrain\nMalta\nSint Maarten (Dutch part)\nBermuda\nBarbados\nAruba\nSan Marino\nKorea, Rep.\nNetherlands\n\nGDP per capita  Barbados Population at Equivalent Density\n8,838,957\n7,832,491\n3,405,149\n3,063,648\n809,314\n692,477\n535,097\n508,778\n280,693\n254,620\n243,717\n228,377\n222,746\n\n34,562\n166,911\n59,176\n41,451\n22,579\n25,619\n23,791\n99,745\n14,856\n25,824\n41,416\n31,372\n46,303\n\nTable 2 presents Barbados’ population at levels equivalent to the comparator countries. As the\n\n77\n\n\ftable shows, countries with lower population densities than Barbados have achieved higher\nlevels of GDP per capita (Aruba, San Marino, Korea Republic and the Netherlands); however, as\nnoted previously, historical and structural issues would account for these differences. The\nsame can apply for countries with higher population densities.\n\n78\n\n\f Appendix 4: Technical Note on the potential relationship impact of population\n growth on economic growth.\n\nExecutive Summary24\n\nIn surveying the literature on the impact of population  growth on economic growth, from the\nsomewhat bleak predictions of Malthus in 1789 to the contemporary works of (Bloom, Canning\nand Sevill, 2001), (Pegou Sibe et al, 2016) and the (Chowdhury et al, 2018), there is overwhelming\nevidence that there remains a lack of academic consensus on the potential relationship between\npopulation growth and economic growth. The findings of the existing research indicate mixed\nresults, where various studies show that population growth either encourages, dissuades or is\nindependent of economic growth. This result suggests that assessing the relationship between\nthese two variables is a more complex matter, which is influenced not only by the composition\nof  a  country’s  population  but  other  factors  including  the  structure  of  the  economy  and  the\nprevailing social and finance policies and infrastructure.\n\nTheoretical Basis\n\nIn  general,  the  literature  on  the  possible  linkage  between  population  growth  and  economic\ngrowth remains largely unsettled. The question as to the potential consequences of population\ngrowth on growth, remains an ongoing discussion that has continued across the generations. In\nhis 1798 writings, “An Essay on the Principle of Population,” Mr. Thomas Malthus, was one of the\nfirst researchers to theorize on the direction and potential impacts of population growth. Mr.\nThomas  Malthus  purported  that  without  intervention,  the  population  would  increase  in  an\nunchecked manner, beyond the capacity for the natural resources and food production systems\nto sustain.\n\nMalthus’ theory was rooted in the notion that the population grew in geometrical manner and\nproposed that the population would likely double itself every twenty-five (25) years. In contrast\nhe proposed that subsistence food production increased only in an arithmetical ratio, as such,\neven  with  the  removal  of  barriers  or  restrictions  to  food  production,  population  growth  will\neventually exceed the capacity for food production systems to meet demand. Malthus asserts\nthat the only necessity for sustenance may act as a constraint to population growth.\n\nHe suggested that this emerging reality would lead to severe economic and social consequences,\ninclusive of depressed personal development, increased poverty, and famine, where the brunt of\nthese damaging effects will be borne by those in the lower classes of society. As it relates to the\nlabour market, Malthus proposed that a rapid unhindered increase in the population would also\nlead  to  reduced  wages  and  deteriorating  working  conditions,  as  labour  supply  exceeds  the\ndemands of the market. On the other hand, the limitation in the supply of commodities would\n\n24 Prepared by the Economic Affairs and Investment Division, Ministry of Finance, Economic Affairs and Investment\n\n79\n\n\flead to inflation, reduced standards of living, and an increase in the cost of care, particularly for\nchild rearing.\n\nHowever, today’s conditions are generally not in line with the harshest of Malthus’ predictions.\nAs noted in the IMF World Economic Outlook, “The Global Demographic Transition,” September\n2004, “Today the theories of Malthus appear to be happening in reverse. As economic prosperity\nhas risen around the world, fertility rates have fallen (and large gains in life expectancy have been\nmade), resulting in slower population growth and aging.” Additionally, Jinill Kim in the September\n28,  2016  publication  of  the  IFDP  Notes  entitled  “The  Effects  of  Demographic  Change  on  GDP\nGrowth in OECD Economies”, stated that contradictory to the pessimist outlook of Malthus “that\nGDP growth per capita would fall due to a continued rapid increase in world population …fertility\nrates  instead  plunged  beginning  in  the  1960s.  The  global  fertility  rate  (defined  as  births  per\nwoman), which was between 5 and 6 before 1950, declined below 3 in 2000 and is projected to\nbe only around 2 by 2050. Correspondingly, the growth rate of the total world population, about\n1\n1  percent  in  1950,  decreased  to  below  1\n4\n\npercent in 2000, and is projected to stay barely\n\n4\n\n3\n\npositive due to a longer life expectancy by 2050.”\n\nThe neoclassical Solow-Swan growth model introduced by Robert Solow and T. W. Swan in 1956,\nasserts that output or growth in the economy (Y) at any time (t) is a function of the interaction\nthree main factors of production, inclusive of capital (K), labour (L) and technology/(effectiveness\nof labour)(A), at that time, where labor is treated as equivalent to the size of the population and\nAL is a concept referred to as effective of labour.\n\nY(t)= F(K(t), A(t)L(t))\n\n( equation 1)\n\nThe Solow-Swan model which builds on the Harrod–Domar model, allows for the examination\nof  changes  in  the  economy,  based  on  the  interaction  and  changes  in  factors  of  production.\nHowever,  the  model  treats  technology  (effectiveness  of  labour)  and  labour  as  exogenous\n(external)  variables,  which  grow  at  constant  rates.  As  such,  the  changes  in  the  economy  are\nmainly viewed in terms of the changes reflected in capital. In particular, under the model output\nper unit effective labour (y=Y/AL) can be seen as a function of capital per unit of effective labour\n(k=K/AL),\n\ny=f(k)\n\n( equation 2)\n\nWhile changes in capital per unit of effective labour is viewed as the difference between actual\ninvestment per unit of effective labour [sf(k(t))], [where (s) is the rate of saving] and the amount\nof investment required to keep capital per unit effective labour at the existing level (break-even).\nIn  this  instance  break-even  investment  [(n+g+  )  k(t)]  is  based  on  the  influence  of  the  rates  of\ngrowth in the population (n) and technology (g) as well as the level of depreciation ( ) on the\nexisting capital stock.\n\n∆k (t) = sf(k(t))- (n+g+  ) k(t)\n\n( equation 3)\n\n80\n\n\fIn general, the Solow-Swan model theorizes that a country’s economy converges to a balance\npath growth/steady state, where k is k*, that is where actual investment per unit of effective\nlabour is equal to break-even investment [sf(k(t)) = (n+g+ )k(t)] . In this instance, each variable in\nthe model (Y, K and AL) is growing at constant rate (n+g). On a balance path of growth, capital\nper worker and output per worker is determined solely by the rate of technical progress.\n\nAs  such,  based  on  the  model  (refer  to  equation  3)  an  increase  (decline)  in  the  growth  of  the\npopulation  (n)  would  lead  to  a  decline  (increase)  in  the  k*.  This  would  lead  to  a  temporary\nreduction (increase) in output per worker, while the overall output of the economy will increase\n(decline) based on rate of population growth. However, the impact on the capital per worker,\noutput per worker and the overall output will dissipate eventually (returning to the balance path\nof growth), given that in the long-term growth is driven solely by changes in technology.\n\nIn 1992, (Mankiw et al., 1992) introduced an augmented Solow model, which sought to account\nfor accumulation of human capital (education etc.) and physical capital with regard to the effect\nof changes in the economy growth. Under this model “the negative impact of population growth\nis larger as population growth now forces economies to use their scarce savings to equip young\npeople with physical and human capital. As a result, a 1% increase in population growth would\ndecrease per  capita  income  by 2%”25 The  potential  contribution  in education  and  other  social\nservices  to  development  has  been  recognized  by  others  such  as  (Ross-Brewster,  1996)  who\nargued that the difference in development performance between countries (namely Barbados\nand Jamaica) can be somewhat defined in terms of the investment in social sector. He purported\nthat the findings of empirical studies show that investment in education and health, together\nwith their impact in reducing income equality, is the key to sustained growth.\n\nAt  present  some  researchers  have  proposed  that  the  demographic  changes  and  economic\nconditions observed  globally  are  more  consistent,  with the  perspective  highlighted  within  the\nDemographic  Transition  Theory.  The  Demographic  Transition  Theory  was  first  introduced  by\nWarren  Thompson  in  1929  and  later formalized by  Mr.  Frank  Notestein and  indicates that  all\ncountries  as part of their  developmental  process,  will transition  through various  demographic\nchanges in terms of patterns in mortality, fertility and growth rates over time. The demographic\ndynamics experienced by various societies can be characterized within five stages, inclusive of:\n\n  Stage  1:  preindustrial  society-  in  which  high  mortality  and  high  birth  rates  are\nrecorded,  leading  to  slow  population  growth.  This  stage  has  been  referred  to  as\nMathusian stagnation.\n\n  Stage 2: developing society/early industrialization  - fall in the mortality rate due to\nimprovements in health care and sanitation, while the birth rate remains high, leading\nto rapid population growth.\n\n  Stage 3: the birth rate gradually begins to fall, while the mortality rate continues to\ndecline, which leads to a fall in the rate of population growth. The adjustments\n\n25\n\n The impact of population growth on economic growth and poverty reduction in Uganda\n\n (econstor.eu)\n\n81\n\n\fobserved at this stage are usually related to the introduction/enhancement of access\nto family planning services and improved economic opportunities for women.\n\n  Stage 4: birth and death rates are both low, stabilizing the population. These societies\nare  usually  characterized  by  access  to  better  health  care  and  education  and  more\nfavorable opportunities for employment. In this stage, improvement in life\n expectancy is expected, while the population remains stable.\n\n  Stage 5: At this stage the population begins to decline.\n\nBloom, Canning and Sevill, 2001 notes that varying positions on the impact of population growth\non the economy, “restricts, promote or is independent of economic growth”, focus mainly on the\nconcepts  of  population  size  and  growth.  Bloom,  Canning  and  Sevill,  2001  stated  that  the  age\nstructure  of  population,  resulting  from  the  demographic  dynamics  occurring  in  society,  has  a\nsignificant  impact  on  the  performance  of  an  economy  and  determine  the  distribution  of\nresources  in  a  country.  A  country  with  a  high  proportion  of  dependents  (whether  children  or\nelderly) will devote a significant proportion of its resources to their care, which they argue can\ndepress growth. In contrast, where a majority of a country’s population is of working age “the\nadded productivity of this group can produce a \"demographic dividend\" of economic growth.”\n\nIn this context demographic dividend is defined as “the economic growth potential that can result\nfrom  shifts  in  a  population’s  age  structure,  mainly  when  the  share  of  the  working  age\npopulation(15 to 64) is larger than the non-working age share of the population (14 and younger,\nand 65 and older).26 As highlighted in the United Nations Economist Analysis entitled “Harnessing\nthe  Economic  Dividends  form  Demographic  Change”  “A  larger  working-age  population  can\ncontribute  to  increased  labour  force  participation,  driving  economic  growth  and  productivity.\nIndividuals  in  this  group  tend  to  also  accumulate  savings  at  a  higher  rate,  facilitating  further\ninvestment-led growth and development. A youthful and dynamic population brings fresh ideas\nand energy to the economy, fostering innovation and entrepreneurship”27\n\nBloom,  Canning  and  Sevill,  2001  suggested  that  a  number  of  developing  countries  are\nexperiencing demographic transition, from high to low rates of fertility and mortality and as a\nresult will experience a period, where the population will increase significantly and provide an\nopportunity  for  these  territories  to  capitalize  on  the  “demographic  dividend”.  However,  the\nopportunity to maximize on the economic benefits related to “demographic dividend”, will be\ndependent on the country facilitating the requisite enabling environment, inclusive of conducive\npolicies and infrastructure in the areas of health, education, family planning, and labor. Bloom,\nCanning and Sevill, 2001 also purported that exploiting the advantage posed by “demographic\ndividend” can lead to a sustained level of economic prosperity for a country for a long period.  On\nthe other hand, failure to institute such polices, can also have severe consequences. “At worst,\nwhere an increase in the working-age population is not matched by increased job opportunities,\n\n26\n\n27\n\n Demographic dividend (unfpa.org)\n Frontier Technology Issues: Harnessing the economic dividends from demographic change |\n\n Department of Economic and Social Affairs (un.org)\n\n82\n\n\fthey will face costly penalties, such as rising unemployment and perhaps also higher crime rates\nand political instability.”\n\nEmpirical Evidence\n\nA large body of research has been undertaken to investigate the potential relationship between\npopulation growth and economic growth over the years, the findings of which indicate varying\nresults with regards to the correlation of these variables, whether it be positive, or negative or\nno relationship. The following are findings of select studies conducted in different countries on\nthis matter:\n\nCallen  et.  A,  2004,  the  IMF  World  Outlook,  “The  Global  Demographic  Transition,”  September\n2004  investigated  the  relationship  between  demographic  variables  (inclusive  of  1:  Share  of\nworking-age population; and 2: Share of elderly population) and per capita GDP growth, saving,\ninvestment, the current and fiscal balance, for 115 country panel data set covering the period\n1960-2000. The results indicated that per capita GDP growth is positively correlated with changes\nin the relative size of the working-age population and negatively correlated with changes in the\nshare  of  the  elderly  population.  The  study  also  indicated  that  based  on  the  UN’s  population\nprojections  extending  to  2050  “the  projected  increase  in  elderly  dependency  ratios  and  the\nprojected decline in the share of the working-age population could result in slower per capita\nGDP growth, and lower saving and investment” in advanced economies. The impact on growth\nin developing countries varied by region, with favorable improvement expected in Africa and the\nMiddle East; changes on the demographics “are likely to weigh on growth in central and eastern\nEurope and, to a lesser extent, in Asia and Latin America by 2050”.\n\nHock Tsen and Furuoka, 2005 observed mixed results during the investigation of the relationship\nbetween  population  and  economic  growth  in  Asian  economies,  where  the  Granger  causality\nmethod was applied. They concluded that the impact of population growth, whether beneficial\nor detrimental, to economic growth in a country could not be predetermined with certainty. The\nresults confirmed a bidirectional Granger causality between population and economic growth for\nJapan, Korea and Thailand; while for China, Singapore and the Philppines population is found to\nGranger  cause  economic  growth  and  not  vice  versa.  For  Hong  Kong  and  Malaysia,  economic\ngrowth  is  found  to  Granger  cause  population  growth  and  not  vice  versa.  For  Taiwan  and\nIndonesia, there is no evidence of Granger causality between population and economic growth.\n\nKlasen et al, 2007, in the working paper “The Impact of Population Growth on Economic Growth\nand  Poverty  Reduction  in  Uganda”  investigated  the  likely  effect  of  population  growth  on  per\ncapita  economic  growth  and  poverty  in  Uganda,  using  cross  section  analysis  of  data  over  the\nperiod  1960  to  2020.  The  results  indicated  that  population  growth  had  a  positive  impact  on\noverall  economic  growth  (GDP),  under  both  the  Harrod-Domar  Model  and  Solow  Model;\nhowever, an additional person/increase in population has less than proportionate influence on\neconomic growth.\n\nSavas, 2008, investigated the causal relationship between population and per capita economic\n\n83\n\n\fgrowth  in  the  Central  Asian  Economies  (CAEs)  namely,  Kazakhstan,  Kyrgyzstan,  Tajikistan,\nTurkmenistan and Uzbekistan. Using the ARDL approach to cointegration, a relationship between\npopulation and economic growth was determined as strong and positive in the CAEs over the\nperiod of the analysis. The researcher suggested that the results imply that the CAEs seem to be\nin the second stage of the demographic transition, called post-Malthusian regime, in which the\nrelationship  between  income  and  population  growth  remains  highly  strong  and  positive.  The\nfindings support the existence of a long-run relationship between population and real per capita\nincome  and  provide  strong  support  for  the  hypothesis  that  population  is  driving  growth.  The\nresults of causality tests suggest that there appears to be bi-directional causality when causality\nis assumed to run from population to real per capita or vice versa in the long run for all of the\ncountries, while there are no feedback effects from real income to population in the short run,\nonly for Turkmenistan and Uzbekistan.\n\nChang et. Al, 2014 investigated the link between population growth and economic growth in 21\ncountries over the period 1870-2013, with the application of the bootstrap panel causality test.\nThe  results  established  a  connection  between  population  growth  and  economic  growth  for  a\nnumber of  the  countries;  however,  the  nature  of  the  relationship  varied  across  each  country,\nwhile  no  relationship  between  population  and  economic  growth  was  established  for  other\nterritories.  A  one-way  Granger  causality  running  from  population  growth to  economic  growth\nwas  observed  for  Finland,  France,  Portugal,  and  Sweden;  and  a  one-way  Granger  causality\nrunning from economic growth to population growth for Canada, Germany, Japan, Norway, and\nSwitzerland.  Additionally,  no  causal  relationship  between  population  growth  and  economic\ngrowth is found in Belgium, Brazil, Denmark, Netherlands, New Zealand, Spain, Sri Lanka, the UK,\nthe USA and Uruguay; while a two-way relationship for population growth and economic growth\nwas observed for Austria and Italy. These results varied further when the data is split between\ntime period.\n\nKim, 2016 assessed how a changing age structure of the population (between four groups-ages\n0-14, 15-39, 40-64, and 65+) affected GDP growth using cross-country data for 18 advanced OECD\ncountries. In general, the findings indicated that an increase in the population share of the young\nand  elderly  population  tended  to  lower  the  growth  rate  of  GDP,  while  an  increase  in  the\npopulation in the two groups between 15 and 65 years old would tend to boost the GDP growth\nrate.  Demographic  changes  accounted  for  a  significant  portion  of  the  downward  trend  in\neconomic growth of these countries during the past decade.\n\nPegou Sibe et al, 2016 employed the Error Correction Model method to estimate the long run\nrelationship between population growth on economic growth and the granger causality test to\nidentify a bi-directional causality between economic growth and population growth (per capita\nincome) on panel data for 30 of the most populated countries of the world over the period 1960\nto 2013. The results indicated that population growth acts as catalyst to economic growth and\nthat there is a bi-directional causality, when causality is assumed to run from population to real\nper capita or vice versa in the long run for the selected countries reviewed.\n\nAhmad, R. N. and Ahmad, K., 2016, examined the relationship between economic growth (the\n\n84\n\n\fdependent  variable)  and  population,  fertility  rate,  employment,  education  and  investment\n(independent variables) in Pakistan over a 35-year period (1981 to 2015). At that time Pakistan\nwas one of highest populated countries in the world and from 2011 to  2012  recorded a total\nfertility rate of 3.4. Using the Unit root test of ADF, co-integration and auto-regressive distributed\nlags  test  to  analyze  the  results,  it  was  concluded  that  population  and  fertility  rate  negatively\nimpacts economic growth in Pakistan. In contrast investment and employment are shown to have\na  positive  impact  on  economic  growth.  Ahmad,  and  Ahmad,  asserted  that  the  “overall  study\nconcludes that the population has a great hindrance in way of economic growth of Pakistan. If\nnot controlled than it can be very harmful for our economy.”\n\nChowdhury et al, 2018, in the paper entitled “Population and Economic Growth in Bangladesh:\nMalthus Revisited”, the relationship between population growth and economic development in\nterms  of  per  captia  GDP  was  examined  in  Bangladesh.  In  2016,  Bangladesh  represented  the\nsecond fastest growing country in the world with 7.1% GDP growth. Bangladesh is one of the\nmost  densely  populated  countries  in  the  world  with  3,310  people  per  square  mile.  The  study\nundertook a simple linear regression analysis of yearly times series data from the period of 1960\nand  2017,  and  the  results  indicated  a  clear  negative  and  statistically  significant  relationship\nbetween per capita GDP and population growth rate, where a 1% increase in population growth\nleads  to  a  decrease  per  capita  GDP  by  1.95%.  The  author  concludes  that  population  growth\nadversely  effects  the  economic  development  of  Bangladesh,  which  supports  the  Malthus\nprediction and suggests that such growth places pressure on investment growth and diminishes\nthe savings rate.\n\nConclusion\n\nIn  conclusion,  there  are  numerous  viewpoints  regarding  the  potential  relationship  between\npopulation growth and economic growth within territories. However, there does not exist a “one\nsize fit all” theory, as it relates to impact of the population growth on the economy. Rather the\nmixed  results  from  the  aforementioned  studies  suggests  that  the  potential  impact  whether\nbeneficial,  detrimental  or  non-existent,  between  population  growth  and  economic  growth/\ndevelopment  is  a  complex  matter,  which  is  influenced  not  only  by  the  structure,  size  or\ncomposition of a country’s population but other factors including the structure and size of the\neconomy, the stage of country’s development and existing social and finance infrastructure and\npolicies;  particularly\nin  the  areas  of  health,  sanitation,  education  and  governance.\nNotwithstanding the lack of consensus between the nexus of population growth and economic\ngrowth as shown through the work of Ross-Brewster, investment in social capital is key to the\ndevelopment  of  countries,  particularly  as  it  relates  to  the  Human  Development  Index  and\nsustained growth.\n\nReferences\n\nAhmed R. N., Ahmad K. (2016). Impact of population on economic growth: A case study of\nPakistan. Bulletin of Business Economics, 5(3), 162–176.\n\n85\n\n\fBloom,  David  E.  and  Canning,  Dave  and  Sevilla,  Jaypee,  (2001).  Economic  Growth  and  the\nDemographic Transition NBER Working Paper No. w8685, December\n\nChang,  Tsangyao;  Chia,  Feng;  Chu,  Hsiao-Ping;  Deale,  Frederick  W.;  Gupta,  Rangan(2014).:The\nRelationship between Population Growth and Economic Growth Over 1870- 2013: Evidence from\na Bootstrapped Panel-Granger Causality Test, University of Pretoria Department of Economics\nWorking Paper Series 2014-31.\n\nChowdhury, M. N. M., & Hossain, M. M. (2018). Population Growth and Economic Development\nMalthus.\nBangladesh:\nin\nhttps://arxiv.org/ftp/arxiv/papers/1812/1812.09393.pdf\n\nRevisited\n\nGregory  Mankiw  &  David  Romer  &  David  N.  Weil,  (1992).  A  Contribution  to  the  Empirics  of\nEconomic  Growth,  The  Quarterly  Journal  of  Economics,  Oxford  University  Press,  vol.  107(2),\npages 407-437.\n\nInternational  Monetary  Fund.  (2004).  World  Economic  Outlook:  The  Global  Demographic\nTransition Washington. D.C. September.\n\nJacob Pegou Sibe, Cesaire Chiatchoua and Marie Noel Megne (2016) The Long Run Relationship\nbetween  Population  Growth  and  Economic  Growth:  a  Panel  Data  Analysis  of  30  of  the  most\nPopulated Countries of the World. Análisis Económico Núm. 77, vol. XXXI\n\nKim, Jinill (2016). The Effects of Demographic Change on GDP Growth in OECD Economies, IFDP\nNotes. Washington: Board of Governors of the Federal Reserve System, September 28, 2016.\n https://doi.org/10.17016/2573-2129.22\n\nKlasen, Stephan; Lawson, David (2007). The impact of population growth on economic growth\nand  poverty  reduction  in  Uganda,  Diskussionsbeiträge,  No.  133,  Georg-August-Universität\nGöttingen, Volkswirtschaftliches Seminar, Göttingen\n\nMalthus, T.R. (1798). An Essay on the Principle of Population, J. Johnson, London\n\nRomer, D. (2019). Advanced Macroeconomics (5th ed.). New York: McGraw-Hill Education.\n\nRoss-Brewster, Havelock. (1996) Social Capital and Development: Reflections on Barbados and\nJamaica, Barbados Economic Report 1995, Produced for the Ministry of Finance and Economic\nAffairs. May 1996\n\nSavas, B. (2008). The Relationship between Population and Economic Growth: Empirical Evidence\nfrom the Central Asian Economies, Orta Asya ve Kafkasya Arastirmalari, 3(6), 161-183.\n\nTsen, W.H. and Furuoka, F., 2005. The relationship between population and economic growth in\n\n86\n\n\fAsian economies. ASEAN Economic Bulletin, 22(3), pp. 314-330.\n\n Demographic dividend (unfpa.org)\n\n87\n\n\f Appendix 5: Potential Impact OECD Policy (Global minimum tax rate) on ability\n to make Tax/ fiscal Policy:\n\nIn  October  2021,  137  countries  under  the  Organisation  for  Economic  Co-Operation  and\nDevelopment  (OECD)/G20  Inclusive  Framework  for  Base  Erosion  and  Profit  Shifting  Project,\nagreed to a two-pillar strategy to reform the global tax regime, to tackle tax avoidance, improve\nthe coherence of international tax rules, ensure a more transparent tax environment and address\nthe tax challenges arising from digitalization.\n\nUnder  Pillar  two  of  the  reform,  a  global  minimum  tax  rate  of  15  percent  for  multinational\nenterprises (MNEs) will be introduced within countries, which is expected to generate $USD150\nbillion in additional global tax revenue annually. This reform intends to dissuade unproductive/\nineffective tax competition among countries, by instituting a floor corporate tax rate. Although\nthe  long-term  implications  of  this  measure  domestically  is  unknown;  it  is  recognized  that  the\nadoption  of  this  measure,  effectively  removes  the  ability  of  developing  countries  such  as\nBarbados  to  utilize  low  tax  based  incentives  as  part  of  their  toolkit  to  attract  investment  and\ncompete on the global stage. Such measures have traditionally been employed by developing\ncountries,  as  a  means  to  elevate  their  international  competitiveness  in  comparison  to  other\nadvanced  economies  to  attract  investment  and  build  desired  skillsets  domestically,  through\nshared knowledge and experiences as well as infrastructure investment. Moreover, such reforms\nmay  potentially  act  as  a  disincentive  for  established  multinational  enterprises  to  continue\ndomestic  operations,  in  favour  of  other  territories,  with  the  fiscal  space  or  technological\nadvancement to offer non-tax related incentives for investment. Consequently, the adoption of\nthe global minimum tax rate, will likely diminish future foreign investment through MNEs to the\ncountry as well as hinder the expansion of social capital associated with such investment.\n\nForeign  investment  from  MNEs  sources  remain  a  key  driver  of  economic  activity  within  the\ncountry. At present, the majority of such investment is captured through the Finance & Insurance\nand the Business Services sectors, with both industries accounting for 8.8 percent of the share of\nGDP over the period 2008-2017, falling within the top five industries of the economy.\n\nAlthough  Barbados  remains  an  attractive  destination  for  investment  with  a  highly  educated\nworkforce,  sound  infrastructure  (road  network,  telecommunications,  water,  electricity  etc.)  a\nwell-established and regulated financial and banking system, as well as a respected political and\nlegal system, there is a need to adopt a strategic approach to counteract the potential negative\nconsequences related to the introduction of a global minimum tax rate. This will likely include a\ncollection  of  measures  to  enhance  the  business  environment,  improve  the  productivity  and\nsuitability of the workforce and reinvestment in other sectors of economy.\n\n88\n\n\f Appendix 6: Consultations\n\nThe Economic Affairs and Investment Division of the Ministry of Finance, Economic Affairs and\nInvestment  hosted  a  series  of  consultation  meetings  on  behalf  of  the  National  Population\nCommission between August 2020 and April 2023 to i) present and discuss the main findings of\nthe  Population  Situational  Analysis  (PSA)  and  its  implications;  and  ii)  to  present  the  draft\nPopulation Policy for feedback and input.28\n\nTo present PSA, five sessions were held between August 31 to September 3, 2020 at the Lloyd\nErskine Sandiford Centre around the following themed areas:\n\nDay 1   -\nDay 2   -\nDay 3   -\nDay 3   -\nDay 4   -\n\nThematic Area -Health Care\nThematic Area- Environment, Spatial and Infrastructure\nThematic Area – Socio-economic Development Dynamics (a.m.)\nThematic Area – Social Care & Solidarity (p.m.)\nThematic Area – Culture of Belonging\n\nA total of 187 persons attended the sessions via the Zoom platform and the attendance for the\nindividual sessions was as follows:\n\nSession 1\nSession 2\nSession 3\nSession 4\nSession 5\n\nAugust 31\nSeptember 1\nSeptember 2\nSeptember 2\nSeptember 3\n\n14 persons\n48 persons\n45 persons\n46 persons\n34 persons\n\nThe draft Population Policy was presented at a series of public consultations between November\n2022- April 2023, both in person and virtually as follows:\n\n1.  Three technical stakeholder consultations:\n\n  Policy Goal 1 – Maintain Population Size to Sustain Adequate Levels of Social\n\nCare, Productivity and Labour Force Participation for Inclusive and Sustainable\nDevelopment- October 26, 2023\n\n  Policy Goal 2: Provide Barbadians and Non-Nationals in Barbados Now and in the\n\nFuture with Opportunities for Personal Development - October 26, 2023\n\n28 The Population Situational  Analysis  was also informed by a  series of  workshops  from April 15-17, 2019,  which\naddressed five (5) thematic areas: Socio-economic and Labour Force Dimensions of Population Dynamics; Spatial\nDimensions and Environment Considerations; Health Factors and Demographic Changes; Implications of Population\nDynamics on Social Protection and Social Arrangements of Care; Migration\n\n89\n\n\f  Policy Goal 3: Promote Integrated Settlement Development and Safeguard the\n\nEcological Balance- October 27, 2023\n\n2. Online Consultation with Social Partners held on November 18, 2022.\n\n3. Public Consultations:\n\n  Town Hall Meeting at the Alexandra School held on March 20, 2023\n  Town Hall Meeting at the Princess Margaret Secondary School held on March 22,\n\n2023\n\n  Town Hall Meeting at the St. Michael School held on March 23, 2023.\n  Online Polispace initiative held on the Kevzpolitics twitter space on April 12,\n\n2023.\n\nIn addition, the Population Commission also received written comments on the draft Population\nPolicy via social media from the following agencies:\n\n  United Nation Population Fund\n  Ministry of Labour, Social Security and the Third Sector\n  Barbados Chamber of Commerce and Industry\n  Mr. David Yawson, Director of CERMES, UWI\n  Barbados Accreditation Council\n  National Disabilities Unit\n  Barbados Family Planning Association\n  Ministry of Energy and Business (Business Division)\n\n90\n\n"
}