{
  "bill_id": 788,
  "slug": "resolution-re-vesting-in-the-nhc-lands-at-pilgrim-place-christ-church",
  "title": "Resolution re Vesting in the NHC lands at Pilgrim Place, Christ Church",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/a40fe565a36987bebd4fa22249856628.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-07-17",
  "first_reading": "2024-07-16",
  "gazette_date": null,
  "markdown": "2024-05-09\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the  Crown\n\nLands  (Vesting  and  Disposal)  Act,  Cap.  225  approve  the  vesting  in  the  National  Housing\n\nCorporation of a parcel of land, the property of the State situate at Pilgrim Place in the parish of\n\nChrist  Church,  in  this  Island  and  more  particularly  described  in  the  Schedule  for  housing\n\ndevelopment.\n\nAPPROVED by the House of Assembly this                  day of                                                ,\n\nTwo Thousand and Twenty-Four.\n\nSPEAKER\n\nAPPROVED by the Senate this              day of                          , Two\n\nThousand and Twenty-Four.\n\nPRESIDENT\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  situate  at  Pilgrim  Place  in  the  parish  of  Christ  Church\n\nin  this  Island  containing  by  admeasurement  8150.9  square  metres  of  land  (inclusive  of\n\n862.0  square  metres  in  right  of  way) Abutting  and  Bounding  on  lands  now  or  formerly  of\n\nJoseph Brathwaite (Lot 1) on lands now or late of Reuven Best on lands now or formerly of\n\nJonathan Taylor on lands now or late of Vincent Best on lands now or formerly of Clyde Riley\n\non  lands  now  or  late  of  Diven  Chapman  et  al  on  lands  now  or  formerly  of  Lewin  Green  on\n\nlands now or late of Isalene Roach on a right of way 4.88 metres wide on lands now or late of\n\nFavourita Blanchard (Lot 2B) on lands now or formerly of Isalene Roach (Lot 2A) on lands now or\n\nlate  of  Meta  Edgehill  and  on  a  public  road  called  Highway  #7  leading  to  Grantley Adams\n\nInternational Airport in one direction and to Pilgrim Place ‘A’ in the other direction as shown\n\nand  delineated  on  a  plan  certiﬁ ed  on  the  18th  day  of  June,  2014  by  Samuel  N. Taylor,  Land\n\nSurveyor and recorded in the Lands and Surveys Department on the 26th day of June, 2014 as\n\nPlan No. 572/2014.\n\n\f3\n\nADDENDUM\n\n  The Cabinet at its meeting held on the 11th day of January, 2024 considered Note (24)\n\n14/MHLM  03  and  ratiﬁ ed  its  decision  made  at  its  meeting  held  on  the  30th  day  of August,\n\n2007 to vest 8148 square metres of land, the site of the old St. Bartholomew’s Girls School at\n\nPilgrim Place in the parish of Christ Church in the National Housing Corporation for housing\n\ndevelopment.\n\n  Further, the Cabinet at its meeting held on the 11th day of January, 2024 noted that a more\n\nrecent survey of the site measured 8150.9 square metres and agreed to the vesting of 8150.9\n\nsquare metres (2.01 acres) of State lands, the site of the former St. Bartholomew’s Girls School\n\nat Pilgrim Place in the parish of Christ Church in the National Housing Corporation for housing\n\ndevelopment.\n\n  The  site  of  the  former  St.  Bartholomew’s  Girls  School  was  conveyed  by  Deed  of\n\nIndenture made on the 24th day of October, 1939 between The Governors of the Pilgrim Place\n\nSchool of the One Part and the Education Board of Barbados of the Other Part which deed was\n\nentered on the 30th day of November, 1939 and recorded as Deed No. 1395.\n\n  In  accordance  with  the  provisions  of  section  5  of  the  Crown  Lands  (Vesting  and\n\nDisposal) Act, Cap. 225, the approval of Parliament is now sought for the vesting in National\n\nHousing Corporation of the parcel of land described in the Schedule for housing development.\n\n"
}