{
  "bill_id": 789,
  "slug": "health-services-amendment-bill-2025",
  "title": "Health Services (Amendment) Bill, 2025",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/5220fad7dbabac2ad6f454610819bbb3.pdf",
  "current_stage": "The Senate",
  "chamber": "The Senate",
  "notice_date": "2025-01-29",
  "first_reading": "2024-07-09",
  "gazette_date": "2024-07-11",
  "markdown": "2025-01-28\n\nBill as amended\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Health Services Act, Cap. 44 to\n\n(a)\n\n(b)\n\n(c)\n\nmake provision for administrative penalties;\n\nrevise the provisions concerning the removal and sanitary disposal of\noffensive matter; and\n\nprovide for the disposal of dead bodies abandoned at health services\ninstitutions.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\nShort title\n\nAmendment of section 2 of Cap. 44\n\nRepeal and replacement of section 3 of Cap. 44\n\nAmendment of section 10 of Cap. 44\n\nAmendment of section 11A of Cap. 44\n\nRepeal and replacement of section 11B of Cap. 44\n\nAmendment to certain enactments\n\nSCHEDULE\n\nConsequential Amendments\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Health Services Act, Cap. 44 to make provision for the\nimposition of administrative penalties and the removal and sanitary disposal\nof offensive matter.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f4\n\nShort title\n\n1.\n2025.\n\nThis  Act  may  be  cited  as  the  Health  Services  (Amendment)  Act,\n\nAmendment of section 2 of Cap. 44\n\n2.\nto as the principal Act, is amended by\n\nSection 2 of the Health Services Act, Cap. 44, in this Act, referred\n\n(a)\n\ndeleting the definition “district” and substituting the following:\n\n“ “district” means a health district established by the Minister within\n\nan area under section 3;”;\n\n(b)\n\ndeleting the definition “Minister”;\n\n(c)\n\n(d)\n\ndeleting the full stop at the end of the definition “National Assistance\nBoard” and substituting a semi-colon; and\n\ninserting  the  following  definitions  in  the  appropriate  alphabetical\norder:\n\n“  “Chief  Medical  Officer”  means  the  person  assigned  to  the  post  of\nChief  Medical  Officer,  Ministry  of  Health  and  Wellness,  as\nestablished  in  the  Public  Service  (General)  Order,  2020\n(S.I. 2020 No. 41);\n\n“filth”  includes  any  decomposing  animal  matter  and  vegetable\n\nmatter;\n\n“Medical  Health  Officer”  means  the  person  assigned  to  the  post  of\nMedical Officer of Health, Ministry of Health and Wellness, as\nestablished  in  the  Public  Service  (General)  Order,  2020\n(S.I. 2020 No. 41);\n\n“night soil” means human excreta;\n\n\f5\n\n“offensive matter” includes filth, animal excreta and night soil;\n\n“Relief Board” means the Land Taxation Relief Board established by\n\nsection 18 of the Land Tax Act, Cap. 78A . ”.\n\nRepeal and replacement of section 3 of Cap. 44\n\n3.\nthe following:\n\nThe principal Act is amended by deleting section 3 and substituting\n\n“Minister to be responsible for health of inhabitants of\nBarbados and may divide Barbados into areas and districts.\n\n3.(1)\nThe  Minister  shall  generally  be  responsible  for  the\npromotion and preservation of the health of the inhabitants of Barbados.\n\n(2)\n\nThe Minister may by order\n\n(a)\n\n(b)\n\n(c)\n\ndivide Barbados into such areas as he may determine;\n\nestablish such health districts within any area; and\n\nassign duties to such officers in relation thereto as he thinks\nnecessary,\n\nto facilitate the preservation of the health of the inhabitants of Barbados.\n\nThe order made under subsection (2) shall be subject to negative\n\n(3)\nresolution. ”.\n\nAmendment of section 10 of Cap. 44\n\n4.\n\nSection 10(1) of the principal Act is amended by\n\n(a)\n\ndeleting paragraph (u) and substituting the following:\n\n\f6\n\n“(u)\n\nrespecting\n\n(i)\n\nthe interment of the dead;\n\n(ii)\n\nthe entry of dead bodies into Barbados;\n\n(iii)\n\n(iv)\n\nthe use of dead bodies for the teaching of anatomy to\nmedical students and the final disposal of those bodies;\n\nthe inspection of undertaking establishments, morgues,\ncrematoria and other places used in connection with the\npreparation, transportation and disposal of dead bodies;\nand\n\n(v)\n\nthe  disposal  of  dead  bodies  abandoned  at  health\nservices institutions; ”; and\n\n(b)\n\ninserting immediately after paragraph (y) the following paragraph:\n\n“(y.1)\n\nannexing to the contravention of or failure to comply with\nregulations  made  under  section  10(1)(f)  of  the  Health\nServices Act, Cap. 44 an administrative penalty. ”.\n\nAmendment of section 11A of Cap. 44\n\n5.\n(3) and substituting the following:\n\nSection 11A of the principal Act is amended by deleting subsection\n\n“(3)\n\nWhere any\n\n(a)\n\n(b)\n\ncosts incurred in the execution of work on property; or\n\nadministrative penalty imposed, for the contravention of or\nfailure to comply with regulations made under section 10(1)\n(f) of the Health Services Act, Cap. 44,\n\n\f7\n\nis due to the act or omission of the owner of that property it shall be a\ncharge on that property and be added to the land tax imposed under\nsection 5(2) of the Land Tax Act, Cap. 78A.\n\n(4)\n\nWhere any\n\n(a)\n\n(b)\n\ncosts incurred in the execution of work on property; or\n\nadministrative  penalty  imposed,  for  contravention  of  or\nfailure to comply with regulations made under section 10(1)\n(f) of the Health Services Act, Cap. 44,\n\nis added to land tax under subsection (3) it shall be subject to the penalty\nand  interest  payable  under  section  28(3)  of  the  Land  Tax  Act,\nCap. 78A.\n\n(5)\n\nWhere any\n\n(a)\n\n(b)\n\ncosts incurred in the execution of work on property; or\n\nadministrative  penalty  imposed,  for  contravention  of  or\nfailure to comply with regulations made under section 10(1)\n(f) of the Health Services Act, Cap. 44,\n\nis due to the act or omission of an occupier of that property it shall be\na debt to the State recoverable in the Magistrate’s Court for District\nA.\n\nWhere there is a dispute between the owner of property and an\n(6)\noccupier of property in relation to the act or omission which results in\nany\n\n(a)\n\n(b)\n\ncosts incurred in the execution of work on property; or\n\nadministrative  penalty  imposed,  for  contravention  of  or\nfailure to comply with regulations made under section 10(1)\n(f) of the Health Services Act, Cap. 44,\n\nthe Relief Board shall hear and determine the dispute.”.\n\n\f8\n\nRepeal and replacement of section 11B of Cap. 44\n\n6.\nsubstituting the following:\n\nThe  principal  Act  is  amended  by  deleting  section  11B  and\n\n“Appeal\n\n11B.(1)\nThe owner or occupier of any property upon which work is\nexecuted by the Minister may within 42 days after receipt of the demand\nfor repayment of costs incurred in the execution of work under section\n11A, appeal to a Judge in chambers against the costs of any such work.\n\nThe  owner  or  occupier  of  any  property  upon  which  an\n(2)\nadministrative  penalty  is  imposed,  for  contravention  of  or  failure  to\ncomply  with  regulations  made  under  section  10(1)(f)  of  the  Health\nServices Act, Cap. 44 may within 14 days of receipt of an administrative\npenalty notice appeal to the Relief Board. ”.\n\nAmendment to certain enactments\n\n7.\namended in the manner set out opposite thereto in the second column.\n\nThe  enactments  set  out  in  the  first  column  of  the  Schedule  are\n\n\f9\n\n L.R.O. 1998SCHEDULE(Section 7)CONSEQUENTIAL AMENDMENTSColumn 1EnactmentsLand Tax Act, Cap. 78AColumn 2AmendmentsInsert after section 27, the following section: \"Appeals in respect of Health Services (Nuisances)  Regulations  27A.  The Relief Board shall hear and determine  appeals made pursuant to regulations made under  section 10(1)(f) of the Health Services Act, Cap. 44 in accordance with section 10(1)(y.1) of the Health Services Act, Cap. 44.\".\f10\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2025.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2025.\n\nPresident\n\n"
}