{
  "bill_id": 78,
  "slug": "corporate-and-trust-service-providers-act-2015",
  "title": "Corporate and Trust Service Providers Act 2015",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/69914758e4b893b2d3e4c668116b1b13.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-03-11",
  "first_reading": "2015-03-11",
  "second_reading": "2015-03-10",
  "gazette_date": "2015-02-23",
  "passed_date": "2015-03-11",
  "markdown": "Explanatory Memorandum after page 38\n\n2015-01-28\n\nOBJECTS AND REASONS\n\nThis Bill would regulate the providers of certain corporate and trust services.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nApplication of Act\n\nPurpose of Act\n\nFunctions of Director\n\nPART II\n\nLICENSING OF SERVICE PROVIDERS\n\nService provider to be licensed\n\nApplication for licence\n\nIssue of licence\n\nValidity of licence etc.\n\n10.\n\nLost, defaced or destroyed licence\n\n\f3\n\nPART III\n\nDUTIES OF SERVICE PROVIDERS\n\n11.\n\nDisplay of licence\n\n12.\n\nAdvertisements\n\n13.\n\nAgreements\n\n14.\n\nClient property\n\n15.\n\nConflicts of interest\n\n16.\n\nComplaints\n\n17.\n\nBusiness disruption etc.\n\n18.\n\nService provider not to act to detriment of clients or public\n\n19.\n\nService provider to notify Director of change of circumstances\n\n20.\n\nService provider to notify Director of legal and other proceedings\n\n21.\n\nService provider to notify Director of client’s circumstances\n\n22.\n\nService provider to notify Director of surrender, winding up etc.\n\n23.\n\nAccounts and audit\n\n24.\n\nRecords\n\n\f4\n\nPART IV\n\nENFORCEMENT\n\n25.\n\nProvision of information to the Director\n\n26.\n\nExamination of service providers\n\n27.\n\nDirectives\n\n28.\n\nSanctions and other measures in respect of service providers\n\n29.\n\nPecuniary penalty\n\n30.\n\nSuspension and revocation of licence in certain cases\n\n31.\n\nPretending to be a licensee\n\n32.\n\nFalse or misleading information and non-disclosure of material facts\n\nPART V\n\nMISCELLANEOUS\n\n33.\n\nRegisters\n\n34.\n\nConfidentiality\n\n35.\n\nDirector may issue guidelines\n\n36.\n\nMinister may make regulations\n\n37.\n\nFees\n\n38.\n\nExemption\n\n\f5\n\n39.\n\nTransitional provisions\n\n40.\n\nRepeal of Act 2011-5 and consequential amendments\n\n41.\n\nAct binds Crown\n\n42.\n\nCommencement\n\nFIRST SCHEDULE\n\nSPECIFIED ENTITIES AND SERVICES\n\nSECOND SCHEDULE\n\nFEES\n\nTHIRD SCHEDULE\n\nCONSEQUENTIAL AMENDMENTS\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to regulate the providers of certain corporate and trust services.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f8\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\nAct, 2015.\n\nThis Act may be cited as the Corporate and Trust Service Providers\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“affiliate” has, in relation to a company, the meaning assigned to it by section 448\n\nof the Companies Act, Cap. 308;\n\n“articles” has, in relation to\n\n(a)\n\n(b)\n\na  company,  the  meaning  assigned  to  it  by  section  2(1)(a)  of  the\nCompanies Act, Cap. 308; and\n\na society, the meaning assigned to it by section 2(a) of the Societies\nWith Restricted Liability Act, Cap. 318B;\n\n“client” means the recipient of a corporate service or trust service;\n\n“company” has the meaning assigned to it by section 2(1)(b) of the Companies\n\nAct, Cap. 308;\n\n“corporate and trust service provider licence” means a licence which authorises\n\nthe licensee to provide both corporate services and trust services;\n\n“corporate service” means a service described in paragraph 2(1)(a) of the First\n\nSchedule;\n\n“corporate  service  provider  licence”  means  a  licence  which  authorises  the\n\nlicensee to provide a corporate service;\n\n“Director” means the Director of International Business;\n\n\f9\n\n“document” means any record of information and includes\n\n(a)\n\n(b)\n\n(c)\n\nanything on which there is writing;\n\nanything on which there are marks, figures, symbols or perforations\nhaving a meaning for persons qualified to interpret them;\n\nanything from which sounds, images or writing can be reproduced with\nor without the aid of anything else; and\n\n(d)\n\na map, plan, drawing or photograph;\n\n“firm”  has  the  meaning  assigned  to  it  by  section  6  of  the  Partnership  Act,\n\nCap. 313;\n\n“foreign sales corporation” has the meaning assigned to it by section 2(1)(a) of\n\nthe Barbados Foreign Sales Corporation Act, Cap. 59C;\n\n“foundation” has the meaning assigned to it by section 2 of the Foundations Act,\n\n2013 (Act 2013-2);\n\n“international business company” has the meaning assigned to it by section 3 of\n\nthe International Business Companies Act, Cap. 77;\n\n“international  society”  has  the  meaning  assigned  to  it  by  section  2(b)  of  the\n\nSocieties With Restricted Liability Act, Cap. 318B;\n\n“international  trust”  means  a  trust  to  which  the  International  Trusts  Act,\n\nCap. 245 applies by virtue of section 4 of the Act;\n\n“licence” means a licence issued pursuant to section 8;\n\n“licensee” means a person who holds a licence;\n\n“Minister” means the Minister to whom responsibility for international business\n\nis assigned;\n\n“officer” has, in relation to a company, the meaning assigned to it by section 2(1)\n\n(f) of the Companies Act, Cap. 308;\n\n“private trust company” has the meaning assigned to it by section 2 of the Private\n\nTrust Companies Act, 2012 (Act 2012-22);\n\n\f10\n\n“service  provider”  means  a  person  who  engages  in  the  business  of  providing\n\ncorporate services or trust services;\n\n“society” means a society with restricted liability organised pursuant to section 5\nof the Societies With Restricted Liability Act, Cap. 318B but does not include\nan international society;\n\n“specified entity” means an entity listed in paragraph 1 of the First Schedule;\n\n“trust  service”  means  a  service  described  in  paragraph  2(1)(b)  of  the  First\n\nSchedule;\n\n“trust service provider licence” means a licence which authorises the licensee to\n\nprovide a trust service.\n\nApplication of Act\n\n3.\nor trust services for profit.\n\nThis Act applies to service providers who provide corporate services\n\nPurpose of Act\n\n4.\n\nThe purpose of this Act is to\n\n(a)\n\n(b)\n\npromote  and  maintain  high  standards  of  conduct,  ethics  and\ncompetence in the provision of corporate services and trust services;\n\nensure  that  service  providers  adhere  to  international  standards  and\ninternational best practices, including procedures and policies to enable\nthem to\n\n(i)\n\n(ii)\n\nknow  and  be  able  to  identify,  and  verify  the  identity  of,  their\nclients; and\n\nexercise due diligence in the provision of corporate services and\ntrust services; and\n\n(c)\n\nenable the protection the interests of specified entities and of service\nproviders through the licensing and supervision of service providers.\n\n\f11\n\nFunctions of Director\n\n5.(1)\n\nThe Director is responsible for the administration of this Act.\n\nWithout prejudice to the generality of subsection (1), in furtherance of his\n\n(2)\nresponsibility under that subsection, the Director shall\n\n(a)\n\n(b)\n\nmonitor and examine the businesses of service providers to determine\nwhether service providers are in compliance with this Act; and\n\nreceive and investigate any complaints made against service providers\nand take appropriate action in respect of the complaints.\n\nThe Director may require from any suitable person, information or expert\n\n(3)\nadvice, relevant to his functions.\n\nPART II\n\nLICENSING OF SERVICE PROVIDERS\n\nService provider to be licensed\n\n6.(1)\naccordance with a licence issued to him.\n\nNo person shall provide a corporate service or trust service except in\n\nA person who contravenes subsection (1) is guilty of an offence and is\n(2)\nliable on summary conviction to a fine of $50 000 or to imprisonment for 2 years\nor to both and, where the offence is a continuing one, to a further fine of $8 000\nfor every day or part of a day during which the offence continues after a conviction\nis first obtained.\n\nApplication for licence\n\n7.(1)\nDirector for any of the following:\n\nA person may, in such form as the Director determines, apply to the\n\n(a)\n\na corporate service provider licence;\n\n\f12\n\n(b)\n\na trust service provider licence; or\n\n(c)\n\na corporate and trust service provider licence.\n\n(2)\nAn applicant shall submit with his application the prescribed fee and such\ninformation  and  documents  as  the  Director  requires  to  determine  whether  a\nlicence should be issued to him.\n\nIssue of licence\n\n8.(1)\n\nWhere the Director is satisfied that an applicant\n\n(a)\n\n(b)\n\nis a fit and proper person to provide the service in respect of which his\napplication is made;\n\nhas  the  financial  standing  necessary  to  carry  on  the  business  of\nproviding the service;\n\n(c)\n\nis or has a representative who is resident in Barbados; and\n\n(d)\n\nis not a specified entity,\n\nthe Director shall, in such form as the Director determines and upon payment of\nthe prescribed fee, issue a licence to the applicant authorising him to provide the\nservice.\n\n(2)\nWhere the applicant is a firm, society or company, the Director shall not\nconsider the applicant to be a fit and proper person to provide the service in respect\nof  which  the  application  was  made  unless  the  Director  is  satisfied  that  each\npartner, manager, member, director and officer of the firm, society or company\nand  each  person  who,  whether  alone  or  in  association  with  others,  owns  or\ncontrols the firm, society or company, as the case may be, is a fit and proper\nperson to hold the position that he holds or is likely to hold.\n\n(3)\nThe  Director  shall,  in  determining  whether  a  person  is  a  fit  and  proper\nperson  to  provide  a  corporate  service  or  trust  service,  take  into  account  the\nfollowing factors:\n\n(a)\n\nthe educational and professional qualifications of the person;\n\n\f13\n\n(b)\n\n(c)\n\n(d)\n\nwhether the person is a member of a professional association or other\nrelevant body;\n\nthe  knowledge  of  the  person  of  the  legal  and  other  professional\nresponsibilities assumed or likely to be assumed;\n\nthe  procedures  the  person  uses  or  is  likely  to  use  to  determine  the\nsuitability of potential clients;\n\n(f)\n\nwhether the interests of clients will be threatened if the person\n\n(i)\n\nassumes the office that he is likely to hold; or\n\n(ii)\n\ncontinues to hold the office that he currently holds;\n\n(g)\n\nany previous conduct of the person in business or financial matters;\nand\n\n(h)\n\nany evidence that the person has\n\n(i)\n\nengaged in a business practice or conducted himself in a manner\nwhich appears to the Director to\n\n(A)\n\nbe deceitful or oppressive or otherwise improper, whether\nlawful or not;\n\n(B)\n\nreflect discredit on the manner in which he does business; or\n\n(C)\n\ncast doubt on his competence or soundness of judgment;\n\n(ii)\n\ncontravened  any  law  a  purpose  of  which  appears  to  be  the\nprotection  of  persons  against  financial  loss  due  to  dishonesty,\nfraud, incompetence, negligence, malpractice or the conduct of\nbankrupts or otherwise insolvent persons; or\n\n(iii)\n\ncommitted an offence involving violence.\n\nFor  the  purpose  of  this  subsection  (1),  the  following  are  residents  of\n\n(4)\nBarbados:\n\n(a)\n\nan individual ordinarily resident in Barbados; or\n\n\f14\n\n(b)\n\na body incorporated, organised or registered in Barbados, the majority\nof the shares, quotas or other ownership of which is beneficially held\nby persons ordinarily resident in Barbados.\n\n(5)\n\nThe Director may\n\n(a)\n\n(b)\n\nissue a licence subject to such terms or conditions; or\n\nvary or amend a licence in such manner,\n\nas may be necessary to give effect to this Act.\n\nThe Director shall set out in the licence, any terms or conditions imposed\n\n(6)\npursuant to subsection (5).\n\nIt is a condition of a licence that the service provider pay the prescribed\n\n(7)\nannual fee in respect of a year by 31st December of the preceding year.\n\nNotwithstanding subsection (1), the Director may refuse to issue a licence\n\n(8)\nin the public interest.\n\nValidity of licence etc.\n\n9.(1)\n\nA licence remains valid unless suspended, revoked or surrendered.\n\n(2)\n\nA licence is not transferable.\n\nLost, defaced or destroyed licence\n\n10.\nupon payment of the prescribed fee, obtain a replacement.\n\nA service provider whose licence is lost, defaced or destroyed may,\n\nPART III\n\nDUTIES OF SERVICE PROVIDERS\n\nDisplay of licence\n\n11.\nbusiness or registered office in a conspicuous place that is open to the public.\n\nA service provider shall display his licence at his principal place of\n\n\f15\n\nAdvertisements\n\n12.\npublishes or causes to be published\n\nA  service  provider  shall  ensure  that  any  advertisement  that  he\n\n(a)\n\n(b)\n\nis not damaging to the good reputation of Barbados; and\n\ncontains a fair and accurate indication of the service that he provides.\n\nAgreements\n\n13.\nA service provider shall have a written, duly executed agreement with\neach  client  for  the  provision  of  services  and  shall  ensure  that  the  agreement\nprovides for\n\n(a)\n\n(b)\n\n(c)\n\nthe calculation, charging, revision and recovery of fees;\n\nthe payment to the client of interest received on the money of the client;\nand\n\nthe conditions of termination of services and any consequential refund\nof fees.\n\nClient property\n\n14.\n\nA service provider shall\n\n(a)\n\n(b)\n\nclearly designate and be able to identify any money or other assets that\nthe service provider holds for or on behalf of a client as the monies or\nother assets of the client; and\n\nunless the client instructs otherwise in writing, where the monies or\nother assets are held for more than 30 days, keep the monies or other\nassets separate from monies or other assets of the service provider, in\nan account designated as the account of the client.\n\n\f16\n\nConflicts of interest\n\n15.\n\nA service provider shall\n\n(a)\n\ntake reasonable steps to avoid conflicts of interest with and among his\nclients; and\n\n(b)\n\nwhere a conflict of interest arises, as soon as reasonably practicable\n\n(i)\n\ngive the clients concerned written notice of the conflict; and\n\n(ii)\n\nunless each client concerned agrees that the service provider may\ncontinue to provide services to the other clients concerned, cease\nto provide services to all the clients concerned.\n\nComplaints\n\n16.\n\nA service provider shall\n\n(a)\n\nacknowledge,  record  and  investigate  promptly  and  thoroughly,  any\ncomplaint that the service provider receives in respect of his business\nor a client;\n\n(b)\n\ntake appropriate action in respect of the complaint; and\n\n(c)\n\nrecord the action taken.\n\nBusiness disruption etc.\n\n17.(1)\nclients, make adequate arrangements to address business disruption.\n\nA  service  provider  shall,  in  order  to  safeguard  the  interests  of  his\n\nWithout prejudice to the generality of subsection (1), a service provider\n(2)\nshall purchase and maintain a policy of insurance in an amount sufficient to cover\nthe risk of losses in respect of the conduct of his business.\n\nService provider not to act to detriment of clients or public\n\n18.\ndetrimental to the interest of his clients or to the public interest.\n\nA service provider shall not conduct his business in a manner that is\n\n\f17\n\nService provider to notify Director of change of circumstances\n\n19.(1)\nWhere a change referred to in subsection (4) is intended, a service\nprovider shall give the Director written notice of the change at least one month\nprior to the intended date of the change.\n\nNotwithstanding subsection (1), the service provider may give the Director\n\n(2)\nwritten notice of the departure of\n\n(a)\n\n(b)\n\n(c)\n\na partner of a firm;\n\na manager or officer of a society; or\n\na director or officer of a company,\n\nwithin one month after the departure.\n\nWhere the Director receives notice of a change, the Director may require\n(3)\nthe service provider to furnish additional information or documents in respect of\nthe change.\n\nFor the purpose of this section “change” means, in a case where a service\n\n(4)\nprovider is\n\n(a)\n\nan individual, a change in respect of\n\n(i)\n\nthe name under which the individual provides corporate services\nor trust services; or\n\n(ii)\n\nthe address of his principal place of business;\n\n(b)\n\na firm, a change in respect of\n\n(i)\n\nthe name or address of the principal place of business; or\n\n(ii)\n\nthe partners,\n\nof the firm;\n\n(c)\n\na society, a change in respect of\n\n(i)\n\nthe name or address of the registered office;\n\n\f18\n\n(ii)\n\nthe articles;\n\n(iii)\n\nthe ownership of the majority of the quotas;\n\n(iv)\n\nthe beneficial ownership of the majority of the quotas; or\n\n(v)\n\nthe managers or officers,\n\nof the society; or\n\n(d)\n\na company, a change in respect of\n\n(i)\n\nthe name or address of the registered office;\n\n(ii)\n\nthe articles;\n\n(iii)\n\nthe ownership of the majority of the shares;\n\n(iv)\n\nthe beneficial ownership of the majority of the shares; or\n\n(v)\n\nthe directors or officers,\n\nof the company.\n\nService provider to notify Director of legal and other proceedings\n\n20.\nreasonably practicable where\n\nA service provider shall give the Director written notice as soon as\n\n(a)\n\n(b)\n\na judgment in civil proceedings is given against the service provider;\n\nthe service provider or a partner, manager, member, director, officer\nor employee of the service provider or a person who, whether alone or\nin  association  with  others,  owns  or  controls  the  service  provider,  is\ncharged  with  or  convicted  of  an  offence  under  a  law  referred  to  in\nsection 8(3)(h)(ii) or an offence which involves\n\n(i)\n\n(ii)\n\nthe position he holds in respect of a business;\n\nthe formation, management or administration of a firm or body\ncorporate; or\n\n(iii)\n\nviolence;\n\n\f19\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\na summons, warrant or other order of court is issued or made in respect\nof the service provider or an employee, member, manager, director or\nofficer of the service provider or a person who, whether alone or in\nassociation with others, owns or controls the service provider pursuant\nto the Money Laundering and Financing of Terrorism (Prevention and\nControl) Act, 2011 (Act 2011-23), the Prevention of Corruption Act,\n2012 (Act 2012-31), the Transnational Organized Crime (Prevention\nand Control) Act, 2011 (Act 2011-3), the Drug Abuse (Prevention and\nControl) Act, Cap. 131 or the Anti-Terrorism Act, Cap. 158;\n\nan inquiry into the affairs of the service provider is initiated, in writing,\nby an authority of any government or by a professional association or\nother relevant body of which the service provider is a member;\n\nthe  service  provider  is  refused  legal  authorisation  in  respect  of  any\nbusiness or such authorisation is suspended or revoked; or\n\nlegal  proceedings  are  initiated  to  disqualify  a  director,  manager,\nsecretary or other officer of the service provider from holding office\nas a director, manager, secretary or other officer of a body corporate.\n\nService provider to notify Director of client’s circumstances\n\n21.(1)\n\nA service provider shall\n\n(a)\n\ngive the Director written notice as soon as reasonably practicable where\ncriminal  proceedings  are  instituted  against  a  client  or  a  director  or\nofficer of a client or any person who, whether alone or in association\nwith others, ultimately owns or controls the client, or such a person is\nconvicted of an offence; and\n\n(b)\n\nprovide a brief summary of the case.\n\nA service provider shall give the Director written notice within one week\n\n(2)\nafter a person ceases to be a client of the service provider.\n\n\f20\n\nService provider to notify Director of surrender, winding up etc.\n\n22.(1)\nA service provider who desires to surrender his licence shall do so by\nwritten notice to the Director at least one month prior to the intended date of\nsurrender.\n\nThe service provider shall state in the notice referred to in subsection (1),\n(2)\nthe date on which the surrender takes effect, and from that date, shall cease to\ncarry on the business of providing the service in respect of which the licence was\nissued.\n\nA service provider who is unable to continue to carry on business or in\n\n(3)\nrespect of whom\n\n(a)\n\n(b)\n\n(c)\n\naction is initiated for dissolution or winding up;\n\na receiver, a liquidator or an administrator is appointed; or\n\na composition or an arrangement is made with the creditors,\n\nshall give written notice to the Director as soon as reasonably practicable.\n\nA service provider shall, in any case referred to in subsection (1) or (3),\n\n(4)\nwhere practicable\n\n(a)\n\n(b)\n\narrange for the orderly winding up or transfer of his business; and\n\nsubmit with the notice to the Director, details of the arrangement made.\n\nA service provider who ceases to provide services to a client shall as soon\n\n(5)\nas reasonably practicable\n\n(a)\n\n(b)\n\n(c)\n\ngive the client written notice of the fact, unless the service provider so\nceased at the request of the client;\n\npreserve the records of the client until the records are transferred to a\nsuccessor of the service provider or to the client; and\n\ncooperate  with  the  client  and  any  successor  to  ensure  a  smooth\ntransition of the business of the client.\n\n\f21\n\nAccounts and audit\n\n23.(1)\ndeclare annually his gross revenue and assets.\n\nA  service  provider  shall,  in  such  form  as  the  Director  determines,\n\n(2)\nA  service  provider  whose  gross  revenue  or  assets  exceed  the  amount\nreferred to in section 152(1)(b) of the Companies Act, Cap. 308 for the period\nreferred to in relation to that amount shall\n\n(a)\n\n(b)\n\nhave the accounts of his business audited annually and at such other\ntimes  as  the  Director  may  require,  by  a  person  who  qualifies  under\nsection  153  of  the  Companies  Act,  Cap.  308  for  appointment  as  an\nauditor of a company; and\n\nsubmit to the Director, within 4 months of the end of the financial year,\nor within such longer period as the Director may permit, a statement\nof the audited accounts.\n\nRecords\n\nA service provider shall keep, in addition to the records required to be\n24.(1)\nkept pursuant to the Money Laundering and Financing of Terrorism (Prevention\nand Control) Act, 2011 (Act 2011-23), such other records as may be necessary\nto establish the financial position of the service provider and his compliance with\nthis Act and the Money Laundering and Financing of Terrorism (Prevention and\nControl) Act, 2011 (Act 2011-23).\n\nThe service provider shall retain a record kept pursuant to subsection (1)\n\n(2)\nfor at least 6 years from the date of the making of the record.\n\n\f22\n\nPART IV\n\nENFORCEMENT\n\nProvision of information to the Director\n\n25.\nshall provide the Director, at such times as the Director may require, with\n\nWithout prejudice to any other provision of this Act, a service provider\n\n(a)\n\n(b)\n\nany  of  the  books,  records  or  other  documents  kept  by  the  service\nprovider in respect of his business; and\n\nsuch  other  information  as  the  Director  may  require  for  the  proper\nadministration  and  enforcement  of  this  Act  and,  in  particular,  to\ndetermine whether the service provider\n\n(i)\n\n(ii)\n\ncontinues to satisfy the requirements of this Act for the issue of a\nlicence; and\n\nis in compliance with the obligations of the service provider under\nthe Money Laundering and Financing of Terrorism (Prevention\nand Control) Act, 2011 (Act 2011-23).\n\nExamination of service providers\n\n26.(1)\nThe Director may examine or, by instrument in writing, appoint, at\nthe expense of a service provider, a person to examine, the books, records and\nother documents kept by the service provider in respect of his business and any\nother matter in respect of the business of the service provider\n\n(a)\n\nto ascertain whether the service provider is in compliance with this Act\nor the Money Laundering and Financing of Terrorism (Prevention and\nControl) Act, 2011 (Act 2011-23); or\n\n(b)\n\nwhere the Director is of the view that\n\n(i)\n\nthe service provider may be in contravention of this Act or the\nMoney Laundering and Financing of Terrorism (Prevention and\nControl) Act, 2011 (Act 2011-23); or\n\n\f23\n\n(ii)\n\nthe  proper\nis  otherwise  necessary\nan  examination\nadministration  and  enforcement  of  this  Act  or  the  Money\nLaundering and Financing of Terrorism (Prevention and Control)\nAct, 2011 (Act 2011-23).\n\nfor\n\nThe  Director  or  a  person  appointed  by  the  Director  pursuant  to\n(2)\nsubsection  (1)  may,  in  connection  with  an  examination,  require  an  auditor,\ndirector,  officer,  employee  or  affiliate  of  a  service  provider  or  a  person  who,\nwhether alone or in association with others, owns or controls the service provider,\nto\n\n(a)\n\n(b)\n\nfurnish such information as the Director or the person may consider\nnecessary for the purpose of the examination; and\n\nproduce  for  examination  any  books,  records  or  other  documents  in\nrespect of the business of the service provider that are in his possession\nand contain or are likely to contain any such information.\n\nThe Director may impose on a service provider such charges as may be\n\n(3)\nprescribed to meet the expenses relating to the examination.\n\nAn auditor, director, officer, employee or affiliate of a service provider\n(4)\nwho is required to make a disclosure to the Director or to a person appointed by\nthe  Director  pursuant  to  subsection  (1),  shall  not,  by  reason  of  making  the\ndisclosure, be regarded as being in breach of a duty to the service provider.\n\nDirectives\n\n27.\nThe Director may give directives to a service provider to ensure that\nthe service provider complies with the Act; and the service provider shall comply\nwith the directives.\n\n\f24\n\nSanctions and other measures in respect of service providers\n\n28.(1)\nthe Director is satisfied as to any of the following circumstances:\n\nThe Director may take any action specified in subsection (2) where\n\n(a)\n\nthe service provider\n\n(i)\n\nobtained his licence by the concealment or misrepresentation of\nany  fact  that  the  Director  considers  to  be  material  to  the\napplication or the suitability of the service provider for the issue\nof a licence;\n\n(ii)\n\nis contravening or has contravened\n\n(A)\n\nthis Act; or\n\n(B)\n\na term or condition of his licence;\n\n(iii)\n\nfailed to comply with a request of the Director;\n\n(iv)\n\nis contravening or has contravened the Money Laundering and\nFinancing  of  Terrorism  (Prevention  and  Control)  Act,  2011\n(Act 2011-23);\n\n(v)\n\nis charged with or convicted of an offence under a law referred\nto in section 8(3)(h)(ii) or an offence which involves\n\n(A)\n\nthe position he holds in respect of a business;\n\n(B)\n\nthe formation, management or administration of a firm or\nbody corporate; or\n\n(C)\n\nviolence;\n\n(vi)\n\nis otherwise carrying on his business in an imprudent or unlawful\nmanner; or\n\n(vii)\n\nin any other circumstances, no longer satisfies the requirements\nof this Act for the issue of a licence; or\n\n(b)\n\nrevocation of the licence of the service provider is in the public interest.\n\n\f25\n\n(2)\nWhere the Director is satisfied as to any of the circumstances set out in\nsubsection (1) in respect of a service provider, the Director may, as the Director\nconsiders appropriate\n\n(a)\n\n(b)\n\nwarn or reprimand the service provider;\n\ngive such directives to the service provider as the Director considers\nappropriate in the circumstances, including a directive\n\n(i)\n\n(ii)\n\n(iii)\n\nrequiring the service provider, within such period as the Director\nmay  specify,  to  take  such  remedial  measures  or  action  as  the\nDirector may specify;\n\nrequiring the service provider, within such period as the Director\nmay specify, to cease engaging in such activity or behaviour as\nthe Director may specify;\n\nlimiting,  within  such  period  as  the  Director  may  specify,  any\nactivities,  functions  or  operations  of  the  service  provider  in\nrelation to his business;\n\n(c)\n\nin  accordance  with  section  29,  impose  on  the  service  provider,  a\npecuniary penalty; or\n\n(d)\n\nsuspend or revoke the licence of the service provider.\n\nSubject to section 30, the Director shall not undertake any action specified\n(3)\nin sub-paragraph (iii) of paragraph (b) or paragraph (c) or (d) of subsection (2)\nwithout first giving the service provider\n\n(a)\n\n(b)\n\nwritten notice of the action that the Director intends to take; and\n\nan opportunity to make representations as to why the action should not\nbe taken.\n\nIn this section “misconduct” includes any act or omission relating to the\n(4)\nconduct of the business which is or is likely to be prejudicial to the public interest\nor the good reputation of Barbados.\n\n\f26\n\n(5)\nA service provider who is aggrieved by a decision of the Director under\nthis section or section 29 or 30 may appeal to a Judge in Chambers against the\ndecision.\n\nPecuniary penalty\n\nWhere the Director is satisfied as to any of the circumstances set out\n29.(1)\nin section 28(1) in respect of a service provider, the Director may impose on the\nservice provider, a penalty of $5 000.\n\nWhere, under this Act, a service provider is required, by a specified time,\n\n(2)\nto\n\n(a)\n\n(b)\n\ntake a certain measure or action; or\n\ncease a particular activity or behaviour,\n\nand  the  Director  is  satisfied  that  the  service  provider  has  failed  to  do  so,  the\nDirector may impose on the service provider, in addition to the penalty specified\nin subsection (1), an additional penalty of $500 for every day or part of a day that\nthe service provider failed to take the measure or action or to cease the particular\nactivity or behaviour.\n\n(3)\n\nThe penalty referred to in subsection (2)\n\n(a)\n\nmay be imposed from the day following the day by which the service\nprovider was supposed to have taken the measure or action or to have\nceased the particular activity or behaviour; and\n\n(b)\n\nshall not be imposed in respect of a period of more than 30 days.\n\n(4)\n\nNotwithstanding subsection (3), where the service provider\n\n(a)\n\n(b)\n\ntakes the measure or action; or\n\nceases the particular activity or behaviour,\n\nthe penalty referred to in subsection (2) shall cease to be imposed on the day\npreceding the day on which the service provider took the measure or action or\nceased the particular activity or behaviour.\n\n\f27\n\nSuspension and revocation of licence in certain cases\n\n30.(1)\n\nNotwithstanding section 28(3), the Director may\n\n(a)\n\nsuspend the licence of a service provider\n\n(i)\n\nwith immediate effect, for a period not exceeding 30 days, where\nthe Director considers that the immediate suspension of the licence\nis in the public interest or that any delay in suspending the licence\nmay be prejudicial to the public interest or the good reputation of\nBarbados;\n\n(ii)\n\nfrom the date of the institution of criminal proceedings against the\nservice provider for an offence referred to in section 28(1) or at\nany time thereafter; or\n\n(b)\n\nrevoke the licence of a service provider, upon conviction of the service\nprovider for an offence referred to in section 28(1).\n\nWhere the Director suspends the licence of a service provider in connection\n(2)\nwith an offence, the suspension shall automatically cease upon the withdrawal\nor  dismissal  of  the  charge  or,  where  there  is  more  than  one  charge,  upon  the\nwithdrawal or dismissal of all the charges.\n\nPretending to be a licensee\n\n31.(1)\nA person who, not being a licensee, knowingly holds himself out as a\nlicensee or otherwise as a person carrying on the business of providing corporate\nservices  or  trust  services  is  guilty  of  an  offence  and  is  liable  on  summary\nconviction to a fine of $50 000 or to imprisonment for 2 years or to both.\n\nIn  criminal  proceedings  pursuant  to  section  6  and  subsection  (1),  the\n(2)\nabsence of the name of the person charged from a list of licensees in any register\nto be kept pursuant to section 33 is prima facie evidence that the person is not a\nlicensee.\n\n\f28\n\nFalse or misleading information and non-disclosure of material facts\n\n32.\nor any other matter governed by this Act, knowingly or recklessly\n\nA person who, in respect of an application for the issue of a licence\n\n(a)\n\n(b)\n\n(c)\n\nmakes a false statement of a material fact;\n\nomits to state a material fact; or\n\nmakes a statement that contains information that is misleading in light\nof the circumstances in which it is made,\n\nis guilty of an offence and is liable on summary conviction to a fine of $25 000\nor to imprisonment for one year or to both.\n\nPART V\n\nMISCELLANEOUS\n\nRegisters\n\n33.(1)\n\nThe Director shall cause to be kept\n\n(a)\n\n(b)\n\n(c)\n\na register of the corporate service provider licences;\n\na register of the trust service provider licences; and\n\na register of the corporate and trust service provider licences,\n\nissued pursuant to this Act.\n\n(2)\n\nThe Director shall cause to be recorded in each register\n\n(a)\n\n(b)\n\nthe name of each licensee;\n\nthe address of the registered office or principal place of business of the\nlicensee;\n\n(c)\n\nthe date on which his licence is issued;\n\n(d)\n\nany refusal to issue a licence;\n\n\f29\n\n(e)\n\nany suspension, revocation or surrender of a licence; and\n\n(f)\n\nsuch other information as the Director considers appropriate.\n\n(3)\n\nThe registers shall be open to public inspection.\n\nConfidentiality\n\nSubject to subsection (3), no person shall disclose any information\n34.(1)\nrelating to an application for a licence or to the affairs of a licensee, other than\nso far as such information forms part of a register referred to in section 33 or of\nthe  public  record  in  the  possession  of  the  Registrar  of  Corporate  Affairs  and\nIntellectual  Property  or  is  otherwise  available  to  the  public,  except  where\nauthorised by the applicant or the licensee or where lawfully required by a court\nof competent jurisdiction to do so.\n\nA person who contravenes this section commits an offence and is liable on\n(2)\nsummary conviction to a fine of $10 000 or imprisonment for a term of 2 years\nor to both.\n\nSubsections (1) and (2) do not apply to any person carrying out any duty\n(3)\nimposed  on  him  by  the  Money  Laundering  and  Financing  of  Terrorism\n(Prevention  and  Control)  Act,  2011  (Act  2011-23),  the  Income  Tax  Act,\nCap.  73  or  any  other  enactment  or  otherwise  acting  in  pursuance  of  an\ninternational agreement to which Barbados is a party.\n\nDirector may issue guidelines\n\n35.(1)\nThe Director may issue guidelines in respect of the standards to be\nobserved and measures to be implemented by a service provider in connection\nwith his obligations under this Act; and the service provider shall comply with\nthe guidelines.\n\nThe  Director  shall  make  the  guidelines  and  any  amendments  thereto\n(2)\navailable  for  inspection  by  the  public,  whether  by  electronic  publication  or\notherwise.\n\n\f30\n\nThe Director shall, at such intervals as the Director determines, review the\n\n(3)\nguidelines.\n\nThe  guidelines  and  any  amendments  thereto  shall  be  published  in  the\n\n(4)\nOfficial Gazette.\n\nMinister may make regulations\n\n36.\nfor prescribing anything required by this Act to be prescribed.\n\nThe Minister may make regulations for giving effect to this Act and\n\nFees\n\n37.(1)\nin respect of the matters set out opposite thereto in the second column.\n\nThe fees set out in the first column of the Second Schedule are payable\n\n(2)\n\nThe Minister may, by Order, amend the Second Schedule.\n\nExemption\n\nNotwithstanding anything to the contrary in this Act and subject to\n38.(1)\nsubsections (2) and (3), a company or society that holds a licence issued pursuant\nto\n\n(a)\n\n(b)\n\nthe Financial Institutions Act, Cap. 324A; or\n\nthe International Financial Services Act, Cap. 325,\n\nand provides a corporate service or trust service is exempt from the application\nof this Act, except for sections 12 to 18, 20 and 21.\n\nWhere in respect of a company or society referred to in subsection (1), the\n(2)\nperson who issued a licence to the company or society pursuant to an Act referred\nto in that subsection is satisfied that the company or society is contravening or\nhas contravened any of the sections referred to in that subsection, the person shall\nhave in relation to the contravention of the company or society, the powers set\nout in section 28(2)(a), (b) and (c).\n\n\f31\n\n(3)\nFor  the  avoidance  of  doubt,  where  a  company  or  society  referred  to  in\nsubsection (1) establishes or uses a subsidiary to provide a corporate service or\ntrust service, this Act shall apply to the subsidiary.\n\nTransitional provisions\n\nNotwithstanding anything to the contrary in this Act, a person who\n39.(1)\nimmediately before the commencement of this Act was engaged in the business\nof  providing  corporate  services  or  trust  services  for  profit  may,  subject  to\nsubsection (2), continue to provide such services after the commencement of this\nAct as if the person were a licensee.\n\nSubsection (1) shall cease to be in effect 6 months from the commencement\n\n(2)\nof this Act.\n\nRepeal of Act 2011-5 and consequential amendments\n\n40.(1)\n(Act 2011-5) is repealed.\n\nThe International Corporate and Trust Service Providers Act, 2011\n\nThe  enactments  set  out  in  the  first  column  of  the  Third  Schedule  are\n\n(2)\namended in the manner set out opposite thereto in the second column.\n\nAct binds Crown\n\n41.\n\nThis Act binds the Crown.\n\nCommencement\n\n42.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  day  to  be  fixed  by\n\n\f32\n\nFIRST SCHEDULE\n\nSPECIFIED ENTITIES AND SERVICES\n\n(Section 2)\n\nSpecified entities\n\n1.(1)\n\nThe following entities are specified entities for the purpose of this Act:\n\n(a)\n\n(b)\n\n(c)\n\nan international business company;\n\nan international society;\n\nan international trust;\n\n(d)\n\na foreign sales corporation;\n\n(e)\n\na foundation;\n\n(f)\n\na private trust company; and\n\n(g)\n\nany other entity which\n\n(i)\n\nconducts international business; and\n\n(ii)\n\nhas  obtained  specific  permission  from  the  Exchange  Control\nAuthority to deal in foreign currency.\n\nFor the purpose of sub-paragraph (1)(g) “international business” has the\n(2)\nmeaning  assigned  to  it  by  section  2  of  the  International  Business  Companies\nAct, Cap. 77.\n\nCorporate and trust services\n\n2.(1)\n\nThe services listed in sub-paragraph (2) shall be treated as\n\n(a)\n\n(b)\n\ncorporate services, where provided to a specified entity other than an\ninternational trust or a private trust company; and\n\ntrust services, where provided to an international trust or a private trust\ncompany.\n\n\f(2)\n\nThe services referred to in sub-paragraph (1) are:\n\n33\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nacting as agent for the formation, registration or licensing of a specified\nentity;\n\nproviding the services of a registered office or otherwise acting as a\nperson authorized to accept service or correspondence for the specified\nentity;\n\nfiling statutory forms, resolutions, returns and notices on behalf of the\nspecified entity;\n\nacting as, or fulfilling the function of, or arranging for another person\nto act as or fulfil the function of, an officer, a director or a secretary,\nalternate, assistant or deputy secretary, of the specified entity or in a\nsimilar relationship to the specified entity;\n\n(e)\n\nacting as a shareholder or a quota holder of the specified entity;\n\n(f)\n\nproviding  other  services  involving  the  control  of  the  whole  or  a\nsubstantial part of the assets of the specified entity.\n\nNotwithstanding sub-paragraph (2) and section 6, an individual does not\n(3)\nrequire a licence to act as, or fulfil the function of, a director of a specified entity.\n\n\f34\n\nSECOND SCHEDULE\n\nFEES\n\n(Section 37)\n\nMatters for which Fees are Payable\n\nApplication for a licence\n\nCorporate service provider licence\n\nTrust service provider licence\n\nCorporate and trust service provider licence\n\nAnnual licence fee\n\nAmount to be\nPaid\n\n$\n\n250.00\n\n2 500.00\n\n2 500.00\n\n2 500.00\n\n2 500.00\n\nReplacement of lost, defaced or destroyed licence\n\n100.00\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n\f35\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosTHIRD SCHEDULE(Section 40)CONSEQUENTIAL  AMENDMENTSColumn 1Enactments1. International Business Companies Act, Cap. 77. Column 2Amendments1. In section 3(1),   (a) delete the definition of \"international   service provider\";  (b) in the deﬁ nition of \"securities\", substitute the full stop with a semi-colon; and   (c) insert in alphabetical order, the following   deﬁ nition:      \" \"service provider\" has the meaning  assigned to it by section 2 of the Corpo-rate and Trust Service Providers Act, 2014 (Act 2014-  );\".  2. In section 7(3), delete the words \"an international\" and substitute the word \"a\".3. In section 25(3), insert after the word \"by\", the words \"the Corporate and Trust Service Providers Act, 2014 (Act 2014-  ),\".  4. Delete section 26(2) and substitute the following:  \"(2) Subsection (1) does not apply to a licensee which is not required to comply with section 22(1A).\".        \f36\n\n L.R.O. 1998    Column 2Amendments 1. In section 2, delete the definition of\"international service provider\"and insert in alphabetical order, the following deﬁ nition: \" \"service provider\" has the meaning  assigned to it by section 2 of the  Corporate and Trust Service Providers Act, 2014 (Act 2014-  );\".  2. In section 40(2), delete the words \"an international\" and substitute the word \"a\".3. In section 49(3), insert after the word \"by\", the words \"the Corporate and Trust Service Providers Act (Act 2014-  ),\".In the Third Schedule, in  (a)  Part I, delete paragraph (n) and substitute the following: \"(n) a service provider licensed under the Corporate and Trust Service Providers Act, 2014 (Act 2014-  ), the Corporate and Trust Service Providers Act, 2014.\";and(b)  Part II, delete paragraph (k) and substitute the  following: \"(k) a service provider licensed under the Corporate and Trust Service Providers Act, 2014 (Act 2014- ), the Director of International Business.\".Column 1Enactments2.   Societies With Restricted Liability Act, Cap. 318B.3. Money Laundering and  Financing of Terrorism  (Prevention and Control)  Act, 2011 (Act 2011-23).THIRD  SCHEDULE -  (Cont'd)CONSEQUENTIAL  AMENDMENTS - (Cont'd)\f37\n\nTHE LAWS OF BARBADOSPrinted by the Government Printer, Bay Street, St. Michaelby the authority of the Government of BarbadosColumn 2Amendments In section 2, in the definition of \"Registered Agent\", delete paragraph (b) and substitute the following:\"(b) a person licensed under the Corporate and Trust Service Providers Act, 2014 (Act 2014-  );\".In section 5(4), delete paragraph (c) andsubstitute the following:\"(c) a person licensed under the Corporate and Trust Service Providers Act, 2014 (Act 2014-  ); and\".Column 1Enactments4.  Private Trust   Companies Act, 2012 (Act 2012-22).5.  Foundations Act,  2013THIRD  SCHEDULE -  (Concl'd)CONSEQUENTIAL  AMENDMENTS - (Concl'd)\f38\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2015.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2015.\n\nPresident\n\n\fEXPLANATORY MEMORANDUM\n\nThe  Corporate  and  Trust  Service  Providers  Bill,  2014  would  regulate  the\n\nproviders of certain corporate and trust services.\n\nPART I - PRELIMINARY\n\nClause 1:\n\nprovides the short title.\n\nClause 2:\n\ndefines the terms used in the legislation, including the concept\nof corporate and trust services, which are more particularly\ndescribed in the First Schedule.\n\nClause 3:\n\nstipulates that the legislation applies to persons who provide\ncorporate and trust services for profit.\n\nClause 4:\n\nstates the legislation’s objectives.\n\nClause 5:\n\nClause 6:\n\nprovides  for  the  Director  of  International  Business  to  be\nresponsible for the administration of the legislation and sets\nout the functions of the Director.\n\nPART II - LICENSING OF SERVICE PROVIDERS\n\nprohibits a person who provides a corporate or trust service\nfrom  doing  so  without  a  licence.  Contravention  of  this\nprovision would be an offence.\n\nClause 7:\n\nsets out the procedure to apply for a licence and the types of\nlicence available.\n\nClause 8:\n\nsets out the criteria to be satisfied to obtain a licence.\n\nClause 9:\n\nprovides,  among  other  things,  for  licences  to  remain  valid\nindefinitely unless suspended, revoked or surrendered.\n\ni\n\n\fClause 10:\n\naddresses lost, defaced and destroyed licences.\n\nPART III - DUTIES OF SERVICE PROVIDERS\n\nClause 11:\n\nrequires a service provider to display his licence at his place\nof business.\n\nClause 12:\n\ngoverns advertisements by a service provider.\n\nClause 13:\n\nrequires a service provider to have a written agreement with\nhis clients.\n\nClause 14:\n\nprovides for the management of a client’s property.\n\nClause 15:\n\naddresses conflicts of interest.\n\nClause 16:\n\nClause 17:\n\nClause 18:\n\nClause 19:\n\nClause 20:\n\nspeaks to the manner in which a service provider must deal\nwith complaints.\n\nrequires a service provider to have insurance and generally to\nmake provision for business disruption.\n\nprohibits a service provider from acting to the detriment of his\nclient’s interest or the public interest.\n\nprovides for a service provider to notify the Director of certain\nmaterial  changes,  for  example,  in  the  case  of  a  company,\nwhere there are new directors.\n\nimposes a duty on a service provider to notify the Director of\nthe  occurrence  of  certain  events,  for  example,  where  the\nservice provider or an employee or a director of the service\nprovider  is  convicted  of  certain  offences  or  a  director  is\ndisqualified from holding such an office.\n\nClause 21:\n\nrequires a service provider to notify the Director where a client\nof the service provider is charged or convicted of an offence.\n\nii\n\n\fClause 22:\n\nmandates a service provider to notify the Director where he\nwishes  to  surrender  his  licence  or  is  unable  to  carry  on\nbusiness.\n\nClause 23:\n\nrequires  a  service  provider  to  have  his  accounts  audited  in\ncertain cases.\n\nClause 24:\n\nprovides for the keeping of records.\n\nPART IV - ENFORCEMENT\n\nClause 25:\n\nClause 26:\n\nClause 27:\n\nClause 28:\n\nClause 29:\n\nClause 30:\n\nClause 31:\n\nprovides for a service provider to deliver to the Director such\nrecords  or  information  as  the  Director  may  require  for  the\nproper administration and enforcement of the legislation.\n\nempowers  the  Director  to  conduct  an  examination  of  the\nrecords and affairs of a service provider.\n\nempowers  the  Director  to  issue  directives  to  a  service\nprovider.\n\nstipulates  the  measures  that  can  be  taken  against  a  service\nprovider  in  respect  of  breaches  of  the  legislation  or  other\nundesirable behaviour.\n\nmakes  specific  provision  for  the  imposition  of  pecuniary\npenalties on a service provider.\n\naddresses the suspension or revocation of a licence where a\nservice provider is the subject of criminal proceedings.\n\nmakes  it  an  offence  to  pretend  to  be  licensed  as  a  service\nprovider.\n\niii\n\n\fClause 32:\n\nmakes it an offence to submit false or misleading information\nin respect of an application for a licence or as regards any other\nmatter governed by the legislation.\n\nClause 33:\n\nClause 34:\n\nClause 35:\n\nClause 36:\n\nClause 37:\n\nClause 38:\n\nClause 39:\n\nClause 40:\n\nPART V - MISCELLANEOUS\n\nprovides for the Director to maintain registers of the licences\nissued.\n\nspeaks to the confidential treatment of information regarding\napplications for a licence and the affairs of service providers.\n\nempowers the Director to make guidelines in respect of the\nstandards to be observed and measures to be implemented by\na service provider.\n\nempowers the Minister to make regulations to give effect to\nthe legislation.\n\nprovides for the fees to be paid for a licence and for related\nmatters. These are set out in the Second Schedule.\n\nexempts  from  the  application  of  the  legislation,  except  for\ncertain  provisions,  persons  licensed  under  the  Financial\nInstitutions  Act,  Cap.  324A  or  the  International  Financial\nServices Act, Cap. 325.\n\nmakes transitional provision with respect to persons currently\nproviding corporate and trust services. Such persons would be\ngiven a period of 6 months from the commencement date to\ncomply with the legislation.\n\nrepeals  the  International  Corporate  and  Trust  Service\nProviders  Act,  2011  (Act  2011-5)  and  provides  for\nconsequential  changes  to  be  made  to  several  pieces  of\nlegislation. These are set out in the Third Schedule.\n\niv\n\n\fClause 41:\n\nprovides for the legislation to bind the Crown.\n\nClause 42:\n\nprovides for the coming into operation of the legislation.\n\nv\n\n"
}