{
  "bill_id": 790,
  "slug": "criminal-justice-plea-negotiations-and-agreements-bill-2024",
  "title": "Criminal Justice (Plea Negotiations and Agreements) Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3efc848ec778327f289dc4e01270f69a.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-07-30",
  "first_reading": "2024-07-31",
  "gazette_date": "2024-07-11",
  "markdown": "2024-06-24\n\nOBJECTS AND REASONS\n\nThis Bill would provide for plea negotiations and plea agreements between the\n\naccused and prosecutor in criminal cases and for related matters.\n\n\f2\n\nArrangement of Sections\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nApplication\n\nDeclaration of certain existing rights\n\nPlea negotiations\n\nNo obligation on State to enter into plea negotiations\n\nPowers of Director of Public Prosecutions\n\nLegal representation\n\nPlea agreements\n\n10.\n\nForm and filing of plea agreement with a represented person\n\n11.\n\nForm and filing of plea agreement with unrepresented person\n\n12.\n\nListing matters for plea agreement hearing\n\n13.\n\nPlea agreements at committal proceedings\n\n14.\n\nDirector of Public Prosecutions to prefer indictments\n\n15.\n\nVictim impact statement\n\n\f3\n\n16.\n\nRestriction on the content of a victim impact statement\n\n17.\n\nDuties of the prosecutor in respect of victim impact statements\n\n18.\n\nDirector of Public Prosecutions to notify Court of existence of plea\nagreement\n\n19.\n\nProcedure at plea agreement hearing\n\n20.\n\nPlea Agreement not binding on the Court\n\n21.\n\nCases to be heard by a different Judge where agreement is refused or\nwithdrawn\n\n22.\n\nAccused right to appeal rejection of plea agreement\n\n23.\n\nDirector of Public Prosecutions right to appeal rejection of plea agreement\n\n24.\n\nEffect of accepting plea agreement\n\n25.\n\nAccepted plea agreement to form part of record\n\n26.\n\nSentencing where plea agreement accepted\n\n27.\n\nPost sentence negotiations and agreements\n\n28.\n\nReview of sentence of convicted person\n\n29.\n\nPower to reduce penalties for assistance rendered to the State\n\n30.\n\nWithdrawal from agreement\n\n31.\n\nApplication by Prosecutor to set aside plea agreement\n\n32.\n\nAdmissibility of plea agreement, etc.\n\n\f4\n\n33.\n\nSealing of records plea negotiations\n\n34.\n\nObligation for secrecy\n\n35.\n\nAmendment of Schedule\n\nSCHEDULE\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for plea negotiations and plea agreements in criminal\n\ncases and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\nAgreements) Act, 2024.\n\nThis Act may be cited as the Criminal Justice (Plea Negotiations and\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Court” includes the Magistrate’s Court;\n\n“Director  of  Public  Prosecutions”  includes  any  attorney-at-law  authorised  in\nwriting by the Director of Public Prosecutions to conduct plea negotiations\nand conclude plea agreements;\n\n“improper inducement” includes\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe laying of a charge, or causing a charge to be laid without reasonable\ncause;\n\nthe  coercion  of  an  accused  person  or  suspect  to  enter  into  plea\ndiscussion or conclude a plea agreement, including a threat\n\n(i)\n\n(ii)\n\nto lay a charge or cause a charge to be laid of the type described\nin paragraph (a); or\n\nthat any plea of not guilty entered into by the accused person will\nresult,  upon  the  accused  person’s  conviction,  in  the  prosecutor\nasking for a sentence more severe than the sentence that is usually\nimposed upon an accused person who is convicted of a similar\noffence;\n\nthe misrepresentation of a material fact either before a plea discussion\nis entered into or during the course of the discussion;\n\nthe offer or promise, the fulfilment of which is not the function of the\nDirector of Public Prosecutions; or\n\n\f7\n\n(e)\n\nan attempt to persuade the accused person or suspect to plead guilty\nnotwithstanding the accused person’s or suspect’s denial;\n\n“plea agreement” means an agreement made pursuant to section 9;\n\n“plea negotiations” means negotiations conducted pursuant to section 5.\n\nApplication\n\n3.\n\nThis Act applies to plea negotiations for indictable offences only.\n\nDeclaration of certain existing rights\n\n4.\ncharge without entering plea negotiations or a plea agreement.\n\nNothing in this Act affects the right of an accused to plead guilty to a\n\nPlea negotiations\n\n5.\ntime before conviction, including, before charges are instituted.\n\nA plea negotiation may be held and a plea agreement concluded at any\n\nNo obligation on State to enter into plea negotiations\n\n6.(1)\nwith any accused person.\n\nThere shall be no obligation on the State to enter into plea negotiations\n\nThe Director of Public Prosecutions shall, at his sole discretion, determine\n(2)\nwhether he would engage into plea negotiations with an accused person or his\nattorney-at-law.\n\nPowers of Director of Public Prosecutions\n\n7.\n\nThe powers of the Director of Public Prosecutions are to\n\n(a)\n\n(b)\n\nwithdraw or discontinue the original charge against the accused; or\n\naccept the plea of the accused to a lesser offence, whether originally\nincluded or not, than that charged.\n\n\f8\n\nLegal representation\n\n8.(1)\nWhere  an  accused  person  is  represented  by  an  attorney-at-law,  the\nDirector of Public Prosecutions shall not initiate or engage in plea negotiations\nwith an accused person in the absence of his attorney-at-law.\n\nThe  Director  of  Public  Prosecutions  shall  not  initiate  or  engage  in  plea\n(2)\nnegotiations with an accused person who is not represented by an attorney-at-law\nunless the Director of Public Prosecutions informs him of\n\n(a)\n\nhis  right  to  be  represented  by  an  attorney-at-law  during  plea\ndiscussions;\n\n(b)\n\nhis right to protection against self-incrimination;\n\n(c)\n\n(d)\n\nhis right to be presumed innocent; and\n\nthe right of the accused to seek a sentence indication from the Court of\nthe maximum sentence that the Court may impose if the accused pleads\nguilty to an offence.\n\nWhere an accused person, after having been advised by the prosecutor of\n(3)\nhis rights under subsection (1), states that he desires to enter into negotiations\nand represent himself, Form 1 of the Schedule shall be signed by both parties in\nthe presence of a Justice of the Peace and be filed with the Registrar.\n\nA plea agreement which has been concluded between the prosecutor and\n(4)\nthe attorney-at-law for the accused person shall be in the form set out as Form 2\nof the Schedule and where such agreement is concluded, the agreement shall be\nfiled with the Registrar.\n\nA plea agreement which has been concluded between the prosecutor and\n(5)\nan unrepresented accused person shall be in the form set out as Form 6 of the\nSchedule and where such agreement is concluded it shall be signed by both parties\nin the presence of a Justice of the Peace and filed with the Registrar.\n\n\f9\n\nPlea agreements\n\n9.\n\nEvery plea agreement that is brought before a court shall be\n\n(a)\n\n(b)\n\nin writing; and\n\nsigned  by  the  Director  of  Public  Prosecutions,  the  accused  and  his\nattorney-at-law as the case may be.\n\nForm and filing of plea agreement with a represented person\n\nA plea agreement concluded between a prosecutor and the attorney-\n10.(1)\nat-law  for  an  accused  person  shall  be  in  the  form  set  out  as  Form  2  of  the\nSchedule.\n\nWhere an accused person is before a Magistrate, the plea agreement shall\n\n(2)\nbe filed with the clerk, along with the following documents:\n\n(a)\n\n(b)\n\n(c)\n\na statement by the accused person in the form set out as Form 3 of the\nSchedule;\n\na statement by the attorney-at-law for the accused person in the form\nset out as Form 4 of the Schedule;\n\nif a court interpreter was used during plea negotiation, a certificate in\nthe form set out as Form 5 of the Schedule, by the court interpreter as\nto the accuracy of the interpretation during the plea negotiation and the\naccuracy of the translation of the plea agreement;\n\n(d)\n\nvictim impact statements, if any; and\n\n(e)\n\nthe complaint or draft indictment in the case of committal proceedings.\n\nWhere an accused person is before the High Court, the plea agreement shall\n(3)\nbe filed with the Registrar of the Court, along with the documents referred to in\nsubsection (2)(a) to (d) and the indictment.\n\n\f10\n\nForm and filing of plea agreement with unrepresented person\n\n11.(1)\n\nA plea agreement concluded between a prosecutor and\n\n(a)\n\n(b)\n\nan unrepresented accused person; or\n\nan unrepresented suspect,\n\nshall be in the form set out as Form 6 of the Schedule and shall be signed by both\nparties in the presence of a Justice of the Peace.\n\nWhere an unrepresented accused person is before a magistrate, the plea\n\n(2)\nagreement shall be filed with the clerk, along with the following documents:\n\n(a)\n\n(b)\n\na  statement  in  the  form  set  out  as  Form  3  of  the  Schedule,  where\napplicable;\n\nif a court interpreter was used during plea negotiation, a certificate in\nthe form set out as Form 5 of the Schedule, by the court interpreter as\nto the accuracy of the interpretation during the plea negotiation and the\naccuracy of the translation of the plea agreement;\n\n(c)\n\nvictim impact statements, if any; and\n\n(d)\n\nthe complaint or draft indictment in the case of committal proceedings.\n\nWhere an unrepresented accused person is before the High Court, the plea\n(3)\nagreement shall be filed with the Registrar of the Court, along with the documents\nreferred to in subsection (2)(a) to (c) and the indictment.\n\nListing matters for plea agreement hearing\n\n12.(1)\nshall be listed for a plea agreement hearing.\n\nWithin 28 days of the date that a plea agreement is filed, the matter\n\nIf a matter is not listed before the Court for a plea agreement hearing within\n\n(2)\nthe period required under subsection (1)\n\n(a)\n\nthe prosecutor;\n\n\f11\n\n(b)\n\nthe attorney-at-law for the accused person; or\n\n(c)\n\nthe accused person,\n\nmay make an application either orally or in writing in the form set out as Form\n7 in the Schedule to have the matter listed for a plea agreement hearing.\n\nPlea agreements at committal proceedings\n\n13.(1)\ncommitted to stand trial in the High Court, the Magistrate shall\n\nIf a plea agreement is filed at any time before an accused person is\n\n(a)\n\ncease  conduct  of  the  committal  proceedings,  if  proceedings  have\ncommenced;\n\n(b)\n\ntransfer the matter to the High Court for a plea agreement hearing; and\n\n(c)\n\nwithin 14 days of transferring a matter under paragraph (b), forward\nthe following documents to the High Court:\n\n(i)\n\nthe documents filed under section 10(2) or 11(2);\n\n(ii)\n\nwitness statements, if any;\n\n(iii)\n\ndocumentary exhibits; and\n\n(iv)\n\nany other documents filed during the conduct of the committal\nproceedings.\n\nWhere  a  Magistrate  transfers  a  matter  under  subsection  (1)(b),  the\n(2)\nMagistrate may grant bail to the accused person under the Bail Act, Cap. 122A.\n\nWithin  14  days  of  receiving  the  documents  forwarded  by  a  Magistrate\n(3)\nunder subsection (1)(c), the matter shall be listed for a plea agreement hearing\nbefore the Court.\n\nDirector of Public Prosecutions to prefer indictments\n\n14.\nNotwithstanding any other law to the contrary, if a plea agreement is\nfiled  before  the  commencement  or  conclusion  of  committal  proceedings,  the\nDirector of Public Prosecutions shall prefer an indictment and file the indictment\n\n\f12\n\nwith the Registrar within 14 days of the date that the matter is transferred under\nsection 11(1)(b).\n\nVictim impact statement\n\n15.(1)\n\nSubject to section 16\n\n(a)\n\n(b)\n\nbefore a plea bargain is concluded the Director of Public Prosecutions\nshall permit the complainant to make representations to him in writing\nand may take such representations into consideration in concluding the\nplea agreement;\n\nwhere  a  plea  agreement  is  concluded,  the  Director  of  Public\nProsecutions  shall,  unless  otherwise  required  by  the  compelling\nreasons in the interest of justice, as soon as is reasonably practicable,\ncommunicate with the complainant in respect of\n\n(i)\n\nthe substance of and of reasons for the plea agreement; and\n\n(ii)\n\nthe entitlement of the complainant to be present when the Court\nconsiders the plea agreement.\n\nWhere the complainant had died or is incapacitated, the Director of Public\n(2)\nProsecutions shall communicate with a member of the victim’s immediate family\nin respect of the matters set out subsection (1).\n\nWhere the complainant is a child or a person labouring under a disability\n\n(3)\nof the mind, he may be represented by\n\n(a)\n\n(b)\n\na parent or guardian; or\n\nan  officer  of  the  Child  Care  Board,  if  a  parent  or  guardian  is  not\navailable.\n\nRestriction on the content of a victim impact statement\n\n16.\n\nA victim impact statement shall not include\n\n(a)\n\na restatement of the facts of the offence;\n\n\f13\n\n(b)\n\ncriticisms about the accused person; or\n\n(c)\n\nthe  victim’s  opinion  about  the  type  or  severity  of  sentence  to  be\nimposed.\n\nDuties of the prosecutor in respect of victim impact statements\n\n17.(1)\nwith the requirements of section 16.\n\nThe prosecutor shall ensure that a victim impact statement complies\n\nIf a victim impact statement contains material that is not permitted under\n(2)\nsection  16,  the  prosecutor  shall  redact  that  material  from  the  victim  impact\nstatement before it is filed with the Court.\n\nA victim impact statement shall be filed with the Court at the time of the\n\n(3)\nfiling of the plea agreement.\n\nAfter receiving the victim impact statement, the prosecutor shall serve the\n(4)\nvictim impact statement on the accused person or his attorney-at-law as soon as\nit is reasonably practicable to do so and in any event, before it is filed with the\nCourt.\n\nDirector of Public Prosecutions to notify Court of existence of plea\nagreement\n\n18.(1)\nabsence of the jury\n\nThe Director of Public Prosecutions shall, in open court, but in the\n\n(a)\n\n(b)\n\nbefore the accused is required to plead; or\n\nat any time after the arraignment,\n\ninform the Court of the existence of the plea agreement.\n\nThe Court may, where circumstances require, question the accused in order\n\n(2)\nto satisfy itself that the accused is aware of the existence of the agreement.\n\n\f14\n\nProcedure at plea agreement hearing\n\n19.(1)\nA plea agreement hearing shall be held in open court unless, having\ntaken all of the circumstances into consideration, the Court considers that the\nhearing should be held in camera.\n\nAt a plea agreement hearing, the prosecutor shall disclose the following\n(2)\ninformation to the Court in the presence of the accused person and his attorney-\nat-law  or  in  the  presence  of  the  accused  person  who  has  elected  to  represent\nhimself under section 11\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe substance of, and reasons for the plea agreement;\n\nwhether a previous plea agreement has been disclosed to a Court in\nconnection  with  the  same  matter  and  the  substance  of  that  plea\nagreement, if any;\n\nif no victim impact statement is filed, whether the victim was informed\nof  his  right  to  make  a  victim  impact  statement  and  of  the  matters\nmentioned in sections 15 and 16; or\n\nif a victim impact statement is filed, whether the victim would like to\nread his victim impact statement in open court or have the statement\nread by the prosecutor or an officer of the Court.\n\nBefore  accepting  or  rejecting  a  plea  agreement,  the  Court  shall  make\n(3)\nenquiries of the accused person in order to determine whether the accused person\n\n(a)\n\nunderstands the nature and substance of the plea agreement, including\nthe recommended sentence;\n\n(b)\n\nreceived legal advice before signing the plea agreement;\n\n(c)\n\n(d)\n\nunderstands the nature of the offence with which he is charged and to\nwhich he is pleading;\n\nunderstands that this trial shall be conducted by a Judge and jury, where\napplicable;\n\n\f(e)\n\nis aware of his rights, including the right to\n\n15\n\n(i)\n\nnot incriminate himself;\n\n(ii)\n\nplead not guilty;\n\n(iii)\n\nbe presumed innocent;\n\n(iv)\n\nhave the State prove its case beyond a reasonable doubt;\n\n(v)\n\nbe represented by an attorney-at-law at trial;\n\n(vi)\n\ncross-examine witnesses; and\n\n(vii)\n\ntestify in his own defence or to remain silent;\n\n(f)\n\n(g)\n\nunderstands that the Court is not obligated to accept the plea agreement;\nand\n\nwas offered an improper inducement to enter into plea negotiation or\nconclude a plea agreement.\n\nIf a victim impact statement is filed with the Court, the Court shall consider\n(4)\nthe views expressed in the victim impact statement before accepting or rejecting\na plea agreement and the Court may accept or reject all or any part of a victim\nimpact statement.\n\nAn accused person may, with leave of the Court, cross-examine the victim\n(5)\non the contents of his victim impact statement, to the extent that the Court allows.\n\n(6)\n\nWhere a victim impact statement contains information that\n\n(a)\n\n(b)\n\nis not permitted under section 16; or\n\nin the discretion of the Court should not be included in a victim impact\nstatement,\n\nthe Court may rule the information is inadmissible and direct that it be redacted\nfrom the victim impact statement.\n\n\f16\n\nPlea Agreement not binding on the Court\n\n20.(1)\nThe  Court  may  reject  a  plea  agreement  entered  into  between  the\nprosecutor and the accused person if the Court considers that it is in the interest\nof justice to do so.\n\nWhere  the  Court  makes  a  determination  that  there  was  an  improper\n(2)\ninducement offered to the suspect or accused person, the Court shall reject the\nplea agreement.\n\nWhere a Judge rejects a plea agreement under subsection (1), the Judge\n\n(3)\nshall\n\n(a)\n\n(b)\n\nin open court, inform the accused person of his right to be tried again\nbefore another Judge;\n\nwithin 7 days of the rejection of the plea agreement, provide written\nnotification  to  the  Director  of  Public  Prosecutions  and  the  accused\nperson of the reasons for rejecting the plea agreement; and\n\n(c)\n\nlist the matter for trial.\n\nThe rejection of a plea agreement by a Court shall not operate as a bar to\n\n(4)\nthe conduct of any subsequent plea negotiation and plea agreement.\n\nCases to be heard by a different Judge where agreement is refused or\nwithdrawn\n\n21.\nWhere the Court refuses to accept an agreement under section 20, or\nthe  accused  withdraws  from  the  agreement  under  section  30,  and  the  case\nproceeds to trial, the matter shall be heard by any judge other than the judge who\nrefused to accept the agreement or before whom an agreement is withdrawn.\n\nAccused right to appeal rejection of plea agreement\n\n22.(1)\nof Appeal against the Court’s rejection of a plea agreement.\n\nSubject to subsection (2), an accused person may appeal to the Court\n\n\f17\n\n(2)\nThe accused person shall give notice of appeal in the form set out as Form\n8 in the Schedule within 28 days of receiving written notification under section\n20(3)(b) of the Court’s reasons for rejecting the plea agreement.\n\nDirector of Public Prosecutions right to appeal rejection of plea\nagreement\n\n23.(1)\nagainst the Court’s rejection of a plea agreement.\n\nThe Director of Public Prosecutions may appeal to the Court of Appeal\n\nThe Director of Public Prosecutions shall give notice of appeal in the form\n(2)\nset out as Form 9 in the Schedule within 28 days of receiving written notification\nunder section 20(3)(b) of the Court’s reasons for rejecting the plea agreement.\n\nEffect of accepting plea agreement\n\n24.\nrequired to plead to the charge.\n\nWhere a plea agreement is accepted by a court, the accused shall be\n\nAccepted plea agreement to form part of record\n\n25.\n\nSubject to section 26,\n\n(a)\n\n(b)\n\nany written representation made by a complainant; and\n\nthe  fact  that  a  plea  agreement  has  been  accepted  and  the  contents\nthereof,\n\nshall be entered on the record.\n\nSentencing where plea agreement accepted\n\n26.(1)\nsentence in accordance with that plea agreement.\n\nWhere  a  court  accepts  a  plea  agreement,  the  court  shall  impose\n\nWhere\n\nthe  offence\n\nthen\nis  punishable  by\n(2)\nnotwithstanding  any  other  provision  to  the  contrary,  the  maximum  sentence\nwhich may be imposed in relation to any such offence shall be 40 years.\n\nimprisonment,\n\nlife\n\n\f18\n\nPost sentence negotiations and agreements\n\nA convicted person who is serving a sentence and wishes to assist the\n27.\nprosecutor may enter into post sentence negotiations and agreements with the\nview to a reduction in sentence or other benefit.\n\nReview of sentence of convicted person\n\n28.(1)\nthe original sentence, if possible, if it is in the interest of justice to do so.\n\nA prosecutor may refer a sentence for review to the Court that entered\n\n(2)\n\nThe Court may review a sentence under subsection (1) where\n\n(a)\n\n(b)\n\n(c)\n\nthe convicted person received a reduced sentence on an undertaking to\nassist  under  the  Act  but  knowingly  failed  to  give  any  assistance  in\naccordance with the agreement, or misled the prosecutor;\n\nthe convicted person received a reduced sentence under an agreement,\nand has undertaken in a separate agreement to give further assistance;\nor\n\nthe  convicted  person  did  not  receive  a  reduced  sentence,  but\nsubsequently gave, or undertook in an agreement to give assistance in\nconnection with the investigation or prosecution of an offence.\n\nIn reviewing a sentence under subsection (1), the Court that entered the\n(3)\noriginal sentence shall have regard to the extent and nature of the assistance given\nor offered.\n\nPower to reduce penalties for assistance rendered to the State\n\nA Judge may impose a lesser sentence than the Judge would otherwise\n29.(1)\nimpose on an accused person having regard to the degree to which the accused\nperson has assisted, or undertaken to assist, the State in the prevention, detection\nor investigation of, or in State proceedings relating to, the offence concerned or\nany other offence, and having regard to the matters set out in subsection (2).\n\n\f19\n\n(2)\nIn  deciding  whether  to  impose  a  lesser  sentence  for  an  offence  and  the\nnature  and  extent  of  the  sentence  he  imposes,  the  Judge  shall  consider  the\nfollowing matters\n\n(a)\n\n(b)\n\n(c)\n\nthe significance and usefulness of the accused person's assistance to\nthe State concerned, taking into consideration any evaluation by the\nState of the assistance rendered or undertaken to be rendered;\n\nthe  truthfulness,  completeness  and  reliability  of  any  information  or\nevidence provided by the accused person;\n\nthe nature and extent of the accused person's assistance or promised\nassistance;\n\n(d)\n\nthe timeliness of the assistance or undertaking to assist;\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nany benefits that the accused person has gained or may gain by reason\nof the assistance or undertaking to assist;\n\nwhether the accused person will suffer harsher custodial conditions as\na consequence of the assistance or undertaking to assist;\n\nany  injury  suffered  by  the  accused  person  or  the  accused  person's\nfamily, or any danger or risk of injury to the accused person or the\naccused person's family, resulting from the assistance or undertaking\nto assist;\n\nwhether the assistance or promised assistance concerns the offence for\nwhich the accused person is being sentenced or an unrelated offence;\n\nwhether the accused person has agreed to compensate the victim; and\n\nwhether the accused person offers to plead guilty soon after he has been\ncharged or at the earliest possible time after the investigator's file is\ncompleted.\n\n\f20\n\nA Judge that imposes a lesser sentence under this section on an accused\n\n(3)\nperson because the accused person has assisted, or undertaken to assist, shall\n\n(a)\n\nindicate to the accused person and may make a record of the fact, that\nthe lesser sentence is being imposed because the accused person has\nassisted, or undertaken to assist, the State, in the prevention, detection\nor investigation of, or in proceedings relating to, the offence concerned\nor any other offence; and\n\n(b)\n\nstate the sentence that it would otherwise have imposed.\n\nSubsection (3) does not limit any requirement that a Judge has, apart from\n\n(4)\nthat subsection, to record the reasons for his decisions.\n\nThe failure of a Judge to comply with the requirements of subsection (3)\n\n(5)\nwith respect to any sentence does not invalidate the sentence.\n\nWithdrawal from agreement\n\n30.(1)\nfrom that agreement where\n\nAn accused who enters into a plea agreement is entitled to withdraw\n\n(a)\n\n(b)\n\n(c)\n\nit was entered into as a result of an improper inducement;\n\nthe  Court  determines  that  the  Director  of  Public  Prosecutions  has\nbreached the terms of the plea agreement; or\n\nit was entered into as a result of a misrepresentation or misapprehension\nas to the substance or consequences of the plea agreement.\n\nThe Director of Public Prosecutions is entitled to withdraw from a plea\n(2)\nagreement before sentence where the Director of Public Prosecutions is satisfied\nthat he was\n\n(a)\n\n(b)\n\nin  the  course  of  plea  negotiations,  misled  by  the  accused  or  by  his\nattorney-at-law in some material respect; or\n\ninduced to conclude the plea agreement by conduct amounting to an\nobstruction of justice.\n\n\f21\n\nApplication by Prosecutor to set aside plea agreement\n\n31.(1)\nUpon application, the Director of Public Prosecutions, may appeal to\nthe Court of Appeal, with the leave of the court to set aside an accused person’s\nconviction or sentence pursuant to a plea agreement where\n\n(a)\n\n(b)\n\n(c)\n\nthe  prosecutor,  in  the  course  of  the  plea  negotiations  was  wilfully\nmisled by the accused person or his attorney-at-law in some material\nrespect;\n\nthe prosecutor was induced to conclude the plea agreement by threats,\nforce, bribery or any other means of intimidation or influence; or\n\nthere are any other grounds upon which the plea agreement may be set\naside in the interest of justice.\n\nWhere in accordance with subsection (1), the Director of Prosecutions is\n(2)\ngranted leave to the Court of Appeal, the Director of Public Prosecutions shall\ngive Notice of Appeal in the form set out as Form 10 in the Schedule, within 28\ndays of the sentence being passed.\n\nAdmissibility of plea agreement, etc.\n\n32.\nEvidence  of  the  following  matters  is  not,  in  any  civil  or  criminal\nproceedings, admissible against the accused who entered the agreement or is a\nparty to the plea negotiation:\n\n(a)\n\n(b)\n\na plea of guilty which was later withdrawn or any statement made in\nthe  course  of  any  proceedings  under  this  Act  regarding  the  plea  of\nguilty; or\n\nany statement made in the course of plea negotiations with the Director\nof Public Prosecutions which does not result in a guilty plea or which\nresults in a plea of guilty that is later withdrawn or rejected.\n\n\f22\n\nSealing of records plea negotiations\n\nThe Court may upon application by either party or in its discretion, as\n33.\nthe case may be, order that the records of plea negotiations or a plea agreement\nbe sealed, where the court is satisfied that the sealing of such records is in the\ninterests of the effective administration of justice.\n\nObligation for secrecy\n\n34.(1)\nA  person  having  an  official  duty  or  being  employed  in  the\nadministration of this Act shall regard and deal with as secret and confidential,\nall information relating to a plea agreement\n\n(a)\n\n(b)\n\nbefore it is presented to the Court; or\n\nafter the records thereof are sealed by the Court.\n\nA person referred to in subsection (1) who has in his possession or under\n(2)\nhis  control  any  document,  information  or  record,  and  who  communicates  or\nattempts to communicate anything contained in such document or record or any\nsuch information to another person otherwise than in accordance with this Act\nor  pursuant  to  a  Court  order,  is  guilty  of  an  offence  and  liable  on  summary\nconviction to a fine of $1 000 000 or to imprisonment for a term of 7 years or to\nboth.\n\nAny person to whom information is communicated in accordance with this\n\n(3)\nAct, shall regard and deal with such information as secret and confidential.\n\nA person referred to in subsection (3) who at any time communicates or\n(4)\nattempts to communicate any information referred to in that subsection to any\nperson otherwise than for the purposes of this Act, is guilty of an offence and\nliable on summary conviction to a fine of $1 000 000 or to imprisonment for a\nterm of 7 years or to both.\n\nAmendment of Schedule\n\n35.(1)\n\nThe Minister may by order amend the Schedule.\n\n\f(2)\n\nAn order made under subsection (1) is subject to negative resolution.\n\n23\n\n\f24\n\nL.R.O. 1998SCHEDULE(Section 8(3))Criminal Justice (Plea Negotiations and Agreements) Act, 2024 (Act 2024-     )FORM 1(This Form applies if the accused does not wish to be represented by an attorney-at-law)DECLARATION BY ACCUSED OF DESIRE TO REPRESENT SELF IN PLEA NEGOTIATIONSThe Statev.The AccusedWHEREAS the accused was on the  day of   , 20 , chargedwith the following oﬀ ence(s):(a)(b)(c)(d)(e)AND WHEREAS as the prosecutor has informed me of my right to representation by anattorney-at-law during plea negotiations and I have informed the prosecutor of my desire torepresent myself.\f25\n\n L.R.O. 1998FORM 1 - (Concl'd) NOW THEREFORE WHEREAS I have voluntarily and of my free will agreed to enter into plea negotiations with the prosecutor and (a) I have (elected/not elected) to have a third party of my choice present during plea  negotiations; and (b) I have not been induced, threatened or forced in any way to enter into plea   negotiations.Dated this   day of , 20 . Schedule - (Cont'd)(Signature)(Signature)(Prosecutor)(Accused)\f26\n\nL.R.O. 1998(Sections 8(4) and 10(1))Criminal Justice (Plea Negotiations and Agreements) Act, 2024(Act 2024-     )FORM 2(This Form applies if the accused is represented by an attorney-at-law)PLEA AGREEMENTThe Statev.The AccusedWHEREAS the accused was on the  day of   , 20 , chargedwith the following oﬀ ence(s):(a)  (b)  (c)  (d)AND WHEREAS a plea agreement was on the  day of                       , 20   ,concluded between the prosecutor and the attorney-at-law for the accused:Schedule - (Cont'd)No.\f27\n\n L.R.O. 1998FORM 2 - (Concl'd) AND WHEREAS it was agreed that the accused shall plead guilty to  (a)  (b)  (c)  (d)  (e)and in consideration that the prosecutor shall take the course of action mentioned hereunder:   NOW THEREFORE it was agreed that as a result of the accused pleading guilty to the said oﬀ ence(s), the prosecutor shall take the following course of action:  (a)  (b)  (c)  (d)  (e)  (f) (g) (h) (i)Dated this   day of , 20 . Schedule - (Cont'd)(Attorney-at-law for the Accused)(Prosecutor)(Accused)(Signature)(Signature)(Signature)\f28\n\nL.R.O. 1998(Sections 10(2)(a) and 11(2)(a))Criminal Justice (Plea Negotiations and Agreements) Act, 2024 (Act 2024-     )FORM 3STATEMENT BY THE ACCUSED1. I  have read this agreement and carefully discussed each paragraph with my attorney-at-law. I understand the terms of this agreement and agree to it without reservation.2.I voluntarily and of my free will agree to those terms.3.I am pleading guilty to the charge(s). My attorney-at-law has advised me of my rights,of possible defences, of the penalties and of the consequences of entering such anagreement.4.No promises, agreements, understanding or inducements have been made to me other thanthose contained in this agreement.5.No one has threatened or forced me in any way to enter into this agreement.6.I have had suﬃ  cient time to confer with my attorney-at-law concerning the plea agreement.7.I am satisﬁ ed with the representation of my attorney-at-law in this matter.Schedule - (Cont'd)(Name of the Accused)(Date)(Signature)\f29\n\nL.R.O. 1998(Section 10(2)(b))Criminal Justice (Plea Negotiations and Agreements) Act, 2024 (Act 2024-     )FORM 4STATEMENT BY THE ATTORNEY-AT-LAW REPRESENTING THE ACCUSEDI am the Attorney-at-law for I have read this agreement and carefully discussed each paragraph of this agreement with myclient.  Further, I have fully advised my client of his rights, of possible defences (if applicable), of the penalties and consequences of entering into this agreement. To the best of my knowledge and belief, my client's decision to enter into this agreement is an informed and voluntary one.Schedule - (Cont'd)(Name of the Accused)(Name of the Attorney-at-law representing the Accused)(Signature)(Date)\f30\n\nL.R.O. 1998Schedule - (Cont'd)(Sections 10(2)(c) and 11(2)(b))Criminal Justice (Plea Negotiations and Agreements) Act, 2024 (Act 2024-     )FORM 5INTERPRETER'S CERTIFICATE I,        , declare that I ama Licensed Court Interpreter appointed by a Court to act as Interpreter in respect of the plea negotiations and plea agreementbetween The State v.The Accused Person. I am licensed/appointed by the Court to interpret and translate from the language to the language. I further declare that I have accurately translated the plea discussions between The Stateand The Accused Person and the attached Plea Agreement from the language to the language. I declare to the best of my abilities and belief, that this is a true and accurate translation of the language text of   the Plea Agreement between The State and The Accused.(Insert name of person translating)(Check one)(Signature of Interpreter)(Date)\f31\n\nL.R.O. 1998(Section 11(1))Criminal Justice (Plea Negotiations and Agreements) Act, 2024 (Act 2024-     )FORM 6(This Form applies if the accused is not represented by an attorney-at-law)PLEA AGREEMENTThe Statev.The AccusedWHEREAS the accused was on the  day of   , 20 , chargedwith the following oﬀ ence(s):(a)  (b)  (c)  (d) AND WHEREAS the prosecutor informed the accused that he should be representedby an attorney-at-law:AND WHEREAS the accused informed the prosecutor that he did not wish to be represented by an attorney-at-law and declared, inter alia, before a Justice of the Peace his desireto represent himself and (to elect/not elect) to have a third party of his choice present during plea negotiations:AND WHEREAS the accused also declared, before a Justice of the Peace, inter alia, that he was informed of his right to be represented by an attorney -at-law and that he desired to represent himself and (to elect/not elect) to have a third party of his choice present during pleanegotiations:Schedule - (Cont'd)No.\f32\n\n L.R.O. 1998FORM 6 - (Cont'd) AND WHEREAS the accused agreed to have the plea negotiations recorded:AND WHEREAS a plea agreement was on the  day of                       , 20   ,concluded between the prosecutor and the attorney-at-law for the accused: AND WHEREAS it was agreed that the accused shall plead guilty to   (a)  (b)  (c) (d) (e) (f) in consideration that the prosecutor would take the course mentioned hereunder:   AND WHEREAS it was agreed that as a result of the accused pleading guilty to the said oﬀ ence(s), the prosecutor shall take the following course of action: (a)  (b)  (c) (d) (e) (f) (g) (h) (i)Dated this   day of , 20 . Schedule - (Cont'd)(Name of Prosecutor)(Name of Accused)(Signature)(Signature)\f33\n\n L.R.O. 1998Schedule - (Cont'd)FORM 6 - (Concl'd)CERTIFICATION OF JUSTICE OF THE PEACE I, , Justice of the Peace, hereby certify that the above plea agreement was signed by the Prosecutor          ,  and the accused in mypresence on the day of  , 20 .(Name of Prosecutor)(Name of Accused)(Justice of the Peace)(Signature)\f34\n\nL.R.O. 1998(Section 12)Criminal Justice (Plea Negotiations and Agreements) Act, 2024 (Act 2024-     )FORM 7APPLICATION FOR LISTING PLEA AGREEMENT HEARINGA.B - The State/Complainantv.C.D. - The Accused Person/Defendant/SuspectCOURT DETAILS:CourtDivisionRegistryCase NumberTITLE OF PROCEEDINGS:A.B. - The State/Complainant  v.  C.D. -The Accused Person/Defendant/SuspectFILING DETAILS:Person seeking hearing:Contact Name and Address:PERSON AFFECTED BY HEARING SOUGHT:ORDER SOUGHT:Case be listed for a plea agreement hearing(Signature of Prosecutor/Attorney-at-law/Accused)(Date)Schedule - (Cont'd)\f35\n\nL.R.O. 1998(Section 22(2))Criminal Justice (Plea Negotiations and Agreements) Act, 2024 (Act 2024-     )FORM 8FORM OF NOTICE OF APPEAL IF APPELLANT IS THE ACCUSEDTake notice that I,  , aggrieved bya rejection of plea agreement ofdatedagainst me the said  for having as therein alleged on the day of     (here state brieﬂ y rejection of plea agreement) do appealagainst such rejection of plea agreement on the ground(s) thatDated this   day of , 20 . Schedule - (Cont'd)To: Registrar of the Supreme Court(Accused)(Accused or his Attorney-at-law)\f36\n\nL.R.O. 1998Schedule  - (Cont'd)To: AccusedRegistrar of the Supreme Court(Prosecutor)(Prosecutor)(Section 23(2))Criminal Justice (Plea Negotiations and Agreements) Act, 2024 (Act 2024-     )FORM 9FORM OF NOTICE OF APPEAL IF APPELLANT IS THE PROSECUTORTake notice that I,  , aggrieved by a rejection of the plea agreement ofdated   for having as therein alleged on the     dayof  (here state brieﬂ y the rejection of plea agreement) do appeal againstsuch order of rejection of plea agreement on the ground(s) thatDated this   day of , 20 . \f37\n\nL.R.O. 1998Schedule - (Concl'd)(Section 31(2))Criminal Justice (Plea Negotiations and Agreements) Act, 2024 (Act 2024-     )FORM 10FORM OF NOTICE OF APPEAL OF THE DIRECTOR OF PUBLIC PROSECUTIONSTo:   Take notice that I,       , have cause to believe that, in the course of plea negotiations, I was wilfully misled by the accused on the ground thatand do appeal the matter on the aforementioned ground(s).Dated this   day of , 20 .   (Prosecutor)(Registrar of the Supreme Court)\f38\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}