{
  "bill_id": 793,
  "slug": "bail-act-2024",
  "title": "Bail Act, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/56621e6f4befa364efb37cb31f6e326d.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-07-30",
  "first_reading": "2024-07-31",
  "gazette_date": null,
  "markdown": "2024-07-30\n\nBill as amended\n\nOBJECTS AND REASONS\n\nThis  Bill  would  revise  the  law  relating  to  the  provision  of  bail  in  or  in\n\nconnection with criminal proceedings and would provide for related matters.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\nPART II\n\nRIGHT TO BAIL\n\nShort title\n\nInterpretation\n\nApplication of Act\n\nRight to bail\n\nPolice bail\n\nCircumstances in which bail may be refused\n\nCourt to obtain evidence in bail proceedings\n\nPART III\n\nBAIL PROCEDURE\n\nRecord of decision as to bail\n\nReasons relating to bail\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n\f3\n\n10.\n\nRight to apply to the High Court for bail\n\n11.\n\nBail in the case of persons charged with an offence set out in Schedule\n\n12.\n\nPowers of the High Court in relation to bail\n\nPART IV\n\nCONDITIONS OF BAIL\n\n13.\n\nGeneral provisions relating to bail\n\n14.\n\nExceptions to section 13 conditions\n\n15.\n\nBail with sureties\n\n16.\n\nFailure by defendant to observe condition of bail\n\n17.\n\nRevocation of bail\n\n18.\n\nForfeiture of security\n\nPART V\n\nMISCELLANEOUS\n\n19.\n\nAbsconding\n\n20.\n\nArrest for absconding etc.\n\n21.\n\nBail of children\n\n22.\n\nAppeal to superior court with regard to bail\n\n23.\n\nProsecution right of appeal\n\n\f4\n\n24.\n\nPayment of bail money by third person\n\n25.\n\nRules\n\n26.\n\nSavings\n\n27.\n\nTransitional\n\n28.\n\nRepeal of Cap. 122A\n\nSCHEDULE\n\nOFFENCES\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to revise the law relating to the provision of bail in or in connection\n\nwith criminal proceedings and to provide for related matters.\n\nENACTED by the Parliament of Barbados in accordance with the provisions\n\nof section 49 of the Constitution as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Bail Act, 2024.\n\nInterpretation\n\n2.(1)\n\nIn this Act,\n\n“bail” means\n\n(a)\n\n(b)\n\nbail grantable in or in connection with proceedings for an offence to a\nperson who is accused or convicted of the offence;\n\nbail grantable in connection with an offence to a person who is under\narrest  for  the  offence  or  for  whose  arrest  for  the  offence  a  warrant,\nendorsed for bail is issued;\n\n(c)\n\nbail grantable under the law, including common law, for the time being\nin force;\n\n“child” means a person under the age of 18 years;\n\n“conviction” includes\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\na finding of guilt;\n\na finding that a person is not guilty by reason of insanity;\n\na  finding  that  a  person  is  guilty  but  is  suffering  from  diminished\nresponsibility;\n\na  finding  under  section  57(1)  of  the  Magistrate's  Courts  Act,\nCap. 116A that the person in question did the act or made the omission\ncharged; and\n\n\f7\n\n(e)\n\na  conviction  of  an  offence  for  which  an  order  is  made  placing  the\noffender on probation or discharging him absolutely or conditionally,\n\nand “convicted” shall be construed accordingly;\n\n“court” means a Judge of the High Court or a magistrate and, in the case of a\nspecified court, includes a Judge or a magistrate having powers to act in\nconnection with proceedings before that court;\n\n“defendant” means a person charged with or convicted of an offence and includes\n\na person who is a party to an appeal;\n\n“lower court”means\n\n(a)\n\n(b)\n\nthe magistrate’s court where there is an appeal from that court to the\nHigh Court; and\n\nthe magistrate’s court or the High Court where there is an appeal from\nany such court to the Court of Appeal;\n\n“Magistrate's  Courts  Rules”  means  rules  made  under  section  268  of  the\n\nMagistrate's Courts Act, Cap. 116A;\n\n“offence” includes an alleged offence;\n\n“surrender to custody” means\n\n(a)\n\nin relation to a person released on bail, surrendering into the custody\nof the court or of the police officer, according to the requirements of\nthe grant of bail, at the time and place for the time being appointed for\nthe person to do so; or\n\n(b)\n\nin relation to an enactment which refers to the person bailed appearing\nbefore the court, the surrendering of that person before the court;\n\n“vary” in relation to bail, means imposing further conditions after bail is granted,\n\nor varying or rescinding conditions.\n\nWhere  an  enactment,  whenever  passed,  that  relates  to  bail  in  criminal\n(2)\nproceedings refers to the person being bailed appearing before a court, it is to be\n\n\f8\n\nconstrued,  unless  the  context  otherwise  requires,  as  referring  to  the  person\nsurrendering into the custody of the court.\n\nApplication of Act\n\n3.\n\nThis Act applies\n\n(a)\n\n(b)\n\nto an offence committed in Barbados or elsewhere; and\n\nto an extraditable offence under the Extradition Act, Cap. 189.\n\nPART II\n\nRIGHT TO BAIL\n\nRight to bail\n\n4.(1)\n\nSubject to this Act, a defendant shall be entitled to bail.\n\n(2)\n\nWhere bail is granted, the conditions of bail shall be reasonable.\n\nPolice bail\n\n5.\nWhere a person is taken into custody for an offence without a warrant,\na police officer not below the rank of inspector or a police officer in charge of\nthe police station to which the person is brought shall, if it is not practicable to\nbring  the  person  before  a  magistrate  within  24  hours  after  being  taken  into\ncustody, inquire into the case, and,\n\n(a)\n\n(b)\n\nif the offence is not one punishable with imprisonment, grant the person\nbail; and\n\nif the offence is one punishable with imprisonment, may, unless the\noffence appears to be a serious one, grant the person bail\n\nwith or without sureties subject to a duty to appear before a magistrate at such\ntime and place as the officer appoints.\n\n\f9\n\nCircumstances in which bail may be refused\n\n6.(1)\nWhere  a  defendant  is  accused  or  convicted  of  an  offence  that  is\npunishable by imprisonment, the court may refuse an application for bail if the\ninterests of justice so require.\n\nIn the interests of justice, the court shall refuse an application for bail where\n\n(2)\none or more of the following grounds are established:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nwhere there is the likelihood that the defendant, if granted bail, will\nendanger  the  safety  of  the  public  or  any  particular  person  or  will\ncommit an offence referred to in Part I of the Schedule;\n\nwhere there is the likelihood that the defendant, if granted bail, will\nattempt to evade trial;\n\nwhere there is the likelihood that the defendant, if granted bail, will\nattempt to influence or intimidate witnesses or to conceal or destroy\nevidence;\n\nwhere there is the likelihood that the defendant, if granted bail, will\nundermine or jeopardize the objectives or the proper functioning of the\ncriminal justice system, including the bail system; or\n\nwhere  in  exceptional  circumstances  there  is  the  likelihood  that  the\nrelease of the defendant will not be in the interest of public order or\npublic safety or public security.\n\nIn  considering  whether  the  ground  in  subsection  (2)(a)  has  been\n(3)\nestablished,  the  court  may,  where  applicable,  take  into  account  the  following\nfactors:\n\n(a)\n\n(b)\n\nthe degree of violence towards others implicit in the charge against the\ndefendant;\n\nany  threat  of  violence  which  the  defendant  may  have  made  to  any\nperson;\n\n\f10\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nany resentment the defendant is alleged to harbour against any person;\n\nany disposition to violence on the part of the defendant, as is evident\nfrom the defendant’s past conduct;\n\nany disposition of the defendant to commit an offence referred to in\nPart I of the Schedule, as is evident from the defendant’s past conduct;\n\nthe prevalence of a particular type of offence;\n\nany  evidence  that  the  defendant  previously  committed  an  offence\nreferred to in Part I of the Schedule while on bail; or\n\nany other factor which in the opinion of the court should be taken into\naccount.\n\nIn  considering  whether  the  ground  in  subsection  (2)(b)  has  been\n(4)\nestablished,  the  court  may,  where  applicable,  take  into  account  the  following\nfactors:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nthe assets held by the defendant and where such assets are held;\n\nthe means of, and travel documents held by, the defendant, which may\nenable the defendant to leave the country;\n\nthe  extent,  if  any,  to  which  the  defendant  can  afford  to  forfeit  the\namount of bail which may be set;\n\nthe question whether the extradition of the defendant could readily be\neffected  should  the  defendant  flee  the  jurisdiction  in  an  attempt  to\nevade trial;\n\nthe nature and gravity of the charge on which the defendant is to be\ntried;\n\nwhether the strength of the case against the defendant may induce the\ndefendant to attempt to evade trial;\n\nthe nature and gravity of the punishment which is likely to be imposed\nshould the defendant be convicted of the charges;\n\n\f11\n\n(h)\n\nthe binding effect and enforceability of bail conditions which may be\nimposed and the ease with which such conditions could be breached;\nor\n\n(i)\n\nany other factor which in the opinion of the court should be taken into\naccount.\n\nIn  considering  whether  the  ground  in  subsection  (2)(c)  has  been\n(5)\nestablished,  the  court  may,  where  applicable,  take  into  account  the  following\nfactors:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nthe fact that the defendant is familiar with the identity of witnesses and\nwith the evidence which they may give at the trial;\n\nwhether  the  witnesses  have  already  made  statements  and  agreed  to\ntestify;\n\nwhether  the  investigation  against  the  defendant  has  already  been\ncompleted;\n\nthe relationship of the defendant with the various witnesses and the\nextent to which they could be influenced or intimidated;\n\nhow  effective  and  enforceable  bail  conditions  prohibiting\ncommunication between the defendant and witnesses are likely to be;\n\nwhether the defendant has access to evidentiary material which is to\nbe presented at the trial;\n\nthe  ease  with  which  evidentiary  material  could  be  concealed  or\ndestroyed; or\n\nany other factor which in the opinion of the court should be taken into\naccount.\n\n\f12\n\n(6)\nIn  considering  whether  the  ground  in  subsection  (2)(d)  has  been\nestablished,  the  court  may,  where  applicable,  take  into  account  the  following\nfactors:\n\n(a)\n\nthe  fact  that  the  defendant,  knowing  it  to  be  false,  supplied  false\ninformation at the time of arrest or during the bail proceedings;\n\n(b)\n\nwhether the defendant is in custody on another charge;\n\n(c)\n\nany previous failure on the part of the defendant to comply with bail\nconditions or any indication that the defendant will not comply with\nany bail conditions; or\n\n(d)\n\nany other factor which in the opinion of the court should be taken into\naccount.\n\nIn  considering  whether  the  ground  in  subsection  (2)(e)  has  been\n\n(7)\nestablished, the court may, where applicable, take into account the following:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nwhether the nature of the offence or the circumstances under which the\noffence was committed is likely to induce a sense of shock or outrage\nin the community;\n\nwhether the shock or outrage of the community might lead to public\ndisorder if the defendant is released;\n\nwhether  the  safety  of  the  defendant  might  be  jeopardized  by  the\ndefendant’s release;\n\nwhether the sense of peace and security among members of the public\nwill be undermined or jeopardized by the release of the defendant;\n\nwhether the release of the defendant will undermine or jeopardize the\npublic confidence in the criminal justice system; or\n\nany other factor which in the opinion of the court should be taken into\naccount.\n\nIn considering subsection (2) the court shall decide the matter by weighing\n(8)\nthe interests of justice against the right of the defendant to personal freedom and\n\n\f13\n\nin  particular  the  prejudice  that  the  defendant  is  likely  to  suffer  if  detained  in\ncustody, taking into account, where applicable, the following factors:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nthe period for which the defendant has already been in custody since\narrest;\n\nthe probable period of detention until the disposal or conclusion of the\ntrial if the defendant is not released on bail;\n\nthe reason for any delay in the disposal or conclusion of the trial and\nany fault on the part of the defendant with regard to such delay;\n\nany  financial  loss  which  the  defendant  may  suffer  owing  to  the\ndefendant’s detention;\n\nany impediment to the preparation of the defendant's defence or any\ndelay in obtaining legal representation which may be brought about by\nthe detention of the defendant;\n\nthe state of health of the defendant; or\n\nany other factor which in the opinion of the court should be taken into\naccount.\n\nWhere the prosecution does not oppose the granting of bail, the court has\n(9)\nthe  duty,  imposed  by  subsection  (8),  to  weigh  the  personal  interests  of  the\ndefendant against the interests of justice.\n\n(10)\nNotwithstanding any provision of this Act, where a defendant is charged\nwith an offence referred to in Part I of the Schedule, the court shall order that the\ndefendant be detained in custody until the defendant is dealt with in accordance\nwith law, unless the defendant, having been given a reasonable opportunity to do\nso,  adduces  evidence  which  satisfies  the  court  that  exceptional  circumstances\nexist which in the interests of justice permit the defendant’s release.\n\nNotwithstanding any provision of this Act, where a defendant is charged\n(11)\nwith an offence referred to in Part II of the Schedule, the court shall order that\nthe  defendant  be  detained  in  custody  until  the  defendant  is  dealt  with  in\naccordance  with  law,  unless  the  defendant,  having  been  given  a  reasonable\n\n\f14\n\nopportunity to do so, adduces evidence which satisfies the court that the interests\nof justice permit the defendant’s release.\n\nThe court may make the release of a defendant on bail subject to conditions\n\n(12)\nwhich, in the court's opinion, are in the interests of justice.\n\nIn bail proceedings the defendant, or the attorney-at-law for the defendant,\n\n(13)\nshall inform the court whether\n\n(a)\n\n(b)\n\nthe defendant has previously been convicted of any offence and there\nare  any  charges  pending  against  the  defendant  and  whether  the\ndefendant has been released on bail in respect of those charges; and\n\nwhere  the  attorney-at-law  on  behalf  of  the  defendant  submits  the\ninformation referred to in paragraph (a), whether in writing or orally,\nthe  defendant  shall  be  required  by  the  court  to  declare  whether  the\ndefendant confirms such information or not.\n\nThe record of bail proceedings, except the information in subsection (13)\n(14)\n(a), shall form part of the record of the trial of the defendant following upon such\nbail proceedings.\n\nWhere the defendant elects to testify during the course of bail proceedings\n(15)\nthe court shall inform the defendant that anything the defendant says, may be\nused  at  the  defendant’s  trial  and  such  evidence  becomes  admissible  in  any\nsubsequent proceedings.\n\n(16)\n\nA defendant who wilfully\n\n(a)\n\n(b)\n\nfails or refuses to comply with the provisions of subsection (13)(a); or\n\nfurnishes  the  court  with  false  information  required  in  terms  of\nsubsection (13)(b),\n\nshall be guilty of an offence and liable on summary conviction to a fine of $5 000\nor to imprisonment for 2 years.\n\nThe court may grant a defendant bail subject to conditions, which, in the\n\n(17)\ncourt's opinion, are in the interests of justice.\n\n\f15\n\nCourt to obtain evidence in bail proceedings\n\n7.\n\nIn bail proceedings the court\n\n(a)\n\n(b)\n\n(c)\n\nmay, in respect of matters that are not in dispute between the defence\nand the prosecution, acquire in an informal manner the information that\nis needed for its decision or order regarding bail;\n\nmay, in respect of matters that are in dispute between the defence and\nthe prosecution, require of the prosecution or the defence, as the case\nmay be, that evidence be adduced; and\n\nshall, where the prosecution does not oppose bail in respect of matters\nreferred to in Part II of the Schedule, require of the prosecution to place\non record the reasons for not opposing the bail application.\n\nPART III\n\nBAIL PROCEDURE\n\nRecord of decision as to bail\n\n8.(1)\n\nSubject to subsection (2), where\n\n(a)\n\n(b)\n\n(c)\n\na court or police officer grants bail to a defendant;\n\na court denies bail to a defendant;\n\na court or police officer appoints a time or place, or a court or police\nofficer appoints a different time or place, for a person granted bail to\nsurrender to custody;\n\n(d)\n\na court varies any conditions of bail or imposes conditions in respect\nof bail,\n\nthat court or police officer shall make a record of the decision in the prescribed\nmanner containing the prescribed particulars and, shall if requested to do so by\n\n\f16\n\nthe defendant, give the defendant a copy of the record of the decision as soon as\npracticable after the record is made.\n\nWhere bail is granted by endorsing a warrant of arrest for bail, the police\n(2)\nofficer who releases on bail the person arrested shall make the record required\nby subsection (1) instead of the Judge or magistrate who issued the warrant.\n\n(3)\n\nIn this section \"prescribed\" means, in relation to the decision of\n\n(a)\n\n(b)\n\na court, prescribed by rules made under this Act;\n\na police officer, prescribed by the direction of the Commissioner of\nPolice.\n\nReasons relating to bail\n\nA  magistrate's  court  shall,  in  order  to  enable  the  defendant  or  the\n9.(1)\npolice, as the case may be, to make an application respecting bail to the High\nCourt, give reasons for\n\n(a)\n\n(b)\n\n(c)\n\ndenying bail;\n\nimposing or varying conditions relating to the grant of bail;\n\ngranting bail over an objection to bail by the prosecution where the\ndefendant  is  charged  with  an  offence  punishable  by  a  term  of\nimprisonment of 5 years or more.\n\nA court referred to in subsection (1) shall give reasons for its decision, shall\n(2)\ninclude a note of those reasons in the record of the decision, and shall give a copy\nof that note to the police and the defendant.\n\nRight to apply to the High Court for bail\n\n10.(1)\nmagistrate shall,\n\nWhere  a  magistrate  denies  bail  to  an  unrepresented  defendant,  the\n\n(a)\n\n(b)\n\nif committing the defendant for trial to the High Court;\n\nif issuing a certificate under subsection (2); or\n\n\f(c)\n\nin any other case,\n\n17\n\ninform the defendant of the right to apply to the High Court to be granted bail.\n\n(2)\nWhere  in  criminal  proceedings,  after  hearing  full  argument  on  an\napplication  for  bail  from  the  defendant,  a  magistrate's  court  remands  the\ndefendant in custody under section 18, 32, 45 or 57 of the Magistrate's Courts\nAct, Cap. 116A, the court shall issue a certificate in the prescribed form that it\nhas heard full argument on the application before it refused the application, if\n\n(a)\n\n(b)\n\nthe court has not previously heard such argument on that application\nfrom the defendant; or\n\nthe court has previously heard such argument on the application from\nthe  defendant  but  it  is  satisfied  that  there  has  been  a  change  in  the\ndefendant’s circumstances or that new considerations have been placed\nbefore it.\n\nWhere the court issues a certificate under subsection (2)(b), it shall state\n(3)\nin  the  certificate  the  nature  of  the  change  of  the  circumstances  or  the  new\nconsiderations which caused it to hear a further fully argued bail application.\n\nWhere the court issues a certificate under subsection (2), it shall cause the\n\n(4)\ndefendant to be given a copy of the certificate.\n\n(5)\n\nIn this section \"prescribed\" means prescribed by rules made under this Act.\n\nBail in the case of persons charged with an offence set out in Schedule\n\n11.(1)\nAn application for bail by a person who is charged with an offence\nmentioned in Part I or Part II of the Schedule shall be heard by the Chief Justice\nor a Judge of the High Court assigned by the Chief Justice.\n\nAn  application  for  bail  by  a  person  referred  to  in  subsection  (1)  for  an\n(2)\noffence referred to in that subsection shall not be heard by the High Court unless\n\n(a)\n\na period of 72 hours has expired after the application for bail is made\nto the Court; and\n\n\f18\n\n(b)\n\nthe Court is satisfied that notice of the application was served on the\nprosecution.\n\n(3)\nWhere bail is granted by the High Court to a person in the circumstances\nmentioned in subsection (2), the Chief Justice or Judge, as the case may be, shall,\nat the time of making the decision,\n\n(a)\n\n(b)\n\ngive reasons in writing for the decision; and\n\ngive a copy of the reasons for the decision to the defendant and the\nprosecution.\n\nWhere bail is granted by the High Court to a defendant under this section,\n(4)\nthere shall be a right of appeal by the prosecution to the Court of Appeal against\nthe decision of the Court.\n\nAn appeal to the Court of Appeal under subsection (4) shall be heard by\n(5)\nthe Chief Justice or by a Justice of Appeal assigned by the Chief Justice as is\nappropriate in the particular circumstances and the decision of such judge shall\nbe final.\n\nPowers of the High Court in relation to bail\n\n12.(1)\nadmission of persons to bail,\n\nNotwithstanding any power of the High Court to admit or direct the\n\n(a)\n\n(b)\n\nthe High Court may grant bail where a person has been committed in\ncustody to the High Court for trial or sentence; or\n\nthe High Court may grant bail or vary the conditions of bail where the\nmagistrate's court denies bail or imposes conditions in granting bail.\n\nWhere the High Court grants bail to a defendant under subsection (1), it\n(2)\nmay direct the defendant to appear at a time and place which the magistrate's\ncourt could have directed, and the recognizance of any surety shall be conditioned\naccordingly.\n\nWhere the High Court denies bail to a defendant under subsection (1), and\n(3)\nthe defendant is not then in custody, the court shall issue a warrant for the arrest\n\n\f19\n\nof the defendant, and the defendant shall be brought before a magistrate's court\nand shall be remanded in custody.\n\nPART IV\n\nCONDITIONS OF BAIL\n\nGeneral provisions relating to bail\n\n13.(1)\n\nA defendant granted bail shall surrender to custody.\n\nA defendant may be required to give security for surrender to custody, or\n(2)\nthe  security  may  be  given  on  the  defendant’s  behalf,  if  it  appears  that  the\ndefendant is unlikely to remain in Barbados until the time appointed for surrender\nto custody.\n\n(3)\n\nA court may require any defendant applying for bail to\n\n(a)\n\nprovide,  as  a  condition  for  bail  before  release,  a  surety  to  secure\nsurrender to custody;\n\n(b)\n\nsurrender the defendant’s passport to the court;\n\n(c)\n\ninform the court if the defendant intends to leave the jurisdiction;\n\n(d)\n\nreport to any police station at specified times.\n\nA defendant may be ordered by a court to comply with any requirement\n\n(4)\nthat is in the opinion of the court necessary to secure that the defendant\n\n(a)\n\n(b)\n\n(c)\n\nsurrenders to custody;\n\ndoes not commit an offence while on bail;\n\ndoes not interfere with witnesses or otherwise obstruct the course of\njustice whether in relation to himself or any other person; or\n\n\f20\n\n(d)\n\nis  available  for  the  purpose  of  enabling  inquiries  or  a  report  of  any\nmedical examination to be made to assist the court in dealing with him\nfor the offence.\n\n(5)\nIf a parent or guardian of a child consents to be a surety for the child for\nthe purposes of this subsection, the parent or guardian may be required to ensure\nthat the child complies with any requirement imposed on the child by virtue of\nsubsection (4), but\n\n(a)\n\n(b)\n\nno requirement shall be imposed on the parent or the guardian of a child\nby virtue of this subsection where it appears that the child will attain\nthe age of 18 years before the time to be appointed for the child to\nsurrender to custody; and\n\nthe parent or guardian shall not be required to secure compliance with\nany requirement to which the parent’s or guardian’s consent does not\nextend and shall not, in respect of those requirements to which consent\ndoes extend, be bound in a sum greater than $500.\n\nAny court before which a charge is pending in respect of which bail has\n(6)\nbeen granted, whether subject to conditions or unconditionally, may, at any stage,\nwhether the bail was granted by that court or any other court, on application by\nthe prosecutor, or by or on behalf of the defendant, add any further condition of\nbail\n\n(a)\n\nwith regard to the reporting in person by the defendant at any specified\ntime and place to any specified person or authority;\n\n(b)\n\nwith regard to any place to which the defendant is forbidden to go;\n\n(c)\n\n(d)\n\nwith regard to the prohibition of or control over communication by the\ndefendant with witnesses for the prosecution;\n\nwith regard to the place at which any document may be served on him\nunder this Act;\n\n\f21\n\n(e)\n\nwhich,  in  the  opinion  of  the  court,  will  ensure  that  the  proper\nadministration of justice is not placed in jeopardy by the release of the\ndefendant;\n\n(f)\n\nwhich provides that the defendant shall be placed under the supervision\nof a probation officer.\n\nThis  section  is  subject  to  section  57(2)  of  the  Magistrate's  Courts  Act,\n\n(7)\nCap. 116A.\n\nExceptions to section 13 conditions\n\n14.\nsection 13 shall not be imposed on him\n\nWhere  the  defendant  is  granted  bail,  the  conditions  mentioned  in\n\n(a)\n\n(b)\n\non an application for bail; or\n\non an application to vary the conditions of bail\n\nunless the court considers that it is necessary to do so for the purpose of preventing\nthe  occurrence  of  any  of  the  events  mentioned  in  section  13(4)  or  to  enable\ninquiries or a report to be made into the defendant's physical or mental condition.\n\nBail with sureties\n\n15.(1)\nhe provides a surety.\n\nThis section applies where a person is granted bail on condition that\n\nIn  considering  the  suitability  of  a  proposed  surety,  the  court  shall  have\n\n(2)\nregard amongst other things to\n\n(a)\n\n(b)\n\n(c)\n\nthe surety's financial resources;\n\nthe surety's character and any previous convictions of the surety; and\n\nthe surety's proximity, whether in point of kinship, place of residence\nor otherwise to the defendant.\n\n\f22\n\n(3)\n\nWhere a court grants bail to a defendant under subsection (1), but\n\n(a)\n\nis unable to release the defendant because no surety or suitable surety\nis available, the court may fix the amount in which the surety is to be\nbound; and subsections (4), (5) and (6) shall apply for the purpose of\nenabling the recognizance of the surety to be entered into subsequently;\nor\n\n(b)\n\nhas committed the defendant to custody in default of finding a surety,\nthe court may, on application by or on behalf of the person committed\nand after hearing fresh evidence,\n\n(i)\n\nreduce the amount in which it is proposed that any surety should\nbe bound;\n\n(ii)\n\ndispense with any sureties; or\n\n(iii)\n\notherwise deal with the case as the court thinks fit.\n\nA recognizance of a surety under subsection (2) may be entered into before\n(4)\nsuch persons or descriptions of persons as the court may specify or, if it makes\nno such order, before any of the following persons:\n\n(a)\n\nwhere the decision was taken by a magistrate, before the magistrate or\na police officer who is either of the rank of inspector or above or is in\ncharge of a police station or if the Magistrate's Courts Rules so provide,\nby a person of such other description as is specified in the rules;\n\n(b)\n\nwhere the decision is taken by the High Court, before the Registrar or\nsuch other officer as may be specified by rules made under this Act.\n\n(5)\n\nRules made under this Act may prescribe\n\n(a)\n\n(b)\n\n(c)\n\nthe manner in which a recognizance is to be entered into;\n\nthe persons by whom a recognizance may be enforced; and\n\nthe manner in which the recognizance may be enforced.\n\n\f23\n\n(6)\nWhere a surety seeks to enter into a recognizance before any person in\naccordance  with  subsection  (4)  but  that  person  declines  to  take  the  surety's\nrecognizance because the person is not satisfied of the surety's suitability, the\nsurety may apply to\n\n(a)\n\nthe court that fixed the amount of the recognizance in which the surety\nwas to be bound; or\n\n(b)\n\na magistrate for the district in which the surety resides\n\nfor that court or magistrate to take the recognizance; and that court or magistrate\nshall, if satisfied of the surety's suitability, take the recognizance.\n\nWhere, in pursuance of subsection (4) or (5), a recognizance is entered into\n(7)\notherwise than before the court that fixed the amount of the recognizance, the\nsame consequences shall follow as if it had been entered into before that court.\n\nFailure by defendant to observe condition of bail\n\nIf a defendant is released on bail subject to any condition imposed\n16.(1)\nunder section 6 or 13, including any amendment of a condition of bail, and the\nprosecutor applies to the court before which the charge with regard to which the\ndefendant has been released on bail is pending, to lead evidence to prove that the\ndefendant  has  failed  to  comply  with  such  condition,  the  court  shall,  if  the\ndefendant is present and denies that the defendant failed to comply with such\ncondition or that failure to comply with such condition was due to fault on the\ndefendant’s  part,  proceed  to  hear  such  evidence  as  the  prosecutor  and  the\ndefendant may place before it.\n\nIf the defendant is not present when the prosecutor applies to the court\n(2)\nunder subsection (1), the court may issue a warrant for the arrest of the defendant,\nand  shall,  when  the  defendant  appears  before  the  court  and  denies  that  the\ndefendant failed to comply with the condition in question or that failure to comply\nwith such condition was due to fault on the defendant’s part, proceed to hear such\nevidence as the prosecutor and the defendant may place before it.\n\n\f24\n\n(3)\nIf  the  defendant  admits  that  the  defendant  failed  to  comply  with  the\ncondition in question or if the court finds that the defendant failed to comply with\nsuch condition, the court may, if it finds that the failure by the defendant was due\nto  fault  on  the  defendant’s  part,  revoke  the  bail  and  declare  the  bail  money\nforfeited to the State.\n\n(4)\n\nThe proceedings and the evidence under this section shall be recorded.\n\nRevocation of bail\n\nAny court before which a charge is pending in respect of which bail\n17.\nhas  been  granted  may,  whether  the  defendant  has  been  released  or  not,  upon\ninformation on oath that\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\nthe defendant is about to evade justice or is about to abscond in order\nto evade justice;\n\nthe defendant has interfered or threatened or attempted to interfere with\nwitnesses;\n\nthe defendant has defeated or attempted to defeat the ends of justice;\n\nthe defendant poses a threat to the safety of the public or of a particular\nperson;\n\nthe  defendant  has  not  disclosed  or  has  not  correctly  disclosed  all\nprevious  convictions  in  the  bail  proceedings  or  where  a  true  list  of\nprevious convictions has come to light after release on bail;\n\nfurther  evidence  has  since  become  available  or  factors  have  arisen,\nincluding the fact that the defendant has furnished false information in\nthe bail proceedings, which might have affected the decision to grant\nbail; or\n\n(g)\n\nit is in the interests of justice to do so,\n\nissue a warrant for the arrest of the defendant and make such order as it may deem\nproper,  including  an  order  that  the  bail  be  revoked  and  that  the  defendant  be\ncommitted to prison until the conclusion of the relevant criminal proceedings.\n\n\f25\n\nForfeiture of security\n\n18.(1)\nWhere a person has given security in pursuance of section 13(2) and\na court is satisfied that the person failed to surrender to custody, then, unless it\nappears that the person had reasonable cause for the failure or there are other\nmitigating circumstances, the court may order the forfeiture of the security.\n\nWhere the court orders the forfeiture of a security under subsection (1), the\n(2)\ncourt may declare that the forfeiture extends to such amount less than the full\nvalue of the security as it thinks fit to order.\n\nAn order under subsection (1) shall, unless previously revoked, take effect\n\n(3)\nat the end of 21 days beginning with the day on which it is made.\n\nA court which has ordered the forfeiture of a security under subsection (1)\n\n(4)\nmay, if satisfied on an application made by the defendant or a surety that\n\n(a)\n\nthe defendant did after all have reasonable cause for failure to surrender\nto custody; or\n\n(b)\n\nthere are other mitigating circumstances which should be considered,\n\nremit the forfeiture or declare that the forfeiture extends to such amount less than\nthe full value of the security as it thinks fit to order.\n\nAn application under subsection (4) may be made before or after the order\n(5)\nfor  forfeiture  has  taken  effect,  but  shall  not  be  entertained  unless  the  court  is\nsatisfied  that  the  prosecution  was  given  reasonable  notice  of  the  applicant's\nintention to make it.\n\nA security that has been ordered to be forfeited by a court under subsection\n\n(6)\n(1) shall, to the extent of the forfeiture,\n\n(a)\n\n(b)\n\nif it consists of money, be accounted for and paid in the same manner\nas a fine imposed by that court would be; or\n\nif it does not consist of money, be enforced by the magistrate's court\nin the manner specified in the order.\n\n\f26\n\n(7)\nWhere an order is made under subsection (4) after an order for forfeiture\nof the security in question has taken effect, any money forfeited shall be paid\nover to the person who gave the security.\n\nPART V\n\nMISCELLANEOUS\n\nAbsconding\n\n19.(1)\nperson\n\n(a)\n\n(b)\n\nA person who has been released on bail is guilty of an offence if the\n\nfails without reasonable cause to surrender to custody; or\n\nhaving  reasonable  cause  for  not  surrendering  to  custody,  fails  to\nsurrender to custody at the appointed place as soon after the appointed\ntime as is reasonably practicable.\n\nIt  shall  be  for  the  defendant  to  adduce  evidence  that  the  defendant  had\n\n(2)\nreasonable cause for failing to surrender to custody.\n\nA failure to give to a person granted bail a copy of the decision shall not\n\n(3)\nconstitute a reasonable cause for the person’s failure to surrender to custody.\n\nA person guilty of an offence under subsection (1), is liable on summary\n\n(4)\nconviction to a fine of $5 000 or to imprisonment for 2 years or to both.\n\nIn  any  proceedings  for  an  offence  under  subsection  (1),  a  document\n(5)\npurporting to be a copy of the part of the prescribed record that relates to the time\nand place appointed for the person specified in the record to surrender to custody\nand to be duly certified to be a true copy of that part of the record shall be evidence\nof the time and place appointed for that person to surrender to custody.\n\n\f(6)\n\nFor the purposes of subsection (5),\n\n27\n\n(a)\n\n(b)\n\nthe \"prescribed record\" means the record of the decision of the court\nor police officer made in pursuance of section 8;\n\nthe copy of the prescribed record is duly certified if it is certified by\nthe appropriate officer of the court or, as the case may be, by the police\nofficer  who  took  the  decision  or  a  police  officer  designated  for  the\npurpose by the officer in charge of the police station from which the\nperson to whom the record relates was released;\n\n(c)\n\nthe \"appropriate officer\" means the clerk to the magistrate’s court or\nsuch  other  officer  as  may  be  authorized  by  the  magistrate  for  the\npurpose.\n\nArrest for absconding etc.\n\nWhere a person who has been released on bail and is under a duty to\n20.(1)\nsurrender to custody of a court fails to surrender to custody at the time and place\nappointed to do so, the court may issue a warrant for the person’s arrest.\n\n(2)\nWhere a person who has been released on bail fails to attend court at any\ntime after the person has surrendered to the custody of the court and before the\ncourt is ready to begin or to resume the hearing of the proceedings, the court may\nissue a warrant for the person’s arrest; but no warrant shall be issued under this\nsubsection if that person is absent in accordance with leave given by the court.\n\nA person who has been released on bail and is under a duty to surrender\n(3)\ninto the custody of the court may be arrested without warrant by a police officer\n\n(a)\n\n(b)\n\nif  the  police  officer  has  reasonable  grounds  for  believing  that  that\nperson is not likely to surrender to custody;\n\nif  the  police  officer  has  reasonable  grounds  for  believing  that  that\nperson  is  likely  to  break  any  of  the  conditions  of  his  bail,  or  has\nreasonable grounds for suspecting that that person has broken any of\nthose conditions;\n\n\f28\n\n(c)\n\nin a case where that person was released on bail with a surety, if a surety\nnotifies the police in writing that the person is unlikely to surrender to\ncustody and that for that reason the surety wishes to be relieved of the\nobligations as a surety; or\n\n(d)\n\nif new evidence justifying a further arrest has come to light since the\nperson’s release.\n\n(4)\n\nWhere in pursuance of subsection (3)\n\n(a)\n\n(b)\n\na person is arrested, that person shall be brought as soon as practicable\nand in any event within 24 hours after arrest, before a magistrate for\nthe district in which the person is arrested;\n\na person is arrested within 24 hours of the time appointed for the person\nto  surrender  to  custody,  the  person  shall  be  brought  without  delay\nbefore the court at which the person is to surrender to custody.\n\nIn reckoning any period of 24 hours for the purposes of subsection (4), no\n\n(5)\naccount shall be taken of Christmas Day, Good Friday or any Sunday.\n\nA magistrate before whom a person is brought under subsection (4) may,\n(6)\nsubject to subsection (7), if of the opinion that that person is not likely to surrender\nto custody or has broken or is likely to break any condition of bail,\n\n(a)\n\n(b)\n\n(c)\n\nremand the person in custody;\n\ncommit the person to custody; or\n\ngrant the person bail subject to the same or to different conditions,\n\nbut if not of that opinion shall grant the person bail subject to the same conditions,\nif any, as were originally imposed.\n\n(7)\nWhere  the  person  brought  before  the  magistrate  is  a  child  and  the\nmagistrate does not grant bail, subsection (6) shall have effect subject to section\n21.\n\n\f29\n\nBail of children\n\n21.(1)\nWhere the child referred to in section 20(7) is apprehended with or\nwithout warrant and cannot be brought forthwith before a court sitting to hear\ncharges against children, any police officer not below the rank of sergeant or the\nofficer in charge of the police station to whom the child is brought shall enquire\ninto the case and may in any case, and\n\n(a)\n\n(b)\n\n(c)\n\nunless the charge is one for an offence set out in the Schedule;\n\nunless it is necessary in the interest of the child to remove the child\nfrom association with any undesirable person; or\n\nunless  the  officer  has  reason  to  believe  that  the  release  of  the  child\nwould not be in the interests of justice,\n\nshall release such person on a recognizance, with or without sureties for such\namount as will, in the opinion of the officer, secure the attendance of the child\nupon the hearing of the charge.\n\nWhere a child, having been apprehended, is not released under subsection\n(2)\n(1), the police officer shall cause the child to be detained at a Reformatory and\nIndustrial  School  until  the  child  can  be  brought  before  a  court  sitting  to  hear\ncharges against children, unless the officer certifies\n\n(a)\n\n(b)\n\n(c)\n\nthat it is impracticable to do so;\n\nthat the child is of so unruly a character that the child cannot safely be\ndetained; or\n\nthat by reason of the child’s state of health or mental condition it is\ninadvisable to detain the child,\n\nand the certificate shall be produced to the court before which he is brought.\n\nAppeal to superior court with regard to bail\n\n22.(1)\nA defendant who is aggrieved by the refusal of a lower court to admit\nthe defendant to bail or by the imposition by such court of a condition of bail,\n\n\f30\n\nincluding  a  condition  relating  to  the  amount  of  bail,  or  an  amendment  of  a\ncondition of bail, may appeal against such refusal or imposition to a superior\ncourt.\n\nAn appeal from a lower court under subsection (1) lies to the High Court\n(2)\nor the Court of Appeal, as the case requires, and in the case of the Court of Appeal\nmay be heard by a single judge that court.\n\nA decision under subsection (2) by the High Court or the Court of Appeal\n\n(3)\nas the case may be shall be final.\n\nAn appeal shall not lie in respect of new facts which arise or are discovered\n(4)\nafter the decision against which the appeal is brought, unless such new facts are\nfirst placed before the lower court and such court gives a decision against the\ndefendant on such new facts.\n\nThe defendant shall serve a copy of the notice of appeal on the Director of\n(5)\nPublic Prosecutions and on the magistrate, or on the Registrar in the case of the\nHigh  Court,  and  the  magistrate  or  judge,  as  the  case  may  be,  shall  forthwith\nfurnish the reasons for the decision to the Registrar.\n\nThe judge hearing the appeal shall not set aside the decision against which\n(6)\nthe appeal is brought, unless such judge is satisfied that the decision was wrong,\nin which case the judge shall give the decision which in the judge’s opinion the\nlower court should have given.\n\nProsecution right of appeal\n\n23.(1)\nIn proceedings before a magistrate’s court in which a person who is\ncharged with an offence punishable by a term of imprisonment of 5 years or more\nis granted bail, there shall be a right of appeal by the prosecution to a Judge of\nthe  High  Court  against  the  decision  of  the  magistrate’s  court  to  grant  bail,  if\nobjection to the granting of bail is made by the prosecution before the magistrate’s\ncourt grants such bail.\n\n\f31\n\nWhere  the  prosecution  wishes  to  exercise  the  right  of  appeal  set  out  in\n\n(2)\nsubsection (1),\n\n(a)\n\n(b)\n\noral  notice  of  appeal  shall  be  given  to  the  magistrate’s  court  at  the\nconclusion of the proceedings in which such bail has been granted and\nbefore the release from custody of the person concerned; and\n\nwritten notice of appeal shall thereafter be served on the magistrate’s\ncourt and the person concerned within one hour of the conclusion of\nsuch proceedings.\n\nUpon receipt from the prosecution of oral notice of appeal from its decision\n(3)\nto grant bail the magistrate’s court shall remand in custody the person concerned,\npending the hearing of such appeal.\n\nThe hearing of an appeal under subsection (1) against a decision of the\n(4)\nmagistrate’s court to grant bail shall be commenced within 5 days, excluding\ncourt holidays and weekends, from the date on which oral notice of appeal is\ngiven.\n\nAt the hearing of any appeal by the prosecution under this section such\n\n(5)\nappeal shall be by way of rehearing.\n\nPayment of bail money by third person\n\n24.(1)\nNothing in this Act or any other enactment shall prevent the payment\nby  any  person,  other  than  the  defendant,  of  bail  money  for  the  benefit  of  the\ndefendant.\n\nBail money, whether deposited by the defendant or any other person for\n(2)\nthe benefit of the defendant, shall, notwithstanding that such bail money or any\npart thereof may have been ceded to any person, be refunded only to the defendant\nor the depositor, as the case may be.\n\nNo person shall be allowed to deposit for the benefit of a defendant any\n(3)\nbail money in terms of this section if the official concerned has reason to believe\nthat such person, at any time before or after depositing such bail money, has been\nindemnified or will be indemnified by any person in any manner against loss of\n\n\f32\n\nsuch bail money or that he has received or will receive any financial benefit in\nconnection with the deposit of such bail money.\n\nRules\n\n25.\n\n(a)\n\n(b)\n\nSavings\n\nThe Rules Committee may make rules\n\ngenerally for giving effect to this Act; and\n\nfor prescribing anything that is authorized or required to be prescribed\nby this Act.\n\nThe  Bail  Rules,  2001  (S.I.  2001  No.  23)  made  under  the  Bail  Act,\n26.(1)\nCap. 122A, shall continue in force as if made under this Act in so far as they are\nconsistent with this Act and shall have effect as if made under this Act, until\nrevoked.\n\n(2)\n\nNothing in this Act affects bail granted under the Bail Act, Cap. 122A.\n\nTransitional\n\n27.\ncommencement of this Act shall continue to be dealt with under that Act.\n\nProceedings  begun  under  the  Bail  Act,  Cap.  122A  before  the\n\nRepeal of Cap. 122A\n\n28.\n\nThe Bail Act, Cap. 122A is repealed.\n\n\f33\n\nSCHEDULE\n\nOFFENCES\n\nPART I\n\n(Sections 6, 7 and 11)\n\nOffences for which bail may be granted if exceptional circumstances are shown\n\n1.\nthe Person Act, Cap. 141\n\nMurder committed in circumstances set out in section 2(2) of the Offences against\n\n2.\n\n3.\n\nTreason\n\nHigh treason\n\n4.\nimprisonment for 10 years or more.\n\nAn  offence  under  the  Firearms  Act,  Cap.  179,  which  is  punishable  with\n\nPART II\n\nOffences for which bail may be granted in the interest of justice\n\n1.\nofficial duties.\n\nMurder  committed  in  circumstances  connected  with  the  discharge  of  a  person’s\n\n2.\ndefendant did not commit the offence with which he is charged.\n\nWhere the court is of the view that the strength of the evidence suggests that the\n\n3.\nable to rely on the defence of self defence.\n\nWhere the court is satisfied on the evidence presented that the defendant would be\n\n\f34\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}