{
  "bill_id": 794,
  "slug": "foreign-currency-permits-bill-2024",
  "title": "Foreign Currency Permits Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/d8ebfba93a40bfb9934342cec124d6e5.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2025-01-29",
  "first_reading": "2025-02-05",
  "gazette_date": "2024-07-31",
  "markdown": "2025-01-28\n\nBill as amended\n\nOBJECTS AND REASONS\n\nThis Bill would\n\n(a)\n\n(b)\n\nrepeal  and  replace  the  Foreign  Currency  Permits  Act,  2018\n(Act 2018-44);\n\nmake better provision for the grant of a foreign currency permit to any\nqualified person that earns 100 per cent of its annual income in foreign\ncurrency; and\n\n(c)\n\nprovide for related matters.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nShort title\n\nInterpretation\n\nPART II\n\nAPPLICATION FOR AND GRANT OF PERMIT\n\nApplication for permit\n\nGrant or renewal of foreign currency permit\n\nCancellation or refusal of permit\n\nAppeal\n\nSurrender of permit\n\nValidity of permit\n\nPART III\n\nMISCELLANEOUS\n\n9.\n\nExemption\n\n\f3\n\n10.\n\nMachinery, equipment etc exempt from certain taxes and duties\n\n11.\n\nRecord and inspection of machinery and equipment\n\n12.\n\nFees\n\n13.\n\nRegulations\n\n14.\n\nAmendment of Schedules\n\n15.\n\nRepeal of Act 2018-44\n\n16.\n\nCommencement\n\nFIRST SCHEDULE\n\nDeclaration Form\n\nSECOND SCHEDULE\n\nFees\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to make better provision for the grant of a foreign currency permit\nto any qualified person that earns 100 per cent of its annual income in foreign\ncurrency and for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Foreign Currency Permits Act, 2025.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“company”\n\n(a)\n\n(b)\n\nhas the meaning assigned to it by section 2(1)(b) of the Companies\nAct, Cap. 308; and\n\nincludes a shipping corporation within the meaning of the Shipping\nCorporations Act, Cap. 296B;\n\n“Comptroller” has the meaning assigned to it by section 2 of the Customs Act,\n\n2021 (Act 2021-34);\n\n“Director” means the Director of International Business;\n\n“external  company”  has  the  meaning  assigned  to  it  by  section  252(2)  of  the\n\nCompanies Act, Cap. 308;\n\n“firm”  has  the  meaning  assigned  to  it  by  section  6  of  the  Partnership  Act,\n\nCap. 313;\n\n“foreign currency” has the meaning assigned to it by section 2(1) of the Exchange\n\nControl Act, Cap. 71;\n\n“foreign currency permit” or “permit” means the document granted to a qualified\n\nperson by the Director;\n\n“qualified person” means a company, an external company, a firm, a society or\na trustee in relation to a trust, where the company, external company, firm,\n\n\f7\n\nsociety or trust, as the case may be, earns 100 per cent of its income in foreign\ncurrency;\n\n“service provider” has the meaning assigned to it by section 2 of the Corporate\n\nand Trust Service Providers Act, 2015 (Act 2015-12);\n\n“society” has the meaning assigned to it by section 2(d) of the Societies With\n\nRestricted Liability Act, Cap. 318B;\n\n“trust” means a trust registered under the Trusts (Miscellaneous Provisions) Act,\n\n2018 (Act 2018-49).\n\nPART II\n\nAPPLICATION FOR AND GRANT OF PERMIT\n\nApplication for permit\n\n3.(1)\napply to the Director for the grant of a foreign currency permit.\n\nA  qualified  person  may,  in  such  form  as  the  Director  determines,\n\n(2)\n\nAn application made under subsection (1) shall contain the following:\n\n(a)\n\n(b)\n\n(c)\n\ndetails of the registered office, where applicable;\n\ndetails of the service provider, where applicable;\n\ndetails of the auditor;\n\n(d)\n\nthe date of the end of the financial year;\n\n(e)\n\nthe number of persons to be employed who require work permits;\n\n(f)\n\n(g)\n\nthe positions to be held by the persons who require work permits;\n\nthe name, address and official corporate number or registration number\nassigned to every related entity carrying on business, which is licensed,\nincorporated, registered or organized in Barbados;\n\n\f8\n\n(h)\n\n(i)\n\n(j)\n\na list of the activities in which the qualified person will engage and a\nfull description of the business that it intends to carry on;\n\nthe academic qualifications, training, experience, corporate status and\ndescription  of  the  business  of  every  director  and  manager,  where\napplicable;\n\nwhether  any  senior  member  of  staff  or  manager  has  ever  in,  any\ncountry, been convicted of a criminal offence involving fraud or any\nother offence of dishonesty, money laundering or insider trading; and\n\n(k)\n\nwhether any senior member of staff or manager has been investigated\nby a regulatory body in any country.\n\nAn application for the grant or renewal of a permit must be accompanied\n\n(3)\nby\n\n(a)\n\n(b)\n\nthe prescribed fee which shall be non-refundable; and\n\na declaration in the form set out in the First Schedule\n\n(i)\n\ncertifying  that  the  audited  annual  financial  statements  of  the\napplicant for the financial year immediately preceding the year of\napplication disclose that 100 per cent of the applicant’s income for\nthat year was earned in foreign currency; or\n\n(ii)\n\nin the case of an initial application, certifying that the entity intends\nto earn 100 per cent of its income in foreign currency.\n\nAn applicant under subsection (1) shall satisfy such other conditions as the\n\n(4)\nDirector may require.\n\nGrant or renewal of foreign currency permit\n\n4.\nor as the case may be, renew the permit.\n\nWhere the applicant complies with section 3, the Director may grant,\n\n\f9\n\nCancellation or refusal of permit\n\n5.(1)\n\nWhere a qualified person\n\n(a)\n\n(b)\n\nfails to comply with any condition of its permit imposed pursuant to\nsection 3;\n\nfails to comply with or ceases to satisfy any requirement of this Act;\nor\n\n(c)\n\nknowingly\n\n(i)\n\nmakes an untrue statement of a material fact;\n\n(ii)\n\nomits to state a material fact; or\n\n(iii)\n\nmakes a statement containing information that is misleading,\n\nthe Director shall refuse to grant that person a permit or where that permit has\nalready been granted, cancel or refuse to renew it.\n\nThe Director may also refuse to grant a permit or may cancel or refuse to\n\n(2)\nrenew a permit on the ground of public policy.\n\nThe  Director  shall  give  a  qualified  person  notice  in  writing  where  the\n\n(3)\nDirector intends to\n\n(a)\n\n(b)\n\nrefuse to grant a permit; or\n\ncancel or refuse to renew a permit,\n\nand shall include in the notice, the reason for the decision.\n\nA notice given under this section shall specify that the qualified person\n(4)\nmay  within  21  days  of  the  date  of  the  notice  inform  the  Director  of  any\nobjections.\n\nWhere the Director is satisfied that the qualified person has met all of the\n(5)\nconditions for the grant or renewal of the permit, the Director may withdraw the\nnotice referred to in subsection (3).\n\n\f10\n\n(6)\nWhere the Director is not satisfied that the qualified person has met all of\nthe  conditions,  the  Director  may  cancel  or  refuse  the  permit  and  notify  the\nqualified person of the decision.\n\nAppeal\n\nA qualified person who is aggrieved by the decision of the Director\n6.\nto cancel or refuse to renew a permit, may within 30 days of being notified of the\ncancellation or refusal to renew by the Director, appeal to a Judge in chambers.\n\nSurrender of permit\n\n7.\n\nA qualified person to whom a permit has been granted may,\n\n(a)\n\n(b)\n\nby a resolution of the Board of Directors; or\n\nwhere there is no Board of Directors, by the request of\n\n(i)\n\nan officer of the holder of a foreign currency permit; or\n\n(ii)\n\na trustee, in respect of a trust,\n\nsurrender the permit by filing a declaration with the Director.\n\nValidity of permit\n\n8.\nthe Director.\n\nA permit remains valid for 12 months unless cancelled or revoked by\n\nPART III\n\nMISCELLANEOUS\n\nExemption\n\n9.\nperson granted a permit under this Act.\n\nThe  Exchange  Control  Act,  Cap.  71  does  not  apply  to  a  qualified\n\n\f11\n\nMachinery, equipment etc exempt from certain taxes and duties\n\n10.(1)\nSubject to subsection (2), a holder of a foreign currency permit which\nis engaged exclusively in the trade of services may import free of customs duty,\nvalue added tax, ad valorem stamp duty and other like duties, taxes and imposts,\nsuch plant, machinery, equipment, fixtures, appliances, apparatus, tools and spare\nparts,  and  such  raw  materials,  goods,  components  and  other  articles,  as  are\nnecessary for the holder of the permit to carry on its business.\n\nThe goods referred to in subsection (1) may only be imported free of the\n(2)\nduties, taxes and other imposts referred to in that subsection where the Secretary,\nManaging Director or other similar officer of the holder of the foreign currency\npermit, or in respect of a trust, a trustee, certifies to the Comptroller that the goods\nare  imported  for  use  exclusively  in  the  business  of  the  holder  of  the  foreign\ncurrency permit.\n\nWhere a holder of a foreign currency permit imports under this section any\n(3)\nmaterials, goods or articles free of any duty, tax or other imposts, those materials,\ngoods, or articles shall not be sold or disposed of otherwise than in the ordinary\ncourse of the business of the holder of the permit, until after the expiration of 5\nyears from the date of importation, unless\n\n(a)\n\n(b)\n\nthe sale or disposition is to another holder of a foreign currency permit;\nor\n\nthe amount of duty, tax or other impost that would have been payable\nhad subsection (1) or (2) not applied is first paid to the Comptroller and\na certificate of such payment is issued by the Comptroller.\n\nNothing imported or purchased free of any duty, tax or other imposts under\n(4)\nthis  section  by  a  holder  of  a  foreign  currency  permit  shall,  without  the  prior\nwritten approval of the Minister responsible for Finance, be used for any purpose\nother than the purpose stated for customs when it was imported or purchased,\nunless it is subsequently acquired by another person pursuant to subsection (3).\n\n\f12\n\n(5)\nA person who contravenes any provision of this section commits an offence\nand is liable on summary conviction to a fine of $10 000 or to imprisonment for\na term of 2 years or to both.\n\nRecord and inspection of machinery and equipment\n\nA holder of a foreign currency permit which imports into Barbados or\n11.(1)\npurchases in Barbados any article in respect of which it has been granted relief\nfrom customs duty under section 10 shall comply with subsection (2).\n\n(2)\n\nA holder of a foreign currency permit referred to in subsection (1) shall\n\n(a)\n\n(b)\n\n(c)\n\nkeep a record of the articles so imported or purchased in such form,\nand containing such particulars, as the Comptroller requires;\n\ncause  the  articles  to  be  marked  in  such  manner  as  the  Comptroller\nrequires; and\n\npermit the Comptroller, or a person authorized by him for the purpose,\nto inspect at reasonable times such record, and to have access to any\nfactory or warehouse under its control, for the purpose of examining\nany  such  article  which  the  Comptroller  has  reason  to  believe  to  be\ntherein  and  of  satisfying  himself  of  the  accuracy  of  the  particulars\ncontained in the record.\n\nA holder of a foreign currency permit which contravenes this section is\n(3)\nguilty of an offence and liable on summary conviction to a fine of $10 000 or to\nimprisonment for a term of 2 years or to both.\n\nFees\n\n12.\nThe  fees  set  out  in  the  second  column  of  the  Second  Schedule  are\npayable  in  respect  of  the  matters  set  out  opposite  thereto  in  the  first  column\nthereof.\n\nRegulations\n\n13.\n\nThe Minister may make regulations for giving effect to this Act.\n\n\f13\n\nAmendment of Schedules\n\n14.\n\nThe Minister may by order amend the Schedules.\n\nRepeal of Act 2018-44\n\n15.\n\nThe Foreign Currency Permits Act, 2018 (Act 2018-44) is repealed.\n\nCommencement\n\n16.\nof January, 2019.\n\nThis Act shall be deemed to have come into operation on the 1st day\n\n\f14\n\nL.R.O. 1998FIRST SCHEDULE(Section 3(3))DECLARATIONI,ofdo hereby declare as follows:(a)that I am the [Secretary/Managing Director/Oﬃ  cer/Trustee] of the [company/proposed company/society/trust] and that I am authorized to make this declarationunder the Foreign Currency Permits Act, 2025 (Act 2025-  ) and the regulations;(b)that having made all reasonable enquiries, the information supplied to the Director ofInternational Business in connection with this application is, to the best of myknowledge and belief, accurate in material respects and does not omit any informationwhich might reasonably be considered relevant to the application; and(c)that the [company/proposed company/society/trust] [generates/will continue to generate] 100 per cent of its income in foreign currency.Dated this            day of, 20 .Name of DeclarantFull Address of DeclarantSignature of Declarant\f15\n\nL.R.O. 1998SECOND SCHEDULE(Section 12)FEESDescription of Fees1.Application for permit2.Permit3.Renewal of permitAmount $   250.00 1 000.00 1 000.00\f16\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2025.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2025.\n\nPresident\n\n"
}