{
  "bill_id": 797,
  "slug": "resolution-re-acquisition-of-land-at-trents-st-james-for-holetown-civic-centre",
  "title": "Resolution re Acquisition of land at Trents, St. James for Holetown Civic Centre",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/a2b5d8306aca95d18483fd392db3967a.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2025-01-18",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "# 2025-01-16\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the\n\nLand  Acquisition  Act,  Cap.  228  approve  the  compulsory  acquisition  by  the  State  of  the\n\nparcels  of  land  situate  at  Trents  in  the  parish  of  Saint  James  in  this  Island  and  more\n\nparticularly  described  in  the  Schedules  hereto  for  a  public  purpose,  namely  for  the\n\nrelocation of the Holetown Civic Centre.\n\nAPPROVED by the House of Assembly this\n\nday of\n\n# Two Thousand and Twenty-Five.\n\nSpeaker\n\n# APPROVED  by  the  Senate  this\n\nday  of\n\n# Two Thousand and Twenty-Five.\n\n,\n\n,\n\nPresident\n\n\f2\n\nFIRST SCHEDULE\n\nALL  THAT  that  land  the  property  of  Lila  E.  G.  Salazar  et  al  situate  at\n\nLot  3  Trents  in  the  parish  of  Saint  James  in  this  Island  containing  by  admeasurement\n\n16581.7  square  metres  or  thereabouts  (inclusive  of  155.6  square  metres  in  road  reserve)\n\nabutting  and  bounding  to  the  north  on  lands  now  or  late  of  Marcus  E.  Beckles  (Lot  2)  to\n\nthe east on a road reserve 7.92 metres wide to the south on lands now or formerly of Island\n\nDreams Inc. (Lot 4) to the west on lands now or late of Adrian C. Haynes (Lot 14) on lands\n\nnow  or  late  of  Juanita  Pir  (Lot  13)  on  lands  now  or  late  of  Marcus  E.  Beckles  (Lots  12,  11\n\nand  10)  or  however  else  the  same  may  abut  and  bound  as  shown  and  delineated  on  a  plan\n\ncertiﬁ ed on the 27th day of September, 2022 by Alex R. Chandler, Land Surveyor and recorded\n\non the 5th day of October, 2022 in the Land and Surveys Department as Plan number 1582/2022.\n\n\f3\n\nSECOND SCHEDULE\n\nALL THAT land the property of Island Dreams Inc. situate at Lot 4 Trents in\n\nthe parish of Saint James in this Island containing by admeasurement 16711.9 square metres or\n\nthereabouts (inclusive of 292.7 square metres in road reserve) abutting and bounding to the north\n\non lands now or late of Lila E. G. Salazar et al to the east on a road reserve 7.92 metres wide to\n\nthe south on lands now or formerly of Island Dreams Inc. (Lot 5) to the west on lands now or\n\nlate of Gloria L. Maynard (Lot 18) on lands now or formerly of Trents Limited (Lot 17) on lands\n\nnow or late of Grantley Iﬁ ll (Lot 16) on lands now or late of Ainsley Linora Lovell (Lot 15) or\n\nhowever else the same may abut and bound as shown and delineated on a plan certiﬁ ed on the\n\n27th day of September, 2022 by Alex R. Chandler, Land Surveyor and recorded on the 5th day of\n\nOctober, 2022 in the Land and Surveys Department as Plan number 1582/2022.\n\n\f4\n\nTHIRD SCHEDULE\n\n  ALL  THAT  land  the  property  of  Island  Dreams  Inc.  situate  at  Lot  5  Trents  in  the\n\nparish  of  Saint  James  in  this  Island  containing  by  admeasurement  16781.6  square  metres\n\nor  thereabouts  (inclusive  of  293.4  square  metres  in  road  reserve)  abutting  and  bounding\n\nto  the  north  on  lands  now  or  formerly  of  Island  Dreams  Inc.  (Lot  4)  to  the  east  on  a  road\n\nreserve 7.92 metres wide to the south on lands now or formerly of Island Dreams Inc. (Lot\n\n6) to the west on lands now or formerly of Trents Limited (Lot 23) on lands now or late of\n\nCardinal  Gibson  (Lot  22)  on  lands  now  or  late  of  Laura  Mary  Cridland  (Lot  21)  on  lands\n\nnow  or  late  of  Elsie  M.  Edwards  (Lot  20)  on  lands  now  or  late  of  Lorraine  L. Alleyne\n\n(Lot  19)  or  however  else  the  same  may  abut  and  bound  as  shown  and  delineated  on  a  plan\n\ncertiﬁ ed on the 27th day of September, 2022 by Alex R. Chandler, Land Surveyor and recorded\n\non the 5th day of October, 2022 in the Land and Surveys Department as Plan number 1582/2022.\n\n\f5\n\nFOURTH SCHEDULE\n\n           ALL THAT land the property of Island Dreams Inc. situate at Lot 6 Trents in\n\nthe parish of Saint James in this Island containing by admeasurement 24828.1 square metres\n\nor thereabouts (inclusive of 915.8 square metres in road reserve) abutting and bounding to the\n\nnorth on lands now or formerly of Island Dreams Inc. (Lot 5) to the east on a road reserve 7.92\n\nmetres wide to the south on a public road known as Highway C which leads to Highway 2A\n\nin one direction and to Highway 1 in the other direction to the west on lands now or late of\n\nLinette Davis (Lot 30) on lands now or late of Alison Ingrid Thomas (Lots 29A and 29B) on lands\n\nnow or late of Pernell Orlando Farley (Lot 28) on lands now or late of Ian S. Bovell (Lot 27) on\n\nlands now or late of Banele A. Serrano (Lot 26) on lands now or formerly of Trents Limited (Lots\n\n25 and 23) or however else the same may abut and bound as shown and delineated on a plan\n\ncertiﬁ ed on the 27th day of September, 2022 by Alex R. Chandler, Land Surveyor and recorded\n\non the 5th day of October, 2022 in the Land and Surveys Department as Plan number 1582/2022.\n\n\f6\n\nADDENDUM\n\nThe Cabinet at its meeting held on the 10th day of March, 2022 considered Note (22)\n\n(2) 122 MHLM 06 and agreed to the acquisition of four parcels of land situate at Trents in the\n\nparish of Saint James and more particularly described in the Schedules hereto for the relocation\n\nof the Holetown Civic Centre.\n\n  In accordance with the provisions of section 5 of the Lands Acquisition Act, Cap. 228,\n\nthe approval of Parliament is now sought for the compulsory acquisition of the parcels of land\n\ndescribed in the Schedules hereto in order that the public purpose set out in the Resolution may be\n\neﬀ ected and that the State may acquire an indefeasible title to the said parcels of land.\n\n"
}