{
  "bill_id": 798,
  "slug": "electricity-supply-bill-2024",
  "title": "Electricity Supply Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/295d6de8a8dba3edee81c8d330cb6d83.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2024-09-28",
  "first_reading": "2024-09-30",
  "gazette_date": null,
  "markdown": "2024-09-27\n\nBill as amended\n\nOBJECTS AND REASONS\n\nThis Bill would\n\n(a)\n\n(b)\n\nregulate the generation, storage, transmission, distribution, dispatch,\nsupply and sale of electricity; and\n\npromote local participation, competition and the adoption of energy\npractices and technologies in the electricity sector that are sustainable\nto enhance energy security, climate resiliency and ensure the reliability\nand affordability of services in the sector.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\nPART II\n\nADMINISTRATION\n\nShort title\n\nInterpretation\n\nObjectives of Act\n\nAct to bind State\n\nSystem planning\n\nTargets for supply of electricity from sources of renewable energy\n\nNew generation and storage capacity\n\nAdvisory Committee\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\nPART III\n\nLICENSING AND REGISTRATION\n\n9.\n\nRestrictions on certain electricity services without licence\n\n10.\n\nApplication for licence\n\n\f3\n\n11.\n\nIssue of licence\n\n12.\n\nTerms and conditions of licence\n\n13.\n\nLocal participation and investment\n\n14.\n\nRenewal of licence\n\n15.\n\nModification of licence\n\n16.\n\nSuspension and revocation of licence\n\n17.\n\nLicensee to notify of changes\n\n18.\n\nAssignment of licence\n\n19.\n\nState’s right to step-in\n\n20.\n\nRegistration of generation systems and storage systems\n\nPART IV\n\nINTERCONNECTION AND SALE OF ELECTRICITY TO PUBLIC UTILITY\n\n21.\n\nInterconnection\n\n22.\n\nAgreement on purchase of electricity by Public Utility\n\n23.\n\nPublic Utility not to unreasonably refuse agreement\n\nPART V\n\nDUTIES OF PARTICIPANTS IN THE ELECTRICITY SYSTEM\n\n24.\n\nPublic Utility obliged to provide service\n\n\f4\n\n25.\n\n26.\n\nOther participants to develop reliable and safe generation and storage\nsystems\n\nPublic Utility to implement integrated resources and resilience, and grid\nmodernization plans\n\n27.\n\nPublic Utility to keep separate accounts\n\n28.\n\nPublic Utility to report on activities\n\n29.\n\nSystem Operator’s functions\n\n30.\n\nSystem Operator’s departure from merit order\n\n31.\n\nSystem Operator to plan for major system failure\n\n32.\n\nAudit of System Operator’s activities\n\n33.\n\nLicensees to cooperate and comply with System Operator's directions\n\n34.\n\nWhere Public Utility is System Operator\n\nPART VI\n\nPOWERS, OBLIGATIONS AND RESTRICTIONS IN RESPECT OF\nELECTRICITY SUPPLY\n\n35.\n\nPower to break up streets etc.\n\n36.\n\nPower to alter positions of pipes and wires\n\n37.\n\nRestrictions on works above ground\n\n38.\n\nRestrictions on placement of electric lines etc.\n\n\f5\n\n39.\n\nRestrictions on use of electric lines\n\n40.\n\nService of section 37 or 38 notice\n\n41.\n\nPenalty for failure to comply with section 37 or 38 notice\n\n42.\n\nProtection of property of State, licensees and service providers\n\n43.\n\nUse of electricity\n\n44.\n\nPower of entry, inspection etc.\n\n45.\n\nDiscontinuation of electricity supply\n\n46.\n\nElectric lines not subject to distress in certain cases\n\n47.\n\nDamaging work with intent to cut off supply\n\n48.\n\nUnlawful abstraction or use of electricity\n\nPART VII\n\nCODES\n\n49.\n\nCodes\n\n50.\n\nCompliance with Codes\n\n51.\n\nChief Electrical Officer to verify technical compliance with Codes\n\nPART VIII\n\nELECTRICITY SYSTEM BENEFIT FUND\n\n52.\n\nEstablishment of Fund\n\n\f6\n\n53.\n\nApplication of Fund’s resources\n\n54.\n\nAdministration of Fund\n\nPART IX\n\nDECOMMISSIONING\n\n55.\n\nDecommissioning\n\n56.\n\nDecommissioning Fund\n\nPART X\n\nELECTRICAL INSPECTORS\n\n57.\n\nAppointment of electrical inspectors\n\n58.\n\nTesting and inspection in relation to a public utility or an independent\npower producer\n\n59.\n\nTesting and inspection as required by a consumer\n\n60.\n\nReport of an electrical inspector\n\n61.\n\nFees and expenses of an electrical inspector\n\n62.\n\nObstruction\n\nPART XI\n\nELECTRICITY APPEALS TRIBUNAL\n\n63.\n\nElectricity Appeals Tribunal\n\n64.\n\nAppeals to Tribunal\n\n\f65.\n\nAppeal to High Court\n\n7\n\nPART XII\n\nRENEWABLE ENERGY PROCUREMENT COMMITTEE\n\n66.\n\nRenewable Energy Procurement Committee\n\nPART XIII\n\nMISCELLANEOUS\n\n67.\n\nNon-power attributes and renewable energy certificates\n\n68.\n\nDisaggregation of rates and tariffs\n\n69.\n\nConfidential information\n\n70.\n\nAdministrative penalties for certain contraventions\n\n71.\n\nSection 22 of Cap. 282 not to apply to certain licensees\n\n72.\n\nPhysical development plan to be considered\n\n73.\n\nAffiliate transaction rules\n\n74.\n\nGuidelines\n\n75.\n\nRegulations\n\n76.\n\nAmendment of Schedules\n\n77.\n\nConsequential amendments\n\n78.\n\nRepeal of Act 2013-21 and transitional provision\n\n\f8\n\n79.\n\nCommencement\n\nFIRST SCHEDULE\n\nELECTRICITY ADVISORY COMMITTEE\n\nSECOND SCHEDULE\n\nCAPACITY THRESHOLDS\n\nTHIRD SCHEDULE\n\nELECTRICITY APPEALS TRIBUNAL\n\nFOURTH SCHEDULE\n\nCONSEQUENTIAL AMENDMENTS\n\n\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  regulate  the  generation,  storage,  transmission,  distribution,\n\ndispatch, supply and sale of electricity.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f10\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Electricity Supply Act, 2024.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“affiliate”,  in  relation  to  a  body  corporate,  has  the  meaning  assigned  to  it  by\n\nsection 440 of the Companies Act, Cap. 308;\n\n“business day” means a day other than a Saturday, Sunday or public holiday;\n\n“Chief  Technical  Officer”  means  a  person  appointed  to  the  post  of  Chief\nTechnical Officer in the Ministry responsible for Works, as established in\nthe Public Service General Order, 2020 (S.I. 2020 No. 41);\n\n“Codes” means the codes issued pursuant to section 49;\n\n“Commission” means the Fair Trading Commission established by section 3 of\n\nthe Fair Trading Commission Act, Cap. 326B;\n\n“Committee” means the Electricity Advisory Committee established by section\n\n7;\n\n“control”, in relation to a body corporate, has the meaning assigned to it by section\n\n441 of the Companies Act, Cap. 308;\n\n“cumulative installed capacity”, in relation to more than one generation system,\n\nmeans the sum of the installed capacity of the systems;\n\n“Decommissioning Fund” means the fund established by section 56;\n\n“decommissioning operations” means the activities involved in the execution of\n\na decommissioning plan;\n\n\f11\n\n“decommissioning plan” means a plan which specifies the manner in which a\nlicensee intends to decommission a facility for the generation, transmission,\ndistribution or storage of electricity;\n\n“dispatch” means the conduct of activities involved in the central management\nand direction of electricity from generation systems and other sources of\nsupply of electricity to the public grid in order to achieve an economic supply\nof electricity that is safe and reliable;\n\n“dispatch code” means rules to govern dispatch;\n\n“distribution”  means  the  transport  of  electricity  by  means  of  a  distribution\n\nsystem;\n\n“distribution system” means a system which\n\n(a)\n\n(b)\n\nconsists, wholly or mainly, of low voltage electric lines; and\n\nis  used  primarily  for  conveying  electricity  from  a  substation  to  a\nconsumer;\n\n“electricity system” means the system for the generation, storage, transmission,\ndistribution and dispatch of electricity for use by the public, and includes\nthe public grid;\n\n“energy efficiency” includes\n\n(a)\n\n(b)\n\n(c)\n\nthe use of less electricity to accomplish the same task or satisfy the\nsame need through a change of technology or patterns of usage;\n\nthe utilization or management of a grid in a more cost-effective manner;\nand\n\na  reduction  in  the  amount  of  electricity  required  to  be  supplied  to\ncustomers;\n\n“energy storage system” means a system, mechanism or device for the conversion\nof electricity into a form of energy which can be kept in reserve, the keeping\nof that energy and the subsequent reconversion of that energy into electrical\nenergy in a controllable manner;\n\n\f12\n\n“Fund” means the Electricity System Benefit Fund established by section 52;\n\n“generation”  means  the  production  of  electricity  by  means  of  a  generation\n\nsystem;\n\n“generation system” means a system that includes one or more generation sets;\n\n“grid code” means the minimum, technical and commercial requirements to be\nsatisfied by a person who owns, controls or operates a microgrid or a public\ngrid or supplies electricity to, or receives electricity from, a microgrid or a\npublic grid;\n\n“independent power producer” means a person, other than the Public Utility, who\nowns or operates, on a commercial basis, a facility for the generation or\nstorage of electricity primarily for supply to the public, whether through the\npublic grid or otherwise;\n\n“installed capacity” means the sum of the maximum rated electricity output of\neach generation in a generation system, as determined by the manufacturer\nof the generator;\n\n“interconnection” means the connection of an electric line between a generation\nsystem  or  an  energy  storage  system  of  a  registrant  or  a  licensee  and  a\ntransmission system or distribution system;\n\n“licence” means a licence issued under this Act;\n\n“licensee” means a person who holds a licence;\n\n“merit order” means the sequence in which generation and storage systems are\ndesignated to deliver electricity, with the aim of economically optimizing\nthe supply of electricity;\n\n“microgrid”  means  a  system,  other  than  the  public  grid,  for  the  generation,\ndistribution and supply of electricity, whether connected to the public grid\nor islanded;\n\n\f13\n\n“microgrid code” means the minimum, technical and commercial requirements\nto be satisfied by a person who owns, controls or operates a microgrid or\nsupplies electricity to, or receives electricity from, a microgrid;\n\n“Minister” means the Minister responsible for Energy;\n\n“public  grid”  means  the  physically  connected  generation,  transmission  and\n\ndistribution systems used for the supply of electricity to the public;\n\n“Public Utility” means the person who owns, controls or operates the public grid;\n\n“registrant” means a person, other than a licensee, registered pursuant to section\n\n20;\n\n“renewable energy source” means an energy source that is not depleted when\n\nexploited;\n\n“self-generator” means a person, other than the Public Utility, an independent\npower  producer  or  an  operator  of  a  microgrid,  who  generates  or  stores\nelectricity for his own use and for supply to another, and includes a person\ndescribed in section 9(2)(a) and (b);\n\n“service provider” has the meaning assigned to it by section 2 of the Fair Trading\n\nCommission Act, Cap. 326B;\n\n“smart  technology”  means  a  technology  which  includes  two-way  digital\ncommunication  between  the  supplier  of  electricity  and  a  consumer,\nintelligent metering and a monitoring system;\n\n“store” means to operate an energy storage system ;\n\n“supply” means the provision of electricity to consumers, the Public Utility, an\n\noperator of a microgrid or any other person;\n\n“System Operator”means a person who holds a dispatch licence;\n\n“telecommunications”  has  the  meaning  assigned  to  it  by  section  2  of  the\n\nTelecommunications Act, Cap. 282B;\n\n\f14\n\n“telecommunications network” has the meaning assigned to it by section 2 of the\n\nTelecommunications Act, Cap. 282B;\n\n“telecommunications service” has the meaning assigned to it by section 2 of the\n\nTelecommunications Act, Cap. 282B;\n\n“transmission”  means  the  transport  of  electricity  by  means  of  a  transmission\n\nsystem;\n\n“transmission  system”  means  a  system  for  conveying  electricity  from  a\ngenerating station to a substation or to another generating station or to or\nfrom an interconnector or to a consumer but does not include an electric line\nthat is part of a distribution system;\n\n“Tribunal” means the Electricity Appeals Tribunal established by section 63;\n\n“works” includes electric lines and any buildings, machinery, engines, equipment\nand  other  things  required  to  generate,  store,  transmit  and  distribute  or\notherwise supply electricity.\n\nObjectives of Act\n\n3.\n\nThe objectives of this Act are to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nprovide for a modern system of regulation of the generation, storage,\ntransmission, distribution, supply, dispatch and sale of electricity;\n\nfacilitate the efficient, effective, sustainable and orderly development\nand operation of the electricity system, supported by adequate levels\nof investment, local participation, and research and development;\n\npromote energy security, energy efficiency and the use of renewable\nenergy sources;\n\npromote transparency in the identification and allocation of costs and\nrevenues within the electricity sector;\n\nensure that the regulation of the electricity sector is transparent and\npredictable; and\n\n\f15\n\n(f)\n\nensure the protection and safety of consumers of electricity and the\npublic.\n\nAct to bind State\n\n4.\n\nThis Act binds the State.\n\nPART II\n\nADMINISTRATION\n\nSystem planning\n\nThe Minister shall direct the planning, development and monitoring\n5.(1)\nof the electricity system and, for that purpose, shall require the Public Utility to\n\n(a)\n\n(b)\n\ndevelop  integrated  resources  and  resilience,  and  grid  modernization\nplans for the system after consultation with the Commission, the Chief\nElectrical Officer and the System Operator;\n\nconsult with the Commission, the Chief Electrical Officer, the System\nOperator and other stakeholders within the electricity sector on matters\nconcerning the system; and\n\n(c)\n\nconduct system forecasting as directed by the Minister.\n\nThe Minister shall require the Public Utility, for the purposes of developing\n\n(2)\nthe plans referred to in subsection (1)(a), to consider\n\n(a)\n\nthe disaggregation of the public grid into a series of microgrids capable\nof operating in island mode;\n\n(b)\n\nthe development and deployment of smart grid infrastructure;\n\n(c)\n\n(d)\n\nthe underground placement of electric lines;\n\nthe deployment of utility storage facilities at diverse points along the\ntransmission and distribution system;\n\n\f16\n\n(e)\n\n(f)\n\nthe  adoption  of  a  policy  on  a  non-wires  solution  with  respect  to\nupgrades to the transmission and distribution system; and\n\nany other measures deemed necessary for ensuring the resiliency of the\nelectricity system in relation to climatic and other events.\n\nThe Minister shall, for the purposes of directing the planning, development\n(3)\nand  monitoring  of  the  electricity  system  pursuant  to  subsection  (1),  collect\ntechnical, financial and other relevant data from licensees and registrants.\n\nTargets for supply of electricity from sources of renewable energy\n\n6.(1)\n\nThe Minister may, by Order, after consultation with\n\n(a)\n\n(b)\n\n(c)\n\nthe Commission;\n\nthe Chief Electrical Officer;\n\nthe Public Utility;\n\n(d)\n\nthe System Operator; and\n\n(e)\n\nsuch other persons as the Minister may deem appropriate,\n\nprescribe  the  minimum  and  maximum  amounts  of  electricity  that  shall  be\npermitted by the Public Utility to be supplied to the public grid.\n\nWithout prejudice to subsection (1), minimum and maximum amounts may\n\n(2)\nbe prescribed for electricity generated\n\n(a)\n\n(b)\n\nfrom different renewable energy sources; and\n\non  different  types  of  premises,  whether  domestic,  commercial  or\notherwise.\n\nNew generation and storage capacity\n\n7.\nWithout prejudice to Part III, where the Minister determines that it is\nin the public interest to do so, the Minister may facilitate the provision of new\ngeneration and storage capacity at utility scale, for the supply of electricity to the\n\n\f17\n\npublic  grid,  through  negotiations  with  an  independent  power  producer  or\ncompetitive bidding in accordance with the competitive bidding framework.\n\nAdvisory Committee\n\n8.(1)\n“Electricity Advisory Committee”.\n\nThere  is  hereby  established  a  committee  to  be  known  as  the\n\nThe  First  Schedule  applies  to  the  constitution  of  the  Committee  and\n\n(2)\notherwise in relation thereto.\n\n(3)\n\nThe functions of the Committee are to\n\n(a)\n\nconsider  and  make  recommendations  to  the  Minister  in  respect  of\napplications  for  the  issue  or  renewal  of  licences  or  for  approval  of\nassignments of licences or of rights thereunder;\n\n(b)\n\nadvise the Minister on any other matter relevant to the administration\nof this Act.\n\nPrior to advising the Minister on any matter or considering and making\n(4)\nrecommendations to the Minister on any matter, the Committee may consult with\nany person whom it deems expert or experienced in the matters provided for in\nthis Act.\n\nA  member  of  the  Committee  shall  be  paid  such  remuneration  as  the\n\n(5)\nMinister determines.\n\n\f18\n\nPART III\n\nLICENSING AND REGISTRATION\n\nRestrictions on certain electricity services without licence\n\n9.(1)\na licence issued to the person,\n\nSubject to subsection (2), no person shall, except in accordance with\n\n(a)\n\nengage, in connection with the supply of electricity to another, in any\nof the following activities:\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\ngeneration;\n\nstorage;\n\ntransmission;\n\ndistribution;\n\ndispatch;\n\n(vi)\n\nsales;\n\n(vii)\n\ndevelopment of a microgrid; or\n\n(viii)\n\nenergy  efficiency  and  demand  side  management,  on  a\ncommercial basis; or\n\n(b)\n\nerect,  maintain  or  have  an  electric  line  or  other  works  over,  along,\nacross or under any street, road, bridge or pavement.\n\n(2)\n\nSubsection (1)(a) does not apply to\n\n(a)\n\na  person  who  generates  electricity  on  premises  that  are  primarily\nresidential and supplies the electricity to the Public Utility, where the\ninstalled capacity of the generation system installed on the premises\ndoes  not  exceed  the  amount  set  out  in  paragraph  1  of  the  Second\nSchedule, whether or not the person stores some or all of the generated\nelectricity;\n\n\f19\n\n(b)\n\na person, other than a person described in paragraph (a), who generates\nelectricity and supplies the electricity to the Public Utility, where the\ncumulative  installed  capacity  of  the  generation  systems  owned,\ncontrolled or operated by the person for the supply of electricity does\nnot exceed the amount set out in paragraph 2 of the Second Schedule,\nwhether or not the person stores some or all of the generated electricity;\n\n(c)\n\nthe Public Utility, where it develops a microgrid along the transmission\nand distribution systems for the purpose of modernizing or enhancing\nthe resilience of the public grid; and\n\n(d)\n\nsuch other persons as the Minister may prescribe by Order.\n\nA person who contravenes subsection (1) is guilty of an offence and is\n(3)\nliable, on summary conviction, to a fine of $100 000 or to imprisonment for 2\nyears or to both.\n\nApplication for licence\n\n10.(1)\nMinister may require.\n\nA person may apply to the Minister for a licence in such form as the\n\n(2)\n\nAn applicant shall submit with his application\n\n(a)\n\nsuch information as the Minister may require to determine whether a\nlicence should be issued to the applicant;\n\n(b)\n\nthe prescribed fee; and\n\n(c)\n\nwhere he intends to operate a generation system or storage system with\nan installed capacity that exceeds the amount set out in paragraph 3 of\nthe Second Schedule, a decommissioning plan which provides for\n\n(i)\n\nthe  dismantling,  demolition  and  removal  of  the  asset  to  be\ndecommissioned;\n\n(ii)\n\nthe disposal of hazardous waste; and\n\n\f20\n\n(iii)\n\nthe restoration of the premises at which the system is installed to\nan acceptable condition.\n\nThe  Minister  shall,  in  determining  whether  to  issue  a  licence  to  an\n\n(3)\napplicant, take into account, where relevant\n\n(a)\n\n(b)\n\n(c)\n\nthe objects of this Act;\n\nthe national energy policy;\n\nthe  current  and  projected  demand  for  electricity  based  on  the  most\nrecent  integrated  resources  and  resilience,  and  grid  modernization\nplans;\n\n(d)\n\nthe cumulative installed capacity of the electricity system; and\n\n(e)\n\nwhether  the  applicant  proposes  to  introduce  commercially  and\neconomically viable new and innovative renewable energy or storage\ntechnology into the electricity system.\n\nIssue of licence\n\n11.(1)\nto an applicant where the Minister is satisfied that\n\nThe Minister may, upon payment of the prescribed fee, issue a licence\n\n(a)\n\nthe facility and location intended to be used pursuant to the licence are\nsafe and adequate for the purpose;\n\n(b)\n\nthe applicant\n\n(i)\n\n(ii)\n\npossesses  the  financial  capacity  and  viability  to  build  and\nmaintain the facility;\n\nhas the technical capability to operate the facility safely, reliably\nand efficiently; and\n\n(iii)\n\nmeets such other requirements for the issue of a licence as may\nbe prescribed;\n\n(c)\n\nany  planning  permission\nDevelopment Act, 2019 (Act 2019-5) has been obtained; and\n\nrequired  under\n\nthe  Planning  and\n\n\f21\n\n(d)\n\nthe issue of a licence to the applicant would not result in the cumulative\ninstalled  capacity  of  the  renewable  energy  generation  systems\nconnected  to  the  public  grid  being  in  excess  of  such  amount  as  the\nMinister may prescribe by Order.\n\nNotwithstanding subsection (1), the Minister may refuse to issue a licence\n\n(2)\nwhere the Minister is satisfied that\n\n(a)\n\nthe amount of electricity to be supplied pursuant to the licence would\nexceed the cumulative installed capacity connected to the public grid;\nor\n\n(b)\n\nthe issue of the licence is not in the public interest.\n\n(3)\n\nThe Minister shall\n\n(a)\n\n(b)\n\nnotify an applicant in writing as soon as practicable of his intention to\nrefuse to issue a licence and of the reasons for his decision; and\n\nprovide the applicant with an opportunity to make submissions, within\n30 days of receipt of the notice, as to why the issue of a licence should\nnot be refused.\n\nThe Minister shall, within 14 business days of receipt of any submissions\n\n(4)\nmade by an applicant pursuant to subsection (3)(b)\n\n(a)\n\n(b)\n\nconsider the submissions; and\n\nnotify the applicant in writing of his decision with respect to the issue\nof a licence.\n\nTerms and conditions of licence\n\n12.(1)\nA licence or licences with respect to transmission, distribution, sales\nand dispatch may be issued to the public utility for such period, being not less\nthan  25  years,  upon  such  terms  and  conditions  as  the  Minister  considers\nappropriate for the purposes of this Act.\n\n\f22\n\n(2)\n\nWithout prejudice to the generality of subsection (1),\n\n(a)\n\nit is a condition of every licence that the licensee\n\n(i)\n\n(ii)\n\npay the prescribed annual fee;\n\nobserve  such  of  the  Codes  as  apply  to  the  operations  of  the\nlicensee;\n\n(iii)\n\nprovide the Minister with such information as the Minister may\nrequire for the purposes of this Act;\n\n(iv)\n\ncomply with good industry practice; and\n\n(v)\n\nrefrain from acting in a manner, that will adversely affect, directly\nor indirectly, the security and stability of the electricity system,\nor the safety of the public; and\n\n(b)\n\nthe Minister may\n\n(i)\n\ninclude in a licence, a condition requiring a licensee to comply\nwith such other obligation, whether or not relating to the activities\nauthorized  by  the  licence,  as  appears  to  the  Minister  to  be\nnecessary or expedient for the purposes of this Act; and\n\n(ii)\n\nprovide for a condition in a licence to cease to have effect at such\ntime  and  in  such  circumstances  as  the  Minister  considers\nappropriate.\n\n(3)\n\nAll licences granted under this Act shall be non-exclusive.\n\nLocal participation and investment\n\n13.\nThe  Minister  shall  take  such  measures,  as  may  be  prescribed  by\nregulations,  to  promote  local  participation  and  investment  in  the  electricity\nmarket, including the preparation of a local content plan.\n\n\f23\n\nRenewal of licence\n\n14.(1)\nsuch period as the Minister considers appropriate.\n\nA licence may be renewed, upon payment of the prescribed fee, for\n\n(2)\nThe Minister may refuse to renew a licence where the licensee is or has\nengaged  in  conduct  that  materially  contravenes  the  Codes,  this  Act  or  any\nregulations made under this Act.\n\n(3)\n\nThe Minister shall\n\n(a)\n\n(b)\n\nnotify a licensee in writing as soon as practicable of his intention not\nto renew the licence and of the reasons for his decision; and\n\nprovide the licensee with an opportunity to make submissions, within\n30 days of receipt of the notice, as to why renewal of the licence should\nnot be refused.\n\nThe Minister shall, within 7 days of receipt of any submissions made by a\n\n(4)\nlicensee pursuant to subsection (3)(b),\n\n(a)\n\n(b)\n\nconsider the submissions; and\n\nnotify the licensee in writing of his decision with respect to renewal of\nthe licence.\n\nModification of licence\n\n15.(1)\nlicensee, modify a licence with the consent of the licensee.\n\nThe  Minister  may,  on  his  own  motion  or  on  the  application  of  a\n\nNotwithstanding subsection (1), the Minister may modify a licence without\n(2)\nthe consent of the licensee where the Minister is satisfied that the modification\nis necessary in the public interest.\n\n\f24\n\nWhere the Minister intends to modify a licence pursuant to subsection (2),\n\n(3)\nthe Minister shall\n\n(a)\n\n(b)\n\nnotify the licensee and any other party who may be affected by the\nmodification in writing of his intention as soon as practicable; and\n\nprovide the licensee and the other party with an opportunity to make\nsubmissions,  within  30  days  of  receipt  of  the  notice,  as  to  why  the\nlicence should not be modified.\n\nThe Minister shall, within 7 days of receipt of any submissions made by a\n\n(4)\nlicensee or another party pursuant to subsection (3)(b),\n\n(a)\n\n(b)\n\nconsider the submissions; and\n\nnotify in writing the licensee and the other party of his decision with\nrespect to the modification.\n\nSuspension and revocation of licence\n\n16.(1)\n\nThe Minister may suspend or revoke a licence where\n\n(a)\n\nthe licensee\n\n(i)\n\nengages in conduct that materially contravenes the Codes, this\nAct or any regulations made under this Act;\n\n(ii)\n\nfails to observe a term or condition of the licence; or\n\n(iii)\n\nfails to pay a prescribed fee; or\n\n(b)\n\nthe  suspension  or  revocation  is  necessary  in  the  interest  of  national\nsecurity or otherwise in the public interest.\n\nWhere the Minister intends to suspend or revoke a licence, the Minister\n\n(2)\nshall\n\n(a)\n\nnotify the licensee in writing, at least 60 days prior to the suspension\nor revocation, of\n\n(i)\n\nhis intention;\n\n\f25\n\n(ii)\n\nthe  grounds  on  which  he  proposes  to  suspend  or  revoke  the\nlicence; and\n\n(iii)\n\nthe date of the proposed suspension or revocation; and\n\n(b)\n\nprovide the licensee with an opportunity to\n\n(i)\n\nmake submissions, within 30 days of receipt of the notice or such\nlonger period as the Minister may specify, in respect of the grounds\nand generally as to why the licence should not be suspended or\nrevoked; and\n\n(ii)\n\nremedy  any  matter  described  in  subsection  (1)(a),  where\napplicable.\n\nThe Minister shall, within 7 days of receipt of any submissions made by a\n(3)\nlicensee pursuant to subsection (2)(b), including in relation to any remedial action\ntaken by the licensee\n\n(a)\n\n(b)\n\nconsider the submissions made or remedial action taken; and\n\nnotify  the  licensee  in  writing  of  his  decision  with  respect  to  the\nsuspension or revocation of the licence.\n\nThe  suspension  or  revocation  of  a  licence  shall  take  effect  on  the  date\n(4)\nspecified pursuant to subsection (2)(a)(iii) or such other date as the Minister may\nspecify.\n\nLicensee to notify of changes\n\n17.\n\nA licensee shall notify the Minister within 10 business days where\n\n(a)\n\n(b)\n\ncontrol of the licensee is transferred; or\n\nthere  is  a  material  change  in  the  circumstances  of  the  licensee  that\nimpacts upon the ability of the licensee to conduct operations under his\nlicence.\n\n\f26\n\nAssignment of licence\n\n18.(1)\nA licensee who desires to assign, transfer, sell or otherwise convey\nhis  licence  or  any  rights  under  his  licence  shall  apply  to  the  Minister  for\napproval.\n\nA  licensee  shall  submit  with  his  application  for  approval  pursuant  to\n\n(2)\nsubsection (1)\n\n(a)\n\n(b)\n\n(c)\n\nparticulars of the assets and of the controlling interest or share holding\nto be assigned;\n\nevidence establishing that the assignee is a fit and proper person to hold\na licence; and\n\nsuch  other  information  as  the  Minister  may  require  to  determine\nwhether to approve the assignment.\n\nThe Minister may grant approval for an assignment of a licence or any\n(3)\nrights under a licence where the Minister is satisfied that the proposed assignee\nis  legally,  technically  and  financially  qualified  to  undertake  the  obligations\nimposed by this Act and the licence.\n\nNotwithstanding subsection (1), where it is proposed to assign a licence or\n(4)\nany rights under a licence to a person other than an affiliate of the licensee, the\nState shall have the right of first refusal, subject to any preexisting liens.\n\nAn assignment pursuant to subsection (1) shall be deemed to be a licence\n\n(5)\nissued under this Act.\n\nA licensee shall not, by virtue of an assignment pursuant to subsection (1),\n(6)\nbe relieved of any obligations and liabilities which the licensee incurred prior to\nthe assignment.\n\nWhere a dispute arises under this section, the dispute shall be referred to\n\n(7)\nand determined by the Tribunal.\n\n\f27\n\nA purported assignment of a licence in contravention of subsection (1) is\n\n(8)\nvoid.\n\n(9)\nA licensee who assigns his licence or any rights under his licence without\nthe approval of the Minister is guilty of an offence and is liable, on summary\nconviction, to a fine of $100 000.\n\nState’s right to step-in\n\n19.(1)\nWhere  the  Public  Utility,  the  System  Operator  or  an  independent\npower  producer  fails  to  perform  a  material  obligation  or  suspends  or  ceases\noperations in the electricity system for any reason including an event of force\nmajeure or the suspension or revocation of a licence, the State shall have the right\nto step-in and take over the performance of the obligation or the operations.\n\nThe State may assign the right specified in subsection (1) to another person\n\n(2)\nwho is qualified to perform the obligation or continue the operations.\n\nThe Minister may include in a licence such terms and conditions as may\n\n(3)\nbe appropriate for the purposes of subsections (1) and (2).\n\nThe State shall not exercise the right to step-in pursuant to subsection (1)\n(4)\nor assign the right pursuant to subsection (2) without providing the licensee with\nan opportunity to make submissions as to why the State should not exercise or\nassign the right.\n\nRegistration of generation systems and storage systems\n\n20.(1)\nfollowing information:\n\nThe Minister shall cause to be maintained a register that contains the\n\n(a)\n\nthe name and address of every person who owns, controls or operates\na generation system or storage system, whether the system is\n\n(i)\n\nconnected to the public grid or islanded; or\n\n(ii)\n\ninstalled pursuant to a licence or otherwise;\n\n\f28\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe location of the premises at which the system is installed and the\ntype of premises;\n\nthe type of system, including the energy source utilized by the system,\nand its installed capacity;\n\na  copy  of  every  licence  issued  or  deemed  to  be  issued  and  any\nmodification, if any, made to the licence; and\n\nsuch other information as the Minister considers appropriate for the\npurposes of this Act.\n\nA person who owns, controls or operates a generation system or storage\n(2)\nsystem but does not require a licence under this Act shall furnish to the Minister\nsuch information as the Minister may require for the purpose of subsection (1).\n\nA person who contravenes subsection (2) is liable to pay the administrative\n\n(3)\npenalty set out in section 70.\n\nA member of the public may, upon payment of the prescribed fee, inspect,\n\n(4)\nand obtain copies of information from the register.\n\nPART IV\n\nINTERCONNECTION AND SALE OF ELECTRICITY TO PUBLIC UTILITY\n\nInterconnection\n\n21.(1)\ninterconnection services available to\n\nThe  Public  Utility  shall,  in  accordance  with  subsection  (2),  make\n\n(a)\n\n(b)\n\nanother licensee; or\n\na registrant,\n\nat the request of the licensee or registrant.\n\n\f29\n\n(2)\n\nInterconnection services referred to in subsection (1) shall be\n\n(a)\n\noffered at points along the public grid subject to\n\n(i)\n\n(ii)\n\nthe approval of the Chief Electrical Officer;\n\nsuch agreement between the parties as may be approved by the\nCommission for the purpose; and\n\n(iii)\n\nthe payment of such interconnection costs as may be specified by\nthe Public Utility and approved by the Commission;\n\n(b)\n\nmade available\n\n(i)\n\non such terms and conditions as may be approved by the Minister,\nafter consultation with the Commission and the Chief Electrical\nOfficer, as reasonable, transparent and non-discriminatory; and\n\n(ii)\n\nwithin such period as may be specified by the Minister.\n\nThe terms and conditions of an agreement on interconnection may include\n\n(3)\nthe following:\n\n(a)\n\n(b)\n\n(c)\n\na description of the interconnection services to be provided;\n\nthe location of points of interconnection;\n\nthe technical requirements for interconnection;\n\n(d)\n\nthe processes for the testing and establishment of interconnection;\n\n(e)\n\nthe charges for interconnection;\n\n(f)\n\nthe duration of the agreement;\n\n(g)\n\nprovision on\n\n(i)\n\nthe maintenance and quality of interconnection services;\n\n(ii)\n\naccess to ancillary services;\n\n(iii)\n\ntraffic forecasting and network management;\n\n(iv)\n\nlimitation of liability and indemnity; and\n\n\f30\n\n(v)\n\nconfidentiality in relation to certain aspects of the agreement;\n\n(h)\n\nthe  procedure  to  be  followed  where  alterations  to  the  system  or  the\nservices offered are proposed; and\n\n(i)\n\ndispute resolution procedures.\n\nThe  Public  Utility  may  refuse  interconnection  services  for  technical\n(4)\nreasons but shall not impose on another licensee or a registrant, for the purpose\nof interconnection, a technical requirement that is\n\n(a)\n\nunnecessary  or  onerous  in  the  context  of  the  safety,  stability  and\nreliability of the public grid; or\n\n(b)\n\ninconsistent with the licence or conditions of registration of the person.\n\nWhere  the  Public  Utility  refuses  to  provide  interconnection  services  to\n(5)\nanother  licensee  or  a  registrant,  the  Public  Utility  shall,  within  7  days  of  the\nrefusal\n\n(a)\n\nprovide the licensee or registrant with written reasons for the refusal;\nand\n\n(b)\n\nsupply a copy of the reasons to the Minister and the Commission.\n\nWhere  the  Minister  is  notified  of  a  dispute  regarding  a  technical\n\n(6)\nrequirement for the purpose of interconnection, the Minister shall, after\n\n(a)\n\n(b)\n\nproviding  the  Public  Utility  and  the  licensee  or  registrant  with  an\nopportunity to make submissions on the matter; and\n\nconsulting  with  the  Chief  Electrical  Officer  and  a  professional\nengineer,\n\ndetermine  whether  the  technical  requirement  meets  the  criteria  set  out  in\nsubsection (4)(a) or (b).\n\n\f31\n\nAgreement on purchase of electricity by Public Utility\n\n22.(1)\nThe Public Utility shall purchase electricity from another licensee or\na  registrant  at  such  rate  and  on  such  other  terms  and  conditions  as  may  be\napproved by the Commission.\n\nWhere a licensee is an independent power producer, the Minister shall,\n(2)\nafter consultation with the Commission, establish a time frame for the conclusion\nof negotiations for an agreement between the Public Utility and the independent\npower producer on the purchase of electricity.\n\nWhere the Public Utility and the independent power producer fail to arrive\n(3)\nat an agreement within the time frame established pursuant to subsection (2), the\nCommission shall specify the terms and conditions of the agreement.\n\nPublic Utility not to unreasonably refuse agreement\n\n23.\nagreement with a licensee or a registrant.\n\nThe  Public  Utility  shall  not  unreasonably  refuse  to  enter  into  an\n\nPART V\n\nDUTIES OF PARTICIPANTS IN THE ELECTRICITY SYSTEM\n\nPublic Utility obliged to provide service\n\nThe Public Utility shall, in accordance with its licence, this Act and\n24.(1)\nany regulations made under this Act, and in cooperation with other participants\nwithin the electricity system, provide to all parts of Barbados, an adequate, safe,\nreliable and efficient electricity service in accordance with good industry practice\nand applying reasonable standards of safety and dependability.\n\nWhere, at any time, the demand for electricity from the public grid exceeds\n(2)\nthe amount of electricity available for supply, the Public Utility shall provide\nelectricity to meet the excess demand.\n\n\f32\n\nOther participants to develop reliable and safe generation and storage\nsystems\n\nA person, other than the Public Utility, involved in the generation or\n25.\nstorage of electricity shall, in accordance with his licence, if any, the grid code,\nthis  Act  and  any  regulations  made  under  this  Act,  develop  and  maintain\ngeneration or storage systems that are in accordance with good industry practice.\n\nPublic Utility to implement integrated resources and resilience, and\ngrid modernization plans\n\nThe Public Utility shall, with the approval of the Minister, implement\n26.\nthe integrated resources and resilience, and grid modernization plans developed\npursuant to section 5.\n\nPublic Utility to keep separate accounts\n\nThe  Public  Utility  shall  keep  the  accounts  for  its  generation,\n27.(1)\ntransmission, distribution and supply activities separate and distinct from each\nother  and  also  from  the  accounts  it  keeps  in  respect  of  any  other  part  of  its\nundertaking or business.\n\nThe  Public  Utility  may  engage  in  any  other  business  in  addition  to  the\n(2)\nactivities it conducts pursuant to its licence but no revenue, costs, profits or losses\nresulting  therefrom  shall  be  taken  into  account  in  the  fixing  of  rates  by  the\nCommission.\n\nPublic Utility to report on activities\n\nThe  Public  Utility  shall  furnish  annually  to  the  Minister  and  the\n28.(1)\nCommission but not later than 90 days after the end of each financial year of the\nPublic Utility, a report on its financial and operating activities and the report shall\ncontain such other information as the Minister or the Commission may determine.\n\n\f33\n\nSystem Operator’s functions\n\n29.(1)\n\nThe System Operator shall\n\n(a)\n\n(b)\n\nconduct dispatch in accordance with the dispatch code;\n\nestablish such technical arrangements as may be necessary to\n\n(i)\n\nenable  the  Minister  and  the  Commission  effectively  to  monitor\ndispatch  to  determine  whether  the  System  Operator  is  in\ncompliance  with  such  merit  order  as  may  be  determined  in\naccordance with the Codes; and\n\n(ii)\n\nprovide  the  Minister,  the  Commission,  the  Public  Utility  and\nindependent power producers with access to real time information\nconcerning dispatch; and\n\n(c)\n\nensure that any information that is sensitive or confidential relating to\nan independent power producer is not disclosed to any person unless\ndisclosure is required pursuant to\n\n(i)\n\nan order of the court;\n\n(ii)\n\nthe provisions of an enactment; or\n\n(iii)\n\nthe obligations imposed by an international agreement to which\nBarbados is a party.\n\nFor the purposes of subsection (1)(c) “sensitive or confidential” means an\n(2)\nany information that relates to the trade or marketing secrets of an independent\npower producer.\n\nSystem Operator’s departure from merit order\n\n30.(1)\n\nSubject to subsection (3), where the Minister and the Commission\n\n(a)\n\nare  satisfied  that  the  System  Operator  has  dispatched  generation  or\nstorage  capacity  to  the  electricity  system  in  a  manner  that  does  not\ncomply with the merit order; and\n\n\f34\n\n(b)\n\ndetermine that the System Operator should compensate consumers of\nelectricity for such dispatch,\n\nthe Minister and the Commission may make a claim for compensation on behalf\nof consumers.\n\n(2)\n\nA claim under subsection (1) shall be\n\n(a)\n\ndelivered in writing to the System Operator within 3 months from the\ndate on which the information on which the claim is based was provided\nby the System Operator to the Minister; and\n\n(b)\n\nsupported by evidence.\n\nNotwithstanding subsection (1), the obligation to compensate consumers\n(3)\nshall not arise where the System Operator satisfies the Minister that the departure\nfrom the merit order was due to technical exigencies relating to the reliability of\nthe supply of electricity or the stability of the electricity system.\n\nAny compensation provided to consumers pursuant to subsection (1) shall\n(4)\nbe absorbed by the System Operator and shall not be passed on to or otherwise\nrecovered from consumers.\n\nThe Commission, in consultation with the Minister, shall determine the\n(5)\nquantum  of  compensation  to  be  paid  by  a  Systems  Operator  as  a  refund  to  a\nratepayer.\n\nSystem Operator to plan for major system failure\n\n31.(1)\nThe System Operator shall develop and maintain a plan for restoring\nthe electricity system to normal operating levels in the event of a major system\nfailure.\n\nWhere there is a major system failure, the System Operator shall as soon\n\n(2)\nas practicable\n\n(a)\n\ninform the Minister and the Commission of the status of the electricity\nsystem;\n\n\f35\n\n(b)\n\n(c)\n\nseek to have the system restored to normal operating levels taking into\naccount safety, environmental impact, reliability and economy; and\n\ncoordinate the bringing back online of any apparatus forming part of\nthe system that may have ceased to be available to the system,\n\nand shall provide regular status updates to the Minister and the Commission until\nthe electricity system is restored to normal operating levels.\n\n(3)\n\nThe System Operator shall\n\n(a)\n\n(b)\n\nconduct  an  investigation  into  the  causes  of  a  major  system  failure\nutilizing an appropriate root cause analysis technique; and\n\nsubmit  to  the  Minister  and  the  Commission,  within  30  days  of  the\nsystem being restored to normal operating levels, a report on the matter\nwhich shall include\n\n(i)\n\nits findings on the cause of the failure;\n\n(ii)\n\nan assessment of the cost associated with the failure;\n\n(iii)\n\nthe measures taken to restore the system;\n\n(iv)\n\nthe measures to be taken to avoid a recurrence of the failure; and\n\n(v)\n\nthe measures taken to communicate effectively with the public\nregarding the failure and restoration of the system.\n\nFor the purposes of this section, “major system failure” means a system\n\n(4)\nfailure that\n\n(a)\n\n(b)\n\nhas not been planned by the System Operator;\n\naffects at least 35 percent of the cumulative installed capacity on the\npublic grid; and\n\n(c)\n\nlasts at least 2 hours.\n\n\f36\n\nAudit of System Operator’s activities\n\n32.(1)\nof the System Operator to be independently audited annually.\n\nThe Minister shall cause the dispatch activities and related operations\n\n(2)\nThe System Operator shall facilitate the audit and provide such access to\ninformation as the auditor may require to complete the audit within such period\nas may be specified by the Minister.\n\nLicensees to cooperate and comply with System Operator's directions\n\n33.\n\nA licensee shall\n\n(a)\n\ngive  such  assistance  and  provide  such  information  to  the  System\nOperator as may be necessary to enable the System Operator to prepare\nthe dispatch code pursuant to section 49; and\n\n(b)\n\ncomply with any direction of the System Operator relating to dispatch\nor any other activity related to the functions of the System Operator.\n\nWhere Public Utility is System Operator\n\n34.(1)\nWhere the Public Utility is the System Operator, the Public Utility\nshall, in accordance with this section, separate its dispatch activities from its other\nactivities  including  those  relating  to  generation,  storage,  transmission,\ndistribution and sale of electricity.\n\n(2)\n\nIn furtherance of the separation referred to in subsection (1)\n\n(a)\n\nthe Public Utility shall establish a discrete department for dispatch, the\nhead of which department shall report directly to the Public Utility’s\nboard of directors;\n\n(b)\n\nthe  Public  Utility  shall  keep  its  accounts  and  records  in  relation  to\ndispatch separate from other accounts and records; and\n\n\f37\n\n(c)\n\nthe Minister may, require the Public Utility to make such additional\narrangements as the Minister considers appropriate to establish further\nthe separation.\n\nPART VI\n\nPOWERS, OBLIGATIONS AND RESTRICTIONS IN RESPECT OF\nELECTRICITY SUPPLY\n\nPower to break up streets etc.\n\n35.(1)\n\nSubsections (2) to (9) apply to\n\n(a)\n\n(b)\n\nthe Public Utility; and\n\nany other licensee, as the Minister determines.\n\nSubject to subsections (3) and (4) and to the terms and conditions of his\n(2)\nlicence, a licensee may, for the purpose of supplying electricity or for any matter\nrelated to such purpose\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nopen and break up any street, road, bridge or pavement;\n\nopen and break up any sewer, drain or tunnel within, under or along\nany street, road, bridge or pavement;\n\nlay down pipes, conduits, machinery and other apparatus; and\n\ndo such other things as the licensee considers necessary or expedient\nin connection with paragraphs (a) to (c).\n\nA  licensee  shall  not  undertake  an  activity  referred  to  in  subsection  (2)\n\n(3)\nunless the licensee\n\n(a)\n\ngives  to  the  Chief  Technical  Officer,  21  days’  written  notice  of  his\nintention to undertake the activity; and\n\n(b)\n\nobtains the consent of the Chief Technical Officer for the activity.\n\n\f38\n\n(4)\nWhere a licensee intends to undertake an activity referred to in subsection\n(2), the licensee shall give to the owners or occupiers of the premises that are\nlikely to be affected by the activity, 7 days’ written notice of his intention to\nundertake the activity.\n\nNotwithstanding subsections (3) and (4), where an emergency arises, the\n(5)\nlicensee  may  commence  an  activity  referred  to  in  subsection  (2)  without\ncomplying with subsections (3) and (4) but shall as soon as possible after\n\n(a)\n\n(b)\n\nthe necessity for the activity arises; or\n\nthe activity begins,\n\nnotify the persons referred to in subsections (3) and (4) of the activity.\n\nWhere  the  owners  or  occupiers  referred  to  in  subsection  (4)  cannot  be\n(6)\nidentified  or  located  after  the  licensee  makes  reasonable  efforts  so  to  do,  the\nlicensee shall publish notice of the activity referred to in subsection (2) in at least\n2  daily  newspapers  and  the  owners  or  occupiers  shall  be  taken  to  have  been\nthereby notified.\n\n(7)\n\nA licensee shall\n\n(a)\n\nfence any portion of any street, road, bridge or pavement that is broken\nup; and\n\n(b)\n\nprovide adequate warning devices to indicate the fact of disrepair.\n\nA licensee shall, without unnecessary delay, restore to the satisfaction of\n(8)\nthe Chief Technical Officer, any streets, roads, bridges, pavements, sewers and\nlike structures that the licensee disturbs pursuant to subsection (2).\n\n(9)\n\nWhere a licensee\n\n(a)\n\n(b)\n\nfails to fence or provide adequate warning devices; or\n\ndelays in making restoration,\n\n\f39\n\nas  required  by  subsection  (7)  or  (8),  as  the  case  may  be,  the  Chief  Technical\nOfficer  may  carry  out  the  necessary  work  and  recover  from  the  licensee,  all\nreasonable expenses incurred in carrying out the work.\n\nA  person  who,  without  reasonable  excuse,  hinders  or  obstructs  an\n(10)\nemployee or agent of a licensee in the conduct of an activity pursuant to this\nsection is guilty of an offence and is liable, on summary conviction, to a fine of\n$5 000 or to imprisonment for 12 months or both.\n\nNothing in this Act authorizes a licensee to carry out an activity referred\n(11)\nto in subsection (2) in respect of a street, road, bridge or pavement or a sewer,\ndrain or tunnel within, under or along any street, road, bridge or pavement, that\nis not repairable by the Chief Technical Officer, without the consent of the person\nby whom it is repairable.\n\nPower to alter positions of pipes and wires\n\n36.(1)\n\nSubsections (2) and (3) apply to\n\n(a)\n\n(b)\n\nthe Public Utility; and\n\nany other licensee, where the Minister so provides in his licence.\n\nSubject to this Act, the Utilities Regulation Act, Cap. 282 and his licence,\n\n(2)\na licensee may alter the position of any pipes or wires that\n\n(a)\n\n(b)\n\nare under or upon any street or place that the licensee is authorized to\nbreak up; and\n\nmay interfere with the exercise of the powers of the licensee under this\nAct.\n\n(3)\n\nA licensee shall\n\n(a)\n\n(b)\n\nprior to altering the position of any pipes or wires, make or secure such\ncompensation to the owner of the pipes or wires; and\n\ncomply with such conditions as to the mode of making the alterations\nreferred to in paragraph (a),\n\n\f40\n\nas may, prior to the commencement of the alterations, be agreed upon by the\nlicensee and the owner of the pipes or wires.\n\nAny dispute with respect to the compensation or conditions referred to in\n\n(4)\nsubsection (3) shall be referred to the Commission for determination.\n\nAny other person may, in the same manner as that provided for a licensee\n(5)\nin subsections (2) and (3), alter the position of any pipes or wires of a licensee\nthat\n\n(a)\n\n(b)\n\nare under or upon any street or place that the person is authorized to\nbreak up; and\n\nmay  interfere  with  the  lawful  exercise  of  any  power  vested  in  the\nperson.\n\nRestrictions on works above ground\n\nNotwithstanding anything in this Act, a licensee shall not, without the\n37.(1)\nconsent of the Chief Technical Officer, place an electric line above ground and\nalong, over or across a street.\n\nWhere a licensee contravenes subsection (1), the Chief Technical Officer\n\n(2)\nmay\n\n(a)\n\n(b)\n\nrequire  the  licensee  forthwith  to  remove  the  electric  line  placed\ncontrary to that subsection; or\n\nremove the electric line and recover from the licensee, the expense of\nsuch removal.\n\nA licensee who fails to comply with the directions of the Chief Technical\n(3)\nOfficer  given  under  subsection  (2)(a)  commits  an  offence  and  is  liable  on\nsummary conviction to imprisonment for one year or to a fine of $5 000 or to\nboth.\n\nWhere a licensee places an electric line above ground in any position, a\n(4)\nmagistrate  may,  on  the  application  of  the  Chief  Technical  Officer,  where  the\nmagistrate is satisfied that the line is, or is likely to become, dangerous to the\n\n\f41\n\npublic, order the removal of the line by such person and upon such terms as the\nmagistrate thinks fit.\n\nRestrictions on placement of electric lines etc.\n\n38.(1)\n\nWhere\n\n(a)\n\n(b)\n\nan electric line or other work is laid down or erected in, over, along,\nacross or under a street for the purpose of supplying electricity, or in\nany  other  position  for  such  purpose,  in  such  a  manner  as  not  to  be\nentirely enclosed within a building or buildings; or\n\nan  electric  line  or  other  work  laid  down  or  erected  as  described  in\nparagraph (a) is used for the purpose of supplying electricity otherwise\nthan in pursuance of a licence,\n\nthe  Chief  Electrical  Officer  may,  where  he  thinks  fit,  by  written  notice  to  be\nserved upon the person who owns, uses or is entitled to use the electric line or\nother work, require that the line or other work be continued and used only in\naccordance with such conditions and subject to such measures for the protection\nof the public and the telecommunications network as the Chief Electrical Officer\nmay determine.\n\nWhere a person fails to comply with the conditions or measures referred\n(2)\nto in subsection (1), the Chief Electrical Officer may require the person to remove\nthe electric line or work.\n\nSubsection (1) does not apply to an electric line or other work laid down\n(3)\nor erected by an owner or occupier of premises in order for electricity generated\nupon the premises to be supplied to another part of the premises.\n\nRestrictions on use of electric lines\n\nWhere an electric line or other work is used for the supply of electricity\n39.(1)\nin such a manner which adversely affects the telecommunications network or\ntelecommunications service, the Chief Technical Officer may, by written notice\nto be served upon the person who owns, uses or is entitled to use the electric line\n\n\f42\n\nor  work,  require  that  the  supply  be  continued  only  in  accordance  with  such\nconditions  and  measures  for  the  protection  of  the  network  and  service  as  the\nMinister may determine.\n\nWhere a person fails to comply with the conditions or measures referred\n(2)\nto  in  subsection  (1),  the  Chief  Technical  Officer  may  require  the  supply  of\nelectricity through the electric line or other work to be discontinued forthwith.\n\nSubsection (1) does not apply to an electric line or other work laid down\n\n(3)\nor erected and used for the supply of electricity in accordance with a licence.\n\nService of section 37 or 38 notice\n\n40.(1)\nor section 39 may be served\n\nA notice authorized to be served upon a person pursuant to section 38\n\n(a)\n\n(b)\n\npersonally; or\n\nby\n\n(i)\n\ncourier service;\n\n(ii)\n\npost;\n\n(iii)\n\nfacsimile;\n\n(iv)\n\nelectronic mail; or\n\n(v)\n\nsuch other method as may be prescribed by the Minister by Order.\n\nA notice served by post shall be deemed to have been served at the time\n(2)\nwhen the letter containing the notice would be delivered in the usual course of\npost,  and  in  proving  such  notice,  it  shall  be  sufficient  to  prove  that  the  letter\ncontaining the notice was properly addressed and put into the post.\n\nPenalty for failure to comply with section 37 or 38 notice\n\n41.(1)\nA person who, without reasonable excuse, fails to comply with the\nrequirements of a notice served upon him pursuant to section 38 or section 39 is\nguilty of an offence and is liable, on summary conviction, to a fine of $10 000.\n\n\f43\n\n(2)\nA magistrate may, in addition to any fine imposed pursuant to subsection\n(1), order the removal of any electric line or other work specified in the notice,\nby such person and upon such terms as the magistrate thinks fit.\n\nProtection of property of State, licensees and service providers\n\nA licensee shall not lay down an electric line or do any other work for\n42.(1)\nthe supply or use of electricity whereby the telecommunications network or the\npipes or other works of the State or of other licensees or service providers are or\nmay be adversely affected.\n\nBefore an electric line is laid down or any work is done within 9 feet of\n(2)\nany part of the telecommunications network or of the pipes or other works of the\nState or of other licensees or service providers (other than the repairs or the laying\nof connections with mains where the direction of the electric lines so laid down\ncrosses the lines of the telecommunications network or the pipes or other works\nof other service providers, at right angles at the point of shortest distance and\ncontinues the same for a distance of 6 feet on each side of such point), the licensee\nshall, not more than 28 nor less than 7 business days before commencing such\nwork,  give  written  notice  to  the  Minister  or  the  other  licensees  or  service\nproviders affected, as the case may be, specifying the course and nature of the\nwork including the gauge of any electric lines.\n\nThe  licensee  shall  comply  with  any  reasonable  requirements,  whether\n(3)\ngeneral or specific, as may be made by the Minister or the other licensees or\nservice  providers,  as  the  case  may  be,  for  the  purpose  of  preventing  the\ntelecommunications network or the pipes or works of the State or of the other\nlicensees or service providers from being adversely affected by the work.\n\nAny dispute with respect to a requirement referred to in subsection (3),\n(4)\nbetween the licensee and the Minister or the other licensees or service providers,\nshall be referred to a judge in Chambers for determination.\n\nA licensee who contravenes subsection (1), (2) or (3) is guilty of an offence\n(5)\nand is liable, on summary conviction, to a fine of $1 000 for every day during\nwhich the contravention continues or, where telecommunications or the supply\n\n\f44\n\nof  water  or  gas  is  wilfully  interrupted,  $5  000  for  every  day  on  which  such\ninterruption continues.\n\n(6)\n\nIt is a defence to a charge under subsection (5) for a person to prove that\n\n(a)\n\n(b)\n\nthe immediate execution of the works was required to avoid an accident\nor was otherwise a work of emergency; and\n\nthe person forthwith served on the Minister or on the other licensees\nor service providers affected, as the case may be, written notice of the\nexecution thereof, stating the reason for executing the works without\nprevious notice.\n\nFor the purposes of this section, the telecommunications network or the\n(7)\npipes or works of the State or of other licensees or service providers shall be\ndeemed  to  be  adversely  affected  by  a  work  where  telecommunications  or  the\nsupply of water or gas by means of such pipes or works is, whether by induction\nor otherwise, in any manner affected by the work or by any use made of the work.\n\nUse of electricity\n\n43.(1)\nmanner in which the electricity the licensee supplies is used.\n\nSubject to section 45, a licensee shall not control or interfere with the\n\n(2)\n\nNo person shall\n\n(a)\n\n(b)\n\nuse the electricity supplied to him for any purpose; or\n\ndeal with the electricity in any manner,\n\nso as to unduly or improperly interfere with the electricity supplied to another.\n\nAny dispute arising out of subsection (1) or (2) between a licensee and a\n(3)\nperson entitled to be supplied with electricity under this Act shall be referred to\nthe Commission for determination.\n\n\f45\n\nPower of entry, inspection etc.\n\n44.(1)\nwhich the Public Utility supplies or has supplied electricity, to\n\nThe Public Utility may, at any reasonable time, enter any premises to\n\n(a)\n\ninspect  the  electric  lines,  meters,  capacitors,  fittings,  works  and\napparatus for the supply of electricity, belonging to the licensee;\n\n(b)\n\nascertain the quantity of electricity consumed or supplied; or\n\n(c)\n\nremove  any  electric  lines,  meters,  capacitors,  fittings,  works  or\napparatus belonging to the licensee, where a supply of electricity is no\nlonger required or the licensee is authorized to discontinue the supply\nof electricity to the premises.\n\nThe Public Utility shall repair any damage caused by an entry, inspection\n\n(2)\nor the removal of anything which was done in accordance with subsection (1).\n\nDiscontinuation of electricity supply\n\nNotwithstanding anything contained in the Utilities Regulation Act,\n45.\nCap. 282 where a person fails or refuses to pay a charge for electricity or any\nother sum payable by him to a licensee in respect of the supply of electricity to\nhim, or engages in an act capable of affecting the safety, reliability, security or\ncorrect recording of the supply of electricity, the licensee may discontinue the\nsupply of electricity and for the purpose, cut or disconnect any electric line or\nother work through which the electricity may be supplied until\n\n(a)\n\n(b)\n\nthe charge or other sum, together with any expenses incurred by the\nlicensee in so cutting off the supply of electricity, is fully paid; and\n\nall requirements for the safe restoration of an accurately metered supply\nof electricity are met.\n\nElectric lines not subject to distress in certain cases\n\n46.\nElectric  lines,  meters,  capacitors,  fittings,  works  or  apparatus\nbelonging  to  a  licensee  and  placed  on  premises  not  in  the  possession  of  the\n\n\f46\n\nlicensee for the purpose of supplying electricity shall not be subject to removal\nor disconnection by a landlord or to distress or any other remedy of a landlord\nfor rent of the premises against any person in whose possession the premises may\nbe.\n\nDamaging work with intent to cut off supply\n\n47.\n\nA person who, without lawful excuse\n\n(a)\n\n(b)\n\ndamages an electric line or other work with intent to cut off a supply\nof electricity; or\n\ntampers with an electric line or other work and the tampering results\nin the disruption of service or the incorrect measurement or recording\nof the amount of electricity used, or impacts on safety,\n\nis guilty of an offence and is liable, on summary conviction, to a fine of $50 000\nor to imprisonment for 2 years or to both.\n\nUnlawful abstraction or use of electricity\n\n48.\nA  person  who  unlawfully  abstracts,  uses  or  consumes,  diverts  or\ncauses to be diverted any electricity supplied by the Public Utility is guilty of an\noffence  and  is  liable,  on  summary  conviction,  to  a  fine  of  $50  000  or  to\nimprisonment for 2 years or to both.\n\nPART VII\n\nCODES\n\nCodes\n\n49.(1)\n\nSubject to the approval of the Minister\n\n(a)\n\n(b)\n\nthe Public Utility shall issue a grid code;\n\nthe System Operator shall issue a dispatch code; and\n\n\f47\n\n(c)\n\nan operator of a microgrid shall issue a microgrid code,\n\nwithin such period as may be specified by the Minister.\n\nThe Minister shall, before approving the issue of a code under subsection\n\n(2)\n(1)\n\n(a)\n\nconsult with the Chief Electrical Officer and the Commission on the\ncontent of the code and any comments on it; and\n\n(b)\n\nmake the code available for public comment.\n\nThe  Minister  may,  within  such  period  as  the  Minister  considers\n(3)\nappropriate, require a person who issues a code to review and revise the code to\ntake account of changes in the electricity system and sector.\n\nSubsections (1) and (2) apply to the revision of a code as those sections\n\n(4)\napply to the original code.\n\nThe Minister shall cause the Codes and any revision of the Codes to be\n\n(5)\npublished in the Official Gazette.\n\nSubsection (1)(c) does not apply to the Public Utility, where the Public\n\n(6)\nUtility operates a microgrid that is connected to the public grid.\n\nCompliance with Codes\n\n50.\n\nAny person to whom the Codes apply shall comply with the Codes.\n\nChief Electrical Officer to verify technical compliance with Codes\n\n51.(1)\nWhere the Chief Electrical Officer is satisfied that the electrical wiring\nand installations at any premises or facility or any apparatus is safe and complies\nwith the relevant code, the Chief Electrical Officer shall certify that the premises,\nfacility or apparatus is fit to be connected to a grid.\n\nThe  Public  Utility  or  an  operator  of  a  microgrid  shall  not  connect  any\n(2)\npremises, facility or apparatus to the grid unless it has been certified by the Chief\nElectrical Officer as fit to be connected to the grid.\n\n\f48\n\nPART VIII\n\nELECTRICITY SYSTEM BENEFIT FUND\n\nEstablishment of Fund\n\n52.(1)\nFund”.\n\nThere is established a fund to be called the “Electricity System Benefit\n\nThere shall be paid into the Fund any moneys voted for the purpose by\n\n(2)\nParliament or received from any other source for the purposes of the Fund.\n\nApplication of Fund’s resources\n\n53.\n\nThe resources of the Fund shall be utilized\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nto promote energy efficiency, energy resiliency and energy security;\n\nto increase the penetration of renewable energy in the electricity sector;\n\nto conduct research and development on the electricity system and the\nelectricity sector;\n\nto conduct technical studies for the prudent regulation of the electricity\nsystem; and\n\nfor such other purpose relating to the Electricity System as the Minister\nmay by Order prescribe.\n\nAdministration of Fund\n\n54.(1)\ncontrol and direction of the Minister.\n\nThe Fund shall be administered by the Accountant-General under the\n\nThe Accountant-General may invest all moneys in the Fund which are not\n\n(2)\nimmediately required in an interest-bearing account.\n\n(3)\n\nThe Accountant-General shall\n\n(a)\n\nmaintain adequate financial and other records of the Fund;\n\n\f49\n\n(b)\n\nprepare a statement of accounts on the Fund for each financial year;\nand\n\n(c)\n\ncause an audit of the Fund to be conducted at least every 3 years,\n\nand the cost of the audit shall be paid from the Fund.\n\nPART IX\n\nDECOMMISSIONING\n\nDecommissioning\n\nA licensee or registrant shall not decommission his generation system\n55.(1)\nor storage system or a part of his system without making a reasonable effort to\nmitigate the impact of the decommissioning on the environment in accordance\nwith good industry practice.\n\nWhere the installed capacity of the generation system or storage system of\n(2)\na licensee exceeds the amount set out in paragraph 3 of the Second Schedule and\nthe licensee has submitted a decommissioning plan to the Minister pursuant to\nsection 10(2)(c), the licensee\n\n(a)\n\nshall not decommission the system without the written approval of the\nMinister; and\n\n(b)\n\nshall decommission the system in accordance with the plan.\n\n(3)\n\nA licensee shall\n\n(a)\n\nrevise his decommissioning plan every 3 years to take into account any\nchanges  in  circumstances  which,  in  accordance  with  good  industry\npractice, require changes in the scope or cost or another attribute of the\nplan; and\n\n(b)\n\nsubmit the revisions to the Minister.\n\n\f50\n\n(4)\nNotwithstanding subsection (3), a licensee shall not, without the written\napproval of the Minister, materially amend a decommissioning plan which has\nbeen previously approved by the Minister.\n\nDecommissioning Fund\n\n56.(1)\nto finance the decommissioning operations of licensees.\n\nThere is established a fund to be called the “Decommissioning Fund”\n\n(2)\n\nThe Minister and each licensee shall agree on\n\n(a)\n\n(b)\n\nthe amount of the contribution of the licensee to the Decommissioning\nFund; and\n\nthe manner in which and time at which the licensee shall submit his\ncontribution to the fund.\n\nThe Accountant-General shall establish an interest-bearing escrow bank\n(3)\naccount in a currency agreed upon by the Minister and the licensee for the purpose\nof depositing contributions to the Decommissioning Fund.\n\nA licensee shall, in accordance with his agreement pursuant to subsection\n(4)\n(2), deposit contributions into the account and notify the Minister when a deposit\nis made.\n\nA licensee shall provide the Minister with a guarantee in respect of any\n(5)\nshortfall which may accrue between his contribution to the Decommissioning\nFund and the actual cost of his decommissioning operations.\n\nThe guarantee referred to in subsection (5) shall be in such form as the\n\n(6)\nMinister determines.\n\n\f51\n\nPART X\n\nELECTRICAL INSPECTORS\n\nAppointment of electrical inspectors\n\n57.(1)\nnecessary for the purposes of this Act.\n\nThere shall be appointed such number of electrical inspectors as are\n\n(2)\n\nThe functions of an electrical inspector are:\n\n(a)\n\nthe  inspection  and  testing,  periodically  and  in  special  cases,  of  the\nelectric lines of a public utility and an independent power producer and\nworks and the supply of energy given by them;\n\n(b)\n\nthe certifying and examination of meters; and\n\n(c)\n\nsuch other duties as may be require by him for the purpose of enforcing\nthe provisions of this Act.\n\nTesting and inspection in relation to a public utility or an independent\npower producer\n\nWhere an electrical inspector intends to conduct testing on any main\n58.(1)\nof a public utility or an independent power producer, he shall give reasonable\nnotice to that public utility or independent power producer.\n\nA test conducted under subsection (1) shall be carried out at such suitable\n(2)\nhours as in the opinion of the electrical inspector will least interfere with the\nsupply of energy by the public utility or an independent power producer and in\nsuch manner as the electrical inspector may think expedient.\n\nAn electrical inspector shall not be entitled to interfere with the mains of\n(3)\na public utility or an independent power producer unless authorised to so by the\nMinister, in order to address an of emergency.\n\nA  public  utility  or  an  independent  power  producer  shall  not  be  held\n(4)\nresponsible for any interruption in the supply of energy which may be occasioned\n\n\f52\n\nby  or  required  by  such  inspector  for  the  purpose  of  any  testing  referred  to  in\nsubsection (1).\n\nTesting pursuant to subsection (1) shall not be conducted more than once\n\n(5)\nin any 3 months unless authorised by the Minister to do so.\n\nA public utility or an independent power producer shall set up and keep\n(6)\nupon all premises from which they supply energy by any distributing mains such\nsuitable and proper instruments of such pattern and construction as may from\ntime to time be approved by the Minister and shall from time to time take and\nrecord, and keep recorded, such observations as the Minister may from time to\ntime approve, and any observations so recorded shall be receivable as evidence.\n\nA public utility or an independent power producer shall keep in efficient\n(7)\nworking order all instruments which they are required by this Act to place, set\nup or keep at or on their premises and an electrical inspector may from time to\ntime examine and record the readings of such instruments and any reading so\nrecorded shall be receivable in evidence.\n\nAn electrical inspector shall have the right of access at all reasonable hours\n(8)\nto  the  premises  of  a  public  utility  or  an  independent  power  producer  for  the\npurpose of testing the electric lines and instruments of the public utility or an\nindependent power producer and ascertaining if the electric lines or instruments\nare in order.\n\nWhere pursuant to a test conducted under subsection (8) the electric lines\n(9)\nor instruments of a public utility or an independent power producer are not in\norder,  the  inspector  may  direct  the  public  utility  or  an  independent  power\nproducer to have the relevant electric lines or instruments restored to good order.\n\nA public utility or an independent power producer may, if they think fit,\n(10)\non  each  occasion  of  the  testing  of  any  main  or  service  line  or  the  testing  or\ninspection of any instrument of a public utility or an independent power producer\nby any electrical inspector, be represented by some officer or other agent, but\nsuch officer or agent shall not interfere with the testing or inspection.\n\n\f53\n\n(11)\nA public utility or an independent power producer shall afford all facilities\nfor  the  proper  execution  of  an  inspection  and  testing  and  the  readings  and\ninspection of instruments and shall comply with all the requirements of this Act.\n\n(12)\nA public utility or an independent power producer that contravenes this\nsection shall be liable to pay an administrative penalty in accordance with section\n70.\n\nTesting and inspection as required by a consumer\n\nAn electrical inspector, if and when required to do so by any consumer,\n59.\nshall from time to time, on payment by such consumer of the prescribed fee, test\nthe variation of electric pressure at the consumer’s terminals or make such other\ninspection and testing of the service lines, apparatus and works of a public utility\nor  an  independent  power  producer  upon  the  consumer’s  premises  as  may  be\nnecessary  for  the  purpose  of  determining  whether  a  public  utility  or  an\nindependent power producer have complied with this Act.\n\nReport of an electrical inspector\n\n60.(1)\nof a testing, make and deliver a report of the results of his testing to the\n\nAn electrical inspector shall, within 28 days of the date of the conduct\n\n(a)\n\nMinister or the consumer as the case may be, by whom he was required\nto make such testing; and\n\n(b)\n\npublic utility or independent power producer,\n\nand that report shall be receivable in evidence.\n\nWhere a public utility or an independent power producer or a consumer,\n(2)\nis dissatisfied with any report of any electric inspector, they may appeal to the\nTribunal.\n\nFees and expenses of an electrical inspector\n\n61.(1)\nAll fees and reasonable expenses of an electrical inspector shall, unless\nagreed to, be ascertained by the Minister and shall be paid by a public utility or\n\n\f54\n\nan independent power producer, and may be recovered in a summary manner\nbefore a magistrate.\n\nWhere the report of an electrical inspector, shows that any consumer was\n(2)\nguilty  of  any  default  or  negligence,  such  fees  and  expenses  shall,  on  being\nascertained  by  the  Minister,  be  paid  by  such  consumer  or  consumers  as  the\nMinister having regard to such report, shall direct, and may be recovered in a\nsummary manner before a magistrate.\n\nIn any proceedings pursuant to this section, any fees and expenses incurred\n(3)\nin  connection  with  such  proceedings  shall  be  payable  by  the  complainant  or\ndefendant as the court may direct.\n\nObstruction\n\n62.\n\nAny person who\n\n(a)\n\n(b)\n\n(c)\n\nassaults or obstructs an inspector in the performance of his functions;\n\nby  the  offer  of  any  gratuity,  bribe  or  other  inducement  prevents  or\nattempts to prevent an inspector from performing his functions;\n\nknowingly gives false information to an inspector in the performance\nof  his  functions  or  gives  information  that  is  likely  to  mislead  an\ninspector in the performance of his functions\n\nis guilty of an offence and liable on summary conviction to a fine of $5 000 or\nto imprisonment for a term of 2 years or to both.\n\nPART XI\n\nELECTRICITY APPEALS TRIBUNAL\n\nElectricity Appeals Tribunal\n\n63.(1)\nTribunal”.\n\nThere is established a tribunal to be called the “Electricity Appeals\n\n\f55\n\nThe  Third  Schedule  applies  to  the  constitution  of  the  Tribunal  and\n\n(2)\notherwise in relation to the Tribunal.\n\nSubject to this Act, the Tribunal may regulate its own procedure and may\n\n(3)\nmake rules for that purpose.\n\nAppeals to Tribunal\n\nA person aggrieved by a decision of the Minister under this Act may,\n64.(1)\nwithin 14 days of notification of the decision and in such form and manner as the\nTribunal may require, appeal to the Tribunal against the decision.\n\nThe filing of an appeal against a decision under subsection (1) does not\n\n(2)\noperate as a stay of the decision unless the Tribunal so determines.\n\nThe Tribunal may, upon an appeal against a decision, confirm, modify or\n\n(3)\nreverse the decision or any part of the decision.\n\nAppeal to High Court\n\nA party to an appeal determined by the Tribunal who is dissatisfied\n65.\nwith  the  determination  may,  within  30  days  after  the  party  is  notified  of  the\ndecision, appeal to the High Court.\n\nPART XII\n\nRENEWABLE ENERGY PROCUREMENT COMMITTEE\n\nRenewable Energy Procurement Committee\n\nThere  is  hereby  established  a  Committee  to  be  known  as  the\n66.(1)\n“Renewable Energy Procurement Committee” which shall be appointed by the\nCabinet  for  the  purpose  of  procuring  generation  and  storage  capacity  in  the\nrenewable energy sector.\n\nThe constitution of the Renewable Energy Procurement Committee shall\n\n(2)\nbe prescribed by regulations made by the Cabinet.\n\n\f56\n\n(3)\nThe  Renewable  Energy  Procurement  Committee  shall  manage  and\nadminister  the  process  for  procurement,  by  means  of  competitive  bidding,  of\ngeneration or storage capacity by potential independent power producers for sale\nto the public grid.\n\nIn order to ensure appropriate transparency and continuity in procurement\n(4)\nmatters  so  as  to  attract  necessary  levels  of  investment  in  the  electricity  and\nrenewable energy sectors, the Renewable Energy Procurement Committee shall\nestablish protocols or rules governing procurement.\n\nPART XIII\n\nMISCELLANEOUS\n\nNon-power attributes and renewable energy certificates\n\n67.(1)\na renewable energy source in Barbados is vested in the State.\n\nThe property in all non-power attributes of electricity generated from\n\n(2)\nThe  Minister  may  make  regulations  for  the  registration  of  non-power\nattributes  and  the  issue  of  renewable  energy  certificates  in  respect  of  such\nattributes.\n\n(3)\n\nIn this section,\n\n“non-power attributes” means the environmental, social and other characteristics,\nexclusive  of  energy,  capacity,  reliability  and  any  other  electrical  power\nservice  attribute,  associated  with  the  generation  of  electricity  from  a\nrenewable energy source;\n\n“renewable  energy  certificate”  means  a  tradable  certificate  representing  the\nproperty in the non-power attributes associated with at least one megawatt-\nhour of electricity generated from a renewable energy source.\n\n\f57\n\nDisaggregation of rates and tariffs\n\nThe Commission shall, within 180 days after the commencement of\n68.\nthis  Act,  disaggregate  and  make  available  for  public  inspection,  all  rates  and\ntariffs charged for electricity services.\n\nConfidential information\n\n69.(1)\nconfidential information received in the discharge of his functions.\n\nA  person  involved  in  the  administration  of  this  Act  shall  treat  as\n\n(2)\n\nSubsection (1) does not apply where the disclosure of the information is\n\n(a)\n\n(b)\n\n(c)\n\nnecessary for the proper administration of this Act;\n\nauthorized by the person who provided the information; or\n\nmade pursuant to an order of the court.\n\nWhere a person claims that confidential information made available or to\n(3)\nbe made available by or on behalf of the person, whether in writing or otherwise,\nis information the disclosure of which would be injurious to the interest of the\nperson and the Minister\n\n(a)\n\n(b)\n\nis satisfied that the claim is justified; and\n\nis not of the opinion that disclosure of the confidential information is\nnecessary for the proper administration of this Act,\n\nthe Minister shall take reasonable steps to ensure that the confidential information\nis not, without the consent of that person, disclosed.\n\nA person who discloses information contrary to this section is guilty of an\n(4)\noffence  and  is  liable,  on  summary  conviction,  to  a  fine  of  $50  000  or  to\nimprisonment for 2 years or to both.\n\n\f58\n\nAdministrative penalties for certain contraventions\n\n70.(1)\nor registrant has\n\nWhere the Director of Renewable Energy is satisfied that a licensee\n\n(a)\n\ncontravened\n\n(i)\n\na term or condition of his licence;\n\n(ii)\n\nthe Codes; or\n\n(iii)\n\nthis Act or any regulations made under this Act; or\n\n(b)\n\nfailed to comply with a direction of the Minister or electrical inspector\nunder this Act,\n\nand the contravention or failure does not constitute an offence, the Director of\nRenewable Energy may, where no other penalty is provided under this Act for\nthe contravention or failure, impose on the person a penalty of $5 000.\n\nThe  Director  of  Renewable  Energy  shall  not  impose  an  administrative\n\n(2)\npenalty on a person under this Act without first giving the person\n\n(a)\n\n(b)\n\nwritten notice of imposition of the administrative penalty; and\n\nan opportunity to make submissions as to why the penalty should not\nbe imposed.\n\n(3)\n\nThe notice referred to in subsection (2) shall\n\n(a)\n\n(b)\n\nspecify  the  nature  of  the  act  constituting  the  contravention  and  the\npenalty to be paid; and\n\nrequire  the  person  to  pay  the  penalty  to  the  Director  of  Renewable\nEnergy within 14 days of the date of the notice.\n\nA person who is in receipt of an administrative penalty notice shall pay the\n(4)\namount of the penalty to the Director of Renewable Energy and comply with any\nadditional requirement contained in the notice on or before the date specified in\nthe notice.\n\n\f59\n\nAn administrative penalty imposed under subsection (1) is a debt due to\n\n(5)\nthe State recoverable in the Magistrate’s Court for District A.\n\nSection 22 of Cap. 282 not to apply to certain licensees\n\n71.\nAct, Cap. 282 shall not apply in respect of a licensee other than a person who\n\nFor  the  avoidance  of  doubt,  section  22  of  the  Utilities  Regulation\n\n(a)\n\nholds a licence in respect of generation at utility scale, transmission,\ndistribution or dispatch; or\n\n(b)\n\nis otherwise an independent power producer.\n\nPhysical development plan to be considered\n\nA  person  exercising  functions  under  this  Act  shall  specifically\n72.\nconsider the physical development plan for Barbados in determining the physical\nlocation  of  renewable  and  other  generation  and  storage  systems,  taking  into\naccount  the  potential  for  electrification  through  the  development  of  grid\nmodernization and climate resilient infrastructure.\n\nAffiliate transaction rules\n\n73.\nthat are affiliates.\n\nThe Minister may make rules to govern the relationship of licensees\n\nGuidelines\n\n74.(1)\nThe Minister may issue guidelines generally to provide information\nand guidance in relation to compliance with this Act or any statutory instruments\nmade thereunder and those guidelines shall be published in the Official Gazette.\n\nA person who contravenes the guidelines issued under subsection (1) shall\n\n(2)\nbe liable to pay an administrative penalty in accordance with section 70.\n\n\f60\n\nRegulations\n\n75.(1)\nAct. and to provide for\n\nThe Minister may make regulations generally for giving effect to this\n\n(a)\n\n(b)\n\n(c)\n\nthe fees to be paid under this Act;\n\nthe establishment and regulation of microgrids; and\n\nthe supply of electricity to electric vehicles; and\n\n(d)\n\ngenerally for giving effect to this Act.\n\nNotwithstanding the generality of subsection (1), the Minister may make\n\n(2)\nregulations to provide for\n\n(a)\n\n(b)\n\n(c)\n\nthe fees to be paid under this Act;\n\nthe establishment and regulation of microgrids; and\n\nthe supply of electricity to electric vehicles.\n\nAmendment of Schedules\n\n76.\nSchedules.\n\nThe  Minister  may  by  Order  amend  the  First,  Second  and  Third\n\nConsequential amendments\n\n77.\namended to the extent specified opposite in Column 2.\n\nThe enactments specified in the Column 1 of the Fourth Schedule are\n\nRepeal of Act 2013-21 and transitional provision\n\n78.(1)\n\nThe Electric Light and Power Act, 2013 (Act 2013-21) is repealed.\n\n\f61\n\n(2)\nNotwithstanding  subsection  (1),  the  Orders  saved  by  section  35  of  the\nElectric Light and Power Act, 2013 (Act 2013-21), and the Electric Light and\nPower (Fees) Regulations, 2017 (S.I. 2017 No. 73)\n\n(a)\n\n(b)\n\nshall continue in force to the extent that they were in force prior to the\ncommencement of this Act; and\n\nmay be amended or revoked by the Minister as if they had been made\nunder this Act.\n\n(3)\n\nNotwithstanding section 9\n\n(a)\n\n(b)\n\nlicence\n\nthat  was  valid\n\nthe\nan  existing\ncommencement of this Act shall be deemed to have been issued under\nthis  Act  and  continue  in  force  until  it  expires  or  is  suspended  or\nrevoked, or a new licence is issued to the licensee; and\n\nimmediately  before\n\nfor as long as the Orders described in subsection (1) continue in force,\nthe Public Utility shall not be held to be in breach of section 9 and shall\nbe treated for the purposes of this Act as if it were a licensee under this\nAct.\n\nNothing in subsection (2) or (3) shall restrict any right given to, or remove\n(4)\nany obligation imposed on, the Public Utility or the holder of an existing licence\nunder this Act; and this Act shall prevail where there is a conflict between this\nAct and\n\n(a)\n\n(b)\n\nthe Orders described in subsection (1); or\n\nan existing licence.\n\n(5)\n\nIn this section,\n\n“existing licence” means a licence issued under section 6 of the Electric Light\n\nand Power Act, 2013 (Act 2013-21);\n\n\f“Orders” means\n\n62\n\n(a)\n\nthe  Orders  set  out  in  the  First,  Second  and  Third  Schedules  to  the\nElectric  Light  and  Power  Act,  Cap.  278  which  was  repealed  by  the\nElectric Light and Power Act, 2013 (Act 2013-21); and\n\n(b)\n\nthe Electric Light and Power Order, 1981 (S.I. 1981 No. 216).\n\nCommencement\n\n79.\nproclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f63\n\nFIRST SCHEDULE\n\nELECTRICITY ADVISORY COMMITTEE\n\n(Section 8)\n\n1.\n\nThe Committee shall comprise\n\n(a)\n\nex officio\n\n(i)\n\nthe Permanent Secretary in the Ministry with responsibility for\nEnergy;\n\n(ii)\n\nthe Chief Energy Conservation Officer;\n\n(iii)\n\nthe Chief Electrical Officer;\n\n(iv)\n\nthe Director of Planning and Development; and\n\n(b)\n\n5  persons  appointed  by  the  Minister  by  instrument  in  writing  from\namong  persons  qualified  and  experienced  in  electrical  or  structural\nengineering, renewable energy technologies, economics, accountancy,\ncommerce or law or such other area as, in the opinion of the Minister,\nis relevant to the discharge of the functions of the Committee.\n\n2.\nDeputy Chairman, of the Committee.\n\nThe Minister shall appoint a person to be Chairman and another to be\n\n3.\n\nA member of the Committee, other than an ex officio member\n\n(a)\n\n(b)\n\nshall, subject to this Schedule, hold office for a term of 3 years and is\neligible for reappointment; and\n\nmay  resign  his  office  by  instrument  in  writing  addressed  to  the\nMinister, transmitted through the Chairman; and from the date of the\nreceipt  of  the  instrument  by  the  Minister,  unless  some  other  date  is\nmentioned in the instrument, shall cease to be a member.\n\n\f64\n\n4.\n\nThe Minister may by instrument in writing\n\n(a)\n\n(b)\n\nappoint a person to act temporarily in the place of a member appointed\nby him where the member is temporarily absent or unable to act;\n\nrevoke the appointment of a member appointed by him where he is\nsatisfied that the member is\n\n(i)\n\nincapacitated physically or mentally to such an extent as to impair\nhis ability to perform his duties or is otherwise unable or unfit to\nperform his duties; or\n\n(ii)\n\nis guilty of serious misconduct in relation to his duties.\n\n5.\nA  person  who  is  appointed  to  fill  a  vacancy  created  by  the  death,\nresignation  or  removal  from  office  of  a  member  holds  office  only  for  the\nunexpired term of the member.\n\n6.\nmember shall be notified in the Official Gazette.\n\nThe  appointment,  resignation,  death  or  removal  from  office  of  a\n\n7.\nThe  Committee  shall  meet  at  such  times  as  may  be  necessary  or\nexpedient for the transaction of business, and such meetings shall be held at such\nplaces and times and on such days as the Committee determines.\n\n8.\n\nFive members of the Committee shall constitute a quorum.\n\n9.\nat meetings of the Committee.\n\nThe Chairman, or in his absence, the Deputy Chairman, shall preside\n\n10.\nWhere  the  Chairman  and  the  Deputy  Chairman  are  absent  from  a\nmeeting, the members present shall elect a member from among their number to\npreside at the meeting.\n\n\f65\n\n11.\nDecisions of the Committee shall be by a majority of votes, and where\nthe voting is equal, the Chairman or other person presiding at the meeting shall,\nin addition to an original vote, have a casting vote.\n\n12.\nthe functions of secretary to the Committee.\n\nThe Minister may by instrument in writing appoint a person to perform\n\n13.\nAll documents made by, and all decisions of, the Committee may be\nsignified  under  the  hand  of  the  Chairman  or  any  member  of  the  Committee\nauthorised to act in that behalf or by the secretary of the Committee.\n\n14.\nprocedure.\n\nSubject  to  this  Schedule,  the  Committee  may  regulate  its  own\n\n\f66\n\nSECOND SCHEDULE\n\nCAPACITY THRESHOLDS\n\n(Sections 9, 10, 55 and 77)\n\n1.\nkilowatts.\n\nThe  installed  capacity  for  the  purpose  of  section  9(2)(a)  is  10\n\n2.\nis 50 kilowatts.\n\nThe cumulative installed capacity for the purpose of section 9(2)(b)\n\n3.\n500 kilowatts.\n\nThe installed capacity for the purpose of 10(2)(c) and section 55(2) is\n\n\f67\n\nTHIRD SCHEDULE\n\nELECTRICITY APPEALS TRIBUNAL\n\n(Sections 63 and 77)\n\nThe Electricity Appeals Tribunal shall comprise 5 persons appointed\n1.\nby  the  Minister  by  instrument  in  writing  from  among  persons  qualified  and\nexperienced in Economics, Accounts, Engineering or Law or in any other area\nwhich, in the opinion of the Minister, is relevant to the discharge of the functions\nof the Tribunal.\n\n2.\na person to be Chairman and another to be Deputy Chairman, of the Tribunal.\n\nThe Minister shall appoint from among the members of the Tribunal,\n\n3.\noffice for a term of 3 years but is eligible for reappointment.\n\nA member of the Tribunal shall, subject to paragraphs 6 and 7, hold\n\n4.\nMinister determines.\n\nA  member  of  the  Tribunal  shall  be  paid  such  remuneration  as  the\n\n5.(1)\nThe Minister may by instrument in writing appoint a person to act\ntemporarily  in  the  place  of  a  member  of  the  Tribunal  where  the  member  is\ntemporarily absent or unable to act.\n\nA person appointed to fill a vacancy created by the death, resignation or\n(2)\nremoval from office of a member shall hold office only for the unexpired term\nof the member.\n\n6.\n\nA member of the Tribunal\n\n(a)\n\nmay  resign  his  office  by  instrument  in  writing  addressed  to  the\nMinister, and transmitted through the Chairman in the case of a member\nother than the Chairman; and\n\n\f68\n\n(b)\n\nshall  cease  to  be  a  member  from  the  date  the  Minister  receives  the\ninstrument, unless another date is specified in the instrument.\n\n7.\na member of the Tribunal where the Minister is satisfied that the member is\n\nThe Minister may by instrument in writing revoke the appointment of\n\n(a)\n\nincapacitated physically or mentally to such an extent as to impair his\nability to perform his functions or otherwise unable or unfit to perform\nhis functions; or\n\n(b)\n\nguilty of serious misconduct in relation to his functions.\n\n8.\nmember of the Tribunal shall be notified in the Official Gazette.\n\nThe  appointment,  resignation,  death  or  removal  from  office  of  a\n\n9.\n\nThree members of the Tribunal shall constitute a quorum.\n\n10.\nthe functions of Secretary to the Tribunal.\n\nThe Minister may by instrument in writing appoint a person to perform\n\n11.(1)\nThe Tribunal shall meet at such places and times and on such days as\nthe Tribunal determines necessary or expedient for the transaction of business.\n\nThe Chairman, or in his absence, the Deputy Chairman, shall preside at\n\n(2)\nmeetings of the Tribunal.\n\nWhere the Chairman and the Deputy Chairman are absent from a meeting,\n(3)\nthe members present shall elect a member from among their number to preside\nat the meeting.\n\nDecisions of the Tribunal shall be by a majority of votes, and where the\n(4)\nvoting is equal, the person presiding at the meeting shall, in addition to an original\nvote, have a casting vote.\n\n12.\nAll decisions taken or documents prepared by the Tribunal may be\nsignified  under  the  hand  of  the  Chairman,  any  other  member  of  the  Tribunal\nauthorized to act in that behalf or by the Secretary of the Tribunal.\n\n\f69\n\n L.R.O. 1998FOURTH SCHEDULE(Section 77)CONSEQUENTIAL  AMENDMENTSColumn 1Enactments1.Utility Regulation Act,Cap. 282.2.Fair Trading CommissionAct, Cap. 326BColumn 2AmendmentsIn section 24A, delete the deﬁ nition of “public grid” and substitute the following:“ “public grid” means the physically connected generation, transmission and distribution systems used for the supply of electricity to the public;”.1.In section 2(1), delete the definitions of“independent power producer” and “public grid” andsubstitute the following:“ “independent power producer” means a person, other than an electric utility, who owns or operates, on a commercial basis, a facility for the generation or storage of electricity primarily for supply to the public, whether through the public grid or otherwise;“public grid” means the physically connected generation, transmission and distribution systems used for the supply of electricity to the public;”.\f70\n\n L.R.O. 1998CONSEQUENTIAL  AMENDMENTS - (Cont'd)Fourth Schedule - (Cont'd)Column 1Enactments2. Fair Trading Commission  Act, Cap. 326B - (Cont'd)Column 2Amendments2. In section 4(a) in subsection (1), delete paragraph (c) and substitute the following:“(c) discharge the functions with which it is charged under the Electricity Supply Act, 2024 (Act 2024-  ).”;(b) in subsection (4A), delete paragraph (c) and  substitute the following:“(c) a licensee under the  Telecommunications Act, Cap. 282B or the Electricity Supply Act, 2024 (Act 2024-  ).”; (c) in subsection (5), delete paragraph (d) and substitute the following:“(d) in the Electricity Supply Act, 2024, (Act 2024-  ).”; and(d) in subsection (6), delete the words “the Electric  Light and Power Act, 2013, Act 2013-21” and  substitute the words “the Electricity Supply Act, 2024 (Act 2024-  )”.\f71\n\n L.R.O. 1998CONSEQUENTIAL  AMENDMENTS - (Concl'd)Fourth Schedule - (Concl'd)Column 1Enactments2. Fair Trading Commission  Act, Cap. 326B - (Concl'd)Column 2Amendments3. In section 5(1), delete the words “the ElectricLight and Power Act, 2013, Act 2013-21” and substitute the words “the Electricity Supply Act, 2024 (Act 2024-  )”.4. In section 6(3)(a), delete subparagraph (iii) and substitute the following:“(iii) such provisions of the  Electricity Supply Act, 2024, (Act 2024-  ) as relate to the functions of the Commission; and”.\f72\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}