{
  "bill_id": 800,
  "slug": "sexual-offences-amendment-bill-2024",
  "title": "Sexual Offences (Amendment) Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/b27e99bcb3647b5f1b792ac2093f8342.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-10-09",
  "first_reading": "2024-11-08",
  "gazette_date": "2024-10-01",
  "markdown": "2024-07-25\n\nOBJECTS AND REASONS\n\nThis Bill would amend the Sexual Offences Act, Cap. 154 in order to create\n\nnew sexual offences.\n\n\f2\n\nArrangement of Sections\n\nShort title\n\nAmendment of section 2 of Cap. 154\n\nRepeal and replacement of section 3 of Cap. 154\n\nRepeal of section 4 of Cap. 154\n\nRepeal of section 5 of Cap. 154\n\nInsertion of sections 5A, 5B and 5C into Cap. 154\n\nAmendment of section 6 of Cap. 154\n\nRepeal and replacement of section 7 of Cap. 154\n\nRepeal and replacement of section 8 of Cap. 154\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nRepeal of section 9 of Cap. 154\n\n11.\n\nInsertion of sections 9A, 9B, 9C, 9D and 9E into Cap. 154\n\n12.\n\nAmendment of section 11 of Cap. 154\n\n13.\n\nRepeal of section 12 of Cap. 154\n\n14.\n\nAmendment of section 13 of Cap. 154\n\n15.\n\nAmendment of section 14 of Cap. 154\n\n\f3\n\n16.\n\nAmendment of section 15 of Cap. 154\n\n17.\n\nAmendment of section 16 of Cap. 154\n\n18.\n\nAmendment of section 17 of Cap. 15\n\n19.\n\nRepeal and replacement of section 28 into Cap. 154\n\n20.\n\nRepeal and replacement of section 30 of Cap. 154\n\n21.\n\nRepeal of section 37 of Cap. 154\n\n22.\n\nTransitional\n\n23.\n\nCommencement\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to amend the Sexual Offences Act, Cap. 154 in order to create new\n\nsexual offences.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f6\n\nShort title\n\n1.\n2024.\n\nThis  Act  may  be  cited  as  the  Sexual  Offences  (Amendment)  Act,\n\nAmendment of section 2 of Cap. 154\n\nSection 2 of the Sexual Offences Act, Cap. 154, in this Act referred\n2.\nto  as  the  principal  Act,  is  amended  by  inserting,  in  alphabetical  order,  the\nfollowing definition:\n\n“ “minor” means a person who is under the age of 16 years;”.\n\nRepeal and replacement of section 3 of Cap. 154\n\n3.\nsubstituted:\n\nSection  3  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Rape\n\n3.(1)\nAny person who has sexual intercourse with another person\nwithout the consent of the other person and who knows that the other\nperson does not consent to the intercourse or is reckless as to whether\nthe other person consents to the intercourse is guilty of the offence of\nrape and is liable on conviction on indictment to imprisonment for life.\n\nFor the purposes of subsection (1), no consent is obtained where\n\n(2)\nthe complainant submits or does not resist by reason of\n\n(a)\n\n(b)\n\nthe application of force to the complainant or to a person other\nthan the complainant;\n\nthreats or fear of the application of force to the complainant\nor to a person other than the complainant;\n\n(c)\n\nthe personation of the spouse of the complainant;\n\n\f7\n\n(d)\n\nfalse and fraudulent representations as to the nature of the act;\n\n(e)\n\n(f)\n\n(g)\n\nthe  use  of  the  accused’s  position  of  authority  over  the\ncomplainant;\n\nintimidation of any kind; or\n\nmental  disorder  or  physical  disability  the  complainant  is\nunable to do one or more of the following:\n\n(i)\n\nto understand the nature of the act; or\n\n(ii)\n\nto decide\n\n(A)\n\nwhether the act should take place; or\n\n(B)\n\nwhether to engage in the act; or\n\n(iii)\n\nto communicate the decision.\n\nNotwithstanding  section  21,  a  minor  is  deemed  incapable  of\n\n(3)\ncommitting the offence of rape.\n\nFor  the  purposes  of  this  Act,  a  minor  is  deemed  incapable  of\n\n(4)\nconsenting to sexual intercourse.\n\nA spouse commits the offence of rape where a spouse has sexual\n(5)\nintercourse with the other spouse without that spouse’s consent by force\nor fear, where the spouse knows that the other spouse does not consent\nto the intercourse or is reckless as to whether the other spouse consents\nto the intercourse.\n\nA spouse who commits the offence of rape is liable on conviction\n\n(6)\non indictment to imprisonment for life.\n\nFor the purposes of this section, “rape” includes the introduction,\n(7)\nto any extent, in circumstances where the introduction of the penis of\na person into the vagina of another person would be rape,\n\n(a)\n\nof the penis or any other part of a person’s body into the anus\nor mouth of another person; or\n\n\f8\n\n(b)\n\nof an object, not being part of the human body, manipulated\nby a person into the vagina or anus of another.”.\n\nRepeal of section 4 of Cap. 154\n\n4.\n\nSection 4 of the principal Act is repealed.\n\nRepeal of section 5 of Cap. 154\n\n5.\n\nSection 5 of the principal Act is repealed.\n\nInsertion of sections 5A, 5B and 5C into Cap. 154\n\n6.\nas sections 5A, 5B and 5C:\n\nThe principal Act is amended by inserting the following new sections\n\n“Sexual intercourse with a minor\n\n5A.(1)\nWhere a person has sexual intercourse with a minor, with\nthe purported consent of that minor and that minor is under the age of\n16, that person is guilty of an offence and is liable on conviction on\nindictment to imprisonment for life.\n\nIt  is  a  defence  for  a  person  charged  with  an  offence  under\n\n(2)\nsubsection (1) if the person proves that the person\n\n(a)\n\n(b)\n\nreasonably believed that the minor was 16 years of age or\nover and had reasonable cause for that belief; and\n\nis not over the age of 24 years and has not been previously\ncharged with the same or a similar offence.\n\n\f9\n\nSexual touching of a minor\n\n5B.(1)\npurpose,\n\n(a)\n\n(b)\n\nA  person  commits  an  offence  if  the  person,  for  a  sexual\n\ntouches, directly or indirectly, any part of the body of a minor,\nwith a part of the person’s body or with an object; or\n\ninvites,  counsels  or  incites  a  minor  to  touch,  directly  or\nindirectly, the body of\n\n(i)\n\nany  person,  including  the  body  of  the  first  mentioned\nperson; or\n\n(ii)\n\nthe body of the minor\n\nwith a part of the body of the minor or with an object.\n\nFor  the  purposes  of  this  section,  touch  is  done  for  a  sexual\n\n(2)\npurpose if a reasonable person would consider that\n\n(a)\n\n(b)\n\nwhatever the circumstances or any person’s purpose for the\ntouch, it is because the touch is of a sexual nature; or\n\nbecause of its nature and because of the circumstances or the\npurpose of any person in relation to it, the touch is sexual.\n\nA person who commits an offence under this section is liable on\n\n(3)\nconviction on indictment to imprisonment for a term of 10 years.\n\nMeeting a minor after sexual grooming\n\n5C.(1)\n\nA person commits an offence where\n\n(a)\n\nhaving  met  or  communicated  with  a  minor  on  one  earlier\noccasion or more\n\n(i)\n\nintentionally meets the minor; or\n\n\f10\n\n(ii)\n\ntravels with the intention of meeting the minor whether\nin Barbados or elsewhere; and\n\n(b)\n\nat the time of the meeting or travel the person\n\n(i)\n\nintends  to  do  anything  to  or  in  respect  of  the  minor,\nwhether  in  Barbados  or  elsewhere,  which  if  done  in\nBarbados would be a sexual offence under this Act; and\n\n(ii)\n\ndoes not have reason to believe that the minor is over the\nage of 16 years.\n\nA person who commits an offence under this section is liable on\n\n(2)\nconviction on indictment to imprisonment for a term of 20 years.”.\n\nAmendment of section 6 of Cap. 154\n\n7.\nand substituting the following:\n\nSection 6 of the principal Act is amended by deleting subsection (3)\n\nA  person  who  commits  the  offence  of  incest  is  liable  on\n\n“(3)\nconviction on indictment to imprisonment\n\n(a)\n\n(b)\n\n(c)\n\nif committed by an adult with a minor, for life;\n\nif committed by an adult with a person 16 years of age or over\nbut under 18 years of age, for 20 years; and\n\nif committed between persons 16 years of age or over but\nunder 18 years of age, for 2 years.”.\n\nRepeal and replacement of section 7 of Cap. 154\n\n8.\nsubstituted:\n\nSection  7  of  the  principal  Act  is  deleted  and  the  following  is\n\n\f11\n\n“Sexual intercourse with step-child etc\n\n7.(1)\nA person who has sexual intercourse with another person\nwho is under the age of 18 years and is the first mentioned person’s\nadopted child, step-child, foster child, ward or dependant in the person’s\ncustody is guilty of an offence.\n\nA  person  guilty  of  an  offence  under  this  section  is  liable  on\n\n(2)\nconviction on indictment to imprisonment for life.\n\nA person shall not be guilty of an offence under this section if\n\n(3)\nthe other person is the spouse of the first mentioned person.”.\n\nRepeal and replacement of section 8 of Cap. 154\n\n9.\nsubstituted:\n\nSection  8  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Violation of person suffering from mental disorder or\nphysical disability\n\n8.(1)\nA person is guilty of an offence if the person penetrates the\nanus or vagina of another person, whether with a penis or any other part\nof the person’s body or with any object whatsoever, or performs any\nother sexual act with the other person, if the other person is suffering\nfrom a mental disorder or physical disability, knowing that the other\nperson is suffering from the disorder or disability and that the other\nperson does not consent or is incapable of consenting to the act.\n\nA  person  who  is  suffering  from  a  mental  disorder  or  physical\n(2)\ndisability shall be regarded as being incapable of consenting to engage\nin any act where by reason of mental disorder or physical disability, the\nperson is unable to do one or more of the following:\n\n(a)\n\nto understand the nature of the act;\n\n\f12\n\n(b)\n\nto decide\n\n(i)\n\nwhether to engage in the act; or\n\n(ii)\n\nwhether the act should take place; or\n\n(c)\n\nto communicate the person’s decision.\n\nA  person  guilty  of  an  offence  under  this  section  is  liable  on\n\n(3)\nconviction on indictment to imprisonment for life. ”.\n\nRepeal of section 9 of Cap. 154\n\n10.\n\nSection 9 of the principal Act is repealed.\n\nInsertion of sections 9A, 9B, 9C, 9D and 9E into Cap. 154\n\n11.\nimmediately after section 9A:\n\nThe principal Act is amended by inserting the following new sections\n\n“Causing or inciting a minor to engage in sexual activity\n\n9A.(1)\nA  person  who  intentionally  causes  or  incites  a  minor  to\nengage in sexual activity is guilty of an offence unless the person has\nreason to believe that the minor is over the age of 16 years.\n\n(2)\nA  person  guilty  of  an  offence  under  this  section  is  liable  on\nconviction on indictment to imprisonment for life if the activity caused\nor incited involved\n\n(a)\n\n(b)\n\npenetration of a minor’s anus, vagina or mouth with a penis,\nor  any  other  part  of  a  person’s  body  or  with  any  object\nwhatsoever; or\n\npenetration  of  the  person’s  anus,  vagina  or  mouth  with  a\npenis,  or  any  part  of  a  minor’s  body  or  any  with  object\nwhatsoever.\n\n\f13\n\nIf\n\nthe  activity  does  not\n\n(3)\nin\nsubsection (2), a person guilty of an offence under this section is liable\non\n\ninvolve  activity  mentioned\n\n(a)\n\n(b)\n\nsummary conviction to a fine of $10 000 or to imprisonment\nfor a term of 2 years or to both; or\n\nconviction on indictment to imprisonment for a term of 15\nyears.\n\nEngaging in sexual activity in the presence of a minor\n\n9B.(1)\nengages in sexual activity for the purpose of sexual gratification\n\nA person is guilty of an offence if the person intentionally\n\n(a)\n\nin the presence of a minor or the minor is in a place from\nwhich the minor can observe the person;\n\n(b)\n\nknowing or believing\n\n(i)\n\nthat the minor is aware of the sexual activity; or\n\n(ii)\n\nintending that the minor should be aware that the person\nis engaging in the sexual activity.\n\n(2)\n\nA person guilty of an offence under this section is liable\n\n(a)\n\n(b)\n\non summary conviction, to a fine of $10 000 or imprisonment\nfor a term of 2 years or to both; or\n\non conviction on indictment to imprisonment for a term of 10\nyears.\n\nCausing a minor to watch a sexual act\n\n9C.(1)\nA  person  is  guilty  of  an  offence  if,  for  the  purpose  of\nobtaining sexual gratification, the person intentionally causes a minor\n\n(a)\n\nto watch a third person engaging in sexual activity; and\n\n\f14\n\n(b)\n\nto  look  at  an  image,  photograph,  or  video,  including\nanimation, of any person engaging in sexual activity.\n\n(2)\nA  person  guilty  of  an  offence  under  this  section  is  liable  on\nsummary conviction to a fine of $100 000 or to imprisonment for a term\nof 2 years or to both.\n\nSexual communication with a minor\n\n9D.(1)\nA person commits an offence and is liable on conviction on\nindictment to imprisonment for 10 years if, for the purpose of obtaining\nsexual gratification\n\n(a)\n\n(b)\n\nthe person intentionally communicates with a minor;\n\nthe communication\n\n(i)\n\nis sexual; or\n\n(ii)\n\nis intended to encourage the minor to make to the person\nor another person a communication which is sexual; and\n\n(c)\n\nthe first mentioned person does not have reason to believe\nthat the minor is 16 years of age or over.\n\nTaking indecent photographs of a minor\n\n9E.\nindictment to imprisonment for 10 years if the person\n\nA person commits an offence and is liable on conviction on\n\n(a)\n\ntakes  or  permits  to  be  taken  any  indecent  photograph  of  a\nminor;\n\n(b)\n\ndistributes or shows an indecent photograph of a minor;\n\n(c)\n\nhas  in  the  person’s  possession  indecent  photographs  of  a\nminor, whether or not with a view to the photographs being\ndistributed or shown by that person or others; or\n\n\f15\n\n(d)\n\npublishes or consents to the publication of any advertisement\nlikely  to  be  understood  as  conveying  that  the  advertiser\ndistributes  or  shows  indecent  photographs  of  a  minor  or\nintends to do so.”.\n\nAmendment of section 11 of Cap. 154\n\n12.\nand substituting the following:\n\nSection 11 of the principal Act is amended by deleting subsection (1)\n\nA person who indecently assaults another is guilty of an offence\n\n“(1)\nand is liable\n\n(a)\n\n(b)\n\non summary conviction to imprisonment for 5 years; or\n\non  conviction  on  indictment  to  imprisonment  for  10\nyears.”.\n\nRepeal of section 12 of Cap. 154\n\n13.\n\nSection 12 of the principal Act is repealed.\n\nAmendment of section 13 of Cap. 154\n\n14.\nyears” and substituting the word “life”.\n\nSection 13 of the principal Act is amended by deleting the words “15\n\nAmendment of section 14 of Cap. 154\n\n15.\nyears” and substituting the word “life”.\n\nSection 14 of the principal Act is amended by deleting the words “15\n\nAmendment of section 15 of Cap. 154\n\n16.\n“15 years” and substituting the words “25 years”.\n\nSection 15(1) of the principal Act is amended by deleting the words\n\n\f16\n\nAmendment of section 16 of Cap. 154\n\n17.\nyears” and substituting the word “life”.\n\nSection 16 of the principal Act is amended by deleting the word “10\n\nAmendment of section 17 of Cap. 15\n\n18.\nand the following is substituted:\n\nSection 17 of the principal Act is amended by deleting subsection (1)\n\n“(1)\n\nA person who\n\n(a)\n\n(b)\n\nbeing the owner, occupier or manager of premises; or\n\nhaving control of premises or assisting in the management\nand control of premises,\n\ninduces or knowingly suffers a minor to resort to or to be in or upon the\npremises for the purpose of engaging in sexual activity with another\nperson is guilty of an offence and is liable on conviction on indictment\nto imprisonment for life.”.\n\nRepeal and replacement of section 28 into Cap. 154\n\n19.\nsubstituted:\n\nSection  28  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Corroboration\n\n28.\noffence under this Act, no corroboration is required.”.\n\nSubject to section 31, where an accused is charged with an\n\n\f17\n\nRepeal and replacement of section 30 of Cap. 154\n\n20.\nsubstituted:\n\nSection  30  of  the  principal  Act  is  deleted  and  the  following  is\n\n“Hearing in camera\n\n30.\ncourt shall hear the evidence of the complainant in camera.”.\n\nOn a trial of an accused for an offence under this Act, the\n\nRepeal of section 37 of Cap. 154\n\n21.\n\nSection 37 of the principal Act is repealed.\n\nTransitional\n\n22.\nbefore the commencement of this Act.\n\nNothing  contained  in  this  Act  applies  to  any  offence  committed\n\nCommencement\n\n23.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f18\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}