{
  "bill_id": 802,
  "slug": "merchant-shipping-liability-and-compensation-act-2024",
  "title": "Merchant Shipping (Liability and Compensation) Act, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/3b8540c06f89fd1cdb8563c564a74d74.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-10-23",
  "first_reading": "2024-11-08",
  "gazette_date": "2024-10-07",
  "markdown": "2024-09-02\n\nOBJECTS AND REASONS\n\nThis Bill will make provision for the limitation of the liability shipowners in\nrelation  to  certain  maritime  claims  and  ensure  that  victims  are  reasonably\ncompensated in relation to maritime claims.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\nShort title\n\nInterpretation\n\nPurpose\n\nAct binds the State\n\nReferences to conventions, protocols or codes\n\nInterpretation\n\nAdministration\n\nPART II\n\nCIVIL LIABILITY FOR OIL POLLUTION DAMAGE\n\nDivision 1\n\nInternational Convention on Civil Liability for Oil Pollution Damage Liability\n\n8.\n\n9.\n\nDefinitions-Part II\n\nIncorporation of the 1992 Convention, as amended\n\n10.\n\nIncorporation of 1992 Protocol\n\n\f3\n\n11.\n\nLiability for oil pollution in case of tankers\n\n12.\n\nApportionment of liability for damage or loss\n\n13.\n\nTime limit for proceedings against owners or ship\n\n14.\n\nLimitation of liability\n\n15.\n\nApplication to Government and its ships\n\nDivision 2\n\nInternational Convention on Civil Liability for Oil Pollution Damage\n\n16.\n\nApplication\n\n17.\n\nClaims for compensation\n\n18.\n\nApplications to determine limit of liability\n\n19.\n\nTransfer of proceedings\n\n20.\n\nRegulations\n\nInsurance Certificates relating to Liability for Oil Pollution Damage\n\nDivision 3\n\n21.\n\nDefinitions\n\n22.\n\nApplication\n\n23.\n\nInsurance certificates to be carried\n\n24.\n\nIssuance of insurance certificates\n\n25.\n\nExtension, cancellation and lapsing of insurance certificates\n\n\f26.\n\nGovernment ships\n\n4\n\nPART III\n\nPROOF OF POSSESSION OF ADEQUATE INSURANCE COVER\n\n27.\n\nDefinitions - Part III\n\n28.\n\nApplication\n\n29.\n\nInsurance certificates to be carried\n\nPART IV\n\nRECOVERY OF EXPENSES\n\n30.\n\nExpenses incurred by authorized officers\n\n31.\n\nExpenses incurred by the Administration\n\n32.\n\nDetention of ships\n\n33.\n\nRecovery of loss by the Administration\n\nPART V\n\nCIVIL LIABILITY FOR NUCLEAR DAMAGE\n\n34.\n\nConvention to have force of law\n\n35.\n\nApplication\n\n36.\n\nExceptions\n\n\f5\n\n37.\n\nLimitation on operator’s liability\n\nLiability for Nuclear Incidents\n\n38.\n\nLiability\n\n39.\n\nExoneration of liability\n\n40.\n\nPreventive measure – liability in Barbados\n\n41.\n\nPreventive measure – liability in Convention contracting state\n\n42.\n\nStrict liability\n\n43.\n\nLiability – joint and several or solidarily\n\n44.\n\nPerson responsible for nuclear incident\n\n45.\n\nNo recourse\n\n46.\n\nBodily injury or damage to property\n\nCompensable Damage\n\n47.\n\nPsychological trauma\n\n48.\n\nLiability for economic loss\n\n49.\n\nCosts and wages\n\n50.\n\nPower failure\n\n51.\n\nEnvironmental damage - Barbados\n\n52.\n\nEnvironmental damage – other Convention contracting state\n\n\f6\n\nAdditional Safety Compliance Requirements\n\n53.\n\nNuclear cargo ship safety certificate\n\n54.\n\nINF Code compliance\n\nPART VI\n\nCIVIL LIABILITY FOR CARRIAGE OF HAZARDOUS AND NOXIOUS\nSUBSTANCES\n\n55.\n\nDefinitions - Part VI\n\n56.\n\nIncorporation of Protocol\n\n57.\n\nException\n\n58.\n\nGeneral obligations\n\n59.\n\nRequirement to carry certificate\n\n60.\n\nCompliance and enforcement\n\n61.\n\nOffence\n\n62.\n\nHNS reporting\n\n63.\n\nReporting of HNS contributing cargo\n\nPART VII\n\nLIMITATION OF LIABILITY FOR MARITIME CLAIMS\n\n64.\n\nDefinitions - Part VII\n\n65.\n\nForce of law\n\n\f7\n\n66.\n\nLiability for vessels above and under 300 GT\n\n67.\n\nLiability for vessels 150 GT and below\n\n68.\n\nCompulsory insurance requirements for shipowners\n\n69.\n\nCompulsory insurance requirements for fishing vessel owners\n\n70.\n\nLimitation of liability for passenger claims\n\n71.\n\nLimitation of liability – docks, canals and ports\n\n72.\n\nExclusion of wrecks and cargo removal\n\n73.\n\nExclusion of claims relating to hazardous and noxious substances\n\n74.\n\nTonnage calculation\n\n75.\n\nConduct barring limitation\n\n76.\n\nAmendment of maximum liability\n\nPART VIII\n\nJURISDICTION OF ADMIRALTY COURT\n\n77.\n\nDefinitions - Part VIII\n\n78.\n\nAdmiralty jurisdiction\n\n79.\n\nRight to assert limitation defence\n\n80.\n\nPowers of the Admiralty Court\n\n81.\n\nPostponement of distribution\n\n\f8\n\n82.\n\nLiens and other rights\n\n83.\n\nProcedural matters\n\n84.\n\nInterest\n\n85.\n\nRelease of ships or property\n\n86.\n\nLimitation fund in a state other than Barbados\n\nPART IX\n\nGENERAL MATTERS RELATING TO PART VII AND VIII\n\n87.\n\nProsecution of offences under sections 23(1), (2) and (3) and 32(3)\n\n88.\n\nNo time limit for prosecution\n\n89.\n\nRegulations\n\n90.\n\nDelegation\n\n91.\n\nImplementing Article 6(2) of LLMC\n\n92.\n\nImplementing Article 6(3) 1996 Protocol to the LLMC\n\n93.\n\nPlace where fund constituted\n\n94.\n\nCurrency in which fund to be constituted\n\n95.\n\nMechanics of constituting fund\n\n\f9\n\nPART X\n\nLIABILITY FOR MARITIME CARRIAGE OF PASSENGERS AND\nLUGGAGE\n\n96.\n\nDefinitions-Part X\n\n97.\n\nForce of law\n\n98.\n\nApplication\n\n99.\n\nInsurance requirement\n\n100.\n\nInsurance certificates\n\n101.\n\nIssuance of certificates\n\n102.\n\nOffences\n\n103.\n\nPower to detain\n\n104.\n\nArbitration\n\n105.\n\nCompensation for unjustified detention\n\nPART XI\n\nCIVIL LIABILITY FOR BUNKER OIL POLLUTION DAMAGE\n\n106.\n\nDefinitions-Part XI\n\n107.\n\nApplication\n\n108.\n\nForce of law\n\n\f10\n\n109.\n\nCompulsory insurance or financial security\n\n110.\n\nLiability of the shipowner\n\n111.\n\nLimitation of liability\n\n112.\n\nCertification requirements\n\nPART XII\n\nLIMITATION OF TIME\n\n113.\n\nDefinitions-Part XII\n\n114.\n\nLimitation period for claim or lien\n\n115.\n\nExtension of time\n\nPART XIII\n\nMISCELLANEOUS\n\n116.\n\nRegulations\n\n117.\n\nPower to amend schedules\n\n118.\n\nDenunciations\n\nSCHEDULE\n\nDECLARATIONS AND RESERVATIONS TO THE CONVENTION ON\nLIMITATION OF LIABILITY FOR MARITIME CLAIMS 1976, AS\nAMENDED\n\n\fBARBADOS\n\nA Bill entitled\n\nAn Act to make provision for the limitation of the liability shipowners in\nrelation  to  certain  maritime  claims  and  ensure  that  victims  are  reasonably\ncompensated in relation to maritime claims.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f12\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\nCompensation) Act, 2024.\n\nThis  Act  may  be  cited  as  the  Merchant  Shipping  (Liability  and\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Administration” means the Barbados Maritime Transport Administration;\n\n“authorized officer” means\n\n(a)\n\nan authorized officer of the port as defined in the Merchant Shipping\nAct, 2024 (Act 2024- );\n\n(b)\n\na maritime law enforcement officers as defined in that Act; or\n\n(c)\n\nany other person designated in writing as an authorized officer by the\nAdministration;\n\n“Barbados vessel” has the same meaning as in the Merchant Shipping Act, 2024\n\n(Act 2024- );\n\n“financial security” includes a guarantee of a bank or similar financial institution;\n\n“LLMC  Convention”  means  the  Convention  on  Limitation  of  Liability  for\nMaritime Claims, 1976, concluded at London on November 19th, 1976, as\namended;\n\n“officer” means\n\n(a)\n\na  maritime  law  enforcement  officer  within  the  meaning  of  the\nMerchant Shipping Act, 2024 (Act 2024 - );\n\n\f13\n\n(b)\n\n(c)\n\nan  officer  of  customs  within  the  meaning  of  the  Customs  Act\n(Act 2021-34); or\n\nan authorized officer under the Merchant Shipping Act, 2024 (Act 2024\n- );\n\n“SDRs” mean Special Drawing Rights and refers to the international reserve asset\ncreated  by  the  International  Monetary  Fund  to  supplement  the  official\nreserves of its member countries, and which is used by the International\nMonetary  Fund  and  its  member  countries  as  a  form  of  currency  against\nwhich countries’ actual monetary currencies may be pegged;\n\n“ship” means a vessel used in navigation, and includes\n\n(a)\n\na  craft  designed,  used  or  capable  of  being  used  solely  or  partly  for\nnavigation in, on, through or immediately above water, without regard\nto method or lack of propulsion;\n\n(b)\n\na maritime autonomous surface ship;\n\n(c)\n\n(d)\n\na  lighter,  barge  or  similar  vessel,  a  hovercraft,  a  hydrofoil,  a\nsubmersible and a floating craft, however propelled; and\n\na structure, whether completed or in the course of completion, that has\nbeen launched and is intended for use in navigation as a ship or part of\na ship; and\n\n“vessel”has  the  same  meaning  as  in  the  Merchant  Shipping  Act,  2024  (Act\n\n2024- ).\n\nPurpose\n\n3.\n\nThe purposes of this Act are to\n\n(a)\n\nlimit the liability of shipowners in respect of certain maritime claims\nto an amount specified in this Act, irrespective of the total amount of\nsuch claims; and\n\n\f14\n\n(b)\n\nensure that victims are reasonably compensated in relation to maritime\nclaims specified in this Act.\n\nAct binds the State\n\n4.\n\nThis Act shall bind the State.\n\nReferences to conventions, protocols or codes\n\nA reference to a convention, protocol or code given the force of law\n5.\nunder this Act or implemented by regulations under this Act is to be construed\n\n(a)\n\n(b)\n\nas a reference to the conventions, protocol or codes as modified from\ntime to time; and\n\nif the convention, protocol or code is replaced in whole or in part by\nanother instrument, as a reference to that instrument.\n\nInterpretation\n\n6.\na reference to the Barbados Maritime Transport Administration.\n\nA reference in a convention to a competent authority is to be read as\n\nAdministration\n\n7.\n\nThis Act shall be administered by the Director of Ocean Affairs.\n\n\f15\n\nPART II\n\nCIVIL LIABILITY FOR OIL POLLUTION DAMAGE\n\nDivision 1\n\nInternational Convention on Civil Liability for Oil Pollution Damage Liability\n\nDefinitions-Part II\n\n8.\n\nIn this Part,\n\n“Convention waters” means the waters of a party to the International Convention\n\non Civil Liability for Oil Pollution Damage, 1992, as amended.\n\nIncorporation of the 1992 Convention, as amended\n\nExcept  as  otherwise  provided  by  this  Act,  the  International\n9.\nConvention on Civil Liability for Oil Pollution Damage, 1992 shall have the force\nof law in Barbados.\n\nIncorporation of 1992 Protocol\n\n10.\nThe Protocol to the International Convention on the Establishment of\nan International Fund for Compensation for Oil Pollution Damage, 1992 shall\nhave the force of law in Barbados.\n\nLiability for oil pollution in case of tankers\n\n11.(1)\n\nThis section applies to\n\n(a)\n\na ship constructed or adapted solely for carrying oil in bulk as cargo;\nor\n\n(b)\n\na ship capable of carrying oil and other cargoes\n\n(i)\n\nwhile it is carrying oil in bulk as cargo; and\n\n\f16\n\n(ii)\n\nwhile it is carrying other cargo, unless it is proved that no residues\nfrom the carriage of oil remain in the ship while it is on a voyage\nfollowing the carriage of oil.\n\nWhere, as a result of an occurrence, oil is discharged or escapes from a\n\n(2)\nship, the registered owner of the ship shall be liable\n\n(a)\n\n(b)\n\nfor  any  damage  caused  outside  the  ship  in  Barbados’  waters  or\nConvention waters by contamination resulting from the discharge or\nescape;\n\nfor the cost of any measures reasonably taken after the discharge or\nescape to prevent or minimise any damage caused in Barbados’ waters\nor Convention waters by contamination resulting from the discharge\nor escape; and\n\n(c)\n\nfor any damage caused in Barbados’ waters or Convention waters by\nsuch measures.\n\nWhere,  as  a  result  of  an  occurrence,  there  arises  a  grave  and  imminent\n(3)\nthreat of damage being caused outside a ship by contamination that might result\nif there were a discharge or escape of oil from the ship, the registered owner of\nthe ship shall be liable\n\n(a)\n\n(b)\n\nfor the cost of any measures reasonably taken to prevent or minimise\nsuch damage in Barbados’ waters or Convention waters; and\n\nfor  any  damage  caused  outside  the  ship  in  Barbados’  waters  or\nConvention waters by such measures.\n\n(4)\n\nWhere\n\n(a)\n\n(b)\n\nas a result of an occurrence, a liability is incurred under this section by\nthe registered owner of each of 2 or more ships; and\n\nthe damage or cost for which each of the registered owners would be\nliable cannot reasonably be separated from that for which the others\nwould be liable,\n\n\f17\n\neach of the registered owners shall be liable, jointly with the others, for the whole\nof the damage or cost for which the registered owners together would be liable\nunder this section.\n\nApportionment of liability for damage or loss\n\nWhere, by the fault of 2 or more ships, damage or loss is caused to\n12.(1)\none or more of those ships, to their cargoes or freight or to any property on board,\nthe persons referred to in subsection (3) shall be liable for the damage or loss be\nin proportion to the degree to which each ship was in fault.\n\nIf under subsection (1) it is not possible to establish different degrees of\n\n(2)\nfault, the liability shall be apportioned equally.\n\n(3)\n\nThis section applies to\n\n(a)\n\n(b)\n\n(c)\n\nthe owners of a ship;\n\nany other person who is responsible for the fault of a ship; and\n\nwhere, by virtue of a charter or demise or for any other reason, the\nowners are not responsible for the navigation and management of the\nship,  the  charterers  or  other  persons  responsible  the  navigation  and\nmanagement of the ship at time of the occurrence.\n\n(4)\n\nNothing in this section shall\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nrender a ship liable for any loss or damage to which the fault of the ship\nhas not contributed;\n\naffect the liability of a person under a contract of carriage or any other\ncontract;\n\nimpose a liability upon a person from which he is exempted by contract\nor by law; or\n\naffect the right of a person to limit his liability in the manner provided\nby law.\n\n(5)\n\nIn this section, “freight” includes passage money and hire.\n\n\f18\n\n(6)\nIn this section, references to damage or loss caused by the fault of a ship\ninclude references to any salvage or other expenses, consequent upon that fault,\nthat are recoverable at law by way of damages.\n\nTime limit for proceedings against owners or ship\n\n13.(1)\nagainst a ship or her owners\n\nThis  section  applies  to  any  proceedings  to  enforce  a  claim  or  lien\n\n(a)\n\n(b)\n\nin respect of damage or loss caused, by the fault of that ship, to another\nship, its cargo or freight or property on board it; or\n\nfor damages for loss of life or personal injury caused by the fault of\nthat ship to a person on board another ship.\n\n(2)\n\nThe extent of the fault is immaterial for the purposes of this section.\n\nSubject to subsections (5) and (6), no proceedings to which this section\n\n(3)\napplies shall be brought more than 2 years after the day when\n\n(a)\n\n(b)\n\nthe damage or loss was caused; or\n\nthe loss of life or injury was suffered.\n\nSubject  to  subsections  (5)  and  (6),  no  proceedings  under  section  12  to\n(4)\nenforce a contribution in respect of an overpaid proportion of any damages for\nloss of life or personal injury shall be brought more than 1 year after the day on\nwhich the payment was made.\n\nA court having jurisdiction in such proceedings may, in accordance with\n(5)\nrules of the court, extend the period allowed for bringing proceedings to an extent\nand on such conditions as it thinks fit.\n\nSuch a court, if satisfied that there has not been during the period allowed\n(6)\nfor bringing proceedings a reasonable opportunity to arrest the defendant ship\nwithin\n\n(a)\n\nthe jurisdiction of the court; or\n\n\f19\n\n(b)\n\nthe territorial sea of the country to which the plaintiff’s ship belongs\nor in which the plaintiff resides or has his principal place of business,\n\nshall extend the period allowed for bringing proceedings to an extent sufficient\nto give a reasonable opportunity to arrest the ship.\n\nLimitation of liability\n\n14.(1)\nauthority and the owners of a dock or canal.\n\nThis section applies in relation to a harbour authority, a conservancy\n\nThe liability of an authority or person for a loss or damage caused to a ship,\n(2)\nor to any goods, merchandise or other things on board a ship, shall be limited in\naccordance  with  subsection  (5)  by  reference  to  the  tonnage  of  the  largest\nBarbados ship that, at the time of the loss or damage is, or within the preceding\n5 years has been, within the area over which the authority or person discharges\nany functions.\n\nThe limitation of liability under this section relates to the whole of any\n(3)\nlosses and damage that may arise on any one occasion, including losses or damage\nsustained by more than one person, and applies whether the liability arises at\ncommon  law  or  under  national  legislation,  and  notwithstanding  anything\ncontained in that legislation.\n\nThis section does not exclude the liability of an authority or person for a\n(4)\nloss or damage resulting from a personal act or omission of the authority or person\nmentioned in Article 4 of the Convention on Limitation of Liability for Maritime\nClaims 1976, as amended.\n\nThe limit of liability of a ship shall be ascertained by applying to the ship\n(5)\nthe  method  of  calculation  specified  in  paragraph  1(b)  of  Article  6  of  the\nConvention on Limitation of Liability for Maritime Claims 1976, as amended,\nexcept that in its application to a ship with a tonnage less than 300 GT\n\n(a)\n\nthe amount in paragraph 1(a)(i) shall be read as 1,000,000 Units of\nAccount; and\n\n\f20\n\n(b)\n\nthe  amount  in  paragraph  1(b)(i)  shall  be  read  as  500,000  Units  of\nAccount.\n\n(6)\nArticles  11  and  12  of  that  Convention  on  Limitation  of  Liability  for\nMaritime Claims 1976, as amended, shall apply for the purposes of this section,\nwith the following modifications:\n\n(a)\n\n(b)\n\n(c)\n\nthe Finance Minister may, in consultation with the Shipping Minister,\nby order, prescribe the rate of interest to be applied for the purposes of\nparagraph 1 of article 11;\n\nan order under paragraph (a) shall be laid before Parliament after being\nmade;\n\nwhere a fund is constituted with the court in accordance with article 11\nfor the payment of claims arising out of an occurrence, the court may\nstay proceedings relating to a claim arising out of that occurrence that\nare pending against the person by whom the fund has been constituted;\nand\n\n(d)\n\nno lien or other right in respect of a ship or property shall affect the\nproportions in which under article 12 the fund is distributed among\nseveral claimants.\n\nFor the purposes of subsection (2), a ship shall not be treated as having\n(7)\nbeen within the area over which a harbour authority or conservancy authority\ndischarges functions by reason only that it has been built or fitted out within the\narea,  that  it  has  taken  shelter  within  or  passed  through  the  area  on  a  voyage\nbetween  two  places  both  situated  outside  that  area,  or  that  it  has  loaded  or\nunloaded mail or passengers within the area.\n\nNothing in this section imposes any liability for loss or damage where no\n\n(8)\nliability exists apart from this section.\n\n(9)\n\nIn this section,\n\n\f21\n\n“dock”  includes  wet  docks  and  basins,  tidal  docks  and  basins,  locks,  cuts,\nentrances, dry docks, graving docks, gridirons, slips, quays, wharves, piers,\nstages, landing places and jetties; and\n\n“owner” in relation to a dock or canal, includes an authority or person that has\n\ncontrol and management of the dock or canal.\n\nApplication to Government and its ships\n\n15.(1)\nSections 12 and 13(1) to (5) and (7) to (9) apply in the case of Barbados\nGovernment ships as they apply in relation to other ships and section 14 applies\nto the Government in its capacity as an authority or person specified in section\n14(1).\n\n(2)\n\nIn this section,\n\n“Barbados Government ships” means\n\n(a)\n\n(b)\n\n(c)\n\nships of which the beneficial interest is vested in Barbados;\n\nships that are registered as Government ships; or\n\nships that are demised or sub-demised to, or in the exclusive possession\nof, the Government, other than any ship in which the Government is\ninterested otherwise than in right of the Government, unless that ship\nis for the time being demised or sub-demised to the Government or in\nthe exclusive possession of the Government in that right.\n\nDivision 2\n\nInternational Convention on Civil Liability for Oil Pollution Damage\n\nApplication\n\n16.(1)\nThis  Part,  the  International  Convention  on  Civil  Liability  for  Oil\nPollution Damage, 1992, as amended and regulations made under section 20 do\nnot apply in relation to a ship that is not a Barbados vessel, when the vessel is in\nthe territory territorial sea of a foreign state, so far as a law of that state gives\n\n\f22\n\neffect to the provisions of the International Convention on Civil Liability for Oil\nPollution Damage, 1992, as amended in relation to that vessel.\n\nSubsection  (1)  does  not  apply  in  relation  to  an  incident  that  occurs  in\n\n(2)\nBarbados waters to which Article IV of the Convention applies that involves\n\n(a)\n\n(b)\n\na ship that is a Barbados vessel; and\n\na foreign-flagged vessel.\n\nClaims for compensation\n\nThe  Supreme  Court  of  Barbados  is  invested  with  compulsory\n17.\njurisdiction  to  hear  and  determine  claims  for  compensation  under  the\nInternational Convention on Civil Liability for Oil Pollution Damage, 1992, as\namended in respect of incidents involving Barbados vessels wherever they may\nbe and foreign vessels in Barbados waters\n\n(a)\n\n(b)\n\nthat have caused pollution damage in a place to which the Convention\napplies;\n\nin relation to which preventive measures have been taken to prevent or\nminimize pollution damage in a place to which the Convention applies.\n\nApplications to determine limit of liability\n\n18.(1)\nWhere a claim for compensation under the International Convention\non Civil Liability for Oil Pollution Damage, 1992, as amended is made in the\nSupreme Court of Barbados against, or is apprehended by, the owner of a ship,\nor the insurer or other person providing financial security for the liability of the\nowner of a ship for pollution damage, the owner, insurer or other person, as the\ncase may be, may apply\n\n(a)\n\nwhere a claim for compensation under Convention has been made in\nthe Supreme Court of Barbados, to that Court; or\n\n\f23\n\n(b)\n\nin  any  other  case,  to  the  Supreme  Court  of  any  state  party  to  the\nConvention, where the oil pollution incident occurred in respect of a\nBarbados ship,\n\nto determine whether he may limit his liability under the Convention and, if so,\nthe limit of that liability.\n\nWhere the Court referred to in subsection (1) determines that a person may\n(2)\nlimit his liability under the International Convention on Civil Liability for Oil\nPollution Damage, 1992, as amended, the Court may make such orders as it thinks\nfit with respect to the apportionment and distribution, in accordance with that\nConvention, of a fund for the payment of claims.\n\nThe  Courts  referred  to  in  subsection  (1)  are  vested  with  compulsory\n\n(3)\njurisdiction to hear and determine proceedings under this section.\n\nTransfer of proceedings\n\nA Court referred to in section 18(1) in which a claim for compensation\n19.(1)\nhas  been  made  under  the  International  Convention  on  Civil  Liability  for  Oil\nPollution Damage, 1992, as amended, or in which proceedings under section 18\nhave been instituted, may, if the Court thinks fit, at any stage in the proceedings,\nupon  application  or  of  its  own  motion,  by  order,  transfer  the  proceedings  to\nanother Supreme Court.\n\n(2)\n\nWhere proceedings are transferred from a Court under subsection (1)\n\n(a)\n\n(b)\n\nall documents filed, and moneys or guarantees lodged, in that Court in\nthose proceedings shall be transmitted by the Registrar or other proper\nofficer of that Court to the Registrar or other proper officer of the court\nto which the proceedings are transferred; and\n\nthe court to which the proceedings are transferred shall proceed as if\nthe proceedings had been originally instituted in that court and as if the\nsame proceedings had been taken in that court as had been taken in the\ncourt from which the proceedings were transferred.\n\n\f24\n\nRegulations\n\n20.(1)\nThe Minister may by regulation prescribe matters for the purpose of\ncarrying out or giving effect to the International Convention on Civil Liability\nfor Oil Pollution Damage, 1992, as amended, including\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe conversion of the amounts referred to in the 1992 Convention, as\namended into amounts expressed in the currency of Barbados;\n\nthe kinds of guarantees that are acceptable for the purposes of the 1992\nConvention, as amended;\n\nthe extent to which the right of subrogation provided for in the 1992\nConvention, as amended may be exercised by a person other than a\nperson referred to in that paragraph; and\n\nthe ascertainment of the tonnage of a ship, including the estimation of\nthe  tonnage  of  a  ship  in  circumstances  where  it  is  not  possible  or\nreasonably practicable to measure its tonnage.\n\nSubsection (1) shall not be construed to limit the power of judges of the\n(2)\nSupreme Court of Barbados to make rules of court with respect to a matter that\nis  not  provided  for  in  the  International  Convention  on  Civil  Liability  for  Oil\nPollution  Damage,  1992,  as  amended  or  in  regulations  made  under  that\nsubsection.\n\nDivision 3\n\nInsurance Certificates relating to Liability for Oil Pollution Damage\n\nDefinitions\n\n21.(1)\n\nIn this Part,\n\n“government ship” means a ship, including a warship, owned by a country or a\n\nship owned by Barbados.\n\n\f(2)\n\nIn this Part,\n\n25\n\n(a)\n\n(b)\n\na reference to a contract of insurance, or other financial security, in\nrespect  of  a  ship  shall  be  construed  as  a  reference  to  a  contract  of\ninsurance, or other financial security, covering the liability of the owner\nof the ship under the International Convention on Civil Liability for\nOil Pollution Damage, 1992, as amended for pollution damage caused\nin  Barbados  or  in  the  territorial  sea  of  a  country  to  which  the\nConvention applies;\n\nreference  to  the  limits  of  the  liability  prescribed  by  paragraph  1  of\nArticle V of the Convention in relation to a ship shall be construed as\na reference to the amount to which the owner of the ship is entitled\nunder  that  paragraph  to  limit  his  liability  under  the  Convention  in\nrespect of any one incident; and\n\n(c)\n\na reference to a state shall be construed as including a reference to a\nstate party to the Convention.\n\nApplication\n\n22.(1)\nSubject to subsection (2), this Part applies to every ship that is carrying\nmore than 2,000 tons of oil in bulk as cargo and, where such a ship is unregistered,\nthis Part applies to the ship as if it were registered in the country whose flag the\nship is flying.\n\nThis Part does not apply to a government ship, other than a government\n\n(2)\nship that is being used for commercial purposes.\n\nInsurance certificates to be carried\n\n23.(1)\nWhere a ship enters or leaves, or attempts to enter or leave, a port in\nBarbados, or arrives at, leaves, or attempts to arrive at or leave, a terminal in the\nterritorial sea of Barbados without carrying on board the ship a relevant insurance\n\n\f26\n\ncertificate in respect of the ship that is in force, the master and owner of the ship\neach commit an offence and are liable on summary conviction to a fine\n\n(a)\n\n(b)\n\n(c)\n\nin the case of the master, of $10 000;\n\nin the case of an owner that is not a body corporate, of $15 000; and\n\nin the case of an owner that is a body corporate, of $20 000.\n\nWhere a ship to which this Part applies that is registered in Barbados enters\n(2)\nor leaves, or attempts to enter or leave, a port in a country other than Barbados,\nor arrives at, leaves, or attempts to arrive at or leave, a terminal in the territorial\nsea of a country other than Barbados without carrying on board the ship a relevant\ninsurance certificate in respect of the ship that is in force, the master and owner\nof the ship each commit an offence and are liable on summary conviction to a\nfine\n\n(a)\n\n(b)\n\n(c)\n\nin the case of the master, of $10 000;\n\nin the case of an owner who is not a body corporate, of $15 000; and\n\nin the case of an owner that is a body corporate, $20 000.\n\nWhere, other than in circumstances to which subsection (1) or (2) applies,\n(3)\nat any time a relevant insurance certificate is in force in respect of a ship and is\nnot carried on board the ship, the master and owner of the ship each commit an\noffence and are liable on summary conviction to a fine\n\n(a)\n\n(b)\n\n(c)\n\nin the case of the master, of $15 000;\n\nin the case of an owner who is not a body corporate, of $20 000; and\n\nin the case of an owner that is a body corporate, of $25 000.\n\nAn officer may require the master or other person in charge of a ship to\n(4)\nproduce a relevant insurance certificate in force in respect of the ship and, if he\nfails to produce the certificate, he commits an offence and is liable on summary\nconviction to a fine of $25 000.\n\n(5)\n\nAn offence under any of subsections (1) to (4) is a strict liability offence.\n\n\f27\n\n(6)\nWhere an officer has reasonable grounds to believe that the master or other\nperson in charge of a ship is attempting to take the ship out of a port in Barbados\nat a time when a relevant insurance certificate in force in respect of the ship is\nnot being carried on board the ship, the officer may detain the ship until such\ntime as such a certificate is obtained or produced to the officer.\n\nThis section does not exclude or limit the concurrent operation of a law of\n(7)\na state giving effect to paragraphs 1, 2 and 3 of Article VII of the International\nConvention on Civil Liability for Oil Pollution Damage, 1969 in relation to a\nship that is not a Barbados vessel.\n\nFor the purposes of this section, a relevant insurance certificate in respect\n\n(8)\nof a ship is\n\n(a)\n\nif the ship is registered in Barbados and is not a government ship\n\n(i)\n\n(ii)\n\n(iii)\n\nin the case of a foreign-going Barbados vessel carrying more than\n2,000 tons of oil in bulk as cargo, a certificate issued under section\n20 in respect of the ship; or\n\nin the case of a Barbados vessel operating within the Caribbean\nTrading Area, as defined in the Shipping (Domestic Vessels) Act,\n2024 (Act 2024-22), and carrying more than 2,000 tons of oil in\nbulk as cargo, a certificate issued under section 24 in respect of\nthe ship;\n\nin  the  case  of  a  foreign  vessel  operating  within  the  Caribbean\nTrading Area, as defined in the Shipping (Domestic Vessels) Act,\n2024 (Act 2024-22), and carrying more than 2,000 tons of oil in\nbulk as cargo, a certificate issued under section 24 in respect of\nthe ship under a law of a state that gives effect to paragraphs 1,\n2 and 3 of Article VII of the International Convention on Civil\nLiability for Oil Pollution Damage, 1969 in relation to that ship,\nor  gives  effect  to  the  1992  International  Convention  on  Civil\nLiability for Oil Pollution Damage.\n\n\f(b)\n\nif the ship is registered in a country\n\n28\n\n(i)\n\n(ii)\n\nto which the 1992 Convention, as amended applies and is not a\ngovernment  ship,  a  certificate  issued,  for  the  purposes  of  the\nConvention, by or under the authority of the government of that\ncountry;\n\nto which the 1969 Convention applies and is not a government\nship,  a  certificate  issued,  for  the  purposes  of  Article  VII  of  the\nConvention, by or under the authority of the government of that\ncountry;\n\n(c)\n\nif the ship is registered in a country that is not a country to which the\n1992 Convention as amended applies and is not a government ship, a\ncertificate  issued  under  section  24  or  a  certificate  that  is,  under  the\nregulations, to be taken to be a relevant insurance certificate in respect\nof the ship for the purposes of this section;\n\n(d)\n\nif the ship is owned by Barbados, a certificate issued under section 24\nin respect of the ship;\n\n(e)\n\nif the ship is owned by the Government of Barbados\n\n(i)\n\na certificate issued under section 26 in respect of the ship; or\n\n(ii)\n\na certificate issued under the law of the state in relation to ships\nowned by the state that corresponds with section 26 in relation to\nships owned by Barbados; or\n\n(f)\n\nif  the  ship  is  owned  by  the  government  of  a  country  other  than\nBarbados,  a  certificate  referred  to  in  section  24  issued  by  the\ngovernment of that country.\n\nIssuance of insurance certificates\n\n24.(1)\nThe owner, master or agent of a ship to which this Part applies that is\nregistered in Barbados or in a country to which the International Convention on\nCivil Liability for Oil Pollution Damage, 1992, as amended, does not apply may,\n\n\f29\n\non payment of the prescribed fee, apply to the Administration for the issuance of\nan insurance certificate in respect of the ship.\n\n(2)\n\nAn application under subsection (1)\n\n(a)\n\n(b)\n\nshall be in the prescribed form; and\n\nshall be lodged with a prescribed person.\n\nWhere an application is made under subsection (1) in respect of a ship, the\n(3)\nAdministration shall issue to the applicant an insurance certificate in respect of\nthe ship, if he is satisfied that the owner of the ship is maintaining insurance or\nother equivalent financial security in respect of the ship in an amount that will\ncover the limits of liability prescribed under the International Convention on Civil\nLiability for Oil Pollution Damage, 1992, as amended.\n\n(4)\n\nAn insurance certificate issued under subsection (3) in respect of a ship\n\n(a)\n\nshall be in the prescribed form and include the particulars specified\nunder the International Convention on Civil Liability for Oil Pollution\nDamage, 1992, as amended;\n\n(b)\n\ncomes into force on the day specified in the certificate; and\n\n(c)\n\nshall specify that the certificate expires on the earlier of\n\n(i)\n\n(ii)\n\nthe last day in the period of 12 months commencing on the day on\nwhich the certificate comes into force; and\n\nthe day that the Administration is satisfied is the last day in the\nbalance of the period during which the insurance or other financial\nsecurity in respect of the ship is to remain in force.\n\nWhere an insurance certificate is issued under this section in respect of a\n(5)\nship  registered  in  Barbados,  the  Administration  shall  forward  a  copy  of  the\ncertificate a person prescribed for the purposes of this section.\n\n\f30\n\nExtension, cancellation and lapsing of insurance certificates\n\n25.(1)\n\nWhere\n\n(a)\n\n(b)\n\na ship in respect of which an insurance certificate has been issued under\nsection 24 is not at a port in Barbados at the time when the certificate\nexpires or is about to expire; and\n\nthe Administration is satisfied that, after the expiration day specified\nin the certificate, there will be in force a contract of insurance or other\nfinancial security in respect of the ship in an amount that will cover the\nlimits  of  liability  prescribed  under  the  Convention,  as  amended,  in\nrelation to the ship,\n\nthe Administration may extend the certificate for a period that expires on or before\nthe day that the Administration is satisfied is the last day in the balance of the\nperiod  during  which  that  contract  of  insurance  or  other  equivalent  financial\nsecurity is to remain in force, or a period that does not exceed one month from\nthe day referred to in paragraph (b), whichever is the earlier.\n\nAn  extension  of  an  insurance  certificate  under  subsection  (1)  is  of  no\n\n(2)\nfurther force or effect after the arrival of the ship at a port in Barbados.\n\nThe  Administration  may  cancel  an  insurance  certificate  issued  under\n(3)\nsection 24 that is in force in respect of a ship, if he is satisfied that, by reason of\na modification to the contract of insurance or variation of other financial security\nin respect of the ship, the owner of the ship will not be covered for an amount\nthat  satisfies  the  limits  of  liability  prescribed  under  the  1992  Convention,  as\namended, in relation to the ship.\n\nIf, while an insurance certificate issued under section 24 in respect of a\n(4)\nship registered in Barbados or in a country to which the International Convention\non Civil Liability for Oil Pollution Damage, 1992, as amended, does not apply\nis in force, the ship ceases to be registered in Barbados or in that country, as the\ncase may be, the certificate ceases to be in force.\n\n\f31\n\n(5)\nWhere an insurance certificate issued under section 24 in respect of a ship\nis cancelled under subsection (3) or ceases to be in force by virtue of subsection\n(4),  the  master  of  the  ship  shall  lodge  the  certificate  with  the  Administration\nwithout delay.\n\nThe owner, master or agent of a ship referred to in section 24 who operates\n(6)\nthe ship without an insurance certificate that is in force commits an offence and\nis liable on summary conviction to a fine of $20 000.\n\nGovernment ships\n\nIn relation to a ship owned by Barbados, the Administration may issue\n26.(1)\na certificate certifying that the ship is owned by Barbados and that any liability\nfor pollution damage up to the limits of liability applicable in relation to the ship\nprescribed  by  under  the  International  Convention  on  Civil  Liability  for  Oil\nPollution Damage, 1992, as amended, will be met by Barbados.\n\nAt the request of a state party to the 1992 Convention, as amended, the\n(2)\nAdministration may issue a certificate in relation to a ship owned by the state\ncertifying\n\n(a)\n\n(b)\n\nthat the ship is owned by the state; and\n\nif the Administration is satisfied that any liability for pollution damage\nup to the limits of liability prescribed under the 1992 Convention, as\namended, will be met by the state party, that any such liability will be\nmet by the state party.\n\nSubject to subsection (4), a certificate issued under subsection (1) or (2)\n\n(3)\nremains in force for the period specified in the certificate.\n\nIf, while a certificate issued under subsection (1) or (2) in respect of a ship\n(4)\nowned by Barbados or by a state party to the 1992 Convention, as amended, is\nin force, the ship ceases to be owned by Barbados or the state party, the certificate\nceases to be in force.\n\nA country to which the 1992 Convention, as amended, applies shall, in any\n(5)\nproceedings brought in a court in Barbados to enforce a claim in respect of a\n\n\f32\n\nliability  incurred  under  provisions,  be  deemed  to  have  submitted  to  the\njurisdiction of that court and to have waived any defence based on its status as a\nsovereign  country,  but  nothing  in  this  subsection  shall  permit  the  levy  of\nexecution against the property of such a country.\n\nPART III\n\nPROOF OF POSSESSION OF ADEQUATE INSURANCE COVER\n\nDefinitions - Part III\n\n27.\n\nIn this Part,\n\n“government ship” means a ship, including a warship, owned by a country, and\nincludes a ship owned by Barbados or by a state party to the International\nConvention on Civil Liability for Oil Pollution Damage, 1992, as amended;\n\n“owner”  has  the  same  meaning  as  in  the  International  Convention  on  Civil\n\nLiability for Oil Pollution Damage, 1992, as amended; and\n\n“relevant  insurance  certificate”  in  relation  to  a  ship,  means  a  document  that\ncontains prescribed information relevant to establishing that the owner of\nthe ship is maintaining insurance or other equivalent financial security in\nrespect of the ship that covers the liability of the owner for pollution damage\ncaused in Barbados for an amount that is not less than the prescribed amount.\n\nApplication\n\n28.(1)\n\nSubject to subsection (2), this Part applies to a ship\n\n(a)\n\n(b)\n\n(c)\n\nthat carries oil as cargo or bunker;\n\nthat has a gross tonnage of 400 GT or more; and\n\nthat is otherwise required to have insurance certificates in accordance\nwith the regulations.\n\n\f33\n\n(2)\nThe International Convention on Civil Liability for Bunker Oil Pollution\nDamage, 2001, as amended, does not apply to pollution damage as defined in the\nInternational Convention on Civil Liability for Oil Pollution Damage, 1992, as\namended,  whether  or  not  compensation  is  payable  in  respect  of  it  under  that\nConvention.\n\nThis Part does not apply to a government ship, other than a government\n\n(3)\nship that is being used for commercial purposes.\n\nInsurance certificates to be carried\n\nIf  a  ship  enters  or  leaves,  or  attempts  to  enter  or  leave,  a  port  in\n29.(1)\nBarbados without carrying on board a relevant insurance certificate in respect of\nthe ship, the master and the owner of the ship each commit an offence and are\nliable on summary conviction to a fine of $10 000.\n\nAn authorized officer may require the master or other person in charge of\n(2)\na ship to produce a relevant insurance certificate in respect of the ship and, if the\nmaster or other person fails to produce such a certificate to the officer, he commits\nan offence and is liable on summary conviction to a fine of $20 000.\n\nIf an authorized officer has reasonable grounds to believe that the master\n(3)\nor other person in charge of a ship is attempting to take the ship out of a port in\nBarbados at a time when the ship is not carrying on board a relevant insurance\ncertificate  in  respect  of  the  ship,  the  officer  may  detain  the  ship  until  such  a\ncertificate is obtained or produced to the officer.\n\nThe master of a ship detained at a port under subsection (3), and the owner\n(4)\nof such a ship, each commit an offence and are liable on summary conviction to\na fine of $10 000 if the ship leaves the port before it has been released from\ndetention.\n\n(5)\n\nAn offence under subsection (1), (2) or (4) is a strict liability offence.\n\n\f34\n\nPART IV\n\nRECOVERY OF EXPENSES\n\nExpenses incurred by authorized officers\n\nSubject to this section, where an authorized officer incurs an expense\n30.(1)\nor other liability in, or by reason of, the exercise of the authorized officer’s powers\nin respect of an incident, the amount of that expense or other liability is\n\n(a)\n\n(b)\n\nif that expense or other liability was incurred in, or by reason of, the\nexercise of those powers in relation to a single ship, a debt due to the\nGovernment of Barbados by the owner of that ship; or\n\nif that expense or other liability was incurred in, or by reason of, the\nexercise of those powers in relation to two or more ships, a debt due to\nthe Government of Barbados jointly and severally by the owners of\nthose ships.\n\nSubsection (1) does not apply in relation to the owner of a ship in respect\n(2)\nof  an  incident  referred  to  in  that  subsection,  where  the  owner  proves  that  the\nincident\n\n(a)\n\n(b)\n\n(c)\n\nresulted  from  an  act  of  war,  hostilities,  civil  war,  insurrection  or  a\nnatural  phenomenon  of  an  exceptional,  inevitable  and  irresistible\ncharacter;\n\nwas wholly caused by an act or omission done by a third party with\nintent to cause damage; or\n\nwas  wholly  caused  by  the  negligence  or  other  wrongful  act  of  a\ngovernment,  or  other  authority,  responsible  for  the  maintenance  of\nlights or other navigational aids.\n\nWhere an incident referred to in subsection (1) did not occur as a result of\n(3)\nthe  fault  of  the  owner  of  a  ship,  the  liability  of  the  owner  of  the  ship  under\nsubsection (1) in respect of the incident shall not exceed the limit of any liability\n\n\f35\n\nin  respect  of  the  incident  that  applies  to  the  incident  under  an  international\nconvention in force in relation to Barbados.\n\nA  debt  due  to  Barbados  by  a  person  by  virtue  of  this  section  may  be\n\n(4)\nrecovered from the person in a court of competent jurisdiction.\n\nExpenses incurred by the Administration\n\n31.\n\nThe amount\n\n(a)\n\nthat the owner of a ship is liable, or the owners of 2 or more ships are\njointly  and  severally  liable,  under  any  international  Convention\nconcerning liability and compensation to which Barbados is Party, to\npay  to  Barbados  by  way  of  compensation  for  an  expense  or  other\nliability incurred by the Administration in, or by reason of, the exercise\nof  the  Administration’s  powers  under  the  Merchant  Shipping  Act,\n2024 (Act 2024- ); or\n\n(b)\n\nthat the owner of a ship is liable, or the owners of 2 or more ships are\njointly and severally liable, to pay to Barbados under section 30,\n\nis a charge on that ship, or on each of those ships, as the case may be.\n\nDetention of ships\n\n32.(1)\nSubject to subsection (2), where an amount is, by virtue of section 31,\na charge on a ship, the ship may be detained by a person authorized in writing by\nthe Minister for the purposes of this section until the amount is paid or security\nfor the payment of the amount is provided to the satisfaction of the Minister.\n\nIf a ship is detained under this section, the person authorised to detain the\n\n(2)\nship may escort her to a port in Barbados.\n\nSubsection (1) does not apply in relation to a foreign ship unless the ship\n\n(3)\nis in Barbados waters or in its exclusive economic zone.\n\n\f36\n\n(4)\nWhere a ship that has been detained under this section goes to sea before\nshe is released from detention, the master and owner of the ship each commit an\noffence and are liable on summary conviction\n\n(a)\n\n(b)\n\nin the case of the master, to a fine of $75 000 or imprisonment for a\nterm of 2 years, or both;\n\nin the case of the owner who is not a body corporate, to a fine of $100\n000 or imprisonment for a term of 2 years, or both; and\n\n(c)\n\nin the case of the owner that is a body corporate, to a fine of $150 000.\n\n(5)\n\nAn offence under subsection (4) is a strict liability offence.\n\nRecovery of loss by the Administration\n\nThis section applies to a loss or damage suffered, or cost or expense\n33.(1)\nincurred, by the Administration in preventing, mitigating or attempting to prevent\nor mitigate any pollution damage that occurred because of\n\n(a)\n\n(b)\n\na  discharge  or  disposal  made  in  contravention  of  the  Merchant\nShipping Act, 2024(Act 2024- ); or\n\nan action taken by the Administration, directly or indirectly, to combat\npollution in the marine environment caused by a discharge or disposal\nfrom  a  ship,  or  to  combat  a  threat  of  pollution  in  the  marine\nenvironment caused by a threat of a discharge or disposal from a ship.\n\nThe  Administration  may  recover,  as  a  debt  in  a  court  of  competent\n(2)\njurisdiction,  the  amount  of  the  loss,  damage,  cost  or  expense  referred  to  in\nsubsection (1) from\n\n(a)\n\nthe owner or the master of the ship from which the discharge or disposal\noccurred, or from which there was the threat of a discharge or disposal;\nor\n\n(b)\n\nany person whose act caused the discharge or disposal, or who made\nthe threat of a discharge or disposal.\n\n\f37\n\nPART V\n\nCIVIL LIABILITY FOR NUCLEAR DAMAGE\n\nConvention to have force of law\n\n34.\nCarriage of Nuclear Material, 1971 shall have the force of law in Barbados.\n\nThe Convention relating to Civil Liability in the Field of Maritime\n\nApplication\n\n35.(1)\n\nThis Part applies to\n\n(a)\n\nships  carrying  nuclear  material,  and  to  nuclear  pollution  incidents\narising from maritime carriage of nuclear material; and\n\n(b)\n\noperators of nuclear installations and operators of nuclear ships.\n\nFor the purposes of subsection (1)(b), operators of nuclear ships include\n\n(2)\nshipowners.\n\nExceptions\n\n36.(1)\nof war, hostilities, a civil war or an insurrection.\n\nThis Part does not apply to a nuclear incident that results from an act\n\nThis Part does not apply to damage to the nuclear installation of an operator\n(2)\nwho is responsible for that damage or to any property at the installation that is\nused in connection with the installation, including property under construction.\n\nLiability for Nuclear Incidents\n\nLimitation on operator’s liability\n\n37.\nExcept  as  provided  for  under  this  Part,  the  operator  of  a  nuclear\ninstallation is not liable for damage that is caused by a nuclear incident involving\nthe maritime carriage of nuclear material.\n\n\f38\n\nLiability\n\n38.(1)\nAn  operator  is  exclusively  liable  for  damage  caused  by  a  nuclear\nincident occurring in the course of the maritime carriage of nuclear material by\na ship carrying such material in Barbados waters, irrespective of the flag under\nwhich the ship is operating.\n\nIn respect of a Barbados ship carrying nuclear material and operating in\n(2)\nthe territory of a Convention relating to Civil Liability in the Field of Maritime\nCarriage of Nuclear Material, 1971 contracting state, an operator is exclusively\nliable for damage caused by a nuclear incident occurring in the course of maritime\ncarriage of nuclear material on board the ship in the territory of that state.\n\nExoneration of liability\n\nAn operator held liable for damage caused by a nuclear incident that\n39.(1)\noccurred  in  the  course  of  maritime  carriage  of  nuclear  material  shall  be\nexonerated from such liability if\n\n(a)\n\n(b)\n\nthe operator is liable for the damage under either the Paris Convention\non Third Party Liability in the Field of Nuclear Energy or the Vienna\nConvention on Civil Liability for Nuclear Damage; or\n\nthe operator is liable for the damage by virtue of a national law, if the\nlaw is in all respects as favourable to persons who may suffer damage\nas under either of those Conventions.\n\nThe exoneration under subsection (1) shall also apply in respect of damage\n\n(2)\ncaused by a nuclear incident\n\n(a)\n\nto  the  nuclear  installation  itself  or  to  property  on  the  site  of  that\ninstallation that is used or to be used in connection with that installation;\nor\n\n(b)\n\nto the means of transport upon which the nuclear material involved was\nat the time of the nuclear incident,\n\n\f39\n\nfor which liability of the operator of the installation has been excluded pursuant\nto the Paris or the Vienna Convention or, in cases referred to in Article 1(b) of\nthe Convention relating to Civil Liability in the Field of Maritime Carriage of\nNuclear Material, 1971, by equivalent provisions of the national law referred to\nin that Article.\n\nSubsection (1) does not affect the liability of an individual who has caused\n\n(3)\nnuclear damage by an act or omission done with intent to cause damage.\n\nPreventive measure – liability in Barbados\n\nAn  operator  is  exclusively  liable  for  damage  caused  by  a  nuclear\n40.\nincident occurring in the course of maritime carriage of nuclear material that is\ncaused within Barbados, its territorial sea or its exclusive economic zone, if the\ndamage is caused by a preventive measure in relation to the operator’s nuclear\ninstallation  or  in  relation  to  any  transportation  for  which  the  operator  is\nresponsible.\n\nPreventive measure – liability in Convention contracting state\n\n41.\nAn operator is exclusively liable for any damage that is caused within\na  Convention  relating  to  Civil  Liability  in  the  Field  of  Maritime  Carriage  of\nNuclear  Material,  1971  contracting  state  other  than  Barbados,  or  within  that\nstate’s exclusive economic zone, if the damage is caused by a preventive measure\nin relation to the installation or in relation to any transportation for which the\noperator is responsible.\n\nStrict liability\n\n42.\ncarriage of nuclear material is strict liability.\n\nThe  liability  of  an  operator  for  damage  caused  by  the  maritime\n\nLiability – joint and several or solidarily\n\n43.\nIf liability under this Part is incurred by two or more operators, each\noperator is jointly and severally, or solidarily, liable to the extent that it cannot\n\n\f40\n\nreasonably  be  determined  what  portion  of  the  liability  is  attributable  to  each\noperator.\n\nPerson responsible for nuclear incident\n\n44.\nAn operator is not liable for damage arising from the maritime carriage\nof nuclear material that is suffered by a person if that person intentionally caused\nthe  nuclear  incident,  wholly  or  partly,  by  an  act  or  omission,  or  under\ncircumstances, amounting to gross negligence.\n\nNo recourse\n\nWhere  damage  is  caused  by  a  nuclear  incident  arising  from  the\n45.\nmaritime carriage of nuclear material, an operator has no right of recourse against\nany person other than an individual who intentionally caused the nuclear incident\nby an act or omission.\n\nCompensable Damage\n\nBodily injury or damage to property\n\nBodily injury or death and damage to property that are caused by a\n46.\nnuclear  incident  arising  from  the  maritime  carriage  of  nuclear  material  are\ncompensable.\n\nPsychological trauma\n\n47.\nPsychological trauma that is suffered by a person is compensable if it\nresults from bodily injury to that person that was caused by a nuclear incident\narising from the maritime carriage of nuclear material.\n\nLiability for economic loss\n\n48.\nEconomic loss that is incurred by a person as a result of their bodily\ninjury or damage to his property and that is caused by a nuclear incident arising\n\n\f41\n\nfrom  the  maritime  carriage  of  nuclear  material,  or  psychological  trauma  that\nresults from that bodily injury, is compensable.\n\nCosts and wages\n\n49.\nCosts that are incurred by a person who loses the use of property as a\nresult of a nuclear incident arising from the maritime carriage of nuclear material\nand the resulting wage loss by that person’s employees are compensable.\n\nPower failure\n\nIf  a  nuclear  incident  arising  from  the  maritime  carriage  of  nuclear\n50.\nmaterial occurs at an offshore, shore-side or shipboard nuclear installation that\ngenerates  electricity,  the  costs  resulting  from  a  failure  of  the  installation  to\nprovide electricity are not compensable.\n\nEnvironmental damage - Barbados\n\nReasonable costs of remedial measures that are taken to repair, reduce\n51.\nor mitigate environmental damage that is caused by a nuclear incident arising\nfrom the maritime carriage of nuclear material are compensable.\n\nEnvironmental damage – other Convention contracting state\n\n52.\nReasonable costs of remedial measures that are taken to repair, reduce\nor  mitigate  any  significant  environmental  damage  that  is  caused  by  a  nuclear\nincident arising from the maritime carriage of nuclear material are compensable\nif  the  measures  are  ordered  by  an  authority  of  a  Convention  relating  to  Civil\nLiability in the Field of Maritime Carriage of Nuclear Material, 1971 contracting\nstate  other  than  Barbados  acting  under  the  laws  of  that  state  relating  to\nenvironmental protection.\n\n\f42\n\nAdditional Safety Compliance Requirements\n\nNuclear cargo ship safety certificate\n\n53.(1)\nA Barbados ship carrying nuclear material shall hold a valid nuclear\ncargo ship safety certificate or nuclear passenger ship safety certificate, as the\ncase may be, in accordance with International Convention for the Safety of Life\nat Sea, 1974, Regulation VIII/10.\n\nNuclear  safety  certificates  shall  be  in  a  form  prescribed  by  the\n\n(2)\nAdministration, and published in a Merchant Shipping Notice.\n\nINF Code compliance\n\nShips carrying packaged irradiated nuclear fuel, plutonium or high-\n54.\nlevel radioactive wastes shall strictly comply with the International Code for the\nSafe Carriage of Packaged Irradiated Nuclear Fuel, Plutonium and High-Level\nRadioactive Wastes on Board Ships.\n\nPART VI\n\nCIVIL LIABILITY FOR CARRIAGE OF HAZARDOUS AND NOXIOUS\nSUBSTANCES\n\nDefinitions - Part VI\n\n55.(1)\n\nIn this Part,\n\n“Administration” has the same meaning as in the Merchant Shipping Act,2024\n\n(Act 2024- );\n\n“contributing cargo” has the meaning assigned to it in the HNS Convention;\n\n“general account” means the account referred to in the HNS Convention;\n\n\f43\n\n“HNS  Convention”  means  International  Convention  on  Liability  and\nCompensation for Damage in Connection with the Carriage of Hazardous\nand Noxious Substances by Sea, as amended; and\n\n“HNS  Protocol”  means  the  2010  Protocol  to  the  International  Convention  on\nLiability and Compensation for Damage in Connection with the Carriage of\nHazardous and Noxious Substances by Sea.\n\nExcept  as  otherwise  defined,  words  used  in  this  Part  and  in  the  HNS\n\n(2)\nProtocol have the same meaning as in the HNS Protocol.\n\nIncorporation of Protocol\n\nExcept as provided in this Part, International Convention on Liability\n56.\nand Compensation for Damage in Connection with the Carriage of Hazardous\nand  Noxious  Substances  by  Sea,  as  modified  by  the  2010  Protocol  to  the\nInternational  Convention  on  Liability  and  Compensation  for  Damage  in\nConnection with the Carriage of Hazardous and Noxious Substances by Sea, shall\nhave the force of law in Barbados.\n\nException\n\n57.\nengaged on voyages between ports or facilities in Barbados\n\nThe HNS Convention and HNS Protocol shall not apply to vessels\n\n(a)\n\n(b)\n\nthat do not exceed 200 GT; and\n\nthat carry hazardous and noxious substances only in packaged form.\n\nGeneral obligations\n\n58.\nProtocol and the HNS Convention, as amended by the Protocol.\n\nThe  Administration  shall  give  effect  to  the  provisions  of  the  HNS\n\nRequirement to carry certificate\n\nA  certificate  of  insurance  or  other  financial  security  in  respect  of\n59.(1)\nliability for damage caused by hazardous and noxious substances, in the form set\n\n\f44\n\nout  in  Annex  I  of  the  HNS  Protocol,  shall  be  carried  on  board  all  Barbados-\nregistered vessels carrying hazardous and noxious substances by sea.\n\nA foreign-registered vessel carrying hazardous and noxious substances by\n(2)\nsea, when in Barbados waters, shall have on board the certificate referred to in\nsubsection  (1)  and  shall  produce  the  certificate  as  part  of  a  port  state  control\ninspection.\n\nCompliance and enforcement\n\nA Barbados-registered vessel shall maintain insurance or another form\n60.(1)\nof financial security in respect of liability for damage caused by hazardous and\nnoxious substances that conforms to the compulsory insurance requirements of\nthe HNS Convention and HNS Protocol.\n\nThe owner of a Barbados-registered vessel that contravenes subsection (1)\n(2)\ncommits  and  offence  and  is  liable  on  summary  conviction  to  a  fine  of  $100\n000.\n\nOffence\n\n61.(1)\nThe  owner  of  a  vessel,  irrespective  of  place  of  registry,  that\nintentionally discharges hazardous and noxious substances in Barbados’ waters\ncommits an offence and is liable on summary conviction to a fine of $1 000 000.\n\nWhere an owner is convicted of an offence under subsection (1), the court\n(2)\nmay  order  the  owner  to  carry  out  marine  environmental  restoration  and\nrehabilitation activities, including clean-up activities.\n\nHNS reporting\n\n62.(1)\nHazardous  and  noxious  substances  reporting  shall  be  done  in\naccordance  with  the  Guidelines  on  Reporting  of  HNS  Contributing  Cargo,\nadopted  during  the  hazardous  and  noxious  substances  workshop  held  at  the\nInternational  Maritime  Organization  Headquarters  in  London  on  12th  and  13th\nNovember, 2012 and endorsed by the International Maritime Organization Legal\nCommittee at its 100th session on 19th April 2013, as amended from time to time.\n\n\f45\n\n(2)\nThe  Administration  shall  communicate  in  writing  all  hazardous  and\nnoxious substances reports submitted to it to the Director of the HNS Fund, in\naccordance with the HNS Convention and those Guidelines.\n\nReporting of HNS contributing cargo\n\nPersons who receive hazardous and noxious substances contributing\n63.(1)\ncargo  in  Barbados  in  a  given  calendar  year  shall  submit  a  report  to  the\nAdministration if\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe  total  amount  of  substances  covered  under  the  general  account\nreceived during that year exceeds 20,000 tonnes;\n\nthe  total  amount  of  persistent  oil  received  during  that  year  exceeds\n150,000 tonnes;\n\nthe total amount of non-persistent oil received exceeds during that year\n20,000 tonnes;\n\nthe total amount of liquefied petroleum gas received during that year\nexceeds 20,000 tonnes; or\n\n(e)\n\nany amount of liquefied natural gas is received during that year.\n\nA person who contravenes subsection (1) commits an offence and is liable\n\n(2)\non summary conviction to a fine of $100 000.\n\nPART VII\n\nLIMITATION OF LIABILITY FOR MARITIME CLAIMS\n\nDefinitions - Part VII\n\n64.\n\nIn this Part,\n\n“1996 Limitation of Liability Protocol” means the Protocol of 1996 to amend the\nConvention  on  Limitation  of  Liability  for  Maritime  Claims,  1976,  as\n\n\f46\n\namended, concluded at London on May 2nd, 1996, and also means the 1996\nProtocol as subsequently amended by the IMO;\n\n“dock”  includes  wet  docks  and  basins,  tidal-docks  and  basins,  locks,  cuts,\nentrances, dry docks, graving docks, gridirons, slips, quays, wharfs, piers,\nstages, landing places, jetties and synchro-lifts;\n\n“maritime claim” means a claim described in Article 2 of the LLMC Convention,\nas amended, excluding claims specified under Article 2(1)(d) and (e) of the\nConvention, and extends to claims against\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nshipowners, including charterers, managers or operators of ships;\n\nsalvors;\n\nthe vessel;\n\nany person for whose act, neglect or default the shipowner or salvor is\nresponsible;\n\n(e)\n\nthe insurer of liability; and\n\n“owner” in relation to a dock, canal or port, includes a person or authority having\ncontrol or management of the dock, canal or port and a ship repairer using\nthe dock, canal or port.\n\nForce of law\n\n65.(1)\namended, have the force of law in Barbados.\n\nExcept as otherwise provided in this Part, the LLMC Convention, as\n\nThe  declarations  and  reservations  specified  in  the  Schedule  shall  heave\n\n(2)\neffect in relation to the Convention specified at section 65(1).\n\nLiability for vessels above and under 300 GT\n\n66.(1)\nThe maximum liability for a maritime claim that arises on a distinct\noccasion involving a vessel with a gross tonnage above 300 GT is as specified\nin the 1996 Protocol, as amended.\n\n\f47\n\nThe  maximum  liability  for  a  maritime  claim  that  arises  on  a  distinct\n\n(2)\noccasion involving a vessel with a gross tonnage of 300 GT or below is\n\n(a)\n\n1,000,000 SDRs in respect of a claim for loss of life or personal injury;\nand\n\n(b)\n\n500,000 SDRs in respect of any other claim.\n\nFor  the  purposes  of  subsection  (1),  a  vessel’s  gross  tonnage  shall  be\n(3)\ncalculated in accordance with the tonnage measurement rules contained in Annex\nI  of  the  International  Convention  on  Tonnage  Measurement  of  Ships,  1969,\nconcluded  at  London  on  June  23rd,  1969,  including  any  amendments  to  the\nAnnexes or Appendix to that Convention.\n\nLiability for vessels 150 GT and below\n\nThe maximum liability for a maritime claim that arises on a distinct\n67.(1)\noccasion involving a fishing vessel, or a vessel registered under the Shipping\n(Domestic Vessels) Act, 2024 (Act 2024-22), with a gross tonnage 150 GT or\nbelow is\n\n(a)\n\n500,000 SDRs in respect of a claim for loss of life or personal injury;\nand\n\n(b)\n\n250,000 SDRs in respect of any other claim.\n\nFor  the  purposes  of  subsection  (1),  a  vessel’s  gross  tonnage  shall  be\n(2)\ncalculated in accordance with regulations made under the Merchant Shipping\nAct, 2024 (Act 2024-  ).\n\nCompulsory insurance requirements for shipowners\n\n68.\nThe limits of liability specified in this Part apply only to shipowners,\nother than owners of fishing vessels, who have complied with the compulsory\ninsurance requirements specified in this Act and the regulations.\n\n\f48\n\nCompulsory insurance requirements for fishing vessel owners\n\nThe limits of liability specified in this Part apply only to fishing vessel\n69.\nowners  who  have  complied  with  the  compulsory  insurance  requirements\nstipulated in the regulations.\n\nLimitation of liability for passenger claims\n\nThe limit of liability of a shipowner in respect of a claim arising from\n70.\nthe loss of life or personal injury to passengers of the ship is an amount of 250,000\nunits of account multiplied by the number of passengers that the ship is authorized\nto carry according to the ship’s certificate.\n\nLimitation of liability – docks, canals and ports\n\nThe maximum liability of an owner of a dock, canal or port for a claim\n71.(1)\nthat arises on a distinct occasion for loss caused to a ship, or to cargo or other\nproperty on board a ship, is the greater of\n\n(a)\n\n(b)\n\n$2 000 000; and\n\nthe amount calculated by multiplying 1,000 by the number of tons of\nthe gross tonnage of the largest ship that was at the time of the loss, or\nhad been within a period of 5 years before that time, within the area of\nthe  dock,  canal  or  port  over  which  the  owner  had  control  or\nmanagement.\n\nThe  maximum  liability  specified  in  subsection  (1)  also  applies  to  any\n\n(2)\nperson for whose act or omission the owner is responsible.\n\nExclusion of wrecks and cargo removal\n\n72.\nThe  limitations  of  liability  under  this  Act  or  the  Convention  on\nLimitation of Liability for Maritime Claims, 1976, as amended, do not extend to\n\n(a)\n\nclaims  in  respect  of  the  raising,  removal,  destruction  or  rendering\nharmless of a ship that is sunk, wrecked, stranded or abandoned; or\n\n\f49\n\n(b)\n\nclaims in respect of the removal, destruction or the rendering harmless\nof the cargo or any other thing that is or has been on board such a ship.\n\nExclusion of claims relating to hazardous and noxious substances\n\n73.\nThe  limitations  of  liability  under  this  Act  or  the  Convention  on\nLimitation of Liability for Maritime Claims, 1976, as amended, do not extend to\nclaims  for  damage  within  the  meaning  of  the  International  Convention  on\nLiability  and  Compensation  for  Damage  in  Connection  with  the  Carriage  of\nHazardous and Noxious Substances by Sea, 1996, as amended, that arise from\noccurrences that take place after the entry into force of that Convention.\n\nTonnage calculation\n\n74.\ncalculated in accordance with section 66(3).\n\nFor  the  purpose  of  section  27,  a  vessel’s  gross  tonnage  shall  be\n\nConduct barring limitation\n\nThe limitations of liability in this Part do not apply to the liability of\n75.\na person if it is proved that the loss resulted from an act or omission of that person\ncommitted with intent to cause the loss or recklessly and with knowledge that the\nloss would probably result.\n\nAmendment of maximum liability\n\n76.(1)\nAmendments to the maximum liability limits specified in the 1996\nProtocol, as amended, shall enter into force for Barbados as at the date specified\nby the International Maritime Organization, unless before that date, the Minister\nresponsible  for  Foreign  Affairs  at  the  request  of  the  Minister  responsible  for\nShipping,  objects  to  the  amendment  and  communicates  such  objection  to  the\nInternational Maritime Organization.\n\nSubsection  (1)  applies  mutatis  mutandis  to  amendments  of  maximum\n(2)\nlimits of liability in relation to any other maritime liability instrument to which\nBarbados is Party.\n\n\f50\n\nPART VIII\n\nJURISDICTION OF ADMIRALTY COURT\n\nDefinitions - Part VIII\n\n77.\n\nIn this Part,\n\n“Admiralty  Court”  means  the  Admiralty  Division  of  the  Supreme  Court  of\n\nBarbados.\n\nAdmiralty jurisdiction\n\nThe Admiralty Court has exclusive jurisdiction with respect to any\n78.(1)\nmatter  relating  to  the  constitution  and  distribution  of  a  limitation  fund  under\nArticles  11  to  13  of  the  Convention  on  Limitation  of  Liability  for  Maritime\nClaims, 1976, as amended.\n\nPursuant  to  Article  10  of  the  Convention  on  Limitation  of  Liability  for\n(2)\nMaritime  Claims  1976,  as  amended,  limitation  of  liability  may  be  invoked\nnotwithstanding that a limitation fund has not been constituted.\n\nWhere an action is brought in the Admiralty Court to enforce a maritime\n(3)\nclaim subject to limitation, and in the court’s determination, the circumstances\nwarrant that a limitation fund be constituted before limitation of liability may be\ninvoked, a person liable may only invoke the right to limit liability if a limitation\nfund has been constituted\n\n(a)\n\nin  accordance  with  Article  11  of  the  Convention  on  Limitation  of\nLiability for Maritime Claims, 1976, as amended; or\n\n(b)\n\nis constituted when the right to limit liability is invoked.\n\nRight to assert limitation defence\n\n79.\nWhere a claim is made or apprehended against a person in respect of\nliability that is limited by section 66, 67 or 71 or by paragraph 1 of Article 6 or\n\n\f51\n\nparagraph 1 of Article 7 of the Convention on Limitation of Liability for Maritime\nClaims,  1976,  as  amended,  the  person  may  assert  the  right  to  a  limitation  of\nliability in a defence filed, or by way of action or counterclaim for declaratory\nrelief made, in any court of competent jurisdiction in Barbados.\n\nPowers of the Admiralty Court\n\nWhere a claim is made or apprehended against a person in respect of\n80.\nliability that is limited by section 66 or 67, or by paragraph 1 of Article 6 or\nparagraph 1 of Article 7 of the Convention on Limitation of Liability for Maritime\nClaims, 1976, as amended, the Admiralty Court, on application by that person or\nany other interested person, including a person who is a party to proceedings in\nrelation to the same subject-matter before another court, tribunal or authority,\nmay take any steps it considers appropriate, including\n\n(a)\n\ndetermining  the  amount  of  the  liability  and  providing  for  the\nconstitution and distribution of a fund under Articles 11 and 12 of the\nConvention on Limitation of Liability for Maritime Claims, 1976, as\namended;\n\n(b)\n\njoining interested persons as parties to the proceedings;\n\n(c)\n\n(d)\n\nexcluding any claimants who do not make a claim within a certain time;\n\nrequiring security from the person claiming limitation of liability or\nfrom any other interested person;\n\n(e)\n\nrequiring the payment of any costs; and\n\n(f)\n\nenjoining any person from commencing or continuing proceedings in\nany  court,  tribunal  or  authority  other  than  the  Admiralty  Court  in\nrelation to the same subject-matter.\n\nPostponement of distribution\n\n81.\nIn providing for the distribution of a fund under section 80(1)(a) in\nrelation to a liability, the Admiralty Court may, having regard to any claim that\nmay subsequently be established before a court, tribunal or other authority outside\n\n\f52\n\nBarbados in respect of that liability, postpone the distribution of any part of the\nfund that it considers appropriate.\n\nLiens and other rights\n\n82.\nproportions in which a fund is distributed by the Admiralty Court.\n\nNo lien or other right in respect of a ship or other property affects the\n\nProcedural matters\n\n83.\n\nThe Admiralty Court may\n\n(a)\n\n(b)\n\nmake rules of procedure with respect to proceedings before it under\nthis Part; and\n\ndetermine what form of guarantee it considers to be adequate for the\npurposes of paragraph 2 of Article 11 of the Convention on Limitation\nof Liability for Maritime Claims, 1976, as amended.\n\nInterest\n\n84.\nFor  the  purposes  of  Article  11  of  the  Convention  on  Limitation  of\nLiability  for  Maritime  Claims,  1976,  as  amended,  interest  on  an  award  of\ndamages  or  costs  is  payable  at  the  rate  prescribed  under  the Income  Tax  Act,\nCap. 73, and the regulations made under it, for amounts payable by the Minister\nof Finance as refunds of overpayments of tax under that Act.\n\nRelease of ships or property\n\n85.\nWhere a ship or other property is released under paragraph 2 of Article\n13 of the Convention on Limitation of Liability for Maritime Claims, 1976, as\namended, in any case other than one in which a fund has been constituted in a\nplace described in paragraphs (a) to (d) of that Article, the person who applied\nfor the release is deemed to have submitted to the jurisdiction of the court that\nordered the release for the purpose of determining the claim.\n\n\f53\n\nLimitation fund in a state other than Barbados\n\nIn considering whether to release a ship or other property referred to\n86.\nin section 85, the court shall not have regard to a limitation fund constituted in a\ncountry other than Barbados unless the court is satisfied that the country is a state\nparty to the Convention on Limitation of Liability for Maritime Claims, 1976, as\namended.\n\nPART IX\n\nGENERAL MATTERS RELATING TO PART VII AND VIII\n\nProsecution of offences under sections 23(1), (2) and (3) and 32(3)\n\n87.(1)\n32(3) is an indictable offence.\n\nSubject to subsection (2), an offence against section 23(1) or (2) or\n\nA court of summary jurisdiction may hear and determine proceedings in\n(2)\nrespect of an offence referred to in subsection (1) if the court is satisfied that it\nis proper to do so and the defendant and the prosecutor consent.\n\nWhere, under subsection (2), a court of summary jurisdiction convicts a\n(3)\nperson of an offence referred to in subsection (1), the penalty that the court may\nimpose is a fine of\n\n(a)\n\n(b)\n\nin the case of a person who is not a body corporate, $25 000; and\n\nin the case of a person that is a body corporate, $50 000.\n\nWhere, in proceedings for an offence under sections 23(1), (2) or (3) or\n(4)\n32(3) in respect of conduct engaged in by a corporation it is necessary to establish\nthe state of mind of the corporation, it is sufficient to show that a director, servant\nor agent of the corporation who engaged in the conduct within the scope of his\nactual or apparent authority had that state of mind.\n\n\f54\n\n(5)\n\nConduct engaged in on behalf of a corporation\n\n(a)\n\n(b)\n\nby a director, servant or agent of the corporation within the scope of\nhis actual or apparent authority; or\n\nby  any  other  person  at  the  direction  or  with  the  express  or  implied\nconsent or agreement of a director, servant or agent of the corporation,\ngiven  within  the  scope  of  the  actual  or  apparent  authority  of  the\ndirector, servant or agent,\n\nis deemed, for the purposes of an offence under this Act, to have been engaged\nin by the corporation.\n\nA reference in subsection (4) to the state of mind of a person includes a\n(6)\nreference to the knowledge, intention, opinion, belief or purpose of the person\nand the person’s reasons for the intention, opinion, belief or purpose.\n\nNo time limit for prosecution\n\n88.\ntime.\n\nA prosecution for an offence against this Act may be brought at any\n\nRegulations\n\n89.(1)\nThe Minister may make regulations to give effect to Article X of the\nInternational Convention on Civil Liability for Oil Pollution Damage, 1969 and\nall  other  liability  and  compensation  conventions  incorporated  under  this  Act,\nincluding regulations\n\n(a)\n\nvesting the Supreme Court of Barbados with compulsory jurisdiction,\nand conferring, to the extent that the Constitution permits, jurisdiction\non the Supreme Court of Barbados with respect to matters arising under\nthe regulations; and\n\n(b)\n\nfixing  fees  to  be  paid  in  respect  of  any  matters  provided  for  in  the\nregulations.\n\n\f55\n\n(2)\nSubsection (1) shall not be construed to limit the power of a judge of the\nSupreme Court of Barbados to make rules of court with respect to a matter that\nis not provided for in regulations made under that subsection.\n\nDelegation\n\nThe  Minister  may,  either  generally  or  as  otherwise  provided  by  an\n90.(1)\ninstrument  of  delegation  in  writing  and  signed  by  the  Minister,  delegate  to  a\nperson any of his powers under this Act, other than this power of delegation.\n\nA power exercised by a delegate under subsection (1) is deemed to have\n\n(2)\nbeen exercised by the Minister.\n\nA delegation under this section does not prevent the exercise of a power\n\n(3)\nby the Minister.\n\nImplementing Article 6(2) of LLMC\n\nWhere  the  amount  calculated  in  accordance  with  Article  6(1)(a)  is\n91.\ninsufficient to pay the claims mentioned therein full, the amount calculated in\naccordance  with  Article  6(1)(b)  shall  be  available  for  payment  of  the  unpaid\nbalance of claims under Article 6(1)(a) and such unpaid balance shall rank ratably\nwith claims under Article 6(1)(b), if any.\n\nImplementing Article 6(3) 1996 Protocol to the LLMC\n\n92.\nWithout  prejudice  to  any  claims  for  loss  of  life  or  personal  injury\nreferred to in section 91, claims under Article 6(3) of the LLMC, as amended, in\nrespect of damage to harbour works, basins and waterways, and aids to navigation\nhave priority over other claims under Article 6(1)(b) of that Convention.\n\nPlace where fund constituted\n\n93.(1)\nWhere a fund is constituted to deal with liability claims in relation to\nPart II and the fund is available and freely transferrable in respect of that claim,\na claimant may bring a claim against the fund before the court administering it.\n\n\f56\n\n(2)\nA person who has a claim against a fund is barred from exercising any\nrights against other assets of a party seeking to limit its liability under this Act,\nand if a ship or other property of that party has already been arrested or attached\nwithin  the  jurisdiction  of  a  state  party  to  the  LLMC,  as  amended,  a  court  of\ncompetent jurisdiction may order it to be released.\n\nA ship or other property referred to in subsection (2) shall be released if\n\n(3)\nthe fund has been constituted in\n\n(a)\n\n(b)\n\n(c)\n\nhe port where the occurrence took place;\n\nif the occurrence took place out of port, at the next port of call;\n\nin respect of loss of life or personal injury, the port of disembarkation;\n\n(d)\n\nin respect of damage to cargo, the port of discharge; or\n\n(e)\n\nthe state where the arrest is made.\n\nCurrency in which fund to be constituted\n\n94.\nBarbados currency.\n\nWhere  a  fund  is  constituted  in  Barbados,  it  shall  be  constituted  in\n\nMechanics of constituting fund\n\n95.(1)\n\nIn order to constitute a fund in Barbados, the claimant shall\n\n(a)\n\npay into court the Barbados dollar equivalent of the number of SDRs\nto which he claims to be entitled to limit his liability, together with\ninterest  at  the  prescribed  rate  on  that  amount  from  the  date  of  the\noccurrence to the date of the payment into court; or\n\n(b)\n\noffer security in that amount in the form of insurance, a bank guarantee\nor any other form of security that the court considers appropriate.\n\nA party constituting a limitation fund shall give notice in writing to every\n\n(2)\nother party to the claim, specifying\n\n(a)\n\nthe date of payment into court;\n\n\f(b)\n\nthe amount paid into court; and\n\n57\n\n(c)\n\nthe amount of interest, together with the rate at which, and period in\nrespect of which, the interest is calculated.\n\n(3)\nIf the Barbados dollar equivalent of the SDRs on the date of payment is\nnot  known,  amounts  paid  into  court  may  be  calculated  based  upon  the  latest\navailable published information and, when more current figures are available,\nthe  party  constituting  a  limitation  fund  shall  add  any  additional  amounts\nnecessary  or  may  apply  to  the  court  for  repayment  of  any  excess  amount\ncontributed.\n\nAdditional  amounts  added  to  a  fund  within  14  days  after  the  original\n(4)\npayment into court shall be treated as if the payment had been made on the date\nof the original payment into court, except as regards the accrual of interest.\n\nAn application for repayment of an excess amount may be made ex parte,\n(5)\nsupported by evidence proving the Barbados dollar equivalent of the appropriate\nnumber of SDRs on the date of payment into court.\n\nIf a repayment is made on an application made under subsection (5), notice\n(6)\nin writing shall be given to every other party to the claim of the excess amount\nand the amount of interest on that amount that has been paid out.\n\nPART X\n\nLIABILITY FOR MARITIME CARRIAGE OF PASSENGERS AND\nLUGGAGE\n\nDefinitions-Part X\n\n96.\n\nIn this Part,\n\n“insurance”  means  insurance  or  other  financial  security  satisfying  the\nrequirements  of  Article  4bis  of  the  Athens  Convention  relating  to  the\nCarriage of Passengers and their Luggage by Sea;\n\n\f58\n\n“proper officer” has the same meaning as in the Merchant Shipping Act, 2024\n\n(Act 2024- ); and\n\n“state party” means a country in respect of which the Athens Convention relating\n\nto the Carriage of Passengers and their Luggage by Sea is in force.\n\nForce of law\n\nThe  Athens  Convention  relating  to  the  Carriage  of  Passengers  and\n97.\ntheir Luggage by Sea, as amended by the 2002 Protocol to the Athens Convention\nrelating to the Carriage of Passengers and their Luggage by Sea, shall have the\nforce of law in Barbados.\n\nApplication\n\n98.\npassengers by sea other than\n\nThis  Part  applies  to  ships  and  persons  engaged  in  the  carriage  of\n\n(a)\n\n(b)\n\nwarships,  auxiliary  warships  or  other  state-owned  or  state-operated\nships used for non-commercial public service; and\n\nships  licensed  under  the  Shipping  (Domestic  Vessels)  Act,  2024\n(Act 2024-22) and engaged in the carriage of passengers by sea solely\nwithin Barbados waters.\n\nInsurance requirement\n\n99.(1)\nA ship shall not enter or leave a port in Barbados, and a ship that is a\nBarbados ship shall not enter or leave a port in any other country, unless there is\ninsurance in force in respect of that ship and a certificate complying with section\n100.\n\nSubsection (1) does not apply to a ship that is not licensed to carry more\n\n(2)\nthan 12 passengers.\n\n\f59\n\nInsurance certificates\n\n100.(1)\nproved by a certificate\n\nThe  existence  of  the  insurance  required  under  section  99  is  to  be\n\n(a)\n\n(b)\n\nin the form prescribed in the Annex to the Athens Convention relating\nto the Carriage of Passengers and their Luggage by Sea; or\n\nshowing that there is in force in respect of the ship insurance satisfying\nthe requirements of that Convention.\n\n(2)\n\nA ship’s certificate shall be\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nif the ship is a Barbados ship, a certificate issued by the Administration;\n\nif the ship is registered in a state party other than Barbados, a certificate\nissued by or under the authority of the government of that state party;\n\nif the ship is registered in a country that is not a state party or a member\nstate, a certificate issued by the Administration or under the authority\nof a state party; or\n\nif the ship is registered in a country that is not a state party but is a\nmember  state,  a  certificate  issued  by  or  under  the  authority  of  that\nmember state.\n\n(3)\n\nA ship’s certificate shall\n\n(a)\n\n(b)\n\nbe carried onboard the ship; and\n\nbe produced on demand by the ship’s master to\n\n(i)\n\nthe Administration or to any other proper officer, where the ship\nis a Barbados ship; or\n\n(ii)\n\nthe Administration, in the case of any other ship.\n\n\f60\n\nIssuance of certificates\n\n101.(1)\nOn  the  application  by  a  carrier  or  performing  carrier,  the\nAdministration  may  issue  a  certificate  under  section  100(2)(a)  or  (c)  if  he  is\nsatisfied that\n\n(a)\n\n(b)\n\nthere will be insurance in force throughout the period for which the\ncertificate is to be issued; and\n\nthe person providing the insurance will be able to meet his obligations\nunder it.\n\nWhere, at any time while a certificate is in force, the person to whom the\n(2)\ncertificate has been issued ceases to be the performing carrier in relation to the\nship to which the certificate relates, the certificate shall be delivered without delay\nto the Administration or to a proper officer.\n\nThe Administration shall cancel a certificate delivered under subsection\n\n(3)\n(2).\n\nWhere, at any time while a certificate is in force, it is established that the\n(4)\ncontract of insurance in respect of which the certificate is issued is or may be\ntreated as invalid, the certificate may be cancelled by the Administration.\n\nWhere  at  any  time  while  a  certificate  is  in  force  circumstances  arise  in\n(5)\nrelation to a insurer or guarantor named in the certificate that gives rise to a doubt\nwhether that person will be able to meet his obligations under it, the certificate\nmay be cancelled by the Administration.\n\nWhere a certificate is cancelled under subsection (4) or (5), the person to\n\n(6)\nwhom it was issued shall, on demand, delivered it to the Administration.\n\nThe Administration shall send a copy of any certificate issued under this\n(7)\nsection in respect of a Barbados ship to the Principal Registrar of International\nShips and the Registrar shall make the copy available for public inspection.\n\n\f61\n\nOffences\n\n102.(1)\n\nA carrier or performing carrier of a ship commits an offence if\n\n(a)\n\n(b)\n\nthe ship enters or leaves a port in contravention of section 99; or\n\nanyone  attempts  to  navigate  that  ship  into  or  out  of  a  port  in\ncontravention of that section.\n\n(2)\n\nA person convicted of an offence under subsection (1) is liable\n\n(a)\n\n(b)\n\non summary conviction, to a fine of $20 000; or\n\non conviction on indictment, to a fine of $50 000 or to imprisonment\nfor a term of 2 years or to both.\n\nA master who fails to comply with section 100(3) commits an offence and\n\n(3)\nis liable on summary conviction to a fine of $10 000.\n\nA person required by section 101(6) to deliver up a certificate who fails to\n\n(4)\ndo so is liable on summary conviction to a fine of $20 000.\n\nA document required or authorized under a statutory provision to be served\n(5)\non a foreign company for the purposes of, or in connection with the institution\nof, proceedings for an offence under section 100 against a company as owner of\nthe ship is to be treated as served on the company if the document is served on\nthe master of the ship.\n\nPower to detain\n\n103.(1)\nin contravention of section 99.\n\nA ship may be detained if a person attempts to navigate it out of port\n\nThe Merchant Shipping Act, 2024 (Act 2024- ) applies in relation to a ship\n(2)\ndetained under this Act, with a reference to “owner” being read as a reference to\n“carrier or performing carrier”.\n\n\f62\n\nAn officer detaining a ship shall serve on the master of the ship a detention\n\n(3)\nnotice that\n\n(a)\n\n(b)\n\nstates the reason for the detention; and\n\nrequires the ship to comply with the terms of the detention notice until\nit is released by a competent authority.\n\nWhere a ship that is not a Barbados ship is detained, the Minister shall\n(4)\nimmediately notify in writing the ship’s flag state administration or, if this is not\npossible,\n\n(a)\n\n(b)\n\nthe consul of the state of the flag administration; or\n\nin the consul’s absence, the nearest diplomatic representative of the\nstate of the flag administration.\n\nA  notice  under  subsection  (4)  shall  set  out  all  the  circumstances  of  the\n\n(5)\ndecision to detain the ship.\n\nWhere a notice is issued under subsection (4), the Minister shall notify all\n(6)\nrelevant  nominated  surveyors  or  recognized  organizations  responsible  for  the\nissuance of classification certificates.\n\n(7)\n\nIn this section,\n\n“competent authority” means\n\n(a)\n\n(b)\n\n(c)\n\nthe Director;\n\na surveyor of ships authorized by the Director for the purpose;\n\nan officer of customs;\n\n(d)\n\na Barbados consular officer;\n\n(e)\n\na commissioned naval or military officer;\n\n(f)\n\nan  officer  designated  by  the  Administration  as  a  port  state  control\nofficer; and\n\n(g)\n\nany other person authorized in writing by the Minister.\n\n\f63\n\nArbitration\n\n104.(1)\nThe master of a ship or its carrier or performing carrier may, by notice\ngiven to the officer who has detained the ship within 21 days from the service of\nthe detention notice, refer any question as to whether the matters specified in\nrelation to a ship in a detention notice constituted a valid basis for the officer’s\nopinion to a single arbitrator appointed by agreement between the parties.\n\nThe giving of a notice under subsection (1) does not suspend operation of\n\n(2)\nthe detention notice.\n\nAn arbitrator may have regard to any matter not specified in the detention\n(3)\nnotice that appears to the arbitrator to be relevant as to whether or not the ship\nwas liable to be detained.\n\nWhere an arbitrator decides that in all the circumstances a matter referred\n(4)\nto  him  did  not  constitute  a  valid  basis  for  the  officer’s  opinion,  the  arbitrator\nshall\n\n(a)\n\n(b)\n\ncancel the detention notice; or\n\naffirm  it  with  such  modifications  as  the  arbitrator  may  in  the\ncircumstances think fit.\n\nIn any case other than one described in subsection (4), the arbitrator shall\n\n(5)\naffirm the detention notice in its original form.\n\nThe decision of the arbitrator shall include a finding whether there was a\n\n(6)\nvalid basis for the detention of the ship.\n\n(7)\n\nTo be appointed as an arbitrator under this section, a person shall be\n\n(a)\n\na person holding a certificate of competency as a master mariner or as\na marine engineer officer class 1, or a person holding an equivalent\ncertificate;\n\n(b)\n\na naval architect; or\n\n\f64\n\n(c)\n\na person with experience of shipping matters, or of activities carried\non within ports.\n\nCompensation for unjustified detention\n\n105.(1)\narbitrator decides that the person making the reference has proved that\n\nIf, on a reference under section 104 relating to a detention notice, an\n\n(a)\n\n(b)\n\nthe matter complained of did not constitute a valid basis for the officer’s\nopinion; and\n\nthere  were  no  reasonable  grounds  for  the  issuance  of  the  detention\nnotice,\n\nthe arbitrator shall award the owner of the ship such compensation in respect of\nany loss suffered in consequence of the detention of the ship as the arbitrator\nthinks fit.\n\n(2)\n\nAny compensation awarded under this section is payable by the Minister.\n\nPART XI\n\nCIVIL LIABILITY FOR BUNKER OIL POLLUTION DAMAGE\n\nDefinitions-Part XI\n\n106.(1)\n\nIn this Part,\n\n“Bunker Convention” means the International Convention on Civil Liability for\n\nBunker Oil Pollution Damage, 2001, as amended;\n\n“Bunker Convention certificate” means a certificate issued under section 112;\n\n“bunker oil” means a hydrocarbon mineral oil, including lubricating oil, used or\nintended  to  be  used  for  the  operation  or  propulsion  of  the  ship,  and  any\nresidues of that oil;\n\n\f65\n\n“gross tonnage” means gross tonnage calculated in accordance with the tonnage\nmeasurement  regulations  contained  in  Annex  1  of  the  International\nConvention on Tonnage Measurement of Ships, 1969, as amended;\n\n“incident” means an occurrence or series of occurrences, having the same origin,\nthat  causes  pollution  damage  or  creates  a  grave  and  imminent  threat  of\ncausing such damage;\n\n“person” means an individual or partnership or a public or private body, whether\n\ncorporate or not, and includes a state or a subdivision of a state;\n\n“pollution damage” means\n\n(a)\n\n(b)\n\nloss or damage caused outside a ship by contamination resulting from\nthe escape or discharge of bunker oil from the ship; or\n\nthe costs of preventive measures and any further loss or damage caused\nby preventive measures;\n\n“preventive measures” means reasonable measures taken by any person after an\n\nincident has occurred to prevent or minimize pollution damage;\n\n“registered owner” in relation to a ship, means a person registered as the owner\n\nof the ship or, in the absence of registration, a person who owns the ship;\n\n“ship” has the same meaning as in the Merchant Shipping Act, 2024 (Act 2024- );\n\nand\n\n“shipowner” has the same meaning as in the Merchant Shipping Act, 2024 (Act\n\n2024- ).\n\nExcept as otherwise defined, words used in this Part and in the International\n(2)\nConvention  on  Civil  Liability  for  Bunker  Oil  Pollution  Damage,  2001,  as\namended, have the same meaning as in that Convention.\n\n\f66\n\nApplication\n\n107.\n\nThis Part applies to\n\n(a)\n\n(b)\n\npollution damage caused by a Barbados vessel in the territory territorial\nsea of a state part;\n\npollution  damage  caused  by  a  Barbados  vessel  in  the  exclusive\neconomic  zone  of  a  state  party  established  in  accordance  with\ninternational law or, if a state party has not established such a zone, in\nan area beyond and adjacent to the territorial sea of the state determined\nby that state in accordance with international law and extending not\nmore than 200 nautical miles from the baselines from which the breadth\nof its territorial sea is measured;\n\n(c)\n\npollution damage caused in the territory or territorial sea of Barbados,\nor in the exclusive economic zone of Barbados extending not more than\n200 nautical miles from the baselines from which the breadth of the\nterritorial sea is measured; and\n\n(d)\n\npreventive  measures,  wherever  taken,  to  prevent  or  minimize  such\ndamage in Barbados.\n\nForce of law\n\n108.(1)\nSubject  to  subsection  (2),  the  International  Convention  on  Civil\nLiability for Bunker Oil Pollution Damage, 2001, as amended, shall have the\nforce of law in Barbados.\n\nThe  Convention  does  not  apply  to  pollution  damage  as  defined  in  the\n(2)\nInternational  Convention  on  Civil  Liability  for  Oil  Pollution  Damage,  1992,\nwhether or not compensation is payable in respect of it under that Convention.\n\nCompulsory insurance or financial security\n\n109.(1)\nThe owner of a Barbados-registered ship with a gross tonnage more\nthan 1000 GT that enters or leaves a port in Barbados, or that arrives at or leaves\n\n\f67\n\nan offshore facility in Barbados or the territory of a state party, shall maintain\ninsurance or other financial security to cover the liability of the registered owner\nfor  pollution  damage  in  an  amount  equal  to  the  limits  of  liability  under  an\napplicable  national  or  international  limitation  regime,  but  not  exceeding  an\namount calculated in accordance with the Convention on Limitation of Liability\nfor Maritime Claims, 1976.\n\nEach ship referred to in subsection (1) shall carry a certificate attesting that\n(2)\ninsurance or other financial security is in force in accordance with the provisions\nof the Bunker Convention.\n\nLiability of the shipowner\n\nExcept as provided otherwise in Article 3 of the Bunker Convention,\n110.(1)\nthe shipowner at the time of an incident shall be liable for any pollution damage\ncaused by bunker oil on board or originating from the ship.\n\nIf an incident consists of a series of occurrences having the same origin,\n\n(2)\nliability shall attach to the shipowner at the time of the first occurrence.\n\nWhere more than one person is liable under subsection (1), their liability\n\n(3)\nshall be joint and several.\n\nWhen an incident involving 2 or more ships occurs and pollution damage\n(4)\nresults from it, the shipowners of all the ships concerned, unless exonerated under\nArticle 3 of the Bunker Convention, shall be jointly and severally liable for all\ndamage that is not reasonably separable.\n\nA claim for compensation for pollution damage may be brought directly\n(5)\nagainst the insurer or other person providing financial security for the registered\nshipowner’s liability for pollution damage.\n\nAn  insurer  or  other  person  providing  financial  security  may  invoke\n(6)\ndefences that the shipowner would have been entitled to invoke, subject to the\nrights  and  limitations  enumerated  in  paragraph  10  of  Article  7  of  the  Bunker\nConvention.\n\n\f68\n\nAn insurer or other person providing financial security may require the\n\n(7)\nshipowner to be joined in any proceedings under subsection (5).\n\nLimitation of liability\n\n111.(1)\nNothing in the Bunker Convention affects the right of a shipowner or\nperson providing insurance or other financial security to limit liability under any\napplicable national or international regime to which Barbados is a state party,\nincluding the Convention on the Limitation of Liability for Maritime Claims,\n1976.\n\nCompensation for impairment of the environment, other than loss of profit\n(2)\nfrom  that  impairment,  shall  be  limited  to  costs  of  reasonable  measures  of\nreinstatement actually undertaken or to be undertaken.\n\nCertification requirements\n\nA certificate of insurance or other financial security in respect of the\n112.(1)\nBunker Convention shall be issued by the Administration, or an official agent\nwho  is  authorized  to  act  on  behalf  of  the  Administration,  upon  receipt  and\napproval of proof of liability insurance or other financial security submitted by\nthe registered owner.\n\n(2)\n\nProof of coverage referred to in subsection (1) may be in the form of\n\n(a)\n\n(b)\n\na cover note Blue Card or similar confirmation; or\n\nwhere  a  registered  owner  is  self-insured,  a  duly  acknowledged\nstatement with an attached auditor’s report, setting forth the type and\namount of the vessel’s liability reserve, and the nature of the security\nprovided.\n\n(3)\n\nProof of coverage shall include the following:\n\n(a)\n\nprotection and indemnity coverage in force with respect to the vessel\nand issued by\n\n(i)\n\na member club of the International Group of P & I Clubs;\n\n\f69\n\n(ii)\n\n(iii)\n\n(iv)\n\na non-member club of the International Group of P & I Clubs\nwith a contractual agreement for re-insurance with a member of\nthe International Group of P & I Clubs;\n\na publicly traded insurer with verifiable reserves that fulfill the\nobligations required under the international conventions to which\nBarbados is a party; or\n\na non-member club of the International Group of P & I Clubs\nwith  verifiable  financial  reserves  that  fulfill  the  obligations\nrequired under the international conventions to which Barbados\nis a party;\n\n(b)\n\nin  the  case  of  a  pleasure  yacht,  third  party  liability  and  hull  and\nmachinery  insurance  issued  by  an  underwriter  in  policy  form\nacceptable to the Administration; or\n\n(c)\n\nin  the  case  of  a  self-insurer,  the  nature,  amount  and  security  of  the\nliability reserve.\n\nProof  of  coverage  may  be  sent  by  mail,  email  or  facsimile  to  the\n\n(4)\nAdministration.\n\nA  Bunker  Convention  certificate  shall  in  the  form  prescribed  by  the\n\n(5)\nAdministration and shall contain the following particulars:\n\n(a)\n\n(b)\n\n(c)\n\nthe name of the ship;\n\nany distinctive numbers or letters;\n\nits port of registry;\n\n(d)\n\nthe International Maritime Organization ship identification number;\n\n(e)\n\nthe name and principal place of business of the registered owner;\n\n(f)\n\nthe name and principal place of business of the insurer or other person\ngiving security, and where appropriate, the place of business where the\ninsurance or security is established; and\n\n\f70\n\n(g)\n\nthe period of validity of the certificate.\n\nThe  period  of  validity  of  a  Bunker  Convention  certificate  shall  not  be\n\n(6)\nlonger than the period of validity of the insurance or other security.\n\n(7)\nA  Bunker  Convention  certificate  shall  be  issued  to  each  vessel  at\nregistration or shortly afterwards and shall be renewed annually by the registered\nowner by the first day of February of each year.\n\nA Bunker Convention certificate shall be carried on board the ship at all\n\n(8)\ntimes.\n\nThe Administration shall not permit a ship under Barbados’ flag to which\n(9)\nthe  Bunker  Convention  applies  to  operate  at  any  time,  unless  a  Bunker\nConvention certificate has been issued.\n\nUnless expressly permitted by the Bunker Convention or the International\n(10)\nConvention  on  Civil  Liability  for  Oil  Pollution  Damage,  1992,  a  Bunker\nConvention certificate shall not be combined with an insurance certificate issued\nunder the International Convention on Civil Liability for Oil Pollution Damage,\n1992.\n\nPART XII\n\nLIMITATION OF TIME\n\nDefinitions-Part XII\n\n113.\n\nIn this Part,\n\n“owner” in relation to a ship, includes a person responsible for the navigation\nand management of the ship or any other person responsible for the fault or\nneglect of the ship.\n\n\f71\n\nLimitation period for claim or lien\n\nNo action may be commenced in respect of a loss, injury or damage,\n114.\nor in respect of pollution damage, later than 2 years after the loss, injury, damage\nor pollution damage arose to enforce a claim or lien against a ship that was in a\ncollision or other maritime accident or incident caused, in whole or in part, by\nthe fault or negligence of the ship, or against its owners, in respect of\n\n(a)\n\n(b)\n\n(c)\n\na loss or damage to another ship, its cargo or other property on board;\n\nany loss of earnings of that other ship;\n\nfor damages for loss of life or personal injury suffered by any person\non board that other ship; or\n\n(d)\n\npollution damage caused by the ship.\n\nExtension of time\n\n115.\n114\n\n(a)\n\n(b)\n\nA court that has jurisdiction to deal with an action referred to in section\n\nmay, in accordance with the rules of court, extend the period referred\nto in section 114 to the extent and on any conditions that it thinks fit;\nand\n\nshall, if satisfied that there has not during that period been a reasonable\nopportunity of arresting the ship within the jurisdiction of the court, or\nwithin the territorial waters of the country to which the claimant’s ship\nbelongs or in which the claimant resides or has his principal place of\nbusiness, extend that period to an extent sufficient to provide such an\nopportunity.\n\n\f72\n\nPART XIII\n\nMISCELLANEOUS\n\nRegulations\n\n116.\n\nThe Minister may make regulations\n\n(a)\n\n(b)\n\nprescribing anything to be prescribed under this Act; and\n\npertaining to any other matters addressed under, or incidental to, this\nAct.\n\nPower to amend schedules\n\n117.\n\nThe Minister may, by order, amend any schedules to this Act.\n\nDenunciations\n\n118.\n\nThe following conventions are denounced\n\n(a)\n\n(b)\n\n(c)\n\nthe Convention on Limitation of Liability for Maritime Claims, 1976;\n\nthe 1974 Protocol to the Athens Convention relating to the Carriage of\nPassengers and their Luggage by Sea; and\n\nthe 1976 Protocol to the Athens Convention relating to the Carriage of\nPassengers and their Luggage by Sea.\n\n\f73\n\nSCHEDULE\n\nDECLARATIONS AND RESERVATIONS TO THE CONVENTION ON\nLIMITATION OF LIABILITY FOR MARITIME CLAIMS 1976, AS\nAMENDED\n\n(Section 65(2))\n\nBarbados,  pursuant  to  Article  6,  paragraph  3  of  the  Convention,\n1.\ndeclares that claims in respect of damage to harbour works, basins, waterways\nand  aids  to  navigations  shall  have  priority  over  other  claims  under  Article  6,\nparagraph 1(b) of the Convention.\n\nBarbados  declares  that  for  the  purposes  of  Article  15(2)(b)  of  the\n2.\nConvention, limitation of liability for ships of 300 gross tonnes and below, the\nlimit of liability calculated in accordance with Article 6, paragraph 1(a) and (b)\nof the Convention, shall be half of the limit of liability applicable to a ship not\nexceeding 2,000 gross tonnes.\n\n3.\nBarbados declares that it intends to make use of the option provided\nfor in Article 15(3) bis of the Convention to regulate by specific provisions of\nnational  law  the  system  of  liability  to  be  applied  to  claims  for  loss  of  life  or\npersonal injury to passengers of a ship.\n\n4.\nPursuant  to  Article  18(1)(a)  and  (b)  of  the  Convention,  Barbados\nhereby  excludes  the  application  of  Article  2,  paragraphs  1(d)  and  (e),  and\nexcludes claims for damage within the meaning of the International Convention\non Liability and Compensation for Damage in Connection with the Carriage of\nHazardous and Noxious Substances by Sea, 1996, as amended, that arise from\noccurrences that take place after the entry into force of that Convention.\n\n\f74\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}