{
  "bill_id": 803,
  "slug": "merchant-shipping-liner-conferences-act-2024",
  "title": "Merchant Shipping (Liner Conferences) Act, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/69478db9916c07bfd50063d194176145.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-10-23",
  "first_reading": "2024-11-08",
  "gazette_date": "2024-10-07",
  "markdown": "2024-09-02\n\nOBJECTS AND REASONS\n\nThis Bill will make provision for\n\n(a)\n\n(b)\n\nadvancement of the liner conference trade; and\n\nfacilitation of the orderly expansion of liner shipping in Barbados.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nDefinitions\n\nPurpose\n\nApplication\n\nAct binds the State\n\nCode to have force of law\n\nConference trades\n\nPublication\n\nAdministration\n\nPART II\n\nDESIGNATION OF AUTHORITIES\n\n10.\n\nAuthority for shippers’ councils\n\n11.\n\nAuthority for national shipping lines\n\n\f3\n\n12.\n\nRegister of national shipping lines\n\nPART III\n\nDESIGNATION OF NATIONAL SHIPPING LINES\n\n13.\n\nNational shipping line criteria\n\n14.\n\nRecognition of slot charters\n\nPART IV\n\nDESIGNATION OF SHIPPERS’ ORGANIZATIONS AND SHIPPERS\n\n15.\n\nRecognition of shippers’ organizations and shippers\n\n16.\n\nEstablishment of regional inter-governmental committees\n\nPART V\n\nFILING OF CONFERENCE AGREEMENTS\n\n17.\n\nCompliance with the Code\n\n18.\n\nNon-compliant conference agreements\n\nPART VI\n\nFILING OF ANNUAL REPORTS\n\n19.\n\nFiling of annual reports\n\n\f4\n\nPART VII\n\nLEGAL CAPACITY OF CONFERENCES AND SHIPPERS’\nORGANIZATIONS\n\n20.\n\nLegal capacity of conferences and shippers’ organizations\n\n21.\n\nInformation on conferences\n\nPART VIII\n\nPRECEDENCE OF CONCILIATION PROCEEDINGS OVER OTHER\nREMEDIES\n\n22.\n\nInternational mandatory conciliation\n\n23.\n\nRecommendations made by conciliators\n\n24.\n\nConciliation award against a conference\n\nPART IX\n\nSETTLEMENT OF DISPUTES AT THE NATIONAL LEVEL\n\n25.\n\nNational-level dispute settlements\n\nPART X\n\nPROCEEDINGS ARISING OUT OF THE CODE\n\n26.\n\nLiability of members of conference\n\n27.\n\nProceedings by or against unincorporated conferences\n\n28.\n\nRestrictions on legal proceedings\n\n\f5\n\n29.\n\nTime for bringing legal proceedings\n\n30.\n\nRecommendations of conciliators\n\nPART XI\n\nMISCELLANEOUS\n\n31.\n\nLocal representation by conferences\n\n32.\n\nExclusion of shippers’ councils\n\n33.\n\nNon-conference members\n\n34.\n\nNomination of conciliators\n\n35.\n\nOperation within commercial framework under Merchant Shipping Act,\n2024\n\n36.\n\nMaritime Trade Facilitation Directives\n\n37.\n\nMaritime Compliance Obligations of National Shipping Lines\n\n38.\n\nShipping Alliances\n\n39.\n\nPower to make regulations\n\n40.\n\nPower to amend schedules\n\n41.\n\nRevocation\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to establish a regulatory environment for advancement of the liner\nconference  system  and  facilitate  the  orderly  expansion  of  liner  shipping  in\nBarbados;\n\nENACTED by the Parliament of Barbados as follows:\n\n\f8\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\nAct, 2024.\n\nThis Act may be cited as the Merchant Shipping (Liner Conferences)\n\nDefinitions\n\n2.(1)\n\nIn this Act,\n\n“Administration” means the Barbados Maritime Transport Administration;\n\n“Article” means an article of the Code;\n\n“Code” means the United Nations Convention on a Code of Conduct for Liner\n\nConferences, 1974;\n\n“conciliation” means international mandatory conciliation under Chapter VI of\n\nthe Code;\n\n“conference” has the meaning given by Chapter I of the Code;\n\n“judgment” in relation to proceedings arising out of the Code, means a judgment,\ndecree, order, award, recommendation or determination given or made in\nthose proceedings;\n\n“liner conference” has the meaning given by Chapter I of the Code;\n\n“Minister” means Minister responsible for Shipping;\n\n“National shipping line” has the meaning given by Chapter I of the Code.\n\n“prescribed” means prescribed by regulations made under section 39(1);\n\n“proceedings”  in  relation  to  the  Code,  means  legal  proceedings,  conciliation\nproceedings,  arbitration  proceedings  or  any  other  proceedings  for  the\ndetermination or resolution of a dispute arising out of the Code;\n\n\f9\n\n“Register of National Shipping Lines” means the register referred to in section\n\n12;\n\n“Shipping  alliances”  refer  to  commercial  agreements  between  shipping  lines\n\noperating in the container shipping industry to enable:\n\n(a)\n\n(b)\n\n(c)\n\nroute and service sharing;\n\nsharing of vessel fleets;\n\nterminal sharing;\n\n(d)\n\ncooperation in operations and logistics;\n\n(e)\n\nresources and knowledge sharing; and\n\n(f)\n\nthe sharing of other benefits deriving from shipping alliances;\n\n“slot charterer” means a shipping line that\n\n(a)\n\n(b)\n\n(c)\n\nfunctions as an independent shipping line;\n\nbelongs to a consortium or service; and\n\nbuys or leases slots from the principal operators of a vessel; and\n\n“trade” has the same meaning as in the Code.\n\nFor the purposes of this Act, conciliation proceedings relating to a dispute\n(2)\nare instituted when a party to the dispute requests that it be referred to conciliation\nand  are  completed  when\nthe  parties  of  his\nrecommendations.\n\nthe  conciliator  notifies\n\nPurpose\n\n3.\n\nThe purposes of this Act are to\n\n(a)\n\n(b)\n\ngive effect to the United Nations Convention on a Code of Conduct for\nLiner Conferences, 1974;\n\ncreate  the  enabling  regulatory  environment  for  advancement  of  the\nliner conference system in Barbados;\n\n\f10\n\n(c)\n\n(d)\n\n(e)\n\nensure the rights of participation in trade of national shipping lines to\nentitle them to carry a substantial share of Barbados’ foreign trade in\nthe international market;\n\nbalance  the  interests  shippers  and  shipowners  and  to  facilitate  the\norderly expansion of the liner trade;\n\nattain  more  significant  participation  by  Barbados  in  liner  shipping,\nthe  International  Development  Strategy,  and\nconsistent  with\nSustainable Development Goals of the United Nations; and\n\n(f)\n\nprovide for matters related thereto.\n\nApplication\n\n4.\nall commercial parties concerned, irrespective of nationality.\n\nThe Act applies to conference trades serving Barbados, and applies to\n\nAct binds the State\n\n5.\n\nThis Act shall bind the State.\n\nCode to have force of law\n\n6.\n\nThe Code shall have the force of law in Barbados.\n\nConference trades\n\n7.\n\nConference trades shall be conducted in accordance with the Code.\n\nPublication\n\nThe Administration, upon the written request of the Minister, shall\n8.\npublish, in any appropriate format, the names of conferences that the Government\nof Barbados considers to fall within the scope of the Code.\n\n\f11\n\nAdministration\n\n9.(1)\nAdministration, in consultation with the Ministry responsible for Commerce.\n\nThis Act shall be administered by the Barbados Maritime Transport\n\nThe Minister shall perform his functions under this Act, in consultation\n\n(2)\nwith the Minister responsible for Commerce and other relevant stakeholders.\n\nPART II\n\nDESIGNATION OF AUTHORITIES\n\nAuthority for shippers’ councils\n\nThe Ministry responsible for Shipping is the appropriate authority in\n10.\nrespect of matters concerning shippers’ councils and shall perform the functions\nrelated  to  shippers’  councils  specified  in  the  Code,  and  may  take  such\nadministrative  actions  as  are  necessary  to  effectively  implement  the  matters\npertaining to shipper’s councils.\n\nAuthority for national shipping lines\n\n11.\nThe Administration shall perform the functions specified in the Code\nrelated to national shipping lines, and may take such administrative actions as\nare necessary to effectively implement the matters pertaining to national shipping\nlines.\n\nRegister of national shipping lines\n\n12.\nShipping Lines, in which it shall register\n\nThe Administration shall maintain an electronic Register of National\n\n(a)\n\nany vessel-operating carrier that has its ownership and head office in\nBarbados and is designated under section 13 as a national shipping line\nor recognized as one under section 14;\n\n\f12\n\n(b)\n\nany  lines  belonging  to,  and  operated  by,  a  joint  venture  involving\nBarbados and another country if\n\n(i)\n\n(ii)\n\na majority share of the equity is held by public or private Barbadian\nshipping industry stakeholders; and\n\nits head office of management and effective control is in Barbados\nor the other country; and\n\n(c)\n\nany other national shipping line designated by order, published in the\nOfficial Gazette, by the Minister.\n\nPART III\n\nDESIGNATION OF NATIONAL SHIPPING LINES\n\nNational shipping line criteria\n\n13.\nit shall meet the following criteria:\n\nIn order for a shipping line to be designated as a national shipping line,\n\n(a)\n\n(b)\n\nhave its head office in Barbados;\n\nif it is part of a joint venture, have its head office in Barbados or in a\ncountry participating in the joint venture;\n\n(c)\n\nbe registered\n\n(i)\n\nin accordance with the Companies Act, Cap. 308;\n\n(ii)\n\nvessels comprising the line be registered in accordance with the\nMerchant Shipping Act, 2024 (Act 2024- );\n\n(d)\n\nbe majority-owned and operated by\n\n(i)\n\nnationals of Barbados;\n\n(ii)\n\npermanent residents of Barbados; or\n\n(iii)\n\na statutory corporation in Barbados;\n\n\f13\n\n(e)\n\nhave insurance or other equivalent form of financial security;\n\n(f)\n\n(g)\n\ncarry  a  complement  of  Barbadian  seafarers,  including  the  ship’s\nmaster, of which not less than three-fourths are nationals of Barbados;\n\nemploy,  if  part  of  a  joint  venture,  Barbadian  seafarers  in  equal\npercentages to seafarers from the other countries participating in the\njoint venture;\n\n(h)\n\nserve the trade of Barbados;\n\n(i)\n\n(j)\n\n(k)\n\nbe plying trade on major shipping routes;\n\nbe listed in the Register of National Shipping Lines; and\n\nmeet such other criteria as may be specified from time to time in a\nMaritime Trade Facilitation Directive issued under section\n\nRecognition of slot charters\n\nSubject to subsection (2), shipping lines operating only as slot charters\n14.(1)\nand not entire vessels shall be entitled to be recognized as national shipping lines\nfor the purposes of the Code.\n\nThe Minister, in consultation with the relevant conferences, may prescribe\n\n(2)\ncriteria for slot charters to be recognized as national shipping lines.\n\nPART IV\n\nDESIGNATION OF SHIPPERS’ ORGANIZATIONS AND SHIPPERS\n\nRecognition of shippers’ organizations and shippers\n\n15.(1)\nand individual shippers that will have the right to consult with conferences.\n\nThe Minister may designate by regulation the shippers’ organizations\n\nThe Minister shall ensure administrative arrangements are put in place to\n\n(2)\nreconcile any differences that may arise between different shippers’ interests.\n\n\f14\n\n(3)\nWhere  it  is  decided  that  individual  shippers  and  representative  shipper\nbodies should be designated for the purposes of consultation under Article 11 of\nthe Code, the criteria to be adopted for that purpose may be set out by the Minister\nin regulations made under section 36(1).\n\nFreight-forwarders  may  become  members  of  locally  based  shippers’\n\n(4)\norganizations.\n\n(5)\n\nAssociations of freight-forwarders may participate in liner conferences.\n\nWhere shippers’ organizations have set up a regional body for the purpose\n(6)\nof consultations with conferences on a regional basis, the regional body may act\non their behalf in consultations with conferences under Article 11 of the Code.\n\nAgreements reached by regional bodies with conferences are binding on\n\n(7)\nnational shippers’ organizations.\n\nEstablishment of regional inter-governmental committees\n\nThe Prime Minister, in consultation with the Ministers responsible for\n16.\nShipping  may  facilitate  the  establishment  of  regional  inter-governmental\ncommittees  representing  a  number  of  governments,  including  Barbados,  to\nparticipate in consultations with conferences on a regional basis.\n\nPART V\n\nFILING OF CONFERENCE AGREEMENTS\n\nCompliance with the Code\n\n17.(1)\nshall be made available upon request by the Administration:\n\nIn accordance with Article 6 of the Code, the following documents\n\n(a)\n\n(b)\n\n(c)\n\nconference agreements;\n\npooling agreements;\n\nberthing agreements;\n\n\f(d)\n\nsailing agreements;\n\n15\n\n(e)\n\namendments to agreements referred to in paragraphs (a) to (d);\n\n(f)\n\n(g)\n\ntrade participation and loyalty arrangements; and\n\nother documents directly related to, or that affect, the documents listed\nin paragraphs (a) to (f).\n\nThe documents referred to in subsection (1) shall be filed annually with\n(2)\nthe  Administration  by  members  of  a  conference  whose  shipping  lines  serve\nBarbados.\n\nWhere  a  shipping  line  of  Barbados  is  a  third  country  member  of  a\n(3)\nconference  serving  the  foreign  trade  between  two  other  countries  that  are\ncontracting parties to the Code, an agreement may be sought with the conference\nfor regular submissions to it of the relevant conference agreements.\n\nNon-compliant conference agreements\n\n18.\nthe Code are void to the extent that they are inconsistent with the Code.\n\nConference agreements that do not comply with the requirements of\n\nPART VI\n\nFILING OF ANNUAL REPORTS\n\nFiling of annual reports\n\n19.(1)\nIn  accordance  with  Article  10  of  the  Code,  conferences  serving\nBarbados shall provide locally based shippers’ organizations with annual reports\nof their activities.\n\nSuch  annual  reports  shall  be  submitted,  on  request,  to  the  Barbados\n\n(2)\nMaritime Transport Administration.\n\n\f16\n\nPART VII\n\nLEGAL CAPACITY OF CONFERENCES AND SHIPPERS’\nORGANIZATIONS\n\nLegal capacity of conferences and shippers’ organizations\n\n20.(1)\na party, or be named as a party, to legal proceedings in its collective capacity.\n\nA conference or shippers’ organization may institute proceedings as\n\nAny notification to a conference or shippers’ organization in its collective\n(2)\ncapacity shall also constitute a notification to each member of the conference or\nshipper’s organization.\n\nShippers’ organizations that have a corporate legal status may participate\n\n(3)\nin legal proceedings in that capacity.\n\nInformation on conferences\n\nConferences  operating  in  trades  between  Barbados  and  other\n21.(1)\ncontracting  parties  shall  register,  with  the  Administration,  their  names  and\naddresses, a list of their members and the names of conference office bearers.\n\nThe Administration shall make publicly available the information provided\n\n(2)\nunder subsection (1).\n\n\f17\n\nPART VIII\n\nPRECEDENCE OF CONCILIATION PROCEEDINGS OVER OTHER\nREMEDIES\n\nInternational mandatory conciliation\n\nInternational mandatory conciliation invoked pursuant to Article 25,\n22.\nparagraph 3 of the Code shall have precedence over other remedies available in\nnational law.\n\nRecommendations made by conciliators\n\nWhere  a  recommendation  has  been  made  by  a  conciliator  in  the\n23.(1)\nresolution of a dispute and the recommendation has been accepted by the parties\nconcerned, an application may be made to the High Court for enforcement of the\nrecommendation.\n\nThe  Minister  may  make  regulations  setting  out  the  procedures  to  be\n\n(2)\nfollowed in an application under subsection (1).\n\nConciliation award against a conference\n\n24.\nWhere a conciliation award is made against a conference, the award\nshall be enforced against all conference lines, in proportion to their individual\nresponsibilities, irrespective of whether any particular member line is a national\nentity of a contracting party.\n\n\f18\n\nPART IX\n\nSETTLEMENT OF DISPUTES AT THE NATIONAL LEVEL\n\nNational-level dispute settlements\n\nDisputes  between  shipping\n\nlines  of  Barbados,  or  between\n25.(1)\norganizations  belonging  to  Barbados,  shall  be  settled  within  the  dispute\nsettlement framework of Barbados, unless this would be inconsistent with the\nrequirements of the Code.\n\nThe following shall have access to national courts for the settlement of\n\n(2)\ndisputes:\n\n(a)\n\n(b)\n\n(c)\n\nshipping lines;\n\nshippers organizations; and\n\nshippers.\n\nPART X\n\nPROCEEDINGS ARISING OUT OF THE CODE\n\nLiability of members of conference\n\n26.(1)\nWhere  proceedings  arising  out  of  the  Code  are  brought  against  a\nmember of a conference in respect of damage or loss suffered by any person and\nother members of the conference are liable, jointly or otherwise, in respect of the\nsame damage or loss, the liability of that member to make good that damage or\nloss shall be in proportion to its responsibility.\n\nFor the purposes of subsection (1), the liability of other members of the\n(2)\nconference is the liability that has been, or could be, established in proceedings\nbrought before the same court or tribunal by or on behalf of the person suffering\n\n\f19\n\nthe damage or loss, irrespective of under what law the issue of liability was or\nwould be determined.\n\nIn  ascertaining  the  responsibility  of  a  member  of  a  conference  for  the\n(3)\npurposes of subsection (1), regard shall be had not only to the member’s part, if\nany,  in  the  matters  giving  rise  to  the  proceedings  but  also  to  its  general\ninvolvement  in  the  affairs  of  the  conference,  as  indicated  by  its  share  of  the\nconference trade, the nature of pooling arrangements to which it is a party and\nthe extent to which it contributes to the administrative expenses of the conference.\n\nSubsections  (1)  to  (3)  apply  to  any  proceedings  in  Barbados  and  to\n(4)\nproceedings  elsewhere  in  which  the  extent  of  the  liability  of  a  member  of  a\nconference falls to be determined by reference to the law of Barbados.\n\n(5)\n\nWhere in proceedings arising out of the Code\n\n(a)\n\n(b)\n\njudgment  is  given  against  a  member  of  a  conference  in  respect  of\ndamage or loss caused to any person; and\n\nthe extent of the member’s liability is not determined by reference to\nsubsections (1) to (3),\n\nthe member shall not, if it is sought to enforce the judgment in Barbados, be liable\nto make good any greater proportion of that damage or loss than if the extent of\nits liability had been determined by reference to those subsections.\n\nA  member  of  an  unincorporated  conference  against  which  judgment  is\n(6)\ngiven, whether in Barbados or elsewhere, in proceedings arising out of the Code\nin respect of damage or loss caused by a breach of duty by the conference, shall\nnot, by virtue of section 27(3), be liable to make good any greater proportion of\nthat damage or loss than it would have had to pay if the proceedings had been\nbrought against it and the other members of the conference in respect of a duty\nowed by all the members of the conference and the extent of its liability had been\ndetermined by reference to subsections (1) to (3).\n\nSubsections (5) and (6) shall not affect the enforcement in Barbados of a\n(7)\njudgment  required  to  be  enforced  there  by  virtue  of  any  enactment  on  the\nenforcement of foreign judgments.\n\n\f20\n\nProceedings by or against unincorporated conferences\n\n27.(1)\nown name in proceedings arising out of the Code.\n\nA conference that is not a body corporate may sue and be sued in its\n\n(2)\nSubsection (1) applies to any proceedings in Barbados and to proceedings\nelsewhere in which the capacity of a conference to sue and be sued in its own\nname falls to be determined by reference to the law of Barbados.\n\nA  judgment  given  for  or  against  an  unincorporated  conference  in\n(3)\nproceedings brought against the conference in its own name, whether in Barbados\nor elsewhere, is binding on the members of the conference, and such a judgment\nis enforceable\n\n(a)\n\nagainst any property held in trust for the purposes of the conference,\nto the same extent and in the same manner as if the conference were a\nbody corporate; and\n\n(b)\n\nagainst any member of the conference, subject to section 26(5).\n\nSubsection (3) applies to judgments given by a court in Barbados or that\n\n(4)\nare enforceable or entitled to recognition in Barbados.\n\nRestrictions on legal proceedings\n\n28.(1)\nor operation of the Code may be brought in Barbados only in the High Court.\n\nLegal proceedings arising out of a dispute relating to the application\n\nProceedings arising out of a dispute to be resolved within the framework\n(2)\nof the national jurisdiction concerned in accordance with Article 23, paragraph\n2 of the Code shall not be entertained by the High Court except as permitted by\nthat paragraph.\n\nThe High Court shall stay proceedings before it if, on the application of a\n(3)\nparty to the proceedings made after entering an appearance but before delivering\nany pleadings or taking any other steps in the proceedings, it is shown that the\n\n\f21\n\nproceedings arise out of a dispute to which Article 23, paragraph 4 of the Code\napplies and that\n\n(a)\n\n(b)\n\nthe dispute has not been referred to conciliation in accordance with that\nparagraph or conciliation proceedings are still in progress; or\n\nthe parties to the dispute have made an agreement on procedures in\nlieu  of  conciliation  to  which  Article  25,  paragraph  1  applies  that  is\ncapable of being, or has been, performed.\n\nThe High Court may attach to a stay granted under subsection (3) such\n(4)\nconditions as appear to it appropriate, including conditions with respect to the\ninstitution or prosecution of conciliation or other proceedings.\n\nThe High Court may remove a stay granted under subsection (3) if any\n(5)\nattached condition is not complied with or if at any time it appears to the Court\nthat the circumstances are such that a new application for the stay would not be\ngranted.\n\nSubsections  (3)  to  (5)  apply  to  an  arbitration  agreement  referred  to  in\n\n(6)\nArticle 25, paragraph 1, in place of section 6 of the Arbitration Act, Cap. 110.\n\nTime for bringing legal proceedings\n\n29.\nNo legal proceedings arising out of a dispute relating to the application\nor operation of the Code shall be brought in Barbados more than 2 years after the\ndate on which the cause of action accrued or 6 months after the date on which\nconciliation proceedings relating to the dispute were completed or abandoned,\nwhichever is the later.\n\nRecommendations of conciliators\n\n30.(1)\nWhere  a  recommendation  of  conciliators  has  become  binding  as\nbetween two or more parties to a dispute in accordance with Article 37 of the\nCode, subject to subsection (2)\n\n(a)\n\nit shall be recognized in Barbados as conclusive as between the parties\nto which it relates; and\n\n\f22\n\n(b)\n\na  party  may  apply  to  have  the  recommendation  registered  for\nenforcement in the High Court.\n\n(2)\nA recommendation shall not be recognized or enforced under subsection\n(1) if any of the circumstances mentioned in subparagraphs (a) to (d) of Article\n39, paragraph 2 of the Code apply, unless the affected part of the recommendation\ncan be severed in accordance with Article 39, paragraph 3 of the Code and the\nremainder of the recommendation can be recognized and enforced.\n\nWhere the conciliation and administration costs to be borne by a party to\n(3)\nconciliation proceedings in accordance with Article 43, paragraph 1 of the Code\nhave been determined, the person to whom those costs are to be paid may apply\nto have the determination registered for enforcement in the High Court.\n\nA  party  in  whose  favour  an  award  of  costs  for  vexatious  or  frivolous\n(4)\nproceedings has been made by conciliators under Article 43, paragraph 3 of the\nCode  may  apply  to  have  the  award  registered  for  enforcement  in  the  High\nCourt.\n\n(5)\n\nThe rules of the Court may provide for\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe manner in which an application is to be made for registration of a\nrecommendation, determination or award under this section;\n\nthe documents to be produced and the matters to be proved by a person\nseeking  recognition  of  a  recommendation  or  enforcement  of  a\nrecommendation, determination or award;\n\nthe manner in which a recommendation, determination or award is to\nbe registered under this section; and\n\nthe  manner  in  which,  and  the  conditions  subject  to  which,  such  a\nrecommendation, determination or award may be enforced.\n\n(6)\n\nSubject to paragraph (5)(d)\n\n(a)\n\na  recommendation,  determination  or  award  registered  under  this\nsection shall, for the purposes of its enforcement, have the same force\nand effect;\n\n\f23\n\n(b)\n\n(c)\n\nthe  registering  court  shall  have  the  same  powers  in  relation  to  its\nenforcement; and\n\nthe same proceedings for or with respect to its enforcement may be\ntaken,\n\nas if the recommendation, determination or award had been a judgment or decree\noriginally given in the High Court and had been entered in that Court.\n\nWhere a recommendation, determination or award is registered under this\n(7)\nsection, the reasonable costs or expenses of, and incidental to, its registration are\nrecoverable as if they were sums recoverable under it, and carry interest as if they\nwere the subject of an order for the payment of costs or expenses made by the\nHigh Court on the date of registration.\n\nPART XI\n\nMISCELLANEOUS\n\nLocal representation by conferences\n\nIn accordance with Article 21 of the Code, conferences shall establish\n31.\nlocal  representation  in  Barbados  or,  where  there  are  practical  reasons  to  the\ncontrary, regional representation.\n\nExclusion of shippers’ councils\n\n32.\nfor the purposes of this Act.\n\nA shippers’ council shall not be regarded as an appropriate authority\n\nNon-conference members\n\n33.(1)\nNothing in this Act shall be construed so as to deny shippers an option\nin the choice between conference shipping lines and non-conference shipping\nlines.\n\n\f24\n\nNon-conference shipping lines competing with a conference shall adhere\n\n(2)\nto the principle of fair competition on a commercial basis.\n\n(3)\nIn the interest of the sound development of liner shipping service, non-\nconference shipping lines shall not be prevented from operating as long as they\ncomply with the requirements of subsection (2).\n\nNomination of conciliators\n\n34.\nIn accordance with Article 30 of the Code, the Minister may appoint\nup to 12 members to a panel of conciliators, and shall ensure a record of their\nnames are kept.\n\nOperation within commercial framework under Merchant Shipping\nAct, 2024\n\nTo the extent practicable, parties to a liner conference shall operate\n35.\nwithin the commercial and contractual framework outlined under Division 10 of\nPart 35 of the Merchant Shipping Act, 2024 (Act 2024- ).\n\nMaritime Trade Facilitation Directives\n\n36.\nThe Minister may by notice published in the Official Gazette issue a\nmaritime  trade  facilitation  directive  in  respect  of  advancing  liner  trade  and\nseaborne trade concerning national shipping lines.\n\nMaritime Compliance Obligations of National Shipping Lines\n\n37.\n\nNational shipping lines shall comply with the relevant\n\n(a)\n\n(b)\n\nvessel  registration  conditions,  maritime  safety,  security  and  marine\nenvironmental  protection  requirements,  contained  in  the  Merchant\nShipping Act, 2024 (Act 2024- ) and statutory instruments thereunder;\n\natmospheric  pollution  prevention  requirements,  contained  in  the\nMarine  Transport  (Emissions  Control)  Act,  2024  (Act  2024-2)  and\nstatutory instruments thereunder;\n\n\f25\n\n(c)\n\n(d)\n\nmaritime  labour  protection  requirements,  contained  in  national\nseafaring laws;\n\ngeneral and operational requirements for vessels engaged on domestic\nvoyages,  in  the  case  of  smaller  vessels  participating  in  conference\ntrades within the Caribbean Trading Area, as contained in the Shipping\n(Domestic Vessels) Act, 2024 (Act 2024-22) and statutory instruments\nthereto; and\n\n(e)\n\nany other applicable maritime operational requirements, specified in\nany other enactment on shipping or a Merchant Shipping Notice.\n\nShipping Alliances\n\nTo facilitate maritime commerce and trade through shipping alliances\n38.(1)\nand  derive  benefits  from  such  alliances,  the  Minister  may  by  regulations  or\nMaritime  Trade  Facilitation  Directive  develop  the  enabling  framework  for\nmaritime commerce and trade through shipping alliances.\n\n(2)\n\nContainer ships participating in shipping alliances shall comply with\n\n(a)\n\n(b)\n\ninternational maritime safety, security, environmental protection and\nmaritime labour protection standards; and\n\nany other applicable maritime operational requirements, specified in\nany other enactment on shipping or a Merchant Shipping Notice.\n\nPower to make regulations\n\n39.(1)\nmatters addressed under, or incidental to, this Act.\n\nThe  Minister  may  make  regulations  pertaining  to  any  or  all  of  the\n\nThe  Minister  may  make\n\nthe  shippers’\n(2)\norganizations and individual shippers that would have the right to consultation\nwith conferences and the criteria to be adopted for that purpose.\n\nregulations  designating\n\n\f26\n\nPower to amend schedules\n\n40.\nunder this Act.\n\nThe Minister may by order amend the schedules to regulations made\n\nRevocation\n\n41.\n\nThe Liner Conferences Act, Cap. 290 is repealed.\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}