{
  "bill_id": 805,
  "slug": "merchant-shipping-maritime-marriage-act-2024",
  "title": "Merchant Shipping (Maritime Marriage) Act, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/49cd6f1624561b809df1168a2742b635.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-10-23",
  "first_reading": "2024-11-08",
  "gazette_date": "2024-10-07",
  "markdown": "2024-09-02\n\nOBJECTS AND REASONS\n\nThis Bill will make provision for\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe conduct and formalities of marriages on board ships, irrespective\nof where those ships may be operating;\n\nthe licensing of ship captains to function as marriage officers and marry\npersons on board Barbados ships;\n\nthe recognition of marriages on board Barbados ships as having taken\nplace in Barbados; and\n\na  regulatory  framework  to  support  obtaining  a  legally  recognized\nmarriage in the maritime context.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nAct binds the State\n\nPART II\n\nMARRIAGES ON BARBADOS SHIPS IN THE HIGH SEAS\n\nLicensing of ship masters to be principal marriage officers\n\nLicensing of second marriage officer\n\nList of marriage officers\n\nGeneral marriage prerequisites\n\nNotice of marriage\n\nIssuance of marriage certificate\n\n10.\n\nSpecial licenses\n\n11.\n\nLapsing of Marriage Certificate or Special License within 3 months\n\n\f3\n\n12.\n\nContracting of marriage before marriage officer\n\n13.\n\nMarriage in extremis\n\n14.\n\nVoid marriages\n\n15.\n\nRegistration of marriages\n\n16.\n\nSearch of Register and obtaining copies of particulars\n\n17.\n\nRegistrar may require information\n\n18.\n\nAlterations and amendments\n\nPART III\n\nMARRIAGE OF BARBADIAN CITIZENS ON FOREIGN SHIPS\n\n19.\n\nDefinitions\n\n20.\n\nSolemnization of marriages on foreign ships\n\n21.\n\nCompliance with laws of the foreign country\n\n22.\n\nDeclaration by parties and witnesses\n\n23.\n\nPlace and form of solemnization\n\n24.\n\nCertificate of marriage\n\n25.\n\nValidity of foreign marriages in Barbados\n\n26.\n\nNew notice when marriage not solemnized within 3 months\n\n27.\n\nNotice of intended marriage\n\n\f4\n\n28.\n\nMarriage Notice Book\n\n29.\n\nPublication of notice\n\n30.\n\nObjection to marriage\n\n31.\n\nSolemnization of marriage where no objection made\n\n32.\n\nProcedure on receipt of objection\n\nPART IV\n\nREGISTRATION OF FOREIGN MARRIAGES\n\n33.\n\nRegistration of foreign marriages\n\n34.\n\nRecognition of foreign maritime marriages\n\n35.\n\nCertification of documents of foreign maritime marriages\n\n36.\n\nCertified copies to be evidence\n\n37.\n\nCorrection of errors\n\n38.\n\nAct not to affect validity of marriages outside it\n\n39.\n\nMarriages on board foreign ships in Barbados waters\n\n40.\n\nMarriage not to contravene the laws of Barbados\n\nPART V\n\nOFFENCES\n\n41.\n\nOffences\n\n\f5\n\nPART VI\n\nMISCELLANEOUS\n\n42.\n\nRegister as evidence of marriage\n\n43.\n\nUse of foreign language\n\n44.\n\nOaths\n\n45.\n\nElectronic recording of information\n\n46.\n\nFees\n\n47.\n\nLicensing of foreign ship captains as marriage officers\n\n48.\n\nVarying, suspension or revocation of license\n\n49.\n\nLicense terms and conditions\n\n50.\n\nMarriage ceremonies on yachts\n\n51.\n\nMarriage ceremonies on vessels registered under the Shipping (Domestic\nVessels) Act\n\n52.\n\nApplication of Act to marriages involving seafarers\n\n53.\n\nRules\n\n54.\n\nPower to make regulations\n\nSCHEDULE\n\nCertificate for the Solemnization of a Marriage in extremis\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the conduct and formalities of marriages on board\n\nships.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f8\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\nAct, 2024.\n\nThis Act may be cited as the Merchant Shipping (Maritime Marriage)\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Barbados Maritime Transport Administration” has the same meaning as in the\n\nMerchant Shipping Act, 2024 (Act 2024-  );\n\n“Barbados  ship”  means  a  ship  registered  in  Barbados  under  the  Merchant\n\nShipping Act, 2024 (Act 2024- );\n\n“Barbados  waters”  has  the  meaning  assigned  to  it  in  the  Shipping  (Domestic\n\nVessels) Act, 2024 (Act 2024-22);\n\n“certificate for marriage” means a certificate issued by the Registrar under section\n\n9;\n\n“high seas” means all parts of the sea that are not included in the territorial sea\n\nor internal waters of a state or territory;\n\n“master” has the meaning assigned to it in the Merchant Shipping Act, 2024 (Act\n\n2024- );\n\n“Maritime Marriage Notice Book” means the book referred to in section 8(2);\n\n“Maritime Marriage Log Book” means the book referred to in section 15(1);\n\n“marriage officer” means the master of a Barbados ship licensed under section 4\n\nor a second marriage officer licensed under section 5;\n\n“Minister” means Minister responsible for marital affairs;\n\n\f9\n\n“prescribed form” means a form prescribed in a Marine Notice;\n\n“\"Register of Maritime Marriages” means the register referred to in section 15(1);\n\n“Registrar” means the Registrar of the Supreme Court referred to in the Marriage\n\nAct, Cap. 218A;\n\n“Special Licence” means the licence issued by the Minister under section 10.\n\nAct binds the State\n\n3.\n\nThis Act shall bind the State.\n\nPART II\n\nMARRIAGES ON BARBADOS SHIPS IN THE HIGH SEAS\n\nLicensing of ship masters to be principal marriage officers\n\n4.(1)\n\nThe Minister may grant a licence in writing to\n\n(a)\n\n(b)\n\nthe master of a Barbados ship; or\n\nan officer on board a Barbados ship, where such officer is second in\ncommand to the master, and is nominated in writing by the master\n\nto be a marriage officer for the purposes of the Act.\n\nAn application for the grant to a master of a licence to be a marriage officer\n\n(2)\nshall\n\n(a)\n\n(b)\n\n(c)\n\nbe made in writing to the Minister;\n\nstate the applicant’s full name, address and date of birth; and\n\ncontain such other particulars as may be required by the Minister.\n\nAn application shall be forwarded to the Registrar of International Ships,\n(3)\naccompanied by a certificate of the applicant's qualifications to be a master of a\n\n\f10\n\nBarbados  ship  and  a  letter  of  his  appointment  to  serve  on  board  a  Barbados\nship.\n\nThe Registrar of International Ships, on being satisfied that the application\n(4)\ncontains sufficient information to enable it to be considered by the Minister, shall\nforward  the  application  to  the  Minister  with  his  recommendation  on  the\napplication.\n\nA licence granted by the Minister under this section has effect as of the\n\n(5)\ndate the licence was issued and is valid for the period specified in the licence.\n\nThe terms of a licence may limit it to any particular ship or ships or limit\n\n(6)\nthe functions for which the master is licensed.\n\nA  licence  granted  by  the  Minister  under  this  section  shall  be  in  the\n\n(7)\nprescribed form.\n\nThe Minister shall cause a notice of the grant of the licence to be published\n\n(8)\nin the Official Gazette as soon as possible after the licence is granted.\n\nThe  Minister  may  at  any  time  revoke  a  licence  granted  under  this\n\n(9)\nsection.\n\nA marriage officer may at any time, by notice in writing to the Minister,\n\n(10)\nsurrender his licence.\n\nThe Minister shall cause a notice to be published in the Official Gazette\n(11)\nof every revocation of a licence under subsection (8) or surrender of licence under\nsubsection (9).\n\nLicensing of second marriage officer\n\n5.(1)\nThe Minister may grant to a person who is the second in command to\nthe master of a Barbados ship a licence to be a marriage officer for the purposes\nof this Act.\n\nThe making of an application for a licence under subsection (1) and the\n(2)\nway the application is dealt with shall be the same as an application for a licence\nunder sections 4(2) to (4).\n\n\f11\n\nSections  4(5)  to  (10)  apply,  with  necessary  modifications,  to  a  licence\n\n(3)\ngranted under subsection (1).\n\n(4)\nNotwithstanding  subsections  (2)  and  (3),  a  license  granted  under\nsubsection (1) may also be granted to a person who is second in command to the\nmaster of a Barbados ship for the purposes of this Act.\n\nList of marriage officers\n\n6.\nThe  Registrar  shall  maintain  affixed  in  a  conspicuous  place  in  his\noffice a list showing the names of all marriage officers licensed under this Act\nand the names of the ships on which they are serving.\n\nGeneral marriage prerequisites\n\nSubject to the requirements of this Act relating to notice of a marriage,\n7.(1)\na marriage may be contracted before a marriage officer on the high seas under\nthe authority of a Certificate for Marriage.\n\nA marriage may be contracted before a marriage officer on the high seas\n(2)\nwithout a notice of marriage or the issuance of a Certificate for Marriage under\nthe authority of a Special Licence.\n\nA  marriage  in  extremis  may  be  contracted  on  the  high  seas  before  a\n\n(3)\nmarriage officer in accordance with section 13.\n\nNotice of marriage\n\n8.(1)\nOne of the parties to an intended marriage shall give to the Registrar\nnotice of the intended marriage in the prescribed form, including the declarations\nset out in that form.\n\nThe Registrar, on receiving notice of an intended marriage, shall without\n(2)\ndelay enter the particulars contained in the notice and the date of the receipt of\nthe notice in the Maritime Marriage Notice Book, and shall\n\n(a)\n\nkeep the notice posted in a conspicuous place in his office for a period\nof not less than 14 days from the date of its receipt; and\n\n\f(b)\n\npublish the notice on the internet.\n\n12\n\n(3)\nThe  Registrar  shall  also,  within  3  days  of  the  receipt  of  the  notice  of\nintended marriage, publish a notice of the intended marriage in the prescribed\nform once in any 2 newspapers published and circulated in Barbados.\n\nAny  expenses  incurred  by  the  Registrar  in  the  publication  of  the\n(4)\nadvertisement of a notice of intended marriage shall be paid to the Registrar by\nthe person who gave the notice.\n\nIssuance of marriage certificate\n\nNot later than 3 months or earlier than 14 days after the receipt of the\n9.\nnotice  of  intended  marriage,  on  the  application  of  either  of  the  parties  to  the\nintended  marriage,  the  Registrar  shall  issue  to  the  applicant  a  Certificate  for\nMarriage in the prescribed form if\n\n(a)\n\n(b)\n\n(c)\n\nthe Registrar is satisfied that no lawful impediment has been shown\nwhy a Certificate for Marriage should not be issued;\n\nno  caveat  has  been  entered  against  the  issuance  of  a  Certificate  for\nMarriage or, if a caveat has been entered, it has been removed; and\n\nthe expenses of the advertisement have been paid as required by section\n8(4).\n\nSpecial licenses\n\n10.(1)\nNotwithstanding sections 8 and 9, the Minister may dispense with the\ngiving of notice of an intended marriage and with the issuance of a Certificate\nfor Marriage by the Registrar, and may grant a Special Licence in the prescribed\nform, authorizing the contracting of the marriage before a marriage officer.\n\nA party to the intended marriage may apply to the Minister for a Special\n(2)\nLicence by submitting an application to the Registrar together with the affidavit\nreferred to in subsection (5).\n\n\f13\n\nThe Registrar shall, if satisfied that there is sufficient information for the\n(3)\nconsideration  of  the  Minister,  forward  the  application  and  all  other  relevant\ndocuments to the Minister together with his recommendation.\n\nThe  Minister  shall  not  grant  a  Special  Licence  under  subsection  (1)\n\n(4)\nunless\n\n(a)\n\n(b)\n\n(c)\n\nit appears that the intended marriage is a proper one;\n\nthere  are  special  circumstances  justifying  the  grant  of  a  Special\nLicence; and\n\nthe application is accompanied by an affidavit referred to in subsection\n(5).\n\nA party to the intended marriage shall make an affidavit deposing to the\n\n(5)\nfollowing matters:\n\n(a)\n\nthat there is no impediment of consanguinity or affinity or any other\nlawful hindrance to the intended marriage; and\n\n(b)\n\nthat each of the parties is at least 18 years of age.\n\nLapsing of Marriage Certificate or Special License within 3 months\n\n11.\nWhere an intended marriage does not take place within 3 months after\nthe date of the issuance of any Certificate for Marriage or Special Licence relating\nto the intended marriage, the Certificate for Marriage or Special Licence is void,\nand  the  marriage  shall  not  be  contracted  before  a  marriage  officer  under  the\nauthority of that Certificate for Marriage or Special Licence.\n\nContracting of marriage before marriage officer\n\n12.(1)\nOn the delivery to a marriage officer of a Certificate for Marriage or\nof  a  Special  Licence,  the  parties  specified  in  the  Certificate  for  Marriage  or\n\n\f14\n\nSpecial Licence may contract a marriage on board a Barbados ship on the high\nseas, subject to the following conditions:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nthe marriage shall be contracted in the presence of the marriage officer\nand of 2 or more witnesses between hours specified by the master of a\nBarbados ship;\n\nthe  marriage  ceremony  shall  not  take  place  on  embarkation  day  or\nbefore dawn of the following day;\n\non  delivery  of  the  Certificate  for  Marriage  or  Special  Licence,  the\nmarriage  officer  shall  enquire  of  the  parties  whether  they  wish  to\nbecome man and wife, and if the parties answer in the affirmative he\nshall  ask  them:  “Do  you  or  either  of  you  know  of  any  lawful\nimpediment why you should not be joined together in matrimony?”;\n\nin  response  to  the  question  posed  under  paragraph  (c),  each  of  the\nparties shall declare in the presence of the witnesses: \"I do solemnly\ndeclare that I do not know of any lawful impediment why I [name of\nparty] should not be joined in matrimony to [name of other party] here\npresent.\"; and\n\neach of the parties shall then say to the other in the presence of the\nwitnesses:  \"I  call  upon  these  persons  here  present  to  witness  that  I\n[name  of  party]  do  take  you  [name  of  other  party]  to  be  my  lawful\nwedded wife [or husband].\"\n\nA marriage officer shall not permit a marriage to be contracted before him\n(2)\nif he knows or has reason to believe that there is any lawful impediment to the\nmarriage or an objection to the marriage has been recorded.\n\nAll marriages contracted in accordance with this Act on board Barbados\n(3)\nships on the high seas shall be as valid in law as if the same had been contracted\nin Barbados.\n\n\f15\n\nMarriage in extremis\n\n13.(1)\nNotwithstanding  section  8,  a  marriage  may  be  contracted  before  a\nmarriage  officer  without  giving  notice  of  the  intended  marriage,  without  the\nissuance of a Certificate for Marriage, without the grant of a special licence, or\nmore than 3 months after the date of issuance of a Certificate for Marriage or\nSpecial Licence if\n\n(a)\n\n(b)\n\nthe parties to the intended marriage are legally competent to marry and\nare at least 18 years of age;\n\nthe marriage is contracted before a marriage officer in the presence of\n2 or more witnesses; and\n\n(c)\n\neither\n\n(i)\n\n(ii)\n\nat least one of the parties to the intended marriage is, in the opinion\nof a medical practitioner, very ill or likely to die but still able to\nunderstand the material parts of the marriage contract; or\n\nif  there  is  no  medical  practitioner  present  to  offer  a  medical\nopinion  on  the  party  and  no  time  to  obtain  a  certificate  from  a\nmedical  practitioner,  the  marriage  officer  hears  from  his\nobservation and clearly hears the party declare before the marriage\nis solemnized that he or she believes that he or she will likely die\nbefore a marriage can be solemnized in accordance with sections\n8 to 12; and\n\n(d)\n\nthe marriage ceremony does not take place on embarkation day.\n\nA marriage contracted under this section shall not operate as a revocation\n\n(2)\nof any will.\n\n\f16\n\nVoid marriages\n\n14.(1)\nmarriage is void or voidable, a marriage is null and void if\n\nWithout  prejudice  to  the  effect  of  any  other  law  under  which  a\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nit is contracted before a person other than a marriage officer;\n\nthe  parties  to  the  marriage  are  within  the  prohibited  degrees  of\nconsanguinity  or  affinity  under  section  3  of  the  Marriage  Act,\nCap. 218A;\n\nat the time of the marriage, either party to the marriage is suffering\nfrom a mental disorder within the meaning of the Mental Health Act,\nCap. 45;\n\nat the time of the marriage, either party to the marriage is under the age\nof 18 years;\n\nboth parties to the marriage knowingly and wilfully acquiesce in the\ncontracting of the marriage under a false name or names;\n\nboth parties to the marriage knowingly and wilfully acquiesce in the\ncontracting  of  the  marriage  without  any  notice  being  given  of  the\nmarriage  (where  such  notice  is  required  by  this  Act)  or  without  the\nauthority of a Certificate for Marriage or Special Licence;\n\nthe marriage is contracted in extremis, and both parties to the marriage\nknowingly  and  wilfully  acquiesce  in  its  being  contracted  without\nfulfilment of the conditions specified in section 13;\n\n(h)\n\neither party is already legally married to another person; or\n\n(i)\n\nthe consent to the marriage of either person is not a legitimate consent\nbecause\n\n(i)\n\n(ii)\n\nit was obtained by duress or fraud;\n\none person was mistaken as to the identity of the other person or\nas to the nature of the ceremony performed; or\n\n\f17\n\n(iii)\n\nif either party was unclear about the nature of the ceremony being\nperformed.\n\n(2)\nSubject  to  subsection  (1),  no  marriage  after  it  has  been  contracted  is\ndeemed to be invalid by reason of a failure to comply with any of the provisions\nof this Act.\n\nRegistration of marriages\n\n15.(1)\nImmediately after a marriage has taken place before a marriage officer,\nthe marriage officer shall enter in a Maritime Marriage Log Book a statement of\nthe marriage in the prescribed form, in duplicate, signed by the marriage officer,\nby the parties to the marriage and by 2 witnesses of the marriage.\n\nA marriage officer shall, within the first 10 days in every month in which\n(2)\na marriage was solemnized, transmit all duplicate original registers made during\nthe  preceding  month  by  him  to  the  Registrar,  who  shall  register  the  same  in\naccordance with the Vital Statistics Registration Act, Cap. 192A.\n\n(3)\n\nIn the case of a marriage contracted in extremis under section 13(1)(g)\n\n(a)\n\n(b)\n\nthe requirement as to the signing of the statement and the duplicate by\nthe parties to the marriage shall be waived so far as regards any party\nunable to sign;\n\nthere  shall  be  endorsed  on  the  statement  and  on  the  duplicate  a\ncertificate in the prescribed form, signed by the marriage officer and\nby any party to the marriage able to sign and by 2 witnesses of the\nmarriage;\n\n(c)\n\nthe Registrar shall insert the words \"in extremis\" in the entry to be made\nin the Register of Maritime Marriages; and\n\n(d)\n\nthe relevant form set out in the Schedule shall be used by both parties.\n\nAny marriage officer who, without reasonable cause, fails to comply with\n(4)\nsubsection (1) is guilty of an offence and liable on summary conviction to a fine\nof $3 000.\n\n\f18\n\nSearch of Register and obtaining copies of particulars\n\nAny  person  may  at  any  reasonable  time  search  the  entries  in  the\n16.\nRegister  of  Maritime  Marriages  and  may  have  true  copies,  certified  by  the\nRegistrar, of all particulars recorded in any such entry.\n\nRegistrar may require information\n\nThe Registrar may, for the purpose of completing or rectifying the\n17.(1)\nregistration of a marriage, require any person who is required by this Act to give\na notice or statement relating to the marriage, or who may reasonably be expected\nto  have  knowledge  of  the  facts  relating  to  the  marriage,  to  make  any  written\ndeclaration  or  to  give  any  information  within  his  knowledge  relating  to  the\nmarriage.\n\nThe Registrar may require any such declaration or information to be made\n\n(2)\nor given on oath.\n\nAlterations and amendments\n\n18.(1)\nexcept as authorized by this section.\n\nNo  alteration  in  the  Register  of  Maritime  Marriages  shall  be  made\n\n(2)\nA clerical error that is discovered in the Register may be corrected by the\nRegistrar or by any person authorized by him to do so and, where a correction is\nmade, a note to that effect shall be inserted in the Register and signed by the\nRegistrar.\n\nWhere a person applies for the correction of an error of fact or substance,\n(3)\nthe Registrar, if satisfied as to the truth of the correction, and upon payment of\nthe prescribed fee, may make the correction in the manner set out in subsection\n(6).\n\n\f19\n\n(4)\nAn  application  under  subsection  (3)  shall  be  accompanied  by  a  sworn\ndeclaration in writing setting forth the nature of the error and the facts of the case,\nmade and signed by\n\n(a)\n\na person required to make a statement under this Act relating to the\nmarriage to which the application relates; or\n\n(b)\n\n2 persons having knowledge of the truth of the case.\n\nAny error of form or substance in the Register may be corrected by the\n\n(5)\nRegistrar if he is satisfied as to the truth of the correction.\n\nA correction of fact or substance shall be made by an entry in the Register\n(6)\nwithout  any  alteration  in  the  original  entry,  and  a  note  to  that  effect  shall  be\ninserted in the Register and signed by the Registrar.\n\nPART III\n\nMARRIAGE OF BARBADIAN CITIZENS ON FOREIGN SHIPS\n\nDefinitions\n\n19.\n\nFor the purposes of this Part,\n\n“diplomatic  or  consular  officer”  means  an  ambassador,  envoy,  minister,  high\ncommissioner,  charged’  affairs  or  other  diplomatic  representative,  or  a\ncounsellor or secretary of an embassy, legation or high commission;\n\n“foreign ship” means a ship registered in a country other than Barbados;\n\n“marriage officer” means\n\n(a)\n\n(b)\n\n(c)\n\nthe master of a foreign ship who is licensed as a marriage officer;\n\nthe second in command of a foreign ship who is licensed as a second\nor marriage officer; or\n\na  diplomatic  or  consular  officer  appointed  by  the  Government  of\nBarbados to be a marriage officer for a foreign country;\n\n\f20\n\n(d)\n\na  captain  who  is  an  appointed  Justice  of  the  Peace  or  a  minister  of\nreligion, or otherwise authorized by statute to perform marriages at sea,\nand has documentation to that effect; or\n\n(e)\n\nofficially recognized officiant, including a notary public;\n\n“official house” in relation to a marriage officer, means the prescribed place on\n\na ship where the marriage officer may conduct a marriage.\n\nSolemnization of marriages on foreign ships\n\nA  maritime  marriage  between  parties  one  of  whom  is  a  citizen  of\n20.\nBarbados  may  be  solemnized  before  a  marriage  officer  on  a  foreign  ship\nirrespective of where that ship may be, if at the time of the marriage\n\n(a)\n\nneither  party  to  the  intended  marriage  is  legally  married  to  another\nperson;\n\n(b)\n\nboth parties are of sound mind;\n\n(c)\n\nboth parties are at least 18 years of age; and\n\n(d)\n\nthe parties are not within the degrees of prohibited relationship.\n\nCompliance with laws of the foreign country\n\n21.(1)\nforeign country.\n\nA marriage referred to in section 20 shall comply with the laws of the\n\nThe marriage officer of a foreign ship may, for reasons to be recorded in\n\n(2)\nwriting, refuse to solemnize a marriage under this Act if\n\n(a)\n\n(b)\n\nthe intended marriage is prohibited by a law in force in the foreign\ncountry where it is to be solemnized; or\n\nin his opinion, the solemnization of the marriage would be inconsistent\nwith international law or the comity of nations.\n\n\f21\n\nDeclaration by parties and witnesses\n\nBefore a marriage is solemnized under section 20, the parties and 2\n22.\nwitnesses shall, in the presence of the marriage officer, sign a declaration in the\nprescribed form specified and countersigned by the marriage officer.\n\nPlace and form of solemnization\n\nA  marriage  before  a  marriage  officer  under  section  20  shall  be\n23.(1)\nsolemnized  at  the  official  house  of  the  marriage  officer  between  the  hours\nprescribed by the ship master and in the presence of at least 2 witnesses.\n\nA marriage may be solemnized in any form that the parties may choose to\n(2)\nadopt, provided that it shall not be complete and binding on the parties unless\neach party declares to the other in the presence of the Marriage Officer and the\n2 witnesses, and in a language understood by the parties, that “I, (name of party)\ntake (name of other party), to be my lawful wife (or husband)”.\n\nWhere the declaration referred to in subsection (2) is made in any language\n(3)\nthat is not understood by the marriage officer or by any of the witnesses, either\nof the parties or another person shall interpret the declaration in a language that\nthe marriage officer or witness understands.\n\nCertificate of marriage\n\n24.(1)\nWhenever  a  marriage  is  solemnized  under  this  Act,  the  marriage\nofficer shall enter a certificate of the marriage, in the prescribed form and signed\nby the parties to the marriage and the 2 witnesses, in a Marriage Certificate Book\nto be kept by him for that purpose.\n\nA  certificate  entered  in  the  Marriage  Certificate  Book  by  the  marriage\n(2)\nofficer is deemed to be conclusive evidence of the fact that a marriage under this\nAct has been solemnized, and that all formalities respecting the residence of the\nparties  to  the  marriage  and  the  signatures  of  witnesses  have  been  complied\nwith.\n\n\f22\n\nValidity of foreign marriages in Barbados\n\n25.\n\nA marriage solemnized under section 20 is good and valid in law.\n\nNew notice when marriage not solemnized within 3 months\n\n26.\n\nIf a marriage under section 20 is not solemnized within 3 months after\n\n(a)\n\n(b)\n\n(c)\n\nthe date on which notice of it has been given to the marriage officer as\nrequired under section 27;\n\nwhere the record of a case has been transmitted to the Government of\nBarbados under section 38(2), the date of decision of the Government\nof Barbados in the case; or\n\nwhere an appeal has been preferred to the Government of Barbados\nunder section 39, the date of decision of the Government of Barbados\nin the appeal,\n\nthe notice and all other proceedings arising from it is deemed to have lapsed, and\nno marriage officer shall solemnize the marriage until a new notice has been given\nin accordance with section 27.\n\nNotice of intended marriage\n\n27.\nWhen  a  marriage  is  intended  to  be  solemnized  under  this  Act,  the\nparties to the marriage shall give notice of it in writing, in the prescribed form,\nto the marriage officer of a ship registered in the place in which at least one of\nthe parties to the marriage has resided and on which the marriage is intended to\ntake place for a period of not less than 30 days immediately preceding the date\non which the notice is given, and the notice shall state that the party has so resided.\n\nMarriage Notice Book\n\n28.(1)\nThe marriage officer shall keep all notices given under section 27 with\nthe records of his office, and without delay enter a copy of every such notice in\na Marriage Notice Book prescribed for that purpose.\n\n\f23\n\nA Marriage Notice Book shall be open for inspection by any person at all\n\n(2)\nreasonable times, without fee.\n\nPublication of notice\n\n29.\npublish it\n\n(a)\n\n(b)\n\nWhere a notice under section 27 is given to a marriage officer, he shall\n\nin his own office, by affixing a copy of it in a conspicuous place and\non the internet; and\n\nin Barbados and in the country or countries in which the parties are\nordinarily resident, in the prescribed manner.\n\nObjection to marriage\n\nAny  person  may,  within  30  days  from  the  date  of  publication  of  a\n30.(1)\nnotice  under  section  29,  object  to  the  marriage  on  the  ground  that  it  would\ncontravene one or more of the conditions specified in section 20.\n\nAn objection under subsection (1) shall be in writing and signed by the\n(2)\nperson making it, or by any person duly authorized to sign on his behalf, and shall\nstate the ground for the objection.\n\nThe Marriage Officer shall record the nature of any such objection in his\n\n(3)\nMarriage Notice Book.\n\nSolemnization of marriage where no objection made\n\nIf  no  objection  to  an  intended  marriage  is  made  within  the  period\n31.\nspecified in section 30, the marriage may be solemnized on the expiry of that\nperiod.\n\nProcedure on receipt of objection\n\n32.(1)\nIf an objection to an intended marriage is made under section 30, the\nmarriage officer shall not solemnize the marriage until he has inquired into the\n\n\f24\n\nmatter of the objection and is satisfied that it should not prevent the solemnization\nof the marriage or until the objection is withdrawn by the person making it.\n\nWhere a marriage officer, after making an inquiry, entertains a doubt in\n(2)\nrespect  of  an  objection,  he  shall  transmit  the  record,  together  with  any  such\nstatement respecting the matter as he thinks fit, to the Minister responsible for\nMarital Affairs.\n\nThe Minister, after making such further inquiry into the matter, shall give\n(3)\nhis decision on it in writing to the marriage officer, who shall act in conformity\nwith that decision.\n\nPART IV\n\nREGISTRATION OF FOREIGN MARRIAGES\n\nRegistration of foreign marriages\n\nA marriage officer may, upon payment of the prescribed fee, register\n33.(1)\na  marriage  between  parties  one  of  whom  is  a  citizen  of  Barbados  that  was\nsolemnized on a ship in a foreign country if\n\n(a)\n\n(b)\n\nthe marriage officer is satisfied that the marriage was duly solemnized\nin accordance with the law of that country; and\n\na party to the marriage informs the marriage officer in writing that he\nor she desires the marriage to be registered under this section.\n\nNo marriage shall be registered under this section unless at the time of\n\n(2)\nregistration it satisfies the conditions referred to in section 20.\n\nA marriage officer may, for reasons recorded in writing, refuse to register\n(3)\na marriage under this section on the ground that in his opinion the marriage is\ninconsistent with international law or the comity of nations.\n\n\f25\n\n(4)\nWhere a marriage officer refuses to register a marriage under this section,\nthe party applying for registration may appeal to the Minister in the prescribed\nmanner within a period of 30 days from the date of the refusal.\n\nOn receipt of the decision of the Barbados Government on such an appeal,\n\n(5)\nthe marriage officer shall act in conformity with the decision.\n\nA marriage officer shall register a marriage under this section by entering\n(6)\na  certificate  of  the  marriage  signed  by  the  parties  to  the  marriage  and  by  2\nwitnesses, in the prescribed form and in the prescribed manner in the Marriage\nCertificate Book.\n\nA marriage registered under this section shall, as of the date of registration,\n\n(7)\nbe deemed to have been solemnized under this Act.\n\nRecognition of foreign maritime marriages\n\nIf  the  Barbados  Government  is  satisfied  that  the  law  for  the\n34.\nsolemnization  of  marriages  in  force  in  a  foreign  country  in  whose  waters  a\nmarriage occurred on board a ship contains provisions similar to, or compatible\nwith those contained in the Act, it may, by notification in the Official Gazette,\ndeclare that marriage solemnized under the law in force in that foreign country\nshall be recognized by courts in Barbados as valid.\n\nCertification of documents of foreign maritime marriages\n\n35.(1)\n\nWhere\n\n(a)\n\na marriage between parties of whom at least one is a citizen of Barbados\nis solemnized in accordance with the law of a foreign country on a ship\nin that country specified by the Minister by notification in the Official\nGazette; and\n\n\f26\n\n(b)\n\na party to the marriage who is such a citizen produces to a marriage\nofficer in the country in which the marriage was solemnized\n\n(i)\n\na  copy  of  the  entry  in  respect  of  the  marriage  in  the  marriage\nregister of that country certified by the appropriate authority in\nthat country to be a true copy of that entry; and\n\n(ii)\n\nif the copy of that entry is not in the English language, a notarized\ntranslation into English of that copy; and\n\n(c)\n\nthe marriage officer is satisfied that the copy of the entry in the marriage\nregister is a true copy and that any translation is a true translation,\n\nthe marriage officer, upon the payment of the prescribed fee, shall certify upon\nthe copy that he is satisfied that it is a true copy of the entry in the marriage\nregister and upon the translation that he is satisfied that the translation is a true\ntranslation of the copy and shall issue the copy and the translation to that party.\n\nA  document  relating  to  a  marriage  in  a  foreign  country  issued  under\n(2)\nsubsection (1) shall be admitted in evidence in any proceedings as if it were a\ncertificate duly issued by the appropriate authority of that country.\n\nCertified copies to be evidence\n\n36.\nA certified copy purporting to be signed by a marriage officer of an\nentry of a marriage in the Marriage Certificate Book shall be received in evidence\nwithout production or proof of the original.\n\nCorrection of errors\n\n37.(1)\nA marriage officer who discovers an error in the form or substance of\nan  entry  in  the  Marriage  Certificate  Book  may,  within  one  month  after  the\ndiscovery of the error, in the presence of the persons married or, in case of their\ndeath or absence, in the presence of 2 other witnesses, correct the error by an\nentry in the margin, without any alteration of the original entry, and add to it the\ndate of the correction.\n\n\f27\n\nEvery  correction  made  under  this  section  shall  be  attested  to  by  the\n\n(2)\nwitnesses in whose presence it was made.\n\nAct not to affect validity of marriages outside it\n\n38.\nsolemnized in a foreign country otherwise than under this Act.\n\nNothing in this Act shall in any way affect the validity of a marriage\n\nMarriages on board foreign ships in Barbados waters\n\n39.(1)\nThe provisions applicable to marriages of Barbados citizens on board\nships in the waters of a foreign country apply to marriages on board foreign ships\nin  Barbados  waters,  irrespective  of  nationality  of  the  parties  to  the  marriage,\nexcept where expressly provided otherwise in regulations made under this Act.\n\nWhere the master or his second in command is not licensed to officiate\n(2)\nmarriages  in  accordance  with  this  Act,  an  intended  couple  wishing  to  have  a\nmarriage  ceremony  on  board  ship  shall  leave  the  ship,  have  their  marriage\nformalized in a magistrate court in Barbados or by a duly appointed marriage\nofficer, and then rejoin the ship for the ceremony.\n\nA marriage ceremony in a Barbados seaport shall take place in accordance\n(3)\nwith any specific requirements of the port, as specified in a Marine Notice issued\nby the port authority.\n\nMarriage not to contravene the laws of Barbados\n\n40.(1)\nwith the laws of Barbados.\n\nA marriage referred to in section 39 shall be conducted in accordance\n\nThe marriage officer of a foreign ship may, for reasons to be recorded in\n\n(2)\nwriting, refuse to solemnize a marriage under this Act if\n\n(a)\n\n(b)\n\nthe intended marriage is prohibited by any law in force in Barbados;\n\nin his opinion, the solemnization of the marriage would be inconsistent\nwith international law or the comity of nations.\n\n\f28\n\nPART V\n\nOFFENCES\n\nOffences\n\n41.(1)\n\nA person commits an offence if the person\n\n(a)\n\n(b)\n\nknowingly  and  wilfully  authorizes  or  conducts  the  contracting  of  a\nmarriage on a ship and is not a licensed marriage officer or otherwise\nauthorized in law to perform a marriage; or\n\nauthorizes or conducts the contracting of a marriage, knowing that the\nmarriage  is  void  on  any  ground  or  knowing  that  it  is  an  irregular\nmarriage.\n\nA person who is a party to a marriage commits an offence if the person\n(2)\nknows that the marriage is void on any ground and that the other party to the\nmarriage believes it to be valid.\n\n(3)\n\nA person commits an offence if the person\n\n(a)\n\n(b)\n\nimpersonates another person in marriage or marries under a false name\nor description, with intent to deceive the other party to the marriage;\n\nin  any  declaration,  notice,  statement,  certificate,  entry,  licence  or\ndocument  required  by  this  Act  to  be  made,  given  or  issued  for  the\npurposes of a marriage, declares, states or certifies any material matter\nthat he knows to be false; or\n\n(c)\n\naids in the commission of any offence under this section.\n\nA person who commits an offence under any of subsections (1) to (3) is\n\n(4)\nliable on conviction on indictment to imprisonment for 4 years.\n\n(5)\n\nWithout prejudice to the effect of subsections (2) or (3)(a), a person\n\n(a)\n\nwho is a party to a marriage knowing that it is void on any ground or\nknowing that it is an irregular marriage;\n\n\f29\n\n(b)\n\nwho marries under a false name or description; or\n\n(c)\n\nwho aids another person to do so,\n\nis guilty of an offence and liable on conviction on indictment to imprisonment\nfor 2 years or to a fine of $20 000, or to both.\n\nWithout prejudice to subsection (3)(b), any person who in any declaration,\n(6)\nnotice, statement, certificate, entry, licence or document required by this Act to\nbe  made,  given  or  issued  for  the  purposes  of  a  marriage,  declares,  states  or\ncertifies a material matter that is false without having reasonable grounds for\nbelieving it to be true is guilty of an offence and liable on conviction on indictment\nto imprisonment for one year or a fine of $10 000, or to both.\n\n(7)\n\nAny person who attempts to prevent a marriage by a pretence that\n\n(a)\n\n(b)\n\n(c)\n\nhis assent to it is required by law;\n\na person whose consent is so required does not consent; or\n\nthere is a legal impediment to the marriage,\n\nif he does so knowing that the pretence is false or has no reason to believe that it\nis  true,  is  guilty  of  an  offence  and  liable  on  conviction  on  indictment  to\nimprisonment for 2 years or a fine of $20 000, or to both.\n\n(8)\n\nFor the purpose of this section,\n\n“irregular marriage” means a marriage, other than a void marriage or a marriage\n\nin extremis, that is contracted\n\n(a)\n\nwithout  any  notice  required  by  this  Act  having  been  given  of  the\nmarriage;\n\n(b)\n\nwithout the authority of a Certificate for Marriage or a Special Licence;\n\n(c)\n\n(d)\n\nafter  the  expiration  of  3  months  from  the  date  of  the  issuance  of  a\nCertificate for Marriage or the grant of a Special Licence;\n\nbefore  the  removal  of  a  caveat  entered  against  the  issuance  of  a\nCertificate for Marriage; or\n\n\f30\n\n(e)\n\nwithout consent to the marriage of either party to the marriage.\n\nA prosecution under this section shall not be instituted without the written\n\n(9)\nconsent of the Director of Public Prosecutions.\n\nPART VI\n\nMISCELLANEOUS\n\nRegister as evidence of marriage\n\n42.\nEvery entry in the Register of Maritime Marriages, and every copy of\nany such entry purporting to be certified as a true copy by the Registrar, shall be\nreceived in all courts and in all proceedings as evidence of the marriage to which\nthe entry relates.\n\nUse of foreign language\n\nWhere a party to a marriage does not speak English, the statements\n43.\nand declarations required by this Act to be used in contracting the marriage shall,\nso far as they affect or are to be used by him or her, be made in the language that\nhe or she commonly uses.\n\nOaths\n\n44.\n\nFor the purposes of this Act,\n\n(a)\n\n(b)\n\n(c)\n\nthe Registrar is authorized to administer any oath;\n\na declaration may be sworn in Barbados before, and subscribed by, a\nJustice  of  the  Peace,  a  Commissioner  for  taking  affidavits  in  the\nSupreme  Court;  or  any  person  authorized  to  administer  oaths  in\nBarbados;\n\nwhere a declaration is sworn or an oath is made outside Barbados, it\nmay be sworn before, and subscribed by, a magistrate, notary public\nor other person or authority authorized to administer oaths.\n\n\f31\n\nElectronic recording of information\n\nThe information contained in any register, book or other document\n45.\nrequired to be kept by the Registrar may be recorded and kept in electronic form\nor  such  other  form  as  he  thinks  fit,  so  long  as  it  is  possible  to  inspect  the\ninformation and to produce a copy of it in legible form.\n\nFees\n\n46.(1)\nThere shall be payable to the Registrar such fees as may be prescribed\nby the Minister in relation to the performance by the Registrar of any function\nunder this Act or any matter incidental to the performance of any such function.\n\nThere shall be payable to the Minister such fees as may be prescribed by\n(2)\nhim in relation to the performance by him of any function under this Act or any\nmatter incidental to the performance of any such function.\n\nLicensing of foreign ship captains as marriage officers\n\n47.(1)\nthe Ministry of Home Affairs for a license issued pursuant to sections 4 or 5.\n\nA captain or the second in command of a foreign ship may apply to\n\nThe  license  may  be  used  to  conduct  marriages  aboard  the  foreign  ship\n\n(2)\nanywhere in Barbados waters.\n\nVarying, suspension or revocation of license\n\n48.\nto this Act.\n\nThe Minister may vary, suspend or revoke any license issued pursuant\n\nLicense terms and conditions\n\n49.\nand conditions as may be specified by the Minister.\n\nA license issued under this Act may be accompanied by such terms\n\n\f32\n\nMarriage ceremonies on yachts\n\n50.\napply mutatis mutandis to marriages on board yachts.\n\nThe  provisions  in  this  Act  applicable  to  marriages  on  board  ships,\n\nMarriage ceremonies on vessels registered under the Shipping\n(Domestic Vessels) Act\n\nExcept where expressly provided otherwise by statutory instrument,\n51.\nthe provisions in this Act apply mutatis mutandis to marriages on board vessels\nregistered under the Shipping (Domestic Vessels) Act, 2024 (Act 2024-22).\n\nApplication of Act to marriages involving seafarers\n\nExcept where expressly provided otherwise by statutory instrument,\n52.\nthe provisions in this Act apply to marriages in which one or both of the parties\nare seafarers on board a Barbados ship or seafarers on board a foreign ship in\nBarbados waters.\n\nRules\n\n53.\nof this Act.\n\nThe Minister may make rules for carrying into effect the provisions\n\nPower to make regulations\n\n54.\n\nThe Minister may make regulations generally to give effect to this Act.\n\n\f33\n\nL.R.O. 1998SCHEDULE(Section 15(3)(d))Merchant Shipping (Maritime Marriage) Act, 2024(Act 2024-        )FORM SPart ACertiﬁ cate for the Solemnization of a Marriage in extremisI, Registered Medical Practitioner havingbeen in attendance on  of  in the parish of hereby certify that the said is very ill and likely to die.Dated this day of  , 20 .Registered Medical Practitioner\f34\n\n L.R.O. 1998Merchant Shipping (Maritime Marriage) Act, 2024(Act 2024-        )Part BCertiﬁ cate for the Solemnization of a Marriage in extremis I,    , Marriage Oﬃ  cer/Magistrate being of theopinion that it is impossible to obtain a medical certiﬁ cate from the medical practitioner whohas been in attendance on,   */ there having been no medical practitionerin attendance on,    * from my own observation being of the opinion that  of   in the parish ofis very ill and likely to die, and he/she having declared that he/she believes that he/she is at thepoint of death do solemnize a marriage between the saidand  of   in the parish of .Marriage Oﬃ  cer/Magistrate for District (     )Schedule - (Concl'd)*Delete where inappropriate.\f35\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}