{
  "bill_id": 807,
  "slug": "resolution-to-approve-national-policy-on-improving-the-lives-of-people-with-disabilities",
  "title": "Resolution to approve National Policy on Improving the Lives of People with Disabilities",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/794f345c452ef9a91754c1a925273be1.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-11-06",
  "first_reading": "2024-10-29",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\nPARLIAMENT\n\nWHEREAS the Government of Barbados has signalled its intention to improve the\nlives of Persons with Disabilities and to protect their rights and freedoms through\nthe creation of a comprehensive and inclusive national policy;\n\nAND WHEREAS the policy was significantly informed by the 2023 Report of the\nNational  Advisory  Committee  to  Guide  the  Establishment  of  a  Commission  for\nImproving the Lives of Persons with Disabilities;\n\nAND WHEREAS the Commission was established under the chairmanship of Mr.\nEdmund Hinkson, S.C., M.P. to highlight problems faced by the disabled community\nwith a view to developing practical solutions to improve the lives of persons with\ndisabilities;\n\nAND  WHEREAS  the  report  presented  a  detailed  synopsis  of  the  issues  and\nchallenges  faced  by  persons  with  disabilities  and  a  comprehensive  set  of\nrecommendations  for  the  improvement  in  their  lives  which  are  reflected  in  the\npolicy;\n\nAND  WHEREAS  the  policy  aims  to  foster  greater  inclusion  of  Persons  with\nDisabilities in all areas of national life and to eliminate the stigma and discrimination\nthat they face on a daily basis;\n\nAND  WHEREAS  the  policy  recognises  the  significant  role  that  Persons  with\nDisabilities can play in national development if they are given more opportunities to\ncontribute in various ways according to the nature of their disability;\n\n1\n\n\fAND  WHEREAS  the  Government  has  engaged  in  extensive  consultations  with\nstakeholders within the social policy space on the National Policy for Improving the\nLives  of  Persons  with  Disabilities  and  the  2023  Report of the  National  Advisory\nCommittee to Guide the Establishment of a Commission for Improving the Lives of\nPersons with Disabilities;\n\nAND WHEREAS the Cabinet at its meeting held September 21, 2023 approved the\nNational Policy for Improving the Lives of Persons with Disabilities and noted the\n2023 Report of the National Advisory Committee to Guide the Establishment of a\nCommission for Improving the Lives of Persons with Disabilities at its meeting held\non April 19, 2024.\n\nAND  WHEREAS  the  National  Policy  for  Improving  the  Lives  of  Persons  with\nDisabilities and the 2023 Report of the National Advisory Committee to Guide the\nEstablishment of a Commission for Improving the Lives of Persons with Disabilities\nhave been laid in Parliament to foster debate on these documents;\n\nAND  WHEREAS  the  National  Policy  recognizes  the  following  thematic  areas\nwhich are fundamental to advancing the full rights and freedoms of Persons with\nDisabilities:\n\nEducation, training and lifelong learning;\nEmployment, work and economic participation;\n\n(i)  Accessibility;\n(ii)  Adequate standard of living and social protection;\n(iii)  Awareness building;\n(iv)\n(v)\n(vi)  Health, habitation and rehabilitation;\n(vii)\n(viii)\n(ix)\n(x)\n(xi)  Regional and international cooperation;\n(xii)  Respect for privacy, home and family life;\n(xiii)\n(xiv)  Women and children with disabilities.\n\nLegal recognition and access to justice;\nParticipation in society;\nProtection in disasters and emergencies;\nProtection of right to life, integrity, freedoms and liberties;\n\nStatistics and data collection on disabilities; and\n\n2\n\n\fBE  IT  RESOLVED  therefore  that  Parliament  approve  the  National  Policy  for\nImproving the Lives of Persons with Disabilities and the 2023 National Report of\nthe National Advisory Committee to Guide the Establishment of a Commission for\nImproving the Lives of Persons with Disabilities.\n\nAPPROVED by the House of Assembly this           day of\n\n, 2024.\n\nSpeaker\n\nAPPROVED by the Senate this                 day of\n\n, 2024.\n\nPresident\n\n3\n\n\fADDENDUM\n\nThe  Cabinet  at  its  meeting  held  September  21,  2023  considered  NOTE  (23)\n869/MPEA17  approving  the  National  Policy  for  Improving  the  Lives  of  Persons\nwith Disabilities and at its meeting held on April 11, 2024 noted the 2023 Report of\nthe National Advisory Committee to Guide the Establishment of a Commission for\nImproving the Lives of Persons with Disabilities.\n\nThe  approval  of  Parliament  is  now  sought  in  relation  to  the  National  Policy  for\nImproving the Lives of Persons with Disabilities and the 2023 Report of the National\nAdvisory Committee to Guide the Establishment of a Commission for Improving\nthe Lives of Persons with Disabilities.\n\n4\n\n"
}