{
  "bill_id": 808,
  "slug": "business-barbados-bill-2024",
  "title": "Business Barbados Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/307e5abe58166f4e809d378b90f0f84a.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-10-31",
  "first_reading": "2024-11-08",
  "gazette_date": "2024-10-28",
  "markdown": "2024-10-10\n\nOBJECTS AND REASONS\n\nThis Bill would\n\n(a)\n\nmake provision for the establishment of a body corporate to be known\nas Business Barbados by coordinating and carrying out functions in\nrelation to specified corporate and intellectual property enactments in\norder to provide efficient, effective and timely service to users; and\n\n(b)\n\nrepeal  the  Corporate  Affairs  and  Intellectual  Property  Office  Act,\nCap. 21A,\n\nand provide for related matters.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\nShort title\n\nInterpretation\n\nAct to bind State\n\nConstruction of specified enactments\n\nPART II\n\nESTABLISHMENT, FUNCTIONS AND ADMINISTRATION OF BUSINESS\nBARBADOS\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nEstablishment of Business Barbados\n\nFunctions of Business Barbados\n\nEstablishment of Board\n\nFunctions of Board\n\nBoard may delegate functions\n\n10.\n\nStaff of Business Barbados and establishment of divisions\n\n11.\n\nChief Executive Officer\n\n\f3\n\n12.\n\nFunctions of Chief Executive Officer\n\n13.\n\nFunctions of Registrar\n\n14.\n\nFunctions of the Director of IP\n\n15.\n\nTransfer and secondment of employees\n\n16.\n\nLimitation on powers of Board concerning staff, etc.\n\n17.\n\nPrivate pension plan\n\n18.\n\nAppointment of experts\n\n19.\n\nAdvisory Committee on Intellectual Property\n\n20.\n\nFunctions of the Committee\n\nPART III\n\nFINANCIAL PROVISIONS\n\n21.\n\nEstablishment of Fund\n\n22.\n\nBorrowing power\n\n23.\n\nGuarantee of loans\n\n24.\n\nExemption from taxes\n\n25.\n\nAccounts\n\n26.\n\nAudit\n\n27.\n\nPublic Finance Management Act to apply\n\n\f28.\n\nReports\n\n4\n\nPART IV\n\nMISCELLANEOUS\n\n29.\n\nRemuneration of directors\n\n30.\n\nDirectors to declare interest\n\n31.\n\nCertain information not to be disclosed to Board\n\n32.\n\nProtection from personal liability\n\n33.\n\nNotaries public\n\n34.\n\nCorporate business plan\n\n35.\n\nMinisterial directions\n\n36.\n\nAmendment of Schedules\n\n37.\n\nRegulations\n\n38.\n\nTransitional provisions relating to the State\n\n39.\n\nTransitional provisions relating to civil proceedings\n\n40.\n\nAppeals to Minister or tribunal\n\n41.\n\nConsequential amendments\n\n42.\n\nRepeal of Cap. 21A\n\n43.\n\nCommencement\n\n\f5\n\nFIRST SCHEDULE\n\nSpecified enactments relating to Corporate Affairs\n\nSECOND SCHEDULE\n\nSpecified enactments relating to Intellectual Property\n\nTHIRD SCHEDULE\n\nConstitution of Business Barbados Board\n\nFOURTH SCHEDULE\n\nConstitution of Advisory Committee on Intellectual Property\n\nFIFTH SCHEDULE\n\nConsequential Amendments\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to establish a body corporate to be known as Business Barbados by\ncoordinating and carrying out functions in relation to specified corporate and\nintellectual property enactments and to provide for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f8\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Business Barbados Act, 2024.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Business Barbados” means the body established by section 5;\n\n“Board” means the Business Barbados Board established by section 7;\n\n“Chief Executive Officer” means the Chief Executive Officer appointed pursuant\n\nto section 11;\n\n“Committee”  means  the  Advisory  Committee  on  Intellectual  Property\n\nestablished by section 19;\n\n“Director of IP” means the Director of Business Barbados Intellectual Property;\n\n“Fund” means the Business Barbados Fund established by section 21;\n\n“Minister” means Minister responsible for Business;\n\n“Registrar” means Registrar of Companies;\n\n“specified  enactments”  means\n\nthe  Acts  specified\n\nin\n\nthe  First  and\n\nSecond Schedules and any statutory instruments made thereunder.\n\nAct to bind State\n\n3.\n\nThis Act binds the State.\n\n\f9\n\nConstruction of specified enactments\n\nThe specified enactments shall be construed with such modifications,\n4.\nadaptations, qualifications and exceptions as may be necessary to bring them into\nconformity with this Act.\n\nPART II\n\nESTABLISHMENT, FUNCTIONS AND\nADMINISTRATION OF BUSINESS BARBADOS\n\nEstablishment of Business Barbados\n\n5.(1)\n\nThere is established a body to be known as “Business Barbados”.\n\nBusiness  Barbados  is  a  body  corporate  to  which  section  21  of  the\n\n(2)\nInterpretation Act, Cap. 1 applies.\n\nFunctions of Business Barbados\n\n6.(1)\n\nThe functions of Business Barbados are to\n\n(a)\n\n(b)\n\nadminister this Act;\n\nadvise the Government and other public authorities on matters relating\nto this Act; and\n\n(c)\n\ndo such other things as are necessary to give effect to this Act.\n\nBusiness Barbados shall do all things necessary or convenient to be done\n\n(2)\nin connection with the performance of its functions.\n\nBusiness  Barbados  shall,  in  the  exercise  of  its  functions  pursuant  to\n(3)\nsubsection  (1),  administer  and  carry  out  functions  relating  to  the  specified\nenactments with such modifications, adaptations, qualifications and exceptions\nas may be necessary to bring them into conformity with this Act.\n\n\f10\n\nEstablishment of Board\n\n7.(1)\nThere is established a board, to be known as the “Business Barbados\nBoard”,  which  shall  be  responsible  for  the  policy,  organization  and\nadministration of Business Barbados.\n\nThe Third Schedule has effect with respect to the constitution of the Board\n\n(2)\nand otherwise in relation thereto.\n\nFunctions of Board\n\n8.(1)\n\nThe functions of the Board are\n\n(a)\n\nthe appointment of staff to Business Barbados and the management\nthereof;\n\n(b)\n\nthe management of the resources and contracts of Business Barbados;\n\n(c)\n\n(d)\n\nthe development of policies for the prudent and efficient management\nof Business Barbados; and\n\nthe monitoring of the performance of Business Barbados in respect of\nthe discharge of its functions.\n\n(2)\n\nFor the purpose of subsection (1) the Board shall\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nprovide strategic direction and policy guidance to Business Barbados;\n\nensure  compliance  with  relevant  laws,  enactments,  and  government\npolicies;\n\noversee the budget and financial affairs of Business Barbados;\n\nparticipate  in  the  development  and  review  of  Business  Barbados’\nstrategic plans, policies and programmes;\n\nadvise on the alignment of Business Barbados’ initiatives with national\ndevelopment goals;\n\n\f11\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nfoster collaboration with relevant government agencies, private sector\norganizations, research institutions and other stakeholders;\n\npromote public-private partnerships to drive innovation and industry\ngrowth;\n\nmonitor  the  performance  of  Business  Barbados  against  strategic\nobjectives and key performance indicators;\n\nreview  and  assess  the  annual  reports  and  financial  statements  of\nBusiness Barbados;\n\nidentify  and  address  potential  risks  and  challenges  related  to  the\nactivities of Business Barbados; and\n\n(k)\n\nensure the implementation of effective risk management strategies.\n\nBoard may delegate functions\n\nThe Board may delegate such of its functions as it thinks expedient\n9.(1)\nfor  the  purpose  of  effectively  transacting  the  business  of  the  Board  to  the\nChairman, a committee of the Board or the Chief Executive Officer of Business\nBarbados.\n\n(2)\n\nThe delegation of a function under subsection (1)\n\n(a)\n\n(b)\n\ndoes not prevent the Board from discharging that function; and\n\nthe Board may at any time revoke the delegation.\n\nStaff of Business Barbados and establishment of divisions\n\n10.(1)\n\nThe staff of Business Barbados shall comprise:\n\n(a)\n\n(b)\n\n(c)\n\na Chief Executive Officer;\n\nthe Registrar;\n\nthe Director of IP;\n\n(d)\n\na Senior Legal Counsel;\n\n\f(e)\n\na Legal Counsel;\n\n12\n\n(f)\n\n(g)\n\na Legal Administrator; and\n\nsuch other staff as Business Barbados considers necessary for giving\neffect to this Act.\n\nFor the purposes of this Act, Business Barbados may separate its operations\n\n(2)\ninto divisions.\n\nChief Executive Officer\n\n11.(1)\nExecutive Officer of Business Barbados.\n\nThe Board shall, with the approval of the Minister, appoint a Chief\n\n(2)\n\nThe Chief Executive Officer\n\n(a)\n\n(b)\n\nshall hold office for a term not exceeding 4 years but is eligible for\nreappointment;\n\nis  entitled  to  such  remuneration  and  allowances  as  the  Board\ndetermines; and\n\n(c)\n\nshall not be removed from office without the approval of the Minister.\n\nFunctions of Chief Executive Officer\n\n12.(1)\n\nThe functions of the Chief Executive Officer are to\n\n(a)\n\n(b)\n\n(c)\n\ndischarge the functions of Business Barbados;\n\nexecute the policy and manage the affairs of Business Barbados;\n\ninform  the  Minister  of  any  matter  that  may  affect  public  policy  or\nmaterially affect the affairs of Business Barbados;\n\n(d)\n\nperform such other functions as the Board determines;\n\n(e)\n\nlead strategy, build talent and teams and regularly engage stakeholders;\nand\n\n(f)\n\ndevelop policy and business facilitation products.\n\n\f13\n\nThe  Chief  Executive  Officer  is,  in  the  exercise  of  the  Chief  Executive\n\n(2)\nOfficer’s functions, subject to the directions of the Board.\n\n(3)\nNotwithstanding subsection (2), the Board shall not give directions to the\nChief Executive Officer, Registrar, Director of IP or any other person with respect\nto the administration of any of the specified enactments and, in particular, in the\nexercise  of  a  function  conferred  or  delegated  under  any  of  the  specified\nenactments.\n\nFunctions of Registrar\n\n13.(1)\n\nThe Registrar is responsible for\n\n(a)\n\n(b)\n\n(c)\n\nadministering and ensuring compliance with this Act and the specified\nenactments set out in the First Schedule;\n\nadvising the Chief Executive Officer and the Board on legal matters\nrelating to the specified enactments referred to in paragraph (a);\n\ninstituting  legal  proceedings  in  matters  relating  to  breaches  of  the\nspecified  enactments  referred  to  in  paragraph  (a)  after  consultation\nwith the Board; and\n\n(d)\n\ndoing any other act or thing required to be done by the Chief Executive\nOfficer.\n\nNotwithstanding  anything  to  the  contrary  in  this  Act,  but  subject  to\n(2)\nsubsection (1)(b) and (c) and any provision of a specified enactment in the First\nSchedule, the Registrar shall not be answerable to the Chief Executive Officer,\nthe Board or the Minister in the exercise of the duties, obligations, powers or\nrights conferred on the Registrar by any of the specified enactments.\n\nFunctions of the Director of IP\n\n14.(1)\n\nThe Director of IP is responsible for:\n\n(a)\n\nadministering and ensuring compliance with this Act and the specified\nenactments set out in the Second Schedule;\n\n\f14\n\n(b)\n\n(c)\n\nadvising the Chief Executive Officer and the Board on legal matters\nrelating to the specified enactments referred to in paragraph (a);\n\ninstituting  legal  proceedings  in  matters  relating  to  breaches  of  the\nspecified  enactments  referred  to  in  paragraph  (a)  after  consultation\nwith the Board; and\n\n(d)\n\ndoing any other act or thing required to be done by the Chief Executive\nOfficer.\n\nNotwithstanding any provision of this Act but subject to subsection (1)\n(2)\n(b) and (c) and any provision of any specified enactment set out in the Second\nSchedule,  the  Director  of  IP  shall  not  be  answerable  to  the  Chief  Executive\nOfficer, the Board or the Minister in exercise of the duties, obligations powers\nor rights conferred on the Director of IP by any of the specified enactments.\n\nTransfer and secondment of employees\n\nWhere a public officer is seconded to a post in Business Barbados\n15.(1)\nfrom a pensionable office within the meaning of section 2 of the Pensions Act,\nCap.  25,  the  period  of  service  with  Business  Barbados,  unless  the  President\notherwise determines, counts for pension under that Act as if the officer had not\nbeen so seconded.\n\n(2)\n\nWhere a public officer accepts employment with Business Barbados,\n\n(a)\n\n(b)\n\n(c)\n\nthe public officer shall be employed as a permanent employee on terms\nand  conditions  that  are  no  less  favourable  than  those  on  which  the\nofficer was employed before the commencement of this Act;\n\nthe public officer shall retain any right to pension, gratuity or other\nallowance  for  which  the  officer  would  have  been  eligible  had  the\nofficer remained in the public service;\n\nthe  public  officer’s  service  in  the  public  service  before  the\ncommencement of this Part shall be aggregated with his service in the\nBoard for the purposes of paragraph (d); and\n\n\f15\n\n(d)\n\nthe public officer’s right to pension, gratuity and other allowances shall\nbe calculated in accordance with the Pensions Act, Cap. 25.\n\nLimitation on powers of Board concerning staff, etc.\n\n16.\nBoard shall not, without the prior approval of the Minister,\n\nNotwithstanding the powers conferred on the Board by section 8, the\n\n(a)\n\n(b)\n\n(c)\n\nassign to a post established by Business Barbados a salary in excess of\nsuch amount per annum as the Minister may determine;\n\nappoint a person to a post established by Business Barbados to which\na  salary  in  excess  of  the  amount  determined  by  the  Minister  under\nparagraph (a) is assigned; or\n\nprovide for the payment of a pension, gratuity or similar benefit to the\ndirectors of the Board or the employees of Business Barbados in respect\nof service to Business Barbados.\n\nPrivate pension plan\n\n17.\nBusiness  Barbados  shall,  no  later  than  12  months  after  the\ncommencement of this Act, provide for the establishment and maintenance of a\npension plan for the benefit of the staff of Business Barbados.\n\nAppointment of experts\n\n18.\nBusiness Barbados may appoint, on such terms and conditions as the\nMinister  approves,  such  experts  as  it  considers  necessary  to  assist  it  in  such\nmanner as it determines.\n\nAdvisory Committee on Intellectual Property\n\n19.(1)\nCommittee on Intellectual Property”.\n\nThere  is  established  a  Committee  to  be  known  as  the  “Advisory\n\nThe  Fourth  Schedule  has  effect  with  respect  to  the  constitution  of  the\n\n(2)\nCommittee and otherwise in relation thereto.\n\n\f16\n\nFunctions of the Committee\n\n20.\n\nThe functions of the Committee are to advise the Board on\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\npolicies relating to intellectual property rights in Barbados;\n\nmatters  relating  to  the  specified  enactments  set  out  in  the  Second\nSchedule;\n\nthe status of Barbados’ compliance with intellectual property treaties\nand conventions; and\n\nsuch other matters relating to intellectual property rights in Barbados,\nincluding  matters  relevant  to  Barbados’  economic  and  cultural\ninterests,\n\nas the Board may direct.\n\nPART III\n\nFINANCIAL PROVISIONS\n\nEstablishment of Fund\n\n21.(1)\nestablished.\n\nFor  the  purposes  of  this  Act,  the  Business  Barbados  Fund  is\n\nThe Fund shall comprise an initial capitalization amount agreed between\n(2)\nthe Board and the Government which shall be vested in Business Barbados and\nsuch other amounts as may\n\n(a)\n\n(b)\n\nbe voted for the purpose by Parliament;\n\nbe collected as fees paid to Business Barbados pursuant to the specified\nenactments;\n\n(c)\n\nbe borrowed by Business Barbados for its purposes;\n\n\f17\n\n(d)\n\nbe realized from the proceeds of its investments; and\n\n(e)\n\nbecome  available  to  Business  Barbados  from  any  other  source\napproved by the Minister.\n\n(3)\nNotwithstanding  any  enactment  to  the  contrary,  all  fees  collected  by\nBusiness  Barbados  pursuant  to  the  specified  enactments  shall  be  retained  by\nBusiness Barbados and paid into the Fund.\n\nThe resources of the Fund shall be applied in payment or discharge of its\n(4)\nexpenses, obligations and liabilities and towards the performance of its functions.\n\n(5)\n\nBusiness Barbados\n\n(a)\n\n(b)\n\nshall develop an investment policy in relation to its resources; and\n\nmay invest any sums not required for the purposes of subsection (4) in\nsuch low-risk securities as it considers appropriate.\n\nBorrowing power\n\nBusiness Barbados may, with the approval of the Minister, borrow\n22.(1)\nany money it requires for meeting any of its obligations or performing any of its\nfunctions and shall, in such a case, inform the Minister of\n\n(a)\n\n(b)\n\nthe amount and source of the loan; and\n\nthe terms and conditions on which the loan may be obtained.\n\nThe approval of the Minister under subsection (1) may be general or limited\n\n(2)\nto a particular borrowing.\n\nGuarantee of loans\n\nThe  Government  may,  with  the  approval  of  Parliament,  in  such\n23.\nmanner and on such terms and conditions as may be specified, guarantee a loan\nto Business Barbados together with any interest or other charges payable thereon.\n\n\f18\n\nExemption from taxes\n\nBusiness Barbados is exempt from the payment of corporation tax and\n\n24.\nland tax.\n\nAccounts\n\n25.(1)\n\nBusiness Barbados shall, in respect of its affairs and functions\n\n(a)\n\n(b)\n\nkeep proper accounts and adequate financial and other records; and\n\nprepare financial statements in respect of each financial year,\n\nin conformity with generally accepted accounting practice.\n\nFor  the  purposes  of  subsection  (1),  “generally  accepted  accounting\n\n(2)\npractice” means\n\n(a)\n\n(b)\n\n(c)\n\nthe  International  Public  Sector  Accounting  Standards  issued  by  the\nInternational Federation of Accountants;\n\nwhere  no  guidance  is  provided  by  the  Standards  referred  to  in\nparagraph (a), the Accounting Standards issued by the International\nAccounting Standards Board; or\n\nwhere  no  guidance  is  provided  by  the  Standards  referred  to  in\nparagraph  (a)  or  (b),  accounting  practice  that  is  generally  accepted\nwithin  the  accounting  profession  in  Barbados  as  appropriate  for\nreporting by the public sector, including statutory bodies.\n\nAudit\n\n26.(1)\n\nThe Auditor-General shall be the auditor of Business Barbados.\n\n(2)\n\nThe Auditor-General shall\n\n(a)\n\naudit  annually  the  accounts  of  Business  Barbados  and  report  to  the\nBusiness  Barbados  and  the  Minister  on  the  financial  statements  of\nBusiness Barbados;\n\n\f19\n\n(b)\n\nperiodically  assess,  on  such  basis  as  the  Auditor-General  may\ndetermine  to  be  reasonable,  the  fairness  and  reliability  of  the\ninformation submitted to the Auditor-General by Business Barbados;\nand\n\n(c)\n\nprovide the Minister and Business Barbados with copies of reports of\naudits and assessments carried out under this section.\n\nPublic Finance Management Act to apply\n\nThe Public Finance Management Act, 2019 (Act 2019-1) applies to\n27.\nBusiness Barbados with such modifications and adaptations as may be necessary.\n\nReports\n\n28.\nfinancial year, submit to the Minister a report containing\n\nBusiness Barbados shall, not later than 3 months after the end of every\n\n(a)\n\nan  account  of  the  activities  and  transactions  of  Business  Barbados\nthroughout the financial year in such detail as the Minister may direct;\nand\n\n(b)\n\na detailed statement of all sums remitted in accordance with section 42\nof the Public Finance Management Act, 2019 (Act 2019-1).\n\nPART IV\n\nMISCELLANEOUS\n\nRemuneration of directors\n\n29.\nremuneration and allowances as the Minister determines.\n\nDirectors,  other  than  ex  officio  directors,  are  entitled  to  such\n\n\f20\n\nDirectors to declare interest\n\n30.(1)\nin a matter before the Board shall declare the director’s interest to the Board.\n\nA director who is in any way, whether directly or indirectly, interested\n\n(2)\nThe  Board,  excluding  the  director  whose  interest  was  declared,  shall\ndetermine whether the interest is sufficiently material as to constitute a conflict\nof interest.\n\nWhere  the  Board  determines  that  the  interest  is  such  as  to  constitute  a\n\n(3)\nconflict of interest, the director shall not\n\n(a)\n\n(b)\n\nparticipate in deliberations on the matter concerned; and\n\nbe present during the deliberations.\n\nFor the purpose of this section, a director shall be deemed to have a direct\n(4)\ninterest in a matter where the director or the nominee or immediate relative of\nthe director is\n\n(a)\n\n(b)\n\na shareholder or a partner in; or\n\nan officer of,\n\na company or other body of persons having an interest in or involved in a matter\nbefore the Board.\n\nFor the purpose of subsection (4), “immediate relative” means the spouse,\n\n(5)\nchild, parent, brother or sister of a director.\n\nA person who fails to comply with subsection (1) is guilty of an offence\n(6)\nand is liable on summary conviction to a fine of $25 000, unless the director\nproves that the director did not know of the interest in the matter which was the\nsubject of consideration by the Board.\n\nA person convicted of an offence under this section is no longer eligible\n\n(7)\nto sit on the Board.\n\n\f21\n\nCertain information not to be disclosed to Board\n\nNo person shall disclose to the Board information obtained under any\n31.\nof  the  specified  enactments  or  prepared  from  information  so  obtained,  that\ndirectly or indirectly reveals the identity of the person, organization or business\nto which the information relates.\n\nProtection from personal liability\n\n32.\nNo action or other legal proceedings shall lie personally against an\nemployee of, or other person acting under the direction of, Business Barbados or\nagainst a director or member for anything done in good faith or intended to be\ndone in the execution or purported execution of this Act.\n\nNotaries public\n\nNotwithstanding\n\nthe  Notaries  Public  Act\nthe  provisions  of\n33.(1)\n(Act 2024-21) any person holding or acting in an office set out in subsection (2)\nshall be a notary public for Barbados.\n\n(2)\n\nThe offices to which subsection (1) refers are:\n\n(a)\n\n(b)\n\n(c)\n\nRegistrar;\n\nDirector of IP;\n\nSenior Legal Counsel;\n\n(d)\n\nLegal Counsel; and\n\n(e)\n\nLegal Administrator.\n\nCorporate business plan\n\nBusiness  Barbados  shall,  every  year,  prepare  and  submit  to  the\n34.(1)\nMinister, a corporate business plan for the following year beginning on 1st April\nand ending on 31st March.\n\n\f22\n\n(2)\n\nThe plan referred to in subsection (1) shall include\n\n(a)\n\n(b)\n\nthe objectives of Business Barbados;\n\nthe  strategies  that  Business  Barbados  intends  to  use  to  achieve  its\nobjectives, including\n\n(i)\n\noperational and financial strategies; and\n\n(ii)\n\nhuman resource strategies,\n\nand their impact on overall salaries and benefits;\n\n(c)\n\n(d)\n\nthe  expected  performance  of  Business  Barbados,  generally,  and  its\nDivisions, separately;\n\nthe  operating  and  capital  budgets  of  Business  Barbados,  including\ngrants  and  contributions  and  revenues  from  the  conduct  of  the\noperations  of  Business  Barbados  generally,  and  its  Divisions,\nseparately; and\n\n(e)\n\nany other strategic information that the Minister may require.\n\nMinisterial directions\n\n35.(1)\nThe Minister may, in writing, give to Business Barbados directions of\na general nature as to the policy to be followed in the performance of its functions;\nand Business Barbados shall comply with the directions.\n\nThe  Minister  may,  at  any  time,  require  Business  Barbados  to  provide\n(2)\ninformation  concerning  any  aspect  of  its  administration  under  this  Act;  and\nBusiness Barbados shall provide the information.\n\nAmendment of Schedules\n\n36.\nSchedules.\n\nThe Minister may by order amend the First, Second, Third and Fourth\n\n\f23\n\nRegulations\n\nThe Board may, with the approval of the Minister, make regulations\n37.\nto  give  effect  to  the  provisions  of  this  Act  and  generally  for  the  proper\nadministration of this Act.\n\nTransitional provisions relating to the State\n\n38.(1)\n\nUpon the commencement of this Act\n\n(a)\n\n(b)\n\nall funds appropriated for the administration of the Corporate Affairs\nand  Intellectual  Property  Office  shall,  by  virtue  of  this  Act,  vest  in\nBusiness Barbados;\n\nall  rights,  powers,  privileges  and  authorities  relating\nthe\nadministration of the specified enactments, that immediately before the\ncommencement of this Act were vested in and exercisable by the State\nthrough  the  Corporate  Affairs  and  Intellectual  Property  Office,  are\nvested in and exercisable by Business Barbados;\n\nto\n\n(c)\n\nall assets vested in or held by the State and used for matters relating to\nthe administration of the Corporate Affairs and Intellectual Property\nOffice before the commencement of this Act\n\n(i)\n\n(ii)\n\nare transferred to and vested in Business Barbados and shall be\nused by Business Barbados for the purposes of this Act; and\n\nare by virtue of this Act, and without further assurance, transfer\nor formality, with effect from the commencement of this Act, to\nbe held by Business Barbados for the same estate and interest and\nto the same extent and in the manner as the assets were vested in\nor held by the State immediately before the commencement of this\nAct.\n\n(d)\n\nall liabilities incurred by the State in respect of the administration of\nthe Corporate Affairs and Intellectual Property Office and subsisting\n\n\f24\n\nimmediately before the commencement of this Act shall have effect as\nif they had been incurred by or on behalf of Business Barbados; and\n\n(e)\n\nwithout affecting paragraph (d), all contracts made by or on behalf of\nthe State in respect of the administration of any the Corporate Affairs\nand Intellectual Property Office and subsisting immediately before the\ncommencement of this Act shall be deemed to have been made by or\non  behalf  of  Business  Barbados  and  shall  be  construed  with  such\nmodifications and adaptations as may be necessary to give effect to\nthem.\n\nFor  the  purpose  of  this  section,  the  Corporate  Affairs  and  Intellectual\n(2)\nProperty Office means the office established by section 3 of the Corporate Affairs\nand Intellectual Property Office Act, Cap. 21A, now repealed by this Act.\n\nTransitional provisions relating to civil proceedings\n\nAll proceedings commenced before the commencement of this Act in\n39.\nany court of competent jurisdiction by or against the State in connection with the\nCorporate Affairs and Intellectual Property Office may be continued by or against\nBusiness  Barbados;  and  process  in  those  proceedings  may  be  amended\naccordingly.\n\nAppeals to Minister or tribunal\n\n40.\nAn appeal relating to any matter under a specified enactment begun\nbefore the commencement of this Act before a Minister, tribunal or other body\nmay be continued and process had and decisions given thereon as if this Act had\nnot been enacted.\n\nConsequential amendments\n\n41.\nin the respects specified in Column 2 of the Fifth Schedule.\n\nThe enactment set out in Column 1 of the Fifth Schedule is amended\n\n\f25\n\nRepeal of Cap. 21A\n\n42.\nCap. 21A is repealed.\n\nThe  Corporate  Affairs  and  Intellectual  Property  Office  Act,\n\nCommencement\n\n43.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f26\n\nFIRST SCHEDULE\n\nSpecified enactments relating to Corporate Affairs\n\n(Sections 2, 13 and 36)\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nBarbados Foreign Sales Corporation Act, Cap. 59C\n\nBills of Sale Act, Cap. 306\n\nCaribbean (Caricom Enterprises) Act, Cap. 14B\n\nCharities Act, Cap. 243\n\nCompanies Act, Cap. 308\n\nElectronic Filing Act, 2014 (Act 2014-16)\n\nFinancial Institutions Act, Cap. 324A\n\nInsurance Act, Cap. 310\n\nLimited Partnerships Act, Cap. 312\n\n10. Pharmacy Act, Cap. 372D\n\n11. Private Trust Companies Act, 2012 (Act 2012-22)\n\n12. Property Transfer Tax Act, Cap. 84A\n\n13. Public Documents (Exemption from Diplomatic or Consular Legislation) Act, Cap. 122\n\n14. Registration of Business Names Act, Cap. 317\n\n15. Registration of Newspapers Act, Cap. 302\n\n16.\n\n17.\n\n18.\n\nSmall Business Development Act, Cap. 318C\n\nSocieties with Restricted Liability Act, Cap. 318B\n\nStamp Duty Act, Cap. 91\n\n19. Trade Unions Act, Cap. 361\n\n\f27\n\nSECOND SCHEDULE\n\nSpecified enactments relating to Intellectual Property\n\n(Sections 2, 14, 20 and 36)\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\nCopyright Act, Cap. 300\n\nGeographical Indications Act, Cap. 320\n\nIndustrial Designs Act, Cap. 309A\n\nIntegrated Circuits Act, Cap. 320A\n\nPatents Act, Cap. 314\n\nProtection of New Plant Varieties Act, Cap. 267\n\nTrade Marks Act, Cap. 319\n\n\f28\n\nTHIRD SCHEDULE\n\nConstitution of Business Barbados Board\n\n(Sections 7(2) and 36)\n\nAppointment of directors\n\n1.(1)\n\nThe Board shall comprise no more than 9 directors as follows:\n\n(a)\n\n(b)\n\nPermanent  Secretary  in  the  Ministry  responsible  for  Business,  ex\nofficio, or nominee; and\n\nthe  following  persons  appointed  by  the  Minister,  by  instrument  in\nwriting:\n\n(i)\n\n(ii)\n\na representative of Barbados International Business Association;\n\na  representative  of  the  Barbados  Chamber  of  Commerce  and\nIndustry;\n\n(iii)\n\na representative of the Small Business Association; and\n\n(iv)\n\nat  least  3,  but  no  more  than  5  individuals  with  experience  in\nindustry, commerce or business.\n\nA director, other than an ex officio director, shall, subject to the provisions\n\n(2)\nof this Schedule\n\n(a)\n\n(b)\n\nhold office for a term not exceeding 3 years; and\n\nbe eligible for reappointment.\n\nThe Minister shall, pursuant to subparagraph (2), determine the term of\n(3)\noffice of a director in such a manner that in any one year the respective terms of\noffice of no more than 3 directors expire.\n\nChairman and Deputy Chairman\n\n2.\nbe Deputy Chairman, of the Board.\n\nThe Minister shall appoint a director to be Chairman, and another to\n\n\f29\n\nResignation\n\n3.(1)\nto the Minister.\n\nThe Chairman may resign office by instrument in writing addressed\n\n(2)\nA director, other than the Chairman, may resign office by instrument in\nwriting addressed to the Chairman, who shall forthwith forward the instrument\nto the Minister.\n\nResignation takes effect from the date on which the Minister receives the\n\n(3)\ninstrument.\n\nTemporary leave of absence\n\n4.\n\nThe Minister may, in writing, grant leave of absence to a director.\n\nTemporary appointment\n\nWhere a director is, or is likely to be, unable to perform the functions\n5.\nof office for more than 30 days, whether as a result of absence from Barbados,\nillness or other cause, the Minister may appoint a person to act in the place of the\ndirector.\n\nRevocation of appointment\n\n6.\n\nThe Minister shall revoke the appointment of a director who\n\n(a)\n\n(b)\n\n(c)\n\nfails to carry out any of the functions of director under this Act;\n\nbecomes of unsound mind or becomes permanently unable to perform\nthe functions of director by reason of ill health;\n\nis convicted of an offence involving fraud or dishonesty or, in the case\nof any other offence, is sentenced to a term of imprisonment;\n\n(d)\n\nis guilty of serious misconduct in relation to functions as director;\n\n(e)\n\nis bankrupt or compounds with or suspends payment to creditors; or\n\n\f30\n\n(f)\n\nfails  to  declare  interest  in  a  matter  before  the  Board  as  required  by\nsection 30.\n\nVacancies\n\n7.(1)\n\nA vacancy in the membership of the Board arises on\n\n(a)\n\n(b)\n\n(c)\n\nthe death or resignation of a director;\n\nthe revocation of the appointment of a director; or\n\nthe absence of a director from 4 consecutive meetings of the Board\nwithout the approval of the Minister.\n\nA person who is appointed to fill a vacancy referred to in subparagraph (1)\n(2)\nshall hold office only for the unexpired portion of the term of the former director\nconcerned.\n\nDisqualification to be director\n\n8.\n\nThe following persons are disqualified from being directors:\n\n(a)\n\n(b)\n\na member of Parliament; or\n\na person who, were the person a director, would have to be removed\nfrom office pursuant to paragraph 6.\n\nGazetting of appointments\n\n9.\ndirector shall be notified in the Official Gazette.\n\nThe  appointment,  resignation,  death  or  removal  from  office  of  a\n\nSeal and execution of documents\n\n10.(1)\n\nThe seal of the Authority shall be\n\n(a)\n\nkept in the custody of the Chairman, the Deputy Chairman, the Chief\nExecutive Officer or the person performing the functions of secretary\nto the Board and may be affixed to documents or instruments pursuant\n\n\f31\n\nto a resolution of the Board, in the presence of any 2 of the persons\nreferred to in this subparagraph; and\n\n(b)\n\nauthenticated by the signature of the Chairman or the Deputy Chairman\nand the Chief Executive Officer or the person performing the functions\nof secretary to the Board.\n\nAll documents or instruments made by the Board, other than those required\n(2)\nby law to be under seal, and all decisions of the Board shall be signified under\nthe hand of the Chairman or the Deputy Chairman, the Chief Executive Officer\nor the person performing the functions of secretary to the Board.\n\nCommittees\n\n11.(1)\nto assist it with the proper discharge of its functions.\n\nThe Board may appoint committees of its members or other persons\n\nWhere  a  person  who  is  not  a  member  of  the  Board  is  appointed  to  a\n(2)\ncommittee,  the  Board  may,  with  the  approval  of  the  Minister,  determine  the\nremuneration and allowances to be paid to the person.\n\nMeetings\n\n12.(1)\nThe Board shall meet as often as may be necessary or expedient for\nthe transaction of its business; and such meetings shall be held at such places and\ntimes as the Board may determine.\n\nThe Chairman, or in the event of the Chairman’s absence from Barbados\n(2)\nor inability to act as such, the Deputy Chairman, may at any time call a special\nmeeting of the Board and shall call such a meeting within 7 days of the receipt\nof a request for the purpose addressed to the Chairman in writing and signed by\nnot less than 3 directors.\n\nThe Chairman, or in the Chairman’s absence, the Deputy Chairman, shall\n\n(3)\npreside at all meetings of the Board.\n\n\f32\n\n(4)\nWhere the Chairman and the Deputy Chairman are absent from a meeting,\nthe directors present shall elect a director from among their number to preside at\nthe meeting.\n\n(5)\n\nFive directors shall constitute a quorum.\n\nThe decisions of the Board shall be by a majority of votes and in a case\n(6)\nwhere the voting is equal, the Chairman or other person presiding at the meeting\nshall, in addition to an original vote, have a casting vote.\n\nMinutes  of  each  meeting  shall  be  kept  by  the  person  performing  the\n(7)\nfunctions of secretary to the Board or by such other officer as the Board appoints\nfor the purpose and shall be confirmed by the Board and signed by the Chairman\nor Deputy Chairman at the next meeting of the Board.\n\nAttendance of non-members at meetings\n\nThe Board may invite any person to attend any of its meetings to assist\n13.\nor advise it with respect to any matter under its consideration, but a person so\ninvited does not have a right to vote.\n\nBoard may regulate proceedings\n\n14.\nown proceedings.\n\nSubject to the provisions of this Schedule, the Board may regulate its\n\n\f33\n\nFOURTH SCHEDULE\n\nConstitution of Advisory Committee on Intellectual Property\n\n(Sections 19(2) and 36)\n\nAppointment of Committee members\n\n1.\n\nThe Committee shall comprise no more than 13 members as follows:\n\n(a)\n\n(b)\n\n(c)\n\nPermanent  Secretary  in  the  Ministry  responsible  for  Business,  ex\nofficio, or nominee;\n\nPermanent  Secretary  in  the  Ministry  responsible  for  Agriculture,\nexofficio, or nominee;\n\nPermanent  Secretary  in  the  Ministry  responsible  for  Innovation,\nScience and Technology, ex officio, or nominee;\n\n(d)\n\nDirector of Intellectual Property, ex officio;\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nChief Executive Officer, National Cultural Foundation, ex officio, or\nnominee;\n\nChief Executive Officer, Export Barbados, ex officio, or nominee;\n\nSolicitor General, ex officio, or nominee;\n\nChief  Executive  Officer,  Copyright  Society  of  Composers,  Authors\nand Publishers Inc., ex officio, or nominee;\n\nDirector,  Barbados  Museum  and  Historical  Society,  ex  officio,  or\nnominee; and\n\nat least 2, but not more than 4 individuals with experience in intellectual\nproperty, industry, business or innovation who shall be appointed by\nthe Minister.\n\n\f34\n\nChairman and Deputy Chairman\n\n2.\nbe Chairman and one to be Deputy Chairman, respectively.\n\nThe Minister shall appoint one of the members of the Committee to\n\nMeetings\n\n3.(1)\nBarbados requires.\n\nThe Committee shall meet at such times as the business of Business\n\nThe Chairman, or in the Chairman’s absence the Deputy Chairman, shall\n\n(2)\npreside at meetings of the Committee.\n\n(3)\n\nSeven members of the Committee shall constitute a quorum.\n\nTerm of appointment\n\nMembers of the Committee other than ex officio, members, hold office\n4.(1)\nfor a period of 3 years from the date of their appointment but are eligible for\nreappointment on the expiration of the period of their tenure of office.\n\n(2)\nThe Minister shall, pursuant to subparagraph (1), determine the term of\noffice of a member of the Committee in such a manner that in any one year the\nrespective terms of office of no more than 3 members of the Committee expire.\n\nResignation\n\n5.(1)\nto the Minister.\n\nThe Chairman may resign office by instrument in writing addressed\n\nA member, other than the Chairman, may resign office by instrument in\n(2)\nwriting addressed to the Chairman, who shall forthwith forward the instrument\nto the Minister.\n\nResignation takes effect from the date on which the Minister receives the\n\n(3)\ninstrument.\n\n\f35\n\nTemporary leave of absence\n\n6.\n\nThe Minister may, in writing, grant leave of absence to a member.\n\nTemporary appointment\n\nWhere a member is, or is likely to be, unable to perform the functions\n7.\nof office for more than 30 days, whether as a result of absence from Barbados,\nillness or other cause, the Minister may appoint a person to act in the place of the\nmember.\n\nRevocation of appointment\n\n8.\n\nThe Minister shall revoke the appointment of a member who\n\n(a)\n\n(b)\n\n(c)\n\nfails to carry out any of the functions under this Act;\n\nbecomes of unsound mind or becomes permanently unable to perform\nfunctions by reason of ill health;\n\nis convicted of an offence involving fraud or dishonesty or, in the case\nof any other offence, is sentenced to a term of imprisonment;\n\n(d)\n\nis guilty of serious misconduct in relation to the member’s functions;\n\n(e)\n\nis bankrupt or compounds with or suspends payment to creditors;\n\n(f)\n\nfails  to  declare  the  member’s  interest  in  a  matter  that  is  before  the\nCommittee.\n\nVacancies\n\n9.(1)\n\nA vacancy in the membership of the Committee arises on\n\n(a)\n\n(b)\n\n(c)\n\nthe death or resignation of a member;\n\nthe revocation of the appointment of a member; or\n\nthe  absence  of  a  member  from  4  consecutive  meetings  of  the\nCommittee without the approval of the Minister.\n\n\f36\n\n(2)\nA person who is appointed to fill a vacancy referred to in subparagraph (1)\nshall hold office only for the unexpired portion of the term of the former member\nconcerned.\n\nDisqualification\n\n10.\nCommittee:\n\nThe following persons are disqualified from being members of the\n\n(a)\n\n(b)\n\na member of Parliament;\n\na person who, other than a person specified in paragraph 1(1)(a),(b),\n(c) or (g) is a public officer within the meaning of the Public Service\nAct, Cap. 29; or\n\n(c)\n\na person who, were the person a member, would have to be removed\nfrom office pursuant to paragraph 8.\n\nGazetting of appointments\n\n11.\nmember shall be notified in the Official Gazette.\n\nThe  appointment,  resignation,  death  or  removal  from  office  of  a\n\nAttendance of non-members\n\n12.\nThe Committee may invite any person to attend any of its meetings to\nassist or advise it with respect to any matter under its consideration, but a person\nso invited does not have a right to vote.\n\nRemuneration\n\n13.\nto such remuneration and allowances as the Minister determines.\n\nMembers of the Committee, other than ex officio members, are entitled\n\nCommittee may regulate procedure\n\n14.\nprocedure.\n\nSubject  to  this  Schedule,  the  Committee  may  regulate  its  own\n\n\f37\n\n L.R.O. 1998FIFTH SCHEDULE(Section 41)CONSEQUENTIAL AMENDMENTSColumn 1Enactments1. Companies Act, Cap. 3082. Public Finance Management Act, 2019 (Act 2019-1)3. Notaries Public Act, 2024 (Act 2024-21)Column 2AmendmentsIn section 175,(a) insert the following immediately after subsection (10):\"(10A)  Without aﬀ ecting the powers conferredupon the Registrar by subsections (5), (6), (7), (8) and (10), the Permanent Secretary in the Ministryresponsible for Business shall have and exercisethe same powers as are conferred on the Registrar bythose subsections for the proper administration and enforcement of the aﬀ airs of the Ministry; and for the purpose of giving eﬀ ect to this subsection those subsections shall be read and construed as if the words \"or Permanent Secretary in the Ministry responsible for Business\" were set out in those subsections immediately after the word \"Registrar\".\"; and (b) In subsection (12), immediately after the words \"(10)\"  add the words \"or (10A)\". In the Second Schedule, insert immediately after paragraph 14 the following:\"14A.  Business Barbados.\".In the First Schedule, delete paragraphs (p), (q) and (r)."
}