{
  "bill_id": 809,
  "slug": "human-tissue-transplant-bill-2024",
  "title": "Human Tissue Transplant Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/067f5d56a75921d5812f36825a9dac46.pdf",
  "current_stage": "The Senate",
  "chamber": "The Senate",
  "notice_date": "2024-10-31",
  "first_reading": "2024-11-08",
  "gazette_date": "2023-10-16",
  "markdown": "2024-10-31\n\nOBJECTS AND REASONS\n\nThis Bill would provide for the removal of tissue from the body of one person,\nwhether living or deceased, for transplantation into the body of a living person\nand for related matters.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\nPART II\n\nADMINISTRATION\n\nShort title\n\nInterpretation\n\nApproval of health service institution\n\nEstablishment of Council\n\nFunctions of the Council\n\nDesignated transplant officers\n\nPART III\n\nDONATION OF TISSUE BY ADULTS\n\nDonation of regenerative tissue by adults\n\nEffect of consent under section 7\n\nDonation of non-regenerative tissue by adults\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n\f3\n\n10.\n\nEffect of consent under section 9\n\nPART IV\n\nDONATION OF TISSUE BY MINORS\n\n11.\n\nProhibition of removal of non-regenerative tissue\n\n12.\n\nRemoval of regenerative tissue where minor understands\n\n13.\n\nEffect of consent under section 12\n\n14.\n\nRemoval of regenerative tissue where minor does not have the capacity to\nunderstand the procedure or give consent to it\n\n15.\n\nEffect of consent under section 14\n\n16.\n\nRemoval of tissue from and transplantation of tissue into a living person\n\n17.\n\nWithdrawal of consent\n\nPART V\n\nDONATION OF TISSUE AFTER DEATH\n\n18.\n\nDefinitions\n\n19.\n\nRemoval and use of tissue after death\n\n20.\n\nConditions under which designated transplant officer may exercise\nauthority\n\n21.\n\nRemoval of tissue only after death\n\n22.\n\nWhen death occurs\n\n\f23.\n\nConcurrence of coroner\n\n4\n\nPART VI\n\nPROHIBITION ON TRADING IN HUMAN TISSUE\n\n24.\n\nTrade in human tissue prohibited\n\n25.\n\nAdvertisement relating to buying or selling of tissue prohibited\n\nPART VII\n\nMISCELLANEOUS\n\n26.\n\nExemption from liability\n\n27.\n\nLimitation on application of Act\n\n28.\n\nOffences in relation to removal of tissue\n\n29.\n\nOffences in relation to removal of tissue for gain or profit\n\n30.\n\nDisclosure of information\n\n31.\n\nRegulations\n\n32.\n\nAmendment of Schedules\n\n33.\n\nCommencement\n\n\f5\n\nFIRST SCHEDULE\n\nCONSTITUTION OF NATIONAL TRANSPLANTATION COUNCIL\n\nSECOND SCHEDULE\n\nFORMS\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for the removal of tissue from the body of one person,\nwhether living or deceased, for transplantation into the body of a living person\nand for related matters.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f8\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\n\nThis Act may be cited as the Human Tissue Transplant Act, 2024.\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“blood” means human blood and includes any product derived from blood;\n\n“Coroner” has the meaning assigned to it by the Coroners Act, Cap. 113;\n\n“Council” means the National Transplantation Council established by section 4;\n\n“designated transplant officer” means a person appointed under section 6;\n\n“Director of Medical Services” means a person appointed as Director of Medical\nServices under section 9 of the Queen Elizabeth Hospital Act, Cap. 54;\n\n“donor” means a person who has given consent under section 7(1);\n\n“guardian” means a person who is acting as guardian ad litem in relation to\n\n(a)\n\n(b)\n\na minor; or\n\na person who is incapable of\n\n(i)\n\nacting;\n\n(ii)\n\nmaking decisions;\n\n(iii)\n\ncommunicating decisions;\n\n(iv)\n\nunderstanding decisions; or\n\n(v)\n\nretaining the memory of decisions\n\nby reason of mental disorder or inability to communicate;\n\n\f“hospital”\n\n9\n\n(a)\n\n(b)\n\nhas  the  meaning  assigned  to  it  by  section  2  of  the  Queen  Elizabeth\nHospital Act, Cap. 54; and\n\nincludes health services institutions approved by the Minister under\nsection 3;\n\n“medical  practitioner”  means  a  registered  medical  practitioner  within  the\n\nmeaning of the Medical Profession Act, 2011 (Act 2011-1);\n\n“Minister” means the Minister responsible for health;\n\n“next of kin” means, in descending order of priority,\n\n(a)\n\n(b)\n\n(c)\n\na spouse;\n\nthe eldest child who is not a minor;\n\na parent or guardian; or\n\n(d)\n\nthe eldest brother or sister who is not a minor;\n\n“non-regenerative tissue” means tissue, other than regenerative tissue;\n\n“regenerative tissue” means tissue that, after injury within or after removal from\nthe  body  of  a  living  person,  is  replaced  in  the  person’s  body  by  natural\nprocesses;\n\n“spouse” has the meaning assigned to it by the Family Law Act, Cap. 214;\n\n“therapeutic purposes” includes transplant purposes;\n\n“tissue” includes an organ, a part of a human body and a substance extracted from\n\nthe human body, but does not include\n\n(a)\n\n(b)\n\n(c)\n\nspermatozoa or ova;\n\nan embryo or a foetus or a part of an embryo or a foetus; or\n\nblood or a blood constituent;\n\n\f10\n\n“transplant” means the removal of tissue from a human body, whether living or\n\ndead, and its implantation into a living human body;\n\n“transplant  team”  means  the  medical  professionals  and  their  assistants\n\nresponsible for the procedures relating to tissue transplantation.\n\nPART II\n\nADMINISTRATION\n\nApproval of health service institution\n\nThe Minister may approve, in writing, hospitals within the definition\n3.(1)\nof health services institutions in section 2 of the Health Services Act, Cap. 44, as\nhospitals for the purposes of this Act.\n\nThe  Minister  may  prescribe  the  conditions  with  which  a  health  service\n\n(2)\ninstitution approved under this section shall comply.\n\nEstablishment of Council\n\n4.(1)\nTransplantation Council.\n\nThere  is  established  a  council  to  be  known  as  the  National\n\nThe provisions of the First Schedule shall have effect with respect to the\n\n(2)\nconstitution of the Council and otherwise in relation thereto.\n\nThe Council shall be a body corporate to which the provisions of section\n\n(3)\n21 of the Interpretation Act, Cap. 1 shall apply.\n\nFunctions of the Council\n\n5.\n\nThe functions of the Council are as follows:\n\n(a)\n\nto  advise  the  Minister  on  changes  and  proposed  changes  to  the\nlegislation governing human tissue transplantation in Barbados;\n\n\f11\n\n(b)\n\nto  provide  advice  and  guidance  to  medical  practitioners  engaged  in\nhuman tissue transplantation on issues that arise in\n\n(i)\n\nthe allocation of organs to recipients;\n\n(ii)\n\nthe selection of donors;\n\n(iii)\n\nproposed  new  or  novel  programmes  of  transplantation  in\nBarbados; and\n\n(iv)\n\nremoval of tissue after death;\n\n(c)\n\n(d)\n\nto  approve  the  qualifications,  experience  and  character  of  persons\nproposed for appointment under this Act;\n\nto  enquire  into  and  report  on  any  issue  related  to  human  tissue\ntransplantation that has been referred to it by\n\n(i)\n\n(ii)\n\nany officer named in this Act or the regulations made under this\nAct;\n\nregistered  professional  engaged\n\nany\ntransplantation;\n\nin  human\n\ntissue\n\n(iii)\n\nany potential recipient or recipient resident in Barbados; or\n\n(iv)\n\nthe Minister;\n\n(e)\n\nto  consider  and  advise  on  any  matter  related  to  human  tissue\ntransplantation that is brought to its attention in writing by a member\nof the public; and\n\n(f)\n\nto seek advice on any matter relating to human tissue transplantation\nfrom any source, whether within or outside Barbados.\n\nDesignated transplant officers\n\n6.(1)\nThe Chief Medical Officer may in writing nominate a person with that\nperson’s consent to be a designated transplant officer of a hospital for a period\nnot exceeding 2 years.\n\n\f12\n\n(2)\nThe name of the person nominated under subsection (1) shall be submitted\nto the Council and the Council shall, on being satisfied of the person’s suitability,\nto be a designated transplant officer\n\n(a)\n\n(b)\n\nin the case of the Queen Elizabeth Hospital, assign the person; and\n\nin any other case, may give its approval for the assignment of the person\n\nas the designated transplant officer for the hospital concerned.\n\nA designated transplant officer shall perform the functions of a transplant\n\n(3)\ncoordinator and a transplant procurement manager and shall\n\n(a)\n\n(b)\n\nensure  that  the  donation  of  tissue  is  transparent,  non-coercive  and\ncomplies with this Act and any regulations under this Act; and\n\nact as an advocate on behalf of the donor, his guardian or his next of\nkin, as the case requires.\n\n(4)\n\nThe Council, on the advice of the Chief Medical Officer may,\n\n(a)\n\n(b)\n\nin the case of the Queen Elizabeth Hospital, revoke the appointment of\na designated transplant officer; and\n\nin  any  other  cases,  withdraw  its  approval  and  recommend  the\nrevocation of the assignment of the person as a designated transplant\nofficer.\n\nA designated transplant officer shall not participate in any of the medical\n(5)\nprocedures involved in the removal of tissue from, or transplant of tissue into,\nthe body of a person to whom Parts III, IV and V apply.\n\n\f13\n\nPART III\n\nDONATION OF TISSUE BY ADULTS\n\nDonation of regenerative tissue by adults\n\n7.(1)\n\nSubject to this Act, a person\n\n(a)\n\n(b)\n\nwho is at least 18 years of age and of full capacity; or\n\nwho, if he is a minor, is married or is a parent\n\nmay, in consideration of medical advice given to him by a medical practitioner\nin writing signed by him in the presence of a designated transplant officer, consent\nto the removal of regenerative tissue specified in the consent for the purposes\nspecified in subsection (2).\n\n(2)\n\nThe purposes referred to in subsection (1) are\n\n(a)\n\nthe transplantation of the tissue into the body of another living person;\nand\n\n(b)\n\nany other therapeutic, medical or scientific purpose.\n\nA donor may, at any time before the removal of the regenerative tissue to\n\n(3)\nwhich the consent applies, withdraw his consent orally or in writing.\n\nThe designated transplant officer shall, before removal of the regenerative\n\n(4)\ntissue, certify in the form set out as Form A in the Second Schedule, that\n\n(a)\n\n(b)\n\nall  requirements  referred  to  in  subsections  (1)  and  (2)  have  been\ncomplied with; and\n\nhe explained to the donor the implications of removal of regenerative\ntissue from the donor’s body and the donor consented to the removal\nof the tissue.\n\n\f14\n\nEffect of consent under section 7\n\nA subsisting consent under section 7(1) and the certification under\n8.\nsection 7(4), shall be sufficient authority for a medical practitioner to refer the\ncase to the transplant team for transplantation of tissue.\n\nDonation of non-regenerative tissue by adults\n\nA person described in section 7(1) may, in writing signed by him in\n9.(1)\nthe presence of a designated transplant officer, consent to the removal of non-\nregenerative tissue from his body after the expiration of a period of at least 24\nhours  from  the  time  at  which  the  consent  is  signed,  for  the  purpose  of  the\ntransplantation of the tissue into the body of another living person.\n\nA person who has given consent referred to in subsection (1) may, at any\n(2)\ntime  before  the  removal  of  the  non-regenerative  tissue  to  which  the  consent\napplies, withdraw his consent orally or in writing.\n\nEvery  designated  transplant  officer  shall,  before  removal  of  non-\n(3)\nregenerative  tissue,  certify  in  the  form  set  out  as  Form  A  in  the  Second\nSchedule that\n\n(a)\n\n(b)\n\nall requirements referred to in subsection (1) have been complied with;\n\nhe  explained  to  the  donor  the  implications  of  removal  of  the  non-\nregenerative tissue from the donor’s body; and\n\n(c)\n\nthe donor clearly stated that he understood the implications.\n\nEffect of consent under section 9\n\n10.\nA subsisting consent under section 9(1) and certification under section\n9(3), shall be sufficient authority for a medical practitioner to refer the case to\nthe transplant team within 2 weeks of the date at which the consent was given.\n\n\f15\n\nPART IV\n\nDONATION OF TISSUE BY MINORS\n\nProhibition of removal of non-regenerative tissue\n\n11.\nthe removal of non-regenerative tissue from the body of a living minor for\n\nSubject to sections 12 and 14, no person may remove or consent to\n\n(a)\n\nthe purpose of transplantation of such non-regenerative tissue into the\nbody of another living person; or\n\n(b)\n\nuse for any other therapeutic, medical or scientific purpose.\n\nRemoval of regenerative tissue where minor understands\n\nA parent or guardian of a minor may consent in writing to the removal\n12.(1)\nof regenerative tissue specified in the consent given by the parent or guardian\nfrom the body of the minor for the purpose of transplantation into the body of a\nbrother, sister or parent of the minor, where\n\n(a)\n\n(b)\n\n(c)\n\nthe parent or guardian has obtained advice from a medical practitioner,\nother  than  the  medical  practitioner  tasked  to  transplant  the  tissue,\nregarding the nature and effect of the removal of the tissue and the\nnature of the transplantation;\n\nthe minor has the mental capacity to understand the nature and effect\nof removal and the nature of the transplantation; and\n\nthe minor has consented to the removal of the regenerative tissue for\nthe purpose of its transplantation into the body of the person receiving\nthe tissue.\n\nThe consent referred to in subsection (1) shall be in the form set out as\n\n(2)\nForm B in the Second Schedule.\n\n\f16\n\n(3)\nA person who has given consent referred to in subsection (1) may, at any\ntime before the removal of the regenerative tissue to which the consent applies,\nwithdraw his consent orally or in writing.\n\nIn this section, reference to a parent or guardian of a minor does not include\n\n(4)\na person standing in loco parentis to the minor.\n\nThe designated transplant officer shall, before the removal of tissue by a\n(5)\nmedical practitioner, certify in the form set out as Form C in the Second Schedule\nthat\n\n(a)\n\n(b)\n\n(c)\n\nall requirements referred to in subsection (1) have been complied with;\n\nhe explained to the parent or guardian the implications of removal of\nthe regenerative tissue from the body of the minor; and\n\nthe parent or guardian understood the implications of the removal of\nregenerative  tissue  from  the  body  of  the  minor  and  the  minor  has\nconsented to the removal.\n\nEffect of consent under section 12\n\n13.\n\nThe consent given by\n\n(a)\n\n(b)\n\n(c)\n\nthe parent or guardian of the minor;\n\nthe minor under section 12(1)(c); and\n\nthe certification given under section 12(5)\n\nshall be sufficient authority for a transplant team to remove the regenerative tissue\nfrom the body of the minor, unless consent of the parent or guardian or consent\nof the minor has been withdrawn at any time prior to the removal.\n\nRemoval of regenerative tissue where minor does not have the capacity\nto understand the procedure or give consent to it\n\nA parent or guardian of a minor may consent in writing to the removal\n14.(1)\nof regenerative tissue specified in the consent from the body of the minor for the\n\n\f17\n\npurpose of transplantation into the body of a brother, sister or parent of the minor,\nwhere\n\n(a)\n\n(b)\n\n(c)\n\nadvice from a medical practitioner, other than the medical practitioner\ntasked to transplant the tissue, regarding the nature and effect of the\nremoval of the tissue and the nature of the transplantation is obtained;\n\nthe minor is not capable of understanding the nature and effect of the\nremoval of tissue and the nature of transplantation; and\n\na  medical  practitioner,  other  than  the  medical  practitioner  tasked  to\ntransplant  the  tissue,  certifies  in  writing  the  medical  reason  for  the\ntransplant.\n\nThe consent of the parent or guardian referred to in subsection (1) shall be\n(2)\nin the form set out as Form D in the Second Schedule and certification referred\nto  in  subsection  (1)(c)  shall  be  in  the  form  set  out  as  Form  E  in  the  Second\nSchedule.\n\nA person who has given a consent referred to in subsection (1) may, at any\n(3)\ntime before the removal of the regenerative tissue to which the consent applies,\nwithdraw his consent orally or in writing.\n\nIn this section, a reference to a parent or guardian of the minor does not\n\n(4)\ninclude a person standing in loco parentis to the minor.\n\nThe designated transplant officer shall, before the removal of tissue by the\n(5)\nmedical  practitioner,  certify  in  the  form  set  out  as  Form  F  in  the  Second\nSchedule that\n\n(a)\n\n(b)\n\n(c)\n\nall the requirements referred to in subsection (1) have been complied\nwith;\n\nhe explained to the parent or guardian of the minor the implications of\nremoval of regenerative tissue from the body of the minor; and\n\nthe  parent  or  guardian  clearly  understood  the  implications  of  the\nremoval of regenerative tissue from the body of the minor.\n\n\f18\n\nEffect of consent under section 14\n\nA subsisting consent given by the parent or guardian of the minor and\n15.\nthe  certification  by  the  medical  practitioner  under  section  12(1)(c)  and  the\ncertification under section 12(5), shall be sufficient authority for the transplant\nteam to remove the regenerative tissue from the body of the minor.\n\nRemoval of tissue from and transplantation of tissue into a living\nperson\n\n16.(1)\nfrom his body or to the transplantation of regenerative tissue into his body if\n\nA person may consent in writing to the removal of regenerative tissue\n\n(a)\n\n(b)\n\nadvice from a medical practitioner, other than the medical practitioner\ntasked to remove or transplant the tissue, as the case may be, regarding\nthe nature and effect of the removal of the tissue and the nature and\neffect of the transplantation is obtained; and\n\na  medical  practitioner,  other  than  the  medical  practitioner  tasked  to\nremove  or  to  transplant  the  tissue,  as  the  case  may  be,  certifies  in\nwriting the medical reason for the removal or transplant.\n\nThe certificate of the medical practitioner referred to in subsection (1)(b)\n\n(2)\nshall be in the form set out as Form G in the Second Schedule.\n\nWithdrawal of consent\n\n17.\nas Form H in the Second Schedule.\n\nConsent given under this Act may be withdrawn in the form set out\n\n\f19\n\nPART V\n\nDONATION OF TISSUE AFTER DEATH\n\nDefinitions\n\n18.(1)\n\nIn this Part,\n\n“subject” means, in relation to tissue transplantation, the body of a person who\n\nhas died; and\n\n“consent”  means,  for  the  purposes  of  sections  19  and  20,  consent  shall  be  in\n\nwriting and\n\n(a)\n\n(b)\n\n(c)\n\nsigned by the subject in the presence of at least one witness who attests\nthe signature;\n\nsigned at the direction of the subject, in his presence and in the presence\nof at least one witness who attests the signature; or\n\ncontained  in  a  will  of  the  subject  made  in  accordance  with  the\nSuccession Act, Cap. 249.\n\nRemoval and use of tissue after death\n\n19.\nSubject to sections 20 and 23, a designated transplant officer may, in\nthe form set out as Form I in the Second Schedule, authorize for the purposes of\nthis section, the removal of tissue from the subject, for\n\n(a)\n\n(b)\n\nthe transplantation of the tissue into the body of a living person; or\n\nthe  use  of  the  tissue  for  other  therapeutic,  medical  or  scientific\npurposes.\n\n\f20\n\nConditions under which designated transplant officer may exercise\nauthority\n\n20.(1)\nThe authorization referred to in section 19 shall only be given where,\nafter making such inquiries as are reasonable in the circumstances, a designated\ntransplant officer\n\n(a)\n\n(b)\n\nis satisfied that the subject during his lifetime expressed the wish for,\nor consented to the removal of tissue from his body after his death, for\na purpose referred to in section 19 and had not withdrawn the wish or\nthe consent; or\n\nhas no reason to believe that the subject has expressed an objection to\nthe removal of tissue from his body after his death for a purpose referred\nto in section 19 and the designated transplant officer is satisfied that\nthe next of kin of the deceased person consents to the removal of tissue\nfrom the body of the deceased person for a purpose referred to in section\n19.\n\nThe authorization of a designated transplant officer under section 19 shall\n(2)\nbe restricted by the expressed terms of the wishes or consent of the deceased\nperson, or the consent of his next of kin, as the case may be, both as to the tissue\nwhich may be removed and as to the purpose or use of such tissue.\n\nThe next of kin of a person may make it known to a designated transplant\n(3)\nofficer at any time when the person is unconscious and before death that the next\nof kin consents to the removal, after death of the person, of tissue from the body\nof the person for a purpose referred to in section 19; but the designated transplant\nofficer shall not act on such an indication if the person recovers consciousness.\n\nRemoval of tissue only after death\n\n21.\nuntil death has occurred.\n\nNo tissue may be removed from the body of the donor under this Part\n\n\f21\n\nWhen death occurs\n\n22.(1)\n\nFor the purposes of this Part, a person is dead when there has occurred\n\n(a)\n\nirreversible cessation of circulation of blood in the body of that person;\nor\n\n(b)\n\nirreversible cessation of all functions of the brain stem of that person.\n\nDeath shall be determined by 2 medical practitioners on the staff of the\n\n(2)\nrelevant hospital, in accordance with the prescribed criteria, except that\n\n(a)\n\n(b)\n\n(c)\n\nno medical practitioner who has a familial or professional relationship\nwith the proposed recipient shall take any part in the determination of\nthe fact of the death of the donor of the tissue;\n\nno  medical  practitioner  who  had  taken  part  in  the  determination  of\ndeath under paragraph (a) shall participate in the transplantation of the\ntissue to the recipient; and\n\nif  the  tissue  is  to  be  removed  for  therapeutic  purposes,  no  medical\npractitioner  who  is  due  to  remove  or  transplant  the  tissue,  may\ndetermine the occurrence of death or may be part of any transplant team\nby whom, or process by which, death is determined.\n\nConcurrence of coroner\n\n23.(1)\nWhere a designated transplant officer has reason to believe that the\ncircumstances applicable to the death of a person are such that a coroner has\njurisdiction to hold an inquest into the manner and cause of death of the person\nunder the Coroner’s Act, Cap. 113, the designated transplant officer shall not\nauthorize the removal of tissue from the body of the deceased person, unless the\ncoroner has stated that he has no objection to the removal.\n\nSubsection (1) does not apply where the coroner, after the death of a person\n(2)\nstates that he has no objection to the removal of tissue from the body of the person.\n\n\f22\n\n(3)\n\nA statement by a coroner under this section shall be\n\n(a)\n\n(b)\n\nin writing; and\n\nsubject to such conditions as are specified in the statement.\n\nPART VI\n\nPROHIBITION ON TRADING IN HUMAN TISSUE\n\nTrade in human tissue prohibited\n\n24.(1)\nof a donor for the purposes of trading that tissue for valuable consideration.\n\nNo person shall remove or cause tissue to be removed from the body\n\nSubject to this section, any contract or arrangement under which a person\n(2)\nagrees, for valuable consideration, whether given or to be given to himself or to\nanother person, for the sale or supply of any tissue from his body or from the\nbody of another person, whether before or after his death or the death of the other\nperson, as the case may be, is void.\n\nA  person  who  contravenes  subsection  (1)  or  enters  into  a  contract  or\n(3)\narrangement of the kind referred to in subsection (2), is guilty of an offence and\nis liable on summary conviction to a fine of $50 000 or imprisonment for a term\nof 2 years or to both.\n\nAdvertisement relating to buying or selling of tissue prohibited\n\n25.(1)\nto the buying or selling of any tissue from the body of a person.\n\nNo person shall issue or cause to be issued any advertisement relating\n\nAny person who contravenes subsection (1) is guilty of an offence and is\n(2)\nliable on summary conviction to a fine of $50 000 or to imprisonment for a term\nof 2 years or to both.\n\n\f23\n\nPART VII\n\nMISCELLANEOUS\n\nExemption from liability\n\nNo  personal  liability  attaches  to  any  medical  practitioner  or  other\n26.\nperson for anything done in good faith in the exercise of his authority under this\nAct.\n\nLimitation on application of Act\n\n27.\n\nNothing in this Act applies to,\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe removal of any tissue from the body of a living person in the course\nof a procedure or operation carried out in the interest of the health of\nthe person by a medical practitioner with the consent given by or on\nbehalf of the person or in circumstances necessary for the preservation\nof the life of a person by the use of any tissue so removed;\n\nthe removal of any tissue from the body of a deceased person during\nthe course of a post-mortem examination;\n\nthe embalming of the body of a deceased person; or\n\nthe  preparation,  including  the  restoration  of  any  disfigurement  or\nmutilation,  of  the  body  of  a  deceased  person  for  the  purpose  of\ninterment or cremation.\n\nOffences in relation to removal of tissue\n\n28.(1)\nbody of a deceased person, except in accordance with this Act.\n\nNo person shall remove or cause to be removed any tissue from the\n\nNo person shall, except for a purpose specified in this Act, remove or cause\n\n(2)\nto be removed any tissue from the body of a living person.\n\n\f24\n\n(3)\nAny person who contravenes this section, is guilty of an offence and is\nliable on summary conviction to a fine of $100 000 or to imprisonment for a term\nof 5 years or to both.\n\nOffences in relation to removal of tissue for gain or profit\n\nAny person who removes tissue from the body of a donor for valuable\n29.(1)\nconsideration is guilty of an offence and is liable on conviction on indictment to\na fine of $500 000 or to imprisonment for a term of 7 years or to both.\n\nWhere a designated transplant officer is convicted under subsection (1), in\n(2)\naddition to the penalty imposed, his appointment as designated transplant officer\nshall be revoked.\n\nDisclosure of information\n\nNotwithstanding  any  other  law  to  the  contrary  and  subject  to  this\n30.(1)\nsection, no person shall, by any means whatsoever, make known to the public\nthe identity of any other person\n\n(a)\n\n(b)\n\nfrom  whose  body  any  tissue  has  been  removed  for  the  purpose  of\ntransplantation;\n\nwith respect to whom a consent or authority has been given under this\nAct; or\n\n(c)\n\ninto whose body any tissue has been, or is being transplanted.\n\n(2)\n\nSubsection (1), shall not apply in relation to any information disclosed\n\n(a)\n\n(b)\n\n(c)\n\nin pursuance of an order of a court;\n\nfor the purposes of continued care or bona fide medical research; or\n\nwith the consent of the person to whom the information relates.\n\nAny person who contravenes subsection (1), is guilty of an offence and is\n(3)\nliable on summary conviction to a fine of $50 000 or to imprisonment for a term\nof 2 years or to both.\n\n\f25\n\nRegulations\n\n31.\n\nThe Minister may make regulations\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nfor matters that are authorized or required by this Act to be prescribed;\n\nfor the screening and testing of tissue before and after removal from a\nbody;\n\nfor the transportation, storage and handling of tissue;\n\nfor the conditions subject to which transplantation of tissue shall be\ncarried out;\n\nfor the criteria for determining the irreversible cessation of all functions\nof the brain stem of a person;\n\nfor the allocation of tissue; and\n\ngenerally for matters that are necessary or convenient for carrying out\nthe purposes of or giving effect to this Act.\n\nAmendment of Schedules\n\n32.\n\nThe Minister may by order amend the Schedules to this Act.\n\nCommencement\n\n33.\nProclamation.\n\nThis  Act  shall  come  into  operation  on  a  date  to  be  fixed  by\n\n\f26\n\nFIRST SCHEDULE\n\nCONSTITUTION OF NATIONAL TRANSPLANTATION COUNCIL\n\n(Section 4(2))\n\n1.\npersons who shall be appointed by the Minister:\n\nThe National Transplantation Council shall comprise the following\n\n(a)\n\n(b)\n\n(c)\n\nthe Chief Medical Officer, ex officio;\n\nthe Director of Medical Services at the Queen Elizabeth Hospital, ex\nofficio;\n\na medical practitioner with knowledge of human tissue transplantation,\non  the  nomination  of  the  Barbados  Association  of  Medical\nPractitioners;\n\n(d)\n\nan individual who is qualified or otherwise experienced in bioethics;\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\na nurse, on the nomination of the Barbados Association of Registered\nNurses;\n\nan  attorney-at-law  of  at  least  10  years  standing  with  medico-legal\nknowledge, on the nomination of the Barbados Bar Association;\n\na  nominee  of  a  Non-Governmental  Organization  with  an  interest  in\nhuman tissue transplantation; and\n\na  beneficiary  of  human  tissue  transplantation  or  a  donor  of  human\ntissue.\n\n2.(1)\namongst the members of the Council.\n\nThe Minister shall appoint a Chairman and a Deputy Chairman from\n\n(2)\nThe Permanent Secretary in the Ministry responsible for Health may assign\na  public  officer  from  that  Ministry  to  perform  the  duties  of  secretary  to  the\nCouncil.\n\n\f27\n\n3.\nhold office for a term of 3 years and shall be eligible for reappointment.\n\nA person appointed under subparagraph (c) to (g) of paragraph 1 shall\n\n4.\nthe approval of the Cabinet.\n\nNo remuneration is payable to the members of the Council except with\n\n5.(1)\nthe Minister.\n\nThe Chairman of the Council may resign by letter in writing sent to\n\nAll  other  members  of  the  Council,  except  the  Chairman  may  resign  by\n\n(2)\nletter in writing sent to the Chairman.\n\n6.\n\nSubject to this Schedule, the Council shall regulate its own procedure.\n\n7.\nor expedient for the transaction of its business.\n\nThe Council shall meet at such times and places as may be necessary\n\nThe Chairman may at any time call a special meeting of the Council,\n8.\nand shall call such a meeting if required so to do by 5 members of the Council.\n\n9.\nshall preside.\n\nIn the absence of the Chairman from a meeting, the Deputy Chairman\n\n10.\n\nA majority of the members of the Council shall constitute a quorum.\n\n\f28\n\nL.R.O. 1998SECOND SCHEDULE(Section 7(4) and 9(3))FORMSHuman Tissue Transplant Act, 2024(Act 2024-     )FORM  AI, , certify that, is an adult (a)who is of sound mind;(b)who has been given relevant medical advice by a medical practitioner with which advicehe/she agrees; and(c)who has consented in writing to the removal from his/her body of theundermentioned tissue for the purpose of the transplantation of the tissue intothe body of another living person for therapeutic/medical/scientific purposes:Description of tissue*:Bone Marrow  Cornea Kidney LiverOther (please specify):*Select as appropriateName of Designated Transplant Oﬃ  cerName of Donor\f29\n\n L.R.O. 1998I further certify that I have explained tothe implications of the removal of the tissue from his/her body and I am of theopinion that he/she understood the implications of the removal.Second Schedule - (Cont'd)Signature of Designated Transplant Oﬃ  cerDate/Month/YearRegistration No. Name of Donor\f30\n\nL.R.O. 1998(Section 12(2))Human Tissue Transplant Act, 2024(Act 2024-     )FORM BI, , parent/guardianof (a minor), aged  years, consentto the removal of the undermentioned tissue from his/her body for the purpose oftransplantation into the body ofwho is his/her brother/sister/mother/fatherDescription of tissue*:Bone Marrow  Cornea Kidney LiverOther (please specify):* Select as appropriateFull NameName of DonorName of RecipientSecond Schedule - (Cont'd)\f31\n\n L.R.O. 1998I certify that: I have obtained advice from a medical practitioner, other than the practitioner due to transplant the tissue, regarding the nature and eﬀ ect of the removal of the tissue and nature of the transplantation.  has the mental capacity tounderstand the nature and eﬀ ect of the removal and nature of the transplantation and has agreed to the removal of the tissue for the purpose of its transplantation into the body of who is his/her brother/sister/mother/father.Name of DonorName of RecipientSignature of Parent/GuardianDate/Month/YearSecond Schedule - (Cont'd)\f32\n\nL.R.O. 1998(Section 12(5))Human Tissue Transplant Act, 2024(Act 2024-     )FORM CI, , certify that , parent/guardian of  (a minor), aged  years, hasconsented to the removal of the undermentioned tissue from the body of the minorfor the purpose of transplantation into the body ofwho is the minor’s brother/sister/mother/father.Description of tissue*:Bone Marrow  Cornea Kidney LiverOther (please specify):* Select as appropriateName of Designated Transplant Oﬃ  cerName of DonorName of RecipientName of Parent/GuardianSecond Schedule - (Cont'd)\f33\n\n L.R.O. 1998I further certify that:(a) the parent/guardian of the minor has obtained medical advice from a medical practitioner, other than the practitioner due to transplant the tissue, regarding the nature and eﬀ ect of the removal of the tissue and the nature of the transplantation.(b) the minor has the mental capacity to understand the nature and effect of the removal and the nature of the transplantation and has agreed to the removal of the tissue for the purpose of its transplantation into the body of the person receiving the tissue.(c) I explained to the parent/guardian the implications of the removal of the  tissue from the body of the minor and the parent/guardian appeared to understand the implications of the removal.Signature of Designated Transplant Oﬃ  cerDate/Month/YearSecond Schedule - (Cont'd)Registration No. \f34\n\nL.R.O. 1998(Section 14(2))Human Tissue Transplant Act, 2024(Act 2024-     )FORM DI, , parent/guardian of (a minor), agedyears, consent to the removal of the undermentioned tissue from his/her body for the  purpose of transplantation into the body ofwho is his/her brother/sister/mother/father.Description of tissue*: Bone Marrow  Cornea Kidney LiverOther (please specify):* Select as appropriateName of DonorName of RecipientSecond Schedule - (Cont'd)Name of Parent/Guardian\f35\n\n L.R.O. 1998I certify that:(a) I have obtained advice from a medical practitioner, other than the practitioner due to transplant the tissue, regarding the nature and eﬀ ect of the removal of the tissue and nature of the transplantation.(b)  does not have the mental capacity to understand the nature and eﬀ ect of the removal and the nature of the transplantation.(c) a medical practitioner, other than the medical practitioner due to transplant the tissue, has certified in writing the medical reason for the transplant into the body of            .Signature of Parent/GuardianDate/Month/YearName of DonorName of RecipientSecond Schedule - (Cont'd)Signature of WitnessName of WitnessDate/Month/Year\f36\n\nL.R.O. 1998(Section 14(2))Human Tissue Transplant Act, 2024(Act 2024-     )FORM EI, , medical practitioner,herby certify that unless the undermentioned tissue, which is the same tissue speciﬁ ed inthe consent of  parent/guardian of (a minor), aged  years is transplantedinto the body of  , the  brother/sister/mother/father of the minor, his/her (the recipient's) medical condition is likely to deteriorate. I further certify (a) that the recipient has been diagnosed with or is suﬀ ering from ;  and(b) that I will not participate in any of the medical procedures involved in transplantation of thetissue.Full NameName of RecipientName of DonorSecond Schedule - (Cont'd)Name of Parent/GuardianSignature of Medical PractitionerDate/Month/YearRegistration No.\f37\n\nL.R.O. 1998Second Schedule - (Cont'd)(Section 14(5))Human Tissue Transplant Act, 2024(Act 2024-     )FORM FI, , certify that , parent/guardian of  (a minor), aged  years, hasconsented to the removal of the undermentioned tissue from the body of the minor for the  purpose of transplantation into the body ofthe minor’s brother/sister/mother/father.Description of tissue*: Bone Marrow Cornea Kidney LiverOther (please specify):* Select as appropriateName of Designated Transplant Oﬃ  cerName of DonorName of RecipientName of Parent/Guardian\f38\n\n L.R.O. 1998I further certify that:(a) the parent/guardian of the minor has obtained medical advice from a medical practitioner, other than the practitioner due to transplant the tissue, regarding the nature and eﬀ ect of theremoval of the tissue and the nature of the transplantation.(b) the minor does not have the mental capacity to understand the nature and eﬀ ect of theremoval of the tissue and the nature of the transplantation.(c) a medical practitioner, other than the medical practitioner due to transplant the tissue, has certified in writing the medical reason for the transplant into the body of  .(d) I explained to the parent/guardian the implications of the removal of the tissue from the body of the minor and the parent/guardian appeared to understand the implications  of the removal.Signature of Designated Transplant Oﬃ  cerDate/Month/YearName of RecipientSecond Schedule - (Cont'd)Registration No.\f39\n\nL.R.O. 1998(Section 16(2))Human Tissue Transplant Act, 2024(Act 2024-     )FORM GI, , medical practitioner,herby certify that unless the undermentioned tissue, which is the same tissue speciﬁ ed inthe consent of  is transplanted into the body of  , his/her (the recipient's)  medical condition is likely to deteriorate. I further certify (a) that the recipient has been diagnosed with or is suﬀ ering from ;  and(b) that I will not participate in any of the medical procedures involved in transplantation of thetissue.Full NameName of RecipientSecond Schedule - (Cont'd)Name of DonorSignature of Medical PractitionerDate/Month/YearRegistration No.\f40\n\nL.R.O. 1998(Section 17)Human Tissue Transplant Act, 2024(Act 2024-     )FORM HI, , hereby withdrawmy consent given on the                    day of                    20          for removal/transplantation of regenerative/non-regenerative tissue from, or into my body/the body of (a minor) aged years.  Name of Donor/RecipientSignature of Donor/Parent/Guardian/RecipientDate/Month/YearSecond Schedule - (Cont'd)\f41\n\nL.R.O. 1998(Section 19)Human Tissue Transplant Act, 2024(Act 2024-     )FORM II,  , hereby authorize the removalof the undermentioned tissue from the body of ,deceased, for transplantation into the body of a living person/use for therapeutic/medical/scientiﬁ cpurposes:Description of tissue*: Bone Marrow Cornea Kidney LiverOther (please specify):* Select as appropriateName of Designated Transplant Oﬃ  cerFull NameSecond Schedule - (Cont'd)\f42\n\n L.R.O. 1998I certify that I have made enquiries as are reasonable in the circumstances and:*select as appropriate am satisﬁ ed that the deceased during his/her lifetime in writing or in his last will andtestament made under the Succession Act, Cap. 249 expressed the wish for, or consented to,the removal of tissue from his/her body after death for any purpose or usereferred to above and had not withdrawn the wish or revoked the consent. have no reason to believe that the deceased had expressed an objection to the removal of tissue from his/her body after death for any purpose or use referred to above and I amsatisﬁ ed that the next of kin of the deceased consents to the removal of tissue from the body of the deceased for any such purpose or use. I hereby certify that the donor and recipient have been examined by a registered medical practitioner and the parent/guardian of the minor has consented and the transplantation of tissue has been carried out.Signature of Designated Transplant Oﬃ  cerDate/Month/YearSecond Schedule - (Concl'd)Registration No. Signature of Medical Practitioner giving adviceDate/Month/Year\f43\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}