{
  "bill_id": 80,
  "slug": "vesting-in-crown-lands-at-bay-street-st-michael",
  "title": "Vesting in Crown Lands at Bay Street, St. Michael",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/dd2349a3e093ba34f6f28c846af226ad.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-05-13",
  "first_reading": "2015-05-20",
  "second_reading": null,
  "gazette_date": null,
  "passed_date": "2015-05-20",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, approve the vesting in the Barbados Tourism Investment Inc. of the parcel of land the property of the Crown situate at Bay Street in the parish of Saint Michael in this Island, known as the Old Fish Market Site and more particularly described in the Schedule to this Resolution for tourism development.\nAPPROVED by the House of Assembly this day of , Two Thousand and Fifteen.\nSpeaker\nAPPROVED by the Senate this\nday of\n, Two\nThousand and Fifteen.\nPresident\nSCHEDULE\nALL THAT land situate at Bay Street in the parish of Saint Michael in this Island containing by admeasurement 1,235.9 square metres or thereabouts Abutting and Bounding on a road called Bay Street leading to the Garrison in one direction and to Bridgetown in another direction on lands now or late of Christopher Codrington on other lands of the Government of Barbados (beach) on lands of Hakkim Co. Ltd., or however else the same may abut and bound as shown and delineated on Plan certified on the 24\" day of May, 2000 by Andrew P. Weekes, Land Surveyor and recorded in the Lands and Surveys Department as Plan No. 477/2000.\nWw\nADDENDUM\nas\nOn the 25\" day of July, 1996, the Cabinet of Barbados agreed to vest 1,235.9 square metres of land situate at Bay Street in the parish of St. Michael, known the Old Fish Market Site, in the Barbados Tourism Investment Inc.\nOn the 22™ day of February, 2007, the Cabinet of Barbados noted the difficulties experienced by the Ministry of Housing and Lands in locating the title deeds for two (2) parcels of land forming part of the Old Fish Market Site on Bay Street which hindered the progress of vesting the land at the entire site in Barbados Tourism Investment Inc.\nOn the 12\" February, 2009, the Cabinet of Barbados agreed to vest 1,984.4 square metres of land inclusive of accreted lands at the said site in the Crown by way of an Act of Parliament. The Bay Street (Vesting) Bill, 2009, was passed by the Parliament of Barbados and the Governor-General gave his assent on 20\" March, 2009. The parcel of land was vested in the Crown by the Bay Street (Vesting) Act, 2009-4 on the 26\" March, 2009.\nThe land more particularly described in the Schedule does not include accreted land.\nthe accreted land.\nIn accordance with the provisions of section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is now sought for the vesting in the Barbados Tourism Investment Inc. of land more particularly described in the Schedule to this Resolution for tourism development.\n>urvey Order No: Correspondence No: 15/2000\nBarbados\n(Beach)\n;\nLands\nGovernment\nLANDS AND) SURVEYS DEPARTMENT\nHakkim\nOther\na\nBarbados\nPLAN OF LAND bordered green\nat BAY STREET, ST. MICHAEL containing 1235.9 sq.m.\nsurveyed for MINISTRY OF HOUSING AND LANDS\nCertified 24th. May, | 2000 Antonie Y Jedde33 Andrew P. Weekes Land Surveyor\nParish Of: St Michael Locality: Bay Street\nGRID NORTH\nSCALE Distances 1: 500 are in metres Bearings are referred to Grid North derived from DLS Control TS68 & TS6! 9\nFor Lands and Surveys Dept only 47 rare\n"
}