{
  "bill_id": 810,
  "slug": "resolution-re-sustainability-linked-loan-syndicated-facility-under-special-loans-2-act-cap-105",
  "title": "Resolution re: Sustainability Linked Loan Syndicated Facility under Special Loans 2  Act Cap. 105",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/acd71893306f5eed8f595fe88e2c6bfb.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2024-11-20",
  "first_reading": "2024-11-22",
  "gazette_date": null,
  "markdown": "RESOLUTION NO.\n\n2024-11-04\n\nPARLIAMENT\n\nWHEREAS  by  virtue  of  section  2  of  the  Special  Loans Act,  Cap.  105,  the\n\nGovernment is authorised from time to time to borrow from another government, any bank,\n\ncorporation,  company  or  other  institutions  sums  of  money  not  exceeding  in  the  aggregate\n\nBBD2 500 000 000 on such terms as may be agreed upon between the Government and the\n\nlender of any such sum of money;\n\nAND  WHEREAS  by  section  3  of  the  said  Act  it  is  provided  that  any\n\nmoney  borrowed  under  the  authority  of  the  Act  shall  be  appropriated  and  applied  to\n\nsuch  purposes  as  Parliament  may  approve  by  resolution  and  that  such  money  and  any\n\ninterest  payable  thereon  is  charged  upon  the  general  revenues  and  assets  of  Barbados;\n\nAND WHEREAS the Government considers it necessary to borrow the sum\n\nof approximately BBD600 million from CIBC Caribbean Bank (Barbados) Limited, Scotiabank\n\n(Barbados) Limited and RBC Royal Bank (Barbados) Limited via a Sustainability-Linked Loan\n\nSyndicated Facility, arranged by CIBC Caribbean Bank (Barbados) Limited, the proceeds of\n\nwhich will be used to buy back an approximate equivalent amount in high cost Government of\n\nBarbados debt;\n\n\f2\n\nAND WHEREAS the said sum of approximately BBD600 million is borrowed\n\non  the  terms  and  conditions  contained  in  a  Sustainability-Linked  Loan  Syndicated  Facility\n\nAgreement, the main provisions of which are set out in the Schedule;\n\nAND WHEREAS the said sum of approximately BBD600 million borrowed\n\nfrom CIBC Caribbean Bank (Barbados) Limited, Scotiabank (Barbados) Limited and RBC Royal\n\nBank (Barbados) Limited is within the authorised borrowing limit given to the Government under\n\nsection 2 of the said Act;\n\nBE IT RESOLVED therefore that Parliament approve the borrowing of the sum\n\nof  approximately  BBD600  million  from  CIBC  Caribbean  Bank  (Barbados)  Limited,\n\nScotiabank  (Barbados) Limited and RBC Royal Bank (Barbados) Limited on the terms and conditions\n\ncontained in a Sustainability-Linked Loan Syndicated Facility Agreement, the main provisions of\n\nwhich are set out in the Schedule, the proceeds of which will be used to buy back an approximate\n\nequivalent amount in high cost Government of Barbados debt.\n\n\f3\n\nAPPROVED by the House of Assembly this\n\nday of\n\n, Two\n\nThousand and twenty-four.\n\nSpeaker\n\nAPPROVED by the Senate this\n\nday of\n\n, Two\n\nThousand and twenty-four.\n\nPresident\n\n\f4\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nFacility:\n\nFixed Rate Sustainability-Linked Loan\n\nFacility Arranger:\n\nCIBC Caribbean Bank (Barbados) Limited\n\nLenders:\n\nAmount:\n\nCurrency\n\nInterest rate:\n\nSustainability-Linked\nAmount:\n\nCIBC  Caribbean  Bank  (Barbados)  Limited  BBD360,000,000,  Scotiabank\n(Barbados) Limited and RBC Royal Bank (Barbados) Limited to sub participate\nin the facility, together up to BBD240,000,000.\n\nUp to BBD600,000,000, subject to reduction by one interest period and 14\ndays as required by Guarantors for payout, estimated at BBD594,000,000.\n\nBBD\n\n3.25% per annum (Fixed)\n\nFor any period commencing after the First Amount: SPT Observation Date,\nif the Borrower fails to meet the Sustainability Performance Targets by the\nimmediately preceding SPT Observation Date an amount payable in arrear\nequal to the product of:\n\n(a)  the  outstanding  BBD  Loan  Principal  Amount  at  the  start  of  each\n\nLoan Interest Period;\n\n(b)  the Sustainability-Linked Rate; and\n\n(c)  the BBD Loan Day Count Fraction.\n\n\f5\n\nSCHEDULE - (Concl'd)\n\nTERMS AND CONDITIONS\n\nSustainability-Linked Rate:\n\n0.2% per annum until 2032, then 0.1% per annum until maturity\n\nTerm:\n\nGrace period:\n\nMaturity\n\nRepayment:\n\nInterest:\n\nFees:\n\nClosing Cost:\n\nTaxes:\n\n20 years\n\n5 years and 3 months\n\nOctober, 2044\n\n1.67% of Disbursed Amount each quarter.\nApproximately,  60  quarterly  payments  of  BBD9,900,000,  commencing\nJanuary 31st, 2030.\n\nPayable quarterly in arrears, commencing January 31st, 2025.\n\nArrangement  and  Agency  fees  in  accordance  with  the  Fee  Letters,\napproximately 0.8% of the facility amount upfront along with BBD60,000\nper annum, respectively.\n\nLegal fees, Second Party Opinion cost and Facility Agent fees, approximately\nUSD255,000, to be deducted from proceeds.\n\nSubject to customary exemptions, the Borrower shall pay amounts without\ndeduction or withholding for any taxes, except as required by applicable law\nand will gross up payments where any deduction or withholding is required\nby applicable law.\n\nNatural Disaster and Pandemic\nClause:\n\nYes\n\n\f6\n\nADDENDUM\n\nThis Resolution seeks the approval of Parliament for the borrowing of the sum of\n\napproximately  BBD600  million  from  CIBC  Caribbean  Bank  (Barbados)  Limited,  Scotiabank\n\n(Barbados) Limited and RBC Royal Bank (Barbados) Limited on the terms and conditions contained\n\nin a Sustainability-Linked Loan Syndicated Facility Agreement, the main provisions of which are\n\nset out in the Schedule the proceeds of which will be used to buy back an approximate equivalent\n\namount in high cost Government of Barbados debt.\n\nThe said sum is within the limit of the Special Loans Act, Cap. 105.\n\n"
}