{
  "bill_id": 813,
  "slug": "sustainable-fisheries-management-and-development-seafood-markets-and-businesses-bill-2024",
  "title": "Sustainable Fisheries Management and Development (Seafood Markets and Businesses) Bill, 2024",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/de1aeefd47ec4c06ac0ad192a0c31a32.pdf",
  "current_stage": "The Senate",
  "chamber": "House of Assembly",
  "notice_date": "2024-11-18",
  "first_reading": "2024-11-19",
  "gazette_date": "2024-11-25",
  "markdown": "2024-09-12\n\nOBJECTS AND REASONS\n\nThis Bill would provide for\n\n(a)\n\n(b)\n\na  regulatory  regime  for  the  management  and  operation  of  seafood\nmarkets and seafood businesses;\n\na regulatory system for the management of the seafood supply chain\nsector; and\n\n(c)\n\nrelated matters.\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\nPART II\n\nSEAFOOD MARKETS\n\nShort title\n\nInterpretation\n\nEstablishment of a seafood market\n\nRegister of seafood markets\n\nServices and fees\n\nSales in public seafood markets\n\nApplication for seafood market sellers’ licence\n\nPower to charge for the use of stalls, etc.\n\nAssaulting or obstructing an officer\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\n10.\n\nDisorderly behaviour in public seafood markets\n\n11.\n\nPower of security guard\n\n\f3\n\nPART III\n\nSEAFOOD BUSINESSES\n\n12.\n\nRegister of seafood businesses\n\n13.\n\nApplication for licence\n\n14.\n\nRequirement for SSCTVC: initial survey\n\n15.\n\nRequirement for SSCTVC: renewal survey\n\n16.\n\nPeriodic inspections\n\nPART IV\n\nPROCESSORS OF FISH AND OTHER SEAFOODS\n\n17.\n\nFish processors scheme\n\n18.\n\nThe purpose of the scheme\n\n19.\n\nRequirements for participation in the scheme\n\n20.\n\nNotification of the scheme to the Ministry of Finance\n\nPART V\n\nFISHING TRAWLING COMMERCIAL OPERATIONS\n\n21.\n\nNational register of fishing trawlers\n\n22.\n\nBarbados fishing trawler’s programme\n\n23.\n\nReasons for the programme\n\n\f4\n\n24.\n\nRequirements for participation in and benefiting from the programme\n\n25.\n\nForeign-registered fishing trawlers\n\n26.\n\nFishing trawler’s licence\n\n27.\n\nNo-trawl areas\n\n28.\n\nNo-trawl seasons\n\n29.\n\nFish trawling protection and management\n\n30.\n\nPenalty\n\nPART VI\n\nTRADITIONAL FISHERIES KNOWLEDGE COMMERCE\n\n31.\n\nAccess to traditional fisheries knowledge\n\n32.\n\nTraditional fisheries knowledge commercial enterprise programme\n\n33.\n\nScope of traditional fisheries knowledge commercial enterprise\nprogramme\n\nPART VII\n\nENFORCEMENT\n\n34.\n\nGeneral powers of authorised officers\n\n35.\n\nPowers of an authorized officer\n\n36.\n\nPower to seize and destroy tainted or unwholesome seafood\n\n\f5\n\nPART VIII\n\nMISCELLANEOUS\n\n37.\n\nApplication of international seafood safety standards\n\n38.\n\nSeafood event permit\n\n39.\n\nApplication for a seafood event permit\n\n40.\n\nSuspension, cancellation, or revocation of licences, permits, etc.\n\n41.\n\nRegulations\n\n42.\n\nFishing industry notices\n\n43.\n\nCodes of practice and guidelines\n\n44.\n\nAmendment of schedules\n\n45.\n\nPower to waive fees\n\nFIRST SCHEDULE\n\nApplication for Seafood Seller’s Licence\n\nSECOND SCHEDULE\n\nSeafood Supply-Chain Transparency Verification Certificate (SSCTVC)\n\nTHIRD SCHEDULE\n\nEndorsement of SSCTVC\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn Act to provide for\n\n(a)\n\n(b)\n\na  regulatory  regime  for  the  management  and  operation  of  seafood\nmarkets and seafood businesses;\n\na regulatory system for the management of the seafood supply chain\nsector; and\n\n(c)\n\nrelated matters.\n\n\fENACTED by the Parliament of Barbados as follows:\n\n8\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\nDevelopment (Seafood Markets and Businesses) Act, 2024.\n\nThis Act may be cited as the Sustainable Fisheries Management and\n\nInterpretation\n\n2.(1)\n\nIn this Act,\n\n“aquaculture”  has  the  meaning  assigned  to  it  by  the  Sustainable  Fisheries\n\nManagement and Development Act, 2024 (Act 2024-);\n\n“authorized officer” has the meaning assigned to it by the Sustainable Fisheries\n\nManagement and Development Act, 2024 (Act 2024-);\n\n“Chief Fisheries Officer” means the public officer appointed under section 3 of\n\nthe Public Service Act, Cap. 29;\n\n“cold store” means any premises or place used for keeping and preserving by a\nrefrigerating  process  any  fish  or  other  articles  intended  for  human\nconsumption;\n\n“fishery protection officer” has the meaning assigned to it by the Sustainable\n\nFisheries Management and Development Act, 2024 (Act 2024-);\n\n“fishing  industry  notice”  has  the  meaning  assigned  to  it  by  the  Sustainable\n\nFisheries Management and Development Act, 2024 (Act 2024-)\n\n“fishing trawler” means a factory vessel that catches and processes seafood on\n\nboard;\n\n\f9\n\n“fishing trawler’s licence” means a fishing trawler licence issued under section\n\n26;\n\n“mariculture”  has  the  meaning  assigned  to  it  by  the  Sustainable  Fisheries\n\nManagement and Development Act, 2024 (Act 2024-);\n\n“maritime law enforcement officer” means\n\n(a)\n\n(b)\n\na member of the Marine Police Unit of the Barbados Police Service;\nand\n\nan  officer  or  soldier  of  the  Barbados  Defence  Force  serving  as  a\nmember of the Barbados Coast Guard pursuant to section 208 of the\nDefence Act, Cap. 159;\n\n“marketable commodities” mean fish;\n\n“Minister” means the Minister responsible for Fisheries;\n\n“primary seafood processing” means physically altering the body of seafood for\n\nhuman consumption by the following methods:\n\n(a)\n\n(b)\n\n(c)\n\nremoving the heads and fins;\n\nscaling;\n\neviscerating or gutting;\n\n(d)\n\nskinning;\n\n(e)\n\nfilleting;\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\nde-boning;\n\nproducing cuts;\n\nremoving shells or cephalothoraxes; or\n\nany other similar method of primary seafood processing;\n\n“primary seafood processor” means a person or an organization that processes\n\nseafood using any of the primary seafood processing methods;\n\n\f10\n\n“SSCTVC” means seafood supply-chain transparency verification certificate\n\n“seafood” means\n\n(a)\n\n(b)\n\n(c)\n\nany marine, estuarine or freshwater fish;\n\nany other aquatic vertebrate animal, except crocodile;\n\nany aquatic invertebrate animal;\n\n(d)\n\nany product of animals referred to in paragraphs (a) to (c); or\n\n(e)\n\nany other food or class of food prescribed to be seafood for the purposes\nof this Act;\n\n“seafood business” means a business that\n\n(a)\n\n(b)\n\nis registered in accordance with the Companies Act, Cap. 308; and\n\nnot less than 90 per cent of its production involve the processing and\nhandling of seafood intended for human consumption;\n\n“seafood markets” mean public markets established for the sale of marketable\n\nseafood commodities;\n\n“seafood markets sellers’ licence” means a licence issued under section 7;\n\n“secondary seafood processing ”\n\n(a)\n\nmeans the modification of seafood for human consumption by\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(v)\n\nsmoking;\n\nsalting;\n\nfermenting;\n\nbreading;\n\nforming;\n\n(vi)\n\nbattering;\n\n(vii)\n\ncanning; or\n\n\f11\n\n(viii)\n\nany other similar method of secondary seafood processing; and\n\n(b)\n\nincludes the processing of seafood for\n\n(i)\n\nanimal feed;\n\n(ii)\n\nfertilizer;\n\n(iii)\n\nsilage;\n\n(iv)\n\nleather; and\n\n(v)\n\nany other non-human consumption purpose;\n\n“secondary seafood processor” means a person or an organization that processes\nseafood using any of the secondary seafood processing methods; and\n\n“traditional fisheries knowledge commerce” means any commercial enterprise\n\nthat exchanges traditional fisheries knowledge for payment.\n\nPART II\n\nSEAFOOD MARKETS\n\nEstablishment of a seafood market\n\n3.(1)\n\nThe Minister may\n\n(a)\n\nestablish, maintain, manage, and regulate public seafood markets for\nthe sale of marketable commodities; and\n\n(b)\n\nprovide for the convenient use of such seafood markets.\n\nRegister of seafood markets\n\n4.\nmarkets.\n\nThe Chief Fisheries Officer shall maintain a register of all seafood\n\n\f12\n\nServices and fees\n\nThe Minister may, by regulations, make provision with respect to the\n5.\nservices to be provided by seafood markets and prescribe fees for such services.\n\nSales in public seafood markets\n\n6.\n\nNo person shall sell marketable commodities in a public place\n\n(a)\n\n(b)\n\nexcept such place is established as a public seafood market; and\n\nunless the person is the holder of\n\n(i)\n\na  seafood  market  sellers’  licence  issued  by  the  Chief  Fisheries\nOfficer; and\n\n(ii)\n\na health certificate issued by the Chief Medical Officer.\n\nApplication for seafood market sellers’ licence\n\nAn  application  for  the  grant  of  a  licence  to  sell  marketable\n7.\ncommodities in a seafood market shall be submitted to the Chief Fisheries Officer\nin the form prescribed in the First Schedule and shall be accompanied by the\nprescribed application fee to be published by a fishing industry notice.\n\nPower to charge for the use of stalls, etc.\n\n8.(1)\nwho\n\n(a)\n\n(b)\n\n(c)\n\nThe Chief Fisheries Officer may impose a fee payable by a person\n\noccupies or uses any stall, stand, table, shed or place in a public seafood\nmarket;\n\nbrings into any market any marketable commodity or any article which\nis permitted to be sold therein; and\n\nuses any weighing or measuring instrument provided for use, and kept\nin any market.\n\n\f13\n\nThe fee referred to in subsection (1) shall be paid at such time and in such\n\n(2)\nmanner as may be prescribed by the Chief Fisheries Officer.\n\n(3)\nA fee due and owing under this section is a debt to the State and may be\nrecovered  by  the  Chief  Fisheries  Officer  in  summary  proceedings  before  the\nMagistrates’ Court.\n\nAssaulting or obstructing an officer\n\n9.\n\nA person who assaults or obstructs\n\n(a)\n\n(b)\n\n(c)\n\nthe Chief Fisheries Officer;\n\nany other Fisheries Officer; or\n\nany person authorized to act on behalf of the Chief Fisheries Officer,\n\nwhilst in the execution of his duty, from receiving any stall rent, toll or charge is\nguilty of an offence and is liable on summary conviction to a fine of $7 000 or\nto imprisonment for one year or to both.\n\nDisorderly behaviour in public seafood markets\n\nA person who, in a public market, behaves in a disorderly manner is\n10.\nguilty of an offence and is liable on summary conviction to a fine of $1 000 or\nto imprisonment for one month.\n\nPower of security guard\n\n11.\nA  security  guard  at  a  public  seafood  market  may,  pursuant  to  the\nPrivate  Investigators  and  Security  Guards  Act,  Cap.  372E,  arrest  without\nwarrant, any person who behaves in a disorderly manner in a seafood market,\nand take the person forthwith to a police station.\n\n\f14\n\nPART III\n\nSEAFOOD BUSINESSES\n\nRegister of seafood businesses\n\n12.\nbusinesses.\n\nThe Chief Fisheries Officer shall maintain a register of all seafood\n\nApplication for licence\n\nAn application for the grant of a licence to carry on a seafood business\n13.(1)\nshall be submitted to the Chief Fisheries Officer in the form prescribed in the\nSecond Schedule together with the prescribed application fee and shall include a\nvalid\n\n(a)\n\n(b)\n\n(c)\n\nfood business licence issued by the Ministry of Health, with respect to\nthat business;\n\nhealth certificate issued by the Ministry of Health, with respect to the\nseafood handler; and\n\nSSCTVC  issued  by  the  Fisheries  Division,  with  respect  to  that\nbusiness.\n\nSubsection (1) does not apply to a seafood business that involves primary\n(2)\nseafood production, until the expiration of 6 months from the date this section\nbecomes operative.\n\n(3)\n\nIn this section, “primary seafood production”\n\n(a)\n\nmeans  the  production  of  seafood  by  growing,  raising,  cultivating,\npicking, harvesting, collecting, or catching; and\n\n\f(b)\n\nincludes\n\n15\n\n(i)\n\n(ii)\n\n(iii)\n\ntransporting  or  delivering  seafood  on,  from  or  between  the\npremises  on  which  it  was  grown,  raised,  cultivated,  picked,\nharvested or caught;\n\npacking, treating or sorting seafood on the premises on which it\nwas grown, raised, cultivated, picked, harvested or caught;\n\nstoring seafood in a silo that is not connected to a food processing\noperation;\n\n(iv)\n\ntransporting or delivering seafood to or between silos;\n\n(v)\n\nselling seafood at sale yards;\n\n(vi)\n\ntransporting or delivering seafood to and from sale yards; and\n\n(vii)\n\nany  other  seafood  production  prescribed  by  regulations  made\nunder this Act;\n\n(c)\n\nbut does not include\n\n(i)\n\nany  processing  involving  the  substantial  transformation  of\nseafood whether the process is carried out on the premises where\nseafood was grown, cultivated, picked, harvested or caught;\n\n(ii)\n\nselling or serving seafood to the public; or\n\n(iii)\n\nany other prescribed seafood production activity.\n\nA person who contravenes this section is guilty of an offence and is liable\n(4)\non summary conviction to a fine of $1 000 or to imprisonment for 3 months or\nto both.\n\n\f16\n\nRequirement for SSCTVC: initial survey\n\n14.(1)\nbusiness to operate a service or to continue service where\n\nThe Chief Fisheries Officer may issue a SSCTVC to enable a seafood\n\n(a)\n\n(b)\n\nan initial survey has been carried out in respect of the seafood business\nby the Chief Fisheries Officer;\n\nthe Chief Fisheries Officer is satisfied that the seafood business has a\ncorporate policy\n\n(i)\n\nto reduce illegal fisheries trade practices;\n\n(ii)\n\nto promote seafood stewardship; and\n\n(iii)\n\nto promote seafood supply-chain transparency; and\n\n(c)\n\nthere  is  a  system  to  trace  seafood  and  seafood  products  that  are\nimported to or exported from Barbados.\n\nRequirement for SSCTVC: renewal survey\n\n15.(1)\nbusiness to operate or to continue to operate where\n\nThe Chief Fisheries Officer may issue a SSCTVC to enable a seafood\n\n(a)\n\n(b)\n\na renewal survey has been carried out by the Chief Fisheries Officer;\n\nthe Chief Fisheries Officer is satisfied that the corporate policy of the\nseafood business aims\n\n(i)\n\nto reduce illegal fisheries trade practices;\n\n(ii)\n\nto promote seafood stewardship; and\n\n(iii)\n\nto promote seafood supply-chain transparency; and\n\n(c)\n\nthe Chief Fisheries Officer is satisfied that the seafood business\n\n(i)\n\nis seafood supply-chain transparent; and\n\n(ii)\n\nmaintains a system to ensure that seafood and seafood products\nimported to or exported from Barbados are traceable.\n\n\f17\n\nRenewal surveys referred to in subsection (1)(a) are to be carried out every\n\n(2)\n5 years.\n\nPeriodic inspections\n\n16.(1)\nThe  Chief  Fisheries  Officer  shall  ensure  periodic  inspections  after\ngranting the initial SSCTVC and after each renewal SSCTVC to ensure that the\nrequirements of the SSCTVC are continually met.\n\nWhere  the  SSCTVC  requirements  in  subsection  (1)  are  met,  the  Chief\n(2)\nFisheries  Officer  shall  endorse  the  SSCTVC  in  the  form  set  out  in  the  Third\nSchedule.\n\nPART IV\n\nPROCESSORS OF FISH AND OTHER SEAFOODS\n\nFish processors scheme\n\n17.(1)\nProcessors of Fish and Other Seafoods”.\n\nThere  shall  be  a  scheme  known  as  the  “National  Scheme  for\n\nThe scheme shall aid the development and implementation of initiatives,\n(2)\nprogrammes and other activities to benefit fish processors and processors of other\nkinds of seafood.\n\nThe purpose of the scheme\n\n18.\n\nThe purpose of the scheme is to\n\n(a)\n\n(b)\n\nfor\n\nformalities,  procedures  and  documentary\nset  standards\nrequirements  for  improving  efficiency  in  the  seafood  processing\nsector;\n\ndevelop,  for\nconcessionary proposals for processors of seafood;\n\nthe  consideration  of\n\nthe  Ministry  of  Finance,\n\n\f18\n\n(c)\n\n(d)\n\n(e)\n\nidentify  and  develop  financing  and  other  mechanisms  to  facilitate\ninternational compliance in the seafood processing sector;\n\nprovide a means by which input for the benefit and advancement of the\nsector can be made by stakeholders; and\n\npromote economic, social and sustainable development in the seafood\nprocessing sector.\n\nRequirements for participation in the scheme\n\n19.\n\nProcessors of seafood may participate in the scheme where\n\n(a)\n\nthey are primary or secondary fish processors or processors of other\nkinds of seafood;\n\n(b)\n\nthey are registered as participants to the scheme;\n\n(c)\n\n(d)\n\nthey pay a registration and an annual scheme fee of $100;\n\nthey are the holders of a seafood processor identification card, issued\nby the Fisheries Division; and\n\n(e)\n\nthey comply with the requirements to participate in the scheme.\n\nNotification of the scheme to the Ministry of Finance\n\n20.\n\nThe Chief Fisheries Officer shall\n\n(a)\n\n(b)\n\nnotify the Ministry of Finance, in writing, of the scheme; and\n\nseek to obtain concessions on behalf of the participants of the scheme.\n\n\f19\n\nPART V\n\nFISHING TRAWLING COMMERCIAL OPERATIONS\n\nNational register of fishing trawlers\n\n21.(1)\n“National Register of Fishing Trawlers”.\n\nThe  Chief  Fisheries  Officer  shall  maintain  a  register  called  the\n\nThe  following  information  shall  be  recorded  in  the  Register  of  Fishing\n\n(2)\nTrawlers:\n\n(a)\n\n(b)\n\nfish  trawling  commercial  operations  by  Barbados-registered  fishing\ntrawlers; and\n\nfish  trawling  commercial  operations  by  foreign-registered  Barbados\nfishery-endorsed fishing trawlers,\n\noperating  in  the  waters  of  Barbados  or  on  the  High  Seas,  for  the  benefit  of\nBarbados.\n\nIn this Part, reference to “fishing trawling” includes trawling activities that\n\n(3)\ninvolve processing activities.\n\nBarbados fishing trawler’s programme\n\n22.(1)\nprogramme”.\n\nThere shall be a programme called the “Barbados Fishing Trawler’s\n\nThe  programme  shall  be  administered  and  managed  by  the  Fisheries\n\n(2)\nDivision.\n\nThe  Chief  Fisheries  Officer  shall  create  a  document  known  as  the\n(3)\n“Barbados Fishing Trawler’s Code of Operations” to develop the fish trawling\nindustry in relation to\n\n(a)\n\nsubstantive  and  procedural  elements  of  environmental\n\nthe\nsustainability;\n\n\f20\n\n(b)\n\nlivelihood support; and\n\n(c)\n\neconomical viability.\n\nReasons for the programme\n\n23.\n\nThe programme shall\n\n(a)\n\n(b)\n\n(c)\n\ndetail monetary and non-monetary contributions made by participants;\n\nspecify benefit sharing arrangements in relation to persons engaged in\nfish trawling on Barbados-registered fishing trawlers;\n\nspecify benefit sharing arrangements in relation to persons engaged in\nfish trawling on foreign-registered Barbados fishery-endorsed fishing\ntrawlers; and\n\n(d)\n\nmake any other provision for the effective management, development\nand functioning of the programme.\n\nRequirements for participation in and benefiting from the programme\n\n24.\nprogramme shall\n\nPersons  interested  in  participating  in  and  benefiting  from  the\n\n(a)\n\n(b)\n\n(c)\n\nregister as a participant to the programme;\n\npay a registration and an annual programme fee of $100; and\n\nbe  the  holder  of  a  fishing  trawler’s  licence  issued  by  the  Fisheries\nDivision.\n\nForeign-registered fishing trawlers\n\n25.(1)\nAll  foreign-registered  fishing  trawlers  operating  in  the  waters  of\nBarbados or operating on the High Seas for the benefit of Barbados, shall be\nendorsed as Barbados fishery-endorsed fishing trawlers.\n\n\f21\n\nFor the purposes of this Part, “Barbados fishery-endorsed” means that the\n\n(2)\nforeign-registered fishing trawler\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nis listed in the National Register of Fishing Trawlers in accordance with\nsection 21(2)(b);\n\nis a registered participant in the Barbados fishing trawler’s programme\nin accordance with section 24(a);\n\nholds a fishing trawler’s licence, issued by the Fisheries Division in\naccordance with section 24(c);\n\ncarries a complement of Barbadian fisheries observers, nominated by\nthe  Chief  Fisheries  Officer  in  accordance  with  the  Sustainable\nFisheries Management and Development Act, 2024 (Act 2024-); and\n\n(e)\n\nadheres  to  the  prescribed  requirements  for  development  and\ncontributes to the development of the fisheries sector.\n\nFor the purposes of this Part, “foreign-registered fishing trawler operating\n(3)\non the High Seas for the benefit of Barbados” means that the foreign-registered\nfishing trawler is engaged in fish trawling with a view to provide the benefits\nspecified in\n\n(a)\n\n(b)\n\nthe programme referred to at section 23; and\n\nthe  fish  trawling  agreement  between  Barbados  and  the  State  of  the\nforeign-registered fishing trawler.\n\nFishing trawler’s licence\n\n26.(1)\nfor the purpose.\n\nNo person shall carry on fish trawling unless the person holds a licence\n\nAn application for the grant of a licence to carry on fish trawling shall be\n(2)\nsubmitted to the Chief Fisheries Officer in the prescribed form and shall include\n\n(a)\n\n(b)\n\nthe application fee;\n\na certificate of seaworthiness;\n\n\f22\n\n(c)\n\na fish trawling sustainable operations plan;\n\n(d)\n\na marine environment and species restoration plan, in respect of\n\n(i)\n\nthe area to be trawled;\n\n(ii)\n\nthe species to be caught; and\n\n(iii)\n\nthe species not intended for catch but were caught; and\n\n(e)\n\nany other information as the Chief Fisheries Officer sees fit.\n\nSubject to this Act or any other enactment, a fishing trawler’s licence is\n(3)\nsufficient for a fish trawler to operate for the purposes of subsection (2)(a) and\n(b).\n\nThe Chief Fisheries Officer may on receiving an application for a fishing\n\n(4)\ntrawlers licence\n\n(a)\n\nrequest  that  matters  identified  for  rectification  be  addressed  to  his\nsatisfaction;\n\n(b)\n\napprove the application and grant the licence; or\n\n(c)\n\ndeny the grant of a licence.\n\nWhere  the  Chief  Fisheries  Officer  identifies  matters  for  rectification\n(5)\npursuant to subsection (4)(a), he shall suspend consideration of the application\nand notify the applicant in writing of the matters for rectification.\n\nWhere the Chief Fisheries Officer is satisfied that a fish trawling licence\n(6)\nshould be issued, he shall notify the applicant in writing that the licence will be\nissued on payment of the prescribed fee and subject to such terms and conditions\nas the Chief Fisheries Officer sees fit, including\n\n(a)\n\n(b)\n\nobtaining environmental liability insurance for marine environmental\ndamage;\n\nobtaining environmental liability insurance for harm to fisheries stock\nand habitat; or\n\n(c)\n\nboth (a) and (b).\n\n\f23\n\n(7)\nWhere the Chief Fisheries Officer is not satisfied that a fish trawling licence\nshould be issued, the Chief Fisheries Officer shall notify the applicant in writing\nof the decision.\n\n(8)\nA person who is denied a fish trawling licence may make a written request\nfor  the  reasons  for  the  decision  in  accordance  with  section  14  of  the\nAdministrative Justice Act, Cap. 109B.\n\n(9)\n\nA fishing trawler’s licence issued under subsection (6) is not transferable.\n\nNo-trawl areas\n\n27.\nstakeholders, may identify areas in Barbados waters as no-trawl areas.\n\nThe  Minister,  in  consultation  with  the  Chief  Fisheries  Officer  and\n\nNo-trawl seasons\n\nThe  Minister,  in  consultation  with  the  Chief  Fisheries  Officer  and\n28.\nstakeholders, may declare seasons in which trawling is prohibited or restricted\nas no-trawl seasons.\n\nFish trawling protection and management\n\n29.(1)\nplan and a fish trawling management plan.\n\nThe Chief Fisheries Officer shall develop a fish trawling protection\n\n(2)\n\nThere shall be no fishing trawling except in compliance with\n\n(a)\n\n(b)\n\na fish trawling protection and management plan; and\n\na marine spatial plan.\n\n\f24\n\nPenalty\n\nA person who contravenes this Part is guilty of an offence and is liable\n30.\non conviction on indictment to a fine of $500 000 or 5years imprisonment or to\nboth and in addition is liable to\n\n(a)\n\n(b)\n\nmandatory  participation  in  a  fisheries  management  protection\nprogramme; or\n\nmake  a  financial  contribution  to  marine  environmental  and  species\nrestoration.\n\nPART VI\n\nTRADITIONAL FISHERIES KNOWLEDGE COMMERCE\n\nAccess to traditional fisheries knowledge\n\n31.\nA  person  with  marine  specific  traditional  knowledge  may  in  any\nseafood market or seafood business, charge customers for access to the traditional\nfisheries knowledge in accordance with national maritime heritage laws.\n\nTraditional fisheries knowledge commercial enterprise programme\n\n32.\nThe Minister, in consultation with the Chief Fisheries Officer, may\ndevelop a traditional fisheries knowledge commercial enterprise programme to\nfacilitate the commercial exploitation of traditional fisheries knowledge to the\nbenefit of fisherfolk and others in the seafood industry.\n\n\f25\n\nScope of traditional fisheries knowledge commercial enterprise\nprogramme\n\nThe\n33.\nprogramme may\n\ntraditional\n\nfisheries  knowledge  commercial  enterprise\n\n(a)\n\n(b)\n\n(c)\n\noutline a mechanism for distributing traditional fisheries knowledge\nresources;\n\ndevelop and exchange traditional fisheries knowledge-based products\nand services;\n\ndevelop  a  system  for  enabling,  facilitation  and  supporting  the\nmobilisation, sharing or exchange of traditional fisheries knowledge\namong knowledge holders and users; or\n\n(d)\n\nspecify  any  other  activities  that  promote  a  knowledge  economy  in\nrespect of fisheries.\n\nPART VII\n\nENFORCEMENT\n\nGeneral powers of authorised officers\n\n34.(1)\nwhether a seafood business is in compliance with this Act.\n\nAn authorised officer may take any action that is necessary to ascertain\n\n(2)\n\nFor the purpose of subsection (1), an authorised officer may,\n\n(a)\n\nenter,  inspect  and  examine  premises,  except  residential  premises,  if\nthere is any document, material, equipment or vehicle found therein\nand there is reasonable grounds to believe that the premises are used\nfor\n\n(i)\n\nhandling of seafood intended for sale for human consumption;\n\n\f26\n\n(ii)\n\nconducting a seafood business; or\n\n(iii)\n\nconducting business in a public seafood market;\n\n(b)\n\nenter, inspect and examine any vehicle if there are reasonable grounds\nto believe that it is used for\n\n(i)\n\nhandling of seafood intended for sale for human consumption;\n\n(ii)\n\nconducting a seafood business; or\n\n(iii)\n\nconducting business in a public seafood market;\n\n(c)\n\nstop and detain any vehicle referred to in subparagraph (b);\n\n(d)\n\nrequire a person to produce documents relating to seafood;\n\n(e)\n\nrequire a person to\n\n(i)\n\ngive the person’s name and address; and\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\n(k)\n\n(ii)\n\nprovide  such  other  information  as  the  authorized  officer  may\nrequire;\n\nseize any document, seafood, seafood product or material;\n\ntake copies or extracts from any document;\n\ntake samples of any seafood, seafood products or materials;\n\nopen or cause to be opened any package, container or receptacle that\ncontains seafood or where there are reasonable grounds to believe that\nit contains seafood;\n\nconduct  or  cause  to  be  conducted  an  examination  or  analysis  to\ndetermine the composition or safety of seafood;\n\ntake and analyse samples of water, soil or any thing in the environment\nwhere the seafood was handled, to determine whether the environment\nposes a risk to the safety of the seafood for human consumption;\n\n(l)\n\ntake photographs, audio recordings or visual recordings;\n\n\f27\n\n(m)\n\ntake measurements, sketches, drawings or any other type of record; or\n\n(n)\n\nmonitor  functions  carried  out  by  any  person  holding  specified\nqualifications.\n\n(3)\nThe owner of seafood examined or analysed pursuant to subsection (2)(j)\nmay, on payment of the prescribed fee, receive a certificate of the results of the\nexamination.\n\nThe  owner  of  a  vehicle  referred  to  in  subsection  (2)  shall  provide  an\n(4)\nauthorized officer with any assistance necessary in the exercise of his duties under\nthis Part.\n\n(5)\n\nIn this section, handling of seafood\n\n(a)\n\nmeans\n\n(i)\n\nharvesting or collecting seafood;\n\n(ii)\n\nthe business of aquaculture;\n\n(iii)\n\nthe business of mariculture;\n\n(iv)\n\nmaintaining live shellfish, crustaceans and echinoderms for later\nprocessing;\n\n(v)\n\nthe depuration of shellfish;\n\n(vi)\n\nprocessing seafood, including skinning, gilling, gutting, filleting,\nshucking,  smoking,  preserving,  canning,  curing,  drying,\nextracting,  mincing,  blending,  slicing,  mixing  with  other\nsubstances, cooking, other than cooking for immediate sale for\nhuman  consumption  without  further  processing,  or  packaging,\nstoring and transporting; but\n\n(b)\n\ndoes  not  include  maintaining  or  otherwise  handling  live  finfish  for\nprocessing, or maintaining or handling live seafood for the purpose of\ngrowing.\n\n\f28\n\nPowers of an authorized officer\n\n35.(1)\nWhere  an  authorized  officer  enters  premises  and  suspects  or  has\nreasonable grounds to suspect that the premises, vehicles, plant, machinery or\nequipment is in an insanitary substandard condition or that the seafood intended\nfor sale for human consumption is unfit for human consumption or is a risk to\npublic health, the authorized officer may, order\n\n(a)\n\n(b)\n\n(c)\n\nthe  owner  or  operator  of  the  business  to  clean  and  disinfect  the\npremises, vehicle, plant, machinery and equipment;\n\nprohibit  the  use  of  specified  areas  of  the  premises,  vehicles,  plant,\nmachinery or equipment;\n\nprohibit the removal of seafood from the premises for a specific period\nof time;\n\n(d)\n\nsearch for, seize and remove the seafood; or\n\n(e)\n\nthat seafood be disposed of or destroyed.\n\nA person who contravenes this section is guilty of an offence and is liable\n(2)\non summary conviction for a fine of $50 000 or to imprisonment for 12 months\nor to both.\n\nThe Chief Fisheries Officer shall revoke the licence of a person referred\n\n(3)\nto in subsection (1).\n\nPower to seize and destroy tainted or unwholesome seafood\n\n36.(1)\nseafood exposed for sale in any seafood market.\n\nThe  Chief  Fisheries  Officer  may  seize  tainted  or  unwholesome\n\nSubject  to  subsection  (3),  seafood  seized  under  subsection  (1)  shall  be\n\n(2)\ndestroyed in such manner as the Chief Fisheries Officer determines.\n\nThe owner of seafood seized under subsection (1) may request that the\n(3)\nChief Fisheries have the said seafood examined by a veterinary officer or public\nhealth inspector and have the fitness of the seafood pronounced in his presence.\n\n\f29\n\nWhere, after the examination of the seafood in subsection (3), the seafood\n\n(4)\nis not found to be tainted or unwholesome, it shall be returned to the owner.\n\n(5)\nA person who, in a seafood market, offers or exposes for sale any tainted\nor  unwholesome  seafood,  is  guilty  of  an  offence  and  is  liable  on  summary\nconviction to a fine of $7 000 or to imprisonment for 3 months or to both.\n\nPART VIII\n\nMISCELLANEOUS\n\nApplication of international seafood safety standards\n\n37.\nfollowing international seafood safety standards:\n\nThe owner or operator of a seafood business shall comply with the\n\n(a)\n\n(b)\n\n(c)\n\nCODEX Alimentarius food standards;\n\nHazard Analysis and Critical Control Point standards;\n\nInternational Organisation for Standardisation; and\n\n(d)\n\nany other international seafood safety standards.\n\nSeafood event permit\n\n38.(1)\nmarket shall obtain a Seafood Event Permit.\n\nAny person who intends to host a seafood event in any public seafood\n\n(2)\nFor the purposes of this section, a “Seafood Event Permit” means a permit\nrequired for events specified by the Chief Fisheries Officer in a Fishing Industry\nNotice.\n\nApplication for a seafood event permit\n\n39.(1)\nChief Fisheries Officer at least 30 days prior to the date of the event.\n\nAn application for a Seafood Event Permit shall be submitted to the\n\n\f30\n\n(2)\n\nAn application referred to in subsection (1) shall contain\n\n(a)\n\nthe name, address, telephone number and email address of the event\norganizer;\n\n(b)\n\nthe name and type of event;\n\n(c)\n\nthe date of the event;\n\n(d)\n\nthe duration of the event;\n\n(e)\n\nthe proposed location of the event; and\n\n(f)\n\nany other information that the Chief Fisheries Officer may require.\n\nSuspension, cancellation, or revocation of licences, permits, etc.\n\nThe  Chief  Fisheries  Officer  may  suspend,  cancel  or  revoke  any\n40.\nlicence, permit, certificate or other instrument where the holder contravenes this\nAct or any condition contained in the licence, permit or other instrument.\n\nRegulations\n\n41.(1)\n\nThe Minister may by regulations\n\n(a)\n\n(b)\n\nprescribe the fees for the grant of licences, certificates or permits for\nthe purposes of this Act;\n\nprescribe and regulate the pattern, description and use of weighing or\nmeasuring  instruments  to  be  used  by  persons  selling  marketable\ncommodities in a seafood market;\n\n(c)\n\nprovide for the prevention of nuisances and obstructions in markets\nand for maintaining cleanliness in markets;\n\n(d)\n\nprescribe goods that may be sold in any public seafood market;\n\n(e)\n\nprescribe, regulate, and collect fees, rents, tolls and charges payable by\nowners or operators who use public seafood markets;\n\n\f31\n\n(f)\n\n(g)\n\n(h)\n\n(i)\n\n(j)\n\nprovide for the inspection and examination of marketable commodities\nsold or offered for sale in public seafood market;\n\nfix the days and hours for which public seafood markets shall be open;\n\nimpose conditions for the use of stalls, stands, tables, sheds, or places\nin a public seafood market;\n\nprovide for the maintenance of order and prevention of disturbances in\npublic seafood markets;\n\nprovide for the removal and exclusion from public seafood markets of\npersons suffering from infectious or contagious diseases;\n\n(k)\n\nprovide for the inspection and licensing of cold stores;\n\n(l)\n\nprovide for the licensing of seafood processors;\n\n(m)\n\nprovide for the inspection and examination of seafood;\n\n(n)\n\n(o)\n\n(p)\n\n(q)\n\nregulate the sale of fresh seafood and seafood from cold stores;\n\nprovide  for  the  management,  governance  and  use  of  public  seafood\nmarkets and cold stores;\n\ngenerally for giving effect to the provisions of this Act; and\n\nprescribe  anything  that  is  authorised  or  required  by  this  Act  to  be\nprescribed.\n\n(2)\n\nRegulations made under this Act are subject to negative resolution.\n\nFishing industry notices\n\n42.\nThe Chief Fisheries Officer may, with the approval of the Minister,\nissue fishing industry notices for the management and regulation of the seafood\nindustry.\n\n\f32\n\nCodes of practice and guidelines\n\n43.\nThe Chief Fisheries Officer, in consultation with the fishing industry,\nhealth industry and the agriculture industry, may develop codes of practice and\nguideline to enhance the management and regulation of the seafood industry.\n\nAmendment of schedules\n\n44.(1)\n\nThe Minister may by order amend the Schedules.\n\n(2)\n\nAn order made under subsection (1) is subject to negative resolution.\n\nPower to waive fees\n\n45.\nunder this Act.\n\nThe Minister may by order wholly or partly waive any fee imposed\n\n\f33\n\nL.R.O. 1998FIRST SCHEDULE(Section 7)APPLICATION FOR SEAFOOD SELLER'S LICENCEApplicationNo.:Name of Applicant:Address of Applicant:Telephone numbers: (Home)    (Mobile)Email address:Fisher ID No.:Company Name:Company Registration No.:Customs Registration No.:\f34\n\n L.R.O. 1998CEO/Directors:Place of operation:First Schedule - (Cont'd)\f35\n\n L.R.O. 1998First Schedule - (Concl'd)\f36\n\nL.R.O. 1998SECOND SCHEDULE(Section 13)Sustainable Fisheries Management and Development(Seafood Markets and Businesses) Act, 2024 (Act 2024-    )SEAFOOD SUPPLY - CHAIN TRANSPARENCY VERIFICATION CERTIFICATE (SSCTVC)Issued under the authority of the Government of Barbados by the Fisheries DivisionParticulars:Name of Processor of Fish or other Seafood:Name of Processor's Business:Place of business operation:THIS IS TO CERTIFY:1. That the seafood business has been surveyed in accordance with  the Sustainable Fisheries Management and Development (Seafood Markets and Businesses) Act, 2024 (Act 2024-    ).(Processor's name)(Name of business)(Address of business operation)\f37\n\n L.R.O. 19982. That the survey shows that the seafood business has one of the following:  (a) corporate policy; (b) procedures; (c) program; (d) plan of action; (e) strategy; or (f) initiative, to  reduce illegal  ﬁ sheries trade practices, promote seafood stewardship and seafood supply-chain transparency.3. There is in place a system to ensure that ﬁ sh and other seafood products entering or exiting Barbados through the import or export activities of the seafood business are fully traceable.Completion date of survey on which this certiﬁ cate is based:Issued at: Date of issue:  This certiﬁ cate expires:Signature of Chief Fisheries Oﬃ  cer:  Second Schedule - (Concl'd)(dd/mm/yyyy)(Place of issue)(dd/mm/yyyy)(dd/mm/yyyy)(Signature)\f38\n\nL.R.O. 1998ENDORSEMENT ON SSCTVCThis endorsement is made under section 16 of the Sustainable Fisheries Management and Development (Seafood Markets and Businesses) Act, 2024 (Act 2024 -    ). Particulars of Seafood Business Particulars of Seafood Business Owner/OperatorTHIRD SCHEDULE(Section 16(2))\f39\n\n L.R.O. 1998         Details of Intermediate Inspection        This is to certify that: 1. An initial SSCTVC was issued in respect of  2.       was inspected on         ,    the particulars of which are stated above; 3. The said seafood business continues to meet the requirements for seafood business   as speciﬁ ed in the Sustainable Fisheries Management and Development (Seafood   Markets and Businesses) Act, 2024 (Act 2024 -   ); and 4. In consequence of continually meeting these requirements, the SSCTVC has been   endorsed as evidence of continued compliance. *This endorsement remains valid until next periodic intermediate inspection and becomes  invalid upon execution of a renewal SSCTVC survey, at which time the SSCTVC is renewed. Third Schedule - (Concl'd)(Name of seafood business)(Name of seafood business)(Day/Month/Year)\f40\n\nRead three times and passed the House of Assembly this\n\nday of\n\n, 2024.\n\nSpeaker\n\nRead three times and passed the Senate this\n\nday of\n\n, 2024.\n\nPresident\n\n"
}