{
  "bill_id": 819,
  "slug": "resolution-re-vesting-of-land-in-the-nhc-at-searles-christ-church-2025",
  "title": "Resolution re Vesting of Land in the NHC at Searles, Christ Church (2025)",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/2586b05c681a891fea820996455735d3.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2025-01-20",
  "first_reading": "2025-02-05",
  "gazette_date": null,
  "markdown": "2025-01-16\n\nPARLIAMENT\n\nRESOLVED  that  Parliament  in  accordance  with  section  5  of  the  Crown\n\nLands  (Vesting  and  Disposal)  Act,  Cap.  225  approve  the  vesting  in  the  National  Housing\n\nCorporation  of  a  parcel  of  land,  the  property  of  the  State  situate  at  Searles  in  the  parish  of\n\nChrist Church, in this Island and more particularly described in the Schedule hereto for housing\n\ndevelopment.\n\nAPPROVED by the House of Assembly this                  day of                                                ,\n\nTwo Thousand and Twenty-Five.\n\nSPEAKER\n\nAPPROVED by the Senate this              day of                          , Two\n\nThousand and Twenty-Five.\n\nPRESIDENT\n\n\f2\n\nSCHEDULE\n\nALL  THAT  land  (formerly  part  of  Searles  Plantation)  the  property  of  the\n\nState situate at Searles Plantation in the parish of Christ Church in this Island containing by\n\nadmeasurement 7.406 Hectares or thereabouts (inclusive of 0.147 hectares of Road Reserve)\n\nAbutting and Bounding on lands now or formerly of Searles Plantation on three sides and on\n\na public road which leads to Lowland in one direction and Eddy Village in the other direction\n\nor however else the same may abut and bound as shown and delineated on a plan made and\n\ncertiﬁ ed  on  the  25th  day  of  March,  2016  by  Kenneth  D.  Ward,  Land  Surveyor  and  recorded\n\nin  the  Lands  and  Surveys  Department  on  the  20th  day  of April,  2016  as  Plan  No.  370/2016.\n\n\f3\n\nADDENDUM\n\n  The Cabinet at its meeting held on the 18th day of July, 2024 considered Note (24) 672/\n\nMHLM 50 and agreed to vest 7.406 hectares (18.30 acres) of land the property of the State situate\n\nat Searles in the parish of Christ Church in this Island in the National Housing Corporation for\n\nhousing development.\n\n  The land described in the Schedule formed part of Searles Plantation and was acquired\n\nby the State (formerly the Crown) by Deed of Conveyance made on 29th day of November, 2017\n\nbetween Geoﬀ rey Allan Kinch of the One Part and The Crown of the Other Part and recorded\n\nin the Land Registry as Deed No. 6353 of 2022.\n\n  The approval of Parliament is now sought for the vesting of the parcel of land described\n\nin the Schedule hereto in National Housing Corporation, in accordance with the provisions of\n\nsection 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225 for housing development.\n\n"
}