{
  "bill_id": 823,
  "slug": "rural-and-urban-development-commission-bill-2025",
  "title": "Rural and Urban Development Commission Bill 2025",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/d127d5cd59544c01c22a5da98fc9d596.pdf",
  "current_stage": "House of Assembly",
  "chamber": "",
  "notice_date": "2025-01-30",
  "first_reading": null,
  "gazette_date": null,
  "markdown": "2024-12-17\n\nOBJECTS AND REASONS\n\nThis Bill would make provision for the\n\n(a)\n\n(b)\n\nestablishment of the Rural and Urban Development Commission;\n\ntransfer  of  the  assets  and  liabilities  of  the  Rural  Development\nCommission and the Urban Development Commission to the Rural and\nUrban Development Commission;\n\n(c)\n\nrepeal of the\n\n(i)\n\nRural Development Commission Act, Cap. 238;\n\n(ii)\n\nUrban Development Commission Act, Cap. 241;\n\n(d)\n\nmatters related to paragraphs (a) and (b).\n\n\f2\n\nArrangement of Sections\n\nPART I\n\nPRELIMINARY\n\n1.\n\n2.\n\n3.\n\n4.\n\n5.\n\n6.\n\n7.\n\n8.\n\n9.\n\nShort title\n\nInterpretation\n\nDesignation of land for development\n\nPART II\n\nADMINISTRATION\n\nEstablishment of Commission\n\nFunctions of the Commission\n\nAppointment of committees and delegation of functions\n\nAppointment of Chief Executive Officer\n\nRemuneration of Chief Executive Officer\n\nAppointment of staff\n\n10.\n\nPension rights and service\n\n11.\n\nProtection of the Commission\n\n\f3\n\n12.\n\nConfidentiality\n\n13.\n\nLimitation of powers of Commission\n\n14.\n\nDirections of Minister\n\n15.\n\nDisclosure\n\n16.\n\nRural and Urban Development Fund\n\n17.\n\nApplication of resources of the Fund\n\n18.\n\nBorrowing power\n\n19.\n\nDisposal of assets\n\n20.\n\nAccounts, audit and reporting\n\nPART III\n\nRE-DEVELOPMENT\n\n21.\n\nRenewal plan\n\n22.\n\nDerelict and similar buildings\n\n23.\n\nAppeals\n\n24.\n\nRedevelopment plans\n\n25.\n\nRedevelopment schemes\n\n26.\n\nNotification of approval of scheme\n\n27.\n\nDemolition order\n\n\f4\n\n28.\n\nUse of land\n\n29.\n\nAcquisition of land\n\n30.\n\nAssessment and compensation\n\n31.\n\nPayment in respect of well-maintained houses\n\n32.\n\nCommission to make allowances\n\n33.\n\nCosts of persons opposing scheme\n\n34.\n\nNon-conflict with the National Housing Corporation\n\nPART IV\n\nTRANSFER AND VESTING OF ASSETS\n\n35.\n\nTransfer of assets\n\n36.\n\nStaff of Rural and Urban Development Commission\n\n37.\n\nPension rights and pension plan\n\nPART V\n\nMISCELLANEOUS\n\n38.\n\nFees\n\n39.\n\nRegulations\n\n40.\n\nConsequential amendments.\n\n41.\n\nRepeal\n\n\f5\n\n42.\n\nCommencement\n\nFIRST SCHEDULE\n\nRural and Urban Development Commission\n\nSECOND SCHEDULE\n\nConsequential Amendments\n\n\f\fBARBADOS\n\nA Bill entitled\n\nAn  Act  to  make  provision  for  the  establishment  of  the  Rural  and  Urban\n\nDevelopment Commission and matters related thereto.\n\nENACTED by the Parliament of Barbados as follows:\n\n\f8\n\nPART I\n\nPRELIMINARY\n\nShort title\n\n1.\nCommission Act, 2025.\n\nThis  Act  may  be  cited  as  the  Rural  and  Urban  Development\n\nInterpretation\n\n2.\n\nIn this Act,\n\n“Commission”  means  the  Rural  and  Urban  Development  Commission\n\nestablished under section 4;\n\n“disposal of land” means disposal, whether by sale, exchange or otherwise;\n\n“Fund” means the Rural and Urban Development Fund established under section\n\n16;\n\n“Minister” means the Minister responsible for the Rural and Urban Development\n\nCommission;\n\n“Rural Development Commission” means the Commission that was established\n\nunder the Rural Development Commission Act, Cap. 238; and\n\n“Urban Development Commission” the Commission that was established under\n\nthe Urban Development Commission Act, Cap. 241.\n\nDesignation of land for development\n\n3.(1)\npurposes of this Act.\n\nThe Minister may by order designate an area for development for the\n\nAn  order  referred  to  in  subsection  (1)  shall  be  subject  to  affirmative\n\n(2)\nresolution.\n\n\f9\n\nPART II\n\nADMINISTRATION\n\nEstablishment of Commission\n\n4.(1)\nDevelopment Commission.\n\nThere is established a Commission to be known as the Rural and Urban\n\nThe  First  Schedule  has  effect  with  respect  to  the  constitution  of  the\n\n(2)\nCommission and otherwise in relation hereto.\n\nThe  Commission  is  a  body  corporate  to  which  section  21  of  the\n\n(3)\nInterpretation Act, Cap. 1 applies.\n\nFunctions of the Commission\n\n5.\n\nThe functions of the Commission are set out as follows:\n\n(a)\n\n(b)\n\nto acquire, hold or manage land and other property of any kind for the\npurposes of this Act;\n\nto dispose of such land or other property on such terms and conditions\nas the Minister determines;\n\n(c)\n\nto construct, maintain and repair buildings;\n\n(d)\n\nto provide housing;\n\n(e)\n\nto provide for and improve social amenities and recreational facilities;\n\n(f)\n\n(g)\n\nto  carry  on  any  business  or  undertaking,  including  the  provision  of\nancillary services for the purpose of this Act;\n\nto  make  advances  to  persons  on  such  conditions  and  with  such\nsecurities as may be prescribed by the Minister for any of the following\npurposes:\n\n(i)\n\nto acquire houses and land;\n\n\f10\n\n(ii)\n\nto construct houses;\n\n(iii)\n\nto refurbish buildings;\n\n(iv)\n\nto alter, enlarge, repair or improve houses or other buildings;\n\n(h)\n\nto execute plans for re-development;\n\n(i)\n\n(j)\n\n(k)\n\nto encourage, promote and provide assistance in the development of\neconomic activity and enterprise;\n\nto  give  assistance  in  the  establishment  and  development  of  small\nbusinesses; and\n\nto do such other things as are necessary to effectively carry out the\npurposes of this Act.\n\nAppointment of committees and delegation of functions\n\n6.\n\nThe Commission may\n\n(a)\n\nappoint  committees  composed  of  members  of  the  Commission  and\nother  persons,  not  being  members  of  the  Commission,  to  assist  the\nCommission in carrying out its functions; and\n\n(b)\n\ndelegate to such committees any functions it considers necessary.\n\nAppointment of Chief Executive Officer\n\n7.(1)\nChief Executive Officer.\n\nThe Commission shall, with the approval of the Minister, appoint a\n\nThe  Chief  Executive  Officer  shall  perform  such  functions  as  may  be\n\n(2)\nconferred on him by the Commission.\n\nThe Chief Executive Officer is subject to the directions of the Commission\n(3)\nand  is  responsible  to  the  Commission  for  the  execution  of  its  policy  and  the\nmanagement of its affairs.\n\n\f11\n\nRemuneration of Chief Executive Officer\n\n8.\nremuneration and allowance, if any, as the Minister determines.\n\nThe  Commission  shall  pay  the  Chief  Executive  Officer  such\n\nAppointment of staff\n\nThe Commission may appoint and employ such other officers, agents\n9.(1)\nand servants as it considers necessary for the proper carrying into effect of this\nAct,  at  such  remuneration  and  on  such  terms  and  conditions  as  the  Minister\napproves in writing.\n\nNotwithstanding subsection (1) no post shall be established and no salary\n(2)\nin excess of such amount as the Minister may determine and may notify in writing\nto the Commission shall be assigned to any post without the prior approval of the\nMinister.\n\nSubject to this Act and to the Statutory Boards (Pensions) Act, Cap. 384,\n(3)\nno provision shall be made for the payment of any pension, gratuity or other like\nbenefit to any person employed by the Commission without the prior approval\nin writing of the Minister.\n\nPension rights and service\n\n10.(1)\nWhere a public officer is seconded or temporarily transferred from a\npensionable  office  within  the  meaning  of  section  2(1)  of  the  Pensions  Act,\nCap.  25  to  perform  any  service  with  the  Commission,  his  service  with  the\nCommission shall, unless the President otherwise decides, be pensionable under\nthat Act as if the officer had not been so seconded or transferred.\n\nWhere  a  person  employed  by  the  Commission  is  released  by  the\n(2)\nCommission to provide services within the public service, he is entitled to such\nbenefits and terms of employment as are applicable to the post which he occupies;\nand his service with the Commission shall be taken into account as continuous\nservice  with  the  State  and  the  Pensions  Act  and  Pensions  Regulations,\n\n\f12\n\n1947 (1947/20) shall apply to him as if his service with the Commission were\nservice within the meaning of that Act.\n\nWhere a public officer is transferred to the service of the Commission in\n(3)\naccordance with subsection (4), the Commission shall refund to the Consolidated\nFund all monies payable as pension in respect of the service of that officer with\nthe Commission.\n\n(4)\n\nWhere\n\n(a)\n\n(b)\n\na public officer is transferred to an office in service of the Commission;\nor\n\nan officer of the Commission is transferred to an office in the public\nservice\n\nthe Pensions Act shall apply to him as if his service with the Commission were\nother public service within the meaning of that Act, and the Pensions Regulations,\n1947 shall apply to him accordingly.\n\nProtection of the Commission\n\n11.\nNo  action,  prosecution  or  other  proceedings  shall  be  brought  or\ninstituted against the Commission or any member thereof in respect of any act\ndone bona fide in pursuance or execution or intended execution of this Act.\n\nConfidentiality\n\n12.(1)\nThe Commission, an officer or an employee of the Commission or an\nexpert retained to assist the Commission shall comply with the provisions of the\nData  Protection  Act,  2019  (Act  2019-29)  and  shall  keep  confidential  all\ninformation coming to his knowledge during the performance of his functions\nunder this Act or any enactment which relates to the private affairs of a person\nexcept insofar as disclosure is necessary for\n\n(a)\n\n(b)\n\nthe administration of this Act or any regulations made thereunder;\n\ncompliance with the provisions of any enactment;\n\n\f(c)\n\ncompliance with an order of a court.\n\n13\n\n(2)\nA person who contravenes subsection (1) is guilty of an offence and is\nliable  on  summary  conviction  to  a  fine  of  $40  000  or  to  imprisonment  for  6\nmonths, or to both.\n\nLimitation of powers of Commission\n\n13.\n9, the Commission shall not, without the prior approval of the Minister,\n\nNotwithstanding the powers conferred on the Commission by section\n\n(a)\n\n(b)\n\n(c)\n\nassign to any post established by the Commission any salary in excess\nof such amount per annum as the Minister may determine and notify\nto the Commission in writing;\n\nappoint any person to a post established by the Commission to which\na  salary  in  excess  of  the  amount  determined  by  the  Minister  under\nparagraph (a) is assigned; or\n\nmake  any  provision  for  the  payment  of  pensions,  gratuities  or  like\nbenefits to any officer or servant of the Commission or to others by\nreference to their service to the Commission.\n\nDirections of Minister\n\n14.(1)\n\nThe Minister may\n\n(a)\n\n(b)\n\ngive the Commission directions of a general nature in respect of the\npolicy  to  be  followed  by  the  Commission  in  the  performance  of  its\nfunctions under this Act, and the Commission shall comply with those\ndirections;\n\ngive such directions to the Commission as appear to him to be necessary\nor expedient in respect of the disposal or development of land vested\nin  it  in  order  to  ensure  the  preservation  of  any  features  of  special\narchitectural or historical interest; and\n\n\f14\n\n(c)\n\ngive the Commission such directions as to the disposal of land held by\nthe  Commission  in  such  manner  and  subject  to  such  covenants  and\nconditions  as  may  be  expedient  for  securing  the  development  of  an\narea.\n\nNotwithstanding  the  functions  conferred  on  it  by  section  4,  the\n\n(2)\nCommission may not, except with the approval of the Minister\n\n(a)\n\n(b)\n\ntransfer the freehold interest in any land; or\n\ngrant a lease of any land for a term of more than 99 years.\n\nDisclosure\n\nA member of the Commission who has any interest in a company or\n15.(1)\nother  entity  with  which  the  Commission  proposes  to  enter  into  a  contract  or\notherwise transact business shall disclose to the Commission the particulars of\nthat interest; and details of the disclosure shall be recorded in the minutes taken\nat the meeting at which the disclosure is made.\n\nFor the purposes of this section, a general notice to other members by a\n(2)\nmember to the effect that he is also a member of a specified company or other\nentity and is to be regarded as interested in any contract which may after the date\nof the notice be made with the company or other entity shall be deemed to be\nsufficient declaration of interest in relation to any contract so made.\n\nA notice mentioned in subsection (2) has no effect unless it is given at a\n(3)\nmeeting of the Commission, or unless the members concerned take reasonable\nsteps to secure that it is brought up and read at the next meeting of the Commission\nafter it is given.\n\nA member shall not vote in respect of any contract in which he is interested\n(4)\nand, if he does so, his vote shall not be counted nor shall he be counted in the\nquorum present on the consideration of any such contract.\n\n\f15\n\nRural and Urban Development Fund\n\n16.\nresources of which shall comprise\n\nThere is hereby established a Rural and Urban Development Fund, the\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nsuch amounts as may be voted for the purpose by Parliament;\n\nsuch amounts as may be borrowed by the Commission for its purposes;\n\nsuch amounts as may be collected under the authority of this Act or\nany order made thereunder;\n\nsuch  amounts  as  may  be  given  to  the  Commission  as  grants  or\ndonations; and\n\nsuch other moneys as may become available to the Commission from\nany other source approved by the Minister.\n\nApplication of resources of the Fund\n\nThe resources of the Fund shall be applied towards discharging the\n17.\nobligations and performing any function of the Commission under this Act and\nthe regulations.\n\nBorrowing power\n\n18.(1)\nSubject  to  subsection  (2),  the  Commission  may  borrow  money\nrequired by it for meeting any of its obligations or performing any of its functions.\n\nThe power conferred on the Commission by subsection (1) is exercisable\n(2)\nonly  with  the  approval  of  the  Minister  responsible  for  Finance,  and  the\nCommission shall stipulate\n\n(a)\n\n(b)\n\nthe amount and source of the loan; and\n\nthe terms and conditions on which the loan may be obtained.\n\nThe approval of the Minister under subsection (2) may either be general\n\n(3)\nor limited to a particular borrowing.\n\n\f16\n\n(4)\nNo money shall be raised on the credit of the State to be guaranteed by the\nGovernment except under the authority of the Act or a resolution of Parliament\nand any such resolution shall be made prior to the loan being contracted or a\nguarantee granted.\n\nNotwithstanding  any  other  enactment,  the  State,  public  entity  or\n(5)\ncommercial state entity shall not borrow, from or guarantee to any person, entity\nor  other  Government  entity  unless  the  Minister  responsible  for  Finance  has\napproved such borrowing or guarantee in writing and in accordance with any\nrelevant enactments.\n\n(6)\n\nA loan or guarantee that contravenes this Act shall be null and void.\n\nDisposal of assets\n\n19.\nthe Minister responsible for Finance,\n\nThe Commission shall not, without the prior approval in writing of\n\n(a)\n\n(b)\n\ndispose of its capital assets; or\n\napply the proceeds of a disposal to which paragraph (a) refers to any\nundertaking.\n\nAccounts, audit and reporting\n\n20.\nPart IX of the Public Finance Management Act, 2019 (Act 2019-1) as\nit refers to State-Owned Enterprises shall apply to the Commission with such\nmodifications as are deemed appropriate by the Minister responsible for Finance.\n\n\f17\n\nPART III\n\nRE-DEVELOPMENT\n\nRenewal plan\n\n21.(1)\nplan which\n\nThe Commission shall prepare and submit to the Minister a renewal\n\n(a)\n\n(b)\n\n(c)\n\nshall serve as a guide for the carrying out of the re-development for the\npurposes of this Act;\n\nshall  outline  the  methods  to  be  employed  in  accomplishing  re-\ndevelopment; and\n\nshall specify the amount of capital expenditure to be allocated to re-\ndevelopment.\n\n(2)\n\nThe plan referred to in subsection (1)\n\n(a)\n\n(b)\n\nshall include the plans and schemes mentioned in sections 24 and 25;\nand\n\nshall be approved by the Cabinet prior to the commencement of any\nre-development.\n\nDerelict and similar buildings\n\n22.(1)\napplies\n\n(a)\n\n(b)\n\n(c)\n\nWhere in the opinion of the Commission a building to which this Act\n\nis derelict;\n\nis unfit for human habitation;\n\ncreates a nuisance; or\n\n(d)\n\nis injurious or likely to be injurious to health,\n\n\f18\n\nthe Commission may serve on the owner or occupier thereof notice in writing\nrequiring him to demolish, secure, repair or rebuild the building to the satisfaction\nof the Commission within the time specified in the notice.\n\nWhere the owner fails to comply with the requirements of a notice served\n(2)\npursuant to subsection (1) within the time specified therein, the Commission or\nany person authorised in writing by the Chairman of the Commission may execute\nthe works mentioned therein and may, if the Commission deems it expedient,\norder the whole or any portion of the expenses thereby incurred to be defrayed\nout of funds at its disposal for such purpose.\n\nAny expenses incurred by the Commission for the purposes of this section\n(3)\nare a debt due to the Commission and, without prejudice to any other remedy,\nmay be recovered summarily as a debt due to the Commission in civil proceedings\nnotwithstanding  that  the  expenses  exceed  the  normal  monetary  limit  on  the\njurisdiction of a magistrate’s court.\n\nWhere personal service of a notice referred to in subsection (1) cannot be\n(4)\neffected,  whether  by  reason  of  the  absence  of  the  owner  or  occupier  from\nBarbados or otherwise, service thereof shall be effected\n\n(a)\n\n(b)\n\nby affixing the notice or a copy thereof to some conspicuous part of\nthe premises; and\n\nby  advertisement,  a  minimum  of  3  times,  in  a  newspaper  that  is\ncirculated, printed and published in Barbados.\n\nA notice referred to in subsection (1) shall specify a period of time after\n(5)\nthe expiration of which the Minister may cause the works to be executed if they\nhave not previously been executed.\n\nIn determining for the purposes of this section whether a house is fit for\n(6)\nhuman habitation, regard may be had to the extent, if any, to which it suffers from\nsanitary defects.\n\nWhere  persons  are  displaced  as  a  result  of  any  action  taken  by  the\n(7)\nCommission pursuant to subsection (2) the Commission shall satisfy itself that\nsuitable alternative accommodation is available for the affected persons.\n\n\f19\n\nAppeals\n\n23.(1)\nA person served with a notice under section 22(1) or any other person\nhaving an estate or interest in the building to which the notice relates, may, at\nany time before the expiration of the period specified in the notice pursuant to\nsection 22(2) and in accordance with any rules of court, appeal to a Judge in\nChambers against the notice on any of the following grounds:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nthat the notice or requirement is not justified for the protection of or in\nthe interest of public health;\n\nthat there is some informality, defect or error in or in connection with\nthe notice;\n\nthat the Minister has refused unreasonably to approve the execution of\nalternative works;\n\nthat works required by the notice to be executed are unreasonable in\ncharacter or extent or are unnecessary;\n\nthat the time within which the works are required by the notice to be\nexecuted is not sufficient for the purpose;\n\nthat the notice might lawfully have been served on the occupier of the\npremises  to  which  it  related  instead  of  the  owner,  or  on  the  owner\ninstead of the occupier, and it would have been equitable for it to have\nbeen so served;\n\nwhere  the  work  is  work  for  the  common  benefit  of  the  premises  to\nwhich the notice relates and other premises, that some other person,\nbeing the owner or occupier of the other premises to be benefited, ought\nto contribute towards the expenses of executing any works required.\n\nWhere an appeal under subsection (1) is based on the ground specified in\n(2)\nparagraph (b) thereof, the Judge shall dismiss the appeal if he is satisfied that the\ninformality, defect or error was not material.\n\n\f20\n\n(3)\nWhere the grounds upon which an appeal is brought under subsection (1)\ninclude the grounds specified in paragraph (f) or (g), the appellant shall serve a\ncopy of his notice of appeal\n\n(a)\n\n(b)\n\non every person referred to in paragraph (f) or (g), as the case may be;\nand\n\non any other person having an estate or interest in the building to which\nthe notice referred to in section 22(1) relates.\n\nUpon the hearing of the appeal referred to in subsection (3) the Judge may\n\n(4)\nmake such order as he thinks fit\n\n(a)\n\nin respect of\n\n(i)\n\nthe person by whom any work is required to be executed; and\n\n(ii)\n\nthe contribution to be made by any other person towards the cost\nof the work; or\n\n(b)\n\nwith  respect  to  the  proportions  in  which  any  expenses  which  may\nbecome  recoverable  by  the  Minister  under  subsection  (9)  are  to  be\nborne by the appellant and such other person.\n\nIn  exercising  his  powers  under  subsection  (4)  the  Judge  shall  have\n\n(5)\nregard,\n\n(a)\n\nas  between  an  owner  and  an  occupier,  to  the  terms  and  conditions,\nwhether contractual or statutory of the tenancy and to the nature of the\nworks required; and\n\n(b)\n\nin  any  case,  to  the  degree  of  benefit  to  be  derived  by  the  different\npersons concerned.\n\nUpon the determination of an appeal made under subsection (1), the Judge\n(6)\nshall  give  directions  for  giving  effect  to  his  decision,  including,  where\nappropriate, directions for quashing the notice which is the subject of the appeal\nor for varying the terms of such notice in favour of the appellant.\n\n\f21\n\n(7)\nWhere the notice referred to in subsection (6) is varied or the appeal is\ndismissed, the Judge may, if he thinks fit, order that the notice be suspended until\nsuch date (not being later than 28 days from the determination of the appeal) as\nhe thinks fit.\n\n(8)\n\nThe decision of the Judge is final.\n\nWhere at the expiration of the period specified in a notice under section\n(9)\n22(1) or on the expiration of the period ordered by a Judge on the determination\nof an appeal brought under subsection (1) the work specified in the notice or in\nthe notice as varied by the Judge under subsection (6) has not been executed, the\nMinister may cause such work to be executed, and on completion thereof may\nrecover  the  costs  of  executing  the  works  as  a  debt  due  to  the  State  in  civil\nproceedings notwithstanding that the amount of such costs exceeds the normal\nmonetary limit on the jurisdiction of a magistrate’s court.\n\nIn any proceedings under subsection (9), the validity of the notice to which\n(10)\nthe  proceedings  relate  shall  not  be  questioned  on  any  ground  specified  in\nsubsection (1).\n\nRedevelopment plans\n\n24.(1)\nWhere the Commission is satisfied that the housing conditions in an\narea are dangerous, injurious or likely to be injurious to the health and welfare\nof the inhabitants by reason of\n\n(a)\n\n(b)\n\n(c)\n\nthe disrepair or sanitary defects of the dwelling houses in the area;\n\nthe bad arrangement of the houses in the area; or\n\nthe narrowness or bad arrangement of the roads,\n\nand  that  those  conditions  can  be  remedied  by  ordering  the  demolition,\nreconstruction  or  repair  of  those  dwelling  houses  that  are  unfit  for  human\nhabitation, the Commission shall cause that area to be defined on a plan in such\na manner as to exclude from that area any land or buildings in respect of which,\nin its opinion, sanitary defects do not exist.\n\n\f22\n\n(2)\nThe Commission shall pass a resolution declaring the area defined under\nsubsection (1) to be a re-development area and shall, within the period specified\nin section 26, prepare and submit to the Minister a scheme, hereinafter referred\nto as a “re-development scheme”, for the exercise of its powers under this Act.\n\nRedevelopment schemes\n\nAs soon as may be practicable after the Commission has passed the\n25.(1)\nresolution mentioned in section 24(2), the Commission shall send a copy of the\nresolution to the Minister and shall publish\n\n(a)\n\n(b)\n\nin the Official Gazette; and\n\nby  advertisement,  a  minimum  of  3  times,  in  a  newspaper  that  is\ncirculated, printed and published in Barbados,\n\na notice stating that the resolution has been passed and naming a place where a\ncopy of the resolution may be inspected.\n\nWithin 3 months after the Commission passes the resolution referred to in\n(2)\nsubsection (1) or such further period as the Minister may allow, the Commission\nshall  prepare  and  submit  to  the  Minister  a  scheme  to  be  known  as  a  “re-\ndevelopment  scheme”  accompanied  by  a  statement  containing  appropriate\nparticulars of the scheme indicating\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe manner in which it is intended that the area shall be laid out and the\nland therein used, and in particular the land intended to be used for the\nprovision  of  houses,  roads  and  open  spaces,  community  facilities,\nschools, churches, play centres and recreation grounds;\n\nthe approximate number and the nature of the houses to be provided\nby the Commission;\n\nthe average number of houses to be constructed per acre;\n\nif the demolition of existing houses and the erection of new houses are\nproposed, the nature of the proposed new houses;\n\n\f23\n\n(e)\n\n(f)\n\n(g)\n\n(h)\n\nif the total demolition of existing houses is not proposed, the nature of\nrepairs, improvements and reconstruction intended to be made;\n\nthe time within which the scheme or any part thereof is to be completed;\n\nthe estimated cost of the scheme and of the rents expected to be derived\nfrom the houses provided under the scheme;\n\nincidental,  consequential  and  supplementary  provisions\nsuch\n(including provisions as to the subsequent variation of the scheme) as\nmay appear necessary or proper for the purposes of the scheme;\n\n(i)\n\nobjections  made  by  persons  affected  by  the  scheme  where  such\nobjections have not been withdrawn or met.\n\n(3)\n\nThe Commission shall, before submitting such scheme to the Minister,\n\n(a)\n\n(b)\n\npublish by advertisement, a minimum of 3 times, in a newspaper that\nis circulated, printed and published in Barbados, a notice stating that\nthe  scheme  is  about  to  be  submitted  to  the  Minister  for  approval,\nnaming a place where particulars of the scheme may be inspected and\nspecifying the time within which and the manner in which objections\nmay be made; and\n\nserve  a  notice  to  the  like  effect  on  every  owner  and  on  every  other\nperson who to the knowledge of the Commission has any interest in\nland in the area affected by the scheme, except persons holding under\na monthly tenancy or tenancy for a lesser period.\n\nWhere a person is aggrieved by a notice served pursuant to subsection (3)\n(4)\nhe shall appeal to a Judge in Chambers within 14 days of receipt of such notice.\n\nNotification of approval of scheme\n\n26.(1)\nof any re-development scheme, the Commission shall forthwith publish\n\nUpon notification to the Commission of the approval of the Minister\n\n(a)\n\nin the Official Gazette; and\n\n\f24\n\n(b)\n\nby  advertisement,  a  minimum  of  3  times,  in  a  newspaper  that  is\ncirculated, printed and published in Barbados,\n\na notice stating that the scheme has been approved and naming a place where a\ncopy of the scheme and particulars thereof may be inspected.\n\nWhere, after a scheme has been approved, it appears to the Commission\n(2)\nthat  any  land  in  the  area  comprised  in  the  approved  scheme  ought  to  be  re-\ndeveloped or used otherwise than as indicated in the scheme, the Commission\nshall prepare and submit for the approval of the Minister a new scheme in respect\nof that land.\n\nIn the following provisions of this Act, references to “re-development” or\n(3)\n“use in accordance with a scheme” shall be construed as references to a scheme\napproved under this section or, in the case of land comprised in a new scheme\napproved under this section, in accordance with the new scheme.\n\nDemolition order\n\nWhere, with respect to any area included in a re-development scheme\n27.(1)\napproved by the Minister, the Commission determines that any building in the\narea ought to be demolished, it shall make and serve on the owner of the building\nan order referred to in this Act as a “demolition order” for the demolition of the\nbuilding.\n\nSubject to this section, subsections (2), (3), (6) of section 22 apply to an\n(2)\norder referred to in subsection (1) as if it were a notice served under subsection\n(1) of section 22.\n\nWhere the Commission, pursuant to an order made under subsection (1),\n(3)\ndemolishes any building, the Commission may sell or otherwise dispose of any\nmaterials resulting from the demolition of the building.\n\nAny amount realised by the sale of materials referred to in subsection (3)\n(4)\nmay be deducted from the expenses recoverable under subsection (3) of section\n23.\n\n\f25\n\n(5)\nWhere the amount referred to in subsection (4) is greater than the expenses\nrecoverable under subsection (3) of section 22, the Commission shall pay the\nsurplus to the owner of the land or building, as the case may be.\n\nUse of land\n\nWhen a demolition order is to be carried out, no land to which the\n28.(1)\norder applies shall be used for building purposes or otherwise developed except\nsubject to such restrictions and conditions as the Commission may think fit to\nimpose.\n\nAny owner who is aggrieved by a restriction or condition referred to in\n(2)\nsubsection (1), or by a refusal of the Commission to cancel or modify any such\nrestriction or condition, may, within 28 days, appeal to a Judge in Chambers, who\nmay make such order as he thinks proper and the decision of the Judge shall be\nfinal.\n\nA  person  who  commences,  or  causes  to  be  commenced,  any  work  in\n(3)\ncontravention of subsection (1) is guilty of an offence and is liable on summary\nconviction to a fine of $5 000 or 12 months imprisonment and to a further fine\nof $500 for each day during which any part of the work exists in contravention\nof that subsection after a conviction is first obtained.\n\nAcquisition of land\n\n29.\nAny land or building within a re-development area or any interest in\nany  such  land  or  building  that  is  to  be  acquired  by  the  Commission  for  the\npurposes of this Act may be compulsorily acquired in accordance with the Land\nAcquisition Act, Cap. 228 at any time after the expiration of 28 days from the\nfirst publication of the notice required by subsection (1) of section 27.\n\nAssessment and compensation\n\n30.(1)\nWhere  any  land  or  building  or  any  interest  therein  is  compulsorily\nacquired  under  the  Land  Acquisition  Act,  Cap.  228,  compensation  shall  be\n\n\f26\n\nassessed and shall be paid to the owner of such land or building or interest therein,\nsubject to this Act, in accordance with the Land Acquisition Act.\n\nThe  Commission  shall  forthwith  out  of  its  own  funds  pay  into  the\n(2)\nConsolidated Fund any compensation payable pursuant to the Land Acquisition\nAct in respect of any compulsory acquisition.\n\nIn  assessing  the  amount  of  compensation  payable  under  the  Land\n(3)\nAcquisition Act to the owner of any land or building or to any person with any\ninterest  therein  for  the  purposes  of  this  Act,  regard  shall  be  had  to  the\nfollowing:\n\n(a)\n\n(b)\n\nin  the  case  of  land  with  buildings  thereon  that  are  unfit  for  human\nhabitation or are dangerous, or injurious or likely to be injurious to the\nhealth of the inhabitants of the area, the compensation payable shall be\nthe site value of the land as unimproved land, without regard to any\nbuildings existing thereon;\n\nin the case of land with buildings thereon in respect of which sanitary\ndefects exist but which are not otherwise unfit for human habitation or\ndangerous, or injurious or likely to be injurious to the health of the\ninhabitants of the area, the compensation payable shall be the site value\nof the land as improved land minus the amount required to rectify the\nsanitary defects; and\n\n(c)\n\nin the case of any other land and building other than land and building\nreferred to in paragraphs (a) and (b), the compensation payable shall\nbe the improved value thereof.\n\nIn the case of any dwelling house or other building which is regarded as\n(4)\ndangerous or injurious or likely to be injurious to health under paragraph (a) or\n(b) of subsection (3) only by reason of its bad arrangement in relation to other\nbuildings  or  the  narrowness  or  the  bad  arrangement  of  the  roads,  the\ncompensation payable shall be as in paragraph (c) of subsection (3).\n\nWhere a building is used partly for the purposes of a dwelling house and\n(5)\npartly for other purposes, no compensation shall be payable where the part of the\n\n\f27\n\nbuilding used for purposes other than as a dwelling house is, by reason of disrepair\nor sanitary defects, regarded as unfit for human habitation.\n\nIn determining for the purposes of this Act whether a house is fit for human\n(6)\nhabitation, regard shall be had to the extent to which by reason of disrepair or\nsanitary defects the house falls short of the provisions of the Health Services\n(Building) Regulations, 1969 (S.I. 1969 No. 233).\n\nThe owner of any building that is regarded as unfit for human habitation,\n(7)\non making a request to the Commission in writing, is entitled to be furnished by\nthe Commission with a statement in writing of its reasons for deciding that the\nbuilding is so unfit.\n\nPayment in respect of well-maintained houses\n\nWhere  a  property,  or  part  thereof,  is  well-maintained  and  does  not\n31.(1)\nhave any sanitary or other defects, but is to be acquired for a public purpose, the\nvalue of the property shall be paid in full by the State.\n\n(2)\n\nA payment under this section shall be of an amount equal either\n\n(a)\n\n(b)\n\nto  the  amount  by  which  the  aggregate  expenditure  shown  to  the\nsatisfaction of the Commission to have been incurred in maintaining\nthe house during the 5 years immediately before the date on which the\norder was made exceeds an amount equal to one and one-quarter times\nthe actual rent received during that period for the house or, where no\nrent was received, the rent that might have been received had the house\nbeen let; or\n\nto one and one-half times or, if at that date the house is occupied by an\nowner thereof and has been owned and occupied by him or a member\nof his family continuously during the 3 years immediately before that\ndate, 3 times the rent that might have been received, during that period,\nhad the house been let,\n\nwhichever is the greater.\n\n\f28\n\nA payment under this section shall not in any case exceed the difference\n\n(3)\nbetween\n\n(a)\n\nthe full value of the house (that is to say, the amount which would have\nbeen  payable  as  compensation  by  virtue  of  its  being  compulsorily\nacquired as being fit for human habitation); and\n\n(b)\n\nthe amount which is payable as compensation under this Act by virtue\nof its being compulsorily acquired as unfit for human habitation.\n\nAny question as to the value of a house referred to in subsection (3) shall\n(4)\nbe determined, in default of agreement, as if it had been a question of disputed\ncompensation arising on such acquisition.\n\n(5)\n\nA payment under this section shall be made,\n\n(a)\n\n(b)\n\nif the house is occupied by the owner thereof, to such owner; or\n\nif the house is not so occupied, to the person liable under any covenant\nor agreement or otherwise to maintain and repair the house, and if more\nthan one person is so liable, in such shares as the Commission thinks\nequitable in the circumstances.\n\nCommission to make allowances\n\n32.\nWhere  the  Commission  has  purchased  a  dwelling  house  or  other\nbuilding located within a re-development area because that dwelling house or\nother  building  is  unfit  for  human  habitation  and  is  not  capable  at  reasonable\nexpense of being rendered fit, the Commission may pay\n\n(a)\n\n(b)\n\nto any person displaced from the dwelling house or such other building\nsuch reasonable allowance as the Commission may think fit towards\nhis expense of moving; or\n\nto any person carrying on a trade or business in any such dwelling house\nor other building such reasonable allowance toward the loss which, in\nits opinion, he would sustain by reason of the disturbance of his trade\nor  business  consequent  on  his  having  to  quit  the  dwelling  house  or\n\n\f29\n\nbuilding; and in assessing that loss the Commission shall have regard\nto the period for which the premises occupied by him might reasonably\nhave  been  expected  to  be  available  for  the  purpose  of  his  trade  or\nbusiness and the availability of other premises suitable for the purpose.\n\nCosts of persons opposing scheme\n\nThe Minister may make such provision as he thinks fit in favour of\n33.(1)\nany owner of any land or house included in a re-development scheme approved\nby  him  for  the  allowance  of  reasonable  expenses  incurred  by  the  owner  in\nopposing the scheme.\n\nExpenses allowed under subsection (1) shall be deemed to be expenses\n(2)\nincurred by the Commission under this Act and shall be paid to that person in\nsuch manner and at such times and either in a lump sum or by instalments as the\nMinister may determine.\n\nNon-conflict with the National Housing Corporation\n\n34.\nHousing Corporation by the Housing Act, Cap. 226.\n\nNothing in this Act affects the functions conferred on the National\n\nPART IV\n\nTRANSFER AND VESTING OF ASSETS\n\nTransfer of assets\n\n35.(1)\n\nAll\n\n(a)\n\nassets  of  the  Rural  Development  Commission  and  the  Urban\nDevelopment Commission that are vested in the Rural Development\nCommission  and  the  Urban  Development  Commission  immediately\nbefore the date of commencement of this Act\n\n\f30\n\n(b)\n\nliabilities that were incurred by or on behalf of the Rural Development\nCommission and the Urban Development Commission and subsisting\nimmediately before the date of commencement of this Act,\n\nare transferred to and vested in the Rural and Urban Development Commission\nand,  by  virtue  of  this  Act  and  without  further  assurance,  transfer  or  other\nformality, are to be held with effect from the date of commencement of this Act\nby the Rural and Urban Development Commission to the same extent and interest\nand in the same manner as they were vested in or held by the Rural Development\nCommission and the Urban Development Commission.\n\nAll  contracts  entered  into  by  or  on  behalf  of  the  Rural  Development\n(2)\nCommission  and  the  Urban  Development  Commission  before  the  date  of\ncommencement  of  this  Act  shall,  as  from  that  date,  be  deemed  to  have  been\nentered into by or on behalf of the Rural and Urban Development Commission.\n\nAll rights, privileges, duties or obligations conferred or imposed upon the\n(3)\nRural Development Commission and the Urban Development Commission, and\nall powers and remedies as to the taking and resisting of legal proceedings for\nthe ascertaining, perfecting or enforcing of all rights or liabilities vested in the\nRural  Development  Commission  and  the  Urban  Development  Commission,\nimmediately before the date of commencement of this Act shall be deemed to be\nconferred or imposed on the Rural and Urban Development Commission.\n\nStaff of Rural and Urban Development Commission\n\n36.(1)\nThe officers and other employees who are members of staff of the\nRural Development Commission and the Urban Development Commission shall,\nupon the commencement of this Act, comprise the staff of the Rural and Urban\nDevelopment Commission.\n\nAn officer or employee referred to in subsection (1), shall be employed on\n(2)\nterms and conditions no less favourable than those to which he was entitled before\nthe commencement of this Act.\n\n\f31\n\nPension rights and pension plan\n\n37.(1)\nThere  are  hereby  preserved  to  the  staff  of  the  Rural  Development\nCommission  and  the  Urban  Development  Commission  to  whom  section  36\napplies the pension and superannuation rights accruing to them at the time of\ntheir  assumption  of  employment  with  the  Rural  and  Urban  Development\nCommission.\n\nThere  are  hereby  preserved  to  the  officers  and  employees  of  the  Rural\n\n(2)\nDevelopment Commission and the Urban Development Commission who\n\n(a)\n\nwere members of staff of the Rural Development Commission and the\nUrban Development Commission prior to the commencement of this\nAct; and\n\n(b)\n\nhave not assumed employment with the Rural and Urban Development\nCommission at that date\n\nall  pension  and  superannuation  rights  that  accrued  to  them  by  virtue  of  their\nemployment  with  the  Rural  Development  Commission  and  the  Urban\nDevelopment Commission.\n\nThe  payment  of  any  pension  or  superannuation  to  the  officers  and\n(3)\nemployees  referred  to  in  subsection  (2)  when  the  pension  or  superannuation\naccrues  shall  be  in  accordance  with  the  provisions  of  the  Statutory  Boards\n(Pensions) Act, Cap. 384.\n\nWithout affecting subsection (1), the service of the staff with the Rural\n(4)\nDevelopment Commission and the Urban Development Commission referred to\nin that subsection shall be aggregated with their service with the Rural and Urban\nDevelopment  Commission  and  any  other  public  service  for  the  purpose  of\ncomputing pension and other retiring benefits under this Act and the Statutory\nBoards (Pensions) Act.\n\n\f32\n\nPART V\n\nMISCELLANEOUS\n\nFees\n\n38.\nservices performed by the Commission under this Act or the regulations.\n\nThe Minister responsible for Finance may by order prescribe fees for\n\nRegulations\n\n39.\nregulations generally for carrying the provisions of this Act into effect.\n\nThe  Commission  may,  with  the  approval  of  the  Minister,  make\n\nConsequential amendments.\n\n40.\namended in the manner specified in Column 2 of the Second Schedule.\n\nThe  enactments  set  out  in  Column  1  of  the  Second  Schedule  are\n\nRepeal\n\n41.\n\nThe\n\n(a)\n\n(b)\n\nRural Development Commission Act, Cap. 238; and\n\nUrban Development Commission Act, Cap. 241\n\nare repealed.\n\nCommencement\n\n42.\n\nThis Act shall come into operation on a date fixed by Proclamation.\n\n\f33\n\nFIRST SCHEDULE\n\nRural and Urban Development Commission\n\n(Section 4)\n\nComposition and appointment\n\n1.\n\nThe Commission shall comprise\n\na Chairman;\n\na Deputy Chairman;\n\nthe Director, Planning and Development;\n\nthe  Permanent  Secretary  of  the  Ministry  with  responsibility  for  the\nRural and Urban Development Commission or his nominee; and\n\nfive  other  members  who  shall  be  appointed  by  the  Minister  by\ninstrument in writing.\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nTenure\n\n2.\nSubject  to  paragraphs  4,  5,  and  6,  a  member  holds  office  for  such\nperiod,  not  exceeding  3  years,  as  the  Minister  may  direct  in  the  instrument\nappointing such member but is eligible for re-appointment for an additional term.\n\nTemporary appointment\n\n3.\nThe Minister may, in accordance with paragraph 2, appoint any person\nto act temporarily in the place of any member in case of the absence of such\nmember from Barbados or the inability of such member to act.\n\nResignation\n\n4.(1)\nA  member  other  than  the  Chairman  may  at  any  time  resign  his\nappointment  by  instrument  in  writing  addressed  to  the  Chairman,  who  shall\nforthwith cause the instrument to be forwarded to the Minister and upon the date\n\n\f34\n\nof the receipt by the Chairman of such instrument the member ceases to be a\nmember  of  the  Commission  unless  some  other  date  is  mentioned  in  the\ninstrument.\n\nThe Chairman may at any time resign his office by instrument in writing\n(2)\naddressed to the Minister and upon the date of the receipt by the Minister of such\ninstrument the Chairman ceases to be Chairman and a member of the Commission\nunless some other date is mentioned in the instrument.\n\nVacancy\n\n5.\nCommission in the case of\n\nA  vacancy  shall  be  deemed  to  arise  in  the  membership  of  the\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nthe death or resignation of a member;\n\nthe revocation by the Minister of the appointment of a member;\n\nthe absence from Barbados of a member without leave of the Minister;\n\nthe  failure  of  a  member  to  attend  3  consecutive  meetings  of  the\nCommission,  unless  such  failure  to  attend  was  approved  by  the\nMinister.\n\nRemuneration\n\n6.\nor travelling or other allowances, as the Minister may determine.\n\nMembers are eligible for such remuneration, whether by way of fees\n\nNames of members of the Commission to be published in Official\nGazette\n\n7.\nThe names of all members of the Commission as at first constituted\nand every change in the membership thereof, shall be published in the Official\nGazette.\n\n\f35\n\nSeal\n\n8.(1)\nThe  seal  of  the  Commission  shall  be  kept  in  the  custody  of  the\nChairman,  Deputy  Chairman  or  such  officer  of  the  Commission  as  the\nCommission  may  approve,  and  may  be  affixed  to  documents  or  instruments\npursuant  to  a  resolution  of  the  Commission  in  the  presence  of  any  2  of  the\nChairman or Deputy Chairman and the Secretary to the Commission.\n\nThe seal of the Commission shall be authenticated by the signature of the\n\n(2)\nChairman or Deputy Chairman and the Secretary to the Commission.\n\nAll documents or instruments other than those required by law to be under\n(3)\nseal made by, and all decisions of, the Commission may be signified under the\nhand of the Chairman or Deputy Chairman.\n\nMeetings\n\nThe Commission shall meet at least once a month for the transaction\n9.(1)\nof its business, and each meeting shall be held on such days and at such times\nand places as the Commission determines.\n\n(2)\nThe  Chairman  or,  if  he  is  for  any  reason  whatsoever  unable  to  act,  the\nDeputy Chairman may at any time call a special meeting of the Commission, and\nshall call a special meeting within 7 days of the receipt by him of a requisition\nfor that purpose addressed to him in writing by any 3 members.\n\nThe Chairman or, in his absence the Deputy Chairman shall preside at all\n(3)\nmeetings of the Commission, and in the case of the absence of both the Chairman\nand the Deputy Chairman the members present and constituting a quorum may\nelect  a  temporary  Chairman  from  among  their  members,  and  such  temporary\nChairman shall preside at that meeting.\n\nQuorum\n\n10.\n\nFive members constitute a quorum.\n\n\f36\n\nDecisions\n\n11.\nThe decisions of the Commission at any meeting shall be by a majority\nof  votes,  and  in  the  event  of  an  equality  of  votes  the  Chairman  or  Deputy\nChairman presiding at the meeting has a second or casting vote.\n\nMinutes\n\nMinutes in proper form of each meeting shall be kept by the Secretary\n12.(1)\nor such officer as the Minister appoints for the purpose, and shall be confirmed\nin writing at the next meeting by the Chairman or Deputy Chairman.\n\nConfirmed minutes of meetings shall be submitted to the Minister within\n\n(2)\none month after the date of the meeting at which they were confirmed.\n\n\f37\n\n L.R.O. 1998SECOND SCHEDULE(Section 40)CONSEQUENTIAL AMENDMENTSColumn 1Enactments1. Health Services Act, Cap.  442. Public Finance Management Act, 2019 (Act 2019-1)Column 2AmendmentsIn section 6 delete subsection (3) and substitute the following:  \"(3) The   (a) construction, repair and maintenance     of sewers; and             (b) performance of sewage disposal works     in accordance with subsection (1)(b)   may be executed on land acquired by the   Minister responsible for Lands, the National  Housing Corporation or the Rural and Urban   Development Commission.\".In the First Schedule(a) insert immediately after paragraph 17 the following:  \"17A. Rural and Urban Development     Commission\"; and(b) delete paragraphs 18 and 21.\f38\n\n L.R.O. 1998Column 1Enactments3. Statutory Boards (Pensions) Act, Cap. 384Column 2Amendments1. In the First Schedule (a) insert immediately after paragraph 16 the following:\"16A. Rural and Urban Development Commission Accountant Accounts Clerk Administrative Associate (Clerical Oﬃ  cer) Administrative Oﬃ  cer II Administrative Oﬃ  cer I Assistant Accountant Assistant Director Human Resources Chief Executive Oﬃ  cer Deputy Director Director - Corporate Director - Operations Executive Secretary  Field Oﬃ  cer/Field Investigator Finance Oﬃ  cer Finacial Controller General Worker Information Technology Oﬃ  cer I/II Legal Assistant Loans AdministratorCONSEQUENTIAL AMENDMENTS - (Cont'd)Second Schedule - (Cont'd)\f39\n\n L.R.O. 1998Column 1Enactments3. Statutory Boards (Pensions) Act, Cap. 384 - (Cont'd)Column 2Amendments Loans Oﬃ  cer Maid Manager - Information and  Transformation Messenger/Driver Planner Planning Assistant Procurement Oﬃ  cer Project Assistant Project Coordinator Project Oﬃ  cer Technical Oﬃ  cer I Quality Management Oﬃ  cer Records and Information Oﬃ  cer Security Guard Senior Accountant Senior Auditor Senior Human Resources Oﬃ  cer Senior Legal Assistant Senior Legal Oﬃ  cer Senior Project Oﬃ  cer Senior Procurement Oﬃ  cer Senior Quality Management Oﬃ  cer Social Worker Senior Social Worker Senior Welfare Oﬃ  cer Senior Field Oﬃ  cer Senior Client Service Oﬃ  cer\"; andCONSEQUENTIAL AMENDMENTS - (Cont'd)Second Schedule - (Cont'd)\f40\n\n L.R.O. 1998Column 1Enactments3. Statutory Boards (Pensions) Act, Cap. 384 - (Concl'd)Column 2Amendments (b) delete paragraphs 17 and 21.2. In the Second Schedule (a) insert immediately after paragraph 16 the following:    \"16A. The Rural and Urban Development  Commission (established by the Rural and Urban  Development Commission Act, 2025 (Act 2025-     ).\"; and (b) deleting paragraphs 17 and 21. CONSEQUENTIAL AMENDMENTS - (Concl'd)Second Schedule - (Concl'd)"
}