{
  "bill_id": 84,
  "slug": "government-of-barbados-and-citibank-us-679-million-for-bwa",
  "title": "Government of Barbados and Citibank  US $67.9 million for BWA",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/400611e2813791c84e75a0b5c3d32419.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-03-11",
  "first_reading": "2015-03-11",
  "second_reading": "2015-03-10",
  "gazette_date": null,
  "passed_date": "2015-03-11",
  "markdown": "                                                                                                                                2015-03-05\n\nRESOLUTION NO.\n\nPARLIAMENT\n\nWHEREAS  by  section  2  of  the  Special  Loans  Act,  Cap.  105  the  Government\n\nis  authorised  from  time  to  time  to  borrow  from  any  bank,  corporation,  company  or\n\nother  institution  sums  of  money  not  exceeding  in  the  aggregate  BDS$2,500,000,000.00  on\n\nsuch  terms  as  may  be  agreed  upon  between  the  Government  and  the  lender  of\n\nany such sum of money;\n\nAND  WHEREAS  by  section  3  of  the  said Act  it  is  provided  that  any  money\n\nborrowed  under  the  authority  of  the  Act  shall  be  appropriated  and  applied  to  such\n\npurposes  as  Parliament  may  approve  by  resolution  and  that  such  money  and  any\n\ninterest  payable  thereon  is  charged  upon  the  general  revenues  and  assets  of  Barbados;\n\nAND  WHEREAS  the  Government  considers  it  necessary  to  borrow  the  sum  of\n\nUS$67.9  million  from  Citibank  N.A.  the  proceeds  of  which  will  be  on-lent  to  the\n\nBarbados  Water Authority  to  ﬁ nance  its  Smart  Meter  Project  on  the  terms  and  conditions\n\ncontained  in  the  Agreement,  the  main  provisions  of  which  are  set  out  in  the  Schedule;\n\nAND  WHEREAS  the  said  sum  of  US$67.9  million  is  within  the  authorised\n\nborrowing limit given to the Government under section 2 of the said Act;\n\n\f2\n\n  RESOLVED  therefore  that  Parliament  approve  the  borrowing  of  the\n\nsaid sum of US$67.9 million from Citibank N.A. the proceeds of which will be on-lent to the\n\nBarbados  Water  Authority  to  finance  its  Smart  Meter  Project  on  the  terms  and\n\nconditions set out in the Schedule.\n\nAPPROVED  by  the  House  of  Assembly  this                                      day  of\n\n                                                , 2015.\n\nSpeaker\n\nAPPROVED  by  the  Senate  this                      day  of                                                                  ,\n\n2015.\n\nPresident\n\n\f3\n\nSCHEDULE\n\nTERMS AND CONDITIONS\n\nCiti\n\nGovernment of Barbados\n\nCitibank N.A. and other lenders to be determined by the Arranger.\n\nArranger:\n\nBorrower:\n\nLender:\n\nFacility Agent:\n\nCitibank N.A\n\nCanadian Policy Agent:\n\nCiti Trust Company Canada\n\nExecuting Agency:\n\nBarbados Water Authority\n\nFacility Type:\n\nTerm loan beneﬁ tting from 95% cover under the Export Development\nCanada  (EDC)  Non-Honoring  of  Sovereign  Obligations  insurance\nprogramme.\n\nFacility Amount:\n\nUS$67.9 million\n\nPurpose:\n\nTo ﬁ nance the Barbados Water Authority's Smart Meter Project.\n\nAvailability Period:\n\nThree (3) years, or as otherwise approved by EDC and Citi.\n\nRepayment Period:\n\nInterest Period:\n\nInterest Rate:\n\nPrincipal will be repaid over nine (9) years in eighteen (18) consecutive\napproximately equal semi-annual installments in arrears, with the ﬁ rst\nrepayment to be made within no more than six (6) months following\nthe end of the availability period, or when fully disbursed, whichever\nis earlier.\n\nInterest and the Lender's commitment fee will be payable semi-annually\nand shall be computed on a 360 day basis and the actual number of\ndays elapsed.\n\n6 month USD LIBOR plus a margin of 155 bps per annum (weighted\naverage).\n\n\f4\n\nEDC Premium:\n\nEstimated at USD 9.3 million.  The Premium is based on the transaction\nparameters and is subject to change if any of the parameters change.\nAll premiums received by EDC are non-refundable.\n\nCommitment Fee:\n\n0.62% per annum\n\nStructuring Rate:\n\nNon-refundable up-front fee of 1.75% of the facility amount.\n\nFacility Agent Fee:\n\nA one-time acceptance fee of up to US$10 000.  An annual administration\nfee  of  US$50  000  during  the  availability  period  and  US$40  000\nduring the repayment period.\n\nCanadian Policy Agent Fee:\n\nAn annual administration fee of US$10 000.\n\nCancellation Fee:\n\nUS$500 000\n\nOptional prepayment:\n\nTaxation:\n\nIncreased costs:\n\nPrepayment  shall  be  permitted  without  penalty  on  the  last  day\nof  each  interest  period  (an  interest  payment  date)  provided  that\nadvance  notice  of  the  prepayment  is  provided  to  the Agent  (exact\namount  of  advance  notice  required  to  be  determined)  and\nprovided that the Borrower shall be responsible for payment of any\nminimum  fee  due  to  EDC  as  consideration  for  the  issuance  of  the\nproposed coverage.  The Borrower will bear all costs related to the\nprepayment of an advance prior to the last day of its interest period.\nAny  swap  breakage  costs,  embedded  hedge  unwinding  costs  or\nmake  whole  premiums  are  the  sole  responsibility  of  the  Borrower.\n\nAll payments in respect of the Facility will be made free and clear of any\npresent or future taxes, withholdings or other deductions whatsoever\n(other than income taxes in the jurisdiction of the Lender's applicable\nlending  ofﬁ ce).   The  Borrower  will  indemnify  the  Lenders  and  the\nAgent for such taxes paid by the Lenders or the Agent.\n\nThe Borrower will reimburse the Lenders for any increased costs arising\nfrom increased liquidity costs, reserve requirements, capital adequacy\nprotection,  indemniﬁ cation,  break  funding  costs,  withholding,  any\nchange  in  law,  or  compliance  with  any  other  requests  from  or\nrequirement of any central bank or other ﬁ scal, monetary or other authority.\n\n\f5\n\nConditions Precedent:\n\nUsual  and  customary  for  this  type  of  transaction  including  but  not\nlimited to\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(g)\n\nthe submission by the Borrower to the Facility Agent of a Notice\nof Borrowing to be delivered on or before the date that is 90\ndays after the date of the Agreement;\n\nduly executed and delivered transaction documents that are fully\neffective;\n\nall  authorisations  connected  with  the  project,  the  execution,\ndelivery and performance of the Finance Documents shall be\nobtained by the Borrower;\n\nthe provision by the Borrower of all governmental, ministerial\nand other regulatory approvals or consents as may be required;\n\nthe  successful  preparation,  negotiation  and  execution  of  all\nnecessary legal documentation to the Lenders satisfaction;\n\nreceipt of legal opinions in form and substance satisfactory to\nthe Lenders, including the opinion of the Solicitor General of\nBarbados;\n\nthe  absence  in  the  Lenders  opinion  of  any  material  adverse\nchange in the ﬁ nancial, economic or political environment of\nBarbados;\n\n(h)\n\nall representations and warranties are true and correct;\n\n(i)\n\nall fees due prior to disbursement have been paid;\n\n(j)\n\nall other required approvals have been obtained.\n\n\fEvents of Default:\n\n# 6\n\nNotwithstanding  any  other  provision  herein  contained,  any  sum\nadvanced with all unpaid interest thereon shall become immediately\npayable to the Lender upon the happenings of the following:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nif  any  principal  or  interest  payment  due  by  the  Borrower  is\nnot paid on that date ﬁ xed for the payment thereof as per the\nFacility Agreement;\n\nif the Borrower shall default in the performance or observance\nof  any  of  the  terms  and  covenants  contained  in  the  Facility\nAgreement;\n\nif any representation or warranty given hereunder shall prove\nto be untrue or incorrect in any respect;\n\nif the Borrower ceases to be a member in good standing with\nthe International Monetary Fund and ceases to be entitled to the\ngeneral resources thereof.\n\nGoverning law:\n\nState of New York.\n\n\f7\n\nADDENDUM\n\nThis Resolution seeks the approval of Parliament for the borrowing of US$67.9 million, a\n\nsum which is within the limit of the Special Loans Act, Cap. 105, from Citibank N.A.\n\nThe proceeds of the loan will be on-lent to the Barbados Water Authority to ﬁ nance the\n\nBarbados Water Authority Smart Meter Project.\n\n"
}