{
  "bill_id": 90,
  "slug": "supplementary-estimates-no8-20142015",
  "title": "Supplementary Estimates No.8 2014-2015",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/8aa57f207b602d295878e24cb1e330a4.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2015-03-20",
  "first_reading": null,
  "second_reading": null,
  "gazette_date": null,
  "passed_date": "2015-03-20",
  "markdown": "HOUSE OF ASSEMBLY\nResolved that the sum of THIRTY-FOUR MILLION FIVE HUNDRED AND THIRTY-NINE THOUSAND SEVEN HUNDRED AND NINETY-NINE DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2014-2015 as shown in the Supplementary Estimates No.8 2014-2015 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2014 — 2015 No.8\nHEAD Code Provision in Number Approved Estimates 2014 - 2015 Other Expenditure HEAD: 40 MINISTRY OF TRANSPORT AND WORKS Program: 516 Public Transportation Services Subprogram: 0524 Provision for Traffic and 405160524 Street Lighting Account Code: 207Utilities 5,000,000 Program: 517 Transport Subprogram: 0527 Transport Board Subsidy 405170527 Account Code: 313 Subsidies 20,000,000 HEAD: 75 MINISTRY OF HOUSING, LANDS AND RURAL DEVELOPMENT Program: 520 Housing Program Subprogram: 0533 National Housing 755200533 Corporation Account Code: 316 Grants to Public Institution 7,195,727\nProvision in Supplementary Supplementary Provision Estimates Required No. 1-7\nOther Other Expenditure Expenditure\n3,500,000\n20,000,000\n8,709,022\nProgram: 522 Land and Property Acquisition and Management Program Subprogram: 0539 Property Management Account Code: 208 Rental of Property Account Code: 211 Maintenance of Property 755220539 51,402,957 9,046,760 2,062,000 268,777\nADDENDUM\nProgram 517 - Transport Subprogram 0527 - Transport Board Subsidy Code 405170527 Account Code 313 - Subsidies: $20,000,000\nThe sum of twenty million dollars ($20,000,000) is required to service debt payments, pay outstanding amounts owed to creditors, meet the costs of severance to workers and further operational requirements for the remainder of the financial year 2014-2015.\nProgram 516 - Public Transportation Services Sub program 0524 - Provision for Traffic and Street Lighting Code 40 516 0524 Account Code 207 (Utilities) - $3,500,000\nThe sum of three million, five hundred thousand dollars ($3,500,000) is required to assist with the paying of arrears for traffic and street lighting.\nADDENDUM\nHEAD 75 Ministry of Housing, Lands and Rural Development PROGRAMME 520 Housing Programme SUB-PROGRAMME 0533 National Housing Corporation ACCOUNT CODE 316 Grants to Public Institutions $8,709,022 Supplementary provision required to cover the outstanding debt due to Barrack Construction Limited. HEAD 75 Ministry of Housing, Lands and Rural Development PROGRAMME 522 Land and Property Acquisition & Management Programme SUB-PROGRAMME 0539 Property Management\nACCOUNT CODE 211 Maintenance of Property $268,777\nSupplementary provision required to cover the cost of maintenance for the Warrens Office Complex.\nHEAD 75 Ministry of Housing, Lands and Rural Development PROGRAMME 522 Land and Property Acquisition & Management Programme\nSUB-PROGRAMME 0539 Property Management\nACCOUNT CODE 208\nRental of Property\n$2,062,000\nSupplementary provision is required to cover the rental of property at the Warrens Office Complex.\n"
}