{
  "bill_id": 91,
  "slug": "supplementary-estimates-no9-20142015",
  "title": "Supplementary Estimates No.9 2014-2015",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/8aacf5d834b7eaf339961431220336bd.pdf",
  "current_stage": "Passed",
  "chamber": "House of Assembly",
  "notice_date": "2015-03-20",
  "first_reading": null,
  "second_reading": null,
  "gazette_date": null,
  "passed_date": "2015-03-20",
  "markdown": "HOUSE OF ASSEMBLY\nResolved that the sum of TWENTY-SIX MILLION NINE HUNDRED AND TWELVE THOUSAND EIGHT HUNDRED AND SIXTY-NINE DOLLARS be granted from the Consolidated Fund and be placed at the disposal of the Government to supplement the Estimates 2014-2015 as shown in the Supplementary Estimates No.9 2014-2015 which form the Schedule to this Resolution.\nSpeaker\nSCHEDULE\nSupplementary Estimates 2014 — 2015 No.9\nHEAD Code Provision in Provision in Supplementary Number Approved Supplementary Provision Estimates Estimates Required 2014 - 2015 No. 1-8 Other Other Other Expenditure Expenditure Expenditure HEAD: 13 PRIME MINISTER’S OFFICE Program: 114 Energy and Natural Resources Subprogram: 0154 Natural Resources 131140154 Department Account Code: 212 Operating Expenses 49,620 HEAD: 77 MINISTRY OF EDUCATION, SCIENCE, TECHNOLOGY AND INNOVATION Program: 273 Tertiary Subprogram: 0284 University of the West Indies 772730284 Account Code:316 Grants to Public Institutions 71,300,000 1,912,869 25,000,000\nADDENDUM\nHEAD 13: PRIME MINISTER’S OFFICE\nThe Prime Minister’s Office is seeking the sum of $1,912,869 to supplement the Estimates of Expenditure for the financial year 2014-2015 as follows:\nProgram 114:\nEnergy and Natural Resources\nSubprogram 0154: Natural Resources Department\nAccount Code 212: Operating Expenses\nThe sum of $1,912,869 is required to cover payment of royalties to landowners for part of the financial year 2013-2014 and 2014-2015.\nADDENDUM\nProgramme 273: Tertiary\nSubprogramme 0284: University of the West Indies Account Code 316: Grants to Public institutions -\n$25,000,000\nTo meet the economic costs due to the University of the West Indies.\n"
}