{
  "bill_id": 97,
  "slug": "lease-to-barbados-port-inc-land-at-trevor-way-bridgetown",
  "title": "Lease to Barbados Port Inc., Land at Trevor Way, Bridgetown",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/a55894d36bce30ca73b4bea46b82af52.pdf",
  "current_stage": "",
  "chamber": "House of Assembly",
  "notice_date": "2015-05-04",
  "first_reading": null,
  "second_reading": null,
  "gazette_date": null,
  "passed_date": null,
  "markdown": "PARLIAMENT\nRESOLVED that Parliament in accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, approve the lease to the Barbados Port Inc. of the parcel of Jand, the property of the Crown, situate in the waters off Trevor’s Way, Princess Alice Highway, in the city of Bridgetown, in the parish of Saint Michael, in this Island, more particularly described in the First Schedule to this Resolution, on the terms and conditions set out in the Second Schedule hereto, for the construction of a cruise ship pier and ancillary facilities.\nAPPROVED by the House of Assembly this\nday of\n» TWo\nthousand and fifteen.\nSpeaker\nAPPROVED by the Senate this\nday of\n, Two\nthousand and fifteen.\nPresident\nFIRST SCHEDULE\nALL THAT land (presently seabed) the property of the Crown situate in the waters off Trevor’s Way, Princess Alice Highway, in the City of Bridgetown, in the parish of Saint Michael, in this {sland containing by admeasurement 13.8 hectares or thereabouts Abutting and Bounding on lands now or formerly of the Barbados Government known as “Trevor’s Way Park”, on Jands now or formerly of the Barbados Government known as the “Bridgetown Fisheries Complex” and the Fisheries Complex Inner Basin, on the sea on two sides or however else the same may abut and bound as shown and delineated on a plan certified on the 5\" day of June, 2014 by Derek C. Franklin, Land Surveyor and recorded in the Lands and Surveys Department on the 22\" day of July, 2014 as Plan No. 643/2014.\nSECOND SCHEDULE\nTERMS AND CONDITIONS:\n1. The lease shall be for a term of fifty-one (51) years with an option to renew for a further forty-nine (49) years.\n. The initial rent shall be $20 000.00 per annum payable in advance.\nThe rent shall be subject to review every ten (10) years and at the first rent review, the rent shall increase to $40 000.00 per annum. Thereafter, the rent shall be reviewed upward only in the sum of $40 000.00 per annum, plus ten percent (10%) of the average gross annual rental income received as land rent for the ten (10) years immediately preceding the rent review.\nThe Lessee shall be responsible for all outgoings, inclusive of land taxes and municipal solid waste tax, arising from its use of the land.\nThe Lessee shall be solely responsible for the cost of development of the site.\nThe Lessee shall comply with the Town and Country Planning Act, Cap. 240, the Coastal Zone Management Act, Cap. 394 and all other statutory requirements throughout the term.\nSave and except as otherwise provided for in the lease, the Lessee shall not sublet or otherwise part with possession of the demised premises, in part or in full, for any period exceeding ten (10) years, without first obtaining the Lessor’s written permission and such permission shall not be unreasonably withheld.\nThe Lessee may, however, sublet to the Special Purpose Vehicle for a term of up to forty- nine (49) years with an option to renew for a further forty-nine (49) years.\nThe Lessee shall insure and keep insured against the usual perils, in the joint names of the Lessor and the Lessee, at all times throughout the term, all buildings and facilities erected on the demised premises against loss or damage at the full reinstatement value.\nThe Lessee shal! keep the Lessor indemnified against all loss arising from its use of the premises.\npremises.\n. The Lessee shall insure against public liability with a reputable insurance company in the sum of no less than $50 million for claims arising out of a single incident, in the joint names of the Lessor and the Lessee.\nnames of the Lessor and the Lessee.\n12. The Lessee shall ensure that there is no hindrance to the flow of storm-water from the existing storm-water drains at the Pelican Village Complex and the Bridgetown Fisheries Complex respectively, during or after the reclamation works.\n. The Lessee shall be authorised to enter onto Crown lands (the seabed) adjacent to the demised site, for the purposes of dredging and kecping the area safe for maritime navigation.\n14, The Lessee shall be authorised to enter onto Crown lands (the sea defence structures and drainage facilities) adjacent to the demised site, for the purposes of amending, reclaiming and connecting to the demised site.\nand connecting to the demised site.\n. Where works are carried out on adjoining Crown lands, the Lessee shall be responsible for the maintenance of these works throughout the term.\n16. The hatched area on the plan which is adjacent to the site occupied by the Bridgetown Fisheries Complex, shall not be further sublet, utilised or developed without the specific. written permission of the Minister responsible for Lands in his sole discretion.\n17. At the end of the lease or its sooner determination, the premises, with improvements, shall pass to the Crown for nil consideration.\nADDENDUM\nOn the 19\" day of June, 2014, the Cabinet agreed that approximately 15 hectares of land situate in the waters off Trevor’s Way, Princess Alice Highway, in the city of Bridgetown, in the parish of Saint Michael, consisting of 13.8 hectares presently in seabed and described in the First Schedule hereto and 1.4305 hectares of land respectively, should be leased to the Barbados Port Inc. and that the Lease shall be subject to the terms and conditions set out in the Second Schedule.\nThe said portion consisting of 1.4305 hectares is not made the subject of this Resolution, as it is contained in the Schedule of parcels of land to be leased to the Barbados Port Inc. under the provisions of the Barbados Port Inc. (Transfer of Management and Vesting of Assets) Act, Cap. 285B.\nIn accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is now sought for the lease to the Barbados Port Inc. of the parcel of land, more particularly described in the First Schedule to this Resolution, on the terms and conditions set out in the Second Schedule hereto, for the construction of a cruise ship pier and ancillary facilities.\n"
}