{
  "bill_id": 98,
  "slug": "lease-to-the-rotary-club-of-barbados-land-at-garfield-sobers-complex",
  "title": "Lease to the Rotary Club of Barbados Land at Garfield Sobers Complex",
  "pdf_url": "https://www.barbadosparliament.com/uploads/bill_resolution/9e2e6b732ad1290c4fa48734cfa1ff9b.pdf",
  "current_stage": "Passed",
  "chamber": "The Senate",
  "notice_date": "2015-06-23",
  "first_reading": "2015-06-23",
  "second_reading": null,
  "gazette_date": null,
  "passed_date": "2015-07-08",
  "markdown": "PARLIAMENT\nRESOLVED that Parliament, in accordance with section 5(1)(c) of the Crown Lands (Vesting and Disposal) Act, Cap. 225, approve the lease to the Rotary Club of Barbados South of the parcel of land situate at the Garfield Sobers Sports Complex, Upton in the parish of Christ Church, in this Island, more particularly described in the First Schedule to this Resolution on the fas and conditions set out in the Second Schedule to this Resolution for the construction and development of a recreational facility for children with disabilities.\nAPPROVED by the House of Assembly this\nday of\n, Two thousand and fifteen.\nSpeaker\nAPPROVED by the Senate this\nday of\nTwo thousand and fifteen.\nPresident\nFIRST SCHEDULE\nLAND\nALL THAT the property of the Crown situate at Upton in the parish of Christ Church, in this Island containing by admeasurement 2322.6 square metres or thereabouts (inclusive of 65.5 square metres in road reserve and 439.1 square metres in drainage reserve) Abutting and Boards on lands of the Barbados Government (Garfield Sobers Complex) on lands now or late of Donald Marshall (being Lot B) on lands now or late of Mary Jordan (being Lot A) on other lands of the Barbados Government (Garfield Sobers Complex) on the public road leading to Highway R in one direction and to the Aquatic Centre in the other direction or however else the same may abut and bound as shown and delineated on a Plan certified on the 9\" day of May, 2013 by Samuel N. Taylor, Land Surveyor and recorded in the Lands and Surveys Department on the 2™ day of September, 2013, as Plan No. 846/2013.\nSECOND SCHEDULE\nTERMS AND CONDITIONS: |\n(a) The Lease shall be for a period of twenty-five (25) years with an option to renew for a further term;\n(b) The rent shall be of $1,000.00 per annum and subject to a rent review every five (5) years;\n(c) The Lessee shall in respect of any construction or development of the land which would be subject to the Zown and Country Planning Act, Cap. 240, comply with the requirements of the Chief Town Planner, and where relevant other statutory requirements;\n(d) The Lessee shall be responsible for\n(i) the payment of insurance premiums, land tax, utilities and other outgoings arising out of the use of the site;\n(ii) the cost of development of the site; and\n(iii) repairs and maintenance of the buildings;\nAtthe end of the lease period or its sooner determination all buildings, structures and other facilities and improvements made thereto, regardless of the stage of construction, shall revert to the Crown for nil consideration.\n(e)\nADDENDUM\nThe Cabinet at its meeting held on the 8\" day of March, 2012 agreed that 25,000 square feet (2322.6 square metres) of land at the Garfield Sobers Sports Complex, Upton in the parish of Christ Church in this Island should be leased to the Rotary Club of Barbados South to create a recreational facility for children with disabilities.\nIn accordance with section 5 of the Crown Lands (Vesting and Disposal) Act, Cap. 225, the approval of Parliament is now sought for the lease to the Rotary Club of Barbados South of the parcel of land described in the First Schedule to this Resolution, subject to the terms and conditions set out in the Second Schedule to this Resolution.\nLANDS AND SURVEYS DEPARTMENT\nwees . Parish of: Christ 5/2013 EL ts gags © frown couNTRY DErelUFwE PLAMESENG CEFN No: 0303/07 | iscttlos [eee a apeRQVED F dealilee = a, | Now or Formerly | Mary Jordan ' Donaid Marshall I i 3 j 3c ' is (Lo! 8) {Lot A) 1 ' | Land Tax #: 21.12.63.006 | ihe 2! Land Tox #: 81.12.03.097 8 1 1 : A « ° Tyas = a pat nant? 26.46 ~ _ sa 7 wd oe the Barbades Government Se \\ Other Lands of The Borbados Government (Garfield Sobers Complex) (Garfield Sobers Complex) Land Tox #: 81.12.05.001 Lond Tax g: 81.12.08.001\nSurvey Order No: 5/2013 Correspondence No: 0303/07\n0\nNorte\n| |\nCr\nRelerence plans by\nN. Lucas certified 18th April 1997 ond recorded as 0. L. S. f 79/98\nBarbados\nPLAN OF LAND — (bordered green, town on blue}\n. - at UPTON, CHRIST. CHURCH!\nSCALE\n1:50\nDistances are in metre. Beorings ore referred ta Grid North derived from O LS Control 12260 &\nLine | Azimut® Olssense a pes) 15? cd [3527 55) 192\ncontaining Land... IS'B.0 sq.m. (qraen} yom (brawn) Drainage Reserve... (blue) fotal\n© donates aren found unless atherwise stated\nCU Cscat Us tra)\n#9 denoles nasi in x pul\n* denotes -omputed poin\nsurveyed for MINISTRY OF HOUSING, LANDS.\nLand Tox\n#\nPart of 81120001\n& RURAL DLVELOPMFNE\n——\nfor Lands and Surveys Dept only\ncertified\nSth\nMay,\nSamuel Wo Taylor land Surveyor\n"
}